{"id": "Chelsea 3-1 Crystal Palace: Alvaro Morata is the top striker the Blues need - Ruud Gullit", "paragraph": "By Ruud GullitMOTD2 pundit and former Chelsea managerShare this withChelsea striker Alvaro Morata gets criticised a lot but he showed with his goals against Crystal Palace what he can do when he gets the right service.I have heard a lot of people say that this Chelsea team is missing a top-class striker, but they have one in the 26-year-old Spain international - they just need to use him in the right way.The way they play would make it difficult for any centre-forward to be prolific, so I don't think it is fair to say that the reason Morata has struggled for goals since his £60m move from Real Madrid in 2017 is all his fault.\n                            Media playback is not supported on this device\n                        As we saw in Sunday's win over Palace, Morata comes alive when the ball comes into the box and, to get the best out of him, you need to put crosses in.And if you give Morata that service he will do well - we saw that at Juventus and Real and, even at Chelsea, he scored more headers in the Premier League last season than any other player despite having a difficult season.But, under Maurizio Sarri, Chelsea don't seem to want to attack that way.Yes, the statistics show they have made plenty of crosses this season but when you watch them you can see that their first intention is always to attack through the middle.Their wide attackers - Eden Hazard, Willian or Pedro - like to dribble inside and hold on to the ball, and Morata does not know where to go. There is no space left for him.When I watched them against Palace, Chelsea did not look to cross the ball immediately when they got in a position where they could do, even if it was the best time from an attacking point of view. Instead they did it eventually, if there was no other possibility left.There was a good example of this in the first half when Marcos Alonso did not cross despite having enough time and space, and Morata was waiting in the Palace area.Instead Alonso waited and played the ball back so Chelsea could try and build something down the centre of the pitch.That is great for, say, Willian, Hazard or Pedro - but it is a nightmare for a striker like Morata.He needs that cross to be played in quickly because he is reacting to it. Instead, he makes his move forward but the ball does not come.When that keeps happening, it is easy to get lost. But when a cross did come against Palace, he was there to score the first goal, and his second of the game was a typical striker's goal from another ball into the box.Hopefully this performance will give him the confidence boost he needs. The only thing he did wrong in the game was when he missed the chance to get his hat-trick when he ran clear at the end.He had so much time, and was in a great position - and then by looking down at the ball, he as good as phoned the goalkeeper and said \"hello, I am going to chip it... now\" so the goalkeeper knew immediately what he was going to do.Last season, the then Chelsea manager Antonio Conte loved to play on the counter-attack and Morata is not the quickest player.He missed a few good chances and lost a lot of confidence - even his current manager described him as \"fragile\" after Sunday's game.But his record for the Blues is still good, especially when you consider he does not play all the time, and also the way they are set up.Whether it is Morata or Giroud in the team, it is a difficult task to play centre-forward for Chelsea, and get goals.Their attack under new boss Sarri is not focused around their striker scoring, whoever it is. Instead it seems to be about what Hazard, Willian or Pedro can do.I can understand that approach if they want someone up front just to hold the ball up, like Giroud can do, but it would benefit the whole team if they played to their striker's strengths in front of goal rather than just what they can offer outside the box.Of course it is great to have exciting forward players like Hazard, Willian or Pedro who have the ability to run at defences and cut inside, but you need variety - don't do it all the time.At the moment, Chelsea are a little bit predictable. If all you do is cut inside and come down the middle, which is what they did for a long spell in the first half against Palace before they scored from a cross, it is easier to stop them.Of course, Chelsea can rely on the brilliance of Hazard to get them out of jail sometimes. That is what happened when he came on in the second half and made the difference against the Eagles.One of the other criticisms that is thrown at Sarri's side is that they rely on the Belgian too much.They managed pretty well without him in their win over Burnley last week but, on Sunday, they needed him to give them that little extra and take the points.But even with Hazard in the side, I don't look at Chelsea and see a side that can win the title. Manchester City are better than them, and Liverpool are further ahead too.As well as improving in attack, I think Chelsea need to do a little bit more when they don't have the ball.They sometimes back off a little bit and it gives the opposition the possibility to get out - they need to get better at penning teams in.But you have to remember this is Sarri's first season and I am surprised he has done so well, so quickly. The most important thing I have noticed is that the players are enjoying themselves playing under him, and I am looking forward to seeing what this team does next.Ruud Gullit was speaking to BBC Sport's Chris Bevan.Share this with            Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.The latest rumours and stories from around the world of football.Analysis and opinion from our chief football writer.How to get into football - the most popular sport in the world, with clubs and facilities throughout the UK.Are any of these bizarre music myths true or false?Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}