{"id": "Financial Fair Play: Uefa would consider reopening investigations on 'case-by-case' basis", "paragraph": "Share this withUefa will reopen Financial Fair Play (FFP) investigations \"on a case-by-case basis\" if there is evidence of \"abuse\".FFP 'break-even' rules require clubs to balance spending with their revenue.Last week, German news magazine Der Spiegel claimed Manchester City and Paris St-Germain overvalued sponsorship deals to help meet the rules.European football's governing body said \"if new information comes to light\" relating to previous cases, it \"will use that to challenge the figures\". City have said they will not comment on Der Spiegel's claims, apart from to describe them as an \"organised and clear\" attempt to damage their reputation.French champions PSG have been contacted for a response.It its statement, Uefa said it could \"test the information it receives\" but \"it relies on that information being fair and accurate reflections of a club's finances\".It added: \"Seven years ago, European clubs had a cumulative debt of 1.7bn euros (£1.5bn). Last year it was a profit of 600m euros (£525m). Without question, FFP has been a success for the game across Europe.\"It relies on the co-operation of clubs to declare a complete and genuine financial position.\"Should new information suggest that previously concluded cases have been abused, those cases may be capable of being reopened as determined on a case-by-case basis.\"This approach is applied universally to all clubs that apply for a Uefa licence and participate in European club competitions.\" In its reporting based on leaked documents, Der Spiegel also said the clubs negotiated with Fifa president Gianni Infantino, who was then general secretary of Uefa, to agree reduced punishments on FFP breaches.Uefa found City had breached FFP rules in 2014 and the two parties reached a settlement, with City paying a £49m fine - £32m of which was suspended - while their Champions League squad was reduced for 2014-15.Der Spiegel called the settlements \"weak\" and claimed Uefa \"wasn't even entirely aware of the degree to which it had been deceived\".Share this with            Are any of these bizarre music myths true or false?Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.The latest rumours and stories from around the world of football.Analysis and opinion from our chief football writer.How to get into football - the most popular sport in the world, with clubs and facilities throughout the UK.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}