{"id": "'Canada is the most multicultural country in the world'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowSyed Najam Hassan is 42 years old and lives in Alberta, Canada. He set up his first free public library on his front lawn in Calgary three months ago. Today there are libraries in seven different locations in Alberta with hundreds of people visiting each one each day. Syed's aim: \"To bring different cultures together\" inspired by their love of reading. Syed was born in Pakistan and moved with his family to Canada from Saudi Arabia in 2009.He's received support from the organization Love with Humanity, his family and the local community.\"My 12-year-old son, 16-year-old daughter and 18-year-old daughter have given me their pocket money in order to help me to do this\" he said.The books are written in 40 different languages and Syed has been collecting them for more than six years.\"The premise is you take a book and you return it later.\"The libraries are currently situated in Calgary, Airdrie, Cochrane and Chestermere. Speaking about his aim Syed said: \"I've always wanted to do things for people.\"I love the thought of different cultures coming together.\"Canada is the most multicultural country in the world.we have successfully launched our Multicultural Mini Free Public Library at Our 6th Location at town of Cochrane.Thank you each and everyone to participant this event and special thanks to Mayor Jeff Genung and Council of Cochrane. pic.twitter.com/OwrS9xVPLsEnd of Twitter post  by @lovewhumanity\"It's big hit. People love this idea\" said Syed. \"Even the prime minister of Canada.LOVE WITH HUMANITY ASSOCIATION” would like to thank honourable Prime Minister of Canada Justin Trudeau appreciate our services to the community and providing us with the ‘Special Recognition Award’ in recognition of our First Multicultural Free Public Outdoor Library in Canada pic.twitter.com/6KPIXDFc8vEnd of Twitter post 2 by @lovewhumanity\"People from different cultures are sharing their love of books in easily accessible places. \"It's something I've always wanted to do.\"Opening Ceremony of First Multicultural Mini Free Public Outdoor library now Our 6th Location at town of Cochrane.\nDate:...End of Facebook post  by SyedBy Victoria Park, UGC and social newsFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}