{"id": "Stephen King horror adaptation to be filmed in Tredegar", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowA Stephen King story is set to be turned into a film in Tredegar - adding to its growing reputation for supernatural and horror movies.The Stationary Bike, published by The Shining and Misery author in 2003, will be adapted for the screen and filmed around the town.Blaenau Gwent Film Academy said gaining King's permission was \"a great scoop\".A similar deal helped pave the way for a young filmmaker to direct critically-acclaimed The Shawshank Redemption.The news follows a local production company winning awards for Polish-Welsh film The Bench while a \"blood splattered\" horror has just been completed, which has its first screening over Halloween.\"Being given an opportunity to bring one of Stephen King's novels to life is crazy,\" said 16-year-old Alfie Evans who will work on the script along with GCSE drama student Cerys Cliff, 14.Set up in 2017, the not-for-profit film academy aims to train hundreds of youngsters a year in script writing, filming and editing to turn the area into a creative hub.The Stationary Bike is about an artist cycling to lose weight after being told he has dangerously high cholesterol and entering a trance, where he experiences nightmarish scenarios.After writing to King, his officials wrote back and offered the academy a Dollar Baby contract to produce a film version.This is where permission is given in return for US $1.King previously explained: \"Around 1977 or so, when I started having some popular success, I saw a way to give back a little of the joy the movies had given me.\"While he is believed to watch them all, because they are not meant to be sold commercially, only about 10 are known to have been made between 1977 and 1996.Since 2000, King has granted permission for a number to be released.Budgets have ranged from $100 (£75) to $60,000 (£45,475), with the exposure seen as providing a huge career springboard.For example, Frank Darabont made The Woman in the Room on a Dollar Baby contract, aged 20 in 1986.On the back of this, he directed the critically acclaimed Stephen King films The Green Mile and The Shawshank Redemption. The Blaenau Gwent Film Academy's first production - Knight of the Blood Moon - has just been finished after costing £10,000 and taking local youngsters five months to write, film and edit.Tutor Kevin Phillips called it a \"blood splattering feast\", adding: \"Likable characters will have you rooting for their survival in this blood bath of mayhem.\"With no escape, a monster with no remorse, no pity, and a craving for blood is upon them, a vicious game of cat and mouse begins.\"It will have its premiere in Tredegar's Little Theatre over Halloween while it has been entered in a number of film festivals.The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}