{"id": "Alex McLeish: Scotland players will be 'wrapped in cotton wool' for Israel test", "paragraph": "Share this withAlex McLeish will have Scotland's players \"wrapped in cotton wool\" to prevent further injuries as they host Israel after thumping Albania 4-0.The Scotland head coach suffered nine call-offs ahead of the win in Shkoder.But the win means his side can make the Nations League play-offs and move up to League B with another win on Tuesday.\"The guys are now on recovery mode,\" McLeish said. \"One or two guys have tightness. Let's hope it wears off and it doesn't rule them out.\"Ending a run of three consecutive away defeats - their first win in four on the road - ensured that Scotland cannot now be relegated to League D from the three-team group.But McLeish, who has now enjoyed three victories in nine games since taking over as national boss for a second time in February, insists he did not feel under pressure.\"I'm only just starting the job,\" he said after what he described as a \"magnificent\" performance. \"That's three competitive games we've played and it really feels like a start.\"We've played a lot of friendly games, taken on some toughies, but we're not shouting about anything yet.\"Having beaten Scotland in the reverse fixture, Israel only need a point at Hampden to top the group and win promotion.\"We know we have a very hard game against a team that's been in good form recently,\" McLeish said.\"We go back tonight in the small hours then we'll take stock.\"We had a lot of call offs. We called John Fleck in as you know and we will get these guys wrapped in cotton wool for Tuesday night.\"Ryan Fraser put McLeish's side in the lead with his first international goal before Mergim Mavraj was sent off - and James Forrest scored his first two Scotland goals, while Steven Fletcher slotted in a penalty on his return to the side.\"Ryan Fraser has been playing very high level at Bournemouth since the start of the season, but we've not been able to get him in the team for the qualification games,\" McLeish said. \"Tonight, we got Ryan in and you see what he's been doing the whole season.\"James has continued his great form. In the second half, he was fantastic.\"We knew watching the game that Steven Fletcher has been managing his body for the last few months having been out for a few months and he was a greater leader of the line for us tonight.\"McLeish thought the win would inject \"confidence and belief\" into his squad.\"We have set ourselves up, and Israel have set themselves up, so it should be a good game,\" he added.\"We've got them on home soil. Let's hope there is a great response from the Tartan Army and we'd love to see them come and cheer the guys to victory.\"If we play at that level, we have a good chance.\"Share this withAberdeen director Dave Cormack has a big vision for his hometown club, one which includes Californian kids wearing the club's kit.The story of Robert Rowan, who died aged 28 on Tuesday after living his dream in football after compiling dossiers on the 2009 Champions League final.After beating Albania on Saturday night, what now for Scotland's Nations League hopes with a game to go?Four strikers, just 10 goals. So who should Scotland manager Alex McLeish start in the Nations League games with Albania and Israel? Review the contenders and choose your favourite.The transfer window might not be open, but Celtic have signed Ettore 'Ettorito97' Giannuzzi and Luca 'ildistruttore-44' Tubelli... for their esports team.Stuart Hogg will move from Glasgow Warriors to Exeter Chiefs next year. Watch the Scotland full-back's 11 Six Nations tries.Everything you need to know about following football with BBC Sport ScotlandFind ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}