{"id": "Premier League stats: Man Utd's striking options, Milner's magic 49 and super subs", "paragraph": "By Matt BullinBBC SportShare this withAnthony Martial and Marcus Rashford both scored for Manchester United on Saturday - but who should lead the line in next Sunday's Manchester derby?By looking at the key Premier League stats from the weekend, BBC Sport looks to provide the answer.We also look at Arsenal's comeback record, reveal James Milner's incredible goalscoring run and identify the league's long-range specialists.But first...That's been the question many have been asking this season, due largely to Romelu Lukaku's lack of form.The Belgium striker has not scored for United since mid-September but Martial has stepped up to the plate - scoring five goals in his past four Premier League outings.Rashford, another of Jose Mourinho's forward options, also proved his worth on Saturday, as he scored their 92nd-minute winner at Bournemouth.And who could forget about Alexis Sanchez? A once talismanic figure at Arsenal, he now struggles to hold down a starting berth at United.Well, if Mourinho wants goals, Martial is his man.The Frenchman has scored more than any of his team-mates, at the impressive rate of one every 106 minutes, and his shot conversion rate is a whopping 62.5%.By contrast, Lukaku has scored one fewer than Martial, his strikes have come at almost half the frequency and he only coverts a quarter of his shots into goals.Martial is also up there in terms of creativity. Only Sanchez has created more chances than the former Monaco man this season, although he is yet to provide an assist.So, with a tricky Champions League trip to Juventus on Wednesday and the Manchester derby on the horizon, the stats say Mourinho should put his faith in Martial.Wolves midfielder Ruben Neves scored a penalty in his side's 3-2 defeat by Tottenham on Saturday.Curiously, it was the first league goal he has scored from inside the penalty area in English football, with the Portuguese's previous seven coming from outside the box.Seven consecutive strikes from beyond the penalty area is a pretty impressive record - and only one man has ever bettered that run in the Premier League, with eight. Blackburn legend Tugay.Former Spurs and Portsmouth midfielder Pedro Mendes also makes the list; all six of his Premier League goals came from outside the box.On the other end of the scale, former Manchester United star Ruud van Nistelrooy scored 95 Premier League goals for the club. Only one of them came from outside the penalty area.When James Milner scores, he doesn't lose. Simple.The Leeds-born midfielder scored his 50th Premier League goal during his side's 1-1 draw with Arsenal on Saturday.Those 50 goals have come in 49 different games, in a career spanning nearly 16 years, and he has not lost a single one.That makes him the record-holder for that, admittedly niche, record, although he is one of five current Premier League players who make up the top 10.Interestingly, Milner's 49-game run is only second in terms of longest unbeaten streaks, though.And he has some way to go before beating Frank Lampard's 67-match spell, which came between March 2003 and January 2010.Arsenal came from a goal down to claim a deserved draw with Liverpool on Saturday, meaning they have taken eight points from losing positions this Premier League campaign. No side has managed more.So, does that reflect the Gunners' strength of character or does it simply highlight their slow starts?Well, despite the fact that fifth-placed Arsenal have won seven of their 11 games this season, they have never been ahead at the break.And if the score after the first half had remained the same at full-time in their matches, they would be sitting in 15th place.However, this trend is not Unai Emery-inspired. Last season, only Bournemouth (21) took more points from losing positions than the Gunners (15).Perhaps Arsenal's slow starts are a symptom of the previous regime that Emery is yet to remedy.West Ham striker Javier Hernandez scored West Ham's fourth goal in Saturday's 4-2 win over Burnley having come on after 61 minutes.His delightful dink over Joe Hart in injury time marked his 17th goal as a substitute in the Premier League - putting him third on the all-time list.Can you name the competition's top 14 super subs? Take our quiz and find out.  Share this with            Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}