{"id": "The tip-off from a Nazi that saved my grandparents", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowWhen Alexander Bodin Saphir's Jewish grandfather was measuring a high-ranking Nazi for a suit in Copenhagen 75 years ago he got an important tip-off - the Jews were about to be rounded up and deported. It has often been described as a \"miracle\" that most of Denmark's Jews escaped the Holocaust. Now it seems that the country's Nazi rulers deliberately sabotaged their own operation.It was a cold October night 75 years ago when my grandparents, Fanny and Raphael Bodin, stood on the dock of a harbour on the east coast of Denmark with their 15-month-old daughter, Lis, in their arms.I imagine they peered into the darkness, nervously awaiting the fisherman who would take them across the water to the safety of neutral Sweden. Until that point the Jews of Denmark - unlike those in other parts of occupied Europe - had been free to go about their business. But now the order had been given to transport them to Germany \"for processing\".So my grandparents and aunt fled. As they boarded the fishing boat they handed the fisherman a substantial sum of money for the hour-long boat trip across the Oresund - the narrow stretch of water between Denmark and Sweden. Then it started to rain and my aunt began to cry. The fisherman, fearing the Germans would hear her cries, ordered my grandparents either to leave their child on the dock or get off the boat. They chose the latter and watched as the boat cast off for Sweden with their money and perhaps their last chance of escape.Fortunately, it wasn't their last chance. They succeeded in making the crossing the very next night - after giving their daughter a sleeping pill to ensure she remained silent - and lived out the rest of the war in Sweden.Their story mirrors that of the vast majority of Danish Jews. According to Sofie Lene Bak, associate professor in history at Copenhagen University, 7,056 of them escaped to Sweden, with 472 captured and deported to Theresienstadt.This became known as the \"Miracle Rescue\" but many Danish historians now believe it was less miraculous than it seems. And my grandparents' experience provides evidence for this theory.My grandfather - usually known by his nickname, Folle - always claimed that the reason they managed to escape early in that month of miracles was because of a high-ranking German officer who came to his brother-in-law's tailor shop, N Golmanns, on Istedgade in the seedy red light district of Copenhagen. After the war my grandfather would open his own shop, R Bodin on St Kongensgade, one of the most fashionable streets in Copenhagen, but in 1943 he was still learning his craft. Together with his brother-in-law, Nathan, they would take measurements of new customers and note them down with other relevant information on A5 cards. These cards were stored in a bureau in the shop. I suspect my grandfather's hands shook as he took the measurements and fitted the suit of this particular German officer, who must have been pleased with the finished article as he then offered my grandfather and brother-in-law a warning: \"Get out, while you still can. There's a round-up coming.\" My grandfather never named the high-ranking German officer, but years later Nathan made a startling declaration to my cousin, Margit. The source of the leak that saved my Danish family was none other than Dr Karl Rudolph Werner Best - the very man who, as Germany's plenipotentiary in Denmark (and, moreover, deputy head of the SS) was in charge of ensuring that Denmark's Jews were sent to their death.So why would such a man - a member of Hitler's inner circle, known as the Butcher of Paris for his relentless pursuit of France's Jews a year before - be fraternising with Jewish tailors in the red light district of Copenhagen, much less warning them to escape? It's hard to believe.When Margit heard the story, she immediately went to the bureau which still then held pride of place in the family tailor shop. She searched for the measurement cards from 1940-1943 and rifled through to the letter B. Her heart stopped as she pulled out the card of Dr Karl Rudolph Werner Best. The measurement cards have since been lost, but the story has always fascinated me. A few years ago I started to turn it into a play, and learned then how historians have been rewriting the narrative of the miracle rescue.Dr Werner Best was a doctor of law and had an uncanny ability to bend the law in his favour. After the war he not only convinced the Danish courts to commute his death sentence to a prison sentence, but years later - when he was accused of signing the death warrants of 8,000 Poles - he managed to convince the judge that he was too sick to stand trial. The case collapsed and he lived for a further 17 years as a free man before dying of natural causes. A key priority for Best, as the Third Reich's plenipotentiary in Denmark, was to maintain the flow of agricultural goods from Denmark to Germany. Not for nothing was Denmark known as \"Germany's pantry\" and as the \"whipped cream front\" - by some estimates it supplied up to 15% of Germany's needs.To ensure this continued, political stability was essential. But in the summer of 1943 the Danish Resistance had become emboldened, and the Danish government had resigned in protest at a new policy requiring convicted saboteurs to be sentenced to death.Hitler's order to make Denmark \"free of Jews\" - Judenrein - therefore came at a bad time for Best.\"The summer of 1943 had been a blaze of sabotage, strikes and physical confrontations between Danes and Germans,\" says Sofie Lene Bak. \"Best feared for an uprising and general strikes if the Jews were targeted.\" So it seems Best set about organising the round-up of the Jews - while also simultaneously sabotaging it. When the extent of the failure of the round-up became apparent, Hitler telegrammed Best ordering him to explain himself. He responded that he had done as he had been ordered - he had made Denmark Judenrein.Credit for saving Denmark's Jews has often been handed to Georg F Duckwitz, a German naval attaché and Best's right-hand man, who leaked the date of the round-up to Hans Hedtoft of the Danish Social Democrat Party. Hedtoft in turn passed the information to the acting chief rabbi, Marcus Melchior, who told his congregation the next morning - the day before Rosh Hashanah, the Jewish New Year - that there would be no service that day. Instead everybody was to go home, sort out their affairs and find any means of escape.After the war Duckwitz became West Germany's Ambassador to Denmark (1955-58) and was declared \"Righteous Amongst Nations\" by Israel's Holocaust Memorial Center, Yad Vashem. But it's Werner Best who ultimately bears responsibility for the round-up's spectacular failure.Soldiers charged with rounding up the Jews were ordered to knock on the doors and ring the door bells of Jewish homes, but under no circumstances were they to break them down or smash windows. At least one family simply slept through it all. And when it became apparent that the primary escape route was across the Oresund, all German patrol boats on the water were ordered into harbour. They remained there for three weeks, when the bulk of the escapees were crossing to Sweden. The official explanation was that the boats needed a paint job. All of them - at the same time. \"The restraint of the Germans in Denmark is unique to the rest of occupied Europe,\" says Sofie Lene Bak. \"Not only in terms of method on the night of the raid but in terms of the limited resources used to hunt for Jews after the raid.\" None of this contradicts stories of the bravery of the Danish people, the Resistance or those who were fleeing. In 1943, Denmark's Jews and anyone helping them had a justified fear of execution. After all that's what happened in the rest of Europe, why would Denmark be any different?My grandparents and aunt spent the rest of the war in Sweden, only returning home after it was over, in June 1945. Like many others, they were welcomed home with freshly cut flowers on their tables, placed there by their Danish neighbours.A Bodin Saphir's play, Rosenbaum's Rescue, will be premiered at Park Theatre, Finsbury Park, in January 2019Margaret Nutley remembers her first meeting with a group of unfamiliar boys on the Ascot racecourse. It was autumn 1945, and they were playing football, wearing striped jackets from a concentration camp. Who were they and why were they there?READ: The 'Belsen boys' who moved to AscotJoin the conversation - find us on Facebook, Instagram, YouTube and Twitter."}