{"id": "Stolen church roof '£400k to replace'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowAn entire lead roof, stolen from a Grade I-listed church, could cost about £400,000 to replace. The theft of about 20 tonnes of metal from All Saints' Church, Houghton Conquest, near Bedford, has been described as \"one of the worst\" by a church architect. Parishioners are now raising funds for the work as their insurance is only expected to pay out about £15,000. Treasurer Joyce Bullock said the task ahead was \"hard, but we will do it\".The theft was discovered at the start of the month and Michael Dales, a church architect who assessed the damage, said: \"This is one of the worst lead thefts I have encountered.\"Donations of £1,000 have already come in from across the country and as far as New York.Ms Bullock, 74, said it would be a \"full-time job\" for her to apply for grants to add to the pot. \"It is always hard to raise funds in a small rural area, but we will do it,\" she said.She said they would have been able to claim more on insurance if they had had a roof alarm, but they had not had the funds to buy one.They are now hoping to get a grant from the Beds & Herts Historic Churches Trust to rectify that.Gary Mudd, a Parochial Church Council member, said: \"[The roof is] now water-tight and that should last us a couple of years to get things sorted out.\"Many churches, such as this one in Suffolk, have replaced stolen lead roofs with less valuable stainless steel ones, but Margaret Tyler, one of Houghton Conquest's church wardens, said it was too soon to say what material they would use, as English Heritage needs to advise on and approve any proposal.Police said officers were \"looking at a number of lines of inquiry\" in connection with the theft.The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}