{"id": "Migrant caravan: What is it and why does it matter?", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThousands of migrants from Central America are trudging north towards the US-Mexico border.They say they are fleeing persecution, poverty and violence in their home countries of Honduras, Guatemala, and El Salvador.The journey poses a host of dangers, such as dehydration and criminal gangs, but many of the migrants say they feel safer travelling in numbers.Here's what you need to know about the convoy of people known as the migrant caravan.On 12 October, in the crime-ridden Honduran city of San Pedro Sula, a group of 160 people gathered at a bus terminal and prepared to set off on the dangerous journey.They had been planning the trek for more than a month, in an attempt to escape unemployment and the threat of violence in their home country.Most previous migrant caravans have numbered a few hundred people, but after a former politician posted about the plan on Facebook, news of it quickly spread and the numbers swelled.By the time the group set off in the early hours of 13 October, more than 1,000 Hondurans had joined.They have since crossed into neighbouring Guatemala and then Mexico, with thousands more people joining along the way.Most of the migrants say they are seeking a new life and better opportunities in the US or Mexico.Others say they are fleeing violence in their home country and intend to apply for asylum.Honduras, which has a population of about nine million, has endemic problems with gang violence, drug wars and corruption. The wider region has one of the highest murder rates in the world.\"It's our dream to reach the United States, we want to give our children a better future and here [in Honduras] we can't find work,\" one mother of two told local newspaper El Heraldo.While Central Americans have long fled their homelands for the US and have sometimes joined forces along the way, the organised nature of this caravan is relatively new.Migrants are often kidnapped by people traffickers and drugs gangs who force them to work for them. A large group such as this one is harder to target and therefore offers more protection.César Gómez, a 20-year old from Guatemala, said he jumped at the chance of joining the caravan to avoid the dangers of travelling alone and paying thousands of dollars to people smugglers.There are several caravans moving north. The first and biggest is the one that left San Pedro Sula on 13 October but two more have formed since and are following behind the first one. The main caravan is estimated to have 5,000 people, the two others are smaller. The journey is gruelling and poses a number of challenges for those who decide to join the caravan. The hot weather means sunburn and dehydration are a constant risk.The migrants have mainly been sleeping on the streets or in makeshift camps and there is a lack of clean water and sanitation. At times, food has been in short supply.As the caravan has progressed, the towns they pass through have become more organised about providing shelter and food. At least two migrants died when they slipped from the vehicles they had boarded and were run over. There is a legal obligation to hear asylum claims from migrants who have arrived in the US if they say they fear violence in their home countries.Those seeking asylum must be fleeing due to a serious fear of persecution. Under international law, these are considered refugees.If an asylum seeker enters the US illegally, they are still entitled to a hearing of their claim. But those seeking a better quality of life - even if they are fleeing devastating poverty - are not considered refugees and do not have the same protections.US Attorney General Jeff Sessions says the \"credible fear\" asylum rule has been exploited in the past, and announced in June that victims of domestic abuse and gang violence would no longer generally qualify under it.This \"Turn-back Policy\" is currently subject to a lawsuit from the Southern Poverty Law Center, which accuses immigration officials of unlawfully delaying access to the asylum process.Unlike previous smaller convoys of migrants, this one has drawn the attention of US President Donald Trump.He has criticised a number of Central American countries for allowing people to leave the region and come \"illegally\" to the US.Mr Trump has also threatened to cut off foreign aid to these countries, but he has not specified what money will be cut and it is unclear how he would do so.Curbing illegal immigration was one of the main campaign promises Mr Trump made when he ran for president.His Republican Party is facing mid-term elections on 6 November and could be unseated by Democrats in the House of Representatives.Mr Trump has said the \"invasion\" of migrants would find the US military waiting for them and, on 29 October, it was announced that the US would send 5,200 troops to the border with Mexico.The president also told Fox News that \"tent cities\" would be built to house migrants seeking asylum in the US.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}