{"id": "The Papers", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowSeveral of Monday's newspapers suggest that sufficient progress could be achieved in the Brexit talks over the next few days.Progress in negotiations would allow EU leaders to resurrect plans for a special summit later this month to approve a deal, it is reported.The Guardian quotes one Whitehall source as saying that, should enough ground be made, a tentative new date of November 22 is being floated for an emergency meeting. It reports that EU officials have put the chances of a deal on the Irish border at \"50-50\" - and have warned that the competing red lines remain \"incompatible\" in key areas.  According to the Financial Times, ministers say Theresa May is determined to try to seal a deal at a November summit, meaning that she must win Cabinet support for an outline proposal within days.  The Telegraph reports that the prime minister's top Brexit adviser, Olly Robbins, is preparing to go to Brussels this week to clinch a deal in principle.And the Mail quotes a Cabinet source as saying that Mrs May appears to be \"desperate\" to agree a deal this month to allow more time to get it through Parliament and avoid having to implement costly contingency plans for a no-deal scenario. Meanwhile, the Ministry of Defence's decision to drop a requirement for Commonwealth nationals to live in Britain for five years before they can serve in the Armed Forces, is the lead for the Telegraph.The move is welcomed in the paper's leader column. It suggests the move is appropriate, given what it calls the extraordinary contribution made by colonial and dominion volunteers to the defeat of Germany in two world conflicts. It is too easy to see World War One as essentially a European affair without fully appreciating the effort and sacrifice of those who may not have considered this to be their fight, the newspaper says.Many papers carry striking images of flames lighting up the moat of the Tower of London in a new installation marking the centenary of the end of World War One. It takes up the whole of the Mail's front page, which describes the spectacle as a stunning sea of blazing remembrance. The paper says that, like the display of ceramic poppies four years ago, the historic tower is once again providing a dazzling backdrop to a nation's thoughts of remembrance. Its headline reads: \"Ablaze with 10,000 torches, haunting tribute that says: We will remember.\"Get news from the BBC in your inbox, each weekday morningMeanwhile, an investigation by the Times has found that companies and charities are making millions of pounds by treating NHS patients in psychiatric hospitals that are sometimes sub-standard and fail to provide adequate or safe care. It says thousands of patients are detained - sometimes against their will and in other cases for many years - in wards and units that inspectors say don't meet required standards of care. Fees charged to the NHS for psychiatric care can be as high as £13,000 pounds a week, it adds.And a number of papers report that ministers are to unveil plans to turn boarded-up High Street shops into gyms, tearooms, youth clubs and advice centres. According to the Telegraph, a new strategy will seek to match landlords of empty shops with community groups offering vital services to younger and older people. The Express says that with imagination, some additional cash and the co-operation of landlords and local government, it may be that we are now seeing how our high streets can be different.Watch the BBC News Channel’s press review every evening at 22:40 weekdays, 22:30 and 23:30 weekends and via the BBC iPlayerDaily ExpressDaily MailDaily MirrorDaily StarDaily TelegraphFinancial TimesGuardianIndependentMetroMorning StarSunTimesThe i"}