{"id": "The day out that reunited an Indian boy with his family", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowFifteen-year-old Hassan Ali was on his way to an amusement park outside India's capital Delhi in July when his memory was jogged by something he saw. He was on a bus with more than 50 boys from different children's homes in the city. Hassan had run away from home nearly a decade ago. And ever since he had been unable to recollect enough details to find his way back - until now. He fell silent as the bus passed through an uncannily familiar street with many Hindu temples. And when he spotted an Islamic book shop on his right, he couldn't help but squirm in his seat. He was suddenly filled with nostalgia and a sense of disbelief. He bent over and whispered in his friend Michael's ear, \"This is where I ran away from. This is where my madrassa [Islamic school] was.\"Hassan was just six when he ran away from his school. He says his parents forced him to attend the madrassa -  but, as a little boy, all he could think about was \"escaping\" from a place that curbed his free spirit and playfulness.So he managed to get away and he kept running, fearing that school officials would find him. When Hassan's parents found out, they panicked and went to the police.\"We spent seven days at the police station,\" says Hassan's father, Saleem Ali, a daily wage labourer.But Hassan was one of thousands of children who are reported missing in India every month.Mr Ali says the police spent several days searching in and around the neighbourhood where they lived but there was no trace of his son. It seems Hassan kept running for more than 10km (6.2 miles) because he crossed the Delhi border and entered Gurgaon, a city in the neighbouring state of Haryana.When a policeman saw him wandering alone, he asked him where his parents were. Hassan told him he had run away from the madrassa. He also told him his parents' names - Saleem and Hamida - both of which are common Muslim names. But he didn't know where the madrassa was located or where his parents lived. With so little information, the police couldn't locate his family. The next day, they sent Hassan to a children's home. \"Every time I'd ask elders in the home where my mother was, they would point towards one of the women and say, 'this is your mother,'\" Hassan recalls. \"I would say 'no' and I would cry.\"At the age of 12, Hassan was transferred to another children's home in the western state of Goa. But he and two of his friends ran away from there within a month because one of the employees had allegedly been beating them.The police found the boys after a few days and Hassan was eventually sent back to the home in Gurgaon.Hassan shuffled through three different homes over a span of nine years - he often didn't like the food but, in one home, he found comfort in the presence of a female caretaker who he says loved him as if he were her own child. And he spent hours playing with the other children who lived with him.\"I had given up on finding my family. I never thought about them,\" Hassan says. \"It just seemed so far-fetched.\"But those distant memories came rushing back on that hot summer day on 22 July - and he recognised the street from where he had run away in 2009.Hassan told his child care officer, Ashique Ali, that this was where his former madrassa was located. \"I started searching on Google maps for a madrassa in that area,\" Mr Ali says. On their way back to the home from the amusement park, Mr Ali, Hassan and two other boys got off the bus near the book shop that had jogged Hassan's memory. It was about 20:00 local time (14:30 GMT).Hassan says he had a series of flashbacks once he started walking down the street. He led the others to the lane where the madrassa still stood - and he pointed out the playground and the mosque, explaining how they had changed over the years.One of the teachers at the madrassa recognised Hassan and called his grandfather, who was ecstatic at hearing Hassan's voice. Mr Ali says the grandfather asked him to contact Hassan's maternal aunt as he was no longer speaking to Hassan's parents due to a family dispute.But Mr Ali decided to halt the search until Hassan had completed his school exams. So it wasn't until 17 September that they returned to the neighbourhood and found the home of Hassan's aunt.\"She couldn't believe her eyes,\" Mr Ali recalls. Hassan's aunt immediately called his mother's mobile phone and Mr Ali told her that they had found her long-lost son. \"She went quiet. I told her again and then I gave the phone to Hassan,\" says Mr Ali. Hassan's voice choked as he talked to his parents and his eyes filled with tears. He finally met them that night when they visited the children's home in Gurgaon where he lived. They hugged him and cried. They were all speechless for the first 15 minutes. \"I felt so loved and protected,\" says Hassan.When he went home the following day, his mother cooked his favourite chicken curry, his father told him he would buy him a motorbike and his elder sister said she would buy him a phone. In the time that Hassan had been separated from his family, one of his four siblings, an elder sister, had died. \"We saw our daughter's body and we knew that she can never come back. But we hoped to find Hassan because parents never lose hope of finding their living children,\" Mr Saleem says. Hassan will continue to stay at the children's home until the end of the school year. His mother is anxious at the thought of him living away from home for five more months. But after talking to Mr Ali, Hassan's father believes it is in Hassan's best interest.\"I'll miss my friends when I leave the centre but I also really want to go home,\" Hassan says. \"It's been a long time and I can't think of anything else now.\"Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}