{"id": "California wildfires: 'I saw cars become metal and bones'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowAbout 250,000 people have been forced to flee to avoid three major wildfires in California. Some of the evacuees have shared their stories with the BBC.When William Hart woke up on Friday morning, he didn't notice anything unusual until he opened his front door. \"I noticed there was a lot of smoke outside. We live in Paradise. Everyone has a chimney here - but when we saw black and brown smoke coming we knew it wasn't chimney smoke,\" he said. He and his room mate decided to flee - but had to quickly decide what to take. William said his room mate grabbed her dead husband's ashes but then questioned herself: \"Why am I doing this? He's already burned.\"Meanwhile, William took his camping bag. \"I'm not very materialistic so I don't have many things.\"It was a close escape. William said when he turned around in his street there was \"no life left\" behind him. \"Three minutes separated me from death.\"William documented his evacuation in a video he posted on Facebook - but found some of the footage too harrowing to post.\"I deleted charred human bodies from my video and charred animals trying to flee. I think they were dogs. \"Cars had become metal and bones\".William says he's now in Jackson, California: \"I was trying to help but now I'm mentally done.\"Joseph Metcalfe woke his children up around midnight on Thursday and told them they had to evacuate.\"We tried to make it an exciting adventure so as to not worry the kids too much but on our exit we drove past 30ft (9m) high flames and could clearly see the raging fires burning down the hills\"\"This was a whole different level. \"The fire carried no prejudice. \"It has really put into perspective the value of life and the things we own, as the wealthy and the struggling alike have to face new challenges of rebuilding their lives.\"Anabel Lois, 15, and her mother Mee Forbes live just a few miles from the town of Paradise, California.When Mee realised the seriousness of the situation she rushed home to her family: \"I just wanted my family safe.\" As the fire approached their house, the family packed up a few belongings and evacuated to the town of Chico - but the fire soon caught up with them, forcing them to move on to Redding. Anabel, 15, told the BBC that the situation \"is still frightening\" and that she is struggling to comprehend what has happened. She said: \"I don't think I am going to believe it until I go back [home].\" Mee agreed that \"it just doesn't seem real\".\"You see it on the news and you just don't think it'll happen to you. You don't feel like you would ever be affected.\"People have really stepped up to help us find a place to stay for a night. It is really nice to have family and friends that are able to reach out to us. We are very thankful for that. \"We don't have any idea [when we can go home], there are fires still burning in our area. We are just waiting to see if our home is still standing.By Victoria Park & George Pierpoint, UGC & Social NewsFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}