{"id": "Father of 'Jihadi Jack' asks Canada to help bring son home", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThe father of a British-Canadian national detained in Kurdish-held northern Syria is asking Canadian officials to help secure his release. John Letts is also pleading for their assistance in the repatriation of other Canadians being held in the region. His son, Jack Letts, 23, dubbed \"Jihadi Jack\", travelled to Syria in 2014. He was later captured by the Kurdish-led YPG - the group fighting against the Islamic State - when he left IS territory. Mr Letts said his son has been detained for the past 18 months and that his health is failing. \"I need your help to save my son's life,\" he told journalists in Ottawa, where he was meeting officials on Tuesday to discuss his son's case and those of other detained Canadians. John Letts and his wife are facing charges of funding terrorism after sending their son money two years ago, which they say was to fund their son's escape from Syria. They have pleaded not guilty. Mr Letts said they have not been able to speak openly about their son's case in the UK due to contempt of court rules. \"In fact there's a very good chance I'll be sent to prison again when I fly back tomorrow,\" he said.  \"Unfortunately I don't have any choice but to speak out because I love my son and think he's innocent.\"The couple, who along with their son have dual citizenship, have made repeated attempts to get the British and Canadian governments to intervene and bring their son home. Mr Letts said Canadian officials had been initially helpful when his son was first captured, but have since said it would be too dangerous to have him removed.  He said his son was \"naive and very religious\" when he travelled to Syria at the age of 18 and denies he was there to fight with IS. Jack Letts converted to Islam while at Cherwell comprehensive school in Oxford, England. It is unclear how much evidence exists about the true nature of his activities in Syria. At the Ottawa press conference, Mr Letts appeared alongside Families Against Violent Extremism (Fave), which said there are currently nine Canadian adults and several children, including a number under the age of six, being held in Kurdish prison camps in Syria. Fave said it is concerned that the families are housed in tents and lack adequate clothing to handle the approaching winter. \"These people need to be brought home to Canada and they need to be brought home now,\" said Fave director Alexandra Bain. Ms Bain said representatives from the UK-based legal Reprieve would travel to northern Syria to help facilitate their return if Canada agrees to supply the detainees with travel documents.Canada says that there is no safe way to get these Canadians out of the region. There are also concerns they would be detained by authorities and face charges in neighbouring countries if they did manage to leave Syria. In a statement, Canada's Foreign Affairs department told the BBC that its ability to provide consular assistance is \"extremely limited\" but that it is engaged to the extent possible in the cases raised by Fave. \"Canadian diplomats have established a communications channel with local Kurdish authorities in order to verify the whereabouts and well-being of Canadian citizens,\" it said. There has been significant debate in both Britain and Canada over what should happen to returning IS fighters who are still in Syria.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}