{"id": "Great British Bake Off: Final watched by 7.5 million viewers", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThe Great British Bake Off final was watched by an average live audience of 7.5 million people, according to overnight figures.This is a slight increase on last year's final, which brought in 7.3 million live viewers.A peak audience of 8.1 million saw Rahul Mandal crowned the winner in the final five minutes of the show.Ratings did not match those obtained when the show was on BBC One - the 2016 final brought in 14 million viewers.This was the second series of Bake Off to be broadcast on Channel 4, not including the celebrity specials for Stand Up To Cancer.Tuesday's finale gave the network its highest viewing figures since the broadcast of the Paralympics Opening Ceremony in 2012 - which reached a peak live audience of 11.2 million.Rahul triumphed over fellow finalists Kim-Joy Hewlett and Ruby Bhogal.He was crowned 2018's winner after a near-disaster in the show stopper.He said: \"I don't know whether to laugh or to cry. I just feel I need to talk with my mum.\"The final three contestants were evenly matched, having each been named star baker twice during the course of this year's series.Speaking to BBC Radio 4's Today, Rahul said: \"Only my parents knew about [me applying for Bake Off], in the newspaper they published the news and the rest of the family found out, they are very happy but shocked and surprised.\"I think baking is science, its a mixture of physics, chemistry and engineering so perfectly fits what I do. \"I just want to spread this word to students that maybe they think science is not for them, especially guys in school think they can't bake but its the same thing [as science] - anyone can do it.\"Lucy Mangan from The Guardian was full of praise: \"The most joyful thing about this series of The Great British Bake Off - apart, possibly, from Kim-Joy herself - was that as we entered the final, the average viewer would have been equally content whichever of the three remaining competitors won.\"The Mirror's Ian Hyland wrote: \"As well as being a great baker, Rahul was a great story. \"The timorous immigrant boy who decided the best way to learn about his new home was to bake his way through its history and customs. You can hear the orchestra tuning up already.\"Michael Hogan from The Telegraph agreed: \"It was a triumph of quiet talent as endearingly nerdy nuclear scientist Rahul Mandal, from Rotherham via Kolkata, became the cake-making contest's first male winner for six years.\"His ambitious creations occasionally looked messy but left the judges dumbstruck with their deliciousness.\"The Independent's Sean O'Grady was a little less complimentary: \"I wonder how much more the viewers can take of GBBO, but the format is obviously durable. So maybe another slice or two before it goes mouldy. \"In any case, say what you like about Brexit and the great British industrial productivity problem, we may rest assured that our amateur baking skills lead the world. Let's make Britain bake again!\"In the signature challenge, the bakers were called upon to make two batches of iced doughnuts - one set filled and one set rings. Indian-born Rahul was complimented for his decorations, with Leith saying: \"The colours are absolutely amazing and have such personality.\" Kim-Joy, who lives in Leeds, impressed with her amaretto creme diplomat doughnuts. Leith said: \"I might come back and eat that\".And Paul Hollywood praised London-based Ruby's doughnuts adorned with chocolate rainbows: \"They have great designs on the top and the decoration is very clever\".In a Bake Off first, the three finalists were then asked to take their cooking tools outside for a tough technical challenge.Hollywood tasked the trio with making six pita breads and three dips in 90 minutes, using campfires for all the cooking. Kim-Joy, a mental health specialist, won the technical for the first time.Research scientist Rahul came in second and project manager Ruby took third. But it all came down to the show stopper to see who would take the crown. The finalists were given four-and-a-half hours to make a landscape dessert, painting a picture with cake, pastry and biscuits.  Drama ensued as Rahul created a rock garden, inspired by Victorian explorers bringing back exciting plants from around the world.But his glass storage container smashed due to the 32C heat in the tent and after a swift clean up by producers he had to start again - with an extra 15 minutes to make up for lost time.Kim-Joy's Lost city of Atlantis was also applauded for being \"original and colourful\".But there were some questions on the amount of ginger she used in her biscuits and cakes - recipes that won her star baker in spice week.Ruby's magical landscape, with unicorns and mushrooms, was praised for its theme. The choux pastry mountain impressed with its height, despite being overcooked, whilst both judges praised the delicious flavours, beautiful sponge and buttery biscuits.But the taste and complexity of Rahul's final bake saw him come back from the brink of disaster to win the final. Leith said: \"He never reined in his ambition, he always tried to do a bit more than everybody else, and it paid off.\"Hollywood added: \"He is one of those characters that you will miss when you are not with him. \"I don't think he realises still how good he actually is and I think that's what's magic about Rahul.\"Follow us on Facebook, on Twitter @BBCNewsEnts, or on Instagram at bbcnewsents. If you have a story suggestion email entertainment.news@bbc.co.uk.The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}