{"id": "", "paragraph": "If I remember correctly the mother threw the children out the window because of a fire that had trapped them in their apartment.[removed]For the un-initiated what shoes are these?91% of people think that Clemson can beat Georgia?Don't confuse this with \"Clemson beats Georgia 91% of the time.\" It's more like \"91% of people give a very slight edge to Clemson.\" Play 100 games and neither team does better than 60.I noticed this when I saw Alabama 99% - 1% Georgia. Alabama has looked better, but Georgia has a waaaaay better than 1% chance to win.No we want the 1%, let that statistic feed our team.It says right there in the article that people were telling him that he was the security guard.The only thing I have to point to is that you have to put yourself into the shoes of the officer. I am sure there was shouting, screaming, and people crying, the situation I guarantee was chaos. The officer pulls up on scene knowing that this is an active shooter event, knowing what has happened for the past years and sees a gentleman with a weapon and makes the wrong decision.I'm not saying it is or isn't about race but I just have to say, it is more than likely not as easy as \"people were yelling at him and telling him he was a security guard\".Living in Athens, from the candidates on the mailers.  Lots of turnover in those apartments and close races at the house and senate level, on top of the Governors race.   That apartment might be on both GOTV lists, due to previous residents. Yup, I figured that was the case. I have many many duplicates, I just found it insane at how much I getWell all of this combined with my regular mail made it stuffed. That wasn't includedLoad more commentsHi all,Anyone have an insight into a good professor for systems?The professors listed are... (None of the professors have a rate my professor page)I have Hasko currently. Class is pretty easy but there’s a pretty decent amount of assignments and group work. Hasko is fine but clearly doesn’t want to be there. What is attendance policy for his class currently?Asking the important questionsHis class is offered at 8 AM, its a reasonable question lolthere are several variants of wannacry, each with their own potential kill switches.  there should be two threads running for spreading, one against the local subnet, one against a random subnet.  you should see an obvious pattern of increasing ip addresses being hit when it is trying to spread.just general information because the screenshot is too small for me to read.Here is the MD5 that does work. Thank you for your replyDb349b97c37d22f5ea1d1841e3c89eb4 Wannacry will run in a VM.\nHard to see whats going on here.  Are the OS's patched against EternalBlue?Here is the MD5 that does work. Thank you for your replyDb349b97c37d22f5ea1d1841e3c89eb4 Load more commentsAs an owner of a 2080, I am hoping that when dlss and ray tracing finally end up in games, they will be stellar game changes that blow away the 10 series.  But if it doesn't, I'm ok with slightly better than 1080ti plus a few bells and whistles. It definitely seems like a stratedy to move old 10 series stockI have read that with ray tracing on you will max out at 60 FPS at 1080p. I don't think the 2000 series is the game changer, maybe the 3000 series.See my other response to u/hwoarangatan - we don't have a game with dlss and ray tracing to actually prove that, just speculation. The battlefield and metro devs had like 2 weeks with the hardware before presenting and I'm sure there is some level of perf increase between that and launch.I will be interested to see it. I don't feel as if devs will be devoting large amounts of time to something that less than 1% of people will be using. This sounds a lot like hairworks or any of the other gimmicks that have come out over the years.Prices??Psychiatrist here. This will probably get buried, but I thought I’d make a PSA.  This is very encouraging news!  The early trials of psilocybin have been encouraging and this will facilitate further research.  A few words of caution based on thing I’m seeing in the thread:Ok. Carry on being hopeful for the future of mental health care!  Thank you for keeping it real. My anxiety medication (Celexa) which I know to be related to depression medicine as well is the only reason I have survived the past 6 months of my life./u/Swissgrenadier One thing to note that may or may not be true for EFT. Bullet holes and bullet spread may be client-side (Games like Source-engine games do this). What this means is that the client and the server may have a discrepancy. The easiest way to explain this is that a player may get a headshot on their side but the server sees it was a miss, the server always trumps player and therefore it looks like a headshot but the server didn't interpret it that way.The point I am getting at here is that your bullet spread may be different if viewed by another player. To get a 100% accurate representation of your bullet-spread get another player to view your bullet spread.I can tell you that 90% of the BiosEditors on github are just viruses. Go on the EthOS IRC, someone keeps a copy on their website filedistro for people to have.Anyone else immediately think of \"There Will Be Blood\"?I have these coupled with a HP 1200W PSU and it has been running 8 cards on 1 PSU for about 3-4 months non-stop no problems.When running as a SCAV on customs, there are no exit points. Tried several exits, cannot exit. This is the 2nd time it happened to me today, anyone else having this issue?Its known bug and can appear in any scav raid. Devs are looking into it.Thank you.This and why did we not run the fucking ball more? It's insane and apparently Kirby said he wouldn't have changed quarterbacks even after the game is he really that bad at practice or do they just not want a quarterback controversy that bad? Plus, why the fuck did we not run more?It's like they decided beforehand were coming out with Fromm throwing and we're sticking with it no matter what the fucking results. I blame this game on the coaches and play calling it was just awful. Hopefully they'll learn something from it by it sounds like they haven't unfortunately... Jim Chaney needs to go.Have been a poster here for a long time and feel that this post could use with some good discussion as to both the validity and the merits of the post itself.  To borrow a phrase, a good deconstruction of the arguments made here and with solid counterpoints can be used to both find strengths in the argument made as well as grow and analyze what was said.I'm new here and imagine I'll be banned for this, so I'll just put it straight. This theory and its hellspawn replies are flat wrong.You wont be banned for disagreeing nor for presenting ideas that are outside of the mainstream here.  This is not an echo chamber of misogynists and the alt-right as is claimed by the subs that catalogue \"hate speech.\"  While it is certain that such individuals do exist here, they are an extreme minority and their ideas are very quickly disavowed and ridiculed.  The people here share a common set of values that exists across the political spectrum from libertarian to populist-liberal.  Those values include:Corporations push diversity and inclusion for two halves of the same reason: it increases revenue.The first half is attracting top talent. Up until the affirmative action laws started taking shape, corporations were the strict domain of white dudes. And white dudes were pretty sure they had mastered whatever industry they happened to be in. Why not? Profits were stable and there seemed to be limitless markets of other white people to sell to (more on this in the second half below). No need to change, we've figured everything out and we're making money, right?But then AA laws became a thing and companies had to diversify. White dudes were pissed and threw tantrums and defended their institutionalized exclusion like they were the aggrieved masses, but eventually went along with it, little as possible, because they had to. And a funny thing happened on the way to the ruination of American greatness: these non-white non-dudes they were forced to hire started adding value. Mind blowing, right? Who knew only hiring a fraction of the population would mean you were only ever getting a fraction of good ideas? Corporations woke up to the reality that including people with different backgrounds and life experiences was a talent multiplier and their products got better from it. Lo and behold, corporations started implementing aggressive diversity policies beyond the minimums required by law.Affirmative action programs were created with the intention of destroying exactly what is described here, a cadre of men in a 'good ol boys' club that made decisions not on the qualifications and the ability of the candidate to perform the job, but the race and gender of the applicant over the qualifications of the individual.  In the early-mid 20th century most hiring, housing, and banking decisions were made along these lines and did cause significant harm to individuals because what group they belonged to was more important than who they were.   The problem is that Affirmative Action programs have become exactly what they were created to remove, a way to make decisions based not on the qualifications of the individual, but the race and gender of the end result.  Under an affirmative action program, the standards are lowered to accomodate group identity.  In this case Asians have to score significantly higher on the same exam than Hispanics, Native Americans, or black people to get accepted.  \"Diversity\" in the sense of group identity actually can be empirically proven to hurt more than help.The strength in true diversity is not in the inclusion of as many group identities as possible, but in a diversity of perspective and ideas. Sometimes, this naturally occurs with having racial and gender differences in a performance group, but not always.  A group of risk-takers that is made of black, white, female, and male members that all think the same is not going to have the same ideas and end product as a group of Asians that are all risk-averse.  The goal is to ensure on a team that there is a large diversity of perspectives, values and ideas not just group identity.Corporations realized this and hire people for differing perspectives, not group identity.  It is very well documented. The ones that hire exclusively on group identity hiring are very much struggling.Valve Software, is an excellent example of the former.  They exclusively recruit based on this idea of truly seeking only the best talent and differing perspective.  It is also a $5 billion company with 300 employees and entirely privately held to keep that mantra.The second half is saturation of white dudes to sell to. Did you know women control more than half of household spending? Or that black, latino and disabled people each represent more than a trillion dollars of purchase power in the US alone? It's true. And with multicultural shifts steadfastly in progress, these numbers will increase exponentially in the future. So the decision to embrace diversity and inclusion is, from this perspective, a cold hard business growth strategy.Wholeheartedly agree with the argument made here.  The best solution for a lack of diversity is an open market that will correct for gaps.  If there is a market for Hispanic Barbies, they will naturally sell on their own and carry their own profitability and revenue.  This can be seen with many products such as Univision, ethnic newspapers, and ethnic beauty supply stores.  On the flipside, if 80% of the market is of a particular skin complexion, those will be the most widely distributed beauty products.  It is so, not because of systemic racism or conspiracy, but because 80% of the market is a certain complexion and that's what sells.Another example of market forces rewarding ethnic variety in products is the \"Fast & Furious\" series.  Say what one will about the quality of the products, but combined they have a gross of over $5 billion and is the sixth-highest grossing franchise of all time.  The products don't advertise or parade \"diversity,\" simply tell a story that people want to see.I recommend y'all read up and start questioning yourselves more. This entire thread smacks of reinforced ignorance. I get that outrage is entertainment for you people, but when it causes you to invent ridiculously flawed theories that go totally unquestioned, it's a very bad thing.The vast majority of the United States doesn't agree with the perspective of the identitarian progressive movement and their activists.  It is less than 8% of the population and more than 90% white and rich.  With the exception of the small tribe of devoted conservatives (the other extreme), progressive activists are the most racially homogeneous group in the country.The same challenge is returned.  Rather than accepting what is said in the echo chamber, look outside from differing perspectives and look at what is the best idea.  Be open to discussing differing opinions and ideas with people that may be disagreed with.  Looking at anything through the lens of \"flawed theory\" leads to less diversity, not more. I believe that I agree with many of your points here. One of the biggest things I also did not agree with OP was what about a technology company that doesn't have consumer products? Rather than being open and fair, a director for a particuarly large based company can be directly quoted as \"By 2020 we will have 55% Women hired from campus working for X\". I think its great to consider a woman as the same level as a male and obviously that is exactly how it should be. However to go out of its way to force women into the work place seems absolutely ridiculous, especially with such extreme numbers like 55% required. Surely this such rapid forced inclusion must have some serious downsides? Are you to say that if 90% of your candidate pool is great, but they are all males, you will instead choose the 10% that are females simply because they are a female. That is almost certainly the definition of sexism correct?I am curious to your thoughr as you seem to be a relative SME in this subject (At the very least certainly more than myself).I rarely speak personally because I prefer to discuss ideas versus making a discussion about me or my views, but this is an entirely self-generated as personal opinion.I view females as entirely as capable as males in the vast majority of fields.  If a female can meet the same standards of performance as a male, they should have the same chance at success and opportunity as anyone else.   In 90% of cases, not only do females have the capability of meeting performance standards, in the vast majority of cases in my experience, they exceed it.  In every intellectual competition I join (I participate in Capture the Flag INFOSEC events and am a PhD candidate for the same), I actively seek females for my team because they have a creative perspective that I don't have and can be incredibly driven and successful.  I don't view it as sexism to actively seek intellectual diversity.  If I met a woman who thought like I do, I'd likely pass on teaming with them.I agree entirely with your statements and personal opinions.My philosophy was more built around the thought that should you force a percentage of inclusion regardless of their abilities. Obviously more in the most hypothetical of senses does my thought process make sense. My curiousity is just peaked by forcing specific numbers like 55% female inclusion.I am aiming specifically for Cyber Security as a job. I have done many interviews and am very active in the cyber security club. We have very few females in the information security emphasis and the Cyber Security club. So as such, the pool for potential candidates is significantly smaller. So when we are told that 55% of their selected cadidates must be female we are left incredibly confused as to how it can be anything but sexism.I dare not to say that females are not equal to men in any form. However when you have 9 males for every 1 female but a company requires 6 female hires and 4 male hires you are directly cutting males out of the equation.This is where i was interested in your own opinion on whether or not you viewed such as sexism.Even if it is, its quality content that I personally enjoyed looking at and it has gotten me interested. If all ads were like this ad companies would make a hell of a lot more.You joke, but that's 90 pounds heavier than I am now.  I'm 5'9\", dead average for an american, and putting on that kind of weight is totally unthinkable to me.  In less than polite words, that's really outrageously fucking fat.Just because you are an absolute twig doesn't mean the rest of us are lolThe idea is to stop players from sprinting full speed then quick scoping in. This obviously can change between the ergonomics of a weapon. This should help stop players that sprint with a sighted Mosin from running and quick-scoping. (This applies to any other sniper as well)now you’re changing what you’re saying...I have been talking about the same thing the entire time, you are getting stuck on terminology. You cannot full sprint and throw a scope to your eye and expect to hit your shot.“you ever touched a scope to your eye before?” lmfaoLol, okay.Load more commentsYES TEXAS IS BACKHow's that GPU with the CPU?Just got a 1080ti and running into CPU bottlenecks while the GPU sits around 30% load and 100 fps (At least in Hard Reset  from 2011, and Guild Wars 2 from 2012)What CPU do you have? I am very skeptical of your CPU being a bottleneck.GW2 also isn't very graphics intensive.Swords and Sandals!! How is this not here yet?"}