{"id": "IAmA", "paragraph": "U.S. elections are still extremely vulnerable two years after Russians allegedly hacked the DNC and the emails of a top Hillary Clinton campaign official. So far in this year’s midterm season, we've seen successful cyberattacks on a Tennessee county election website, three California Democrats and multiple senators' offices. And those are just the ones we know about.Here’s one example of what's at risk: Ethical hackers at a security conference this year determined they could break into a vote tabulator with a pen to take control of it, that same machine had a decade-old vulnerability, and researchers say tampering with it could swing the outcome of an election because it's used to count votes on the county level.What's more, social media has become a highly valuable tool for foreign governments trying to influence U.S. elections. Just this month, the Justice Department unsealed charges against a Russian woman for trying to interfere in the midterms via a social media campaign – a campaign that the indictment showed demonstrated striking similarities to the 2016 manipulation.We’re now one week away from the 2018 midterms. Ask us anything about election security – we'll start answering questions at noon ET.(Proof)About us:Tim Starks, a POLITICO journalist, has been reporting on cybersecurity since 2003. He was part of a reporting team that recently surveyed all 50 states on how they planned to spend a chunk of $380 million in federal funds to hire cybersecurity experts – and found that any of them don't know what they'll do when the money runs out. Naturally, since 2016 a lot of his focus has been on election security.Peter Singer, a cyber warfare expert, is currently a strategist at New America. His latest book, “LikeWar: The Weaponization of Social Media,” explores how social media has changed war and politics, and war and politics has changed social media.EDIT: Thanks for joining, all. We're hopping off now but keep the questions coming and we might be able to get to a few more tonight.Why are the Hart eSlate devices still used after multiple cases of user confusion and software malfunction? What software testing practices have these machines undergone in order for voters to put their full confidence in them?This seems to be more about how they're used than malfunction, although the jury's out. A Rice University study last year found that the machine was hard to use, and Texas says the incidents they've seen are more related to user error. Why are they still in use? Well, Texas seems to be sticking by the machines. That said, it's very expensive to replace voting machines. Congress sent $380 million to the states this year for election security, and none of the states expect they'll be able to use their portion of the funding to widely replace older or problematic machines.--TimThanks for the reply!How easy are the new electronic voting devices to hack?Newer in this case is often, but not necessarily, better. For instance, the ES&S M650 mentioned above is an older machine, although ES&S still sells it. The more important issue than age is configurations like whether it has a modem connection, and whether it's a paperless direct-reporting electronic voting machine (DRE)... the largely touchscreen machines that gained popularity after the \"hanging chad\" era of voting machines following the 2000 election debacle.– TimWhat kind of \"Brick and Mortar\" security systems are required to keep the voting equipment safe from tampering by law?Is it just the equivalent of a locked supply closet door?Any at all?Or is there no minimum security requirement at the state or federal level?I get the feeling that recreational marijuana shops have stronger security requirements... and that's sad because I've watched kids through security camera footage defeat those with a crowbar or an old claw hammer.Edit: You answered the wrong question. I'm not talking about the ballots, I'm talking about the voting equipment.[I own a recreational marijuana business and not only is every gram tracked by from seed to sale, my pot requires 2 months of uninterrupted video footage, a data record of every single gram to show what container and in what room I have it stored, requires advance notice to the state to transfer and they can ruin me financially for life if I fail to document every transfer precisely or fail to have proper paperwork in a delivery vehicle that is required to have a locking secure container attached to the vehicle frame......................................................................................................................................................................Most people self impose even stronger security to protect their investment. For example I've got 32 nightvision equipped high resolution cameras attached to a hidden reinforced security cabinet in the ceiling with a two day independent power reserve, a 24 hour alarm sonic/motion surveillance monitoring service and I've reinforced all entry points with steel gates bolted through concrete and I keep my product locked in a walk-in freezer with cameras inside.  Not only are there no blind spots but there is no place you can sit, stand or crouch without being on two cameras at the same time.....................................................................................................................................................................I say all of this for one reason.............................................................................................................................................................................If a loser like me can put together this much security on a basement budget and there is no similar minimum for the equipment that underwrites the sanctity of our system of government, then where the hell are our priorities?.......................................................................................................................................................If Marijuana is a dangerous schedule 1 drug that must be kept on camera under 24 review and behind reinforced locked doors in a restricted access building that requires security badges away from the public at all times no matter how small or poor the facility owners are, then surely our election equipment deserves the same treatment.] (#spoiler)Many states and local election offices, to their credit, do have rather extensive physical security procedures to safeguard ballots. A local election official who called into an NPR program I was on last week extensively detailed locked and escorted briefcases and all manner of physical safeguards. That said, the fact that DEF CON has proven over and over again that some machines can be broken into physically with relative ease (and in mere minutes) means that some bad guys could potentially tamper at the polls. The question is whether they'd be able to do so in quantities to change the vote, which seems less likely, although a mole working at a voting manufacturer or in an election official's office would have a better chance.The federal Election Assistance Commission does have standards for voting machines, but not all states subscribe to them; some have their own standards and relevant statues. But election equipment vendors don't have to subscribe to any federal regulations on cybersecurity best practices, something House Democrats in their election security task force proposed fixing.--TimI'm not talking about the ballots. I'm talking about the equipment. As said, ballots don't matter if the equipment is compromised.There are poll workers there, of course, to look out for disruptions, but our emphasis on voter privacy means that anyone who wants to physically break into a machine will have a curtain to shield their malfeasance.--TimThat's only a very small part of the time.What about when the equipment is in cold storage and not being used at the polls?The operative time to break into and modify equipment isn't while people are standing around at the polls, it's when it's in storage and during transfer away from prying eyes.In terms of an action movie or crime thriller, why rob a diamond exchange during daylight business hours when you can just mug the courier?the ballot marking devices in Colorado have tamper-evident seals on the physical cases and  ports applied by staff immediately after loading the ballot details; employees at every voting center sign logs verifying the seals and the ballot print count at open and close of every voting day; that said, a small minority of voters use these devices, most just drop off their mail ballots2/3 done with LikeWar, and it’s great.What percentage of election security would you say has to do with voting machines, and what percentage represents the human vulnerabilities and other critical infrastructure that could be attacked as part of an assault on our democratic system?Do you think there is too much focus on hacking the machines vs. hacking The People?Hi, This is Peter. And Thanks so much for the kind words!There are 3 kinds of threats to election security: 1) to the voting machines themselves, 2) to the infrastructure around them like voter databases, county websites that release the results etc., and 3) to the social/media ecosystem around the voter. Each have vulnerabilities, but a key problem is that the vast majority of the attention (in the media, in politics, etc) is on the 1st and lesser extent the 2nd, which has never been done on national scale successfully. By comparison, we know that the 3rd has been done in multiple elections...and worked. It has struck everywhere from the 2016 election in the US and the Brexit vote in the UK, to the Syrian civil war and the Myanmar genocide. This threat doesn’t come in the form of hacking networks (aka “cyberwar”) but rather hacking the people on them, by making ideas viral through a mix of “likes” and lies on social media (what we call “like war”). So, while it is unclear whether some nation is going to try to hack the machines upcoming, we know they are still trying the 3rd...as they never stopped. In the US, Russian accounts have been caught trying stir up controversy around everything from Nike’s signing of NFL star Colin Kaepernick to the upcoming midterm elections, while in Europe, they are expected to try to influence the European parliament elections in the spring, in support of far-right parties.Whatever the topic, the goal is always the same: using online means to alter real-world beliefs and actions. What makes the problem harder to deal with is that it is no longer just Russian actors that we have to keep our eye on. Examples now range from Iranian online influence operations to mercenaries willing to work for multimillionaires on single-issue campaigns. Indeed, the Brazilian election saw many of the same toxic tactics amid what has been called a “fake news tsunami”. So our focus should be on all three, not just the voting machine part.What is the recourse for polling places that use paperless voting machines if they get hacked in a way that changes the votes? There are no paper records of each vote, so are those places SOL? I get the sense that the government is trying to help these places prevent the worst. But if hackers slip by, is there a plan B? Will we even know about it?Beyond all that, how likely is this sort of hack to even happen? I feel like government and the media have been scaring the shit out of us since 2016, but hacking the actual vote count seems really irresponsible even for an adversary like Russia.That's precisely the problem with not having a paper backup. You just can never, ever be certain that a machine hasn't been tampered with. It's why every election integrity advocate, every cybersecurity expert, even federal officials, have said states still using paperless machines need to switch. Some are.Hacking machines to alert the actual vote count is the most difficult way to manipulate an election, vis-a-vis the government and media scaring you. What's been demonstrated is that it can happen. And if I've learned anything from covering hackers in my years (especially the kind backed up by a nation's government), it's that they're pretty imaginative. While there were people worried about election interference before 2016, hardly anyone saw it coming that Russia might break into the DNC and then release the emails... before, foreign probing of candidates had been for espionage. So, yes -- difficult, not impossible, and don't count them out.--TimThis is Peter: Great point. I'd just add that you even don't have to do the hack of paperless machines, but could drive \"evidence\" of it online (that may or may not be true) and seek to have the same effect of harming public confidence in the election results, the elected leaders, and democracy writ large....Tim, have you registered for this event on Nov 8, yet? https://www.eventbrite.com/e/human-rights-in-the-age-of-artificial-intelligence-tickets-51723483331Why aren’t more states using the ERIC system to keep their voter rolls up to date and more secure?This is Peter: I can't speak to ERIC in particularly, but rather a broader issue that comes from the mix of systems and requirements that play not just at each individual state, but even county level in US elections. There is a diversity of in awareness of cyber threats among local leadership, how seriously they take them versus other spending/time priorities, the budget they each have to tap to face the problem etc. So, while there is certainly now more awareness/$ for election security, its haphazard in its distribution in the US.Hi, Annie here, passing along a question we got from reader Matt Yegge on Facebook:\"We heard that electronic voting machines in Texas and Georgia have been switching people's votes... we know this because the electronic machines review with the user the final selection before submitting it. With paper-ballot voting machines we have no idea what the machine actually records.How can we be certain that these paper-ballot machines are recording our votes accurately and aren't being hacked and manipulated?What measures have been taken to adequately protect voting systems since it was reported earlier this year that high-schoolers were able to hack the mahines and networks?\"Addressed the first one above on Texas. As for paper-ballot machines, the paper part is what ensures that you know they aren't hacked. You have physical copies.And on the high-schoolers... it must be noted that many somewhat objective critics observed that the high schooler demo at DEF CON wasn't a perfect facsimile. Nonetheless, that even a somewhat reasonable demo revealed the ease of hacking vote-reporting websites showed there were some problems, and it makes sense that websites are easier to hack than a voting machine. As for what's been done since then (keeping in mind this was in August): I've seen no sign of any changes. It might just be too soon, or perhaps state officials are confident -- maybe overconfident? -- that the demo was bunk.--TimHi there,One of the largest questions surrounding the issue of Russian meddling in the 2016 elections is how to quantify the impact of the misinformation campaign, what tools, if any, exist for researchers attempting to answer this question?Best,JThis is Peter:There are a few resources on that. There was a recent book by Kathleen Hall Jamieson that looked at it from an overall election standpoint. You can find a good summary here:https://www.newyorker.com/magazine/2018/10/01/how-russia-helped-to-swing-the-election-for-trumpHowever, another study  I found really interesting is by Ohio State researchers who looked at the influence exposure to false stories pushed by the campaign had on turnout by Obama voters for Hilary (IE, not everyone, but people a Dem should have/needed to bring with them). https://www.documentcloud.org/documents/4429952-Fake-News-May-Have-Contributed-to-Trump-s-2016.html They found that former Obama voters who agreed with one or more of the fake news items were 4.5 times as likely to have rejected Clinton. In an election decided by a combined 77,744 votes in Pennsylvania, Michigan and Wisconsin — a mere 0.6 percent of the votes, that number is decisive.The reality is that we'll never know proof positive without a time machine to run an opposite experiment on another timeline. But what we do know is a) it happened and b) the attackers do think it worked, as they have kept at it!Thanks a lot!I am presuming the US has many exceptional cyber people. Why have they not joined tog to hack Russia or China , causing strife in their own countries, as they have here? Especially our elections abnormalities!Of note: The New York Times reported last week that U.S. Cyber Command has been sending warnings to Russian hackers to stay away from election interference, and that Cyber Command is on to them. That's certainly not hacking them, but it's raising the specter of it.The U.S. government is certainly conducting cyberespionage operations against Russia and China, but the U.S. style in cyberspace to date has been to be more discreet about its operations, whereas Russia ranges from \"flagrant\" to \"just doesn't care that much if people find out, because we can't be clearly busted.\" (The U.S. has by all accounts conducted more offensive operations elsewhere, like the Stuxnet attacks on Iran's nuclear program.)The U.S. can't target Russia's elections or China's elections because those elections have no substance. Some have suggested the U.S. could have an impact by getting into those nations' critical infrastructure like the electricity grid, and we might be there already. Some also have suggested conducting social media campaigns designed to highlight, say, the corruption of Russian oligarchs. But overall the U.S. has been reluctant so far to up the ante out of fears of a widespread cyberwar that could hurt us (given our reliance on tech) more than it would hurt our adversaries in Russia and China.--TimShould the election security bill stalled in Congress mandate any election security standards to States? If so, what items do you REC?Not my place as a reporter to make specific recommendations, but I can tell you what everyone else recommends. Election integrity and cybersecurity advocates and MOST in Congress say the stalled Election Security Act should have retained some of its mandates to states, like hand-counted audits, that the sponsors have since dropped. The reason they dropped it was to win over states who very much oppose federal mandates from Congress on election security. But those states remain skeptical of the bill's remaining requirements for states, and they've won over some Republicans, who by their nature are often opposed to more federal government.– TimTurnout trends in the United States have been on the decline for the last few decades, but there have been signs of hope with voter registration surges leading up to the Midterms; given that we see headlines daily questioning the integrity of our electoral process, at least in the headlines if not in the actual body of the article, what have you seen that voters should know about to have confidence that elections are fair, accessible, and secure--to act on their registration?This is Peter: Great question! I've not seen data yet to link whether concerns about election security are keeping people from registering/voting. But it is a real concern as you will sometimes see it anecdotally, said by for example why a college student explaining why they aren't. Indeed,  that was a key goal of the Russian online influence campaigns, to harm our overall truth and faith in democracy.So, it is crucial for government is not just to invest in election security, but also for key leaders (ahem, Trump) to stop with the language that blames their potential losses on nonexistent voter fraud etc. Their excuses for their unpopularity harm the overall fabric of our democracy.I would add one more thing on the registration/turnout issue. We go about this backward in the US from how other nations do it. You should be automatically registered and the election day should be a holiday, not just to enable more citizens to vote, but because democracy is something to be celebrated.Indeed, I love how Australia does it, where they even have a tradition of holding BBQs at polling places to serve to voters \"democracy sausages\"!In your reporting on elections, have you been surprised by the manner in which they are funded? Investment into the infrastructure of our elections, including voting equipment replacement and voter registration modernization, with a steady stream of resources rather than cyclical infusions of insufficient funding would go a long way to improve the overall security.  What do you think would be necessary to make this happen?I've been covering the federal government for a long time, especially Congress, and it's never a surprise to me when they give something less funding than all the experts think they ought to. As for what it would take to make it happen: Honestly, I suspect it would take A. a major unexpected crisis; B. a shift in GOP opinion based on, perhaps, the perception or widespread belief that the midterms were affected by hackers; or C. a Democratic takeover of Congress and the White House. Democrats have pledged to continuous funding of the variety you are talking about here.--TimIf all Americans were set up for a national id... we have two national ids already..  social security # and passport system ... and if it were free and easy to get a replacement once a year by walking into a post office counter and putting down your thumb print and updating your adress across the counter..  might such a system actually Increase minority turnout as well as helping people of all ethnicities who had fallen into economic turmoil and lost their ids benefit from the many non voting benefits that having an id can be critical for from library cards to real employment instead of marginal work etc.?  Might the best way to fight id suppression be to work to help make it easy and free to replace an id with all the non voting benefits coming as and addef bonus?There would be many benefits to such an ID, as you note, not just for voting but how we operate in our economic lives etc. And we know the model works, as most other equivalent nations in our economic bracket have them and it works for them.The problem is it remains a political nonstarter (there was a push after 9-11, and even then didnt go far). It would be opposed not just many in Congress, but at the state legislature level. So we get an odd outcome  not just for voting, but all sorts of other behaviors. In lieu of a national government provided ID, we use a less secure mix of your state level ID that remains designed for authorization to drive and some mix of info provided by a private company, from billing history to your cell phone number.is ID even a big issue? here in Colorado with a very flexible range of usable ID forms, there has been negligible voter fraud (and none related to ID that  i know of)Annie here, passing along a question from a reader on Twitter:Given the level of violence we've seen, has any thought been given to the possibility of some kind of coordinated attack on polling places by armed right-wingers?This is Peter: I've not seen any reporting on such \"coordination,\" but the growing problem of attacks by violent far right extremists and broader issue of armed militia groups trying to intimidate the public at events like protests and places of faith are real are of growing concern to law enforcement.One thing that is important to point out in the wake of the events of the last week (IE, the killings at the Kroger in Kentucky who targeted African Americans, the Pittsburgh synogogue shooter, and the \"MAGAbomber\" Cesar Sayoc): These were not one offs, but merely the latest examples of a larger trend. The US has a problem of domestic terrorism, with a particular strand of far right violence. The data shows that, despite the \"both sides\" mantra, in killing our fellow Americans, violent right wing extremism is particularly virulent now (data before the recent attacks: 71% of the deaths caused by political/religious motivated extremists in last decade were by right wing extremists vs 3% by left wing, 26% jihadi; if you want to judge not by deaths, but attacks overall, there is a 17 to 1 ratio. Our failure to accept these hard facts is why I wrote this article back in February about a problem that has only grown:  https://www.defenseone.com/threats/2018/02/national-security-pros-its-time-talk-about-right-wing-extremism/146319/We have been too quiet about a threat that is regularly killing our fellow citizens.Since elections were declared Critical Infrastructure, the Government Coordinating Council (GCC) and Sector Coordinating Councils (SCC) were created and stood up by the Department of Homeland Security,  more than a thousand election offices have joined the Multi State Information Sharing and Analysis Center (MS-ISAC), ALBERT sensors have been placed to monitor networks, security-specific training takes center-stage at election official meetings and conferences;  what do you see as being the most effective measure taken so far in safeguarding the process?Those are all widely commended steps. And many of them fall under one category, the area where we've probably seen the most progress: information sharing and coordination. When DHS made the critical infrastructure designation you mentioned, it was more reviled than not by election officials. They feared a big federal intervention. If you read the plain text of the designation, that wasn't there -- but the mistrust was profound, to start. Now, the relationship has gotten much better. States still complain sometimes about DHS not giving them enough this or enough that, but we're miles away from those early days of 2017 and the waning days of 2016 when there was such intense animosity that one secretary of state (Georgia's Brian Kemp) actually accused DHS of hacking his state. That hacking didn't happen, according to DHS's own inspector general, but it shows how bad things were.--TimWhat's the biggest bottleneck for getting newer, safer machines? Wondering if companies even exist that provide safe machines, but there simply isn't funding or political will for them.Money money money money, at least on the buyer side of replacing older more vulnerable machines and more vulnerable machine types. Many of the companies do try to make their machines safe, but most believe they're not doing enough. This tends to happen on cybersecurity in industry after industry: Researchers, ethical hackers and others will expose the weakness in a kind of tech and that industry will reflexively got into defensive mode. A few years later, that same industry will be running bug bounty programs that PAY hackers to get into their systems and expose weaknesses. We're at the beginning of that kind of high-level scrutiny of election equipment vendors. Let's see how long it takes them to embrace the scrutiny and use it to improve, as opposed to resisting it and saying everything's OK.--TimHi there,One of the watershed moments in cybersecurity history was the now infamous Stuxnet attack on Iranian nuclear facilities, could you speak a bit to how significant that event was, and how the post-stuxnet world of cyber-security looked differently prior to the attack?Best,JHighly significant. \"Watershed\" is the right word. Some believe it enabled an era of more widespread cyberattacks from nation-states. It very well may have undermined U.S. authority on the international stage in its attempts to establish voluntary norms of behavior in cyberspace. And it may well be that the U.S. realized its error and has been  trying to make it right, but it has made us vulnerable to criticism from other countries.--TimFollow up question:What kind of required security is involved for storage and transfer of the equipment?People keep saying that polls are where the machines are vulnerable... but why commit breaking and entering during the height of business hours?Just from watching video footage of my friend's store being broken into by various crackheads, I've seen how to defeat most brick and mortar security. I've also seen how easy it is to put everything back the way it was using little more than a cordless drill, lock gun and a claw hammer.If you want to disable most security, turn off the power at the box behind the building, open the back door, then hide outside and wait 30 minutes. If no cops show, walk in. If the cops show, wait for them to leave and then walk in.Most door and pad locks can be defeated with a professional lock gun kit that you can buy online for $100 or less. Even if there are security cameras those only work if people check the footage. Most people don't do nightly security review because its boring and takes up time.I'm not a criminal, I'm not trying to prove anything. But if I were a hostile foreign intelligence service this wouldn't be hard to arrange. It doesn't require David Niven style Mission Impossible cat burglars.One of the more credible scenarios where someone could influence the vote tally is along the lines of what you describe here (I mentioned the mole example, too). That's not just me saying that; that's what hackers and at least one secretary of state have said to me. There are no widespread standards that I'm aware of on this. I recently asked a DHS official about this scenario, and what he told me was that they've issued physical security guidelines, and they have regular coordination meetings with both election officials and election equipment vendors to discuss threats.--TimGuidelines are useless without redundant or even double redundant systems in place to enforce them.Here's what I would do: Hold mock exercises to break into secure facilities and gain access using security experts against monitors who believe they are guarding actual election equipment following those guidelines.See how many times you can break in and alter the machines before getting caught.You better believe that's what a determined government entity would do.Make a mock facility housing the same kind of voting equipment that counties use and break into it using every trick you can think of while following those guidelines.If you even one group fails to act in a manner that would defeat intrusion under test conditions then you can probably trick almost all of them.You can bet the real facilities won't be as tough because it will just be another workday where they expect everything to go smoothly.Septuagenarian poll monitors, low paid public employees  or ,worse, partisan elected officials with no real security training are a very poor bulwark against intrusion.i’ve worked as an election judge in Colorado since before our widely-lauded election reforms of 2013; what steps would you recommend to further improve Colorado’s system?Colorado is pretty much the industry standard right now, so it's hard to find any criticism. I certainly wouldn't recommend anything myself as a journalist, but the state has gotten pretty much everything right from the folk who recommend fixes.--TimIs election hacking really such a big threat given how easy it is to \"hack\" humans?There's a strong argument to be made that social media influence campaigns -- if that's what you mean by hacking humans -- are the bigger election security threat right now compared to straight-up hacking. But in so far as the last election was influenced by Russia, it was the combination of hacking (the DNC and Clinton camp) and social media influence campaigns (spreading and resharing what was gained from those hacks) that really made the biggest impact. I also wouldn't count out the future that hacking could play a bigger role in future elections.--TimWhat's your stance on backdoors, like Spectre and Meltdown to name a couple, do you think these vulnerabilities were planned? Are you concerned about assassination attempts for speaking out about who is installing them and for what purpose?Which country has the most tamperproof voting system in your opinions and why?Do you think more attention needs to be given to the USAs,  Israel, UK and Nato troll farms? We hear a lot about Russian operations but very little about our domestic operations, why do you think this is?What are you thought on operations like Operation Earnest Voice? Do you think it's a tad hypocritical by the government to be enraged about foreign interference when they themselves have engaged in it for decades?Its a bit different to target extremists and jihadists than to attack a foreign nation in order to throw their elections and politics into turmoil.Define \"extremists\", it can be stretched to be anyone, especially as Trumps now in charge. Systems like this can and will be abused but go ahead and brush it off.Brazil uses those voting machines since 95. I know people take a lot of security measures for them and they even host an event for hackers to try to hack them every know and then. But how safe are those machines? Do you guys happen to know anything about Brazilian voting system?Last year (2016, whatev..) I heard there was some drama about voting machines coming from a company that democratic supporter George Soros owned or had a part in, making a lot of people think there might be election fraud happening through the machines. Do you think there was anything to that?How easy would it be to cyber attack all the screeching 10 yr old hackers in csgo?Why does everybody (well, everybody on the left side of the political spectrum at least) believe there are Russian hackers, spies and bots all over the Internet even though there's basically no evidence to support that theory (unless there is, and I haven't heard of it.). What makes Russia such a prime suspect compared to, say, China, who rely on US companies to outsource their labour, or Saudi Arabia, who's entire economy depends on the US importing their oil?This is Peter. I'm sorry, but this may have worked as a question in 2016, but it is no longer a debate.While Vladimir Putin has denied the existence of this hacking campaign, its activities have been identified by groups that include all the different agencies in the US intelligence community, the FBI, as well as multiple allied intelligence agencies, who have seen the very same Russian efforts hit their nations and various international organizations (most notably the World Anti-Doping Agency). This campaign has also been established by the marketplace; five different well-regarded cybersecurity firms (Crowdstrike, Mandiant, Fidelis, ThreatConnect and Secureworks) have identified it. This diversity of firms is notable, as such businesses are competitors and incentivized instead to debunk each other’s work.The same holds for the social media side, where the host platforms have now documented such operations targeting U.S. democracy. Facebook estimates 146 million Americans (roughly half the population) saw content on its networks surreptitiously pushed by Russia’s information warriors. On Twitter, Russian troll and bot-driven tweets were viewed at least 288 million times in just the closing six weeks of the 2016 election. Meanwhile, on Instagram, a study of just 28 accounts since identified as being covertly operated by the Russian government drew an astounding 145 million “likes,” comments, and plays of their embedded videos.Indeed, even the most prominent individuals, who first denied the existence of the hacks and then the role of the Russian government in them, have acknowledged this campaign. This includes even the US president (“As far as hacking, I think it was Russia.” President Trump stated in a Jan 2018 press conference).So, yes, Saudi does play in this space too, and there are nascent Chinese operations (though not what is being framed by VP Pence), but to claim its not Russia doesn't hold any water anymore.This is the most in-depth answer on the Russian Hacking question I have ever received or managed to find trying to figure out what exactly happened. Though I still have some doubts, mainly due to my own stubbornness, hearing this from a person with authority on the subject has made at least some cogs in my brain turn, and I thank you for that.Another question, if I may, is this Russian interference still going on to this day? And if so, what would be the goal behind it?Dude gtfo. The FBI and the CIA confirmed it.The FBI and CIA, those two oh-so trustworthy organizations that have never acted against the people of the United States ever, and who have never created false enemies for the general public to focus on and use as an excuse to push new government regulations in the name of 'security', right? Right.Nuff said. You’re an idiot.Exactly the reply I expected from somebody like you.Building bombs from you moms basement today?  Get a job loser.I do have a job. It's just half past 5 PM now so my shift is over. Will go back tomorrow though, I love my job.Oh, and our house doesn't have a basement."}