{"id": "sysadminwith this knowledge, the war between apple and android can finally be won.   TO ARMS BROTHERS, WITH HELIUM WE FIGHT!", "paragraph": "It's been a few weeks since our little incident discussed in my original post.If you didn't see the original one or don't feel like reading through the massive wall of text, I'll summarize:A new MRI was being installed in one of our multi-practice facilities, during the installation everybody's iphones and apple watches stopped working. The issue only impacted iOS devices. We have plenty of other sensitive equipment out there including desktops, laptops, general healthcare equipment, and a datacenter. None of these devices were effected in any way (as of the writing of this post). There were also a lot of Android phones in the facility at the time, none of which were impacted. Models of iPhones and Apple watches afflicted were iPhone 6 and higher, and Apple Watch series 0 and higher. There was only one iPhone 5 in the building that we know of and it was not impacted in any way. The question at the time was: What occurred that would only cause Apple devices to stop working? There were well over 100 patients in and out of the building during this time, and luckily none of them have reported any issues with their devices.In this post I'd like to outline a bit of what we learned since we now know the root cause of the problem.I'll start off by saying that it was not some sort of EMP emitted by the MRI. There was a lot of speculation focused around an EMP burst, but nothing of the sort occurred. Based on testing that I did, documentation in Apple's user guide, and a word from the vendor we know that the cause was indeed the Helium. There were a few bright minds in my OP that had mentioned it was most likely the helium and it's interaction with different microelectronics inside of the device. These were not unsubstantiated claims as they had plenty of data to back the claims. I don't know what specific component in the device caused a lock-up, but we know for sure it was the helium. I reached out to Apple and one of the employees in executive relations sent this to me, which is quoted directly from the iPhone and Apple Watch user guide:Explosive and other atmospheric conditions: Charging or using iPhone in any area with a potentially explosive atmosphere, such as areas where the air contains high levels of flammable chemicals, vapors, or particles (such as grain, dust, or metal powders), may be hazardous. Exposing iPhone to environments having high concentrations of industrial chemicals, including near evaporating liquified gasses such as helium*, may damage or impair iPhone functionality. Obey all signs and instructions.*Source: Official iPhone User Guide (Ctril + F, look for \"helium\")They also go on to mention this:If your device has been affected and shows signs of not powering on, the device can typically be recovered.  Leave the unit unconnected from a charging cable and let it air out for approximately one week.  The helium must fully dissipate from the device, and the device battery should fully discharge in the process.  After a week, plug your device directly into a power adapter and let it charge for up to one hour.  Then the device can be turned on again. I'm not incredibly familiar with MRI technology, but I can summarize what transpired leading up to the event. This all happened during the ramping process for the magnet, in which tens of liters of liquid helium are boiled off during the cooling of the super-conducting magnet. It seems that during this process some of the boiled off helium leaked through the venting system and in to the MRI room, which was then circulated throughout the building by the HVAC system. The ramping process took around 5 hours, and near the end of that time was when reports started coming in of dead iphones.If this wasn't enough, I also decided to conduct a little test. I placed an iPhone 8+ in a sealed bag and filled it with helium. This wasn't incredibly realistic as the original iphones would have been exposed to a much lower concentration, but it still supports the idea that helium can temporarily (or permanently?) disable the device. In the video I leave the display on and running a stopwatch for the duration of the test. Around 8 minutes and 20 seconds in the phone locks up. Nothing crazy really happens. The clock just stops, and nothing else. The display did stay on though. I did learn one thing during this test: The phones that were disabled were probably \"on\" the entire time, just completely frozen up. The phone I tested remained \"on\" with the timestamp stuck on the screen. I was off work for the next few days so I wasn't able to periodically check in on it after a few hours, but when I left work the screen was still on and the phone was still locked up. It would not respond to a charge or a hard reset. When I came back to work on Monday the phone battery had died, and I was able to plug it back in and turn it on. The phone nearly had a full charge and recovered much quicker than the other devices. This is because the display was stuck on, so the battery drained much quicker than it would have for the other device. I'm guessing that the users must have had their phones in their pockets or purses when they were disabled, so they appeared to be dead to everybody. You can watch the video HereWe did have a few abnormal devices. One iphone had severe service issues after the incident, and some of the apple watches remained on, but the touch screens weren't working (even after several days).I found the whole situation to be pretty interesting, and I'm glad I was able to find some closure in the end. The helium thing seemed pretty far fetched to me, but it's clear now that it was indeed the culprit. If you have any questions I'd be happy to answer them to the best of my ability. Thank you to everybody to took part in the discussion. I learned a lot throughout this whole ordeal.  Update: I tested the same iPhone again using much less helium. I inflated the bag mostly with air, and then put a tiny spurt of helium in it. It locked up after about 12 minutes (compared to 8.5 minutes before). I was able to power it off this time, but I could not get it to turn back on.You win hands down the weirdest device failure I have ever seen.Seriously, I don't think this is easily topped. I can't think of anything even remotely this weird happening to any system I've worked on.The weirded failure I can recall is the story of how a chip manufacturer had an issue where once every week, the yield on the batch of chips that they were making overnight would drop to zero.They tested everything. They made sure the environment was clean, they confirmed the equipment was working, they made sure that every process was being followed to the T. They eventually brought in one of their best consultants, who spent weeks going over everything with a fine toothed comb. Everything was working perfectly, but like clockwork, once a week the yields dropped to zero on the batch and everything had to be thrown out.One night, the consultant goes onto the roof of the building for a smoke late at night, frustrated. Staring at the city skyline, he hears a train's horn as one goes rumbling by, transporting cargo to the nearby depot. Suddenly, hit with inspiration, he abandons his cigarette and dashes back inside, telling them to check for vibrations.Sure enough, the vibrations from the weekly train were causing minor defects in the silicon, bringing yields down to zero.Vibrations from a train would have been my last guess, right after silicon gremlins.Tricky little fuckers.Are they the ones with the tin whiskers?Those are the ones. They are also responsible for the phenomenon most would call the 'silicon lottery'.Is this related to the \"silicone lottery\" that you see in Los Angeles and Miami?1 more replyMy first guess was the night shift baking pizza in the chip curing ovens.Or cleaning services turning off power1 more reply1 more replyHere's another one from behind the iron curtain, also involving trains, but also cows, and radioactivity: http://www.jakepoz.com/debugging-behind-the-iron-curtain/2 more repliesGuy I used to work with on physical alarm and access control systems had a similar one:Customer complained that every night at the same time (I forget the exact time), their alarm system would report a line tamper from a particular alarm panel.  They replaced the wire runs, replaced the panels, the sensors, everything to do with the system.  Yet, like clockwork the line tamper still showed up every night.  So, this guy takes a lawn chair and spent the night staring at the panel.  At the exact time when the tamper was expected to show up, the sprinklers kick on and start soaking the panel and conduit.  Turns out that just enough moisture was getting inside the panel to cause the tamper contact to short.  But, the lawn looked nice, so there is that.Also manufacturing related, this news item has always stuck with me:http://content.time.com/time/world/article/0,8599,1888126,00.html1 more replyThis reminds me of late '50s / early '60s semiconductor production: They hadn't figured out the level of cleanliness required yet and observed regular and dramatically reduced yields every couple of days. Turns out it was farmers spraying pesticide onto the orchards that Silicon Valley was famous for before the computer industry took hold of it. The pesticides contaminated the silicone, which resulted in completely different properties.2 more repliesReminds me of a story about a Microwave Transmission path that would go out about 3pm every Friday for ~15 minutes. A tech eventually climbed one of the towers with a pair of binoculars. At 3pm a lorry pulls up in a gap between hills where the transmitter was pointed and the driver got out and had some afternoon tea!They raised the tower so it cleared the gap where the road passed through.I think you just won the award for the most British root cause. I can see the ticket now:\"Ticket closed: Connection going down due to afternoon tea.\"MicrowaveIn one of my first workplaces the breakers for the main router tripped around noon every day.This was supposed to be a dedicated circuit especially for this router, and it seemed to be nothing physically wrong with the router itself.A few days later the problem was solved... someone, somehow, connected a microwave oven to the same circuit and around lunch people used it to heat their lunches, until something broke in the microwave oven.A company we were consulting for asked us to track down an issue with their production database server. The live system just wasn't getting anywhere near the throughput that they expected. Whenever they ran benchmarks on the machine, they got great performance. Put within an hour of leaving the site, the performance dropped again.Our DBA visited the site, took one look at the machine, and suggested that they turn off the 3D Pipes screensaver.One day I started getting high disk latency alerts from all the spinning rust arrays in our data center, which is a standalone building a ways from the office.  When I got closer to the DC, I saw, felt, and heard a large steamroller with a vibrating roller not too far from the DC.  I remembered seeing a video of a guy yelling into his array and showing increased latency so I waved the operator down and asked him to stop for a minute and went inside to check latencies and sure enough, they were back to normal.  We worked it out with the contractor to keep the vibration setting at ~50% to avoid increasing latency.2 more replies12 more repliesSearch for the 500 mile email. it's an old post to a newsgroup but explains how a business couldn't send email to locations more than 500 miles away.This one is right up there thoughHah. I dealt with a speed of light issue once. There was a fancy new web app that had a built in mainframe 3270(?) terminal emulator which was rolled out to all of our branch locations. All (or most) of the branches were linked over a satellite uplink to the main office for networking.The terminal app had no local echo. So all characters typed had to be sent to the server and the input echoed back from the remote session. The complaint was that typing into the terminal on the app was too slow.Well, the damned app was sending a separate http request for each and every character typed. Multiply that by the tcp to udp translation over the sat link and the round trip time back and forth to the comms satellite and it was just torture to use.I never could get their app engineer to understand why it was stupid and was going to appear slow without local echo and command input grouping.In a related issue we experienced complete communications blackouts about once a year on the same sat link. Turns out that's when the sun was aligned just perfectly with our dish and overpowering the signal.Hopefully it wasn't a 3270 emulator. The entire point of a block mode terminal is that it's nothing but local echo until you hit send!1 more reply1 more replyYeah, that one is just glorious.Oh, yeah! I remember that one! I can't remember what caused it, but I do remember hearing about it.timeout was set way too low so that speed of light delay caused failures after 500 miles.Was the minimum time set by someone in the C-suite?Nah, config file version mismatch.2 more replies1 more reply4 more repliesThese both are gloriously out-of-left-field physics intrusions.6 more repliesIt rained in my datacenter once.It was easily solved however, turns out the floor above us had a kitchen put in right above it and some bright spark left a plugged sink running that overflowed.I have never seen a bunch of usually quite sedentary sysadmins move and scramble so fast to cover up server racks with anything they had around them.The ceiling in the room of one of my old client's newly erected server room collapsed on a Friday night day due to rain. We had the alert float in and gave them a call. They assumed that it was just a power cut and told us not to bother repeatedly, so two half-full racks got rained on for a couple of days until they came in on Monday.It was a disaster.Soooo... how'd the client take it?They weren't pleased and wanted to know why it wasn't looked at sooner. They weren't on a very decent SLA and we didn't have site access so we had no way to get in if we were told our main contact couldn't be bothered. We had tape backups of everything, but it was a data heavy business and all their storage was thoroughly fucked.The moment we heard what happened our boss jumped on the legal side and a lawyer did a bunch of legal stuff, so we had a package ready for them when they pursued it. We had call logs and emails and stuff in there to prove that we'd tried to make contact. Ultimately it's not really up to us to stop the fuggin roof from caving in. I was working in the workshop when this all happened, and didn't know too much about the specifics, but it ended up going to the company that put the walls up for the server room and it all went on their insurance, so we didn't take too much of a hit at all.They sacked the guy that was our main contact for the company, a sparky came and relocated all the wiring to the intact (but now emptied and dry) rack and we deployed a bunch of old shitty server hardware we had spare so that we could at least get them back on an AD/Exchange, and their software auth'd over the network while we sorted proper gear for them.It was weeks before they got back to a normal state, they upgraded their SLA.So basicallySysadmin: \"Hey something is wrong with the servers!\"Client: \"Nah it's totally fine whatever.\"Client: \"Everything is ruined why didn't you do something!!!\"Pretty much. They were quite pissed off that nothing worked on the Monday. They didn't directly threaten to sue us or anything because they weren't unreasonable people, but we still wanted to be able to show them that we made best effort and satisfied our part of the SLA.Maybe if they'd let us in we could have draped a tarp over the racks or something. It would have saved us all a lot of work.This has been my normal experience with clients. :p1 more reply1 more reply1 more replyIt rained in Facebooks datacentre once too, except it wasn't a water source above it, it was actually just raining in the datacentre:https://medium.com/s/story/it-was-raining-in-the-data-center-9e1525c37cc3God damn, they had their own microclimate.I went to a Fishbone concert on a cold night in the early '90s and the metal warehouse was tightly packed with hot sweaty people dancing their asses off. It rained sweat inside near the front of the stage.Ewwww.euthis happened regularly in a club i went to when i was young.1 more reply1 more reply\"Weirdest\" thing that ever happened to me involved network downloads of HTML5 Canvas screenshots failing if the frame being captured was high enough quality to make the toDataURL() method's base64 conversion from the data to the src attribute's value be truncated by the limit on a src attribute's length, resulting in a network error when trying to download. The Base64 data describes the image data being captured, so when the quality got high enough, the base64 representation of that data got too lengthy and the truncation of that descriptor meant the data itself was incomplete.As you can probably imagine, it wasn't very easy to arrive at that as a factor when the sole symptoms of the issue were ultimately tied to momentary quality levels of a group of frames in any given video. Still, though, I don't think I'd have ever figured out Helium as being a causal factor in OP's issue. That's outside my wheelhouse.My weirdest,Back around 2003 I had an issue with Excel spreadsheets (and only Excel spreadsheets) attached to e-mails (and only when attached to e-mails) coming into the office was causing our brand-new T1 circuit to crash.Sending xls e-mail attachments? Fine.FTP/uploading xls files? Fine.Downloading xls files? Fine.Retrieving POP3 e-mail w/ any other attachments? Fine.Retrieving POP3 e-mail w/ xls attachment? *crash*Turned out that Excel spreadsheet headers had a lot of repeating sequences of long lengths of single characters. Think: ZZZZZZZZZZZZZZZZZZAAAAAAAAAAAAAAAAAPPPPPPPPPPPPPPPPPPPPP but much larger.It turned out these character patterns' bit patterns caused a signalling pattern on the physical copper that made the T1 equipment fall over.The telco ended up having to switch us over to a completely different 25-pair between the building, the telco's street box and a CO sub-station 6 blocks away to fix it.Wow who made the leap of logic that the files were electrically incompatible with the t1?I did.It took about 6 hours of data-gathering just to isolate enough symptoms beyond simply \"The Internet Is Down Again!\" to get a handle on where to focus my attention.After walking around the (small) company and speaking with the employees, asking them to take note of what they are doing when the next crash occurs, enough data points eventually revealed — someone was always \"getting my e-mail\" each and every time the system fell over.I then asked all employees to immediately let me know if they have any e-mail problems. I found three employees with \"clogged e-mail boxes\" who couldn't retrieve their e-mail and every time they tried, the system fell over.Upon closer inspection I discovered that when two of them retrieved their e-mail, it kept downloading the same e-mails over and over, filling their e-mail clients with dupes and then crashing at the same place each time. The third would just immediately crash.IIRC, the first two were using the same e-mail client (Outlook?) while the third was using a different client.Using TELNET (>Telnet pop3.mycompany.com 110) I logged into my (offsite VPS hosted) POP3 server under their mailbox credentials and manually issued POP3 commands [USER|PASS|STAT|LIST|RETR msg#] direct to the post office daemon and watched its responses.In Users1&2 mailboxes I was able to manually RETRieve their e-mail messages (and watch it flash by on my screen) only up to a certain e-mail. If I tried to RETR that e-mail, it would start scrolling down my screen and... *CRASH*. Cue Office Choir: \"🎼🎶 The Internet Is Down Again! ♫♪\"In User3's mailbox, msg#1 was the offender. While I could RETR msg#2 and higher,  when trying to RETR msg#1 it would start scrolling down my screen and... *CRASH*. Cue Office Choir: \"🎼🎶 The Internet Is Down Again! ♫♪\"By inspecting the e-mail headers of these offending messages left in my window buffer I was able to glean enough information about those messages to go back to the Users and determine where they came from and their importance. I telephoned two of the e-mail senders and asked them about the e-mails they had sent. They both replied that they had attached Excel spreadsheets to their e-mails. Upon inspecting the third I determined that it, too, had an Excel spreadsheet attachment. Cue Dramatic Music: \"🎼🎶 DUN DUN DUN! ♫♪\"One by one, I logged into each mailbox and DELEted each offending message and logged out. I then went to each of the Users and watched them retrieve the remainder of their e-mails successfully with their e-mail clients {*applause*},  Except for User3 {*boooo!*}. User3 started to successfully retrieve further e-mails but... had another e-mail with an Excel spreadsheet attached. Cue Office Choir: \"🎼🎶 The Internet Is Down Again! ♫♪\"I quickly got User3 settled by grabbing what info I could about their offending e-mails so they could later ask the sender to re-send them and then deleting those e-mails until they were all caught up and their mailbox was empty.[Note of Enlightenment: Some e-mail clients (User3) RETR and DELE e-mails, one-by-one, as they receive them. Other e-mail clients (Users1&2) RETR ALL e-mails and then try to DELE them after the fact. This is why Users1&2 kept retrieving the same duplicate e-mails over and over and over. Their e-mail clients never got the chance to DELE messages when the T1 fell over. User3's offending e-mail was msg#1 because it was DELEting as it RETRieved.]Now that I had a handle on what was going on and what to do when it occurred, I stayed late that night to run experiments to characterize the nature of the problem. I made a couple test mailboxes on my mail server and started sending and receiving different file types as attachments. I also did the same to my off-site FTP server.  After a couple of hours of crash testing I had confirmed it was Excel+E-mail only. Even a blank, empty Excel spreadsheet would do it.Upon examination of a blank Excel spreadsheet in a Hex editor and then taking into consideration POP3/SMTP's Base64 binary-to-text encoding scheme... I had pinpointed the cause of my problem. Excel spreadsheet headers.I then spent an excruciating following few days trying to communicate my problem to my T1 service provider. It should be noted they were not The Telco (AT&T), they were a reseller of AT&T services.Day 2: I spent a good, solid day on the phone trying to get to speak with someone who could even COMPREHEND my problem. After numerous escalations and lengthy explanations and more than one \"T1? Excel spreadsheets?! That's not possible!\" and numerous tests from their end that showed No Problemo, even though I could reproduce the problemo at will, I FINALLY got them to send out a tech.Day 3: Tech finally shows up, a Pimply-Face Youth (PFY), and it immediately becomes clear we have a problem, he's incapable of LOGIC-based thinking. I mean, I can see he's computer and networking literate, but I sit him down and go through a lengthy explanation of the problem and the symptoms, with paper and pen and drawings and lists and \"glossy screenshots with the circles and the arrows and a paragraph on the back of each one explaining what each one was\" and... he can't \"grok\". I even demonstrate the problem a few times on my test mailboxes & FTP with him watching (Cue Office Choir: \"🎼🎶 The Internet Is Down Again! ♫♪\") and he just can't grok. I MEAN, it's like taking someones hands and having them line up dominoes and then push the first one over and...DIVIDE BY 0So he leaves and spends the rest of the day... \"Testing\", I guess.Day 4: No tech. I spend the rest of this day much like Day 2. On the phone trying to locate intelligent life and after many calls and unreturned calls and numerous escalations and lengthy explanations and more than one \"T1? Excel spreadsheets?! That's not possible!\" and numerous tests from their end that showed No Problemo, even though I could reproduce the problemo at will, I FINALLY got them to send out a tech. Again.Day 5: Two techs arrive. The PFY and an older, grizzled big dude with facial hair. Think Unix-guru. I spend an hour explaining the situation to him while he actually listens, interjecting with questions here and there while the PFY stares blankly with glassy eyes. I demonstrate the problem (Cue Office Choir: \"🎼🎶 The Internet Is Down Again! ♫♪\") and I can see, The Guru groks. The PFY occasionally shakes his head in disbelief incomprehension but the old guy \"Gets It™\", even if it does not compute. So, off he goes with the PFY and I see them around \"doing stuff\". In and out my telco closet with digital testing equipment. Out on the street. Etc.A couple of hours later they come back and he explains that he's run tests between my closet and the street box and found nothing wrong. He's even run tests between the street box and the Telco's Central Office 6 blocks away and... nothing. So we spend another 45 minutes going over the problem and symptoms again. Thinking. The problem obviously EXISTS, that's clear. The problem is reproducible on demand. The problem defies explanation—yet there it is.Then The Guru has a lightbulb moment and disappears with the PFY. A little while later he returns, sans PFY but with his digital test box, which he puts it into some arcane test mode that runs through a series of repeating bit patterns (00000000/11111111/10101010/01010101, etc) and... the clouds part, the sun beams and the Office Choir sings: \"🎼🎶 The Internet Is Down Again! ♫♪\"With a satisfied expression The Guru explains he thinks he has a handle on it and the Internet will be down for about an hour. I notify the Office Choir.About an hour later he returns, the T1 is up and his tests pass. I retry my Excel experiments and e-mail attachments flow like wine. He explains that he had to punch us down on a completely different 25-pair trunk between my closet, the street box and the CO 6 blocks away.And thus ends my saga. \\m/>.<\\m/There's a software setting that he could have used on both ends to change the encoding on the line so that it would pass the bit pattern test on the original pair. However, getting someone in the telco to change it on their side, and to note why it's changed, and not have an automated system revert it, etc, was not worth the bother. So that's probably why he just moved you onto a different pair, which by chance had different noise characteristics that made the problem go away.One really difficult part about process management in big orgs is finding the equilibrium between \"all routine work happens correctly\" and \"enough wiggle room is available in the system that exceptional situations can be solved\". This guy was experienced enough to know that \"move to another pair\" was inside the system, and thus doable, and \"tuning the bit encoding\" was not.That kind of experience, i.e. how to still get your job done inside of a rigid system is invaluable to the correct functioning of big complex organisations and it explains why outsourcing and age-discrimination layoffs (I'm looking at you, IBM) have unintended consequences on a company's bottom line.I wish to subscribe to your newsletter.Thanks for subscribing to Nerd Facts!Fact #1:Computers are work because of electical.4 more repliesMe too2 more repliesI wanna point out; it's also important to hire in fresh talent to pass on that experience. Obviously pfy in the story here seemed kinda useless, but it's worthwhile for companies to keep that tribal knowledge alive, so to speakYup. There’s a local union near me that’s about to be in hot water. Why? Because they’re about to run out of workers. For the past 50 years, they’ve run everything off of pure seniority. Getting into the union is notoriously hard. Climbing the ladder inside of the union is even harder - There are two distinct groups of people in the union. The grizzled veterans, and the fresh-faced youths. The problem? The grizzled veterans have chased off the fresh-faced youths... For the past 50 years.So now those grizzled veterans are all hitting retirement age... And there’s nobody to replace them. The grizzled veterans got all the best gigs because they had been with the union the longest. But that meant all the fresh-faced youths got discouraged and quit left after a year or two of only getting inconsistent and spotty work. The fresh-faced youths, fed up with only getting table scraps, quickly moved on and found work elsewhere outside of the union.So now in the next five to ten years, the union will find itself without any qualified workers, (because it ran off all the people who wanted to be trained,) and nobody to train new ones.It's really common. People yell about blue collar trades needing people but ignore structural issues that make it hard to make it a careerEqually helpful is finding a way to encourage the tribal knowledge holders to share what they know.  There's no single solution to this, but I expect 2-3 hours of food and alcohol during an unstructured time in a workshop with old and new pieces of technology laying about to jog peoples' minds about how the technology works under the covers might help to get the tribal leaders to start talking.  Then, find PFYs who like to learn to be there and soak up the knowledge.I've heard great stories from some of those tribal leaders of how they blended extreme technological knowledge with their limited understanding of psychology to fix problems back in the 70s and 80s.  If you find someone who likes to tell those stories, listen to them, even if you doubt their truthiness.The dreaded \"name one time you helped solve a difficult situation at work\" question in a job interview is settled for life for pfyEven though I will never have to deal with this problem, I need to know what the software setting was that would have fixed this on the old pair.They need to turn off signalling autodetect, and then match B8ZS encoding on every hop of the t-carrier. Also, both sides of your data link csu/dsu, or router with integrated csu/dsu s,  need to be set for B8ZS.No AMI anywhere, certainly no carrier autdetect.Found the network engineer.I was in the ISP business in the late 90s and this stuff is stuck in my head forever. If anyone's this deep in the thread and looking for a translation:AMI and B8ZS are signaling protocols for how bits are sent down the wire electrically. For really short distances and low speeds, you can get away with a simple approach like \"5 volts is a 1, 0 volts is a 0\", but that's not going to work across a city because transmission line physics. So there are all kinds of codings, and it's a really fascinating topic full of a mix of clever shit and hacks.AMI, Alternate Mark Inversion, is pretty simple. To send a 0, set the line to 0 volts, easy. To send a 1, either go to a positive voltage or a negative voltage. The trick is that you alternate between them. If the first 1 is positive, the next is negative, then the next is positive again, etc. This does two things: first, the voltage averages out over the long term to 0. I think this helps the signal integrity by discharging any capacitance that builds up on the line. The other thing is clock recovery. If you have a string of voltages coming in, as the receiver, how do you ensure you measure them at the right time to get the correct bits? Even a slight drift in timing between the sender and receiver can screw everything up. One thing most of these encodings do is try to give you enough bit flips to lock on to the sender's timing. With AMI, as long as your clock is only off by a small amount, you can watch for those alternating 1s and sync up. It's like playing an instrument in a band, you have to keep your own time but you're hearing everyone else so you can stay together.So great, except what happens when there's a long string of 0s? The line just sits at 0 volts. To torture the analogy, there's 30 seconds of silence in the middle of this song and then you all have to hit the next note at exactly the same time. This would be a big problem with AMI signaling, except for one thing: T1 circuits were developed for telephone calls, and you can get away with a lot of nonsense because of it. A T1 circuit transmits about 1.5Mbps. For voice, that's 24 channels at 64Kbps each. But let's be realistic here. On a crappy telephone, who can hear the difference between 8 bits of resolution and 7 bits? So they figured if they just steal one of the 8 bits and always set it to 1, you can guarantee that there's a transition often enough to keep the clocks in sync. It's only 56K instead of 64K, but nobody's going to notice. Problem solved.Until, of course, you want some sweet, sweet data. Forget about the phone calls and just treat the T1 as a data circuit. Now your robbed bits are super annoying. So enter B8ZS: Bipolar with 8-Zero Substitution. This is the same as AMI, hence the \"bipolar\" (alternating polarity for each 1 bit), but now when you hit a string of 8 zeroes, you substitute something else. But what can you substitute that isn't a code for another bit pattern? This is the clever bit: because bipolar encoding requires alternating positive and negative voltages, there are a bunch of invalid transitions. For example, you can't start positive, go to 0, and go back to positive again. That would be seen as an error on the line. So B8ZS defines one specific sequence like this to not be an invalid code, but actually mean 8 zeroes. Whenever it is about to transmit 8 zeroes, instead it substitutes that bipolar violation code. This keeps the line from going idle for an extended time, without having to steal any bits, and you get your full 1.5Mbps.Hopefully this helps somewhat to explain, if you haven't seen this stuff before, why specific bit patterns can cause weird things to happen, especially if somewhere along the line there's a piece of equipment that isn't configured right.  And if you think that's nutty, just read up on how DSL came along by exploiting the fact that nobody's analog telephone service was actually analog except for the short wire to their house.1 more reply8 more repliesThis belongs in /r/talesfromtechsupport if its not already.A lot of us software engineers look down on network techs (I think because you guys aren't generally college educated) but holy fuck I have a lot of respect for you guys for keeping our internet going.That's insane. I've had to solve some weird bugs in my time, but nothing on that scale.Ha.  Ironically, that's exactly how we feel about most code techs, for the exact same reason.A software puke is better than a Windows Sysadmin, but holy fuck, no, it is not the network.  Of course the 1 time out of a hundred  that it IS the network and we never hear the end of it.This is the craziest network issue I have ever read. EVER.I agree, but for good measure - you've read about the 500 mile email?2 more replies4 more repliesPs. You should post this comment as an actual post! This is downright the craziest shit I have ever heard in networking.I barely understand what actually happened, but appreciate the random Alice's Restaurant reference4 more repliesThat's up there with the guy who could only e-mail the eastern seaboard because of speed-of-light lag as one of the toughest problems.3 more repliesWish I had gold to give for the Alice's Restaurant reference. I actually laughed out loud.As someone who does physical network maintenance for a large ISP I absolutely would've thought you were crazy for pinning that kind of problem on us. It really sounds like a configuration error on your end, unless I can see our device go offline while you're reproducing the error. That is some impressive detective work and now I will never doubt when a customer comes to us with something crazy like that.1 more replyHardware has come a long way for sure. I never had reproducible hardware problems, not counting \"it's totally not working\". The most mysterious thing I had to unravel was application server grinding to a halt in about 24 hours period. Intermediate cause was high delays (up to a second) in server's loopback (!) network. And the cause turned out to be iSCSI initiator slowly leaking socket handles when it was unable to connect to its target.Yes, so at some point in your circuit there was some mux set for AMI, or robbed bit encoding. https://en.wikipedia.org/wiki/Bipolar_encoding It was the default CSU/DSU config, as compared to B8ZS. I had a lot more problems when one side of the line was B8ZS and the other was AMI. AMI was fine for voice circuits, you never notice a flipped bit, and analog will always give yo a one her or there, but data was a problem. Didn't usually knock things down, it just caused 1-5% packet loss. Which sucked enough. I think the real problem was carrier autodetect. A ton of zeros made someone think that it was B8ZS or AMI instead of the other and then it flipped encodings, making you dead in the water because you were mismatched.  The \"FIX\" was to move you to a whole different T-Carrier system, hence the different cable. Because good luck finding the guy who can go hop to hop and find the AMI. His name was Jim, he worked at the Network Op center, and he was currently bridged with 5 other guys re-provisioning things.I used to test for this by pinging with large packets and data patterns of 00000000000 and then 1111111111111. People still do this, but on channelized t3 and above I doubt it is still an issue.1 more reply47 more repliesAnd how did you convince the telco of that? I can only imagine the blank stares of \"uh huh, yeah, riiiiight...\" when you tell a CSR that retrieving an email with an attachment sends your T1 into a death spiral.15 years ago the Telco may have been a smaller company staff with real tech support personnel. Today of course, that would never fly.Man I miss those days. My first DSL ISP that I had was local. The guys running the place were total geeks. I could call them and they were totally happy and loved doing line tests and speed tests. They'd tweak some settings on their end, and then we'd retest, and I've have even more speed from them. It was just nice getting some real service. I referred tons of people over to them who all loved them. Depressing, the state of ISPs these days.3 more replies2 more repliesI'm just imagining someone reading \"electrically incompatible file headers\" in an excuse generator and thinking 'What, do they think I'm dumb or something?!'2 more replies2 more repliesThere used to be a similar issue with dial up modems back in the 90's.Back then, modems were controlled by the AT command set. Because it was a serial link, once you were dialled in, you needed some way to break the data stream to get the modem's attention if you wanted to, for example, hangup. So the AT command set specified that you should issue \"+++\" wait 2 seconds while sending no data, and then issue your AT command - \"ATH\" for hanging up.The problem came about that a bunch of modem manufacturers started cheaping out. They wouldn't enforce the rule of waiting for 2 seconds for no data, so sending +++ATH in quick succession would cause the modem to hang up.So if you found out someone had a cheap modem, and had the correct ping exe on your system, you could do:Their computer would receive the ping packet containing +++ATH and try to send a response with the same data, causing their modem to hang up on them.C...can you stop using that string in your post.  Every time I try to load this page it gets to that string and then my connection drops.But miraculously, I can now download Excel attachments while this page is open.1 more reply7 more repliesWAIT WHAT. How the fuck did someone figure that out?3 more repliesHah, a few years ago our client moved to a new building, and after a few days noticed that some (external) e-mails aren't getting delivered. I narrowed it down to mails with certain attachments, and then found out that the connection simply hangs when such mail is being delivered.ISP insisted that it's our equipment's fault (ISP's headquaters were also in the building next door, and were on the same circuit). I then put one such message on a http server and demonstrated that the download hangs if I try to download it when connected directly to their optical converter. They then tried putting us on a different port on their side, which didn't help, did a bunch more tests, and finally replaced the optical converter, which made the problem go away.The tech said he has no idea how that happened, because the converters were just dumb devices that didn't even have a firmware they could upgrade. Oh, and IIRC the hanging e-mails also had .xls and .doc attachments (because everybody still uses those despite .docx and .xlsx being available).18 more repliesThey had help, an engineer familiar with the failure mode made a very thorough comment in the previous thread. https://www.reddit.com/r/sysadmin/comments/9mk2o7/mri_disabled_every_ios_device_in_facility/e7g5rcw/Fun fact, when helium balloons deflate, the reason they are doing so is the He has made its way through the vinyl or mylar skin and escaped into the atmosphere. https://www.thoughtco.com/why-do-helium-balloons-deflate-4101553edit: i know our MRIs (there's 2 in the facility i work in) do lose helium over time despite it being in liquid form. They have to get routine infusions of liquid helium.You thought Hydrogen was smaller? Do you even Periodic Trends, bro?Kidding, it’s quite understandable to think that, and I try not to act electronegative toward people learning chemistry ;)2 more repliesFor a moment I thought the first sentence was a joke.No, you really meant itReminds me of a network bug in the game Factorio, where some shitty consumer routers were mangling packets that had 0xffffffff in a header somewhere. In true Factorio dev form, they correctly diagnosed and fixed it.I still love the north facing inserter bug, which was eventually tracked down to being am error in float rounding, but only for values very close to zero.My favourite was probably the train pathing glitch that hit (I think) 0.15.30something. The change required discarding all existing paths for trains already in motion, but a newly introduced race condition prevented the trains in motion from considering things like other trains and signals when they repathed on first load.It was a simple enough mistake that they fixed quickly, but it made for a pretty spectacular Sunday evening on my rail map.newly introduced race condition prevented the trains in motion from considering things like other trains and signalsFun trivia:  our terminology and visual imagery for mutual exclusion subroutines are all based on the solutions that locomotive stockyards had been using for decades.  (The scientist who first published a paper describing the concept lived near some train tracks.)Even the word we use for most such implementations, semaphore, originally referred to the signal flags and patterns of waving used by the guys out on the tracks.Well, semaphore was the obvious one, but what other words and phrases are derived from rail terminology? Your comment is fascinating because it offers the potential for a different, perhaps easier way of thinking about mutual exclusion problems.Buffer is the only other obvious one I can think of.1 more reply2 more repliesFor certain values of 2Holy shit really? Is there any posts about this or the North inserter bugs, sounds really interesting to read through how people figured out the issue1 more replyReminds of the classic 500 mile emailhttp://web.mit.edu/jemorris/humor/500-miles2 more repliesI probably wouldn't know where to look in your situation as it's out of my expertise currently. I think debugging is fun, so if I had the right resources I might find it eventually.1 more reply4 more repliesTo be honest, I don't want it topped by me, anything harder than this and I would probably go crazy.2 more repliesI've got some interesting stories. Some my own, some others.The Raspberry Pi 2 was camera shy because silicon is translucent to Xenon arc flashes and caused glitches in the power supply.At one point, I was in a class for network debugging. This was all fine until there was a situation that not only the students nor professor could figure out that was only marginally a footnote in the book. We had Cisco routers racked up for student use with a serial card and a 4-port ethernet card. Typical stuff. At one point, somewhere along the line, someone slipped one of those thin fridge magnets between a lower router, right above the Ethernet card. It took a solid week for us to figure out why replacing that device's card didn't work until someone decided to unrack it and simply swap it out. We for grins & giggles tried it without the magnetic friend (it was well stuck on there) and magically, it worked. Old hardware had begun to flake in just the right way to cause the small flat magnet to interfere with anything over 1baseT half-duplex. The irony? It was a Cisco TAC contact magnet.A friend of mine once discovered that in the right situation, bundling AC power, ethernet, and SDI video will result in a bad time: A small server had an SDI video connection, Ethernet and 50Hz AC all going right near each other, so the bright idea was cooked up to physically bundle all three of these together in some cable wrapping. On the other side, the power cord was looped with several other machines' power cords. When one of the servers in the rack would wake up a gigantic array of spinning disks (for backup of the SDI video), the network on this little video transcoding box would fall off the planet for about 30 seconds, resulting in the transfer failing. It worked on the bench, it worked out of the rack, but not when in the rack. The best estimation that anyone had was that the disk array would cause the coiled power cords to sink some current somehow and this would cause the UTP network cable to accept some interference and whoops there goes a flaky network card.I've heard multiple tales of 40ft of UTP cat5 causing microsecond differences in the time it takes to download a file, exacerbating a race condition somewhere and causing a download to fail.Mutliple people I know have reported hardware failures based on the location of people within a building, with documentation that a person simply being in the room will cause a part to fail or not fail. A personally favorite exapmle of this was that a cardboard cutout of said person was left in a server closet for a weekend and this caused a multiple-day outage of a service for no other reason than \"cardboard cutout of Joe was left in cabinet room\"I have personally laid hands on a device which does not pass self test only to have it pass its self test only while I have my hand on it. The results were the same when I wore insulated rubber gloves.I've 2+2 not equal 4 due to cosmic raysI've seen a flaky lightbulb cause a spectrum analyzer to go out of calibration while the light was on\"I've seen things you people would never believe.\"3 more repliesMutliple people I know have reported hardware failures based on the location of people within a building, with documentation that a person simply being in the room will cause a part to fail or not fail. A personally favorite exapmle of this was that a cardboard cutout of said person was left in a server closet for a weekend and this caused a multiple-day outage of a service for no other reason than \"cardboard cutout of Joe was left in cabinet room\"Ever find an explanation for this?Everyone knows of the \"admin gene\", where tech will work when specific people are around.Like everything, there must be an inverse of this which would be a \"anti-admin gene\".2 more replies9 more repliesAround the 3rd last one, that's likely a loose connection or improper grounding, and either you're grounding the chassis or pushing on something that then bridges that flaky connection.The irony? It was a Cisco TAC contact magnet.laughsMaybe I shouldn't have one of those stuck to my tower...I have personally laid hands on a device which does not pass self test only to have it pass its self test only while I have my hand on it.i think many people around here would relate to this.20 more repliesWeirdest system problem I ever had involved some network switches that had interfaces with duplicate MAC addresses.That sounds like an interesting problem.Sounds like someone fiddled with their addresses1 more replyI've seen this on separate switches that were delivered to a facility that I worked in. The network guys kept telling me it was impossible.3 more repliesI have seen this with GE patient monitors supplied to our equipment leasing company. They apparently had some refurbs that were flashed wit new firmware; part of the flashing process was to set the MAC. They apparently didn’t care and just used the default, which caused havoc until we figured out what was going on.5 more replies15 more repliesHow about the case of the 500-mile email?Holy shit, light travelling for 3 ms goes ~580 miles.Second best part of that article is that I learned about the \"units\" command in *NIX:Damned straight.  \"Does that really work?!\" Sure does.This program is probably my most favorite *NIX utility.  I use it for nearly everything.  It even works well in KSP, if you wanna try out the rocket equation to calculate your ship's delta-v:3 more repliesEver time I read that I laugh.Agreed.  This is reminiscent of the time that RAMbus chips were flipping bits and after months of investigation it turned out that their shielding wasn't sufficient to protect against cosmic rays.Earth's magnetic field generally shields us from cosmic rays, but occasionally they get through and can strike a bit, in some RAM, in a server, in a datacenter, and suddenly everything shits the bed.Goddamn cosmic raysI've been hit by a bit flip on cisco catalyst 6500e sup720s twice. It generates a specific error that when looked up on cisco's website says its caused by cosmic background rays.Well, or background radiation of some other sort.ECC SECDED. Live it, love it.So you’re saying: https://xkcd.com/378/ is correct?! And that you’re not a real programmer (/s)?I unironically use nano.Yeah me too, it's just quick to make a few edits with\"I need to generate some perfectly random strings\"has new user attempt to edit and save a file in vi without using googleAh, good 'ol C-x M-c M-butterfly.That's a dang BOFH excuse IRL.10 more replies19 more repliesMost interesting thing I have read today. Now I gotta bring up the fill the building with helium attack to the security team... :)What would use as a detection system for that?They make portable helium gas detectors for a few hundred $$$.Yeah, they call them iPhones.iPhone is a hospital is the new canary in a coal mine?5 more repliesniceOh shit6 more repliesOr you could just wait to see if people are talking funny. /s2 more repliesWell if everyone starts talking like an Oompa LoompaIf the concentration of helium was that bad you'd have a lot of people dying from asphyxiation pretty quickly lol.Im slightly surprised for the amt of helium you reported leaked, you didn't have any respiratory distress issues in the facility. Ya its non-reactive, but it does displace oxygen.Ceiling may have been high enough for the higher concentrations to linger there out of the way.1 more reply3 more replies3 more replies2 more repliesiPhones obviously.6 more repliesfill the building with helium attack to the security team... :)When I get a call from a vendor who wants to send me a whitepaper about their product that defends against helium-based MEMS oscillator attacks, I'm going to track you down and make you pay for your sins.1 more replyNow, can anyone explain WHY helium would affect it this way?Thermal dissipation is the only thing I can come up with, but that seems lame.The most likely cause is the interaction between He and MEMS chips in iPhones. Here's a little video explaining what MEMS are. From some of the replies in my last post it seems that the atmosphere can play a role in the function of MEMS. One comment mentioned that the helium could have permeated through a seal on a MEMS device which was designed to operate under a vacuum, and in turn locked up the phone. I'd imagine that whatever function the MEMS served in the device was highly sensitive and a minor discrepancy in operation could have dire outcomes.Forgot to link to videoIn the original thread, the suggestion was MEMS resonators. The iphone 7 uses one of those instead of a quartz crystal for the 32kHz oscillator. Someone suggested it could be using that (which is time keeping accurate) to regulate the main clock. Get a little He in the package, and it might even just stop resonating altogether. no clock, no processing. you couldn't even wake the device from sleep or put it to sleep. It matches what is shown in the video very well.Now, finding info about what resonators / oscillators iphones use has proven difficult. I've been looking for a phone to test this with, but finding a 7 or newer has been tough.The 32kHz oscillator is connected to the PMU, which is the power management chip in the iPhone. This is used for several things, like keeping the real time clock while off, but also to generally run power management. It is basically the \"sleep clock\", used to run very low power things all the time even when the main CPU is off. For example, when the phone first boots up, it's quite likely that the power sequencing is running off of this clock before the main CPU can turn on. This clock is probably also responsible for the \"hard shutoff\" button combination detection. It might also be used to calibrate other system clocks.Given what the OP said, it's almost certain that the helium caused this clock to stop or glitch, which caused the PMU to stop functioning properly. No PMU, no power management, and the phone can't go to sleep or wake up properly or in general control itself, and you can't even hard power down the phone.It seems that the helium doesn't take that long to dissipate, but with the PMU glitched, the phone can't go to sleep, wake up, reboot, or generally do anything. So at that point you have to wait for the battery to completely drain before everything can cold-start cleanly again. It's likely the phones could've been kicked back into working again by disassembling them and disconnecting and reconnecting the battery. With the OP's test, where the phone locked up with the display on, it took a lot less time to recover since the battery drained quickly.You can look up iPhone schematics and PCB photos and look for the part. It's a SiTime SiT1532. Here is an article on the Fitbit Charge 2 which uses the same oscillator. The package looks like this. The iPhone 7 seems to use a standard 32kHz quartz crystal (metal can marked DA613 under the PMU chip on the right side of the board, not MEMS), but the iPhone 8 does use the SiTime part (look along the top edge, about 75% of the way from the left, marked \"C0 JKG\"). The iPhone X also has it (\"C0 KIG\" around halfway down the left edge). So it looks like it's largely iPhone 8 and onwards that uses this part.2 more replies12 more repliesMotorcycle cornering ABS represent1 more replyHoly shit. That video blew my mind. I had no idea these things existed!That's a super old video. Modern MEMS is a lot better.This is the MEMS gyroscope in the iPhone 4: https://i.imgur.com/cn8emFz.jpgThat is actually beautiful.2 more replies3 more repliesHere are few more people discussing the helium interaction. Very interesting thread.The critters inside the iphones that make them work need oxygen, so if that is displaced by helium, the critters get sleepy and go into a coma for a while?Going on the \"hamsters that make the servers run\" theorem.I am wondering the same thing, and what specific differences between iPhone and Android protected the Androidshttps://www.reddit.com/r/sysadmin/comments/9mk2o7/mri_disabled_every_ios_device_in_facility/e7g5rcw/Worth a read1 more reply2 more repliesWow, a super-weird incident on Reddit that I actually have something to contribute to! First, some background: My day-to-day job is the design of rugged industrial controllers. These things are used in all kinds of crazy environments for test, measurement, and control system implementation. We're talking 70 Celsius, high-G kind of stuff.One day, I was asked to help out with an odd issue where one customer kept having our systems suddenly brick on them. They would just refuse to turn on. No troubleshooting would solve it, so they'd send it in. By the time we'd get the units, they would boot perfectly and run through our entire test suite flawlessly. After our RMA team dealt with this a few times, they eventually brought me (an engineer) on to investigate. After probing the customer for some details, we discovered they were using helium while testing out their systems. So, I went down to Party City and bought a tiny little helium tank, got some oversized balloons, squeezed one of our devices into them, and filled it up. After an overnight soak, I was able to reproduce the same failure mode the customer had! Some further tests allowed me to narrow it down to the MEMS oscillators on the PCB. I deadbugged some crystal osciallators into the system instead, and after that, no amount of helium that I exposed it to would kill the system! The problem was solved! The \"dead\" units sent to us had simply been outgassing the helium in transit and had released enough to function again by the time they arrived!Now, what are oscillators and why did the MEMS ones fail? Well, functionally oscillators are electrical components that generate a repeating signal at a certain frequency (usually a square wave). Crystal oscillators do this using the piezoelectric effect, which is a fancy name for the fact that quartz (and other crystals) accumulate electric charge when stressed mechanically. This also works in reverse, so applying a charge can also stress the material (make it vibrate). MEMS oscillators however, do this using a very small mechanical structure (think tuning fork) that naturally vibrates at a certain frequency. It's worth stressing that these oscillators are usually the system \"clock\", and they are basically the beating drum that keeps everything working in concert. No oscillation, no work.Both MEMS and Crystal oscillators are hermetically sealed because they would otherwise change frequency with atmospheric pressure and humidity, but the difference is that crystal oscillators are sealed in metal cans that are soldered shut, whereas because MEMS devices are made in a similar way to integrated circuits, and they are packaged and sealed in a black plastic (think every IC you've ever seen). Helium is so small that the plastic is permeable to it, but the metal can of the crystal oscillator is not! When helium got in, the vacuum was brought closer and closer to normal atmospheric pressure, and since oscillators are tuned to work in a vacuum, once there was enough pressure inside they will cease to function.Since MEMS oscillators can be made like ICs and packaged in plastic, they can be made much smaller for much cheaper than crystal oscillators, which is probably why so many apple devices, known for their thin and compact form factors, failed! They were reliant on these parts!Thanks for posting this....very interestingSounds plausible. Helium is really weird.Related: I had a DYI clock that was sensitive to humidity. The more humid, the slower. I guess I could call it a humidity sensor.2 more replies18 more repliesShould have just asked Siri and seen if the response was high pitched.\"siri, sing a poem for me\"There is a flower within my heart, Daisy, Daisy!Planted one day by a glancing dart,Planted by Daisy Bell!Whether she loves me or loves me not,Sometimes it's hard to tell;Yet I am longing to share the lotOf beautiful Daisy Bell!2 more repliesIncredibly interesting story. Reminds of the 500-mile e-mail limit.Reading things like this make me thankful to not be old enough to have been in this line of work prior to 2002.That was a good read!5 more repliesI think the most interesting thing is that it only affected iPhones and no other devices including Android phones.It must just have to do with a specific component (or set of components) that Apple uses in their devices. Not sure to be honest. I'd love to test it on some android devices, but I don't really have any good candidates. It was easy to conduct this test since I had plenty of iphones at my disposal. I've got a fat stack just sitting on my desk. Every single one of them works just fine. I just picked out the one that had been dropped and scratches up the most JUST IN CASE it didn't come back.Hmmm... I have a couple old Galaxy S5s at home, wonder how much a small tank of helium would cost...I bought a small blue tank from walmart for $25. It was worth it for me. I was able to use a small amount just for the test. Plus I can think of funny uses for the included balloons at work.Send “Sorry about your phone” balloons to those who had a device malfunction.Also useful for tripping REX sensors on secured doors.1 more reply2 more replies1 more replythat's exactly what i was thinking... why didn't it affect other devices as well?Apple switched to cheaper MEMS oscillators instead of a Quartz crystal for timekeeping. This happened since the iPhone 6 so explains why earlier devices are fine. Android devices all use Quartz crystals. MEMS oscillators are cheaper, but slightly less accurate and can’t deal with Helium.1 more reply5 more replies5 more repliesThe MEMS oscillator theorem really seems like the best-fit. Especially if other phones are using quartz oscillators, which usually have more mass than a 32khz MEMS device would have. Helium guns up the clock, the CPU stops processing because it thinks time has stopped, then batteries run out until the HE has dissipated.Nothing else fits the exact symptoms quite as tightly.6 more repliesAffecting only the iPhone 6 or newer would make me suspect the barometer, but the first Apple Watch didn't have one. Quite odd.You know how GPS disables itself after reaching high speed (preventing it's use as a targeting component)?  Mayyyybe the helium does something similar to the iPhone hardware? Limiting or affecting it's functionality in very specific situations.  Nothing specific comes to mind though.  Weird.Also not a bad point, but the first few gens of Apple Watch didn't have GPS either.Maybe the power management IC's? I don't know if anyone else uses Dialog Semiconductor units.1 more replyYou know how GPS disables itself after reaching high speed (preventing it's use as a targeting component)?Never knew that...TIL!2 more replies11 more repliesClose, the clock on more recent phones is mechanical and requires a vacuum. Helium is not a vacuum.https://www.reddit.com/r/sysadmin/comments/9mk2o7/mri_disabled_every_ios_device_in_facility/e7g5rcw/normal air isn't a vacuum either, so what makes helium special?the chips are sealed in a vacuum. the problem is helium is so damn small (and H2 molecules as well) that it can seep through the seal.1 more reply3 more replies1 more replyJust kidding lol I don't care too much about the fifth reincarnation of Nintendo VS SEGA but it's pretty darn hilarious all the events that came together in your story!Yeah I got some hate from a few Apple fans out there. I don't really care since I'm being completely objective here. I haven't even bad mouthed apple, because frankly I don't think this is something worth bad mouthing them over. There's a lot of other nasty things they do, but none of them are relevant to this discussion. Plus, if this were a big deal then you would see a lot more cases of iPhones malfunction. Searching for helium and iPhones really only yields my original post. We can assume that this is a pretty small incident. It probably really only happens rarely in lab and healthcare environments.Heh, yeah, I doubt this is exactly easily reproducible, but...  boy, I'd love to see someone attempt to commit iPhone genocide with a helium tank or whatever, it's just such a ridiculous concept that I can't help but love it :D(seriously though anyone reading this with that idea don't pump helium anywhere you'll like suffocate everyone)I honestly thought about doing this, but I wouldn't want to risk permanently disabling all of them lol. Since I was able to reproduce it on one, I'm confident that they would all stop working. The only thing I'd be curious to see is the different behaviors and how long it takes each device to stop working.5 more replies5 more replies4 more repliesHoly shit that is weird as hell.  Maybe next time there is leftover helium from flying the event blimp we can bleed the tank off into the air returns at HQ and have some real fun.  TILI wonder what makes the Apple devices susceptible but leaves other devices alone.I wonder what makes the Apple devices susceptible but leaves other devices alone.Great question. I'm afraid we'll probably never know what specific micro component flaked out. I wonder if it was just one component, or some sort of cascade failure that led to the phone locking up.That is crazy.  The emphasis on the phone fully discharging from the rep may suggest it's something in the power management circuitry.Fuckin weird for sure.3 more replieshttps://www.reddit.com/r/sysadmin/comments/9mk2o7/mri_disabled_every_ios_device_in_facility/e7g5rcw/This explains what's up.3 more repliesBRB, flooding the office with HE so I don't have to deal with iOS devices.This is some 500-mile email shit right here OP.  Excellent sleuthing, we're all proud as hell.Thank you (: I generally tend to be pretty detailed, and I didn't want to slack on this post since the OP gained so much traction.I dare say this is going down in IT History, not just around here, and a lot of that is your thorough documentation.I'll be telling this one to my grandkids.3 more repliesCan I ask where did this quote come from:If your device has been affected and shows signs of not powering on, the device can typically be recovered.  Leave the unit unconnected from a charging cable and let it air out for approximately one week.  The helium must fully dissipate from the device, and the device battery should fully discharge in the process.  After a week, plug your device directly into a power adapter and let it charge for up to one hour.  Then the device can be turned on again.I'm searching for that in the Apple doc but not finding it.That piece is from the Apple rep directly. I'm curious where they got that from. Maybe they've encountered this issue in the past and discovered that letting the phone discharge generally fixes the issue.2 more repliesApril 1st: Hi, can you deliver a tanker of helium to 1 Infinite Loop?1 more replyI wonder specifically what it is about helium that causes the phones not to work. That seems so bizarre to me.Apple switched to cheaper MEMS oscillators instead of a Quartz crystal for timekeeping. This happened since the iPhone 6 so explains why earlier devices are fine. Android devices all use Quartz crystals. MEMS oscillators are cheaper, but slightly less accurate and can’t deal with Helium.1 more replySince helium is an inert gas, it cannot be reacting chemically. So it must be displacing a gas that something in the phone expects to exist, that is to say air.I've linked this post to the /r/engineering subreddit here. with any luck, they may have some insight into how this failure mode actually occurs.1 more replyI hope you make a KB for that in your ticket system.Did you company have to replace a bunch of workers phones?Yeah we ended up swapping the effected devices. While the vendor was right about the phones turning back on, we certainly weren't going to risk taking their word for it. Even though they were right we weren't going to just say \"Sorry you can't use your personal phone for a few days.\"2 more repliesHow much helium would one need to release in an Apple store? Asking for a friend.2 more repliesThe BOFH adds a new tool to his arsenal...Helium huh? I appreciate the follow up post OP, I had forgotten all about your incident in the days since.I don't have any questions though, just wanted to relay the above thanks for the follow up :)I find it mildly amusing that your video uses the Windows XP welcome / first boot music.That is definitely some weird shit.I'm glad somebody noticed lol. Honestly I had to mute the video as I was having a conversation with my boss in the background. I wasn't really sure what to use and there was an XP video in my liked playlist on YouTube, so I figured I'd use that!There's a /r/MRI sub, which is inhabited (at least in part) by radiographers, you might want to post this on there.Former GE MRI engineer here. Holy shit.Thank you for following up OP.224 more replies286kSubscribers1.3kOnlineA reddit dedicated to the profession of Computer System Administration.A collection of useful references52,517 subscribers5,217 subscribers13,080 subscribers"}