{"id": "Malware", "paragraph": "Hey all, pretty new to doing any sort of malware analysis and am currently doing a project for my cyber-threat intelligence class. I am attempting to replicate the worm attacking another windows box.Currently firewall is turned off on both machines and they can reach each other. However I cannot get box 1 to attack box 2. My theory is that since I have it restricted to only my environment it detects it is within a VM and doesn't attempt to spread.Anyone have any thoughts on this?Wannacry will run in a VM. Hard to see whats going on here.  Are the OS's patched against EternalBlue?Sorry, was trying to show both VMs being able to talk to each other. The box on the left is currently infected with WannaCry, so I assume it is vulnerable to EternalBlue? This is a very old Windows 7 ISO and both boxes are built off the same ISO.Edit: Just verified EternalBlue vulnerability with EternalBluesHere is the MD5 that does work. Thank you for your replyDb349b97c37d22f5ea1d1841e3c89eb4there are several variants of wannacry, each with their own potential kill switches.  there should be two threads running for spreading, one against the local subnet, one against a random subnet.  you should see an obvious pattern of increasing ip addresses being hit when it is trying to spread.just general information because the screenshot is too small for me to read.I thought the kill switch was to detect fake dns entries.Eg, If this nonsense domain exists, then I am being sandboxed etc?That's a viable theory, but there could be other reasons.    I'm not sure why that would be selected prior to other sandbox detection methods that don't open up the malware to being disabled by a researcher, like what happened with wannacry.  I don't study malware, I performed early reverse engineering efforts on things like cryptowall.  But now I've moved on.Here is the sample that I am using: MD5: 84c82835a5d21bbcf75a61706d8ab549In wireshark I don't see it attempting to attack anything. No SMB packets are being sent to any IPs. Possible that I have a different variant?Thank you.Here's a report on that variant: https://www.pandasecurity.com/mediacenter/src/uploads/2017/05/WannaCry_Report-en.pdf&sa=U&ved=2ahUKEwjQnuHSj5beAhUJUt8KHYMqC8MQFjACegQICRAB&usg=AOvVaw2hnSw6JfqZPiRa5rTizH1tCheck to see if you observe the kill switch domain. I'm not sure what happens if it can't do a dns lookup, I'm not sure what the lack of internet connection will do to the malware.I'd check to see if the persistence service is created. I'd check to see if it is injecting the threads into lsass, but I'm not sure I can easily explain how to do that. I don't know what the anti debugging capabilities of wannacry are, either.That link 404's. I'm really interested in reading the report if you have another link.https://www.pandasecurity.com/mediacenter/src/uploads/2017/05/WannaCry_Report-en.pdfHere is the MD5 that does work. Thank you for your replyDb349b97c37d22f5ea1d1841e3c89eb433.1kSubscribers34OnlineA place for malware reports and information."}