{"id": "Doddie Weir continues making memories amid battle with MND", "paragraph": "By Andy BurkeBBC Sport ScotlandShare this with\"I'm still here, boys,\" announces Doddie Weir as he strides into a bar within Murrayfield Stadium wearing a smile even brighter than his signature tartan suit.Rarely can anyone, anywhere have countered a disease as devastating as Motor Neurone Disease with such extraordinary good humour.That's Doddie though. It didn't take a life-changing diagnosis to suddenly spark a lust for life or determination to look on the bright side of it.\"Never a bad party, never a dull moment and that's the way I've gone into life,\" he says. \"Certainly fighting MND is like that as well, there's no point in getting down. I am where I am, so you have to try to build and fight that.\"In a career that scaled the heights of 61 Scotland caps and selection for the British and Irish Lions, Doddie Weir won plenty of battles. The challenges now are smaller, more mundane, but every bit as important.\"It sounds a bit bizarre - tying my shoelaces is very tricky, but I managed to do that,\" he reveals. \"I continue to do that and that's quite a positive. It might not be big for some people, but people with MND will understand. \"If you keep doing these things you're staying ahead of the disease and that's where I am in life at the moment.\"The former Melrose, Newcastle and Scotland lock is speaking at the launch of his new autobiography, a project he says has been long in the pipeline but hastened by his changing circumstances.\"I've been thinking about it for 20 years and with my recent diagnosis - I'm not sure how long I've got left - that compelled me to put pen to paper and put my very enjoyable life together to show my story,\" he says. \"So here we are - finally - after about eight months of intensive work and I'm very pleased.\"It was a fantastic exercise because I've been very fortunate from day one. I've loved every minute of what I've been doing and I have no regrets. It's given me a smile on my face when I wake up and it's just shown me how lucky I've been. \"The book mentions the fight as well, so it's a continuation of what we're trying to do.\"The fight, of course, is with his health. To look at him wise-cracking with journalists, it's hard to detect obvious signs of deterioration. Doddie will have reached the two-year mark in December since his diagnosis and is determined to maximise every moment.The sheer force of his personality has helped raise substantial awareness and money in the fight against MND through the work of his charity, My Name'5 Doddie Foundation.\"With any luck, I've got a year, a year plus, to enjoy this,\" Weir says. \"With the foundation and team and support behind us, it has just been unbelievable.\"I think being active has helped me to be where I am and not have as many symptoms as what I could have. There's no measure on that, but I do think keeping busy has had a major impact on where I am.\"The generosity and support we've had is unbelievable, because I'm not quite a year old in the foundation. \"We're going to try to put £1m into research and caring and we've pretty much done that in one year and that wouldn't have been possible without the support we've received. Keeping everything active is very important.\"Wales meet Scotland at Cardiff's Principality Stadium on Saturday to contest the Doddie Weir Cup. In November, Murrayfield witnessed a powerful and memorable moment as Doddie, flanked by his sons, brought the match-ball on to the pitch ahead of Scotland's meeting with New Zealand. Scottish Rugby was almost left with a bill for a new stadium roof such was the thunderous reception afforded by the Scotland fans for arguably their favourite son. Saturday is set to be another emotional day.\"Things like that just make it worth getting up in the morning,\" he adds. \"It's going to be amazing. I've got a new suit getting ready, so look out. \"I think my three kids are going to be involved and my good lady is going to be involved this time, so the whole family might be there to pull out the cup. \"What's quite special is having a cup named after you and still being here to celebrate it.\"Big Doddie - still here, still making memories.Share this withAberdeen director Dave Cormack has a big vision for his hometown club, one which includes Californian kids wearing the club's kit.The story of Robert Rowan, who died aged 28 on Tuesday after living his dream in football after compiling dossiers on the 2009 Champions League final.After beating Albania on Saturday night, what now for Scotland's Nations League hopes with a game to go?Four strikers, just 10 goals. So who should Scotland manager Alex McLeish start in the Nations League games with Albania and Israel? Review the contenders and choose your favourite.The transfer window might not be open, but Celtic have signed Ettore 'Ettorito97' Giannuzzi and Luca 'ildistruttore-44' Tubelli... for their esports team.Stuart Hogg will move from Glasgow Warriors to Exeter Chiefs next year. Watch the Scotland full-back's 11 Six Nations tries.Everything you need to know about following football with BBC Sport ScotlandScotland v South Africa - live coverage of the autumn international at Murrayfield Kick-off: 17:20 (GMT)Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}