{"id": "MLS: Wayne Rooney, Bradley Wright-Phillips, Johnny Russell, Josef Martinez", "paragraph": "By Matt DavisBBC SportShare this withWayne Rooney's impact at DC United; Bob Bradley's redemption with new boys Los Angeles FC; the Serie A reject breaking goal records; a Scotland winger making a name for himself in the US midwest and a certain Zlatan Ibrahimovic.Major League Soccer has had it all this season - and it is just warming up.After the play-off picture was finalised on Sunday's 'decision day', BBC Sport takes a look at the key stories behind the contenders for the MLS Cup.DC sat bottom of the Eastern Conference when Rooney, Manchester United's record scorer, joined from Everton in June.But his impact on and off the pitch in Washington has been huge.He was named DC captain after just three games and has dragged the team into the post-season with his goals, assists and work ethic.The former England captain, 33, scored 12 goals and had seven assists in 19 games as DC United clinched a play-off spot with a game to spare.After two wins in their first 14 games, DC United have now gone 10 matches unbeaten and won their past five, reaching the MLS post-season for the first time since 2015 after climbing to fourth place.Rooney, who earns $2.7m (£2.1m) a year, has proved a huge draw and in just over four months in the league has sold the fourth most shirts.Venezuela striker Josef Martinez has spearheaded Atlanta United's run this year as they finished second in the Eastern Conference.Martinez broke the league record for most goals in a season in August and finished with 31 goals in 35 games to win the MLS Golden Boot.The 25-year-old was initially signed on loan from Torino in 2017, before making his move permanent from Serie A.\"I don't regret what happened,\" Martinez told BBC Sport of his time at Torino, where he scored 11 goals in three years.\"If I could correct things, I'd correct a few but it was a learning experience, more than anything off the field. \"I'd like to be here. It's the place where I am now, the love I'm shown here, and that's something you can't buy at any club.\"At first I didn't know much about the league but since I've been here I've realised that it was a great choice.\"Martinez has been linked with a move back to Europe, but says he is \"not thinking about returning at the moment\", while team-mate Miguel Almiron, a midfielder, is reportedly being chased by a number of Premier League clubs.Atlanta boss Gerardo Martino, who managed Barcelona in 2013-14, is leaving the club at the end of the season and Martinez credits a lot of his success to the Argentine.\"The relationship with Tata (Martino) goes beyond the field, it's like few others I've had with coaches,\" said Martinez, who has scored 51 goals in 55 MLS games.Speaking about his season, he added: \"I'm in a good moment. I've never had a season like the one I'm having. When one scores, obviously you feel satisfaction. But this is still going. We still have games left and need to finish the season in the best way.\"\"I've seen [some of my TV interviews] sometimes have subtitles,\" said Scotland forward Johnny Russell. \"But I do not take offence.\"The 28-year-old Glaswegian joined Sporting Kansas City from Derby County in January and has scored 10 goals and has 10 assists in 33 games this season, including a hat-trick against Vancouver Whitecaps in April.\"It's been the perfect season for me,\" the former Dundee United player told BBC Sport. \"I feel like I am playing the most consistent I have in my career.\"Russell scored 34 goals in 203 games at Derby, but admits he \"lost the buzz\" playing football in England and realised it was \"probably time to try something new\".\"It is one of those things, for some reason I could not find the level I knew I was capable of playing at at times, that was the most frustrating part,\" he said.\"I felt I let myself and team-mates down. It's an experience I've learnt from. I have always been confident, but sometimes I lost that at times in England. Once I got my confidence back, I knew the goals would come.\"Just to have that feeling back, loving what I am doing, I am feeling good at the minute and getting the best out of myself, which you can see on the pitch.\"Sporting finished top of the Western Conference.\"It's [coming to MLS] been completely different from everything I was used to,\" Russell added. \"Maybe it has got a little bit extra out of me.\"I have never been involved in a play-off format before, I have never won anything in my career.\"When I hear some of the comments [about MLS], I think they are little bit over the top and disrespectful. For a long time people looked at the league and thought players come out here to relax, but it is not like that any more.\"It's been a record-breaking season for New York Red Bulls and their star player Bradley Wright-Phillips.The Englishman, who previously played for Manchester City, Southampton, Plymouth and Charlton, became the fastest player in MLS history to reach 100 goals in July.Red Bulls' all-time top goalscorer also became the first player to score 20 or more goals in three different MLS seasons.The 33-year-old, who is the brother of ex-Manchester City winger Shaun and son of Arsenal legend Ian Wright, has scored 20 goals this season - the third most in the league. The club retired his 99 shirt in August.Red Bulls beat Atlanta United to the Supporters' Shield on the last day of the regular season - awarded to the club with the best regular season record.Their 71 points and 22 wins is the most in MLS history.Who could have imagined the play-offs would be without Zlatan Ibrahimovic?The Swede, 37, has made his presence felt in typical fashion since joining LA Galaxy from Manchester United in March.Ibrahimovic announced his own arrival in MLS with a full-page advert in the Los Angeles Times, saying: \"Dear Los Angeles, you're welcome.\"He then marked his debut in March with a remarkable match-winning cameo, scoring twice against Los Angeles FC after coming on as a substitute with 20 minutes to go.It has been an eventful season for the former Juventus, Inter Milan, Barcelona, AC Milan and Paris St-Germain striker, who has sold the most shirts in the MLS and appeared on numerous US talk shows.In 27 games he has scored 22 goals, been sent off and last month scored his 500th career goal, later calling himself \"god of goals\".But a 3-2 defeat by Houston on Sunday, the final day of the regular season, saw Ibrahimovic, former England left-back Ashley Cole and the rest of the Galaxy squad miss out, with Real Salt Lake qualifying instead.That means a first taste of the play-offs for ex-Manchester City defender Nedum Onuoha, who joined Real in September.Bob Bradley was the first American to manage a Premier League club, but lasted just 85 days in charge at Swansea before he was sacked in December 2016.His next job was leading Los Angeles FC in their debut season and they have exceeded all expectations.LAFC easily reached the play-offs and won a record number of points for a team in their inaugural season.Bradley, 60, will be hoping he can repeat his heroics from Chicago Fire's debut season in 1998, when he led them to the MLS title.One of LAFC's celebrity owners is actor and comedian Will Ferrell, who has been a regular at the Banc of California Stadium this season. Footage went viral of him leading chants among the club's passionate supporters.New York Red Bulls, Atlanta United, Sporting Kansas City and Seattle Sounders earned a first-round bye by finishing in the top two positions in the Eastern and Western Conference.They go straight through to the Conference semi-finals where they will face the winners of the four knockout round matches, which take place on Wednesday and Thursday.Knockout round31 October, Western Conference: FC Dallas (fourth seed) v Portland Timbers (fifth seed)Eastern Conference: New York City FC (third seed) v Philadelphia Union (sixth seed)1 November, Eastern Conference: DC United (fourth seed) v Columbus Crew (fifth seed)Western Conference: Los Angeles FC (third seed) v Real Salt Lake (sixth seed)The Conference semi-finals are played over two legs between 4 and 11 November. New York Red Bulls, as the top seed in the Eastern Conference, will face the lowest advancing seed, while Sporting Kansas City will play the lowest advancing seed in the Western Conference. The Conference Championships are also over two legs on 25 and 29 November. The MLS Cup final is on 8 December. The finalist with highest regular season points total will host the match.Share this with            Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}