{"id": "Do you speak Telugu? Welcome to America", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowClaim: Telugu is the fastest growing language in the US.Verdict: Yes it is, according to a study by an American think tank. The number of speakers of Telugu, a south Indian language, has grown by 86% in the last seven years. However, it is still outside the top 20 of the most widely-spoken languages other than English.Think of the most commonly-spoken languages other than English in the United States and this one from southern India may not spring to mind.The number of US residents speaking Telugu rose by 86% between 2010 and 2017, according to an online video by the World Economic Forum.The video referred to a study by the US-based Centre for Immigration Studies, which analysed census data to look at the pace at which languages are being spoken in America.So what's behind the rise of Telugu?Telugu is mainly spoken in the south Indian states of Andhra Pradesh and Telangana. They have a combined population of 84 million people. It's the fourth most spoken language in India, according to the 2011 census.The study on languages spoken in the US used data from the American Community Survey and compared the number of people who said they spoke a language other than English at home in 2010 and 2017. Last year there were more than 400,000 Telugu speakers in the US - nearly double the number in 2010. Out of the top 10 fastest-growing languages in America, seven are from South Asia. So why Telugu?A lot of this can be attributed to the links forged between the city of Hyderabad and the US engineering and technology industries, says Prasad Kunisetty, founder of the Telugu People Foundation, a non-profit organisation in the US. Mr Kunisetty moved to the US in 2001 seeking a career in the IT sector.The rapid growth of information technology in the mid-1990s led to a huge demand for software engineers, he said. Many were recruited from Hyderabad, the biggest Telugu-speaking city. Both Telugu-speaking states together now have more than 800 engineering colleges. The city has become a major hub for the technology and engineering industry in India and has been sending students to the US in droves. Down the years Telugu-speaking Americans have continued to hire software engineers from Andhra Pradesh and Telangana. Many Indians benefit from the H-1B visa scheme, which provides work visas to thousands of foreigners each year often in the technology sector. An estimated 70% go to Indian workers. It allows recipients of the visas to apply for permanent residency status. Notable US-based Telugu speakers include the first Indian-American Miss America Nina Davuluri and the current Microsoft CEO Satya Nadella.The rise of Telugu is significant as a percentage increase but it started from a low base compared to other languages.There were more new speakers of Spanish (up to four million more), Chinese, Arabic and Hindi between 2010 and 2017, according to the Centre for Immigration Studies. Of the more than 60 million people that speak a language other than English out of the total population of about 320 million, the vast majority speak Spanish.  Out of the most commonly spoken South Asian languages, Hindi is first, followed by Urdu, Gujarati and then Telugu.The number of people who speak French and German at home has declined. The number of Italian speakers has decreased by more than 200,000 in the last decade. About 80% of the Telugu-speakers surveyed said they speak English very well.However, one shortcoming of the census data is that the respondents are asked how well they speak English and not about proficiency in other languages, says Jennifer Leeman, a professor of linguistics at George Mason University.\"It's hard to know the non-English proficiency of those people who speak English well, especially if they were born in the US or immigrated as children.\" Read more from Reality CheckSend us your questionsFollow us on TwitterFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}