{"id": "Oliver's legacy: MPs to debate learning disability petition", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowA petition started in honour of a dead teenager, calling for doctors and nurses to receive mandatory training in autism and learning disability, is set to be debated by MPs.Oliver McGowan, 18, had mild autism, epilepsy and learning difficulties. He died in hospital in Bristol in 2016.His mother Paula said the petition would be Oliver's legacy and has asked that his case be included in training.She said better education of medical staff would have saved her son's life.It is being backed by Beverley Richards, mother of Katy Lowry, who died aged 30 at Royal Cornwall Hospital after doctors failed to carry out basic medical checks in A&E.While in Southmead Hospital in November 2016 Oliver, from Bristol, was prescribed the anti-psychotic drug Olanzapine. This was despite him and his parents repeatedly telling medics he should not be given it because he had reacted badly to the drug in the past and because he did not have a mental health diagnosis.An inquest into his death in April heard the Olanzapine caused Oliver to contract the rare condition Neuroleptic Malignant Syndrome, causing his brain to swell and his eventual death.The coroner ruled the drug had been properly prescribed but since then Mrs McGowan has been campaigning for better health care for people who have autism and learning disabilities.She said Oliver became anxious when they arrived in A&E and began repeatedly talking about gaming.\"They (the medics) were saying he was delusional,\" she said. \"We were saying 'no this is normal for Oliver'.\"Mrs McGowan said Oliver had been sitting on the bed with about four or five people standing over him, which she said would be enough to make anyone feel anxious, and he was restrained by police officers, one of whom threw him on a bed.She believes Oliver's behaviour during his admission to hospital contributed to the decision to prescribe Olanzapine.\"Oliver just wanted to go home,\" she said. \"All he needed was little bit of reassurance. I think they just forgot the basics... They did not understand his autism and weren't making any reasonable adjustments for him.\"She said better training \"would have saved Oliver's life\" and she wanted to work with the doctors and nurses because \"it is not their fault that they are not trained\".The debate comes a month after the government's response to the Learning Disabilities Mortality Review, which included a recommendation of mandatory basic training in, and awareness of, learning disability for health and care staff.Mrs McGowan said that was \"fantastic\" but she had concerns the basic training would not go far enough - or include all of the right staff.She said she wanted training to tackle \"preconceived ideas of what autism and learning disability is\", to target undergraduates and to be face-to-face rather than e-learning.\"That is Oliver's legacy; that's Oliver's way of giving something back,\" she added.Mrs Richards, whose daughter had chromosomal abnormalities and learning difficulties, said proper training was needed but she was concerned that without a change in peoples' attitudes it would not be enough. \"The sad thing in Katy's case is they just took one look at her and made an assumption that that was as good as it got,\" she said.\"Somebody with learning disabilities who is 30 - that must be it.\"They didn't see her going down the Grand Canyon in a helicopter, they didn't see her white water rafting, all they could see was somebody with a learning disability.\"Miss Lowry was taken to Royal Cornwall Hospital on 13 December 2016, after vomiting every 15 minutes for nearly 24 hours.While in A&E her observations - which would have shown how sick she was - were not taken and she collapsed two-and-a-half hours after being admitted.A coroner ruled her death was due to natural causes contributed to by neglect at the hospital.Mrs Richards said: \"I spent 30 years fighting every aspect, making sure she had a quality of life the same as everybody else and for me, when she needed it most perhaps I didn't fight enough.\"But I didn't know I was fighting a battle - we just sat there and waited like we were told to.\"Mrs McGowan said she previously met with minister for care, Caroline Dinenage, who is leading the response to the debate, and asked if Oliver's story could be included as a case study in any training for healthcare professionals.Ms Dinenage said: \"Every person with a learning disability or autism must receive the same high quality care we all expect. For too long many people with learning disabilities or autism have had their lives tragically cut short, in part because of a lack of understanding about their needs. This must end.\"She said proposals for mandatory learning disability awareness training would be consulted on.\"This consultation will consider the scope and nature of the training and how autism is incorporated,\" she added.\"Support will be improved to help enhance the lives of people with learning disabilities or autism across the country - anything less is unacceptable.\"The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}