{"id": "Melbourne Cup: British horses bid to finally win Australia's 'race that stops a nation'", "paragraph": "By Cornelius LysaghtBBC horse racing correspondentShare this withPlenty of UK athletes have travelled down under and found the going heavy, but none more so than those targeting horse racing's Melbourne Cup. A string of European challengers have carried home the prize - from France and Germany, as well as Ireland, firstly through Vintage Crop in 1993, and most recently with Rekindling in 2017. No British trained horse, though, has ever won the 'race that stops a nation', first staged in 1861.The list of close calls contains no fewer than eight second placings, three by the redoubtable Red Cadeaux, who was much-admired by Australians for his nearly-exploits and is buried at Flemington, the Cup's home track. Aussie racing figures once lauded the globalising of one of their great sporting institutions, but now ponder whether it has become too international - 2017 saw eight of the first 10 home from outside Oceania. This year too, overseas challengers dominate the richest two-mile handicap in the world, worth in all A$7.3m (£4.06m). Yucatan, one of Irish champion trainer Aidan O'Brien's trio of raiders, heads the field, while six horses based in the UK are close up behind him in the big-race betting market: Magic Circle, Cross Counter, Muntahaa, Best Solution, Marmelo and A Prince Of Arran. Scotland-trained Nakeeta, fifth last year, has also made the trip.The Ian Williams-trained Magic Circle has made a particular impact during the frenetic build-up in Melbourne. This is partly because he has won his only two races this year - the Chester Cup and the Henry II Stakes, Sandown, both in May - but also because of his colourful owner Dr Marwan Koukash. The multi-millionaire, formerly owner of the Salford Red Devils rugby league team, had to be persuaded in May not to collect the Chester Cup semi-naked. He has suggested he may do so in Australia. In news conferences, Koukash has been showing off a thong he says he will wear - with tie and shoes - to collect the Melbourne Cup. Williams admits that Koukash - whom, he jokes, is \"a bloody nightmare\" to train horses for - has the local media riveted. \"The boss-man is certainly making himself very apparent and very well-known,\" he said. \"But look through all the banter, we've definitely got a serious contender, and it's great to be here not just for the day out but with a proper and serious contender.  \"I think Magic Circle has quite an incredible turn of foot, and what he can do in the last four or five hundred metres of a race is something quite exceptional.\"He's a horse that's often slow into stride, so hopefully he can sneak into it down the back straight and get a nice position and then show his main asset, his finishing prowess.\"It's considered a major plus that jockey Corey Brown, a two-time Cup winner, on Shocking in 2009 and then Rekindling, is taking the mount on Magic Circle, who looks to take to a new level Williams' already successful 120-horse, flat and national hunt operation, based just outside Birmingham.\"I think as a trainer you want to push the boundaries,\" said Williams. \"We've been very lucky to have lots of winners in the UK, and we've had winners in Dubai, but Melbourne is just an exceptional place to come\"There's the whole carnival feel and the hype, and yes it's the race that stops the Australian nation, but it has such worldwide coverage and prestige - I'm very excited to be here, and with a chance.\"Analysis of the fieldShare this with            Are any of these bizarre music myths true or false?Analysis and opinion from our horse racing correspondentAll the meetings scheduled in the United KingdomHow to get into horse riding, whether you want to work with horses at the stables or become a fully fledged jockey.Latest updates and video from the world of equestrian sportsFind ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}