{"id": "Golden Horse: Zhang Yimou's Shadow wins most awards", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowOne of China's most acclaimed directors, a rising star with a tragic story and a documentary charting mass protests have all won top prizes at this year's Golden Horse awards.The 55th annual awards - dubbed the \"Chinese Oscars\" - were held in the Taiwanese capital Taipei on Saturday.Zhang Yimou's Shadow took home the most awards, including Best Director for the 68-year-old screen veteran.Best Film went to novelist-turned-director Hu Bo for his first feature.An Elephant Sitting Still was an adaptation of his own novel, which told the story of four people who run away from their troubles to search for a mythical elephant.Hu took his own life in the Chinese capital Beijing last year, aged 29. His mother accepted the award on his behalf, thanking the jury and the audience.Best documentary was won by Yue Fu, for Our Youth in Taiwan, about the island's 2014 Sunflower Movement.Accepting the award, she said: \" \"I hope one day our country will be recognised and treated as a truly independent entity. This is my biggest wish as a Taiwanese.\" Taiwan's status is sensitive. The island has been self-ruling since 1949 but China regards it as a breakaway province it will reunite with one day.By Cindy Sui, BBC News, TaipeiPolitics got in the way last night and threatens future awards ceremonies. A Taiwanese winner who made a documentary about Taiwan's anti-China Sunflower Movement said in her acceptance speech that she really hoped Taiwan would become an independent country one day. Then Chinese winners and awards presenters used the word \"China\" several times to describe Chinese-language films and one presenter even referred to Taiwan as \"China, Taiwan\". Gong Li, the leading actress and chair of the jury, declined to stand on stage with Oscar-winning director Ang Lee to present the Best Feature Film award, supposedly because of the Taiwan independence comment.Then China's government reportedly ordered all Chinese attendees to avoid the after-ceremony party and the Chinese presenter was apparently banned from the party.This is leaving Ang Lee, chairman of the Golden Horse committee, very worried about next year's awards. The festival and awards bring together the best in Chinese-language films and has been able to avoid politics in the past, but not apparently in current tense relations.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}