{"id": "Magnum China: Panoramic portrait of a global superpower", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowPhotographers at Magnum Photos have had a long-standing cultural engagement and fascination with China. Co-founders Robert Capa and Henri Cartier-Bresson first covered the country on photography assignments in the 1930s and 40s, marking the beginning of a relationship with the country that has continued throughout the decades.Magnum's photos provide a panoramic portrait of China and its people through the changes and upheavals in its recent history.Here is a small selection from the archives.Henri Cartier-Bresson's photograph shows one of the last war lords, General Ma Hung-kouei.At the time, Ma Hung-kouei reigned supreme over north-west China, but his personal army soon abandoned him. Behind him are ancient sayings, such as: \"A good general should play a beautiful role in history. He should be praised for a hundred generations. He should care for his troops and also for his people.\"Photographer Bruno Barbey visited Beijing in 1973, at a momentous time for China. Following the tumultuous years of the Cultural Revolution, the country was beginning to re-engage with the world, and Barbey's visit coincided with that of the French President, Georges Pompidou.Barbey's photograph of schoolgirls parading through Tiananmen Square shows them preparing for the reception of President Pompidou. In the background is a portrait of the Chairman of the Communist Party of China Mao Zedong, and the slogans, \"Long live the People's Republic of China. Long live the union of the people of the world.\"Eve Arnold aimed to capture images of people and dramatic landscapes, as she travelled from Inner Mongolia to Tibet, and from Beijing to Shanghai.While her landscapes show rural life, they hint at changes to come.Here, a woman trains for the militia in Inner Mongolia.  Patrick Zachmann visited China in 1982, around a time of cultural reformation. Following the death of Mao Zedong in 1976, the country began to relax its control of capital and people began to recover their individual and social freedoms.Zachmann's photo shows a crowd in Beijing watching the 'Long-Nose', a term that referred to all Westerners, including the photographer. As economic and social changes began to emerge, so too did public demonstrations.However, in 1989, unrest led to tragedy, as the government mobilised troops to take action against students occupying Tiananmen Square, killing hundreds of protesters.Stuart Franklin's photograph of a lone man confronting a column of tanks in Tiananmen Square became an iconic metaphor for these events.In 1992, Ian Berry visited Shenzhen, Guangdong Province, which was experiencing rapid urban and industrial development.Commercial investments saw an influx of people into the city; Berry's photograph portrays the coming together of ancient and modern China. With little well-paid work in rural areas, some parents made the difficult decision to migrate to the city, leaving their children behind to be raised by relatives.Chris Steele-Perkins visited one such village in Yun Nan Province, photographing some of a school's 20 ethnic Yi pupils.Their teacher, who was born in the village, had been 'temporary' for eight years because another teacher couldn't be found. Magnum Photos' book Magnum China, edited by Colin Pantall and Zheng Ziyus is published by Thames and Hudson."}