{"id": "Thugs of Hindostan: Critics sink Bollywood's 'Pirates of the Caribbean'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowBollywood superstars Amitabh Bachchan and Aamir Khan have come together for the first time in the $42m (£33m; 3bn-rupee) epic Thugs of Hindostan, one of India's most keenly awaited films of the year. But, as Sudha G Tilak writes, the glossy period film about a rebellion against British rule has failed to excite critics and the box office reception has been mixed. (Warning: This article contains spoilers.) Thugs of Hindostan is set in 19th-Century India with a noble guerrilla leader, played by Bachchan, and his ragtag army, led by a fierce female archer, attacking mighty English ships to avenge their lost kingdom and assassinated ruler. The 76-year-old Bachchan plays the role of the elder general, leading and mentoring his army. Khan plays a cocky robber with shifting loyalties. His duplicitous schemes include robbing local maharajahs and milking rewards from representatives of the East India Company - which was transformed from a trading enterprise into the rulers of India - to whom he also plays informer. He infiltrates the gang of rebels led by Bachchan and wins their confidence. However, he later has a change of heart and joins them in defeating the British.Complete with kohl-lined eyes, Khan looks like a poor man's Jack Sparrow - the lead character in Pirates of the Caribbean, the Disney franchise to which Thugs has been compared. Khan swigs rum and takes part in a risqué song and dance routine with a local dancing girl, all the while pursuing his double deception with both the guerrilla leader and a British general, played by British actor Lloyd Owen.The female lead is Fatima Sana Sheikh, who plays the archer and is in many of the action scenes. But Bollywood star Katrina Kaif, playing the dancing girl. lacks a substantial part.Viewers have likened the premise of the film to Confessions of a Thug, an English novel written by Philip Meadows Taylor in 1839. (The word thug, from the Hindi \"thag\", possibly goes back to the 14th Century, when huge criminal networks operated all around India's main roads.)The novel told the story of Ameer Ali - a figure based on many of the \"thugs\" of the time - who waylaid rich travelling parties and doubled as an informer to the British. The film tries to hit the high-octane notes with blistering cannon fire and special effects-aided fight sequences over seas with mighty ships. Warring thugs brandish swords and bare their knuckles. But despite it lavish production and array of stars, Thugs of Hindostan is no match for Pirates of the Caribbean, critics say. \"From Amitabh Bachchan, who plays a rebellious pirate determined to free India from the clutches of the British Empire, to Aamir Khan, a manipulative, self-seeking character that largely draws from the eccentricities of captain Jack Sparrow from the Pirates of the Caribbean universe, there's nothing original or exciting about Thugs of Hindostan,\" wrote Ankur Pathak of the Huffington Post.NDTV found the 164-minute film \"too tacky and unconvincing to lay legitimate claims to being India's answer to Pirates of the Caribbean\". \"Big, bloated, bombastic, Thugs Of Hindostan is a period saga that banks solely upon action and spectacle for impact,\" wrote Saibal Chatterjee.  \"The characters that populate it are, like the thousand ships that the film launches in the service of a bitter early 19th Century battle between the fast-expanding British East India Company and a band of intrepid rebels who refuse to be enslaved by a foreign power, as flimsy as cardboard,\" he added.\"This giant period epic turns out to be feeble, formulaic and entirely forgettable,\" chimed the Hindustan Times in its takedown.\"I may be old school, but I believe pirate movies need to have eye-patches. This one doesn't, and that's a shame. The viewing experience would have been hugely improved. I should have gone in wearing two,\" wrote the paper's critic Raja Sen.However, the Guardian felt that Thugs \"has that rare and unmistakable look of an event movie that was huge fun to assemble\".\"We get tactical sea battles, plenty of cove action, swordfights choreographed like dance numbers, even a fiery 19th-Century South Asian equivalent of a Norse burial. This is a film with money to burn, and it unabashedly torches each rupee before your eyes,\" wrote Mike McCahill.Thugs of Hindostan makes no apologies for the money that has been spent to make this lavish production. However, the mixed reviews from fans and critics and early box office figures suggest money alone can't buy a film's success.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}