{"id": "Garth Crooks' team of the week: Pogba, Sterling, Milner, Schmeichel, LamelaPick your Team of the Week", "paragraph": "By Garth CrooksFootball analystShare this withManchester City hit Southampton for six to open up a two-point lead at the top of the Premier League, while Tottenham climbed above north London rivals Arsenal to go fourth.There were impressive wins for Newcastle, Leicester and West Ham, with Liverpool claiming a draw at Arsenal.Manchester United, Everton and Chelsea also enjoyed a winning weekend.But which players shone to make it into my team of the week?This was a monumental test of mental strength for Kasper Schmeichel and his team-mates. I noticed in the line-up during the minute's silence before the game that Schmeichel was still emotional from the awful events that took place at Leicester City Football Club last Saturday. Nevertheless, it didn't stop the Dane from producing a first-class performance against Cardiff and a clean sheet. Their chairman would have been proud.  Did you know? In addition to his clean sheet and two saves, Schmeichel completed 25 passes against Cardiff, his second highest in a league game this season (26 v Newcastle).Wes Morgan: If ever a captain needed to keep his troops calm in an emotionally charged atmosphere then this was it. Wes Morgan was superb in defence against Cardiff and kept his team-mates focused on the job at hand. Leicester also returned to a style of football that suited them. No more tippy-tappy nonsense and the ball from side to side, but serious counter-attacking football. That's Leicester.  Did you know? Morgan made 11 clearances against Cardiff, his highest in a single Premier League match since making the same number against Manchester United in August 2017.Virgil van Dijk: There are some central defenders who are comfortable on the ball and some who prefer the battle. Virgil van Dijk can do both. The Netherlands international battled like a Trojan against Arsenal but was still capable of producing a touch of class on the ball regardless of the chaos and the pressure of the moment. That's one of the reasons Liverpool are doing so well. Is Van Dijk now the best central defender in the Premier League? I think he is you know.Did you know? In Liverpool's game against Arsenal, Van Dijk had the best passing accuracy (94.4%) of all players. \n                            Media playback is not supported on this device\n                        Rob Holding: In a team very different from the one Arsene Wenger tried to create prior to leaving Arsenal, there is a particular player who has surprised me a great deal.I've seen Rob Holding play for Arsenal but never better than when I saw him against Liverpool.In a white-hot atmosphere, the defender was cool on the ball and played with a confidence and assurance I hadn't seen before.I said Unai Emery would get it together at Arsenal, I just didn't think it would be so soon. Damn!Did you know? Only Granit Xhaka (97) attempted more passes for Arsenal against Liverpool than Holding (81) - the defender also won 70% of his 10 duels in the game.  James Milner: James Milner has taken the early lead for my Footballer of the Year. I must say that Eden Hazard is a close second but the way Milner is leading Liverpool through some very tricky games is very impressive.Against Arsenal the ball couldn't have dropped in front of a more cool-headed but utterly ruthless professional.Whatever happens between now and the end of the season I guarantee you Milner will be featuring in my TOTW on a few more occasions. Did you know? Milner's opener against Arsenal was his 50th goal in the Premier League with 14 of them for Liverpool, more than any other side he's played for in the competition.Paul Pogba: When you consider the entire Bournemouth team cost significantly less than Paul Pogba, you're perfectly entitled to think that Manchester United should have played Eddie Howe's Cherries off the park.That perception couldn't have been further from the truth but, with a swivel of the hips and a beautifully flighted cross, Pogba made the difference.The France World Cup winner's performances may not be pulling up any trees for United at the moment but they are saving Jose Mourinho's skin.Did you know? Pogba created four goalscoring chances against Bournemouth, his joint-best tally in a Premier League game this season (also four v Burnley).Felipe Anderson: West Ham were beginning to make hard work of this game at London Stadium. Fortunately for the Hammers, Burnley seemed to make life considerably more difficult for themselves, much to the delight of Felipe Anderson.The Brazilian has looked impressive on the ball this season, however, against Burnley he looked just as impressive in front of goal. This was an important win for West Ham. They can't be losing home games to Burnley. Did you know? Anderson netted more goals against Burnley (two) than he did in his first 10 Premier League appearances for West Ham (one). Anderson is the first Brazilian player to score twice in a game for West Ham in the Premier League.Erik Lamela: Last week I told you Erik Lamela had the ability to force Spurs boss Mauricio Pochettino to place Dele Alli onto the bench for a period of time. The Argentine's performance against Wolves simply reinforced what I already knew. If Alli knows what is good for him he should treat the challenge as a compliment. Competition for places has always been in the best interest of the team and the player on the bench can learn a lot. Mainly how to win his place back.Did you know? Lamela has had a hand in 11 goals in his past 12 appearances in all competitions (eight goals, three assists).Raheem Sterling: People who read my TOTW on a regular basis will know how good I think this lad can be. His performance against Southampton paid testimony to that.However, the thought of Raheem Sterling stalling on this contract extension offer with Manchester City is ill conceived. I honestly think Sterling can be the next Cristiano Ronaldo but to become the best in the world you need the best teacher or to be amongst the best players. City already have the best teacher and their players are developing fast. If Sterling knows what's good for him he should stay where he is. At least for the time being. Did you know? Against Southampton, Sterling became the first English player to both score and assist two goals in the same Premier League game since Theo Walcott did for Arsenal against Newcastle in December 2012.Alvaro Morata: I was so furious with Alvaro Morata I nearly didn't select him for my TOTW. How does a player who is finding goals so difficult to come by decide to showboat when presented with a glorious chance to get your hat-trick?For a player who has a reputation for missing chances, he cannot allow hat-trick opportunities to pass him by with such scant disregard for the goalkeeper.Morata took both his earlier goals against Crystal Palace in a professional manner - but the Spain international does not have the finishing power to be so flash in front of goal. \n                            Media playback is not supported on this device\n                        Did you know? Morata has scored four goals in his past four Premier League games - one more than in his previous 23 appearances in the competition combined (three).Richarlison: Richarlison is clearly loving it at Goodison Park. His first goal against Brighton was clinical, and his second majestic. He went around Lewis Dunk as though he wasn't there.The Brazilian is becoming the sort of player he struggled to become at Watford. Richarlison was a good player at a good club at Vicarage Road. He's fast becoming a star at a big club at Everton.Did you know? Richarlison has scored six goals in nine Premier League appearances in 2018-19, one more than his total haul from 38 games last season.You've seen my picks this week. But who would you go for?Pick your XI from our list and share with your friends.Pick your XI from our list and share with your friends.Last week we were all coming to terms with the terrible news that Leicester City had lost their chairman and talisman in a helicopter crash. In time-honoured fashion the football family came together to support those who have felt the most appalling loss. The scenes around King Power Stadium this week, where wreaths and flowers along with heartfelt messages from around the world were left, have touched everyone involved in football as the club begins its healing process.Cardiff's supporters applauding the Leicester City players off the coach prior to Saturday's Premier League fixture was a wonderful gesture, and one that represented the feelings of most football supporters across the globe.The football club must now begin its rehabilitation, and their win over Cardiff was a fabulous start.Share this with            Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.The latest rumours and stories from around the world of football.Analysis and opinion from our chief football writer.How to get into football - the most popular sport in the world, with clubs and facilities throughout the UK.Are any of these bizarre music myths true or false?Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}