{"id": "UAE 'spy' student unsupported in jail, wife says", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThe Foreign Office has failed to offer adequate support to a British student charged with spying in the United Arab Emirates, his wife has told the BBC.Durham University PhD student Matthew Hedges has reportedly been held in solitary confinement for five months.Daniela Tejada said requests to meet Foreign Secretary Jeremy Hunt had not received a response.Mr Hunt said he had raised \"a number of concerns\" about the case with his UAE counterpart.Mr Hedges appeared in court on Wednesday, and his lawyer requested that the evidence be re-examined.The court agreed and the hearing was adjourned until November 21.Ms Tejada told the BBC's Victoria Derbyshire programme there was \"absolutely no guarantee of a fair trial\" as her husband had been \"heavily interrogated without legal counsel from the beginning\".Ms Tejada, who lives in Exeter, said that after Mr Hedges was arrested in Dubai on May 5 she \"didn't receive any [meaningful] advice\" from the Foreign Office, and was directed to a charity.She said this led her to contact the media - an approach the Foreign Office has since told her could result in \"bogus charges\" being brought against her husband in the United Arab Emirates (UAE).Ms Tejada added that the Foreign Office had failed to focus on ensuring her partner's freedom - choosing instead to prioritise his welfare.She called on the government to do more to help her husband, saying accusations that he worked for the British intelligence services meant it was a \"state matter\".Mr Hunt has previously said he was \"very worried about this and I have mentioned it face-to-face with the Emirati foreign minister twice now.\"The Foreign Office said it was supporting a British man following his detention in the UAE.Free 'spy' student, academics demandFree my husband from UAE jail, wife pleadsMr Hedges was detained at Dubai Airport as he was leaving the country following a research trip on the impact of the Arab Spring on the UAE's foreign policy and security strategy.Ms Tejada said her husband has only been able to meet his court-appointed lawyer once, while the state \"has had five months\" to prepare the case against him.She said that Mr Hedges \"had been forbidden from discussing his case\" with her.She said she had been told that if found guilty, her husband's sentence could range from \"a couple of months to 15 years\". Mr Hedges has continued to be held in solitary confinement, Ms Tejada said, but his conditions had \"somewhat improved\".He had been taken to hospital \"to get an idea why he was persistently vomiting\", she said, with anxiety thought to be a cause.  \"He comes across as a strong person because he is very big, played rugby, but he is very vulnerable,\" she continued.The UAE government said in a statement that \"since his arrest Mr Hedges has been provided with constant medical and psychological care.\"Mr Hedges has the ongoing facility to contact family, embassy and consular staff and his legal counsel by phone,\" it added.\"The UAE constitution also provides that an accused person shall be presumed innocent until proven otherwise in a legal and fair trial.\"Watch the BBC's Victoria Derbyshire programme on weekdays between 09:00 and 11:00 BST on BBC Two and the BBC News Channel in the UK and on iPlayer afterwards.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}