{"id": "Gareth Anscombe expects contest for Wales fly-half jersey", "paragraph": "Share this withGareth Anscombe expects a battle to keep his starting place during Wales' autumn international series.The Cardiff Blue impressed at fly-half in Saturday's 21-10 win over Scotland at Cardiff's Principality Stadium.Northampton number 10 Dan Biggar was unavailable for that match, but will be in the selection mix against Australia next Saturday.\"Obviously I want to be there, but there are other guys fighting for positions,\" Anscombe said.Biggar was unavailable for the Scotland encounter as it fell outside World Rugby's official Test window, meaning players based outside Wales were not made available by their clubs.Scarlets' Rhys Patchell was also absent because of concussion.Anscombe took his opportunity impressively but realises Warren Gatland's squad has strength in depth for the coming Tests with Australia, Tonga and South Africa.\"It is a good thing for Welsh rugby that we have developed a pretty good group of 40, so any guys can slip in and do a job,\" said Anscombe, who has also been capped at full-back. \"We are a pretty tight bunch and a good group of lads. At training, we have to fight it out.\"I really wanted to take the opportunity. From a personal point of view there was some good, some bad, but to be part of a win at home is nice.\"\n                            Media playback is not supported on this device\n                        Gatland hinted that a small number of changes could be made to his starting XV for Australia's visit to Cardiff.\"What we have developed is really good depth in the squad. For the coaching team there is a real challenge in terms of who we are going to pick,\" said the coach.\"There will be some rotation in the squad and Dan is going to get an opportunity in this campaign, but there were some really pleasing aspects from an attacking perspective from Gareth.\"Some of our kicking from nine and 10 still needs to be worked on and to improve, and they will continue working hard on that to make sure that aspect of their game is better in the future.\"Wales have not beaten Australia since 2008 - Gatland's first year in charge of Wales - with the Wallabies reeling off 13 successive wins, although six of those Welsh defeats were by five points or fewer.With Wales' pool opponents at the 2019 World Cup including Australia, along with Fiji, Uruguay and Georgia, Saturday's encounter has extra nuance.\n                            Media playback is not supported on this device\n                        Anscombe added: \"They (Australia) are an exciting team and have had their recent defeats that have put them under a bit of pressure, but they will come here and be pretty positive.\"Being away from home will probably be good for them. We will have to be a hell of a lot better than we were (against Scotland).\"We know where we need to be against the Wallabies, so hopefully we can give it a good crack.\"If Wales end their Wallabies hoodoo, they will increase an unbeaten run against all opponents to seven Tests, which they last accomplished during the 2004-05 season.After taking on Australia, Wales host Tonga on Saturday, 17 November and South Africa seven days later.\"We are building some nice depth in the squad and some real confidence, with guys really competing for positions,\" Gatland added.\"It's two things - it is wanting to do well this autumn, but the big picture is the next 12 months building for the Six Nations and the World Cup after that.\"Pick your starting XV for Wales' match against Australia on November 10th.Share this with            Are any of these bizarre music myths true or false?Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.How to get into rugby union - through the age groups up to the 15-player game or try rugby sevens, which made its Olympic debut in 2016.Enjoy the best debate, analysis and interviews with BBC 5 live and World Service plus our rugby union commentary listings.This week's sport on the BBC includes the ATP World Tour Finals, the ICC Women's World Twenty20 and the home nations' football internationals.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}