{"id": "Carabao Cup: Nigel Clough says guiding Burton into last eight is 'special'Scores, Results & Fixtures", "paragraph": "Share this withNigel Clough said it is \"special\" to have guided League One Burton to the quarter-finals of the Carabao Cup for the first time after a thrilling victory over Championship opponents Nottingham Forest.After a goalless first half, Saidy Janko's own goal and strikes from Scott Fraser and Jake Hesketh secured the win for Burton, who were forced to hold on in injury time after substitute Arvin Appiah added to Lewis Grabban's effort to give Forest hope of forcing penalties.Clough reached the last four with Sheffield United in 2015 when the Blades were knocked out by an 88th-minute strike from Tottenham's Christian Eriksen.\"To get to the last eight as a League One club is pretty special,\" Clough told Sky Sports. \"We can't wait for the draw. We reached the semi-finals with Sheffield United, so it is possible. You need a bit of luck, like we had tonight.\"It was a deserved win for Burton, who were playing at this stage of the competition for the first time in their history.They could have gone ahead in the first half but Northern Ireland striker Liam Boyce sent a penalty well over the bar following a rash tackle by Liam Bridcutt on Jamie Allen. Forest also had goalkeeper Luke Steele to thank for a fine stop to deny David Templeton after he had fumbled another Boyce effort.Burton did eventually go ahead seven minutes into the second half when Fraser's long-range effort deflected off Forest defender Janko and looped beyond Steele for an own goal. Fraser then doubled Burton's lead 12 minutes later with a smart finish from Boyce's pass.Forest substitute Grabban converted Gil Dias' through ball to bring the visitors back into the game, only for Hesketh's fine volley to restore Burton's two-goal lead. Another Forest substitute, 17-year-old forward Appiah, scored his first goal for the club in stoppage time but could not deny Burton victory.\"If we had finished our chances in the first half the game would have been over, but it showed great character to come out and do it again,\" added Clough.Forest boss Aitor Karanka apologised to the supporters after the game and said he was \"embarrassed\" by the performance of his side, which showed 10 changes from the team that drew with Leeds at the weekend.\"We had a chance to reach the quarter-finals for the first time in 25 years and it is a real missed opportunity,\" said Karanka. \"If we were complacent then that should never have been the case because we were playing to reach the quarter-finals.\"I'm really angry because a team from League One, a team which has played four games in 10 days, has looked much better than us. They were much stronger and they wanted everything more than we did.\"I can't understand why that was the case and I don't want to say something that I'll regret tomorrow. I just feel embarrassed and sorry for the supporters who travelled this evening because we all came here thinking we could achieve something good.\"Match ends, Burton Albion 3, Nottingham Forest 2.Second Half ends, Burton Albion 3, Nottingham Forest 2.Foul by Lewis Grabban (Nottingham Forest).Kyle McFadzean (Burton Albion) wins a free kick in the defensive half.Delay over. They are ready to continue.Delay in match John Brayford (Burton Albion) because of an injury.Corner,  Nottingham Forest. Conceded by Kyle McFadzean.Arvin Appiah (Nottingham Forest) wins a free kick in the defensive half.Foul by Marvin Sordell (Burton Albion).Goal!  Burton Albion 3, Nottingham Forest 2. Arvin Appiah (Nottingham Forest) left footed shot from the right side of the six yard box to the centre of the goal.Attempt saved. Arvin Appiah (Nottingham Forest) right footed shot from the centre of the box is saved in the centre of the goal. Assisted by Diogo Gonçalves with a through ball.Offside, Burton Albion. Stephen Quinn tries a through ball, but Liam Boyce is caught offside.Corner,  Burton Albion. Conceded by Matthew Cash.Substitution, Burton Albion. Joe Sbarra replaces Jake Hesketh.Delay over. They are ready to continue.Delay in match Jake Hesketh (Burton Albion) because of an injury.Attempt missed. Matthew Cash (Nottingham Forest) header from the right side of the six yard box is too high. Assisted by Joe Lolley with a cross following a corner.Corner,  Nottingham Forest. Conceded by Lucas Akins.Substitution, Burton Albion. Jake Buxton replaces Scott Fraser.Substitution, Nottingham Forest. Arvin Appiah replaces Liam Bridcutt.Hand ball by Jake Hesketh (Burton Albion).Foul by Ben Watson (Nottingham Forest).Jake Hesketh (Burton Albion) wins a free kick in the defensive half.Goal!  Burton Albion 3, Nottingham Forest 1. Jake Hesketh (Burton Albion) right footed shot from the centre of the box to the bottom right corner. Assisted by Scott Fraser.Offside, Nottingham Forest. Ben Osborn tries a through ball, but Lewis Grabban is caught offside.Foul by Liam Bridcutt (Nottingham Forest).Scott Fraser (Burton Albion) wins a free kick in the defensive half.Liam Bridcutt (Nottingham Forest) wins a free kick in the defensive half.Foul by Jamie Allen (Burton Albion).Corner,  Burton Albion. Conceded by Michael Hefele.Corner,  Burton Albion. Conceded by Gil Dias.Corner,  Burton Albion. Conceded by Luke Steele.Attempt saved. Scott Fraser (Burton Albion) left footed shot from the centre of the box is saved in the bottom right corner. Assisted by Liam Boyce.Ben Osborn (Nottingham Forest) wins a free kick in the defensive half.Foul by Jake Hesketh (Burton Albion).Goal!  Burton Albion 2, Nottingham Forest 1. Lewis Grabban (Nottingham Forest) right footed shot from the centre of the box to the bottom right corner. Assisted by Gil Dias with a through ball following a fast break.Substitution, Burton Albion. Marvin Sordell replaces David Templeton.Substitution, Nottingham Forest. Joe Lolley replaces Saidy Janko.Foul by Saidy Janko (Nottingham Forest).David Templeton (Burton Albion) wins a free kick on the left wing.Share this with            Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}