{"id": "Women's World Twenty20: England beat Bangladesh after more rain in St Lucia", "paragraph": "By Jamie LillywhiteBBC SportShare this with\n                            Media playback is not supported on this device\n                        Debutant Kirstie Gordon took 3-16 as England beat Bangladesh by seven wickets on the Duckworth-Lewis-Stern method at the Women's World T20.After their opener against Sri Lanka was abandoned without a ball bowled on Saturday, England won the toss and soon had Bangladesh 3-2 in St Lucia.Left-arm spinner Gordon, one of three debutants, helped limit them to 76-9.Danni Wyatt fell to the first ball of the reply but England reached a revised target of 64 with 39 balls to spare.South Africa began their World T20 campaign with a seven-wicket win over Sri Lanka later at the same venueThe Proteas restricted Sri Lanka to 99-8 despite bowling 19 wides, before chasing down the target with nine deliveries remaining.\n                            Media playback is not supported on this device\n                        After the recent torrential rain in St Lucia that prompted the International Cricket Council to consider switching the remaining Group A fixtures, liberal application of sawdust over the ground ensured only a slight delay to the start and no overs lost.England, who had been reduced to practising underneath the stands during the wet weather, began with seam and showed no ill-effects from their disrupted preparation as Nat Sciver and Anya Shrubsole both struck in the opening three overs.The boundaries were brought in to the minimum distance of 55 yards because of some remaining wet areas on the outfield and Ayasha Rahman - who after 12 overs had scored all but three of Bangladesh's total - took full advantage with some lusty blows, striking three sixes in her 39.Gordon - one of three left-armers in the team, along with fellow debutant Linsey Smith and Sophie Ecclestone - had her caught on the long-on boundary in her third over and struck twice more in her final over.\n                            Media playback is not supported on this device\n                        England's quest for a rapid victory to boost their run-rate backfired slightly against some wily spin from Bangladesh, who had been bowled out for just 46 by the West Indies in their first match of the tournament.Wyatt was deceived and trapped lbw on the back pad, using England's review in vain, while Tammy Beaumont skewed somewhat recklessly to backward point in the third over.Amy Jones narrowly survived a run out, and a mistimed top edge when she was on 14 was dropped by wicketkeeper Shamima Sultana, who fell to the turf and had to leave the field through injury.Sciver (23) began to display her innovative range of powerful strokes to help the tourists to 37-2 at the end of the six powerplay overs, and although she was lured out of her ground and easily stumped, England were 23 runs ahead on DLS when some heavy drizzle drifted in.After four overs were lost, the DLS calculations left England with only nine more runs to score from seven overs, and it took them just three balls.The victory took England above West Indies, who play their second match on Wednesday, but Heather Knight's side will hope the rain stays away for their next Group A fixture against South Africa on Friday.England spinner Kirstie Gordon: \"It's been a bit difficult watching the rain all day against Sri Lanka, but we were optimistic this morning that we'd get a game in. I've been working hard on getting a good start which calms your nerves.\"I didn't know I was definitely going to play today as I was told I'd play if it was a full 20 overs, but if it was a reduced game, the team might change.\"England captain Heather Knight: \"Conditions were tricky with the amount of rain we've had, but we were just delighted to get out there and to get a game in.\"We wanted to win the game as quickly as we could, but in T20 you're always likely to lose wickets early on.\"Former England captain Charlotte Edwards on BBC Test Match Special: \"We have to be realistic - some of the batters for Bangladesh aren't going to be like Deandra Dottin and Lizelle Lee. England are going to face some tougher tests.\"Share this with            Are any of these bizarre music myths true or false?Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}