{"id": "James 'Whitey' Bulger: The gangster who terrorised Boston", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowNotorious mobster James \"Whitey\" Bulger presided over deaths, drug-dealing and extortion as one of Boston's most high-profile gangsters. Now the killer, who was serving two life sentences for 11 murders, has reportedly met a violent end himself at a West Virginia prison.   While the Federal Bureau of Prisons has not confirmed what happened, US media report that the 89-year-old was murdered.The FBI has been notified and an investigation launched.The development is entirely typical of Bulger's extraordinary story - a tale as improbable as it is bloody. Whitey Bulger - so-called because of his light blond hair - hated his nickname, and preferred to be known as Jimmy. The FBI used \"James J. Bulger\" on its Most Wanted list, however - and the crime boss topped it in 2011 after the death of Osama Bin Laden. Bulger was one of Boston's most high-profile gangsters, heading the Irish-American Winter Hill mob from the early 1970s until the mid-1980s. But he lived a double life as a prized FBI informant, feeding the bureau information about rival criminals.The agency described him as an avid reader with an interest in history, who could often be found in libraries or visiting historic sites. Others had less savoury impressions. Tom Foley, who worked on Bulger cases for Massachusetts Police, told CNN: \"The guy is a sociopathic killer, he loved that type of life. He's one of the hardest and cruellest individuals that operated in the Boston area. He's a bad, bad, bad guy.\"Prosecutors accused Bulger of strangling two women (though jurors did not reach a verdict on one charge), and of torturing a man for hours before shooting him dead with a machine gun. Bulger lived as a fugitive for 16 years before he was captured in Santa Monica, California, in June 2011.  The FBI warned that he had a violent temper, and was known to carry a knife at all times. A $2m (£1.25m) reward was offered for information leading to his arrest. In 2007, agents scoured Europe after footage appeared to show Bulger and his lover at a resort in Sicily - but the couple in question turned out to be innocent German holidaymakers.Bulger was born in 1929, and grew up in a poor suburb of South Boston. Like many a gang boss, he began as a bank robber; a career choice that got him sent to the notorious island prison of Alcatraz.Other run-ins with the law included the accusation that he had helped smuggle a cache of weapons from the US to the IRA in the early 1980s. His lengthy spell on the run started in 1995, when an FBI agent on his payroll tipped him off to his imminent arrest.Before fleeing Boston he apparently stashed away millions of dollars in bank accounts and safety deposit boxes, some of them in the UK. Bulger's dramatic, bloodthirsty story has inspired several films and books. Johnny Depp played the mobster in the 2015 picture Black Mass, and Jack Nicholson's character in Oscar-winner The Departed was based on him.  He also had a companion throughout his fugitive years: his long-time girlfriend, dental hygienist Catherine Elizabeth Greig.  The pair settled in at No. 303 in the Princess Eugenia apartment complex, in sunny Santa Monica.In a film-worthy twist, their hidden life was revealed by a neighbour - actress Anna Bjornsdottir, a former beauty queen who was Miss Iceland 1974.During a trip to Iceland, she switched on a TV news report about Bulger - only to realise he was living right beside her. She duly received the $2m reward after alerting the FBI. Investigators found 30 weapons in Bulger's apartment, and more than $800,000 in cash hidden in the walls. He also had a stack of books about criminals, including Escape from Alcatraz.Bulger and Greig had kept fit by walking on beaches and in parks, and the FBI listed them as lovers of animals and nature.Greig was sentenced to eight years in prison and fined $150,000 for harbouring Bulger. She is currently in prison in Minnesota, scheduled for release in September 2020.Bulger's brother William was a Massachusetts state senator, and also served as state senate leader.He has insisted he knew nothing about the gangster's life, but was forced to resign as president of the University of Massachusetts in 2003 when it emerged that he had talked to his fugitive sibling by phone eight years earlier, and never reported it.In August 2013, Bulger was convicted in Boston of 11 murders. The following November, he was sentenced to two life terms plus five years.A series of witnesses gave gruesome testimony during the two-month trial, detailing how Bulger would nap after killing his enemies.The accused refused to testify, calling the trial a sham. He denied that he had ever been an FBI informant - and at some points yelled angrily at witnesses.Bulger's activities proved especially expensive to the US justice department, which paid more than $20m in damages to his victims' families, since he had technically been operating under government supervision while he killed them.Judge Denise Casper told the mobster: \"The scope, the callousness, the depravity of your crimes are almost unfathomable. Your crimes are made all the more heinous because they are all about money.\"The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}