{"id": "Reality Check: Which form of renewable energy is cheapest?", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowGreen Party MP Caroline Lucas has said that energy generated from onshore wind is cheaper than other forms of renewable energy. What are the figures behind the claim?Renewable, or 'green' energy is generated from natural resources like the sun, wind and water, so they are restored and never run out - unlike fossil fuels. The government's Department for Business, Energy and Industrial Strategy (BEIS) has published projections on costs for projects starting in 2020. These include a breakdown of how much it could cost to generate a megawatt hour (MWh) of electricity according to different energy types. The estimates by BEIS show that it will cost £63 to generate a megawatt hour of electricity using onshore wind energy, reinforcing Caroline Lucas's claim.It's the cheapest renewable power source listed, in comparison with £106 for offshore wind. These figures do account for construction costs and the fact that wind and solar power are intermittent. But they don't consider costs associated with environmental factors like air quality impact. The most recent report available was published in 2016. But, the findings were also backed up by a more recent study by renewable energy consultants BVG Associates. This study - commissioned by Scottish Power - found that onshore wind is the cheapest form of new-build electricity generation available in the UK today. The total electricity generation in the UK stood at 336 terawatt-hours (TWh) in 2017, with 29.3% generated by renewable sources of energy. This was an increase from 24.5% in 2016, according to official figures.BEIS has pointed out that the trend has been spurred on by an increase in renewable power generation capacity. Over the last year, generation from wind and solar sources increased from 47.7TWh to 61.5TWh. That was largely down to a 22.6% rise in wind capacity. Onshore wind capacity in particular saw an increase in recent years.But, some new onshore wind projects have been banned from competing for government subsidies. A government subsidy is money paid by the government to help a company or an industry reduce its costs. In 2015, the government pledged to \"halt the spread of onshore wind farms\". Some analysts have said that this was because they are often unpopular with local residents, but industry body RenewableUK point to the latest survey from the Department for Business, Energy & Industrial Strategy which suggests support for onshore wind has increased.  Since then, the 2017 Conservative manifesto said that the government would prioritise offshore wind power instead. It has recently launched an initiative to increase the UK's offshore wind power capacity. Costs for offshore wind power have decreased with the introduction of a new system which forces companies to bid for financial support from the government in auctions. The auctions, due to take place every two years, allow energy firms to bid for contracts that guarantee a minimum price for the power they will sell. A spokesperson from the industry body Energy UK said that offshore wind has more than halved in price, and onshore and solar have seen similar cost reductions. According to analysis by Bloomberg New Energy Finance, investment in renewable energy sources has been declining since 2015.The amount companies have spent on green energy in the UK halved in 2017, standing at £7.5bn. Around half of the UK spend in 2017 went on one single offshore wind farm, Hornsea Project Two off the Yorkshire coast. This article was amended on 26 October to reflect latest BEIS polling on onshore wind farms.Read more from Reality CheckSend us your questionsFollow us on TwitterFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}