{"id": "Hampton & Richmond 1-2 Oldham: Latics fight back to avoid upsetScores, Results & Fixtures", "paragraph": "Share this with\n                            Media playback is not supported on this device\n                        League Two side Oldham avoided an FA Cup upset in dramatic fashion, with two late goals at Hampton & Richmond.The National League South hosts looked on course for a famous victory after Chris Dickson's first-half penalty.But Rob Hunt's 88th-minute equaliser pulled the Latics level, and Callum Lang scored the winner in the fifth minute of eight added on.Frankie Bunn's Oldham will travel to National League side Maidstone in the second round.It had looked set to be a frustrating evening for the visitors, who fell behind after referee Tom Nield controversially penalised Lang for a challenge on Tyrell Miller-Rodney.Replays suggested contact was minimal, but former Charlton and Ghana forward Dickson put the Beavers ahead as they sought their first victory at this stage of the competition after defeats by Barnet in 2000 and Dagenham in 2007.Dickson, who scored in the Europa League for AEL Limassol against Marseille in 2012, went close to adding a second, as did Zak Joseph.But that would have been harsh on Oldham, who had 24 shots during the game.George Edmundson struck a post, Peter Clarke and Jose Baxter - who later left the field on a stretcher - also missed good opportunities, and home goalkeeper Tom Lovelock was in inspired form.But Oldham kept going forward, and Hunt converted from close range after a speedy counter-attack.Lang then got on to Chris O'Grady's flick-on to volley home from 12 yards as Oldham secured a 23rd victory in their past 24 FA Cup first-round ties against non-league opponents.Match ends, Hampton & Richmond 1, Oldham Athletic 2.Second Half ends, Hampton & Richmond 1, Oldham Athletic 2.Attempt missed. Rian Bray (Hampton & Richmond) header from the centre of the box is close, but misses to the right. Assisted by Ogo Obi with a cross.Substitution, Hampton & Richmond. Ogo Obi replaces Craig Dundas.Corner,  Oldham Athletic. Conceded by Tom Lovelock.Attempt saved. Mohammed Maouche (Oldham Athletic) right footed shot from the centre of the box is saved in the bottom left corner.Corner,  Hampton & Richmond. Conceded by George Edmundson.Goal!  Hampton & Richmond 1, Oldham Athletic 2. Callum Lang (Oldham Athletic) right footed shot from the centre of the box to the bottom right corner. Assisted by Chris O'Grady with a headed pass.Foul by Rob Hunt (Oldham Athletic).Jack Connors (Hampton & Richmond) wins a free kick in the defensive half.Corner,  Oldham Athletic. Conceded by Craig Dundas.Corner,  Oldham Athletic. Conceded by Tyrell Miller-Rodney.Craig Dundas (Hampton & Richmond) is shown the yellow card for a bad foul.Dan Gardner (Oldham Athletic) wins a free kick in the attacking half.Foul by Craig Dundas (Hampton & Richmond).Attempt blocked. Johan Branger (Oldham Athletic) right footed shot from the centre of the box is blocked. Assisted by Cameron Dummigan with a cross.Corner,  Oldham Athletic. Conceded by Rian Bray.Attempt saved. Johan Branger (Oldham Athletic) left footed shot from the left side of the box is saved in the bottom left corner. Assisted by Chris O'Grady.Goal!  Hampton & Richmond 1, Oldham Athletic 1. Rob Hunt (Oldham Athletic) left footed shot from the centre of the box to the top left corner. Assisted by Dan Gardner following a fast break.Attempt missed. Zak Joseph (Hampton & Richmond) right footed shot from the centre of the box misses to the left. Assisted by Jack Connors following a set piece situation.Foul by George Edmundson (Oldham Athletic).Tyrell Miller-Rodney (Hampton & Richmond) wins a free kick on the right wing.Attempt missed. Dan Gardner (Oldham Athletic) right footed shot from outside the box is too high.Attempt blocked. Cameron Dummigan (Oldham Athletic) right footed shot from the centre of the box is blocked. Assisted by Callum Lang.Substitution, Hampton & Richmond. Rhys Murrell-Williamson replaces Chris Dickson.Attempt missed. Peter Clarke (Oldham Athletic) header from the right side of the six yard box misses to the left. Assisted by Dan Gardner with a cross following a corner.Corner,  Oldham Athletic. Conceded by Michael Corcoran.Attempt blocked. Chris O'Grady (Oldham Athletic) left footed shot from a difficult angle on the left is blocked. Assisted by Mohammed Maouche.Substitution, Oldham Athletic. Mohammed Maouche replaces Jordan Lyden.George Edmundson (Oldham Athletic) wins a free kick in the defensive half.Foul by Chris Dickson (Hampton & Richmond).Foul by Callum Lang (Oldham Athletic).Tom Lovelock (Hampton & Richmond) wins a free kick in the defensive half.Foul by Cameron Dummigan (Oldham Athletic).Zak Joseph (Hampton & Richmond) wins a free kick in the defensive half.Foul by Dan Gardner (Oldham Athletic).Craig Dundas (Hampton & Richmond) wins a free kick in the attacking half.Substitution, Oldham Athletic. Chris O'Grady replaces Ishmael Miller.Attempt blocked. Ishmael Miller (Oldham Athletic) left footed shot from the left side of the box is blocked. Assisted by Andy Taylor.Corner,  Oldham Athletic. Conceded by Yado Mambo.Share this withFind ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}