{"id": "Football gossip: Ibrahimovic, Willian, Koscielny, Hazard, Mane, Rashford", "paragraph": "Share this withLA Galaxy's former Sweden striker Zlatan Ibrahimovic, 37, could return to AC Milan on a six-month deal. (Tuttosport, via Mirror)Barcelona have reopened talks with the representatives of Chelsea and Brazil winger Willian, 30, after the Blues rejected three offers over the summer. (La Sexta, via Metro)Arsenal and France centre-back Laurent Koscielny, 33, is a target for Barcelona, as is Chelsea's Brazil defender David Luiz, 31. (Mundo Deportivo - in Spanish)Chelsea target Joao Felix, 18, has been offered a new contract by Benfica. The Portugal Under-21 midfielder's new deal would include a £105m buyout clause. (Mirror)Thorgan Hazard, brother of Chelsea and Belgium midfielder Eden, says the 27-year-old will not leave Stamford Bridge for Real Madrid in January. (HLN, via Express)Wolves, Crystal Palace and Southampton are all interested in Leeds forward Kemar Roofe, 25. (Mirror, via Birmingham Mail) A West Ham fan has set up a crowdfunding page to pay for Republic of Ireland defender Declan Rice's new contract. The 19-year-old reportedly wants a deal worth close to £40,000 a week. (Sun)From living in a refugee camp to scoring for AustraliaArsenal, Chelsea, Liverpool, ­Manchester City and Manchester United are likely to face legal action from the remaining Premier League clubs if they are to join the proposed European Super League in 2021. (iNews)Liverpool and Senegal winger Sadio Mane, 26, has dismissed concerns about his contract situation, insisting he is \"happy\" at Anfield. (Liverpool Echo)Liverpool boss Jurgen Klopp is considering dropping Switzerland winger Xherdan Shaqiri for the Champions League tie with Red Star Belgrade this week. Shaqiri has previously received a hostile reaction from Serbian fans because of his Kosovan heritage. (Telegraph)Juventus and Portugal forward Cristiano Ronaldo says he misses playing alongside former Manchester United team-mate Wayne Rooney. Rooney has just finished his first MLS season with DC United.(Express)Former Spain and Barcelona midfielder Xavi says he finds \"the football I watch on the TV boring\" and teams that play 4-5-1 \"bore\" him. (AS)Former Manchester United and England defender Rio Ferdinand says Red Devils forward Marcus Rashford needs to start more games if he is to realise his potential at Old Trafford. (BT Sport, via Manchester Evening News)The Football Association will decide on Monday whether to open an investigation into Stoke City midfielder James McClean's comments criticising fans after he was abused over his refusal to wear a remembrance poppy. (Times - subscription required)Napoli boss Carlo Ancelotti believes Paris St-Germain's Brazil forward Neymar and France striker Kylian Mbappe can be the \"successors\" to Juventus forward Cristiano Ronaldo and Barcelona counterpart Lionel Messi as the best two players in the world. (Express)Liverpool forward Mohamed Salah has been immortalised in a new statue in Egypt. (Liverpool Echo)Former Crystal Palace and Everton manager Sam Allardyce says his grandchildren were abused in the wake of his sacking as England manager in 2016. (Talksport)The operators of sports stadiums will need to have a plan in place to protect fans in the event of a terrorist attack inside or outside the ground in order to receive a licence in the future. (Times - subscription required) Share this with            Are any of these bizarre music myths true or false?Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}