{"id": "Cardiff Huskies para ice hockey team claim UK title", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowFor many people, the idea of sliding around on ice, jostling with others for space with your hands centimetres from metal blades, may not hold much appeal.But for the Cardiff Huskies para ice hockey team, many of whom travel hours just to train, it is their passion.And it shows - the Huskies won the British Para Ice Hockey League, beating the Kingston Kestrels in the final.\"It is very dangerous,\" said club captain Paul Furber, 50, from Blackwood, Caerphilly county.Para ice hockey is played on sledges - a seat on a metal frame with a blade on the base - with players using small sticks in either hand to hit the puck.Each stick has a \"pick\" at the other end which is used to gain speed and turn on the ice.Mr Furber, who has represented Great Britain in the sport, lives with spina bifida - a birth defect which affects the spinal cord - and plays alongside men and women of all ages and disabilities. \"There are people who have been injured in car crashes, ex-service men and women, double amputees - a variety of disabilities,\" he said.The team is made up of 14 players from across Wales and southern England, including Carmarthenshire, Pembrokeshire, Swindon, Bath, Reading and even London.The Huskies were victorious in the play-off finals in Widnes, Cheshire, after a 2-1 win against Manchester, followed by a resounding 9-4 victory against Kingston in which Paul scored a hat-trick.Ice hockey is a sport renowned for its violence, and Mr Furber said para ice hockey is \"exactly the same\" in that respect.\"It is very dangerous - there are often concussions. One guy from Peterborough was carried off with concussion in the play-offs,\" he said.\"My wife always comes with me. It is great when people watch people with a disability and think 'bloody hell'.\"But with the expense of kit and living with a disability, Paul said growth of the sport is difficult.He added: \"We are trying to get it to grow bigger, but it feels like we are getting nowhere at the moment.\"The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}