{"id": "Ishmael Osamor resigns over Bestival drugs supply charges", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowA Labour councillor caught with a large amount of drugs at a music festival has resigned as a councillor, having already left his cabinet post. Ishmael Osamor, 29, had pleaded guilty to having £2,500-worth of drugs, at last year's Bestival event in Dorset.The Haringey councillor and son of a Labour MP apologised for the \"unwanted attention\" his case had brought. Osamor was sentenced to a two-year community order and 20 days rehabilitation, last Friday.The son of Shadow International Development Secretary Kate Osamor, was caught with ecstasy, cocaine, ketamine and cannabis at the festival in August 2017, nine months before he was elected as a councillor.In a statement to the council's chief executive he said: \"It is with great regret that I am offering this as formal notice of my resignation as councillor, effective immediately.\"I would like to take the opportunity to apologise to the council, as I have to my ward colleagues and residents, for the unwelcome attention my case has brought to Haringey.\"Osamor resigned at a meeting of the council's Labour group earlier after calls for him to quit. Councillor Joseph Ejiofor, council leader, said: \"Councillor Osamor came to see me on Friday 26 October and explained about an incident that happened in September last year. \"I expressed my concern and disappointment by the actions that he had admitted. \"The Labour Party expects high standards from its elected representatives, and I know that Councillor Osamor has taken some personal time over the past four days to review whether his actions have met this expectation.\"Consequently, Ishmael has decided to resign from Haringey Council. We respect his decision.\"Osamor admitted three charges of possessing drugs with intent to supply and a fourth charge of possession at Bournemouth Crown Court on Friday, the Local Democracy Reporter Service reported.The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}