{"id": "Deep division in Brazil's north-east, where 'life is real'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowA massive lorry blasts out music from a sound system and cheers on a crowd of people dressed in yellow, green and blue in Boa Viagem. The colours of the Brazilian flag have become a sort of uniform for those supporting the far-right candidate, Jair Bolsonaro, in Sunday's presidential election.The event in this wealthy beachfront neighbourhood in Recife - the capital of Pernambuco state in north-east Brazil - feels like a victory rally. The second and decisive round of the election is not until Sunday but going by the number of people whistling, singing and dancing here, you would think that their candidate had already won.\"Our flag will never be red again,\" they sing, referring to the colours used by Jair Bolsonaro's main rival, Workers' Party candidate Fernando Haddad. Next minute, they are chanting \"We came here for free\", another dig at the Workers' Party which they accuse of paying people to turn up to campaign events. There is certainly no holding back about their hatred of the Workers' Party and its most famous politician, Luiz Inácio Lula da Silva.For the people gathered here, the former president, who is serving 12 years in jail for corruption, is the symbol of all that went wrong in Brazil. They argue that he brought the country to its knees. By contrast, they think that Mr Bolsonaro is a clean politician who will change Brazil for the better. \"I'm voting for the future of this country,\" says mother Cibely Lopes. \"He represents hope.\" \"Young people are emotional, they believe in the utopia of being good,\" says fellow Bolsonaro supporter Kleber Freire. Mr Freire explains that he voted for Lula twice but that he would never vote for a Workers' Party candidate again. \"Life is real, you have to struggle to get things in capitalism, in any kind of economy. To remain socialist or communist is just immaturity,\" he says about his change of heart.Far from the cities in the poorest region of Brazil, lives are certainly very real and people's attitudes could not be further apart from those of the residents of the beachfront condos of Recife. Caetes is a rural part of Pernambuco about four hours from the state capital. Horses and carts are a popular mode of transport on the dusty, unpaved roads that weave in between sparsely growing cactus, sweet potato and manioc plants. Lula was born in this community and spent his first few years here. During his two terms as president from January 2003 to December 2010, peoples' lives were transformed through his government's generous social programmes. Millions were lifted out of poverty. The good times did not last and under Lula's successor, Dilma Rousseff, the economy faltered. But still there is a lot of affection for what the Workers' Party did, and people here remain loyal. In Pernambuco, Workers' Party candidate Fernando Haddad won the first round over Jair Bolsonaro, and that was repeated across the north-east.Farmer Jorge Rodrigues de Melo lives down the road from Lula's old wattle-and-daub family home. He is wearing a battered wide-brimmed leather hat and is sitting on a home-made swing made of wood and old tyres. He is kicking his bare feet in the sand. \"Lula was the best president we ever had, for everyone in the north-east and all the poor Brazilians,\" he says. \"The rich only like the rich here in Brazil.\"I ask him if he is going to vote for Fernando Haddad, who stood in as the Workers' Party candidate after Lula was barred from running because of his corruption conviction. He looks lost. He does not know who Fernando Haddad is. All he knows is that he will be pressing \"13\" on Sunday - the number of the Workers' Party on the ballot. He may not recognise the Workers' Party current candidate but Mr Melo is clear in his rejection of Mr Haddad's rival: \"I don't see what this Bolsonaro has to offer.\" \"Not even with a knife held to my neck and a revolver to my head would I vote for him,\" he says.Not far away we meet Barto Florencio da Silva, a community leader in Quilombo Primavera. Quilombos form a rural settlement of slave descendants and are among the poorest communities in Brazil.The quilombos were neglected for years but under President Lula, Quilombo Primavera got running water and electricity as part of the government's \"Light for All\" programme.Residents are fearful of what may be in store for them should Mr Bolsonaro, who has a wide lead in opinion polls, win on Sunday.In a speech, the far-right candidate called quilombo residents \"lazy\" and said they were \"not fit for procreation\".\"He talked about us as if we were animals,\" Mr Silva says. \"With all that he's shown so far, his government will be one that violates rights and we'll have nobody to appeal to.\"One of the biggest concerns of quilombo residents is losing their land as not all such communities have their title deeds. They are threatened by landowners, and Mr Silva thinks life is about to get even more difficult.\"The Workers' Party government made mistakes, but at least it was open for dialogue, we could challenge it,\" he says. \"With a Bolsonaro government, that won't happen. Brazil is returning to the 19th Century.\"  Back in Recife, supporters of Fernando Haddad gather in a main square. Young and old are wearing badges with the number 13 on them. They are all dressed in the red colour of the Workers' Party.Jair Bolsonaro's supporters like to say that it's the colour of communism, but Ivan Moraes scoffs at that accusation, which he says is a ruse.\"It's tension created by the elites when working people started getting access to the same rights,\" the Workers' Party supporter argues. \"Right now it's not about right or left, progressive or conservative. It's about standing up for our democracy.\"Whatever the outcome of Sunday's election, it is clear it is going to be a tough fight as Brazilians head to the polls more divided than ever.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}