{"id": "Nottingham cattle market fire: Gas cylinders explode in blaze", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowGas cylinders have exploded as firefighters tackle a large fire at a city's former cattle market.The blaze broke out in four buildings at Nottingham Cattle Market at about 18:00 GMT.Residents near the business estate, off Meadow Lane, were asked to keep their windows and doors closed.The flames were brought under control in the early hours of Monday but damping down is likely to continue for some time, fire control said.The fire service said some people may have heard \"several small explosions\".There are no reports of casualties and Nottingham Fire and Rescue Service has urged people to avoid the area where possible.The cause of the fire is not yet known.Incident commander Bryn Coleman said: \"We've got a range of industrial buildings that are on fire.\"We've had several small explosions which some members of the community may have heard across Nottingham.\"[They] have been caused by compressed gas cylinders which had been involved in the fire.\"Alan Hardy, chairman and owner of Notts County FC tweeted: \"We are aware of a significant fire at the Cattle Market, near Meadow Lane, and reiterate the authorities' advice to avoid the area due to potential explosions. Please stay away and safe guys please.\"We are aware of a significant fire at the Cattle Market, near Meadow Lane, and reiterate the authorities’ advice to avoid the area due to potential explosions. Please stay away and safe guys please https://t.co/hNX6X3ND8DEnd of Twitter post  by @Bigalanh5Police and the ambulance service are also at the scene and people are being asked to avoid the area.The fire service said it would remain at the site for a \"considerable time\" to stop the fire spreading to other industrial units.Nottingham Cattle Market has a number of businesses at the site including Arthur Johnson and Sons Auctioneers.Livestock was last sold at the cattle market in January 1993, according to the company.The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}