{"id": "The billionaires fuelling a space race", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowDubbed \"NewSpace\", an increasing number of entrepreneurs are joining in the race to create cheap, commercialised space travel.Among these are billionaires Elon Musk, Jeff Bezos and Sir Richard Branson, who all made their fortunes in other industries. Between them, they're posing a major challenge to established space industry giants.Fuelled by intense rivalries, their ambitions include the development of space tourism and developing permanent human settlement on the Moon and even Mars.But emerging space entrepreneurs are also filling a huge void left by governments that have had to cut funding for space missions.As a result, names like SpaceX and Blue Origin are becoming part of the increasingly lucrative military space race as the US seeks to counter ambitions by China and Russia. By some estimates, the space industry is expected to be worth $1 trillion (£766bn) by 2040.So what are the companies hoping to make money by radically transforming our future, and who are the men behind them?Amazon founder Jeff Bezos, the world's richest man, was one of the first billionaires to jump into the commercial \"space race\", starting Blue Origin in 2000.Compared with industry rivals it has a reputation for being far more guarded about its activities.The company has suffered setbacks after several failed launches and problems with its BE-4 engine, and since 2016 Bezos has sold $1bn of his Amazon stock every year to keep the company flying.Like rival SpaceX its goal is to drive down the cost of space travel by building reusable rockets. In the past, rockets have been discarded after just one launch.Gaining momentum, Blue Origin is now securing lucrative government contracts and recently gained national security certifications from the US government. Earlier this year, together with Northrop Grumman and United Launch Alliance, it was chosen by the US Air Force to develop new rockets which can be used for military launches. Each company will be getting $109m from the deal.Bezos is set on sending \"space tourists\" into sub-orbital flight. Blue Origin says it will be selling tickets from next year, with company insiders suggesting they could go for up to $300,000 a pop.In the future, Bezos has ambitions to form a partnership with Nasa to test the possibility of permanent human settlement of the Moon.South African-born businessman Elon Musk started SpaceX in 2002 with $100m of his early fortune from PayPal, which he co-founded.The company has launched nearly 70 rockets to date, and has won contracts with Nasa, the US Air Force and Argentine's space agency to deliver satellites into orbit and to help resupply the International Space Station.It has also ventured deeper into space than Blue Origin and Virgin Galactic, reaching 22,000 miles above the Earth's equator.But there have been setbacks along the way for Musk, too. Valuable payloads, including a spy satellite for the US military, have been lost during missions. However Musk is known for publicity stunts to make light of failures and highlight successes. Last year, he shared a \"blooper reel\" of failed rocket landings, featuring \"some epic explosion footage\". SpaceX also launched a Tesla car into space as part of its Falcon Heavy rocket project.Like Blue Origin, Musk plans to one day send people into space on commercial flights. Earlier this year, he announced that SpaceX's first \"moon tourist\" would be Japanese billionaire Yusaku Maezawa.But one of SpaceX's ultimate goals is to send crewed flights to Mars and eventually colonise the Red Planet.\"I want to die on Mars,\" Musk has said, \"just not on impact.\"British tycoon Sir Richard Branson is one of the newest members of the NewSpace set, founding Virgin Galactic in 2004.While rivals have ambitions for deep space travel, Sir Richard is focused on developing reusable \"space planes\" to take tourists and other payloads on brief trips to sub-orbital space.Virgin Galactic has already started selling tickets for $250,000, and celebrities such as pop star Justin Bieber have already signed up. It's also attracted significant investment from, among others, the UAE's sovereign wealth fund.The company made headlines in 2014 after a spaceship crashed during a test flight in California, killing one pilot and injuring another. This proved a significant setback to its initial goal of becoming the first company to send a tourist to space.But the company has since completed several test flights and earlier this month, Sir Richard said the company will be in space \"in weeks, not months\".Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}