{"id": "Canada's last witch trials: Women accused of fake witchcraft", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowA law against pretending to practise witchcraft will soon be repealed in Canada. But that hasn't stopped local police from prosecuting those who use the \"dark arts\" to bilk people for thousands of dollars.Two Canadian women have been charged with pretending to practise witchcraft, breaking a little-known law in Canada's criminal code that could soon be out the door.The first charge was levied against Dorie \"Madeena\" Stevenson, a fortune teller from Milton, Ontario on 18 October after a months-long investigation. She is accused of defrauding a client of C$60,000 ($45,700; £35,700) in cash and property.A week later, Toronto psychic Samantha Stevenson was also arrested in a similar but unrelated investigation. Police allege she convinced a man the only way to get rid of \"evil spirits\" in his home would be to sell it, and transfer the proceeds into her account.The accused often advertise themselves as a psychic or religious healer, and demand large sums of money to help remove curses or evil spirits from clients, police say. \"What we typically see is a tendency for perpetrators to take advantage of persons when they are in their most vulnerable state,\" wrote Det Sgt Dave Costantini of Halton Regional Police, in a press release. \"Victims are manipulated into believing something bad will happen to them unless they remit cash. We even see incidents where victims are required to make purchases and remit these purchases in order to be cleansed. \"When victims cannot be squeezed any longer, the perpetrators rely on the victim's embarrassment in not contacting police.\"The charges could lead to Canada's last witch trials, as the section of the law banning pretending to practise witchcraft will soon be repealed. In June 2017, the federal government proposed a bill repealing dozens of outdated sections of the criminal code, including the law against pretending to be a witch. \"I suspect police had just forgotten [the laws against witchcraft] existed, and it was the publicity over the fact that they were being removed that made police even remember that they were there,\" said Dalhousie University law professor Stephen Coughlan.It is not illegal to practise witchcraft in Canada - either as part of a religion like Wicca or as an occult practice. However, according to Section 365 of Canada's Criminal Code, it is illegal to \"fraudulently pretend to exercise or to use any kind of witchcraft, sorcery, enchantment or conjuration\". The law has generally been interpreted as a provision against using the occult to perpetuate fraud, say by someone promising to cure a disease with magic.The conviction can lead to a C$2,000 fine and up to six months in jail.The law has rarely been applied in the 21st Century, although it is not unheard of:The law has been criticised for targeting women and cultural groups where beliefs in magic are more widespread. \"The provision that differentiates this type of fraud from others is mired in historic oppression of women and religious minorities, and is not necessary to prosecute fraud,\" wrote Natasha Bakht and Jordan Palmer in a working paper published in the journal Windsor Review of Legal and Social Issues.All this is about to change. A proposed bill to repeal antiquated or redundant criminal offences passed its third reading in the Senate last week, and it is expected to come into force as soon as it receives royal assent.The bill would repeal the law against pretending to be a witch, as well as other old-fashioned prohibitions such as laws against duelling and blasphemous libel. Coughlin, the legal expert, told the BBC the bill is necessary to help bring the criminal code, parts of which date back to 1892, into the modern era.\"A lot of them are just out of step with the time, out of step with the facts or really, are duplicative of other offences,\" says the Dalhousie University professor. \"In the case of the witchcraft [law], realistically any behaviour that would fall within that provision... would also be captured by other provisions in the criminal code, like fraud.\"Until the law comes into force, however, police have every right to charge being with pretending to practice witchcraft. \"It's not uncommon for police to lay every charge they can think of, simply because it gives them a bargaining chip,\" he says.Canadian Monica Bodirsky, a witch and artist in Toronto, welcomed the change in the law, which she said is \"a holdover from stereotypes and fears of witches being evil\".She says current fraud laws are strong enough to target people who take advantage of others, and that witches shouldn't be singled out.\"Fraud is fraud,\" she says.There's a big difference between providing a service - like a tarot reading - and preying on people's beliefs or fears of magic to manipulate them out of large sums of money, she said.\"Fortune telling and phony psychics, it's very easy to tell the difference generally by the price tag,\" she says.She charges for tarot readings, and believes genuine fortune tellers never tell clients they're cursed or that they can cure an illness. Instead, she says she offers general life advice, and clients have the choice whether to take her advice or not.She says you shouldn't have to prove that magic is real in order to practise it, or earn a living from it. \"If you're going to invest $20, $40, $60 in a tarot reading and you find it's irrelevant to you, or did you no good, why would that being any different than going to a reiki treatment and finding that didn't work?\" she asked. \"Would you charge a reiki practitioner with fraud?\"Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}