{"id": "Superdry founder Julian Dunkerton seeks return to the fold", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThe co-founder of Superdry is talking to shareholders about returning to the fashion retailer in the hope of reviving its fortunes.Julian Dunkerton, who stepped down as chief executive in 2014 and left its board in March, remains its biggest shareholder with an 18.5% stake.He has gone public with criticism of Superdry's strategy after its latest profit warning last week.The firm's shares have fallen from almost £20 in January to £7.29p apiece.Mr Dunkerton told the BBC he was offering to return to Superdry \"in any capacity\" to correct what he described as a failing strategy.He argued that the policy of putting new products in its stores more frequently was misguided.It should focus on its core jackets and hoodies and offer a far wider range of variations online, he said: \"Superdry is a series of core products - stick with them and tweak them.\"The decision to start discounting jackets two days before Christmas meant there was not enough stock for the rest of the winter, Mr Dunkerton added. \"This is just about the strategy - it's not about ego,\" he said. \"The ship needs to turn and it needs to turn quickly.\"Mr Dunkerton founded Superdry in Cheltenham 15 years ago with designer James Holder, who left two years ago and still owns a 9.7% stake in the company.He said his co-founder backed his plan to return to the company as both believed they could no longer stand back and watch as the shares continue to sink. Mr Dunkerton said any retail shareholders he spoke to also wanted him to go back. He has hired the broker Cenkos to help persuade institutional investors to support his campaign.However, Aberdeen Standard Investments, which is the second-largest shareholder in Superdry with a 10.6% stake, has criticised Mr Dunkerton for failing to make contact before going public with his campaign.Frederik Nassauer, a fund manager at Aberdeen Standard, has gone on record to support the company's management and strategy.\"Euan Sutherland was appointed chief executive in 2014, as Julian decided to step aside as chief executive after several profit warnings,\" he told The Times.The other major shareholders, Old Mutual, Artemis and Blackrock, which have stakes of 7%, 5% and 4.7% respectively, are yet to reveal their stance on Mr Dunkerton's campaign.Peter Bamford, chairman of Superdry, said the former chief executive had raised several issues about strategy since he left the business. \"We have reviewed and discussed these issues and, while we have sympathy with some of his points, we have a different view on the best strategy or approach to addressing them,\" he said. \"The board believes that Julian's view of strategy has not evolved with the needs of the business. We remain fully committed to our successful global digital brand strategy and the board is confident that Superdry has in place the right leadership.\"The company makes up to three quarters of its profits in the second half of the year and has embarked on an 18-month plan to broaden its range in order to be less dependent on sales of winter jackets, jumpers and hoodies.Superdry last week blamed poor sales over the summer on unseasonably hot weather in the UK, continental Europe and on the US east coast. That situation continued into October.The profit warning sent shares down by a fifth and the company is now worth just under £600m.In July Mr Dunkerton raised £71m by selling 5.5 million shares to institutional investors at £12.85 a share, reducing his stake from 25.2% to 18.5%.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}