{"id": "Football gossip: Mourinho, Matic, Nasri, Conte, De Bruyne, Dembele, Solari, Alves", "paragraph": "Share this withManchester United manager Jose Mourinho faces the sack if he fails to guide them to Champions League qualification this season. (Sun)Mourinho's continued selection of 30-year-old Serbia midfielder Nemanja Matic has been questioned by some of his Manchester United team-mates. (Times - subscription required)Former France midfielder Samir Nasri's move to West Ham is at risk of breaking down because of concerns over the 31-year-old's fitness. (Daily Mirror)The deal could also break down because of Nasri's pay demands, with West Ham not keen to match his £95,000-a-week pay demands. (Mail)Santiago Solari will be appointed Real Madrid manager until the end of next season. (Marca - in Spanish)Former Chelsea boss Antonio Conte says he will wait until the summer before taking a new job in management. (Rai Sport via Goal)Conte's decision to wait means Chelsea face the prospect of paying him £11m in compensation - the full amount owed for what would have been the final year of his contract. (Daily Mirror)Five charts that show the Manchester derby divideAnti-racism charity Kick It Out has asked for an explanation from West Ham after the club reinstated Under-18s coach Mark Phillips, who was suspended after attending a Democratic Football Lads Alliance march. (Telegraph)Uefa may reopen FFP investigations against Manchester City after German magazine Der Spiegel published a series of articles accusing the club's Abu Dhabi owners of flouting the rules. (Telegraph)Premier League clubs would be allowed a maximum of 12 overseas players in their 25-man squads under new Football Association plans preparing for Brexit. (Times)Paris St-Germain's 35-year-old Brazil full-back Dani Alves says he plans to play in the Premier League before retiring. (Daily Telegraph)Borussia Dortmund and Marseille are keen to sign Arsenal's 17-year-old English midfielder Ben Cottrell. (Sun)Arsenal manager Unai Emery and his players spoke to injured England striker Danny Welbeck, 27, in a video message before Sunday's 1-1 draw with Wolves. (Guardian)Bets placed on Daniel Sturridge's January loan move to West Brom will form part of the Football Association's investigation into the 29-year-old Liverpool striker's alleged breach of betting rules. (Liverpool Echo)Tottenham's Belgium midfielder Mousa Dembele, 31, has flown to Qatar for specialist treatment on an ankle injury. (Evening Standard)Manchester City's Belgium attacking midfielder Kevin de Bruyne, 27, is set to return earlier than expected from a knee injury. (Guardian)Brighton will not appeal against English 29-year-old midfielder Dale Stephens' red card during Saturday's 2-1 defeat at Cardiff. (Argus)UAE club Al-Jazira want to appoint Michael Reiziger as coach. The former Ajax, Barcelona and Middlesbrough defender, 45, is currently in charge of Ajax's reserve side. (De Telegraaf - in Dutch)Share this with            Are any of these bizarre music myths true or false?Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}