{"id": "ATP Finals: Roger Federer cancels practice before Dominic Thiem match", "paragraph": "Share this with\n                            Media playback is not supported on this device\n                        Roger Federer cancelled a practice session on Monday before he faces Austria's Dominic Thiem in a crucial round-robin match at the ATP Finals.The 37-year-old Swiss is likely to be eliminated if he loses in Tuesday's match at the O2 Arena (20:00 GMT).The six-time champion lost his opening match to Japan's Kei Nishikori in straight sets on Sunday.He said afterwards he was struggling to find a practice court in London which matched the speed of the O2.Making his 16th appearance at the season finale, the world number three had not lost any of his previous 45 round-robin matches in straight sets before his 7-6 (7-4) 6-3 loss to Nishikori.\"Practice was a bit all over the place, practising at Queen's, practising on outside courts here and at Centre as well,\" he said after Sunday's match.\"So it was not always the same conditions.\"World number one Novak Djokovic is the favourite to win the event, boosting his credentials with an impressive opening win against John Isner on Monday.The top two players in each group qualifying for the semi-finals on Saturday, 17 November.The winners meet in the final on Sunday, 18 November at 18:00 GMT.Share this with            Are any of these bizarre music myths true or false?  ATP Tour   WTA Tour Analysis and opinion from the BBC's tennis correspondent.How to get into tennis - it's fun, will keep you fit and caters for all levels and abilities. Find your nearest court and learn the basics with our guide.This week's sport on the BBC includes the ATP World Tour Finals, the ICC Women's World Twenty20 and the home nations' football internationals.Get the latest tennis headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}