{"id": "Portugal into Nations League semi-finals after goalless draw at wasteful ItalyScores, Results & Fixtures", "paragraph": "Share this withPortugal sealed top spot in Group A3 and a place in the Nations League semi-finals courtesy of a hard-fought point against a wasteful Italy.The home side had the best chances but were let down by their poor shooting and faded as the game went on.The draw means Portugal cannot be overtaken at the top of the group.With the second-placed Italians having played all four of their games, Portugal end their campaign at home to relegated Poland on Tuesday.As well as a last-four spot in this inaugural Nations League, reigning European champions Portugal also have the safety net of a play-off game to reach the Euro 2020 finals, should they fail to do so via the traditional qualifying means.Portugal will play their last-four tie (and possibly the final) on home soil after Uefa announced that the conclusion of the inaugural Nations League would be played in the country, at venues in Porto and Guimaraes in early June 2019.Portugal beat Group A3 rivals Italy and Poland to claim hosting duties, which is expected to be confirmed by Uefa's Executive Committee at their meeting in Dublin on Monday 3 December - the same day that the draw for the finals takes place.Fernando Santos' side were once again without their most capped player and record goalscorer, Juventus forward Cristiano Ronaldo, against the country in which he now plays his football. The 33-year-old has not retired from the international game but is taking a break following the summer's World Cup in Russia and his move from Real Madrid to Juve.His country missed him in Milan. Even with creative players such as Bernardo Silva, Ruben Neves and Andre Silva in the side, they failed to pose a significant threat to the hosts, particularly during a limp first half.Home keeper Gianluigi Donnarumma made just one significant save - albeit a brilliant one - from a long-range William Carvalho shot during an improved second-half showing from the visitors.One factor that contributed to Portugal's lack of attacking edge was home defender Giorgio Chiellini, winning his 100th cap, making him the seventh Italian player to reach the milestone.Captaining the team, he was typically excellent in his reading of the game and defensive duties - summed up by a superb tackle to block a shot from Bruma early in the game.Unfortunately for the home side, they were found lacking at the other end of the pitch.Ciro Immobile set the tone, side-footing over from close range after Rui Patricio had palmed out Lorenzo Insigne's long-range shot.Other chances fell to Alessandro Florenzi, Leonardo Bonucci and Federico Chiesa but each contrived a way to miss the target and their belief in getting a positive result waned during a more predictable second half.The only consolation for the Italians is that they have done enough over their four games to retain a place in the top tier of the Nations League.Match ends, Italy 0, Portugal 0.Second Half ends, Italy 0, Portugal 0.Attempt missed. João Cancelo (Portugal) right footed shot from a difficult angle on the right misses to the right. Assisted by João Mário.Attempt blocked. Lorenzo Pellegrini (Italy) right footed shot from the centre of the box is blocked. Assisted by Kevin Lasagna with a headed pass.Nicolò Barella (Italy) wins a free kick in the defensive half.Foul by João Mário (Portugal).Attempt saved. Lorenzo Pellegrini (Italy) header from the centre of the box is saved in the centre of the goal. Assisted by Alessandro Florenzi with a cross.Corner,  Italy. Conceded by Danilo Pereira.Substitution, Portugal. Danilo Pereira replaces André Silva.Substitution, Italy. Domenico Berardi replaces Federico Chiesa.Substitution, Portugal. Raphael Guerreiro replaces Bruma.Federico Chiesa (Italy) is shown the yellow card for a bad foul.Foul by Federico Chiesa (Italy).Mário Rui (Portugal) wins a free kick in the defensive half.Substitution, Italy. Lorenzo Pellegrini replaces Marco Verratti.Foul by Giorgio Chiellini (Italy).André Silva (Portugal) wins a free kick in the attacking half.Corner,  Portugal. Conceded by Nicolò Barella.Corner,  Portugal. Conceded by Gianluigi Donnarumma.Attempt saved. William Carvalho (Portugal) left footed shot from outside the box is saved in the bottom left corner.Attempt blocked. André Silva (Portugal) right footed shot from the right side of the box is blocked. Assisted by João Mário.Marco Verratti (Italy) wins a free kick in the defensive half.Foul by João Mário (Portugal).Substitution, Italy. Kevin Lasagna replaces Ciro Immobile.Attempt missed. João Mário (Portugal) right footed shot from the centre of the box is too high. Assisted by João Cancelo.Leonardo Bonucci (Italy) is shown the yellow card for a bad foul.Attempt missed. Mário Rui (Portugal) left footed shot from outside the box misses to the right. Assisted by Bernardo Silva following a set piece situation.Foul by Federico Chiesa (Italy).João Cancelo (Portugal) wins a free kick on the right wing.Substitution, Portugal. João Mário replaces Pizzi.Federico Chiesa (Italy) wins a free kick on the right wing.Foul by William Carvalho (Portugal).Attempt blocked. Mário Rui (Portugal) left footed shot from outside the box is blocked. Assisted by Rúben Neves.Attempt blocked. Nicolò Barella (Italy) right footed shot from the right side of the box is blocked. Assisted by Cristiano Biraghi with a cross.Attempt blocked. João Cancelo (Portugal) right footed shot from the right side of the box is blocked. Assisted by William Carvalho.Offside, Italy. Lorenzo Insigne tries a through ball, but Ciro Immobile is caught offside.Jorginho (Italy) is shown the yellow card for a bad foul.Foul by Jorginho (Italy).Bruma (Portugal) wins a free kick on the left wing.Attempt missed. Lorenzo Insigne (Italy) right footed shot from outside the box is close, but misses to the left. Assisted by Jorginho.Share this withFind ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}