{"id": "Wales 21-10 Scotland: Huw Jones should not be blamed - Ben Toolis", "paragraph": "By Andy BurkeBBC ScotlandShare this with\n                            Media playback is not supported on this device\n                        Centre Huw Jones should not be blamed for Scotland's defeat by Wales in Cardiff, says lock Ben Toolis. Jones was badly exposed defensively for both Welsh tries from George North and Jonathan Davies as the Scots went down 21-10 at the Principality Stadium.The Glasgow Warriors back apologised to his team-mates afterwards and Toolis says the squad will rally around him.\"I've been in that spot before where you feel like you've done something wrong,\" Toolis told BBC Scotland.\"You feel like you're the reason the other team got points or a big play has happened, but that's Test match rugby.\"Nobody goes out there to miss tackles or drop the ball or make an error. People make mistakes and unfortunately Huw felt like he was to blame. I'm sure he'll bounce back, like we all will.\"Gregor Townsend's men face Fiji at Murrayfield on Saturday having been stunned 27-22 in the last meeting between the sides in Suva in the summer of 2017.Toolis is all too aware how dangerous the Fijians will be this weekend, but insists the players are looking forward to the challenge.\"They've got some outstanding players, individual talents and some big boys, some quick boys,\" the Edinburgh lock said. \"Potentially they could be one of the best teams in the world.\"We're looking forward to it at Murrayfield with the home crowd behind us and we're looking to bounce back.\" \n                            Media playback is not supported on this device\n                        Former Scotland and Glasgow Warriors prop Ryan Grant on BBC Radio ScotlandFrom Scotland, I didn't get that electricity. During the Six Nations, you feel like anything could happen at any point on the pitch, but that wasn't the case and the attack was pretty lacklustre.Former Scotland Sevens captain Colin Gregor on BBC Radio ScotlandIt wasn't a great spectacle, with both teams having not played since the summer and some new combinations. There's plenty of positives but plenty of learning as well.Who should Scotland pick to face Argentina in their third autumn Test? Pick your team then share it with friends.Share this with            Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.How to get into rugby union - through the age groups up to the 15-player game or try rugby sevens, which made its Olympic debut in 2016.Enjoy the best debate, analysis and interviews with BBC 5 live and World Service plus our rugby union commentary listings.This week's sport on the BBC includes the ATP World Tour Finals, the ICC Women's World Twenty20 and the home nations' football internationals.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}