{"id": "Scots Tories against fishing policy extension", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowScottish Conservatives could vote down a Brexit deal if it included extending the Common Fisheries Policy (CFP).The policy sets out fishing rules across the EU to manage fish stocks and fleets by setting quotas.Moray MP Douglas Ross said Scotland's 13 Conservative MPs would not support a deal that included staying part of the CFP beyond 2020.His concerns follow indications that the policy could be extended to allow more time for a final Brexit deal.Speaking on the BBC's Sunday Politics Scotland programme, Mr Ross said: \"I could not support a deal that would include staying in the Common Fisheries Policy beyond December 2020.\"He said an extension of even three months would be too long. Questioned if there was unanimity among the Scottish Conservative MPs for his view, he said he understood they could not support such a deal.If the party's 13 MPs voted against the Brexit deal, it would lead to the UK government losing its House of Commons majority.Mr Ross said: \"I think what's important is that we send out a very strong signal to everyone who is negotiating on behalf of the UK that this is an issue that is extremely important for our Scottish communities that we represent.He added: \"They will see that there is a very clear, distinct message from the Scottish Conservatives, and indeed Scotland, that we cannot have the CFP.\"Concerns were raised this week over the possibility of the UK remaining in the CFP beyond the current end date of 2020, after Prime Minister Theresa May indicated the transition period could be extended to secure a Brexit deal.A spokeswoman for the UK government's Department for Environment, Food and Rural Affairs said: \"We recognise the importance of fishing to the Scottish industry and we will continue to safeguard the interests of our vital fishing communities.\"Fisheries is devolved and the UK government is committed to respecting the devolution settlements in the upcoming Fisheries Bill.\"Douglas Ross' comments come after Scotland's rural affairs minister said Scotland should have full powers over fishing quotas after Brexit.Fergus Ewing said the UK should respect the devolved settlement in legislation on new fishing rules.A new legal framework is expected to replace the EU Common Fisheries Policy following Brexit.The white paper on fishing, published in the summer, anticipated that the UK would continue to abide by CFP during the transition period, but from 2020 it would negotiate access to its waters as an independent coastal state.During the drafting of the bill, Mr Ewing said he had been encouraged by an \"improved level of discourse\" between the UK and Scottish governments.But he said: \"Scotland is best placed to look after and manage our significant fishing interests.\"To that end I expect the UK government to recognise this and our devolved competencies.\"I expect powers to be transferred in full to the Scottish Parliament on important issues like the setting of quotas and days at sea, for example.\"Scotland's voice must not be ignored and I wait with interest to see firm commitments within the bill protecting our interests.\"Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}