{"id": "Vichai Srivaddhanaprabha: Kasper Schmeichel says crash will always stay with him", "paragraph": "Share this with\n                            Media playback is not supported on this device\n                        Kasper Schmeichel says he will never be able to rid himself of the memory of the helicopter crash that killed Vichai Srivaddhanaprabha, Leicester's owner.The Thai businessman and four others died on 27 October, when the helicopter carrying them crashed outside the King Power Stadium shortly after taking off.\"I was on the pitch and I waved him off,\" said Foxes goalkeeper Schmeichel after Saturday's 1-0 win at Cardiff.\"It is something that will stay with me, unfortunately.\"He continued: \"I saw it all happen. It's not a nice memory but I've had all the support that I need. The club has been great and everybody has received the support that they needed.\"Goalkeeper Schmeichel was part of a delegation from the club which arrived in Bangkok on Sunday to attend Srivaddhanaprabha's funeral.Before the Cardiff match the team wore T-shirts featuring a picture of the owner and stood for a minute's silence along with Leicester City staff and fans.Schmeichel joined Leicester in 2011, the summer after Srivaddhanaprabha bought the club.The Denmark international has since played more than 300 games for the Foxes and was a huge figure in Leicester's 2015-16 title-winning season, when they triumphed despite having odds of 5,000-1 at the start of the campaign.Schmeichel said he was \"shaking\" in the warm-up at Cardiff and he was clearly emotional as the Leicester playing squad and staff stood on the centre circle before kick-off to observe the silence.\"It was tough,\" Schmeichel said. \"But we wanted to do it for the chairman and his family. We wanted to be together about this, because we've all lost what feels like a family member.\"He brought everybody here and none of this - the memories, this family he's built, the culture he's instilled - would be here without him.\"When he took over this club it was in a pretty precarious situation, and to build what he has is quite amazing.\"It's one thing building a team and a club that can perform on the pitch, but we're more proud of the family that he's created and the feeling he's instilled in everybody being welcome.\"\n                            Media playback is not supported on this device\n                        The Leicester players and staff flew to Thailand straight after the match, in which Demarai Gray's second-half strike secured the points in the Welsh capital.They will return in time to prepare for Saturday's home game against Burnley, the first match to be played at the King Power Stadium since the tragedy.\"We talked in the dressing room that there was really no need for gameplans, tactics, all that. It was about controlling our emotions,\" Schmeichel said of the Cardiff win.\"We've had great times, but this was different. It felt like a cup final. I haven't really known a feeling like it on the pitch.\"I was just really glad to have won, because for someone to have an impact on so many lives is quite unique. The impact he's had on my family has been amazing and I'm proud to be part of his family.\"Share this with            Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.The latest rumours and stories from around the world of football.Analysis and opinion from our chief football writer.How to get into football - the most popular sport in the world, with clubs and facilities throughout the UK.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}