{"id": "'The food supplement that ruined my liver'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowJim McCants took green tea capsules in a drive to get healthy in middle age. His doctors now say they left him needing an urgent liver transplant, writes the BBC's Tristan Quinn.It should have been one of the happiest days of his life. But Jim McCants looks back on his youngest son's high school graduation with mixed emotions. As he sat down next to his wife Cathleen in the university auditorium, just outside Dallas, Texas, she turned to look at him. \"She said 'Do you feel OK?'\" Jim recalls. \"I said, 'Yeah I feel fine, why?' 'Your face is yellow, your eyes are yellow, you look terrible.' When I looked in the mirror it was shocking.\" It was shocking partly because Jim, then 50, had been working on improving his lifestyle and losing weight, focusing on eating more healthily and taking regular exercise.\"My dad had a heart attack at aged 59 and he did not make it,\" says Jim. \"There's a lot that he missed out on with us and I was determined to do what I can to take care of myself as best I can, so that I don't miss out.\"But soon after his son's graduation, Jim was admitted to hospital with a suspected liver injury. Trying to identify the cause of Jim's liver injury, those treating him ruled out alcohol.\"For the last 30 years I drank maybe a six-pack of beer a year, no wine. So alcohol was not a big part of my life,\" Jim says. They also ruled out prescription drugs - he wasn't taking any at the time - and smoking, something he had never done. \"Then my hepatologist drilled in to, 'What about any over-the-counter supplements?'\" says Jim.Watch the BBC Two Horizon programme Vitamin pills: Miracle or Myth? online (UK viewers only)BBC Food: Can a vitamin pill a day keep the doctor away?As part of his mid-life health kick, Jim had started taking a green tea supplement because he had heard it might have cardiac benefits. These supplements have grown in popularity in recent years, often breathlessly promoted online for their antioxidant benefits, and their supposed ability to aid weight loss and prevent cancer.\"I felt fine then,\" remembers Jim, who lives in Prosper, north of Dallas. \"I was walking or running 30-to-60 minutes, five or six days a week.\" He was working as a finance manager but hoped to retrain as a physician assistant. \"I was taking two or three classes at a time at nights and at weekends,\" he recalls. He had been taking the green tea supplement for two to three months when he became ill. According to Jim's medical record this is the presumed cause of his liver injury. \"It was shocking because I'd only heard about the benefits,\" remembers Jim. \"I'd not heard about any problems.\"After his admission to hospital, Jim went into a \"holding pattern\", waiting for the results of a series of blood tests to establish the seriousness of his liver injury. Then, about three weeks after his wife had first noticed he looked ill, one of his liver doctors delivered the news he had been fearing: \"She said you need a liver transplant. This has to happen fast. You have days - you don't have a week.\" Jim was stunned.\"I was thinking this looks very bleak for me. It really crystallises what's important in life. I wasn't there thinking about projects at work. I was thinking of different people that were important to me for different reasons.\" What is it about green tea supplements that might cause harm at certain doses to some people? Scientists do not know for certain. Because green tea has been drunk for thousands of years, supplements consisting of its concentrated form are regulated in the US and Europe as foods, not medicines. That means that specific safety testing has not been required, so the scientific picture of how green tea supplements might affect our health is incomplete.\"If you are drinking modest amounts of green tea you're very safe,\" says Prof Herbert Bonkovsky, director of liver services at Wake Forest University School of Medicine in North Carolina, who has been tracking injuries linked to green tea supplements for nearly 20 years. \"The greater risk comes in people who are taking these more concentrated extracts.\" Concern has focused on a potentially toxic ingredient called Epigallocatechin-3-gallate or EGCG, the most abundant of the naturally occurring compounds with antioxidant properties in green tea, called catechins. There are likely to be a number of factors that might make an individual susceptible to harm from EGCG including genetics, and the way supplements are used. \"Usually people are taking these green tea extracts trying to lose weight, so they're often not eating,\" Dr Bonkovsky explains. \"We know from animal studies that fasted animals absorb a much higher percentage of the catechins than do fat animals. There may well be other factors of other drugs, other chemicals, use of alcohol that are also important as modifying factors.\"Antioxidants are a group of vitamins and other compounds that for many have taken on miraculous properties, helping to drive the global market for supplements of all kinds, now worth more than £100bn per year.Antioxidants ward off \"free radicals\", molecules produced in our cells as they turn oxygen and food into energy. Just as oxygen and water corrode iron, too many free radicals can damage our cells.In the 1950s, Prof Denham Harman theorised that free radicals drove the process by which the body ages and could lead to disease.But some scientists now believe that free radicals at certain levels may be beneficial for human health, and argue that the orthodox view of the last half century that antioxidants are an unalloyed good is outdated.While millions of people take green tea supplements safely, at least 80 cases of liver injury linked to green tea supplements have been reported around the world, ranging from lassitude and jaundice to cases requiring liver transplants. Those harmed after taking green tea pills have included teenagers, like 17-year-old Madeline Papineau from Ontario, Canada who developed liver and kidney injury, and an 81-year-old woman diagnosed with toxic acute hepatitis.A recent investigation by the European Food Safety Authority into the safety of green tea concluded that catechins from green tea drinks are \"generally safe\", but when taken as supplements catechin doses at or above 800mg per day \"may pose health concerns\". The EFSA could not identify a safe dose on the basis of available data and called for more research to be carried out.  The day after Jim was told he needed a liver transplant, amazingly he was told a suitable liver had been found. \"I was elated. The phone call that there was a match gave me hope that there would be something positive on the other side of this for me,\" he says.The liver transplant saved Jim's life. But four years later he still has serious health problems including kidney disease that may require dialysis and a transplant in the future. He sees his liver and kidney doctors twice a year, and lives with chronic abdominal pain.\"My life before was pretty active. And now it's much more sedentary and I struggle with fatigue,\" he says. It's a \"tremendous blessing\", as he puts it, that his managers allow him to work from home. \"I may need a lie down for 20 or 30 minutes during the day. I'm able to just let my manager know I'm going offline, I'll be back.\"Jim is pursuing a lawsuit against the American firm Vitacost, which sold the green tea supplement he took. \"I'm hoping that they make the decision to put a very strong warning label on the product, on the website, let people know before they buy it,\" he says. Vitacost did not want to comment on the legal case, but said: \"We take the safety of our Vitacost brand supplements very seriously and stand behind the quality of our products.\"  Four years on, Jim reflects on how his life and that of his family changed after he took a green tea supplement.\"I didn't expect harm. I expected that I might waste my money, I may take these and they don't do a bit of good. I can accept that risk,\" he says. \"But the risk that it could cause my liver to fail, that's a risk that's too high for somebody to take.\" British army officer Naima Houder-Mohammed paid thousands of dollars to the father of the alkaline diet, Robert O Young, for a treatment that she falsely believed would cure her cancer. The treatment consisted mainly of intravenous infusions of baking soda.Read: The dying officer treated for cancer with baking sodaJoin the conversation - find us on Facebook, Instagram, YouTube and Twitter.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}