{"id": "The Papers", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowSeveral papers warn that Theresa May faces a fight to keep her job over the coming week.Rebel Tory MPs are demanding a \"high-stakes show trial\", at Wednesday's meeting of the Conservative Party's 1922 committee, according to the Mail on Sunday.They are reported to have threatened a possible vote of no confidence if she does not put on a \"powerful\" performance.\"PM enters the Killing zone\" is the headline in the Sunday Times, which reports that an unnamed rival to Mrs May has said \"assassination is in the air\". Get news from the BBC in your inbox, each weekday morningThe crowds that marched through central London to demand another referendum on the final Brexit deal appear in many papers. The Observer comes out strongly in support of them, arguing that Brexit, on any currently available terms, will be a disaster. The Sun on Sunday says people had every right to march for a new Brexit vote but the government is right to ignore them.Leading Brexiteer Jacob Rees Mogg echoes the sentiment, telling the Daily Star Sunday that there has already been a people's vote - and the people voted to leave. The Sunday Telegraph says that to overturn the 2016 referendum would be a \"dangerously anti-democratic act\" that would confirm the people are not in control. Even so, according to the Sunday Times, civil servants have begun secretly making contingency plans for a new vote. But in a leader article, the paper says there is little appetite for a re-run of the referendum outside the capital.\"Scorn and disbelief\" are mounting at Saudi Arabia's official explanation for the death of journalist Jamal Khashoggi, the Observer says. The Sun on Sunday calls it a farce. \"Where is the body?\" asks the Sunday Mirror.Meanwhile, writing in the Sunday Telegraph, the author Robert Lacey says the idea that shy and avuncular Mr Khashoggi would have thrown a punch at anyone - let alone 15 \"thugs\" - is ludicrous and an insult to the memory of his cherished friend.Under the headline \"A Saudi Prince's Fairy Tale\",  the New York Times asks: \"Who do they think they are fooling?\"The paper says that if America's leadership in the world is to retain any credibility, President Trump must demand a UN-backed investigation and suspend weapons sales to Saudi Arabia.From Saudi Arabia, Faisal J. Abbas, editor-in-chief of Mr Khashoggi's former paper the Arab News, argues that you do not honour the writer by insulting his country. Mr Abbas says Jimmy K - as he was known - was kind-hearted, softly-spoken, and a consummate professional who would have never tolerated much of what is currently being said or done in his name.Most of the papers have pictures of the Duke and Duchess of Sussex on their tour of Australia. A Sunday Times reporter following Prince Harry and Meghan on their Australian tour writes that they have received a \"rapturous reception\" despite the country's strong republican streak, suggesting that even the most trenchant of monarchy-mockers can be vulnerable to a royal baby bump.Writing in the Sydney Morning Herald, the head of the Australian Republic Movement, Peter FitzSimons, says the large crowds do not mean his movement has been set back by the visit but that rather a lot of people - including many of what he calls the commentariat - go weak at the knees in the presence of very famous people.The Mail on Sunday claims an exclusive interview with Meghan's father, Thomas Markle, in which he says he heard she was pregnant while listening to the radio.The Sunday Express says he fears he will never get to see the baby. The Sun on Sunday reports that the Duchess asked her mother, Doria Ragland, to call her father with the news, feeling too \"bruised and raw\" to speak to him herself after he revealed to the media details of conversations with Prince Harry.   Watch the BBC News Channel’s press review every evening at 22:40 weekdays, 22:30 and 23:30 weekends and via the BBC iPlayerDaily ExpressDaily MailDaily MirrorDaily StarDaily TelegraphFinancial TimesGuardianIndependentMetroMorning StarSunTimesThe i"}