{"id": "'My colouring book style was born of necessity'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThe woman who pioneered the adult colouring book trend says a lack of funds and a battle with technology created her multi-million-selling trademark style.As a hard-up art student, Johanna Basford couldn't afford all the different coloured inks everyone else was using.And at Duncan of Jordanstone College of Art and Design in Dundee, her aversion to technology pushed her into choosing silkscreen printing as her craft.She says: \"I ended up specialising in silkscreen, mainly because I couldn't afford a computer and our textile department had just bought this really fancy digital printer, and I couldn't work it.\"So screen printing - analogue - this was my thing. Nobody else cared about it.\"I was also really skint and black and white - single colour - is the most cost-effective way to screen print. \"I thought I would do everything in black-on-white or white-on-black and save some money.\"Johanna, 35, from Ellon, Aberdeenshire, always knew she would be an artist. She was not quite sure which discipline would claim her but she knew she loved to draw.At art school, she chose textiles because they were taught in bright top-floor studios with fantastic views of Tayside. She had considered interior design and graphic design but the studio for that was in the basement of the college and she was determined not to spend three years underground.\"That was how it all started - because I didn't like the basement and I couldn't afford colour,\" Johanna says.Like many of the best success stories, Johanna's was a bit of an accident.She says: \"What happened was, my single colour collection really caught the eye of a lot of people when I graduated. \"Because I did something different they really stood out. \"I became the girl who did the hand-drawn black and white illustrations.\"After graduation, Johanna worked as a freelance illustrator. Her black and white creations became sought-after and she created artwork for commercial giants including Starbucks, Absolut Vodka, Nike and the Smart car company.The adult colouring trend was not even a line on the page when she was approached to try a colouring book.She told the BBC: \"A commissioning editor called me up and asked if I want to do a colouring book.\"I said I'd love to but I wanted to do one for adults. You can imagine how quiet they went. This was the end of 2011. They weren't sure at all.\"I launched into a pitch, saying it's going to be really sophisticated and beautiful and creative.\"I drew up the first five pages and convinced them it was going to be as beautiful as perfume packaging, or a notebook from Liberty. And that's what sold them.\"Johanna says it was a big risk doing the colouring book. It was a passion project and she was warned against it. She says she didn't have time to do it and was working 12-14 hour days on her commissions.But with a bit of perseverance Johanna's first book, Secret Garden, was published in 2013.Its success led to six more and she has now sold more than 21 million copies in more than 40 countries.She was awarded an OBE in the 2016 Birthday Honours list for services to art and entrepreneurship.Johanna remembers the surprise success of Secret Garden.She says: \"My first baby was six months old and things were hectic. I remember the publisher trying to reach me and I said she should just let me know when it reached 500,000 copies. \"I was in the car park of M&S one day with the sleeping baby and the publisher called me and said the book had just reached a million.\"Johanna had no idea the colouring trend would take off. She thought her mum was going to have to buy a lot of copies of the book to help her save face.\"If I had set out to invent a book that would sell 21 million copies I wouldn't have been able to,\" she says.\"All I wanted to do was make a beautiful book.\"Her seventh and latest book is World of Flowers which was inspired by the woman she took her talent from, her grandmother Joan.\"She was a gardener and an artist,\" said Johanna. \"She had these botanical books and when she found a flower she would go in and colour the flower in her book.\"When she died the books were passed to me and they are lovely - the hand-painted flowers of her life.\"Since her first book, the popularity of adult colouring books has skyrocketed.But Johanna is happy to see other illustrators join the trend.\"I'm super proud,\" she says. \"To see all those other books start to come out and take that space and get people excited, that's amazing.\"More and more people are putting down their devices and picking up a pen and pencil and getting creative.\"And that's the real mission here.\"The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}