{"id": "Barbra Streisand May Move to Canada if Republicans Keep the House", "paragraph": "Asked about her mood as the November election fast approaches, Barbra Streisand said that she is having trouble sleeping at night, something that may change if the Democrats take the House.\n“And if they don’t?” Haberman asked the progressive entertainer.“Don’t know. I’ve been thinking about, do I want to move to Canada? I don’t know,” Barbra Streisand replied. “I’m just so saddened by this thing happening to our country. It’s making me fat. I hear what he said now, and I have to go eat pancakes now, and pancakes are very fattening.”“We make them with healthy flour, though — almond flour, coconut flour,” she added.Prior to the 2016 presidential election, Streisand floated the prospect of fleeing the United States if President Donald Trump beat his Democrat rival Hillary Clinton. “He has no facts. I don’t know, I can’t believe it. I’m either coming to your country [Australia], if you’ll let me in, or Canada,” Streisand said in an interview with The Hollywood Reporter.In September, Streisand released a new album Walls featuring the anti-Trump ballad “Don’t Lie to Me,” in which the singer accuses President Trump of being incapable of being truthful.“I just went ballistic,” the 76-year-old said of the president to the Associated Press, who she refers to as “The Liar in Chief” and the “Groper in Chief.”“I just can’t stand what’s going on,” Streisand continued to the news outlet. “His assault on our democracy, our institutions, our founders — I think we’re in a fight. … We’re in a war for the soul of America.”l\nEntertainmentMediaPolitics2018 midterm electionsbarbara streisandDonald TrumpHollywoodRepublicans .Copyright © 2018 Breitbart"}