{"id": "Trump: Democrats Obstruct Easy Fixes for Border Crisis, Caravan", "paragraph": "If the Democrats would stop being obstructionists and come together, we could write up and agree to new immigration laws in less than one hour. Look at the needless  pain and suffering that they are causing. Look at the horrors taking place on the Border. Chuck & Nancy, call me!— Donald J. Trump (@realDonaldTrump) October 20, 2018Trump’s tweet came as the Mexican government halted a Honduran caravan of roughly 3,000 job-seeking migrants at its southern border.On Friday, the caravan broke through barriers at the Guatemalan side of the border and rushed onto a bridge linking the two countries. Mexican police used tear gas to stop the migrant column, which then stayed on the bridge during the night.Mexican officials say they will allow 100 migrants through the barrier to seek asylum in Mexico. Once in Mexico, officials expect most of the migrants to travel north to the U.S. border alongside thousands of other migrants who are being covertly trafficked into the U.S. by cartel-connected human smugglers. Mexican authorities met the migrant caravan with tear gas https://t.co/uRR6Z0rwfN via @karlazabs who was at the Doctor Rodolfo Robles International Bridge in Mexico.— Adolfo Flores (@aflores) October 19, 2018Buzzfeed reported:Firing rounds of tear gas, authorities clashed with several members of the caravan, sending people on the bridge into a panicked retreat. In the mayhem, children were separated from their mothers and many fainted from heat and exhaustion. Some people jumped into the river while women and children — who had been instructed to stand at the front of the line — began trudging back the way they’d came.At least 20 people were treated for injuries after clashes with authorities, including a Mexican reporter, according to the Guatemalan Red Cross.…But after Mexican authorities pushed them back, clusters of defeated families sat on the bridge, trying to figure out what to do next.U.S. media coverage of the caravan has dropped abruptly since Trump began spotlighting the group during his 2018 campaign speeches.Most of the caravan migrants are poor, male job-seekers, but the caravan’s organizers — and media outlets — are showcasing the group’s contingent of women carrying children. Some of the men in the caravan also bring children because the children help trigger catch-and-release loopholes.The loopholes in U.S. immigration law allow the migrants to live in the United States and to legally get jobs until backlogged U.S. courts reject their asylum applications. The wait for immigration court hearings can take up to two or more years. In 2017, for example, officials were forced to provide work-permit to more than 400,000 migrants, each of whom helps drag down wages for Americans and also to boost routine consumer prices for food and other sales for U.S. retailers.This migrants’ focus on economic migration — not sanctuary from criminals — is backed up by an Oct. 18 New York Times article which highlighted the migrants’ focus on jobs in the United States:For or all of them, heading north is a gamble for a better life. Most migrants said they were aware that jobs were plentiful in the United States, and many said they believed that having a child accompany them might help them avoid long-term detention …Among those arriving at the motel in Tucson, there appeared to be more fathers than mothers traveling with a child. Asked why they had come north, one man after another said “trabajo” — work — in construction, restaurants, landscaping or cleaning.“I want to work — any job, I’ll do,” said one man, Efrain, as he cradled his sleepy 2-year-old daughter Suleymi and wiped her runny nose. Efrain said he had been a farmer in Guatemala and had sold a small plot of land to pay for the two-week trek to America. He said he and Suleymi were headed for Florida, where his uncle livesRead more here.  \nBorder / Cartel ChroniclesImmigrationPoliticsDonald TrumpHuman Smugglingimmigrationmexican cartelsMigrant Caravanmigration .Copyright © 2018 Breitbart"}