{"id": "Twitter Lets #MAGABomber Conspiracy Theory Rise to Top of Trending Topics", "paragraph": "In the wake of a number of attempted bomb attacks on left-wing news outlets and politicians, the conspiracy hashtag #MAGABomber became the number one trending topic on the platform in the U.S.Users tweeting in the hashtag allege that whoever is behind the attempted bombings is a supporter of President Trump or has been influenced by his comments criticizing left-wing news outlets and politicians. Below are some example tweets attacking the President and his supporters:Nobody knows who committed this.Everybody knows who incited it.#MAGABomber— Keith M. (@ksecus) October 24, 2018Republicans could’ve stopped Trump from the craziness. They had the power then & they have it now.But they won’t.  They’re culpable for the result.Why would anyone vote for any Republican in these times?Vote for Democrats on Nov 6. #MAGABomber pic.twitter.com/kJILZjgSgj— Mike #DemForce (@MikeEdBaker) October 24, 2018FBI releases photos of possible suspects   #MAGABomber pic.twitter.com/eFjFeOLeSb— Mister Race Bannon (@MrRaceBannon) October 24, 2018We don’t today’s facts. But we do know today’s climate created by Trump. That climate is consistent with today’s events.I think Trump is unfit. He’s incapable of leading with integrity. Republicans should demand his resignation.They won’t. So vote for Democrats.#MAGABomber pic.twitter.com/wAYFajzfJj— Honey #DemForce (@HoneyDemForce) October 24, 2018The  #MAGABomber is a direct result of @realDonaldTrump’s comments about the media being the enemy of the people.— David Leavitt (@David_Leavitt) October 24, 2018Conservative activists have however begun utilizing the hashtag, pushing back on anti-Trump propaganda and conspiracy theories, some have even mocked those blaming President Trump:Looks like the #MAGABomber continues to strike with impunity. pic.twitter.com/KF1UfPPUDU— 🌖Jean's Help Desk🌖 (@Jeans_Stream) October 24, 2018.@jack @twitter You have shut down plenty of trending hashtags Why is #MAGABomber trendingThat is a disgrace since no one has any idea who did thisPlease fix this— Jim Hanson (@Uncle_Jimbo) October 24, 2018#MAGABomber is a conspiracy theory. There is no proof of motive. pic.twitter.com/xLjwuf9qXu— Mike Cernovich 🇺🇸 (@Cernovich) October 24, 2018Will Snopes and PolitiFact be writing articles on how the entire Left promoted a dangerous #MAGAbomber conspiracy theory with no evidence?— Jack Posobiec 🇺🇸 (@JackPosobiec) October 24, 2018Partisan media outlets and purported news writers spreading the dangerous #MAGABomber conspiracy theory with no evidence today pic.twitter.com/ZCfLuk3bEa— Jack Posobiec 🇺🇸 (@JackPosobiec) October 24, 2018Breitbart News has reached out to the company for comment on the #MAGABomber hashtag and whether or not it plans to remove it for pushing a blatant conspiracy theory — the platform has regularly removed trending hashtags in the past. The company has not responded to the request at the time of the writing of this article.Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart.com.\nNational SecurityPoliticsTechbombJack DorseyMasters of the UniverseTwitter .Copyright © 2018 Breitbart"}