{"id": "Watch: MS Sen. Cindy Hyde-Smith Admits She Voted to Fund Planned Parenthood", "paragraph": "“I did vote for a bill that has some funding in it for Planned Parenthood,” Hyde-Smith is heard responding to a question in a video released Friday by the Friends of Chris McDaniel.Republican Gov. Phil Bryant appointed Hyde-Smith to take Sen. Thad Cochran’s seat in March, and she assumed the seat after Cochran retired in April.Hyde-Smith, Republican state Sen. Chris McDaniel, and Democrats Tobey Bartee and Mike Espy are now running in Tuesday’s special election for that Senate seat. If no candidate receives a majority of the vote on November 6, a runoff election will take place on November 27.Hyde-Smith has identified herself as a lifelong conservative who supports the right to life of the unborn.“Cindy believes all children, including the unborn, are guaranteed the right to life by our Creator,” her website states. “She respects the sanctity of life and opposes taxpayer funding of abortions.  As Senator, Cindy will fight for and vote to confirm pro-life judges who will interpret the law as written, and not legislate from the bench.”In a recent interview on Breitbart News Saturday, however, McDaniel observed that Hyde-Smith is a former Democrat, and that a previous leader of the Democrat Party confirmed in June that she voted for Hillary Clinton in the 2008 Democrat presidential primary election.Conservative Review gives Hyde-Smith a lifetime conservative rating of 50 percent, while FreedomWorks gives her a 46 percent rating.In contrast, McDaniel described himself to Breitbart News Saturday as a “lifelong Republican conservative” who, if elected to the U.S. Senate, would reflect the same political values as conservatives such as Sens. Ted Cruz (R-TX), Mike Lee (R-UT), or Rand Paul (R-KY).\nLocalMidterm ElectionPolitics2018 midterm electionsAbortionChris McDanielCindy Hyde-SmithMississippiPlanned Parenthood fundingU.S. Senate race .Copyright © 2018 Breitbart"}