{"id": "Red State Democrats Dragged Down by Gun Control in Final Stretch of Midterm Campaigns", "paragraph": "For example, Sen. Joe Manchin (D-WV)  has attempted to run his re-election campaign so as to appear pro-Second Amendment, but his support of Barak Obama’s post-Sandy Hook gun control push is inescapable. Machin’s post-Sandy Hook gun control push failed, but that did not prevent him from trying to resurrect his gun control bill when high profile gun crimes occurred.His commitment to gun control became so pronounced that the NRA released an ad in June 2013 warning West Virginians that Manchin has abandoned his pro-gun promises:\nManchin’s NRA rating subsequently fell from an A+ to a D and the Washington Examiner reports pro-gun candidate Patrick Morrisey (R) is now leading Manchin 44-42.Sen. Claire McCaskill (D-MO) is having similar trouble with her reelection bid. McCaskill opposed President Trump’s pro-Second Amendment Supreme Court nominee, Brett Kavanaugh, only to have her anti-gun stance further highlighted by an undercover Project Veritas video that caught her staff laughing at how easily she was pulling the wool over the eyes of Missouri voters.On October 16, Breitbart News reported that the undercover video in which McCaskill boasted of numerous bans she has supported in the past and one of her staffers signaled McCaskill’s openness to a “semiautomatic rifle ban” now..@McCaskill4MO's effort to hide her anti-gun positions fits into a broader gun control misinformation campaign, whereby candidates and activists are encouraged to repeat moderate-sounding talking points while harboring plans for severe gun control. https://t.co/Lc7U6XuJUj— NRA (@NRA) October 21, 2018On October 24, Political Polls reported that McCaskill is trailing her pro-gun opponent Josh Hawley (R) 42-49.AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange. \n2nd Amendmentgun controlJosh Hawleypatrick morriseyPro-GunSecond AmendmentSen. Claire mccaskillSen. Joe Manchin .Copyright © 2018 Breitbart"}