{"id": "L.A. County Fire Chief Blames Woolsey Fire on ‘Extreme Climate Change’", "paragraph": "LA Co. fire chief on President Trump's tweet blaming only \"forest management\" for Calif. wildfires:“We’re in extreme climate change right now … I personally find that statement unsatisfactory, and it's very hurtful for all first responders\" (corrects: LA Co. chief, not LAFD) pic.twitter.com/mZc38OS0pE— NBC News (@NBCNews) November 12, 2018“I don’t really want to politize our efforts right now,” Osby told reporters when asked about President Trump blaming the fire on “gross” mismanagement. “I can just tell you that we’re in extreme climate change right now. We don’t control the climate.”“We’re doing all we can to prevent incidents and save lives,” the official continued. “I personally find that statement unsatisfactory, and it’s very hurtful for all the first responders that are putting their lives on the line to protect lives and property.”While in France to commemorate the anniversary of World War I, President Trump responded to reports of thousands of acres scorched and nine deaths due to the three wildfires. “There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor,” the president tweeted.President Trump threatened he would revoke federal funding for California unless the fires were quickly extinguished. “Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!” he added.There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!— Donald J. Trump (@realDonaldTrump) November 10, 2018Following Osby’s briefing, reports emerged revealing Southern California Edison notified state officials of a circuit malfunction two minutes before the blaze started.The Los Angeles Times says the electrical supply company filed a report with the California Public Utilities Commission after the malfunction “out of an abundance of caution.”  The utility giant told the agency that its Chatsworth substation “relayed” on Thursday at 2:22 p.m on East Street and Alfa Road, near the site where the Woosley Fire was sparked. “At this point, we have no indication from fire agency personnel that SCE utility facilities may have been involved in the start of the fire,” the company’s report reads. “The investigation into the matter is ongoing.”Officials confirmed the Woolsey fire has taken the lives of two people while firefighters race to put out the blaze that has scorched over 143 square miles in southern California. At least 30 people are dead and nearly 230 are missing as the Camp Fire rages through parts of northern California, destroying most of Paradise.\nEnvironmentLocalCaliforniaClimate ChangeDonald TrumpfirefirefightersLos Angeles CountyWildfireswildlife .Copyright © 2018 Breitbart"}