{"id": "Maxine Waters: Trump ‘Placing a Target on My Back’ — ‘He’s Promoting Violence’", "paragraph": "Sunday on MSNBC’s “AM Joy,” Rep. Maxine Waters (D-CA) accused President Donald Trump of “placing a target” on her back.Waters said, “It is obvious that the president of the United States of America is placing a target on my back and he keeps calling my name and lying about me in order to make the target work. So I’m not intimidated by it, but I know what he’s doing. So I just continue to do what I do, to call it like it is, to speak truth to power. And I want you to know that the American people, in the final analysis, will understand how divisive this president is, how dangerous he is, and how he is pitting us against each other.”She continued, “What has happened with the targeting of individuals who have basically been opposed to this president should tell the president about what is going on. All of us who are targeted are simply saying that the president of the United States is taking this country in the wrong direction, that it is dangerous, that it is divisive and he continues to dog whistle to his constituency out there. He’s promoting violence. I’m accustomed to being threatened. We have had at least one individual indicted who threatened to kill me. I have many threats to kill me from different places in this country. So I’m accustomed to being threatened, and while I am not foolish, I’m wise enough to understand that I need to have some security, particularly in various circumstances. I’m not afraid. I’m not intimidated, and he cannot stop me. I’m going to continue to talk about how he has defined himself as this divisive and dangerous man that’s running this country. I think in the final analysis after it’s all over that the American people are going to understand that we deserve better than this. He does not have good values and does not care about anybody but himself. I’m comfortable with the fact that he has the target on my back and that I’m threatened. I will continue to do my work, and I will not back down for one second.”Follow Pam Key on Twitter @pamkeyNEN\nPoliticsVideoDonald TrumpMaxine WatersMidterms .Copyright © 2018 Breitbart"}