{"id": "Venezuela: Corpses Exploding in Morgues Due to Power Shortages", "paragraph": "At a morgue visited by journalist Guillermo D. Olmo, the corpses of men, women, and children quickly decompose as a result of sweltering heat, with the lack of electricity meaning there is no cooling system to keep the temperature down.The morgue is located in the northwestern state of Zulia, where temperatures regularly reach well above 30º Celsius (86ºF) due to its tropical climate. Despite being rich in oil resources, the state is one of the area’s most severely affected by the country’s current economic and humanitarian crisis and is often subject to blackouts and power shortages.Due to the lack of refrigeration, many of the bodies in the morgue quickly enter what is known as the emphysematous phase of decomposition, when the bodies can no longer contain the gases and putrid fluids accumulated inside it before they burst.The BBC spoke with a man identified as Arnold, who has the unenviable task of counting the number of dead people in the hospital, which he says is seeing dramatic increases in child and infant mortality. He explained that the process of the emphysematous phase should take place after the body has been buried, but it is taking place too early because the bodies are not being collected in sufficient time.“The funeral home does not take them because it says that the government does not pay what it owes. Given the current situation, families cannot afford a proper burial,” he explained. “Neither the hospital, nor the government, nor the mayor’s office has said they will help the relatives.”“There is no electricity, there are no masks, there is no chlorine, there are no disinfectants, there are no boots, there is no equipment to get into the cameras, there is nothing,” he continued.Breitbart last reported in 2016 on how many morticians complained that they did not have the sufficient resources to deal with the rising number of bodies delivered to their door, many of whom were the homicide victims in this country so plagued by violence.Such horror stories are now commonplace in Venezuela, where nearly 20 years of socialist rule has devastated this once prosperous and high functioning economy. Power shortages have become routine not just in Zulia but across the country, with Nicolás Maduro’s socialist regime forced to ration electricity just to keep the lights on.Venezuelans are also experiencing chronic shortages food and medicine, mainly as a result of the hyperinflation that has rendered their bolivar currency practically worthless. As such, thousands of people fleeing the country every day, often in need of humanitarian assistance, thus joining the millions who have already left.Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.\nLatin AmericaNational SecurityCorpsesdeathMorguessocialismVenezuelaVenezuela CrisisZulia .Copyright © 2018 Breitbart"}