{"id": "Mitt Romney on Democrats’ Bomb Scares: ‘Hate Acts Follow Hate Speech’", "paragraph": "“Disgusting, vile threats and actions against fellow Americans and our institutions are sadly unsurprising: hate acts follow hate speech,” Romney, once a staunch critic of the president, wrote on Twitter. “It is past time for us to turn down and tune out the rabid rhetoric.”Disgusting, vile threats and actions against fellow Americans and our institutions are sadly unsurprising: hate acts follow hate speech. It is past time for us to turn down and tune out the rabid rhetoric.— Mitt Romney (@MittRomney) October 24, 2018Without evidence, the failed presidential candidate placed the blame on a “fellow” American — a fact no law enforcement official at this time has confirmed.Crude pipe bombs targeting Hillary Clinton, former President Barack Obama, CNN, and others were intercepted Tuesday night and Wednesday in a rash of attacks two weeks before nationwide elections.The devices, which officials said shared a similar design, were aimed at prominent Democrats and a cable news network often criticized by political conservatives. A similar device was found Monday at the New York compound of liberal billionaire George Soros, a major contributor to Democratic causes.The bombs overtook other campaign news in an already-tense political season, which has included pitched fights over immigration, the Supreme Court and sexual violence against women.The White House quickly condemned the attacks aimed at Democrats and perceived foes of the administration.“Acts or threats of political violence have no place in the United States,” President Trump said. “This egregious conduct is abhorrent.”“That’s a very bipartisan statement,” he said.All the confirmed bombs appeared to come from the same person or persons, said John Miller, the New York Police Department’s head of intelligence and counterterrorism, who briefed reporters in New York.The U.S. Secret Service intercepted a bomb that was addressed to Hillary Clinton at the Chappaqua, New York, home she shares with former President Bill Clinton, and another that was sent to former President Obama at his home with Michelle Obama in Washington. A police bomb squad removed still another from CNN’s New York headquarters, which was evacuated.Overhead TV shots showed a truck carrying that device, which law enforcement officials said was linked to the other explosives, being driven away. The package sent to CNN contained a live explosive and envelope with white powder, and officials said the substance was being tested to see if it was dangerous.The Associated Press contributed to this report. \nCrimePoliticsBarack ObamaCNNDonald TrumpHillary ClintonMitt Romney .Copyright © 2018 Breitbart"}