{"id": "President Trump Invites Young Black Leadership Summit Attendees to White House", "paragraph": "Donald Trump Jr. will be opening the Turning Point USA event, which is scheduled to begin on Thursday evening, October 25th. Trump Jr. will speak to over 400 young black conservative leaders, as he stated in a tweet on Wednesday.Thrilled to be opening @TPUSA black leadership summit Thursday evening. 400+ black leaders will be in DC for the movement’s largest ever black leadership summit!! https://t.co/iYKVVuuR74— Donald Trump Jr. (@DonaldJTrumpJr) October 24, 2018The summit will also feature several black conservative speakers, some of which include actress and conservative pundit Stacey Dash, former neurosurgeon and current United States Secretary of Housing and Urban Development Dr. Ben Carson, as well as Turning Point USA’s Candace Owens, who Kanye West tweeted in favor of in April.I love the way Candace Owens thinks— ye (@kanyewest) April 21, 2018A week after his tweet, West met with Owens and Turning Point USA’s founder and president Charlie Kirk, in Los Angeles, as the rapper appeared to start taking an interest in the conservative movement.Owens, who joined Turning Point USA in November 2017, told Kirk that she wanted to help the black community discover freedom and self-empowerment, and to walk away from the victim mentality promulgated by the left. Less than one year later, the pair have launched their own campus speaking tour, and are hosting Turning Point USA’s first ever black leadership summit.America is not a racist country. Anyone claiming otherwise has a vested interest in keeping us divided.The easiest way to maintain power over any group is to keep those within it at war with one another.— Candace Owens (@RealCandaceO) October 22, 2018According to a Rasmussen poll in August, Trump’s approval rating among black voters had climbed to 36 percent, compared with just 19 percent on the same day last year.“President Trump, the most successful president in the modern era, is continuing to expand his base by hosting these amazing black leaders from across the country,” said Kirk to Breitbart News on Wednesday.Breitbart News will be present and covering the Turning Point USA event Thursday through Sunday.You can follow Alana Mastrangelo on Twitter at @ARmastrangelo and on Instagram.\nEntertainmentPoliticsTechCandace OwensCharlie KirkDonald Trump Jr.Kanye Westr. Ben Carsonstacey dashTurning Point USAYoung Black Leadership Summit .Copyright © 2018 Breitbart"}