{"id": "Photos: California Fires Continue to Rage, 31 People Found Dead", "paragraph": "Statewide the number of dead stood at 31, including two victims in Southern California, from wildfires raging at both ends of the state.Ten search teams were working in Paradise — a town of 27,000 that was engulfed by flames Thursday — and in surrounding communities in Northern California’s Sierra Nevada foothills. Authorities called in a DNA lab and anthropologists to help identify what in some cases were only bones or bone fragments.All told, more 8,000 firefighters battled wildfires that scorched more than 325 square miles (840 square kilometers) of the state, with the flames feeding on dry brush and driven by winds that had a blowtorch effect.“This is truly a tragedy that all Californians can understand and respond to,” Gov. Jerry Brown said Sunday. “It’s a time to pull together and work through these tragedies.”California is requesting emergency aid from the Trump administration. President Donald Trump has blamed what he called poor forest management for the fires.MALIBU, CA – NOVEMBER 11: A wildfire burns at the Salvation Army Camp on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)MALIBU, CA – NOVEMBER 11: A fire burns at the Salvation Army Camp on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)MALIBU, CA – NOVEMBER 11: A fire burns at the Salvation Army Camp on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)MALIBU, CA – NOVEMBER 11: Firefighters battle a blaze at the Salvation Army Camp on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)MALIBU, CA – NOVEMBER 11: Firefighters battle a blaze at the Salvation Army Camp on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)MALIBU, CA – NOVEMBER 11: A helicopter drops flame retardant on a wildfire on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)MALIBU, CA – NOVEMBER 11: Firefighters battle a blaze at the Salvation Army Camp on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)MALIBU, CA – NOVEMBER 11: Fire crews prepare to clear brush around a fire the Salvation Army Camp on November 10, 2018 in Malibu, California. The Woolsey fire has burned over 70,000 acres and has reached the Pacific Coast at Malibu as it continues grow. (Photo by Sandy Huffaker/Getty Images)PARADISE, CA – NOVEMBER 11: A dog named Rockey stands on the fence in front of the home of Jimmy Clements that survived the Camp Fire on November 11, 2018 in Paradise, California. Fueled by high winds and low humidity the Camp Fire ripped through the town of Paradise charring over 105,000 acres, killed 23 people and has destroyed over 6,700 homes and businesses. The fire is currently at 25 percent containment. (Photo by Justin Sullivan/Getty Images)PARADISE, CA – NOVEMBER 11: Jimmy Clements stands in front of his home that survived the Camp Fire on November 11, 2018 in Paradise, California. Fueled by high winds and low humidity the Camp Fire ripped through the town of Paradise charring over 105,000 acres, killed 23 people and has destroyed over 6,700 homes and businesses. The fire is currently at 25 percent containment. (Photo by Justin Sullivan/Getty Images)PARADISE, CA – NOVEMBER 11: Nancy Clements stands in front of her home that survived the Camp Fire on November 11, 2018 in Paradise, California. Fueled by high winds and low humidity the Camp Fire ripped through the town of Paradise charring over 105,000 acres, killed 23 people and has destroyed over 6,700 homes and businesses. The fire is currently at 25 percent containment. (Photo by Justin Sullivan/Getty Images)The governor said that the federal and state governments must do more forest management but that climate change is the greater source of the problem.“And those who deny that are definitely contributing to the tragedies that we’re now witnessing and will continue to witness in the coming years,” Brown said.Drought and warmer weather attributed to climate change, and the building of homes deeper into forests have led to longer and more destructive wildfire seasons in California. While California officially emerged from a five-year drought last year, much of the northern two-thirds of the state is abnormally dry.In Southern California, firefighters beat back a new round of winds Sunday and the fire’s spread was believed to have been largely stopped, though extremely low humidity and gusty Santa Ana winds were in the forecast through at least Tuesday.Some of the thousands of people forced from their homes were allowed to return, and authorities reopened U.S. 101, a major freeway through the fire zone in Los Angeles and Ventura counties.Malibu celebrities and mobile-home dwellers in nearby mountains were slowly learning whether their homes had been spared or reduced to ash. Two people were killed in Malibu, and the fire destroyed at least 370 or so structures, authorities said.The fire grew to more than 143 square miles (370 square kilometers) and was only 20 percent contained.Celebrities whose coastal homes were damaged or destroyed or who were forced to flee expressed sympathy for the less famous and offered their gratitude to firefighters. Actor Gerard Butler said on Instagram that his Malibu home was “half-gone,” adding he was “inspired as ever by the courage, spirit and sacrifice of firefighters.”In Northern California, where more than 6,700 buildings have been destroyed in the blaze that obliterated Paradise, firefighters contended with wind gusts up to 40 mph (64 kph) overnight, the fire jumping 300 feet across Lake Oroville.The state fire agency said Monday that the fire had grown to 177 square miles (303 square kilometers) and was 25 percent contained.The magnitude of the devastation was beginning to set in even as the blaze raged on. Public safety officials toured the Paradise area to begin discussing the recovery. Much of what makes the city function was gone.“Paradise was literally wiped off the map,” said Tim Aboudara, a fireighters union representative. He said at least 36 firefighters lost their own homes, most in the Paradise area.Others continued the desperate search for friends or relatives, calling evacuation centers, hospitals, police and the coroner’s office.Sol Bechtold drove from shelter to shelter looking for his mother, Joanne Caddy, a 75-year-old widow whose house burned down along with the rest of her neighborhood in Magalia, just north of Paradise. She lived alone and did not drive.As he drove through the smoke and haze to yet another shelter, he said, “I’m also under a dark emotional cloud. Your mother’s somewhere and you don’t know where she’s at. You don’t know if she’s safe.”The 29 dead in Northern California matched the deadliest single fire on record, a 1933 blaze in Griffith Park in Los Angeles. A series of wildfires in Northern California’s wine country last fall killed 44 people and destroyed more than 5,000 homes.___Contributing to this report were Associated Press writers Janie Har and Daisy Nguyen in San Francisco; Paul Elias and Martha Mendoza in Chico, California; and Andrew Selsky in Salem, Oregon.\nEnvironmentLocalCaliforniafirefirefightersParadiseWildfire .Copyright © 2018 Breitbart"}