{"id": "Brazil: Imprisoned Socialist Ex-President Calls for Calm Following Bolsonaro Win", "paragraph": "On Monday morning, PT’s national secretary of finance Emídio de Souza and lawyer Luiz Eduardo Greenhalgh visited Lula in jail, where he is currently serving a 12-year sentence for taking over $1 million in bribes in a corruption scandal that rocked the country and led to dozens of arrests. After meeting with the 73-year-old convict, they said that Lula was “calm” about the election result and urged other people to remain so as well.“Nobody is happy with such a result. But he is normal, easygoing,” De Souza said of Lula’s mindset. “We have already won and we have already lost.”Lula reportedly maintained that Bolsonaro’s victory presented an opportunity for the left to put together a united front transcending party politics against his presidency, which he has denounced as a “fascist adventure.” Bolsonaro has promised to radically reform Brazil with a crackdown on crime and corruption, a return to religious values, and tearing apart former administration’s socialist economic policy.Socialist leader Fernando Haddad is yet to visit Lula in prison following his election defeat, which he lost convincingly with around 45 percent of the vote. During the meeting on Monday, Lula reportedly backed Haddad to lead the opposition through the Bolsonaro presidency, although there remains debate among the leftist establishment over whether he is the right man to do so given his election defeat.“Haddad came out as a great leader, came out with the stature to be a national leader. Before, there was only Lula,” the Worker’s Party President in Rio de Janeiro, Washington Quaquá, told Veja. “Haddad has become a great interlocutor with society and is worthy of leading a democratic front. This is Lula’s position as well.”Haddad visited Lula behind bars to discuss their election strategy the day after cementing a place in the final run-off vote. Lula had previously planned to run for office from jail until Brazil’s “Clean Slate Law,” which prevents politicians convicted of corruption crimes from running for office,” banned him from doing so.Bolsonaro has vowed that the “drunkard” Lula will continue to “rot in jail,” alongside other socialists guilty of corruption in jail. He also repeatedly warned that Haddad planned to ensure the release of Lula and other left-wing allies.“Either they go overseas, or they go to jail,” Bolsonaro said at a campaign rally. “These red outlaws will be banished from our homeland. It will be a clean up the likes of which has never been seen in Brazilian history.”Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.\nLatin AmericaNational SecurityBrazilFernando HaddadJair BolsonaroLula da SilvaWorkers' Party .Copyright © 2018 Breitbart"}