{"id": "Rhodes: House Dems Should Investigate What Trump Knew About Khashoggi and When", "paragraph": "On Saturday’s broadcast of MSNBC’s “Up,” MSNBC Contributor and former Deputy National Security Advisor Ben Rhodes stated House Democrats should investigate whether the White House knew that Saudi Crown Prince Mohammed bin Salman was responsible for the murder of Washington Post writer Jamal Khashoggi and lied about it, and why the White House is “covering up for the Saudi murder of a dissident in a third country?”Rhodes said, “I think what’s very important here, and one of the things I want to know about is, what did Trump know and when did he know it? Because the US intelligence community…Saudi Arabia is something that they follow very closely. And so, the idea that something like this would happen without our intelligence agencies knowing something about what happened, I always thought was very unlikely. And so, what we’ve seen over the last few weeks is Trump kind of trying to get through this, and trying to avoid blaming Mohammed bin Salman, this person who he’s held in a full embrace since the beginning of his presidency. He’s acted almost like the defense attorney for Mohammed bin Salman, trying to figure out what the cover story is today.”He continued, “And they just felt like they were about to get through it. And now we have this report that the US intelligence community has high confidence assessment that MBS did this. … That’s based on information they’ve been looking at for some time. So, when Trump says, well, we just got this information in, no. You just got an intelligence assessment that leaked to the press. The intelligence that informed that assessment has probably been in the system for some time. And guess what? They would share intelligence about a high profile event like this with the White House. So, I think a Democratic House should look very carefully at, was the White House aware that MBS was responsible for this murder? Were they lying about it when they knew MBS was responsible for this murder? Why are they covering up for the Saudi murder of a dissident in a third country?”Follow Ian Hanchett on Twitter @IanHanchett\nIsrael / Middle EastPoliticsVideoben rhodesDonald TrumpJamal KhashoggiSaudi Arabia .Copyright © 2018 Breitbart"}