{"id": "***Live Updates*** Trump Holds Georgia Rally for Brian Kemp", "paragraph": "Trump will also hold a rally later in the evening in Tennessee for Republican Senate candidate Marsha Blackburn before holding three more rallies on Monday.Stay tuned to Breitbart News for live updates. All times eastern.—5:10 PM: Trump asks voters to send a message to radical Democrats like Schumer, Pelosi, and the legendary Maxine Waters by voting for Kemp and other Republicans on Tuesday.5:08 PM: After saying he is standing up for the national anthem, the crowd starts chanting “USA!”… Trump pauses his speech and gives the crowd the stage to continue chanting “USA! USA! USA!”“It sounded too good. I had to let ’em go forward,” Trump says. “I don’t think we could have stopped them anyways. Do you?”5:05 PM: Crowd chants “Six More Years! Six More Years!”Trump says this is one of the greatest movements in history but his supporters have to vote to keep the momentum going even though he is “ahead of schedule.”5:00 PM: Trump says before he went into office, everyone was saying it was just a matter of time before Iran took over the whole Middle East.“They’re not looking anymore for the Mediterranean,” Trump says after talking about withdrawing from the Iran Deal and the crippling sanctions.4:57 PM: Trump says this election is about “safety and jobs.”He says Georgians were “victims” of terrible trade policies that sent manufacturing jobs overseas.Trump: “But those days are over!”4:56 PM: Trump again mocks Warren (saying he has more Indian blood than she and can’t call her Pocahontas anymore) , but this with a new line. Trump: “That was not a good test, Elizabeth!”4:55 PM: Trump says Democrats want to destroy our nation.“Without borders, we don’t have a nation,” Trump says. He says America has worked hard to defend other countries’ borders “but we don’t protect our own borders. But we’re protecting it now.”Trump says Democrats want “chaos” at the border because they think it is benefiting them politically. But he thinks it’s “backfiring.”Trump says illegal immigration is “unfair to American workers, especially African-American and Hispanic-American workers.”He says illegal immigrants drain the country’s treasury and ““endanger every American community.” He illegal immigration costs the country double Georgia’s state budget.4:50 PM: Trump says the first thing Democrats will do if they take power will be “the socialist takeover of health care.”4:43 PM: Trump says Abrams will make jobs disappear… again talks about he must have found the “magic wand” to bring manufacturing jobs back. Trump introduces Kemp, who says, “Thank you, Mr. President, for having Georgia on your mind.”Trump says he’s for Kemp because Georgia’s governorship means so much to the country.4:41 PM: Trump on Oprah, who campaigned for Abrams: “Oprah was a friend of mine until I ran for office,” Trump says. “Once i ran for office, we diverged.” Trump not that harsh on Oprah.4:38 PM: Trump says if Georgians elect Abrams, they can say goodbye the to Second Amendment. “Stacey and her friends will get rid of it,” Trump says, adding that people will knock on doors in Georgia and confiscate guns by saying “please give us all guns right now.”He says she “is one of the most extreme far-left politicians in the entire country.”Trump says she’ll raise income taxes, property taxes right through the roof, and supports a socialist takeover of health care,Trump says Abrams wants sanctuary cities, voted to allow illegal aliens to receive public benefits and hold public office.“Stacey Abrams wants illegal aliens to vote,” Trump says. “They like them coming in because we’re winning.”Trump says “we can’t let that happen” because Democrats figure all illegal aliens will vote for them.Trump says Abrams said illegal aliens should be part of her “blue wave” and says he doesn’t think it’s happening.Trump also blasts Obama for lying about “if you like your doctor, you can keep your doctor.”Crowd in Georgia chants “CNN sucks” as Trump attacks media for criticizing him over occasionally mispronouncing words. pic.twitter.com/GeADq0B9Pj— Rebecca Ballhaus (@rebeccaballhaus) November 4, 20184:35 PM: Trump says you don’t hear much about the “horrendous blue wave” much anymore.“I haven’t heard the blue wave, but you better get out and vote… or I’m going to look very bad with this statement,” Trump jokes.4:32 PM: Trump says it’s a shame that the country gives billions to foreign countries but he can’t get a dime for farmers impacted by hurricanes.4:28 PM: Trump bring legendary UGA football coach Vince Dooley to the stage. He says his son (Derek was a great gift to Alabama on the Third Saturday in October) played football with Kemp.Former @universityofga head football coach Vince Dooley joins President Trump at a Macon, GA campaign rally #tictocnews pic.twitter.com/BZHF6lXxLR— TicToc by Bloomberg (@tictoc) November 4, 2018Big applause as Trump brings former UGA football coach Vince Dooley onto the stage #gapol— Tamar Hallerman (@ajconwashington) November 4, 2018Dooley says he talked to Herschel Walker and he supports Brian and “you’ll be hearing from him in the next couple days…”He jokes that it was easy to coach Walker — just take the snap and hand it off to him — 10 yards, 10 yards, 20 yards, 30 yards.Trump says Georgia has a great one-loss team this year but they could use Walker.4:25 PM: “They don’t do a damn thing,” Trump says of Central American countries like Honduras, El Salvador, and Nicaragua.Trump says the hundreds of millions in aid these countries get are “probably stolen.” And he says the payments are going to stop soon.“Yes, sir! We have barbed wire going up,” Trump says.He says he is sending a message to the caravans and the human traffickers. “Turn back now,” Trump says. He says they are not going to enter the United States unless they come in the proper way.Trump says to vote Democrat if you want more crime and caravans. He says vote for Republicans if you want safer communities.4:23 PM: Trump says the “radical resistance” will try to reverse everything the MAGA movement has gained if they take power. He says they’ll raise taxes, impose socialism, and erase borders.“How about that caravan?” Trump asks as the crowd chants “Build that wall” after he asks if they want to let them pour across the border. Trump tells the crowd he sent the military to the border.“We’re not playing games,” Trump says. “If you look at what’s marching up… That’s an invasion…”Trump says the “violent” caravan overran Mexican police. “These are rough, rough people in many cases,” Trump says. “We have emboldened these people.”4:20 PM: Trump back on Kavanaugh… “This was number four… how about the other ones?”… Trump says the Democrats were “so bad,” “so disrespectful,” and “horrible.” He is now mocking Feinstein again about claiming not to have leaked Christine Blasey Ford’s letter. “She leaked, Trump says after saying it was the worst body language he has ever seen. “In other words, she leaked.”Trump says to go to the polls on Tuesday and remember how Democrats treated Kavanaugh.“Republicans produce jobs,” Trump says. “Democrats create mobs.”Trump says Antifa takes their helmets off and you “see their little arms.” He’s mocking Antifa. And says these are bad people causing problem “and the press doesn’t want to talk about them.”Trump talks about bikers, military, ICE, and the Border Patrol for Trump.4:19 PM: Trump says ten years ago he was living a “nice simple life” (The Simple Life was the title of Paris Hilton’s reality show) and “look what happened…”4:17 PM: Crowd gets louder as Trump talks about confirming Justice Kavanaugh. He says Democrats treated him so “unfairly” and talks about the woman who admitted that she never met Kavanaugh even though she accused him of rape. Crowd chants “lock her up.”“You knew that before,” Trump says.4:15 PM: Trump says jobless claims in Georgia lowest in 45 years in more Georgians employed than ever.“She’ll end it quickly. She’ll double up your taxes. A lot of bad things will happen,” Trump says of Abrams. He says to elect her if he wants to see the great economy end quickly.Trump says Kemp is an “incredible manager” and bring Georgia’s economy to new heights.4:12 PM: Trump says “America now has the best economy in the history of our country” but warns “it can be destroyed very quickly” by Democrats who will take a “wrecking ball” to everything. He touts last month’s great jobs report and says the numbers were great despite the hurricane that hit the southeastern United States.4:06 PM: “There is electricity in the air that I have not seen [since 2016],” Trump tells the crowd. He says crowds like this have not existed in the history of the midterm elections.“We never left center stage,” Trump says of the 2016 GOP presidential debates. He then says he went against “Crooked Hillary” and was very successful as the crowd chants “Lock Her Up.” Really has a Monday Night Raw + SEC football game feel. Trump says his supporters who have “built this country” are “great people.”Trump says the press treat him unfairly by not showing his crowd size. He says the cameras “turned like pretzels” as soon as there were protesters and “trouble” at his rallies.4:05 PM: Trump says this is like being at a Georgia football game. Trump says he thinks Kemp is going to do “very well” based on crowd size. Trump says he is thrilled to be back in a state he won “easily” in 2016.4:02 PM: Trump gets on stage before a raucous Georgia crowd. Electric.3:50 PM:GOP gubernatorial candidate Brian Kemp is speaking to the rally. pic.twitter.com/4moZ11HJZ6— Richard Elliot (@RElliotWSB) November 4, 2018Republican Brian Kemp rallies crowd at Macon aircraft hangar. President Trump is en route aboard Air Force One in hopes of breaking the statistical tie in the race for Georgia governor. pic.twitter.com/DSsjgaVAAQ— Jonathan Serrie (@jonathanserrie) November 4, 2018Possibly the most famous aircraft in the world.  Air Force One was on approach to Robins (GA) AFB and flew very close to my office in Warner Robins. #POTUS #MakeAmericaGreatAgain pic.twitter.com/mxVTaBu8pW— Dave Stewart (@kn4ds) October 15, 2018These folks arrived in Macon yesterday morning to wait in line to see Pres. Trump campaign for Brian Kemp. pic.twitter.com/Gc3JqTV7pv— Richard Elliot (@RElliotWSB) November 4, 2018\nMidterm ElectionPolitics2018 midterm electionsBrian KempDonald TrumpStacey Abrams .Copyright © 2018 Breitbart"}