{"id": "U.S. to Halt Refueling Saudi Warplanes in Yemen", "paragraph": "The move to stop refueling came at the behest of America’s key ally in the Middle East Saudi Arabia, U.S. Secretary of Defense Jim Mattis confirmed in a statement on Friday, adding:We support the decision by the Kingdom of Saudi Arabia, after consultations with the U.S. Government, to use the Coalition’s own military capabilities to conduct in-flight refueling in support of its operations in Yemen…The U.S. and the [Saudi-led] Coalition are planning to collaborate on building up legitimate Yemeni forces to defend the Yemeni people, secure their country’s borders, and contribute to counter Al Qaeda and ISIS [Islamic State] efforts in Yemen and the region.Citing anonymous U.S. officials, the Associated Press (AP) reported that the refueling decision would not stop American training and military assistance.U.S. troops will continue “limited intelligence support in defense of Saudi Arabia,” an unnamed defense official told NBC News.The Trump administration made the refueling decision, first reported by the Washington Post (WaPo) on Friday, amid escalating criticism from U.S. lawmakers of Saudi Arabia’s role in the Yemen war, particularly the kingdom’s alleged contributions to the death of civilians and ongoing humanitarian crisis.“A Senate staffer said the decision is a means to pre-empt a potentially damaging debate and vote in Congress. The political climate on the Hill has turned hostile to Saudi Arabia over the killing of Washington Post columnist Jamal Khashoggi and the war in Yemen, the staffer said, adding that some Republican lawmakers who opposed suspending refueling now favor the move,” NBC News pointed out.In a rare show of bipartisanship, lawmakers from both parties have demanded that the U.S. stop weapons sales to Saudi Arabia and halt the refueling of warplanes flown by the coalition led by the Sunni kingdom, which watchdog groups have accused of killing thousands of unarmed civilians, the Post noted.Sens. Todd C. Young (R-IN) and Jeanne Shaheen (D-NH) renewed their calls for a suspension of U.S. refueling in the Yemen war, saying in a statement issued Friday, “We must send an unambiguous, immediate, and tangible message that we expect Riyadh to engage in good faith and urgent negotiations to end the civil war Riyadh must also understand that we will not tolerate the continued indiscriminate airstrikes against civilians and civilian infrastructure that have helped put 14 million Yemenis on the verge of starvation.”Although anti-Yemen war lawmaker Sen. Bernie Sanders (I-VT) welcomed the decision to end the refueling of Saudi coalition aircraft, Foreign Policy (FP) acknowledged that the move would not satisfy all critics of the conflictSecretary Mattis noted in his statement Friday:The U.S. will also continue working with the Coalition and Yemen to minimize civilian casualties and expand urgent humanitarian efforts throughout the country. Recognizing continued bipartisan interest from Congress, the Administration is appreciative of the continued dialogue we have had with key members on this issue and look forward to working together to support the United Nations’ ongoing efforts on this new phase in Yemen.Soon after WaPo reported the refueling decision, the Saudi and American governments confirmed the move.“The Kingdom and the Coalition has increased its capability to independently conduct in-flight refueling in Yemen. As a result, in consultation with the United States, the Coalition has requested cessation of in-flight refueling support for its operations in Yemen,” Saudi Arabia said in a statement published by the state-run Saudi Press Agency (SPA) on Saturday.It remains unclear what impact the move to stop refueling Saudi coalition aircraft will have on the overall war in Yemen, AP conceded, noting:It wasn’t immediately clear what impact the U.S. withdrawal from air refueling operations would have. American officials earlier said Saudi forces now handled some 80 percent of their refueling operations, which crucially allow aircraft to fly longer sorties over possible targets and can ease the pressure for quick strikes.Yet even with that refueling support, Saudi Arabia has faced widespread international criticism over its campaign of airstrikes in the coalition’s war in Yemen, targeting Shiite rebels known as Houthis who hold the capital, Sanaa. Saudi strikes have hit public markets, hospitals, and other nonmilitary targets, killing scores of civilians.Mattis and the U.S. State Department noted that the Trump administration is still pursuing peace in Yemen.Both Mattis and Secretary of State Mike Pompeo have called for an end to the war in Yemen.In March 2015, a U.S.-backed Saudi Arabia Sunni coalition launched the ongoing offensive against the Iran-allied Houthis to restore the internationally-recognized government of Yemeni President Abd Rabbuh Mansour Hadi back to power.\nIsrael / Middle EastNational SecurityPoliticsDonald TrumpHouthisIranSaudi ArabiaYemen .Copyright © 2018 Breitbart"}