{"id": "Victor Davis Hanson: Macron Wants ‘European Union Army,’ Can’t Make NATO Payments", "paragraph": "Hanson reflected on Macron’s Sunday remarks at the centennial commemoration of World War I’s armistice in Paris, France, where the French leader said, “Patriotism is the exact opposite of nationalism: Nationalism is treason.”Hanson said, “I was kind of shocked, because here the host was taking the occasion to pose as Europe’s next leader by basically attacking not only Eastern European leaders, but Trump with his nationalist point, and then framing a hyper-fascist nationalist like Petain, who not only, you could argue about his behavior in World War I, good and bad, but he was the leader of French fascist nationalism in World War II, and yet Macron, historically illiterate, starts to praise him while he’s attacking Trump.”LISTEN:Hanson continued, “And then [Emmanuel Macron] adds insult to injury by talking about, on the eve of the trip, how he’s going to create a European Union army, and it’s going to be used to protect France and Europe from not just China and Russia, but the United States, and yet he wants the United States to come over and commemorate coming in World War I and saving France, and by extension World War II, and by extension the Cold War, and yet he and the Germans can’t even spend the two percent [of their GDP] towards NATO, and yet they’re talking about an additional army. So the entire thing is absurd.”Hanson added, “It’s what French leaders always do when their popularity is down in the 20s, which is where Macron’s is.”Hanson examined historical lessons to be drawn from World War I’s armistice and the lead-up to World War II.“[Woodrow Wilson] ended up a tragic figure,” assessed Hanson. “He missed one central point: When you’re a wartime figure, you have to put your national interest first, and you have to ensure victory, and humiliation, and the defeat of your enemy before you talk about peace. He talked about peace first and victory second. That didn’t work.”Hanson examined the failures of global governance structures such as the League of Nations and United Nations (U.N.) in maintaining peace between nations.Hanson stated, “The League of Nations was a complete failure. Remember, the Italians went in and just slaughtered the Ethiopians, and the British and the French had the two largest fleets in the Mediterranean, and all they had to do was stop the Italians from going through the Suez Canal. They could’ve blown up every Italian ship with troops in them, and they would have never been able to get into East Africa, and yet they didn’t do anything.”Hanson went on, “China was attacked by Japan as early as 1932 and 1933, and the League of Nations could have stopped that. Japan had essentially no oil, and Holland and the Netherlands controlled the Dutch facilities next door, and we were an oil exporter, and yet we did nothing. The idea that the League of Nations failed because the United States didn’t participate is kind of crazy.”Hanson warned against subversion of national sovereignty to international institutions such as  the U.N. “There’s not a good record of international conferences keeping the peace,” noted Hanson. “What keeps the peace is that countries that are democratic and have constitutional government are well-armed, and they deter bad actors, and say, ‘I wouldn’t do what you want to do, because if you do a cost-benefit analysis you’re going to pay a terrible price.’ But when you lose that, you always lose that when you chop up or outsource your national security to something like the League of Nations or the U.N.”Hanson added, “Then you get somebody who’s pretty weak — Hitler in the late 30s, or Mussolini, or the Japanese government, and then later Tojo — they were pretty weak compared to the potential of the British Empire or the United States and the Western democracies in Europe, but they didn’t feel they were weak because they looked at appeasement and isolationism and they thought, ‘Wow, it’s going to be easy to pick off this low-hanging fruit.’ And it was until 1942.”Hanson cautioned against irresponsible benevolence via statecraft in wartime.“It’s very dangerous to go in and defeat an enemy, and then to take your foot off his neck, so to speak, out of this false sense of magnanimity and humanitarianism, because once you do that, a lot of innocent people are going to get killed,” noted Hanson.Hanson advised, “So if you want to go to war, you have to defeat the enemy, and you have to occupy his territory. You have to change his government, or at least change his mindset. We haven’t learned that lesson. We’re still dealing with the aftermath of the Korean War which also had an armistice and was not a surrender.”Hanson also examined left-wing news media hostility towards President Donald Trump.Hanson said, “Now, with this 7-billion-person mob, and they don’t know much about the past, they feel that they can just instantly serve as sort of a French revolutionary guillotine mob in the streets of Paris, and so it’s instant thumbs up or down, and I think that’s lost all perspective about Trump.”Hanson added, “[Donald Trump] didn’t say, ‘Get in the their faces,’ or ‘Bring a gun to a knife fight,’ or ‘Punish our enemies,’ or at least Melania didn’t say, ‘I’ve never been proud of this country,’ or ‘the United States is a downright mean country.'”Hanson concluded, “The idea that everything was normal until Trump came along is just a historical fallacy. For the media, there’s something about [Donald Trump’s] class, his accent, his appearance, his speech, and his background that they find antithetical to their whole notion of what a president should be, and they react accordingly.”Hanson is a professor of Greek and director of the classics program at California State University in Fresno, CA. His forthcoming book, The Case for Trump, will be published on March 5, 2019.Breitbart News Daily broadcasts live on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.Follow Robert Kraychik on Twitter.\nNational SecurityPoliticsRadioAlex MarlowBreitbart News DailyDonald TrumpEmmanuel MacronEuropean Unioneuropean union armyFranceLeague of NationsNatoU.N.United NationsVictor Davis HansonwarWorld War IWorld War IIWWIWWII .Copyright © 2018 Breitbart"}