{"id": "Joy Reid: ‘Interesting’ that Pelosi and Clyburn Get Challenges and Hoyer Doesn’t", "paragraph": "On Saturday’s broadcast of MSNBC’s “AM Joy,” host Joy Reid said it’s “interesting” that House Democratic Leader Nancy Pelosi (D-CA) and House Assistant Democratic Leader James Clyburn (D-SC) face challenges to their candidacies for House Democratic leadership posts, while House Democratic Whip Steny Hoyer (D-MD) doesn’t, and “the African-American guy and the woman get challengers, and everyone’s saying they’ve got to go in order to save the party’s soul.”MSNBC Contributor and the Root Politics Editor Jason Johnson speculated that the talk about Representative Marcia Fudge (D-OH) challenging Pelosi for the speakership might be Clyburn “asking her to step forward and challenge Nancy Pelosi so Pelosi will come and support him. Because he’s got a real challenger. I think there’s a lot going on behind the scenes here.”Reid asked, “I wonder why people don’t look at Steny Hoyer, who’s one year older than Nancy Pelosi, who’s been there as long as she has. They were elected the same year. Why is it Nancy Pelosi that’s the focus, and not someone like Hoyer or Clyburn who’ve both been around a long time too?”Towards the end of the segment, Johnson re-iterated that Clyburn is facing a serious challenge in his leadership race.Reid then wondered why Clyburn is facing a challenge while Hoyer isn’t.Former RNC Chair Michael Steele remarked that Hoyer has “forged relationships” with members of Congress and that’s why he isn’t challenged.Reid then stated, “I just find that interesting, that the African-American guy and the woman get challengers, and everyone’s saying they’ve got to go in order to save the party’s soul.”Follow Ian Hanchett on Twitter @IanHanchett\nPoliticsVideoJames ClyburnJoy ReidNancy PelosiSteny Hoyer .Copyright © 2018 Breitbart"}