{"id": "October Ratings: CNN Wipes Out, MSNBC Sheds 20% of Younger Viewers", "paragraph": "With fewer than one million total average primetime viewers — 931,000 to be precise — Fox News more than tripled CNN with 2.829 million total average primetime viewers.In fact, in total primetime viewers, Fox News trounced CNN and MSNBC combined.Fox: 2.829 millionMSNBC: 1.575 millionCNN: 931,00.During primetime, CNN lost to HGTV, USA, and the Hallmark Channel.Things were not much better in total day viewers.CNN was only able to attract an average of 689,000 total day viewers.With an average of 1.685 million total day viewers, Fox News nearly beat the very-fake-news CNN by a million average viewers.MSNBC attracted an average of 909,000.In this total day metric, CNN lost to the Hallmark Channel and Nickelodeon.What is extraordinary is just how repelled America is by CNN, which used to be the place where everyone went during big news stories.October was a month filled with mammoth news. The first week was dominated by the bitter confirmation battle over Brett Kavanaugh. This was quickly followed by all-consuming news cycles involving Hurricane Michael, the likely murder of Jamal Khashoggi, the migrant caravan, the mail bomber, and the massacre at the Pittsburgh synagogue.And even as those particular news cycles started to deflate, hanging over everything has been the upcoming midterm elections, which have only become a more interesting horse race as the momentum see-saws throughout the month.Nevertheless, despite all of this news-manna from heaven, CNN could not average even one million primetime viewers. That is truly remarkable.Even more remarkable is that things are so bad for CNN, the left-wing cable channel actually lost viewers in a few crucial metrics.When compared to last year, Fox News exploded its total primetime viewership by 25 percent and its total day viewership by a full 16 percent.CNN, however, lost five percent of its total day viewers and only grew its already anemic primetime viewership by a measly one percent.In the advertiser covered 25-54 age demo, Fox News jumped 16 percent during primetime and three percent in total day, while CNN took a swan dive by double digits — a loss of eleven percent of its demo viewers during primetime and 16 percent in total day.In this particular metric, the news was somehow worse for MSNBC. In the all-important 25-54 age demo, MSNBC actually managed to lose to CNN during primetime. Overall, MSNBC lost 19 percent of its primetime demo viewers and 20 percent of its total day demo viewers.With both MSNBC and CNN shedding younger viewers by double digits, and Fox News increasing its younger primetime viewers by double digits (16 percent), it would appear as though America’s youth is finally growing tired of all the mindless Trump bashing and race baiting.Finally, for the first time in a long time, MSNBC’s Rachel Maddow failed to rank among the top five cable news shows. In fact, all five of those slots were filled by Fox shows.And if past is prologue, when the more detailed data come out later this week, not a single CNN show will manage to rank in the top 20 or 25. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.\nMediaBrett KavanaughCNNfake newsFox NewsJamal KhashoggiMSNBCratingsVery Fake News .Copyright © 2018 Breitbart"}