{"id": "Adam Laxalt’s MS-Stricken Mom Rejects Nevada Democrat’s Healthcare Attack", "paragraph": "Laxalt, the state’s current Attorney General, hit back against a new campaign ad from Sisolak’s camp calling the Republican a bully and making claims about Laxalt’s record on pre-existing health conditions and school funding. Laxalt countered the claims Tuesday. He pointed to Reno Gazette-Journal and Las Vegas Review-Journal articles calling Sisolak a “bully” and “political bulldozer.”Sisolak’s ad claims Laxalt would allow insurance companies to deny pre-existing condition coverage. Laxalt rejected the claim, pledging to protect such coverage.Laxalt’s mom, who is in the final stages of multiple sclerosis, addressed her son’s position on pre-existing conditions in a recent ad. “I’m a single mother. I raised Adam and his sisters alone. I’ve had MS for the course of my son’s life. I’m into the latest stages,” she says. “Steve Sisolak is a career politician. When he says my son would deprive you of pre-existing condition coverage, he’s a liar. I am a pre-existing condition.”Laxalt goes on to counter Sisolak’s charge that the Attorney General fought against Governor Brian Sandoval over school funding. Not true, Laxalt’s campaign contended, clarifying that he disagreed on a commerce tax not earmarked for education. The campaign further pledged, “he’ll commit $500 million in new funding that will go into the classroom where it belongs, and will give parents more educational options for their children — all while keeping taxes low.”“Steve Sisolak’s only solution is to raise taxes. He’s promised to increase property taxes on Nevada families. And the only thing he’s ever done for schools is double student tuition while on the Board of Regents,” Laxalt’s campaign argued.Laxalt’s campaign released their own ad focused on his actions fixing a rape kit problem in the state, protection of veterans, and prosecution of elder abuse and sex traffickers.The race between Republican Laxalt and Democrat Sisolak has been extremely tight, nearly tied in most recent polls that show Laxalt with an approximate one point lead that is within the margin of error. RealClearPolitics rates the race a toss-up.This month allegations surfaced that Sisolak had physically abused his now ex-wife. Despite the allegations, former President Barack Obama and Democrat Senate candidate Jacky Rosen campaigned for Sisolak last week. Obama has contended that Democrats can use the midterm elections to “restore some sanity to our politics.”Michelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook\nHealthMidterm ElectionPoliticsAdam LaxalthealthcareObamacarepre-existing conditionsSteve Sisolak .Copyright © 2018 Breitbart"}