{"id": "Report: Islamic State Foreign Fighters Galvanizing Local Jihadis in Philippines", "paragraph": "The Guardian noted, “The presence of foreign fighters is known to energize and embolden local pro-ISIS groups and there are increasing concerns of a renewed bid to declare a caliphate in Mindanao.”In October, the Washington Times, citing the Center for Strategic and International Studies (CSIS), reported that there are more Islamic State (ISIS/ISIL)-linked foreign fighters in Southeast Asia now, namely in the Mindanao region, than there ever were during the peak of the U.S.-led wars in Afghanistan and Iraq.According to a recent assessment of U.S. military operations in support of the Filipino government’s efforts against ISIS conducted by the Pentagon’s office of the inspector general (OIG), the number of fighters from the terrorist group has increased from 200 to 500 in the last few months.Citing Rommel Banlaoi, chairman of the Philippine Institute for Peace, Violence and Terrorism Research, the Guardian estimated that between 40 and 100 of the ISIS jihadis are foreign fighters mainly from neighboring Indonesia and Malaysia but also Pakistan, Bangladesh, and the Middle East.“Many seek the relative sanctuary of the southern Philippines,” Zachary Abuza, south-east Asia analyst at the National War College, told the Guardian, referring to the foreign fighters. “There they can regroup, train and plot attacks. With ISIS’s declaration of an east Asia wilayah, the southern Philippines becomes more important because there is enough ungoverned or very poorly governed space.”“There are ISIS cells in Malaysia and Singapore, but they don’t control any territory,” he added. “You can’t be [a] province of the caliphate without territory.”Furthermore, the fall of the group’s so-called caliphate in Iraq and Syria has also prompted “an unprecedented number of Europeans, including those from the UK, Spain, Germany, and Switzerland” to attempt to travel to join ISIS in the Philippines this year, the Guardian revealed.“Foreign fighters are in the Philippines because they consider the country, particularly Mindanao, as a safe haven, alternative home base and a new land of jihad,” Banlaoi said.“They train and learn from local fighters. They provide funds. They provide a global support network,” he continued.The Guardian warned of continued support for ISIS among local Muslims in Mindanao, home to the five-month siege by the Filipino army to retake Marawi from the jihadist group in October 2017, a successful offensive that left more than 1,000 people dead.Sidney Jones, director of the Institute for Policy Analysis of Conflict, told the Guardian, “The risk of violence continues to be very high, more from local pro-Isis elements.”Although “ISIS-Philippines (ISIS-P) remained fragmented and degraded” and “has not controlled any territory since its defeat in that conflict, various factions [linked to the terrorist group] carried out opportunistic acts of violence against civilians and security personnel,” the U.S. Department of Defense (DOD) IG noted in a press release announcing a report issued last Monday.The IG acknowledged that “the group has been without a unified leadership or command structure since the end of the 2017 siege of Marawi” when the Philippine military killed the leaders of the nation’s two ISIS affiliates — Isnilon Hapilon of Abu Sayyaf and Omar Maute of the Maute group.The Guardian noted that the old and new ISIS arrivals on the Christian-majority island nation are trying to want re-establish the east Asia wilayah (or East Asia ISIS province) crushed by the Filipino army in October 2017.In 2018, the Pentagon spent more than $100 million on Operation Pacific Eagle – Philippines (OPE-P), the official mission in support of the island nation’s efforts against ISIS. There are 250 U.S. troops supporting the OPE-P mission.\nAsiaIsrael / Middle EastNational SecurityISISIslamic StateMarawiMindanaoPhilippinesradical islam .Copyright © 2018 Breitbart"}