{"id": "Turkey Reportedly Refuses to Give Khashoggi Audio to CIA Chief", "paragraph": "Reuters on Tuesday quoted Western security officials who said that despite extensive Turkish media coverage of the rumored audio, “neither U.S. nor allied government agencies have been granted access as of late Monday to such evidence.” The officials added that U.S. and allied intelligence agencies “possess little hard evidence” related to the case. Pro-government Turkish media, on the other hand, claimed on Wednesday that “all the evidence” related to Khashoggi’s murder has been shared with the CIA.“Video images and audio tapes, as well as evidence gathered from the consulate and the consul’s residence, were shared with Haspel during the briefing at the Turkish intelligence organization,” Turkey’s Sabah said, as related by Middle East Eye.Withholding evidence would be especially vexing given that the degree of involvement by the effective ruler of Saudi Arabia, Crown Prince Mohammed bin Salman, is a paramount concern for U.S. diplomacy.Nearly all global media coverage of the case has been driven by rumors and leaks to Turkish media by anonymous officials. The most recent rumor claims someone from Riyadh, possibly top bin Salman aide Saud al-Qahtani, supervised the abuse and murder of Khashoggi through a telephone or network connection like Skype. Such evidence would go a long way toward pinpointing the level of complicity in Khashoggi’s killing by high-level officials or the monarchy.Another story government sources leaked to Turkish media on Wednesday claimed the Saudis have reneged on their promise to fully cooperate with investigators by denying permission for Turkish police to search a well in the garden of the Istanbul consulate.NPR on Monday noted Haspel made a good choice of emissary to Turkey for Khashoggi affair, as she speaks Turkish and has described Istanbul as one of her favorite cities. Tom Rogan at the Washington Examiner notes she has been stationed in Turkey at least twice and “has a respectful relationship with Turkey’s capable primary intelligence service, the MiT.” (In Rogan’s estimation, “capable” means quite capable of bugging the Saudi consulate).Rogan suggests Turkey’s truculence might be due in part to tensions with the Trump administration over Turkey’s cooperation with Russian intelligence, its indulgence of anti-American nationalist groups, and U.S. support for Kurdish groups in Syria and Iraq which Turkey views as partners of the violent separatist PKK organization. Relations between Turkey and the U.S. were in the first tentative stages of improving after the release of American pastor Andrew Brunson when the Khashoggi crisis erupted.The Washington Post, which employed Khashoggi as a contributor, on Wednesday explored how Erdogan has used a combination of tight control over the evidence and leaks distributed by Turkish media to take control of the case. Erdogan’s taste for the style of Islamist government espoused by Khashoggi, his relationship with Saudi Arabia’s adversary Qatar, and his penchant for controlling information – including the wholesale abuse of journalists – are among the reasons to be suspicious of his motives. One way or the other, no matter how solid Turkey’s evidence turns out to be or what it reveals about Crown Prince Mohammed bin Salman’s involvement, there is no question Erdogan will lose a substantial amount of control over the situation once significant evidence is shared with other countries.As NPR’s analysis noted, the more cynical observers of Erdogan’s conduct in the Khashoggi affair see more maneuvering, signaling, and negotiation than dogged searching for the truth. Erdogan says he wants the “naked truth,” but the truth hasn’t even taken off her coat and slipped into something more comfortable yet.\nIsrael / Middle EastNational SecurityCIA Director Gina HaspelJamal KhashoggiPresident Recep Tayyip ErdoğanSaudi ArabiaTurkey .Copyright © 2018 Breitbart"}