{"id": "Immigration Reformers Thank Trump for Challenging ‘Outdated Concept’ of Birthright Citizenship", "paragraph": "During an interview with Axios, Trump revealed that he is planning to executively end the birthright citizenship policy — which rewards the children of illegal aliens with United States citizenship.“It will happen–with an executive order,” Trump said of ending birthright citizenship.The children of illegal aliens are commonly known as “anchor babies,” as they anchor their illegal alien and noncitizen parents in the U.S. There are at least 4.5 million anchor babies in the country, a population that exceeds the total number of annual American births.Subsequently, when given birthright citizenship, anchor babies are also rewarded with the privilege of bringing their foreign relatives to the U.S. through the process known as “chain migration.” Every two new immigrants to the U.S. bring an estimated seven foreign relatives with them.With Trump’s announcement, pro-American immigration reformers who have been advocating for the end of birthright citizenship for decades are applauding Trump.NumbersUSA President Roy Beck told Breitbart News in a statement:We applaud President Trump for challenging the practice of bestowing automatic citizenship on foreign visitors and illegal aliens, an outdated concept that has been abandoned by most of the world’s nations, including all but two of those with advanced economies. [Emphasis added]It not only serves as an incentive for illegal immigrants but has even generated an entire ‘birth tourism’ industry. NumbersUSA has advocated for two decades that this federal practice that adds hundreds of thousands of people to the United States each year be ended. [Emphasis added]Executive Director of the Immigration Reform Law Insititute (IRLI) Dale Wilcox called the “faulty interpretation” of birthright citizenship a “magnet” for “large-scale” illegal immigration, saying that it has “caused great harm to our sovereignty.”“The Trump administration is right to correct this error,” Wilcox said.“The Supreme Court precedent on birthright citizenship has been ignored or misstated for 120 years,” Wilcox continued. “Citizenship via birth was intended under the 14th amendment for those born in the U.S. to a U.S.-resident parent who has permission to be here at the time, and owed direct and immediate allegiance to the U.S.“The rule clearly excludes the children of both illegal aliens and tourists,” Wilcox said.It remains unclear as to when Trump will introduce his executive order ending birthright citizenship. Reformers say the order should come sooner tather than later.Every year, the U.S. admits more than 1.5 million foreign nationals, with the vast majority deriving from family-based chain migration. As Breitbart News recently reported, there are more anchor baby births in the Los Angeles, California metro area than the total U.S. births in 14 states and the District of Colombia. Every year, American taxpayers are billed about $2.4 billion to pay for the births of illegal aliensJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.\nImmigrationPoliticsanchor babiesbirthright citizenshipChain MigrationIllegal AliensimmigrationTrump .Copyright © 2018 Breitbart"}