{"id": "EPA Reverses Obama Era Last Minute Uranium Mining Regulations", "paragraph": "The regulations were put in place on Jan. 19, 2017, just hours before Barack Obama left office and President Donald Trump’s inauguration.“In a rush to regulate during the waning hours of the previous administration, the agency proposed a regulation that would have imposed significant burdens on uranium miners and the communities they support,” Acting Administrator Andrew Wheeler said in the press release announcing the decision.Rep. John Barrasso (R-WY), chairman of the Senate Environment and Public Works Committee, praised the agency’s move.“Today’s announcement is the right decision,” Barrasso said. “The Nuclear Regulatory Commission – our nation’s principal nuclear regulator – has said there is no health or safety justification for EPA’s midnight rule.”“The NRC has regulated in situ uranium recovery for nearly 40 years,” Barrasso said. “The agency has never found an instance of groundwater contamination that would be addressed by this rule.”“I’m glad the Environmental Protection Agency has acknowledged this reality,” Barrasso said. “I applaud it for withdrawing this punishing and unnecessary regulation on America’s uranium producers.”The proposed rule expressed concerns from federal partners, including the Nuclear Regulatory Commission (NRC) and stakeholders, about the agency’s legal authority under the Uranium Mill Tailings Radiation Control Act of 1978.“Today’s action underscores that EPA believes existing regulatory structures are sufficient at this time to ensure the protection of human health and the environment at current uranium in-situ recovery (ISR) activities,” the press release stated. ‘Today’s withdrawal has no impact on EPA’s regulation of radiation.”The proposed rulemaking document can be seen here.Follow Penny Starr on Twitter\nEnvironmentPoliticsAndrew WheelerBarack ObamaEPANuclear Regulatory CommissionRep. John Barrasso (R-WY)uranium mining .Copyright © 2018 Breitbart"}