{"id": "Turkey: Woman Arrested for Interrupting Ataturk Event Shouting ‘Allah Has Laws’", "paragraph": "Insulting Atatürk is a crime in Turkey, for which a growing number of citizens have been arrested during the tenure of Islamist President Recep Tayyip Erdogan.Emine Şahin, 21, was arrested in the northwestern province of Edirne after passing by a ceremony commemorating the 80th anniversary as his death and shouting: “Atatürk is not divine, Allah has laws. Atatürk brought the West’s laws.”Speaking to authorities after her arrest, Şahin said that the ceremony was “against religion” and her actions were premeditated. After spending a night in a local jail, she was sent to prison.According to a statement from the Edirne Chief Prosecutor’s Office, Şahin started to shout “Why are you waiting here, what is happening here?” as attendees held a minute’s silence in memory of Atatürk’s life.“As she was being removed from the area by police forces, she uttered the remarks ‘This is an insurgence, you do not know the laws of Allah, he [Atatürk] brought the beliefs of the West,’ for which an investigation was launched into on charges of insulting the memory of Atatürk,” the statement read.Şahin’s actions are a violation of Turkish Law 5816 (“The Law Concerning Crimes Committed Against Atatürk”), which seeks to “protect Atatürk’s memory,” which outlaws all criticism against him. Those found guilty can face sentences as long as three years in jail.Atatürk founded the Republic of Turkey in 1923 following the collapse of the Ottoman Empire in World War I. His leadership was based in his philosophy of secularism by separating Islam from politics and constructing a legal system independent of religious law.Police action against crime related to Atatürk has increased under Erdogan, a defender of the Muslim Brotherhood who has publicly condemned some of the founder’s policies as he champions a range of religious reforms intended to desecularize the country’s education system and base it in Islamic theology. Erdogan has not suffered any legal action for rejecting Atatürk’s political philosophy but has often availed himself of a similar law against “insulting the president” to silence critics.Among the most recent crimes against Atatürk, last month, Turkish authorities detained a man who uploaded a video of himself insulting and hitting a statue of Atatürk in the capital of Istanbul. In September, Turkish prosecutors also ordered the detention of a school teacher who described Atatürk on social media as the “the biggest devil of the 20th century.”Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.\nAsiaNational SecurityKemal AtaturkReccip ErdoganTurkey .Copyright © 2018 Breitbart"}