{"id": "Julia Louis-Dreyfus Get Out the Vote Ad Warns Trump’s America Heading Toward Nazism", "paragraph": "“Donald Trump, you are the president of all citizens of this country, you should not inflame the hatred of some at the violent expense of others,” Julia Louis-Dreyfus begins. “We’ve seen Jews subjected to persecution, prejudice, and mass murder for thousands of years. We were all horrified by the horrific slaughter of 11 Jewish congregants at the Tree of Life Synagogue in Pittsburgh.”For years Donald Trump has been spreading fear, encouraging racism and inciting violence. On Nov.6 the hatred ends. VOTE!!!#MultiplyYourVote pic.twitter.com/P3tiVE72mN— Julia Louis-Dreyfus (@OfficialJLD) November 4, 2018The video then features two Holocaust survivors, both of whom talk about the risk of escalating prejudice in society.“Last two years, since Trump is in charge, it’s getting by day, worse and worse and worse,” says Marta Lightner, one of the Holocaust survivors.“I think that this administration opened a Pandora’s Box,” adds Tova Rotlevy-Cohen, another Holocaust survivor.The ad goes on to show footage from the Unite the Right rally in Charlottesville last year, where neo-Nazi marchers chanted: “Jews will not replace us!”“In memory of the 11 people who lost their lives at their place of worship we call on the President to unequivocally denounced fascism, neo-Nazism, and white nationalism,” Louis-Dreyfus adds. “On November 6th, vote for unity, vote for decency, vote.”Last month, the Veep star was featured in a similar ad for the ‘Multiply Your Vote’ campaign, urging people to take to the streets and campaign for the Democrats to make their voice heard on issues such as environment, women’s rights, immigration, and the protection of the “free press.”.@OfficialJLD: “When I’m off of TV, I’m not a politician, I’m not an expert, I’m a citizen. And I know that the midterm election on Nov. 6 is beyond important. It is vital.”Help Julia create a Blue Wave here 👉 https://t.co/rFLBugfWr5 pic.twitter.com/LG0dk2Dy5C— Multiply Your Vote (@MultiplyVote) September 18, 2018Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.\nEntertainmentMidterm Electionanti-semitismDonald TrumpJulia Louis-DreyfusMidtermsSmug celebsveep .Copyright © 2018 Breitbart"}