{"id": "Refugee from Iraq Accused of Making Two Bombs in Las Vegas for Attack", "paragraph": "Ahmad Suhad Ahmad, a 30-year-old Iraqi refugee living in Tuscon, Arizona was busted by the FBI after the agency spent nearly two years operating an undercover sting where they say Ahmad built bombs and taught undercover agents how to do the same.According to the FBI, the Iraqi refugee built two bombs in a Las Vegas condo. Both of those bombs, investigators say, were meant for a terrorist attack in Mexico that Ahmad was planning.Between March and April 2017, Ahmad allegedly taught an undercover FBI agent how to make and detonate a bomb, devices that Ahmad said “were easy to make,” according to court filings. The Iraqi refugee allegedly taught undercover agents how the detonate a bomb using a cell phone, which court records say Ahmad said he learned while in Iraq during the Iraq war.According to the Daily Mail, Ahmad arrived in the U.S. as a refugee more than a decade ago.As Breitbart News has reported, between 2012 and 2016, 72,794 foreign nationals have come to the U.S. on the Visa Lottery program from countries that the Immigration and Customs Enforcement (ICE) agency has designated as terrorist-sponsors.Data: 30 Percent of All Foreign Nationals with ‘Diversity Visa’ Came from Terror-Sponsored Nations https://t.co/3zdKRyjivd— John Binder 👽 (@JxhnBinder) November 3, 2017The Diversity Visa Lottery program gives out 50,000 visas every year to foreign nationals from a multitude of countries, including those with known terrorism problems – such as Afghanistan, Algeria, Egypt, Iraq, Lebanon, Libya, Nigeria, Saudi Arabia, Somalia, Syria, Trinidad and Tobago, Venezuela, Yemen, and Uzbekistan.In 2016 alone, more than 15,600 foreign nationals entered the U.S. from terrorist-sponsored countries. Those countries include Iran, Iraq, Saudi Arabia, Afghanistan, Somalia, Syria, and Algeria.Ahmad is the second refugee from Iraq in the last four months to be arrested on terrorism charges and the third Iraqi refugee to be charged with trying to kill others.In August, a 45-year-old refugee from Iraq Omar Ameen was arrested for allegedly murdering a man in Iraq on behalf of the Islamic State. That same month, 31-year-old Iraqi refugee Karrar Noaman Al Khammasi was arrested after allegedly attempting to murder Colorado police officer Cem Duzel.John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder. \nCrimeImmigrationNational SecurityIraqIslamic terrorismnational securityRefugeeterrorismTerrorist attack .Copyright © 2018 Breitbart"}