{"id": "‘This Is a War’: Republican Katie Arrington on Contentious South Carolina Race", "paragraph": "Arrington, who faces off against Joe Cunningham (D) in November, said the Democrats are “Nancy Pelosi desperate” and even started a rumor that she faked breast cancer as election day approaches in South Carolina.After being involved in a deadly car crash in June, Arrington returned with a thank you message to all who supported her through recovery. In the advertisement, because it was set to be released in October, which is Breast Cancer Awareness Month, Arrington mentioned she was a breast cancer survivor.“Because I never mentioned it publicly before, my opponent, his team, his campaign minions actually went out and started a rumor campaign to all of the news outlets–the AP, the local media–that I had never mentioned it before,” Arrington said. “So I actually got a reporter to come up to me in the middle of a parking lot and basically accuse me of lying, and my response was ‘Let’s step in the restroom. I’ll show you my scars.'”Arrington stated that she and her team have both asked her opponent, Joe Cunningham (D), to denounce the rumor.She also pointed out the dangers in “Soros and Nancy Pelosi funding these campaigns across the country.”“This is a war. I hate that it has come to this, but this is a war. Do we want a country where socialism is the word of the day?”“If we had that, that socialized medicine as they want to see it, I wouldn’t be on the phone with you. The night of the accident at 45 seconds in, I flatlined out. With socialized medicine, they wouldn’t have worked to revive me,” said Arrington. “All I wanted was a chance to live, and that’s what the Democrats want to take from us.”Arrington also outlined how she believes our healthcare system could be better controlled.“Well, first and foremost, we need to have the capability to buy insurance from across state lines. That’s ridiculous. We need to have the free market to be able to do that. Secondly, we need transparency in billing. People need to know what they’re paying for.”Arrington, who says she is “100 percent repeal and replace” on Obamacare, also mentioned small businesses and the impact health care is having on them.“When Obamacare came out, we penalized the small business owners at their best asset they had; their number one asset was their employees,” said Arrington. “We need to incentivize small businesses and be able to support them buying good quality health care for their best asset, their employees.”Arrington also spoke about the future of the Supreme Court.“We all know that Ruth Bader Ginsburg is, you know, her days are numbered,” Arrington said. “We could potentially have another Supreme Court justice in the next two years, and they’re going to work to ensure that they do not get conservatives on the bench.”Arrington also discussed the media’s bias in covering the contentious race.“I had nine African American Democrats come out and endorse me, and the local media here won’t pick it up.”After Arrington suffered the tragic car wreck, Democrat Joe Cunningham said he would suspend his campaign. He did not, according to Arrington.“It absolutely floors me how every tragic event in this campaign, [Cunningham] has tried to stand up and use it for free media for him,” said Arrington. “I didn’t see a card or flowers or him stopping by the house to see how I am.”Arrington described Cunningham as “not doing anything for our nation, having nothing to offer other than negativity, division, higher taxes, and less jobs.”Listen to Katie Arrington on Breitbart News Saturday on SiriusXM 125:\nPoliticshealth careJoe CunninghamKatie ArringtonNancy PelosiObamacareSouth Carolina First Congressional District .Copyright © 2018 Breitbart"}