{"id": "Arizona Teen Arrested for Smuggling Migrant in Trunk, Say Feds", "paragraph": "Tucson Sector agents assigned to the Interstate 19 immigration checkpoint observed a Nissan Sentra approaching the primary inspection station on the morning of October 30. Following an initial immigration, the agents referred the driver, a U.S. citizen from Glendale, Arizona, to the secondary inspection station, according to information obtained by Breitbart Texas from Tucson Sector Border Patrol officials.The agents opened the trunk of the Nissan Sentra and discovered a man who had been locked inside.Border Patrol officials reported the driver as a 19-year-old U.S. citizen from Glendale, Arizona. They identified the man in the trunk as a 36-year-old Mexican national who was illegally present in the U.S.Officials charged the driver with human smuggling and seized the Nissan Sentra. The Mexican national is being processed for immigration violations, officials stated.During Fiscal Year 2018, agents in the Tucson Sector arrested a total of 52,172 migrants who illegally crossed the border between ports of entry. This is second only to the Rio Grande Valley Sector who apprehended 162,262 migrants.Of the more than 52,000 migrants arrested in the Tucson Sector in FY2018, 5,023 were identified as Unaccompanied Alien Children and 4,408 were identified as Family Unit Aliens. The Rio Grande Valley Sector led the nine southwest Border Patrol sectors in both of these categories as well.The Tucson Sector witnessed a 143 percent increase in the arrest of family units and a 37 percent increase in the number of unaccompanied minors, according to the U.S. Customs and Border Protection FY2018 Southwest Border Migration Report.Bob Price serves as associate editor and senior political news contributor for Breitbart Border/Cartel Chronicles. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.\nBorder / Cartel ChroniclesCrime .Copyright © 2018 Breitbart"}