{"id": "CNN’s Marc Lamont Hill Condemns Louis Farrakhan After Photo Together Surfaces", "paragraph": "The Wrap reported Friday that the CNN commentator was in a photo with Louis Farrakhan on a website selling a box-set of music.Hill told The Wrap that he didn’t “want to be used to promote anybody’s materials,” and that he would “ask for it to be taken down as I don’t think it’s consistent with my values and my professional standards.”He also said that the photo of him and Farrakhan together was taken in fall of 2016 at an event to promote the music and that he now denounces Farrakhan’s views, seemingly comparing the racist, anti-Semitic NOI leader to Fox News in the process.“I worked on Fox News for years, having conversations with people I disagree with, people who said and did things I thought were racist, sexist and xenophobic, but I had conversations with them because I thought it was important,” Hill said.Hill’s past association with Farrakhan has come after the hateful minister made headlines for proclaiming that he’s not an “anti-semite,” but is instead, “anti-termite.”I'm not an anti-Semite. I’m anti-Termite. pic.twitter.com/L5dPQcnVg4— MINISTER FARRAKHAN (@LouisFarrakhan) October 16, 2018This clip went viral and prompted some to ask why Farrakhan is still allowed on many social media platforms.However, Farrakhan’s history of hate goes back much further than one clip. Louis Farrakhan has a long history of making hateful statements against Jews, white people, and gays and lesbians.Farrakhan has praised Adolf Hitler in a speech in 1984. “The Jews don’t like Farrakhan, so they call me Hitler. Well, that’s a good name. Hitler was a very great man,” he said.Farrakhan has also said that white people “deserve to die.”Hill took to Twitter Saturday to explain his position on Farrakhan, saying that he disagrees with his statements about LGBT people and Jews, but that he “will not allow that to be an excuse for allowing dishonest media or poorly intentioned observers to create unnecessary division.”“I will not be told who to speak to, sit with, or engage,” he said.Although I disagree with the Minister on those important issues, I will not allow that to be an excuse for allowing dishonest media or poorly intentioned observers to create unnecessary division. I will not be told who to speak to, sit with, or engage.— Marc Lamont Hill (@marclamonthill) October 20, 2018He also said, “Black people are the only group who are demanded to throw people away, rather than critically engage and challenge them. Regardless of what headlines say, that is not my position.”Black people are the only group who are demanded to throw people away, rather than critically engage and challenge them. Regardless of what headlines say, that is not my position.— Marc Lamont Hill (@marclamonthill) October 20, 2018\nMediaPoliticsAdolf Hitleranti-SemiticCNNLouis FarrakhanMarc Lamont HillNation of IslamTwitter .Copyright © 2018 Breitbart"}