{"id": "Watch: ‘SNL’ Cracks Pedophilia Joke About ‘Disgraced’ Alec Baldwin After Arrest", "paragraph": "Brought to you by…#SNL pic.twitter.com/vhGYxPzjtq— Saturday Night Live – SNL (@nbcsnl) November 4, 2018SNL cast member Kate McKinnon opened the show with an off-beat impression of radio host and Fox News host Laura Ingraham, mocking the news channel’s reporting on the migrant caravan marching toward the U.S.-Mexico border. Toward the skit’s end, McKinnon jabbed Baldwin, absent from his usual appearance where he impersonates the president, joking, “When we come back, an update from disgraced former actor Alec Baldwin — seen here molesting a young Boy Scout,” as a photo of Adam Sandler’s Canteen Boy and Baldwin’s Scoutmaster characters flashed across the screen.Baldwin was arrested on Friday afternoon after he allegedly punching a man in Manhattan’s East Village over a parking spot, according to the NYPD. Hours later, donning a grey button down short and black paints, the 30 Rock star was charged with a misdemeanor of harassment and assault at the 6th Precinct. He is scheduled to later appear before a New York City judge on the charges.In a statement released the actor’s charity — the Hilaria and Alec Baldwin Foundation — the actor addressed the incident via social media, tweeting: “Normally, I would not comment on something as egregiously misstated as today’s story. However, the assertion that I punched anyone over a parking spot is false. I wanted to go on the record stating as much. I realize that it has become a sport to tag people [was] many negative.”1- Normally, I would not comment on something as egregiously misstated as today’s story.However, the assertion that I punched anyone over a parking spot is false.I wanted to go on the record stating as much.I realize that it has become a sport to tag people w as many negative— HABFoundation (@ABFalecbaldwin) November 2, 2018Baldwin continued: “[N]egative charges and defaming allegations as possible for the purposes of clickbait entertainment. Fortunately, no matter how reverberating the echos, it doesn’t make the statements true.”2- negative charges and defaming allegations as possible for the purposes of clickbait entertainment.Fortunately, no matter how reverberating the echos, it doesn’t make the statements true.— HABFoundation (@ABFalecbaldwin) November 2, 2018Baldwin, a longtime progressive activist who is no stranger to making outlandish remarks about President Trump and his “Make America Great” agenda, urged voters last month to peacefully “overthrow” the government by using in the midterm election.“The way we implement change in America is through elections. We change governments here at home in an orderly and formal way,” Baldwin said in his keynote speech at the New Hampshire Democratic Party’s annual fall fundraising gala. “In that orderly and formal way and lawful way, we need to overthrow the government of the United States under Donald Trump.”Baldwin, whose recently launched ABC talk show has devolved into a rating disaster, has also expressed interest in mounting his own presidential bid in 2020. In June, the actor boasted during an appearance on The Howard Stern Show that he would be successful if he ran against President Trump for the White House. “If I ran, I would win,” Baldwin told the veteran shock jock. “I would absolutely win.”“The only reason I say that is because I’d love to run for that kind of position to have things just be very common sense,” he added. “There’s so many things this country needs to do that are so obvious.”\nEntertainment2018 midterm elections2020 Presidential RaceAlec BaldwinCrimeDemocratic PartyDonald TrumpHoward SternSaturday Night LiveSmug celebsSNL .Copyright © 2018 Breitbart"}