{"id": "United States, Canada Only Nations in Developed World with Unrestricted Birthright Citizenship", "paragraph": "The children of illegal aliens are commonly known as “anchor babies,” as they anchor their illegal alien and noncitizen parents in the U.S. There are at least 4.5 million anchor babies in the country, a population that exceeds the total number of annual American births.Subsequently, when given birthright citizenship, anchor babies are also rewarded with the privilege of bringing their foreign relatives to the U.S. through the process known as “chain migration.” Every two new immigrants to the U.S. bring an estimated seven foreign relatives with them.Data compiled by NumbersUSA notes that the U.S. and Canada are the only two developed nations — as defined by the International Monetary Fund — which give birthright citizenship to the children of illegal aliens.Meanwhile, developed nations like Australia, New Zealand, and Ireland have all repealed their birthright citizenship laws within the last 15 years. Even some of the most immigration-maximalist countries in the Western world like Germany, the United Kingdom, and France do not offer birthright citizenship to the children of illegal aliens.On Tuesday, President Trump announced that he is readying an executive order to end birthright citizenship in the U.S. The unilateral move would carry the U.S. into the future on the issue, putting the nation more in line with similar Western countries.The Supreme Court, however, has never explicitly ruled that the children of illegal aliens must be granted automatic citizenship and many legal scholars dispute the idea.Many leading conservative scholars argue the Citizenship Clause of the Fourteenth Amendment does not provide mandatory birthright citizenship to the U.S.-born children of illegal aliens or noncitizens, as these children are not subject to U.S. jurisdiction as that language was understood when the Fourteenth Amendment was ratified.Every year, the U.S. admits more than 1.5 foreign nationals, with the vast majority deriving from family-based chain migration. As Breitbart News recently reported, there are more anchor baby births in the Los Angeles, California metro area than the total of U.S. births in 14 states and the District of Colombia. Every year, American taxpayers are billed about $2.4 billion to pay for the births of illegal aliensJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.\nImmigrationPoliticsanchor babybirthright citizenshipcanadaChain MigrationFourteenth Amendmentimmigration .Copyright © 2018 Breitbart"}