{"id": "Mexican Cartel-Connected Fentanyl Ring Busted in Maryland, Say Feds", "paragraph": "A federal grand jury indicted Nevone McCrimmon, 47, of Edgewood, Maryland; William Elijah, 51, and Terrance Mobley, 50, both of Baltimore; on the federal charge of conspiracy to distribute and possess with intent to distribute 400 grams or more of fentanyl. The indictments were returned on October 24, and unsealed on October 30, 2018. If convicted, the defendants each face a mandatory minimum sentence of 10 years in federal prison and a maximum of life imprisonment.According to the indictment and other court documents, the defendants are allegedly high-ranking members of a Baltimore-based drug trafficking organization that imports and distributes heroin, fentanyl, and others into the metropolitan area. The defendants allegedly obtained drugs from a Miami-based organization with ties to the Sinaloa and Tijuana Cartels.Beginning in fall 2017, the defendants regularly met with a courier from Miami to deliver large sums of cash. In exchange, the drug trafficking organization would arrange for kilogram-quantities of narcotics to be delivered to the defendants. According to court documents, the narcotics would be delivered by the cartel to a contact in Ventura County, California, and then shipped to the Maryland-based defendants.Law enforcement reportedly seized 20 kilograms of fentanyl and more than $500,000 USD.The indictment was announced by United States Attorney for the District of Maryland Robert K. Hur; along with representatives of the Drug Enforcement Administration, Baltimore Police, Baltimore City Sheriff, Baltimore County Police Department, U.S. Immigration and Customs Enforcement’s (ICE), and Homeland Security Investigations (HSI).“Fentanyl is one of the most lethal threats facing Maryland right now. As little as two milligrams of fentanyl can be a lethal dose, and the 20 kilograms of fentanyl seized in this case to date is enough to kill 10 million people—more than one and a half times the population of Maryland,” said Maryland U.S. Attorney Robert K. Hur.The DOJ declared the Sinaloa Cartel as one of its top-five transnational targets. The cartels use drug trafficking and other criminal activities to obtain power, influence, and money while protecting activities through a pattern of violence and corruption. To combat this threat, the DOJ formed the Transnational Organized Crime Task Force to coordinate and optimize efforts to dismantle its priority targets.Robert Arce is a retired Phoenix Police detective with extensive experience working Mexican organized crime and street gangs. Arce has worked in the Balkans, Iraq, Haiti, and recently completed a three-year assignment in Monterrey, Mexico, working out of the Consulate for the United States Department of State, International Narcotics and Law Enforcement Program, where he was the Regional Program Manager for Northeast Mexico (Coahuila, Tamaulipas, Nuevo Leon, Durango, San Luis Potosi, Zacatecas.) You can follow him on Twitter. He can be reached at robertrarce@gmail.com\nBorder / Cartel Chronicles .Copyright © 2018 Breitbart"}