{"id": "Pelosi, Schumer: Trump Condemnation of Mail Bombs ‘Hollow,’ Needs to ‘Reverse’ Older Statements", "paragraph": "“Once again, we salute the heroism of America’s first responders as they work to counter the outrageous mail bomb attacks. We listened with great interest to the President’s remarks this afternoon. We all take an oath to support and defend the constitution and protect the American people, and that is our first responsibility,” the Democrat Party leaders wrote before turning their attention to the president. “However, President Trump’s words ring hollow until he reverses his statements that condone acts of violence. Time and time again, the President has condoned physical violence and divided Americans with his words and his actions: expressing support for the Congressman who body-slammed a reporter, the neo-Nazis who killed a young woman in Charlottesville, his supporters at rallies who get violent with protestors, dictators around the world who murder their own citizens, and referring to the free press as the enemy of the people.”In joint statement, Senate and House Minority Leaders Schumer and Pelosi say President Trump's comments today on the wave of pipe bomb packages “ring hollow until he reverses his statements that condone acts of violence.” https://t.co/hK4Eecmjdo pic.twitter.com/DjbunZS0AR— NBC News (@NBCNews) October 24, 2018As reported by Breitbart News, the U.S. Secret Service intercepted crude pipe bombs sent to the residences of former President Barack Obama and ex-Secretary of State Hillary Clinton Tuesday evening and Wednesday. Additionally, CNN’s Manhattan headquarters was evacuated following the discovery of an explosive device addressed to former CIA Director and MSNBC contributor John Brennan. A similar explosive was found at the Westchester Country home of progressive billionaire George Soros on Monday, in what law enforcement officials now believe may have been sent from the same person.Before a White House event this afternoon, President Donald Trump condemned the attacks and called on Americans to come together. “Acts or threats of political violence have no place in the United States,” the president said. “This egregious conduct is abhorrent.”“That’s a very bipartisan statement,” he added.President Trump said the events left him and fellow Americans “extremely angry, upset, unhappy” and vowed to hold the perpetrator accountable.In an earlier statement, White House Press Secretary Sarah Huckabee Sanders described the attacks as “despicable” and called for the “cowards” behind the packages to be brought to justice.Statement on suspicious packages: pic.twitter.com/pYSbDvCvuk— Sarah Sanders (@PressSec) October 24, 2018\nCrimePoliticsChuck SchumerDonald TrumpNancy Pelosi .Copyright © 2018 Breitbart"}