{"id": "Watch–Pat Buchanan: Birthright Citizenship Allowing Illegal Aliens to Increase U.S. Population", "paragraph": "Last week, President Trump announced that he is readying an executive order to end birthright citizenship in the U.S. The unilateral move would carry the U.S. into the future on the issue, putting the nation more in line with similar Western countries.During a segment on The McLaughlin Group, Buchanan said the birthright citizenship policy allows illegal aliens to increase the U.S. population which is set to reach an unprecedented 404 million by 2060 if legal immigration levels are not reduced.“What they’re saying is, look people come into this country, birthright tourism, fly in, have their baby here, and go back home and they say ‘I’ve created an American citizen,'” Buchanan said of birthright citizenship.“You’ve got all these benefits and things that American citizens rightly have and we voted and they can come in and increase the population illegally by 250,000 a year,” Buchanan said.The latest data from the U.S. Census Bureau marks a nearly 108-year record high of immigration to the country. In 2017, the foreign-born population boomed to 13.7 percent, encompassing 44.5 million immigrants. The last great wave of immigration to the U.S. was followed by a near immigration moratorium.Recent research by NumbersUSA reveals that should current legal immigration levels continue — where the U.S. admits more than 1.5 million foreign nationals every year — the country’s population will double what it was in 1970.The NumbersUSA research notes that the quality of life in America, with an additional 75 million residents living in the U.S. will be greatly reduced. Such a drastic population increase is likely to increase highway traffic, increase housing prices, increase the density of communities, and destroy large regions of farmland that will need to be inhabited to house the booming population.The Supreme Court, however, has never explicitly ruled that the children of illegal aliens must be granted automatic citizenship and many legal scholars dispute the idea. The total anchor baby population exceeds the annual roughly 4 million American babies born every year.Many leading conservative scholars argue the Citizenship Clause of the Fourteenth Amendment does not provide mandatory birthright citizenship to the U.S.-born children of illegal aliens or noncitizens, as these children are not subject to U.S. jurisdiction as that language was understood when the Fourteenth Amendment was ratified.John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.\nImmigrationPoliticsVideoanchor babiesbirthright citizenshipimmigrationPat BuchananPopulation .Copyright © 2018 Breitbart"}