{"id": "Ann Coulter: Crazed Zealot Jeff Sessions Attempts to Enforce Law!", "paragraph": "The Times’ sources were “current and former career department lawyers.” In other words, Trump-hating Democratic zealots weeks away from their book contracts. One attorney who left the Department of Justice during its descent into madness under Sessions was Stephen J. Buckingham. (Why not “Astor” or “Carnegie”?) As at any federal agency, 99 percent of “career” attorneys at DOJ are left-wing. Social activists move effortlessly from the ACLU, the Democratic Socialists of America and the Lesbian and Gay Immigration Rights Task Force to government jobs. Thus, one entry on Buckingham’s resume is that he “created a program to amend the immigration status of unaccompanied Sudanese refugee minors.” During Democratic administrations, these selfless career employees sell guns to Mexican drug cartels and run around the country making sure local police forces can’t do their jobs. During Republican administrations, they spend their time quietly, relentlessly sabotaging the administration they allegedly serve. In addition to being a nonstop source of critical remarks about the Trump administration, “career” DOJ employees also lead mob assaults on Cabinet members, as Allison Hrabar did to Homeland Security Secretary Kirstjen Nielsen in June. Along with a dozen of her friends from the Democratic Socialists of America, DOJ paralegal Hrabar surrounded Nielsen’s table at a Washington, D.C., restaurant, shouting: “Kirstjen Nielsen, you’re a villain!” “If kids don’t eat in peace, you don’t eat in peace!” “The f—ing gall!” “Shame on you!” “Shame! Shame! Shame!” “Fascist pig!” — which Nielsen eventually realized was not the evening’s special.(And it still didn’t occur to Gen. John Kelly’s special friend Nielsen why voters wanted a wall.) It took months of complaints about the DOJ not firing Hrabar — and her own arrogant claim that she couldn’t be fired — for her to finally lose her job. In Buckingham’s case, he told the Times that his conscience was shocked when Sessions asked him a legal question. (God forbid the attorney general question one of the lawyers working at DOJ!) The Times reports: “In one instance, Mr. Sessions directly questioned a career lawyer, Stephen Buckingham, who was asked to find ways to file a lawsuit to crack down on sanctuary laws protecting undocumented immigrants. Mr. Buckingham, who had worked at the Justice Department for about a decade, wrote in a brief” — and presumably his forthcoming memoirs — “that he could find no legal grounds for such a case.” Anyone else remember Arizona being denounced for two years during the Obama administration for trying to enforce immigration laws that the federal government wouldn’t? Hey, idiots! The feds have total control over immigration. Didn’t Khizr Khan give Buckingham a copy of his Constitution? I have been not practicing law longer than “Buckingham” was at the Justice Department, but I found possible legal grounds to go after sanctuary cities in approximately eight seconds on Google. Title 18 of the U.S. Code is the federal criminal code. Section 3 states: “Accessory after the fact. Whoever, knowing that an offense against the United States has been committed, receives, relieves, comforts or assists the offender in order to hinder or prevent his apprehension, trial or punishment, is an accessory after the fact.” It’s hard to miss Section 3. Section 1 was repealed in 1984, and Section 2 consists of only 52 words. But Buckingham must have exhausted himself reading Section 2 and didn’t have the energy to shove ahead to Section 3. Even if a couple sentences is your maximum reading limit, the crime of “accessory after the fact” has gotten a lot of airtime since Trump became president. It is one of the literally millions of laws Trump has probably broken, demanding his impeachment. Before Trump was even inaugurated, Democratic Rep. Steve Cohen of Tennessee was claiming on MSNBC’s Chris Matthews’ show that Trump could be an “accessory after the fact” to the (nonexistent) Russian collusion. Earlier this year, Frank Figliuzzi, the former assistant director for counterintelligence at the FBI, elaborated on this theory on MSNBC’s “The Last Word With Lawrence O’Donnell,” explaining that the president may have helped Vladimir Putin avoid punishment for his felonious act of taking out Facebook ads (or something). By contrast with the (nonexistent) felony of (nonexistent) Russian collusion, the whole point of a “sanctuary city” is to shelter known criminals from arrest and deportation. Sanctuary cities like Philadelphia expressly prohibit officials from giving Immigration and Customs Enforcement advance notice before releasing illegal alien inmates to the public. In California, even if ICE shows up asking for a specific criminal alien, state and local government officials are instructed to refuse to comply, except in cases of certain violent felonies. Prosecutors in “sanctuary” jurisdictions throughout the country are dropping criminal charges against immigrants — or allowing them to plea to minor offenses — for the sole purpose of preventing their deportation. In practice, this means less punishment for noncitizens than U.S. citizens. Talk about the “new Jim Crow.” Oakland Mayor Libby Schaaf not only refused to cooperate with federal law enforcement, she actually warned illegal aliens of an impending ICE raid. These government officials are threatening the lives and safety of their own constituents by actively assisting known criminals escape apprehension by federal law enforcement. As Democrat Sheila Kuehl, chair of the Los Angeles Board of Supervisors, put it, Californians should “lie, cheat and steal” to ensure that no immigrant be deported. It’s hard to think of a more fundamental betrayal of the public trust. Yes, you’re right, New York Times. Poor career attorneys are being asked to do horrible things under Jeff Sessions. Such as enforce the law. \nPoliticsACLUAllison HrabarDemocratic Socialists of AmericaDonald TrumpJeff SessionsKirstjen NielsenThe New York Times .Copyright © 2018 Breitbart"}