{"id": "U.S. Trade Deficit with China Eliminated Jobs for Americans in All 50 States", "paragraph": "Researchers with the Economic Policy Institute (EPI) found that between 2001 and 2017, the U.S.-China trade deficit has been responsible for the loss of 3.4 million American jobs. The vast majority of jobs lost from free trade with China has been in the U.S. manufacturing sector, making up 74.4 percent of all jobs lost and amounting to 2.5 million U.S. manufacturing jobs lost. This total of jobs lost also includes the 1.3 million American jobs lost since 2008.The EPI researchers note that the U.S.-China trade deficit has eliminated American jobs in all 50 states and in every single congressional district across the country.(Economic Policy Institute)States that saw the largest amount of job loss from free trade with China include California, where more than 560,000 U.S. jobs have been lost, Texas, where 314,000 U.S. jobs were eliminated, and New York which saw 183,500 U.S. jobs lost in the state.States like Oregon, New Hampshire, Minnesota, North Carolina, Vermont, Wisconsin, Massachusetts, and Rhode Island were among the 10 “hardest-hit states, when looking at job loss as a share of total state employment,” the EPI researchers note.Billionaire venture capitalist and PayPal co-founder Peter Thiel has criticized free trade and globalization as “totally at odds” with reality.“We export a $100 billion a year to China, import $475 billion, and then the other side of that is the $375 billion gets sent from China to invest in the U.S., so you have this really weird dynamic where the money is sort of flowing uphill from a fast-growing China into a slower growing U.S. and an even slower growing Japan and Eastern Europe,” Thiel has said, as Breitbart News reported. “That fact tells you that whatever the free trade theory says, what is actually happening is totally at odds with that.”Thiel said free trade is “not working remotely the way” it has been “advertised” to the American public.Since the North American Free Trade Agreement (NAFTA) took effect in the 1990s, at least one million net U.S. jobs have been lost because of the free trade deal. Between 2000 and 2014, there have been about five million manufacturing jobs lost across the country as trade deficits continue soaring.One former steel town in West Virginia lost 94 percent of its steel jobs because of NAFTA, with nearly 10,000 workers in the town being displaced from the steel industry.John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.\nEconomyPoliticsAmerican jobsChinaeconomyFree TradeJobsoffshoringTariffstradetrade deficit .Copyright © 2018 Breitbart"}