{"id": "NBA Teams Wear Gun Control Shirts Following Thousand Oaks Shooting", "paragraph": "The shirts listed the names of the 12 victims who were shot and killed at Borderline Bar & Grill and the front of the shirts was emblazoned with “Enough,” the gun control mantra from Michael Bloomberg’s Everytown for Gun Safety.Enough is #ENOUGH.We stand together and remember those lost in the tragic shooting in Thousand Oaks. pic.twitter.com/ghkmRXXByl— LA Clippers (@LAClippers) November 10, 2018Breitbart News reported that the Los Angeles Kings placed an “Enough” decal on their helmets for a game that took place the day after the Thousand Oaks shooting. They also carried signs that bore the word, “Enough.”Neither the Lakers, Clippers, nor Kings pointed to a specific gun control they want to see passed. Perhaps that is because California already had nearly every gun control imaginable.The state has universal background checks, firearm registration laws, red flag laws, a requirement that would-be gun buyers first get a certificate of safety from the state, a 10-day waiting period for gun purchases, an “assault weapons” ban, a one handgun-a-month purchase limit, a “good cause” qualification for concealed carry permit issuance, a ban on campus carry, a ban on carrying guns in places that serve alcohol for consumption, and controls for ammunition purchases.The Borderline Bar & Grill gunman used a legally-purchased handgun.AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.\n2nd AmendmentSportsBorderline Bar & Grillgun controlLos Angeles ClippersLos Angeles KingsLos Angeles LakersNBAThousand Oaks .Copyright © 2018 Breitbart"}