{"id": "Steve Kerr: ‘I Support Colin Kaepernick 100 Percent’", "paragraph": "In an interview with NBC Sports Bay Area, Kerr not only said he supports Kaepernick. He also said the former 49er “deserves” a chance to play in the league again.“I support Colin Kaepernick 100 percent, and I think he deserves a chance to play,” Kerr told Monte Pool of NBC Sports Bay Area. “And I was happy see Eric Reid was picked up recently — Kap’s teammate who also knelt last year. So I support their right to play.”Kerr’s comments about Kaepernick came after he said he sometimes feels “patronized” by “nationalistic military displays,” at sporting events:‘It wouldn’t bother me. I’m not for it, nor against it,’ Kerr explained. ‘I believe patriotism is about doing something good for others, for other Americans. That’s the best way to be patriotic, to get out and volunteer and help others. That’s what drives me crazy about the uproar over the NFL players who have knelt in a fight for social justice. So many of them have given so much to their communities — given not just money but time. I read a lot about Malcolm Jenkins in Philadelphia and what he’s done in his community. And Chris Long. And people like Colin Kaepernick who have given a million dollars to charity.‘I’m so proud of so many athletes who are out there in their communities, knowing the power they have and the financial resources they have to make a change. That’s patriotism to me. The anthem is just kind of a symbol for that.’Kerr also laid out his reasoning for why he believes NFL executives haven’t signed Kaepernick:‘I also see this entire media frenzy that surrounds it,’ Kerr said. ‘And if I’m a GM of a team, I know the minute I sign Colin Kaepernick, it’s like signing Tim Tebow. Or it’s like signing, you know, one of the Ball brothers. And that’s probably a bad analogy. But it’s going to come with a storm. So even if your heart’s in the right place, and you go, ‘You know what? This is all BS,’ I want my team to be able to function. And I want to bring in a backup quarterback. But I don’t want a news conference every single day. I could see a GM going, ‘Man, I don’t really want to deal with that.’ That’s modern media. That’s modern American life.’The NBA has a rule mandating that their players stand for the American and Canadian national anthems. As a result, the anthem protest movement did not become an issue in the “association.” However, the league has dozens of outspoken players — and coaches — who regularly speak out and engage in various forms of activism.Follow Dylan Gwinn on Twitter @themightygwinn\nSportsColin KaepernickGolden State WarriorsNational Anthem ProtestsNBANFLSteve Kerr .Copyright © 2018 Breitbart"}