{"id": "Watch: Black Faith Leaders Ask, ‘Who Do You Want to Represent You?’", "paragraph": "“Who do you want to represent you?” the Coalition of African-American Pastors (CAAP) asks Americans.CAAP president Rev. William Owens is urging Christians to vote with their core values:If Christians vote according to their core values, the choice becomes very clear. #ElectionDay https://t.co/0l3EumAqbX— Rev. William Owens (@caapusa) November 4, 2018In August, the black faith leader replied to critics of his decision to meet with President Donald Trump at the White House.Owens condemned what he saw as the shortsighted and divisive partisanship that does nothing to help those who truly are in need in black communities.“For years, I have criticized people in power for doing little to restore our inner cities, enact prison reform, or meet the needs of black Americans,” stated Owens. “Now, when a president hears our concerns and demonstrates a willingness to address them, I’m expected to reject any help because of political partisanship?”“This isn’t just wrongheaded thinking; it’s actively harmful to our people,” Owens said. “The contempt and hatred some Christians have for President Trump is unchristian.”The black leader said progressives are condemning his support for Trump because the president is a Republican.He continued:The people who have hurled insults like ‘Uncle Tom’ at me and the other faith leaders at the White House should look to their own motives. Those of us who met with the president were putting principle first. The name-callers, however, are so subjugated by one political party that they will turn on their own people rather than accept a difference of perspective. It’s clear to me who ‘s really being oppressed here … and it’s not the group in the White House.“That is intolerance masquerading as righteousness, and I will have no part of it,” Owens said. “Since when is it shameful to sit down with the most powerful person in the world to discuss ways to help the least of my brothers?” \nFaithMidterm ElectionPoliticsblack faith leadersCoalition of African-American PastorsDonald Trumpincitement to violenceliberal intoleranceRev. William Owens .Copyright © 2018 Breitbart"}