{"id": "***Live Updates*** Trump Holds Nevada Rally for Dean Heller", "paragraph": "Welcome to the Third Saturday in October.Trump, who campaigned in Montana and Arizona earlier in the week, will headline a massive Texas rally on Monday before heading to Wisconsin later in the week.Stay tuned to Breitbart News for live updates. All times eastern.—3:15 PM: Trump says Democrats want to “destroy our American heritage” and “erase” the country’s legacy. He asks voters to vote against the Democrats’ politics of anger, hatred, and division.3:08 PM: Trump says Democrats will destroy Social Security and Medicare and reminds the audience that he was the only one on the stage during the GOP presidential debate who talked about preserving–and not slashing–Social Security.3:05 PM: “I think women like me more than they did two years ago,” Trump says. He says women want safety, security, and bigger 401Ks. He says the country was headed south before Trump deregulated and enacted tax cuts. He again says the “only reason to vote Democrat is if you are tired of winning.” He says every day he is living by his motto: “Promises made, promises kept.”3:03 PM: Trump talking about the record-low unemployment rates for Hispanic-Americans and African-Americans3:01 PM: Trump now says “sleepy” and “one-percent Joe” Biden is in Las Vegas today. He says Biden never got more than 1% when he ran for president and the Obama took him off of the “trash heap.” Trump asks if the audience likes “sleepy” or “one-percent” and someone yells “Creepy Joe!” Trump says Biden was thrilled when only 193 people showed up to his Las Vegas event.2:59 PM: Trump says Democrats believe illegal border crosser should be set free while Republicans believe they should be sent home. Trump says Democrats believe American taxpayers should provide “free welfare for illegals” while Republicans believe welfare should only be for “truly needy Americans.”“If you’re thinking about voting Democrat, don’t go out and vote,” Trump says after estimating that there are no Democrats in the audience besides the media.2:56 PM: Trump says innocent families and lives are casualties of the Democrats’ crusade for illegal immigration. He now talks about ICE going into “nests” and blast Democrats for supporting sanctuary cities. Trump now says human trafficking is a massive business because of “the computers” and the Internet and they would become emboldened if Democrats take back Congress.“A Republican victory will send a message that America will enforce its borders and defend our citizens,” Trump says.2:54 PM: Trump says the “single greatest ally the Democrats have is the fake news media.” He says the left’s “crazy ideas” would never see the light of day if not for the fake news media. Trump says he would be at 100% (approval rating) if the fake news media were on his side.2:51 PM: Trump says Democrats want to give illegal immigrants free health care and the right to vote. Trump says “we’ll go down fighting” to prevent illegal immigrants from voting in elections.2:49 PM:  Trump says he thinks the “blue wave is being rapidly shattered.” He says “all the Democrats want is power” and are banking on the blue wave. “Not looking like a blue wave,” he says.2:48 PM: Trump says Democrats don’t care what illegal immigration will do to hospitals, schools. He asks the crowd if they have seen the migrant caravan crossing the bridge connecting Mexico and Guatemala.“Is that an incredible situation? It’s sad,” Trump says, adding that it’s sad on both sides.2:47 PM: Trump says the “Democrats like the caravan.” He now thanks the leaders of Mexico for slowing down the caravan. “Thank you Mexico. We appreciate it,” Trump says after saying Mexico now respects America’s leaders.TRUMP in Nevada:•”Democrats want caravans!…A lot of people say: I wonder who started that caravan!”•”And I want to thank Mexico! Mexico has been so incredible! And the leaders of Mexico!\"•”You know why? Because now Mexico respects the leadership of the United States!\" pic.twitter.com/WODuXqbm3F— José Díaz-Briseño (@diazbriseno) October 20, 20182:46 PM: Trump says Democrats will decimate Medicare Advantage, and that will be unfair to Hispanic seniors. He asks if there are Hispanics in the crowd… says it could be better, estimating 5% of the audience are Latinos. He says there were more at last night’s rally in Arizona.2:45 PM: Trump: “Democrats want America to become… Venezuela.”2:43 PM: Trump says people in California “are demanding they be released from sanctuary city” and talks about rioting.2:41 PM: Trump now railing against the “sadistic” VA that could “steal,” “cheat” before his reforms. He says now you can just say, “get your ass out of here. You’re fired.” Says it took 44 years to actually reform the VA system.“I’m good at getting things passed,” Trump says. “That’s what I do.”He says a vote for “Wacky Jacky” is a vote for “cryin’ Chuck Schumer,” Nancy Pelosi, and “the legendary Maxine Waters,” whom Trump says is a “low-I.Q. individual.”2:40 PM: Trump says Wacky Jacky’s money is coming from places like Los Angeles while Heller’s is coming from Nevada. He also says Heller sticks up for miners.“I think everything you touch turns to gold,”Nevada Senate candidate Dean Heller praises President Trump at a campaign rally in Elko, Nevada #tictocnews pic.twitter.com/qVk1j134rQ— TicToc by Bloomberg (@tictoc) October 20, 20182:35 PM: “We need him badly,” Trump says before introducing Heller, who says Elko has been designated the best small town in America and is not the swamp. He says everything Trump touches turns to gold as he welcomes Trump to “gold country.” Heller says Rosen only debated him last night because Trump shamed her into it. Heller says Rosen will only campaign in Las Vegas.“Once we really got to know each other, there’s no better partner I’ve had in Washington,”President Trump praises Dean Heller in the election for Nevada’s Senate seat #tictocnews pic.twitter.com/HvOEyOD9oZ— TicToc by Bloomberg (@tictoc) October 20, 20182:33 PM: After saying Democrats are running on crime and open borders, Trump asks, “How do you win an election? How do you do it?”He says the left’s motto is “resist” while his is “Make America Great Again!”2:32 PM: Trump says Heller has been a great partner once they got to know each other. He says nobody was “tougher,” “smarter” than Heller during the debate over tax cuts.2:31 PM: Trump now endorsing Danny Tarkanian, son of the great late Tark the Shark. Trump says hopefully he gets over his line because he needs him.2:28 PM: Trump now introducing Adam Laxalt. Trump says he’s a great person and tells the crowd that he has know this “great patriot” for a long time.(Many Reagan Conservatives believe Laxalt’s late father would have been a better vice president than George H.W. Bush.)2:27 PM: Trump says Democrats have become too extreme and dangerous to be trusted with the power that they want. He asks the crowd to raise their hands and promise to cast their votes for Adam Laxalt and Dean Heller.“You can go out and do it today,” Trump says, urging people to vote for Heller against “Wacky Jacky.” He says Nevada is a “very unusual state” when talking about the state’s early voting policies.2:25 PM: “What sinks rapidly? A rock. They’ll go down like a rock,” Trump says of 401Ks if Democrats take back Congress.He then says Democrats will take away the second amendment and says that’s not going to be popular in Nevada.2:23 PM: Trump wonders how he can lose reelection with the country’s low unemployment rates and then talks about swearing-in Brett Kavanaugh as the crowd roars. He agains says what the Democrats did to Kavanaugh and his family was a “national disgrace.” He says Democrats have become a radical “unhinged mob” that is determined to get power “by any means necessary.” He thanks Heller for helping him with Justices Gorsuch and Kavanaugh. “Dean Heller was there right from the beginning,” Trump says.He says “Democrats produce mobs. Republicans produce jobs.” Trump says that’s the new “hot hashtag.”#JobsNotMobs!— Donald J. Trump (@realDonaldTrump) October 19, 20182:22 PM: Crowd chants “Donald Trump” as Trump reminds the crowd to early vote.Trump says America was called “laggards” a few years ago but is now the “hottest economy in the world.”2:20 PM: Trump steps off of Air Force One with Heller. A great scene in a wonderful part of the country.1:50 PM: Trump scheduled to speak soon.Heading to Nevada to help a man who has become a good friend, Senator Dean Heller. He is all about #MAGA and I need his Help and Talent in Washington. Also, Adam Laxalt will be a GREAT GOVERNOR, and has my complete and total Endorsement. Winners Both!— Donald J. Trump (@realDonaldTrump) October 20, 2018GOP gubernatorial candidate Adam Laxalt tells the crowd that Nevada’s “unique western spirit is on the line” in his race. “Make no mistake about it, if I don’t win this race, we will be turning into — what?”“CALIFORNIA,” the crowd shouts.— Gretel Kauffman (@gretelkauffman) October 20, 2018 A “Jobs not mobs!” chant breaks out as GOP gubernatorial candidate Adam Laxalt warms up the crowd. Laxalt responds: “I think we’ll leave that to the president” pic.twitter.com/NGgKqoXFbj— Seung Min Kim (@seungminkim) October 20, 2018This might explain WHY cell service is spotty 📵 #TrumpRally pic.twitter.com/RKH30HJQWi— Morgan Saxton (@KUTVMorgan) October 20, 2018.@realDonaldTrump has departed Phoenix. This big plane is next. It’s technically not called Air Force One right now because the president is not on it. pic.twitter.com/6UcHJe8d3Q— Austin Westfall (@WestfallAustin) October 20, 2018In line for Trump Rally in Elko Nevada!  At 6:15am there is a least 500 people already in line with streams of people pouring in;  it is 28 F here. Exciting Time – MAGA!!! pic.twitter.com/zNqBTYRdzm— Mike Creek (@Auminor) October 20, 2018Long lines and big crowds at the #Trump rally in Elko. pic.twitter.com/O8ONxzd1BG— John T. Linn (@johntlinn) October 20, 2018\nMidterm ElectionPoliticsAdam LaxaltDean HellerDonald Trumpmidterm electionsNevada .Copyright © 2018 Breitbart"}