{"id": "Coulter: ‘Yuppies and Welfare Recipients — That’s the Modern Democratic Party’", "paragraph": "Friday on Fox News Channel’s “Tucker Carlson Tonight,” conservative columnist Ann Coulter, author of “Resistance Is Futile!: How the Trump-Hating Left Lost Its Collective Mind,” discussed how the Democratic Party has evolved over the past few decades and has abandoned working class and a lot of America in order to cater to those wanting to advance identity politics and what she called the “yuppie lifestyle.”Partial transcript as follows:CARLSON: Does the Democratic Party ever become the Democratic Party of 2012 or 1998 or kind of a party concerned with, you know, economics and something other than identity politics?COULTER: It doesn’t look like it. There was an interesting article, you won’t hear these words come out of my mouth very often, in The New York Times this week by Thomas Edsall breaking down all of these polls on how the Democratic Party has changed. And it is, I’ve just noticed looking at or remembered it looking at Nancy Pelosi, white liberal women have just gone off the charts on — on left-wing craziness, and it has nothing to do with economics. The Democratic Party, as some of us kind of noticed, during the Clinton era, that was when it was — began during the Clinton era, just abandoned the working-class, abandoned the flyover people. It is pedal to the metal on identity politics, and — and, you know, the yuppie lifestyle.CARLSON: Right. The moms in Marin —COULTER: It’s basically the party of–CARLSON: –in Georgetown.COULTER: –yuppies and welfare recipients–CARLSON: You know, that’s exactly — that’s exactly–COULTER: –that’s the motto of Democratic Party.CARLSON: –that’s never been put more crisply or truly. Ann Coulter–COULTER: Thank you.CARLSON: –“Resistance is Futile” is her excellent book. Thank you.Follow Jeff Poor on Twitter @jeff_poor\nVideoAnn CoulterDemocratic PartyFox News ChannelTucker CarlsonTucker Carlson Tonight .Copyright © 2018 Breitbart"}