{"id": "Jim Carrey: Bomb Suspect ‘Encouraged and Emboldened’ By Donald Trump", "paragraph": "On Tuesday, the Secret Service intercepted multiple packages addressed to political figures including former Presidents Bill Clinton and Barack Obama, left-wing billionaire George Soros, and CNN’s studios in New York, among others.“Today they tried to murder two Presidents as well as public servants and journalists,” Jim Carrey wrote in a Twitter post, accompanied by his traditional political artwork, which appears to show President Trump holding a bomb in his mouth.\n“Make no mistake, these terrorists were encouraged and emboldened by the hate speech of Donald Trump,” Carrey continued. “If you can’t see the clear menace of this man’s influence by now then you are a part of it.”Today they tried to murder two Presidents as well as public servants and journalists. Make no mistake, these terrorists were encouraged and emboldened by the hate speech of Donald Trump. If you can’t see the clear menace of this man’s influence by now then you are a part of it. pic.twitter.com/L7kYcpcPKO— Jim Carrey (@JimCarrey) October 24, 2018Authorities are yet to apprehend a suspect behind the threats, which Trump denounced on Wednesday as an unacceptable form of political violence.“In these times, we have to unify, we have to come together, and send one very clear strong unmistakable message that acts and threats of political violence of any kind have no place in the United States of America,” Trump said. “This egregious conduct is abhorrent to everything we hold dear as Americans.”However, Carrey was not the only prominent figure to blame the incidents on Trump, with many members of left-wing commentators also spreading similar theories about his responsibility without a shred of evidence. On Wednesday evening, CNN President Jeff Zucker issued a statement Wednesday blasting the White House for its “total and complete lack of understanding” of the “seriousness of their continued attacks on the media.”Carrey, meanwhile, is known for his extreme opposition to conservatism and the Trump presidency. Earlier this month, he explained that his often controversial artwork represents his personal way of dealing with the “pain” inflicted by the Trump administration, who he claims is “pushing the country towards suffering beyond all imagination.”\nEntertainmentPoliticsTechBomb ThreatsdemocratsDonald TrumpHollywoodJim Carreypolitical violenceTerrorirsm .Copyright © 2018 Breitbart"}