{"id": "Eva Longoria: ‘I’m Attacked Daily By This Administration’", "paragraph": "“As a Latino I’m personally invested because I’m attacked daily by this administration,” Longoria said in an interview for Variety‘s Inclusion Summit. “I mean from day one, for them to attack my community and all brown people to be murderers and rapists is a problem.”Eva Longoria: \"I'm 9th generation American. I'm more American than Donald Trump\" https://t.co/htPyTXd15X #InclusionSummit pic.twitter.com/wTtYx1yj8d— Variety (@Variety) November 15, 2018Longoria said this, despite the fact that Hispanic unemployment is currently at an all-time record low.The actress went on to celebrate the results of the midterm elections, describing them as a “pink wave” because of the record number of women who were elected to the House of Representatives, a trend she hopes will be repeated in 2020.“We didn’t see a blue wave as much as a pink wave,” she explained. “The amount of women that were elected to office was fantastic. And also because we’re under attack, women are under attack.”“What we have to do for 2020 is to make sure that our government looks like the country it represents, and you know, when you have eleven men talking about women’s reproductive rights — that cannot happen,” she continued.The former Desperate Housewives star is one of Hollywood’s most fervent anti-Trump activists, having previously compared the president to Adolf Hitler. Earlier this week, she used an acceptance speech at an ACLU event to attack the current president while plugging her plug her charitable foundation for Latina women.Last month, the 43-year-old actress featured in a video alongside actress Julianne Moore thanking Supreme Court nominee Judge Brett Kavanaugh’s sexual assault accuser Christine Blasey Ford for coming forward with her allegations, despite providing no corroborating evidence of the incident.Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.\nEntertainmentPoliticsSocial JusticeDonald Trumpeva longoriahispanicimmigrationlatinosSmug celebs .Copyright © 2018 Breitbart"}