{"id": "Mexican Border State Cops Find Human Ashes in Kidnapping Probe", "paragraph": "The discovery took place last week as Nuevo Leon state police officers were searching for a kidnapping victim along a series of rural roads in Vallecillo, when they discovered a pile of ashes surrounded by bullet casings. Forensic investigators were called to the area to document the remains and determine if there is a way to identify the victims.The location of the field is not far from another rural area where, only weeks ago, a team of 15 cartel gunmen wearing military-style uniforms ambushed a squad of Nuevo Leon Rural Police officers. That attack took place along the rural road known as “La Rana.” The region is commonly used by a faction of Los Zetas known as Northeastern Cartel (CDN).The CDN was behind numerous kidnappings and executions surrounding Nuevo Laredo, Tamaulipas. The most recent killing field was found less than 40 miles south of Nuevo Laredo. The CDN uses cloned Mexican Marine uniforms to kidnap and murder rivals. In one field along the border between Nuevo Leon and Tamaulipas, authorities identified six victims taken by fake Marines.The CDN was able to use local news outlets to dupe the United Nations Human Rights Commission into believing that the Mexican military was responsible for the kidnappings.Editor’s Note: Breitbart Texas traveled to the Mexican States of Tamaulipas, Coahuila, and Nuevo León to recruit citizen journalists willing to risk their lives and expose the cartels silencing their communities.  The writers would face certain death at the hands of the various cartels that operate in those areas including the Gulf Cartel and Los Zetas if a pseudonym were not used. Breitbart Texas’ Cartel Chronicles are published in both English and in their original Spanish. This article was written by Tony Aranda from Nuevo Leon and “J.M. Martinez” from Coahuila. \nBorder / Cartel Chronicles .Copyright © 2018 Breitbart"}