{"id": "Florida: Donald Trump, Bernie Sanders to Hold Dueling Rallies for DeSantis, Gillum", "paragraph": "Sanders is slated to boost Gillum at the University of Central Florida at 11:00 a.m. EST, according to the gubernatorial\ncandidate’s website. The progressive lawmaker and 2020 Democrat hopeful campaigned for Gillum at UFC over the summer, telling a packed arena that the Tallahassee mayor “understands that the future of this state and the future of this country is with the young people.”Hours later, President Trump will hold a rally for DeSantis in Fort Myers, Florida, where Republican Florida senatorial candidate Gov. Rick Scott (R-FL) will also make an appearance. Scott is locked in a tight race against incumbent Sen. Bill Nelson (D-FL).The Halloween rally will come just days after President Trump unloaded on Gillum amid mounting questions about an FBI investigation targeting Tallahassee officials, referring to the Democrat as a “thief” and an ineffective mayor.“In Florida there is a choice between a Harvard/Yale educated man named @RonDeSantisFL who has been a great Congressman and will be a great Governor – and a Dem who is a thief and who is Mayor of poorly run Tallahassee, said to be one of the most corrupt cities in the Country!,” the president tweeted.In Florida there is a choice between a Harvard/Yale educated man named @RonDeSantisFL who has been a great Congressman and will be a great Governor – and a Dem who is a thief and who is Mayor of poorly run Tallahassee, said to be one of the most corrupt cities in the Country!— Donald J. Trump (@realDonaldTrump) October 29, 2018Gillum, who has recently found himself in hot water after accepting a ticket to the musical Hamilton from an undercover FBI agent, fired back at the president on Twitter, saying one should “never wrestle with a pig.”“I heard @realDonaldTrump ran home to @FoxNews to lie about me,” Gillum tweeted. “But as my grandmother told me — never wrestle with a pig. You both get dirty, but the pig likes it. So ignore him and vote, Florida!”I heard @realDonaldTrump ran home to @FoxNews to lie about me. But as my grandmother told me — never wrestle with a pig. You both get dirty, but the pig likes it. So ignore him and vote, Florida!— Andrew Gillum (@AndrewGillum) October 30, 2018The University of North Florida poll released earlier today shows Gillum holding a six-point lead over his Republican rival, 49 percent to 43 percent among likely voters surveyed.\nPolitics2018 midterm electionsAndrew GillumBernie SandersDonald TrumpFlorida .Copyright © 2018 Breitbart"}