{"id": "Ann Coulter: 14th Amendment Now Used to Drive Down Black Americans’ Wages", "paragraph": "During an interview with talk radio host Lars Larson, Coulter said the 14th Amendment was intended for black Americans but is now being used by the big business lobby to drive down black Americans’ wages by incentivizing illegal immigration.Coulter said:The 14th Amendment … was about freed slaves. They were part of the Civil Rights, rather Civil War amendments as they’re called. It was all about freed slaves and now we’re living in this upside down sicko ‘Alice and Wonderland’ like a Frankenstein world where the 14th Amendment which was passed to recognize the rights of free blacks in America is being used to drive down African-American wages in America, to ruin their neighborhoods, to fill up their hospitals so the Koch brothers can have cheap labor. Every president should have issued this executive order. [Emphasis added]Last week, President Trump announced that he is readying an executive order to end birthright citizenship in the U.S. The unilateral move would carry the U.S. into the future on the issue, putting the nation more in line with similar Western countries. There are at least 4.5 million anchor babies in the U.S. with nearly 300,000 anchor babies born every year.Coulter says Trump “should have done [the executive order] his second day in office.”Birthright citizenship rewards the children of illegal aliens, commonly known as “anchor babies,” with automatic U.S. citizenship, thus anchoring their illegal alien and noncitizen parents in the U.S. Eventually, those anchor babies are allowed to bring an unlimited number of foreign relatives to the country through the process known as “chain migration,” making birthright citizenship not only a driver of more illegal immigration, but also legal immigration.As Breitbart News has chronicled, black Americans are one of the most adversely impacted demographic groups by mass immigration to the U.S. Researcher Steven Camarota has noted in multiple studies that black Americans are vastly more likely to be forced to compete against low-wage immigrants for jobs than white Americans.The Supreme Court has never explicitly ruled that the children of illegal aliens must be granted automatic citizenship and many legal scholars dispute the idea.Many leading conservative scholars argue the Citizenship Clause of the 14th Amendment does not provide mandatory birthright citizenship to the U.S.-born children of illegal aliens or noncitizens, as these children are not subject to U.S. jurisdiction as that language was understood when the 14th Amendment was ratified.John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.\nImmigrationPoliticsVideo14th AmendmentAfrican-American communityanchor babiesAnn Coulterbirthright citizenshipblack Americansimmigrationwages .Copyright © 2018 Breitbart"}