{"id": "Video: ‘Rocky Fire’ Erupts Near Southern California’s 118 Freeway", "paragraph": "The blaze, dubbed the “Rocky Fire” by state authorities, started in Santa Susana Pass, near Rocky Peak and the 118 freeway.WATCH: Brush fire erupts along Route 118 highway near Simi Valley, California. https://t.co/2qn7C6I1pY pic.twitter.com/JG6bSxXQqw— NBC News (@NBCNews) November 12, 2018New fire… 118 at Rocky Peak. Traffic at standstill on 118 east of Topanga Cyn exit. @FOXLA pic.twitter.com/dfkeuIKF73— Hal Eisner (@HalEisner) November 12, 2018Officials have ordered an immediate evacuation of the Box Canyon and Lake Manor areas, according to Fox 10. Ventura County Sheriff’s Department told reporters the freeway has been closed between Topanga Canyon and Yosemite while firefighters move quickly to extinguish the fire. The cause of the fire is currently unknown.The latest blaze comes after some of the thousands of people who fled Southern California’s huge wildfire were being allowed to return home, and traffic was flowing Monday on the major highway through the area after a closure of several days.Repopulation of some neighborhoods and the reopening of U.S. 101 west of Los Angeles began late Sunday, marking positive developments even though forecasts called for continuing critical fire weather conditions.Mandatory evacuations remained in effect in many other areas. however, including the entire cities of Malibu and Calabasas.The Woolsey fire grew to more than 143 square miles with 20 percent containment as of Monday morning.The estimate of destroyed structures was raised to 370, with only 15 percent of damage assessments completed.The death toll stood at two.Spot fires continued to occur late Sunday afternoon near the Malibu campus of Pepperdine University, where 3,500 students were sheltering in place. The university said it was closing the Malibu campus and its Calabasas campus to the north until Nov. 26, but classes would be remotely administered online and through email.At least 31 people were confirmed dead in the wildfire that turned the Northern California town of Paradise and outlying areas into hell on earth, equaling the deadliest blaze in state history, and the search for bodies continued Monday.Nearly 230 people were unaccounted for by the sheriff’s reckoning, four days after the fire swept over the town of 27,000 and practically wiped it off the map with flames so fierce that they melted metal off cars. The dead were so badly burned that authorities brought in a mobile DNA lab and consulted forensic anthropologists for help in identifying them.Increasingly exhausted and dispirited, friends and relatives of the missing checked hospitals, police, shelters, and the coroner’s office in hopes of learning what became of their loved ones.The Associated Press contributed to this report. \nEnvironmentLocalCaliforniafirefightershighwayLos AngelesMalibuParadiseWildfires .Copyright © 2018 Breitbart"}