{"id": "Tucker Carlson: Khashoggi Death an ‘International Incident Hyped and Manufactured for Domestic Political Goals’", "paragraph": "Friday on Fox News Channel’s “Tucker Carlson Tonight,” host Tucker Carlson questioned the motivations of those promoting the importance of the death of Jamal Khashoggi in current U.S. politics.Carlson noted the Saudi government had a track record of committing atrocities and noted that despite that, the Khashoggi incident has captivated the news cycle, which Carlson suggested was part of an aim to achieve “domestic political goals.”Transcript as follows:So there you have it. Khashoggi is, in fact, dead, as we have already been told, and the Saudis did it. They admit it now. What should we make of this?Well, the usual head-nodders on TV seem stunned by the news. They can hardly believe that a bloodthirsty medieval theocracy would do something like this.“Really? The Saudis? The same people who cut off the hands of thieves and behead adulterers in public parks? The same regime that is currently prosecuting one of the world’s cruelest wars in one of the world’s poorest countries, Yemen? You’re telling me these people murdered a political opponent? Doesn’t sound like the Saudis we know.”Come on. Of course, they did it. We knew they did it. Their only concern was getting caught. Now they have been caught, and they probably regret the whole thing. All of that makes sense. None of it is surprising.What is confusing is the wave of false posturing on display from our own mindless ruling class. Khashoggi’s death, they’re telling us, is now somehow the most important story in the world, far more important than the many political murders China commits each year far more than Saudi Arabia, or the countless children the Saudis have bombed and starved to death in Yemen.More than that, they’re telling us it’s a moral litmus test, the latest in a long series of moral litmus tests that are delivered to us by Fiat (ph) on cable news. Support this, don’t support that. Otherwise, you’re a bad person. That’s the message of almost every show. Share my beliefs or you are damned.Now, in this case, it’s a little confusing because keep in mind these are the same people, the ones commanding you to hate the Saudis, who just months ago were uncritically repeating Saudi talking points right from the embassy.Remember when we bombed Syria last spring and bombed it before, the year before, well the Saudis pushed that. Everyone knew that. It might have been nice to hear that on television. We could have used some media skepticism at the time, but no.Only this show pretty much brought that up. The rest of the press loved it. They love all wars, the more distant and the more pointless, the better. OK. But spare us the theatrics now. This is a stunt. It’s an international incident hyped and manufactured for domestic political goals. Here are the goals. Watch this.(BEGIN VIDEO CLIP)JASON JOHNSON: The President is completely in the pocket of any other dictators in the world because he admires their ability to basically kill or tacitly allow the death of anybody who criticizes them.FAREED ZAKARIA: When Donald Trump calls the press the enemy of the people–And it’s not implausible that the Saudis heard that and thought no one is going to care. After all these — these — these people are the enemies of the people.STEVE SCHMID: And you see it with his complicity and it is complicity in the murder of a Washington Post columnist by a Middle-Eastern thug.(END VIDEO CLIP)CARLSON: Spare me.Meanwhile today, Congressman Joaquin Castro floated the bizarre theory that Khashoggi’s murder was ordered by Jared Kushner. Even CNN seemed confused by this. Watch.(BEGIN VIDEO CLIP)REP. JOAQUIN CASTRO (D): Let me get to the point that I think is most disturbing right now. The reporting that Jared Kushner may have, with U.S. intelligence, delivered a hit list, an enemies list, to the Crown Prince, to MBS, in Saudi Arabia, and that the Prince then may have acted on that, and one of the people that he took action against was Mr. Khashoggi.POPPY HARLOW: Just to be clear Congressman, we don’t have–CASTRO: And if that’s the case–HARLOW: –I just want to be clear for our viewers we do not have that reporting.(END VIDEO CLIP)CARLSON: Yes. That’s a sitting Member of Congress who just said that. These are not serious people. They know nothing. They will say anything. They are buffoons. Spare us the lectures, please.Follow Jeff Poor on Twitter @jeff_poor\nIsrael / Middle EastVideoFox News ChannelJamal KhashoggiTucker CarlsonTucker Carlson Tonight .Copyright © 2018 Breitbart"}