{"id": "Southern California Edison Reported Circuit Malfunction Minutes Before Woolsey Fire Began", "paragraph": "California Public Utilities Commission received a report via SCE on Thursday, which it says was filed “out of an abundance of caution,” detailing the incident. The utility giant told the agency a circuit located at its Chatsworth substation “relayed” at 2:22 p.m. The system failure occurred transpired on East Street and Alfa Road, close to where the Woosley Fire started, according to the Los Angeles Times. “At this point, we have no indication from fire agency personnel that SCE utility facilities may have been involved in the start of the fire,” according to the report. “The investigation into the matter is ongoing.”The company has yet to gain access to the substation where the blaze started.“During anticipated Red Flag conditions, when circuits in the affected area detect a disturbance (relay) and become de-energized, the circuit will not automatically be re-energized,” the company said “This means an outage remains until it is safe to manually re-energize the circuit. This is not a Public Safety Power Shutoff; it is simply a safety feature to help mitigate wildfire risk.”\nIn a statement released Monday, a CPUC spokesperson said they are continuing to monitor the fire and will “incorporate Edison’s incident report into its investigation” as to how the Woosley fire began.At least 9,000 Southern California Edison remain without power due to the damage its systems sustained amid the raging fire. The company notified customers in La Verne and Malibu that they would lose power Monday as firefighters struggle to contain the fire, says the utility company’s press representative Lois Pitter Bruce.“Crews are trying to gain access, but due to treacherous conditions, our restoration is not going to be as expedited as we’d like it to be,” Bruce told reporters.The Woolsey fire grew to more than 143 square miles with 20 percent containment as of Monday morning, according to the Associated Press. Authorities confirmed over the weekend the blaze’s death toll stands at two people. In Northern California, at 30 people are dead as the Camp Wire continues to rage. Relatives are conducting a manhunt to locate nearly 230 missing people. The fire, which destroyed most of the 27,000-strong city of Paradise, is now the most deadly fire in the state’s modern history.\nEnvironmentLocalCaliforniafirefirefightersMalibuParadiseSouthern California EdisonWildfires .Copyright © 2018 Breitbart"}