{"id": "Andrew Gillum Suggests Racism Behind Scrutiny of Corruption Probe", "paragraph": "The FBI agent reportedly posed as a developer investigating corruption tied to the city of Tallahassee, where Gillum serves as mayor.Gillum responded to the release of the documents by claiming, “The goal is obviously to use my candidacy as a way to reinforce, frankly, stereotypes about black men.”Gillum made the remarks during a Facebook Live video.He further stated:These messages only confirm what we have said all along.  We did go to see Hamilton.  I did get my ticket for Hamilton from my brother.  At the time, we believed that they were reserved by friends of Adam’s, Mike Miller, and when I got there after work got my ticket, we went in and saw, it assumed my brother paid for it and so far as I know that was the deal.The issue at hand revolves around how Gillum obtained the Broadway tickets and questions about payments for trips to New York City and Costa Rica.Gillum has maintained that he believed his brother, and not the undercover agent, “Mike Miller,” paid for the ticket.However, records released as part of a subpoena by the lawyer for former Florida lobbyist Adam Corey, a longtime Gillum ally, seem to paint a different picture.  Gillum attended the Broadway show along with his brother, Corey, and “Miller,” the undercover FBI agent.“Just checking in with you. Mike Miller and the crew have tickets for us for Hamilton tonight at 8 p.m.,” Corey texted Gillum on Aug. 10, 2016, according to the records.Gillum replied: “Awesome news about Hamilton.”“This is what local corruption looks like,” DeSantis said earlier today on Fox News.“He claims he’s not under investigation,” DeSantis added. “Why the heck would law enforcement send an undercover agent to line his pockets if he wasn’t under investigation? Of course he is.”The issue took center stage during Sunday’s debate between Gillum and DeSantis during which DeSantis directly asked: “Did you pay for the ‘Hamilton’ ticket, or did the undercover FBI agent pay for the ‘Hamilton’ ticket?”Gillum sidestepped the question with an indirect response. “We all have friends that sometimes let us down,” Gillum, referring to Corey.“I’m a hard-working person,” Gillum said. “I know that may not fit your description of what you think people like me do.”Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program: Aaron Klein Investigative Radio. Follow him on Twitter @AaronKleinShow. Follow him on Facebook.\nMidterm ElectionPoliticsAndrew GillumFlorida gubernatorial raceRon DeSantis .Copyright © 2018 Breitbart"}