{"id": "Supreme Court to Decide Constitutionality of Cross-Shaped World War I Memorial", "paragraph": "The Supreme Court agreed in early November to hear the case in which the American Legion is asking the high court to reverse a 2017 appeals court ruling that the memorial violates the First Amendment’s prohibition on governments establishing religion. Overturning a lower court’s decision, the Fourth Circuit panel said the memorial, which stands on public land, is unconstitutional because it “excessively entangles the government in religion.”The case may be a gauge for the conservatism of the current Supreme Court now that Justice Brett Kavanaugh is on the bench. The lawyers for the American Legion at the First Liberty Institute and the law firm Jones Day have asked the court to overturn decades of often unclear and contradictory liberal precedents regarding religious displays on public property. Instead, they would like such cases to focus on whether the government is effectively coercing someone to participate in a religious observance that violates his or her conscience.The 40-foot-tall “Peace Cross” in Bladensburg, Maryland was erected by the American Legion in 1925 to honor the 49 men from Prince George’s County who fell in the Great War. In 1961, a Maryland state agency took possession of the land on which the memorial stands.The legality of the 93-year-old memorial was challenged by an atheist organization called the American Humanist Association, which argued that the cross sent an exclusionary message in violation of the Establishment Clause of the First Amendment.In 2015, a federal judge in Maryland ruled against the plaintiffs, holding that the Maryland Parks and Planning Commission had nonreligious reasons for maintaining the historically significant, secular war memorial.The U.S. Court of Appeals for the 4th Circuit overturned that ruling.“[T]he sectarian elements easily overwhelm the secular ones,” Barack Obama-appointed Judge Stephanie Thacker wrote in the majority opinion.Thacker also said that the American Legion’s “affiliation with Christianity” should not be ignored.“The display aggrandizes the Latin cross in a manner that says to any reasonable observer that the Commission either places Christianity above other faiths, views being American and Christian as one in the same, or both,” Thacker wrote.Maryland Gov. Larry Hogan called the court’s ruling “an affront to all veterans.”In asking the Supreme Court to hear the case, lawyers for the American Legion said if the appeals court decision is allowed to stand “it will also render unconstitutional the two principal WWI memorials in Arlington National Cemetery, which likewise are freestanding crosses residing in the Fourth Circuit.”In oral arguments, Thacker had suggested that the unconstitutionality might be cured by cutting off the arms of the “Peace Cross.”Ken Klukowski, senior legal editor for Breitbart News, is one of the attorneys representing the American Legion.The American Legion v. American Humanist Association, No. 17-1717 in the Supreme Court of the United States\nFaithPoliticsAmerican legionBrett KavanaughConstitutionEstablishment Clausefirst amendmentPeace CrossSupreme Court .Copyright © 2018 Breitbart"}