{"id": "Kanye West Distances Himself from Blexit", "paragraph": "“I introduced Candace to the person who made the logo and they didn’t want their name on it so she used mine. I never wanted any association with Blexit. I have nothing to do with it,” Kanye tweeted Tuesday. “My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!”I introduced Candace to the person who made the logo and they didn’t want their name on it so she used mine. I never wanted any association with Blexit. I have nothing to do with it.— ye (@kanyewest) October 30, 2018My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!— ye (@kanyewest) October 30, 2018Kanye West also clarified his beliefs on several political issues.“I support creating jobs and opportunities for people who need them the most, I support prison reform, I support common-sense gun laws that will make our world safer,” the Grammy-winner wrote.“I support those who risk their lives to serve and protect us and I support holding people who misuse their power accountable,” he says. “I believe in love and compassion for people seeking asylum and parents who are fighting to protect their children from violence and war.”I support creating jobs and opportunities for people who need them the most, I support prison reform, I support common-sense gun laws that will make our world safer.— ye (@kanyewest) October 30, 2018I support those who risk their lives to serve and protect us and I support holding people who misuse their power accountable.I believe in love and compassion for people seeking asylum and parents who are fighting to protect their children from violence and war.— ye (@kanyewest) October 30, 2018Breitbart News, among other news outlets, including Page Six, Daily Mail, USA Today, Fox News, and BBC, reported that Kanye West helped design the Blexit logo, which he now denies.As of this reporting, Candace Owens has yet to respond directly to West’s most recent comments. Owens did post a statement on Monday, saying the “press is trying to conflate “Kanye West” with “BLEXIT” and that West “helped me design the “X” for BLEXIT.“Today the press is trying to conflate “Kanye West ” with “BLEXIT” to get website clicks — so allow me to clarify my earlier statement,” Owens wrote.“I said on stage that my friend and fellow superhero helped me design the “X” for BLEXIT. This may shock the world, but Ye is a world renowned designed. Everyone who knows him asks him for advice on design. Ye support various people in different regards, because at the end of the day — his message about unity and love (sic),” she wrote.“He supports Colin Kaepernick. He supports Amare Enyia. He has said he loves Hillary Clinton. He has said he loves Donald Trump,” Owens wrote. “BLEXIT is a project that is mine entirely. I am blessed that Ye introduced me to a designer who despite having totally different political beliefs than me, helped me craft some beautiful letter that I used on the BLEXIT caps.”#BLEXIT is about the beautiful stories of so many black people who have awakened themselves to the possibilities of our future, as Americans.The press is trying to use Kanye’s name to create drama and further divisiveness which is WRONG. Here is statement of clarity from me: pic.twitter.com/PJSdM2PRFi— Candace Owens (@RealCandaceO) October 29, 2018Candace Owens did not return a request for comment.Follow Jerome Hudson on Twitter @jeromeehudson\nEntertainmentPoliticsTechBlexitCandace OwensKanye West .Copyright © 2018 Breitbart"}