{"id": "ABC White House Reporter Claims Alec Baldwin Said He Hoped She ‘Choked to Death’", "paragraph": "“Alec Baldwin also told me ‘I hope you choke to death’ when I was on assignment, staking out his house,” Palmeri wrote on Twitter, hours after Baldwin was arrested for allegedly punching a person in New York City.The run-in reportedly took place back in 2013 after Palmeri attempted to glean information about a lawsuit Baldwin had filed against his ex-wife, alleging that Baldwin grabbed her arm and threatened her. She later presented an audio recording of the incident to the New York City Police Department (NYPD).Alec Baldwin also told me \"I hope you choke to death\" when I was on assignment, staking out his house https://t.co/JAgMkGGwDM— Tara Palmeri (@tarapalmeri) November 2, 2018Palmieri made the allegation in response to a story by New York Times journalist Maggie Haberman, who accused Baldwin of inciting a harassment campaign against her because of a negative story she wrote about one of his fundraisers.“Baldwin was the first person I ever experienced being blocked by on Twitter, after he used his account with hundreds of thousands of followers to berate me for… writing about a fundraiser he’d hosted in a way he didn’t find satisfactory,” Haberman said.Baldwin was the first person I ever experienced being blocked by on Twitter, after he used his account with hundreds of thousands of followers to berate me for…writing about a fundraiser he’d hosted in a way he didn’t find satisfactory. https://t.co/EPwYYF8iPB— Maggie Haberman (@maggieNYT) November 2, 2018In a statement on Friday, the 60-year-old denied that he had punched the man over a parking spot, accusing the media of “egregiously” misstating the story for the “purposes of clickbait.”“Normally, I would not comment on something as egregiously misstated as today’s story,” he said. “However, the assertion that I punched anyone over a parking spot is false. I wanted to go on the record stating as much. I realize that it has become a sport to tag people (with) as many negative charges and defaming allegations as possible for the purposes of clickbait entertainment.”Baldwin has become a prominent Hollywood figure in recent years for his portrayal of President Donald Trump on Saturday Night Live, as well as his left-wing activism and opposition to the Trump presidency. Last month, Baldwin urged an audience at the New Hampshire Democratic Party’s annual fall fundraising dinner to help “overthrow” the Trump administration.“The way we implement change in America is through elections. We change governments here at home in an orderly and formal way,” the 30 Rock star declared. “In that orderly and formal way and lawful way, we need to overthrow the government of the United States under Donald Trump.”Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.\nEntertainmentMediaABC JournalistAlec BaldwinharassmentMaggie HabermanSaturday Night LiveSmug celebsTara Palmeri .Copyright © 2018 Breitbart"}