{"id": "Beto O’Rourke: Trump Calling the Press the ‘Enemy of the People’ an Incitement to Violence", "paragraph": "Tuesday on MSNBC’s “Hardball,” Democratic U.S. Senate candidate Rep. Beto O’Rourke (D-TX) said President Donald Trump calling the press “the enemy of the people” was “incitement to violence.”O’Rourke said, “This idea fronted by the president that somehow the press are the enemy of the people, reinforced by him tweeting out images of a reporter being hit by a train, body slammed in a wrestling ring, it is incitement to violence. I don’t know any other way to call it. That undermines an essential pillar of the American democracy—242 years into this audacious experiment, that is the exception, not the rule in world history, that we can freely choose those who represent us and guide the course and direction that this country will take.”He added, “If we don’t have a free press, if we cannot make informed decisions at the ballot box, if you can’t hold people like me accountable and make sure that we’re held honest to the promises that we made to the job that we’re performing and the positions of public trust, we’ll lose the very essence of our democracy. Nothing guarantees us a 243rd or 244th year unless all of us stand up for the institutions that make us so strong in the first place. So I think we need to vigorously defend the freedom of the press. We need to call out violations, not just in this country, in countries like Mexico, one of the most dangerous places to be a journalist, the killing of Khashoggi by the Saudi Arabian government, there has to be consequences. There has to be accountability. There has to be justice. This is our chance to lead on one of the most important issues to our democracy and to freedom around the world.”Follow Pam Key on Twitter @pamkeyNEN\nMidterm ElectionVideoBeto O'RourkeDonald Trump .Copyright © 2018 Breitbart"}