{"id": "Hollywood Blames Bombs on Trump: ‘MAGA Radicalized More Domestic Terrorists than ISIS’", "paragraph": "“I’d be very curious to know the origin of today’s FALSE story that a bomb was sent to the White House in the midst of all the actual bombs sent to people Trump has called enemies of the state. MAGA has radicalized more domestic terrorists than ISIS ever could. VOTE” Modern Family executive producer Danny Zuker said.I’d be very curious to know the origin of today’s FALSE story that a bomb was sent to the White House in the midst of all the actual bombs sent to people Trump has called enemies of the state. MAGA has radicalized more domestic terrorists than ISIS ever could. #VOTE— Danny Zuker (@DannyZuker) October 24, 2018Hollywood director Rob Reiner also chimed in, saying, “Donald Trump tells his cult followers protesters are paid for by Soros. Hillary Clinton should be locked up. John Brennan should lose his clearance. CNN is the enemy of the people. And blames Obama for everything. They’re lives were all threatened. You do the math. VOTE!!!”Donald Trump tells his cult followers protesters are paid for by Soros. Hillary Clinton should be locked up. John Brennan should lose his clearance. CNN is the enemy of the people. And blames Obama for everything. They’re lives were all threatened. You do the math. VOTE!!!— Rob Reiner (@robreiner) October 24, 2018The nation was rocked by news that multiple Democratic politicians and George Soros, as well as the New York City headquarters of CNN, received makeshift bombs in the mail.The events of this week come after hundreds of instances of harassment and violence directed at Trump supporters, as Breitbart News’ John Nolte has chronicled.Indeed, Maxine Waters encouraged the harassment of Trump officials over the summer, saying, “If you see anybody from that cabinet in a restaurant, in a department store, at a gasoline station, you get out and you create a crowd. You push back on them. Tell them they’re not welcome anymore, anywhere!”Hillary Clinton also recently rejected calls for civility, saying, “You cannot be civil with a political party that wants to destroy what you stand for, what you care about.”“That’s why I believe if we are fortunate enough to win back the House and/or the Senate, that’s when civility can start again. But until then, the only thing that the Republicans seem to recognize and respect is strength.”Sen. Majority Leader Mitch McConnell was also recently harassed in a restaurant. Sen. Ted Cruz was also recently ran out of a restaurant by a crowd of rabid leftists, to the delight of CNN.\nBut many in Hollywood have only spoken up for “civility” now, when Democrats and the establishment media are targeted.“A recap: Yes, the caravan is definitely full of MS-13 and Middle-Eastern terrorists. No, the bombs sent to Clinton, Obama, CNN that are physically in the possession of the Secret Service are not real. I miss facts,” actor Kumail Nanjiani tweeted.A recap:Yes, the caravan is definitely full of MS-13 and Middle-Eastern terrorists.No, the bombs sent to Clinton, Obama, CNN that are physically in the possession of the Secret Service are not real.I miss facts.— Kumail Nanjiani (@kumailn) October 24, 2018Star Trek star George Takei tweeted, “Call me crazy, but that bomb intended for John Brennan—he only appears now and then on CNN. He’s actually signed as a contributor at MSNBC. Guess this gives an indication of the bomber’s intelligence.”Call me crazy, but that bomb intended for John Brennan—he only appears now and then on CNN. He’s actually signed as a contributor at MSNBC. Guess this gives an indication of the bomber’s intelligence.— George Takei (@GeorgeTakei) October 24, 2018To be clear, no suspects have been taken into custody for the multiple bombs being sent to major political figures and CNN’s headquarters, which President Trump denounced on Wednesday. But that didn’t stop celebrities from assigning blame. Check out all the Hollywood hysteria.You and your boss are responsible for this. He constantly calls the press “the enemy of the people.” He pretended to wrestle a CNN reporter at a vanity rally. He decries “fake news” when they point out his lies. THIS IS YOUR FAULT. Coward. Sellout. Danger. All describe you. https://t.co/n4922DcFAH— Vote November 6th (@SophiaBush) October 24, 2018Whenever they say false flag, they are proclaiming their own victimhood, ie “our side’s leaders & media didn’t incite potential bombings by constantly demonizing the specific ppl targeted; they sent them to themselves to pick on us!” Personal responsibility, you sick cowards?— Andy Richter (@AndyRichter) October 24, 2018the dems sure are diabolical to send those devices to these particular ppl, possibly killing them, in an attempt to place the blame on right-wing zealots so that … uh … the mid-terms will, um … so that trump can … uh … wait, why would they do it again…? https://t.co/rj14AmbCk9— Don Cheadle (@DonCheadle) October 24, 2018Soros is part of a liberal worldwide conspiracy (of Jews). Obama’s not a legitimate President. Hillary is a crook who should be locked up.  CNN is the dishonest enemy of the people. Putin? Kim Jung Un?  MBS? Good people. Strong people. Shame on you #GOP.— Bradley Whitford (@WhitfordBradley) October 24, 2018Words matter. https://t.co/2weOGsr61h— Alyssa Milano (@Alyssa_Milano) October 24, 2018Violence from the right or from any one is not the way! But that is why Trump and the WH must stop inciting violence and dividing and must start uniting! https://t.co/BzgHpEIiY7— John Leguizamo (@JohnLeguizamo) October 24, 2018This morning bombs were sent to Obama, the Clintons, George Sauros, and CNN. Coincidence? Or a blatant pattern. While the press secretary intones through here crooked mouth how abhorrent this act is. While her boss is between Nationalist Rallies.— Ron Perlman (@perlmutations) October 24, 2018Today a bomb was mailed to the Obamas, and to the Clintons, and to CNN, a few days ago one was sent to George Sorros. If the the left is 'mob' does that make the right terrorists? https://t.co/dGeXyB7aaG— Minnie Driver (@driverminnie) October 24, 2018A journalist was killed and dismembered a couple weeks ago. Why would this change anything? https://t.co/DXBa6ZwoWM— Michael Ian Black (@michaelianblack) October 24, 2018For the past 2 years, the Democrats & the media have been demonized on a daily basis. This is the end result. On November 6th, u have a choice. You can either give a blank check & say this rhetoric is ok or you can send a loud message that there r consequences 4 normalizing hate https://t.co/FscjlLd7g6— Josh Gad (@joshgad) October 24, 2018Explosive Devises sent to Clinton, Obama and Soros- Call out this dangerous escalation on the right. @marcorubio @gop @SpeakerRyan @senatemajldr @SteveScalise https://t.co/QWPHeUslQ1— Patricia Arquette (@PattyArquette) October 24, 2018This added to CNN \"s bomb threats…Is this  NOT what our Pres has whistles  about https://t.co/GsP23XeqLe— Henry Winkler (@hwinkler4real) October 24, 2018Trump made a list. And whomever is sending these packages is explicitly following that list. https://t.co/Jyjslo2irm— Jordan Horowitz 🎃 (@jehorowitz) October 24, 20181. You couldn’t even stomach typing out the 280 characters yourself.2. You and your cohorts have advocated violence since the earliest days of your campaign.3. We are going to bring an end to your despicable regime. That begins Nov. 6. https://t.co/3Tvy4W10jH— Beau Willimon (@BeauWillimon) October 24, 2018This added to CNN \"s bomb threats…Is this  NOT what our Pres has whistles  about https://t.co/GsP23XeqLe— Henry Winkler (@hwinkler4real) October 24, 2018Violent rhetoric has consequences, particularly when spoken by political leaders.We see this the world over.Donald Trump’s attempt to demonize his political foes encourages TERRORISM.— Mikel Jollett (@Mikel_Jollett) October 24, 2018\nEntertainmentPoliticsTechBarack ObamabombCNNDonald TrumpHillary ClintonHollywoodMaxine Waters .Copyright © 2018 Breitbart"}