{"id": "REPORT: Central American Migrants Set Fire to Mexican Immigration Facility", "paragraph": "The fire was reportedly started at a facility dual-purposed as a checkpoint and makeshift detention center for Mexico’s National Migration Institute (INM) in Pijijiapan, Chiapas, when a group of migrants housed there set fire to their mattresses, Televisa Noticias reported. According to local public safety director Jaime Marroquin, authorities were housing 21 men, five women, and three children which were in the process of being deported. The migrants reportedly set fires to give cover to their escape.Firefighters responded to the scene while Mexican Federal Police officers detained the alleged runaways and moved them to a large immigration facility in Tapachula, Chiapas.The fire comes only hours after Mexican Federal Police arrested two Honduran men who allegedly shot at cops guarding the migrant caravan currently in Chiapas, Breitbart News reported. The caravan began its journey earlier this month in Honduras and publicly announced its intent to reach the U.S. border. The Mexican government offered the caravan temporary jobs, health care, and education if they agreed to stay in southern Mexico and follow the country’s legal procedures for requesting asylum. The group largely turned down the offer, however, according to the INM, 111 migrants agreed and requested Mexican identification documents.Ildefonso Ortiz is an award-winning journalist with Breitbart Texas. He co-founded the Cartel Chronicles project with Brandon Darby and Stephen K. Bannon.  You can follow him on Twitter and on Facebook. He can be contacted at Iortiz@breitbart.com. Brandon Darby is the managing director and editor-in-chief of Breitbart Texas. He co-founded the Cartel Chronicles project with Ildefonso Ortiz and Stephen K. Bannon. Follow him on Twitter and Facebook. He can be contacted at bdarby@breitbart.com.Tony Aranda and “J.M. Martinez” from the Cartel Chronicles project contributed to this report. \nBorder / Cartel ChroniclesImmigrationPre-ViralMigrant Caravan .Copyright © 2018 Breitbart"}