{"id": "Caroline Glick: Khashoggi Affair Endangers America’s Core Interest in the Middle East", "paragraph": "To understand why that is the case, it is necessary to remember what those core interests are, to consider which regimes share American interests, which regimes threaten them, and how the U.S. can best use its leverage in the region to secure and advance its interests.The top three U.S. interests in the Middle East are more or less as follows:The Islamic country in the Middle East that most threatens these key U.S. interests is Iran. Iran directly threatens the safe transport of energy products by threatening shipping, including U.S. naval vessels in the Straits of Hormuz. It also threatens the Bab el Mandab through its Houthi proxy in Yemen.Iran’s massive support for terror groups and its use of terror proxy armies in the Middle East and worldwide, along with its nuclear missile program and its ballistic missile program, threaten the U.S.’s second key interest in the Middle East.Iran threatens the U.S.’s third key interest through its alliance with Russia in Syria.Facing Iran are Saudi Arabia, Egypt, and the United Arab Emirates (UAE). The three states’ deep-seated concerns about Iran provide the U.S. with the basis for strategically critical cooperation in curbing Iranian power and aggression.That brings us to Turkey. Under its Islamist dictator Recep Erdogan, NATO member Turkey threatens key U.S. interests in significant ways. First, as Erdogan has openly stated, he seeks to restore the Ottoman Empire, which ended in 1917, and its caliphate. In other words, he wants to build a Turkish Islamic empire that will rule the Sunni Muslim world.Erdogan’s imperialist aspirations bring him into direct conflict with Saudi Arabia. With its trillions in petrodollars, for the past 45 years, the Saudi regime has underwritten the construction of mosques and other Islamic centers throughout the region, and indeed throughout the world. These mosques teach the absolutist, jihadist Wahhabist view of Islam.The Wahhabist view differs from that of the Muslim Brotherhood’s Islam not in its final goals but in the way it seeks to achieve that goal. Wahhabists support the regimes now governing Islamic states. The Muslim Brotherhood seeks to overthrow these regimes and replace them with Islamic regimes that will join together to form the world caliphate.Erdogan’s aspirations make him a friend to the Muslim Brotherhood, which he seeks to coopt and lead. His goal of recreating and leading a global caliphate also make him view Shiite Iran as a partner, rather than a competitor.For Erdogan, Iran is not a competitor because as Shiites, the Iranians do not threaten his goal of leading the Sunnis. Since he views Saudi Arabia as the chief threat to his Sunni Islamic imperialist goals, and since Iran and Saudi Arabia are bitter foes, it naturally follows that Erdogan is happy to work with Iran against Saudi Arabia.Erdogan also threatens the U.S. by developing a strategic alliance with Russia. For example, Erdogan recently decided to purchase Russia’s S-400 surface-to-air missile system, which threatens NATO’s air superiority over Russia. He also cut a deal with Russian President Vladimir Putin to secure Turkey’s foothold in the Idlib area in Syria, which renders Erdogan as partner to Russia and Iran in Syria in their Cold War against the U.S. and Israel.  Both of those steps pose huge risks to American power in the Middle East.The obvious, and easiest way for the U.S. to secure its interests is by strengthening and deepening its alliances with the Saudis, the UAE, and Egypt — along with Israel — against Iran, and taking effective action to weaken Iran economically and otherwise while isolating Erdogan and weakening his economy. That is the policy that President Donald Trump has advanced assiduously and to great effect since taking office. By empowering the Saudi-led Sunni alliance, the Americans have checked Iran and Turkey. The U.S. has also deepened the cooperative ties between Saudi Arabia and Israel, which has further diminished the prospect of a major regional war.That brings us to the murder of Khashoggi inside the Saudi consulate in Istanbul. The Khashoggi affair is a stunning example of how extraneous events, deliberately manipulated by forces without U.S. interests at heart, can obfuscate, undermine, and endanger America’s core interests.There is by now little doubt that Khashoggi was more than a Washington Post columnist. He was a member of the Muslim Brotherhood. He had close ties to al Qaeda. And he was an Erdogan ally. Khashoggi was also a former Saudi spy with a major grudge against U.S. ally Crown Prince Mohamed bin Salman (MBS).Khashoggi used his platform at the Washington Post to undermine Saudi-U.S. ties and to lobby for Erdogan’s regime and for the restoration of the Obama administration’s policy of weakening Saudi Arabia and Israel while empowering Iran, Turkey, and the Muslim Brotherhood.There is also little doubt at this point that Khashoggi was brutally murdered by Saudi agents at the Saudi consulate at Istanbul, Turkey.And there is little doubt that Erdogan has been carefully stage managing every aspect of the media campaign against the Saudis since Khashoggi disappeared. Turkish sources – that is, Erdogan – are behind all of the “leaked” stories to the Western media. For their part, the Washington Post, the New York Times, and other liberal outlets, along with former Obama administration officials, have been highlighting the story as a means to discredit and undermine the U.S.-Saudi alliance.In short, Khashoggi was an Islamic totalitarian with good relations with Turkey, al Qaeda, and the American left who was killed by other Islamic totalitarians with good relations with the Trump administration.And now, his murder is being used cynically by the U.S. media and by former Obama administration officials as a means to discredit and undermine Trump’s Middle East strategy.How do we know that coverage of Khashoggi’s murder is being cynically exploited? Because the same media outfits and former Obama administration officials are pretty much indifferent to the suffering of the Iranian people and even to the suffering of American hostages in Iran at the hands of the regime in Tehran. They are also indifferent to the suffering of the Turks under Erdogan’s jackboot. The problem is not that the media don’t report Turkish human rights abuses, including the imprisonment of more than 60,000 people that the Erdogan regime insists were involved in the unsuccessful 2016 coup. And it isn’t that the media ignore Iranian human rights abuses.The problem is that while newspapers like the Washington Post argue that the U.S. must pull its support for the Saudi regime’s war against Iran’s Houthi proxies in Yemen in response to Khashoggi’s murder, similar calls for the U.S. to sanction Turkey and kick it out of NATO, or work to overthrow the Iranian regime to free the Iranian people from repression, have not been sounded.This, then, brings us to the question of human rights, and the role the cause of human rights and freedom should play in U.S. foreign policy. In a conversation with Breitbart News, former Pentagon official and noted expert on Islam Dr. Harold Rhode explains that U.S. policymakers need to be modest in their expectations.“There is a Muslim proverb that says, ‘It is better to live under tyranny then to endure an hour of chaos,’” Rhode notes.“In keeping with this proverb, it is not surprising that almost every Muslim country is at best ruled by a dictator or an oligarchy where the people have little say in their destiny.”There is no Islamic regime in the Middle East where human rights and individual freedoms are protected. And every time U.S. policymakers have fallen into the trap of romanticizing strongmen as “reformers” or “democrats,” they have harmed American interests by confusing PR stunts for a strategic shift in values and aspirations.We saw this with the George W. Bush administration, which insisted, with no evidence, that American values of freedom and democracy are universal and that any popularly elected government is by definition democratic and liberal. We saw this with the Obama administration, which insisted, with no evidence, that the Muslim Brotherhood was “largely secular” and democratic because it was popular. We saw this with both the Bush and Obama administrations with their embrace of Erdogan as a democrat even as he transformed Turkish society and politics from a secular, imperfect democracy into an Islamist tyranny.And we saw this over the past two years with the Trump administration’s enthusiastic embrace of MBS as a Saudi reformer. True, MBS implemented significant reforms in the kingdom. He permitted women to drive and he curtailed the power of the religious policy, among other things. But like Erdogan, and others, he did not undertake these actions as a means to liberalize Saudi Arabia per se. He took these actions as a means to legitimize, stabilize and strengthen his grip on power by galvanizing the support of the young people of Saudi Arabia.Since MBS shares America’s core interests, it makes sense for the administration to embrace him as an ally. But by presenting these reforms as the harbinger of a new, liberal Saudi Arabia, the administration set itself up to be attacked later. The Khashoggi’s murder has highlighted the obvious fact that MBS, like all of his Saudi counterparts — as well as Erdogan and the Iranians —  is an autocrat who is comfortable brutally silencing critics and opponents.The question now facing the administration is whether it is willing to act on the truth about the nature of the Islamic Middle East or whether it intends to be bullied by Erdogan — the American hostage-taking dictator — and his friends from the Obama administration and the Washington Post into abandoning America’s alliance with Saudi Arabia. Choosing the latter would paralyze Trump’s capacity to preserve and protect America’s core interests in the Middle East.So far, Trump has been walking a fine line between the two policies. He has defended U.S. arms deals with Saudi Arabia and noted that the Iranians and others also abuse human rights. But he has agreed to make a major issue of the Khashoggi murder and accept that the future of the U.S.-Saudi alliance will be assessed in light of the Kingdom’s role in the crime.Trump’s position in turn, has empowered MBS’s enemies in Saudi Arabia, who are much less amenable to U.S. interests than he is, and has endangered his continued hold on power. That, in turn, raises the danger of destabilizing America’s other Middle Eastern allies, who are dependent on Saudi Arabia.Trump has rightly disowned the habit of his predecessors, who pursued the unachievable goal of transforming the authoritarian Islamic world into something akin to America. He has taken great strides towards ending the romanticization of America’s foreign policy as a crusade for values and returning it to the rational core goal of protecting American interests.It will be a tragedy of epic proportions if that position is undermined by actors who do not support his efforts.Caroline Glick is a world-renowned journalist and commentator on the Middle East and U.S. foreign policy, and the author of The Israeli Solution: A One-State Plan for Peace in the Middle East. Read more at www.CarolineGlick.com.\nIsrael / Middle EastMediaPoliticsforeign affairsIranJamal KhashoggiMohamed bin SalmanSaudi ArabiaStrategyTurkey .Copyright © 2018 Breitbart"}