{"id": "Trump Mocks Small Crowds for ‘Creepy Joe Biden’ at Competing Campaign Rally in Nevada", "paragraph": "“By the way, Joe Biden is in Las Vegas,” Trump said, during a rally in Elko, Nevada. “Sleepy Joe Biden, we call him ‘One Percent Joe.'”Trump noted that despite repeatedly running for president, Biden never got more than one percent support in the polls.When Trump asked supporters which nickname they preferred, one woman in the crowd shouted “Creepy Joe!”“She said ‘Creepy Joe,'” Trump said, pointing her out in the crowd. “No, I would never do that, I would never insult him like that.” The “Creepy Joe Biden” nickname grew among Trump supporters, based off of pictures of the former Vice President’s habitual holding and touching women and girls during political events.Trump said that Biden only had 193 people at his campaign rally in Las Vegas.“We love Elko, but in all fairness, it’s easier to draw a crowd in Las Vegas,” Trump said.Trump claimed there were 6-7,000 people who couldn’t get into his rally in Elko.He said Republicans were going to win big in the 2018 midterm elections.“The Blue Wave is rapidly being shattered,” Trump said. “Not looking like a blue wave.”On the first day of voting in Nevada, a few hundred are gathered outside Culinary Workers Union 226 for Democratic rally featuring Joe Biden, Sen. Cortez-Masto, Senate candidate Jacky Rosen, and gubernatorial candidate Steve Sisolak. pic.twitter.com/3a4p022t0q— John McCormack (@McCormackJohn) October 20, 2018We’re at the Culinary Union HQ waiting for former Vice President Joe Biden to show up for an early voting rally and to campaign for Nevada Democrats. pic.twitter.com/6Id0hclcKQ— Nina Porciuncula (@NinaReports) October 20, 2018Long lines and big crowds at the #Trump rally in Elko. pic.twitter.com/O8ONxzd1BG— John T. Linn (@johntlinn) October 20, 2018President Trump scheduled to appear at Elko rally today https://t.co/2KBzjgTVgZ pic.twitter.com/LU9qazzJEX— Trip Trundle (@TripTrundle) October 20, 2018MASSIVE CROWD at Trump Rally in in Elko, NV. Gotta give @realDonaldTrump  credit. He is a campaigning machine! #MAGA pic.twitter.com/r23FnSoEoq— The Right Pundit (@therightnewz) October 20, 2018\nPoliticsCreepy Joe BidenDonald TrumpElkoJoe BidenLas VegasNevadaOne Percent Joe .Copyright © 2018 Breitbart"}