{"id": "Poll: 61 Percent of Democrats Say Republicans Are ‘Racist,’ ‘Bigoted,’ ‘Sexist’", "paragraph": "The online poll surveyed 3,215 U.S. adults, and has a margin of error of three percentage points.Fifty-four percent of Democrats view Republicans as “ignorant,” with 49 percent of Republicans similarly viewing Democrats.Fifty percent of Republicans cast Democrats as “evil,” with 44 percent of Democrats doing the same with Republicans.Minorities of Democrats described Republicans as “fair” (four percent), “thoughtful” (three percent), and “kind” (two percent). Similar fractions of Republicans described Democrats as “fair” (four percent), and “thoughtful.”\n\nDemocrats are twice as likely (six percent) as Republicans (three percent) to be “extremely disappointed” if a close family member were to marry a Republican. Axios wrote:The suspicion runs so deep that a third of all Americans say they’d be disappointed if a close family member married someone whose partisanship didn’t match their own:The percentage saying they’d be at least somewhat bothered by this jumps to 50% among liberal Democrats; it’s 32% among conservative Republicans.For both parties, more moderate affiliates are about 20 percentage points less likely to say they’d be disappointed.Sixty-three percent of Democrats said President Donald Trump’s political slogan “Make America Great Again” is a message calling for “fewer immigrants” and “less multiculturalism.”All aforementioned descriptive terms — “racist/bigoted/sexist,” “ignorant,” “spiteful,” “evil,” “fair,” “thoughtful,” and “kind” — were provided to polling subjects via multiple-choice questions.Forty percent of those polled described themselves as Republicans (31 percent) or leaning Republican (nine percent), with 43 percent describing themselves as Democrats (31 percent) or leaning Democrat (12 percent). Fourteen percent described themselves as “independent.”Axios’s assessment of its own poll’s results makes no mention of news media outlets such as CNN or the New York Times shaping Democrats’ views of their political detractors as “racist,” “bigoted,” and “sexist.”Follow Robert Kraychik on Twitter.\nMediaPoliticsAXIOSdemocratspollRacistRepublicanssexist .Copyright © 2018 Breitbart"}