{"id": "Andrew Gillum’s Group Trained, Gave Award to Anti-Israel Dream Defenders’ Founder", "paragraph": "A Breitbart News investigation published today documented that until last year, Gillum worked at the George Soros-financed People for the American Way, where he served as Director of Youth Leadership Programs from 2005 until January 13, 2017, and oversaw a radical training outfit calling itself Young People For, or YP4.Philip Agnew, the co-founder of Dream Defenders, is a 2005 graduate of Gillum’s former YP4 group, it has emerged.Also, at a January 17, 2014 YP4 summit, Gillum’s YP4 gave Agnew the Norman Lear Award, named after the producer and activist who founded People for the American Way.Gillum has faced controversy over his refusal to disavow Dream Defenders, which has engaged in activism to promote the boycott of Israel, and espouses anti-patriotic, anti-capitalism, anti-military, and anti-police ideology and with which Gillum has already been associated.Dream Defenders’ website refers to the entire state of Israel as the “site of a continued settler colonial project,” and laments U.S. military aid to the Jewish state.  A large section of the site promotes the group’s anti-Israel activism.Breitbart News reported two weeks ago that Gillum’s Dream Defenders allies compiled an education tool for U.S. teachers about “liberation” movements and that glorifies the Popular Front for the Liberation of Palestine (PFLP), a deadly terrorist organization.Republican challenger Ron DeSantis has repeatedly called for Gillum to distance himself from Dream Defenders.During a debate nine days ago, Gillum claimed that he had “no idea” what DeSantis was referring to when he brought up a Dream Defenders pledge Gillum reportedly signed that supports a “radical manifesto.”“The fact is, Andrew signed a pledge with the Dream Defenders pledging his support, this radical manifesto,” DeSantis said at the televised debate.“I have no idea what pledge he is talking about,” Gillum replied.Gillum’s claim of ignorance about the pledge came despite his already known close relationship with Dream Defenders. Gillum has talked about aiding the group’s activism and has written in strong support of Dream Defenders and its co-founder, Agnew. In turn, Agnew himself recently described a long and close working and personal relationship with Gillum and said he considers Gillum to be “part of the movement.”Gillum was taped at a June debate saying that he is “pleased and proud” to have sneaked food to Dream Defenders activists during a 30-day sleep-in protest at the Florida State Capital, referring to a 2013 month-long anti-gun protest in the wake of the Trayvon Martin shooting. “I hope you keep at it,” Gillum said of Dream Defenders activists during a June event.Now revelations about Gillum’s former YP4 training outfit bring his association with Dream Defenders even closer.Not only is Agnew listed as an alum, Gillum himself penned a glowing 2014 profile at the far-left Alternet publication boasting about how Agnew graduated the 2005 inaugural class of Gillum’s YP4. “We need more Phillip Agnews,” was the title of the piece.Gillum wrote:Focused from the start on collaboration between progressive young people, Agnew’s YP4 fellowship project was organizing a statewide, student-led coalition to lower tuition rates and increase Pell Grant funding in higher education. He worked with other young leaders across Florida to host a training preparing students to lead the advocacy for accessible higher education. Through the YP4 fellowship, he was introduced to critical social issues and learned how to conduct effective community organizing around these issues, including how to champion their message in the media. Agnew became an organizer with the Student Coalition for Justice, a cadre of students from Florida A&M University, Florida State University, and Tallahassee Community College angered by the death of 14-year-old Martin Lee Anderson at a Florida youth detention center.…We must learn from the successes of young leaders like the Dream Defenders and recruit, train, and connect thousands more local organizers and activists, particularly in underrepresented communities and regions of the country.Breitbart News reported that Dream Defenders organized a flash mob in Israel to officially endorse the BDS movement against the Jewish state.In June 2018, Gillum signed a Dream Defenders pledge containing specific language stating, “I pledge my support to the Freedom Papers.” The organization’s “Freedom Papers,” in turn, exclaim that “police and prisons have no place in ‘justice.’”The Dream Defenders “Freedom Papers” also advocate textbook socialist principals such as claiming that “by virtue of being born each of us has the absolute right to adequate food, shelter, clothing, water, healthcare, effective public transportation, dignified work, living wages.”As Breitbart News reported, a simple perusal of the website of Dream Defenders, the organization so feverishly championed by Gillum, evidences the group’s open radicalism. The organization calls for an “end” to “disaster capitalism,” rants against Independence Day and spreads anti-Israel charges.Much of that extremist rhetoric mirrors the phraseology posted on the official “issues” sections of the YP4 website while Gillum not only served as its active director, but while his picture, position and bio were brandished on the same site on the “staff” page.The YP4 organization said its mission was to challenge U.S. “predatory capitalism,” abolish the prison system, fight a “spiritual resistance” battle against “Christian hegemony,” redefine the meaning of “borders” while aiding “undocumented” aliens, and enact the “collective liberation” of “communities of color” amid what it described as the scourge of “white supremacy.”Gillum’s group accused the U.S. of being a “colonialist” power perpetrating “structural violence” and “continued genocide.” It claimed conservatives in the U.S. judicial system were “justifying white supremacist policing practices.”Even while he was a Tallahassee city commissioner and later the city’s mayor, Gillum was heavily involved in the controversial YP4 youth leadership program as youth director, announcing multiple hires and headlining fundraising and group events.In his position of youth leadership director at PFAW, Gillum was in charge of both YP4, the organization’s youth training program, and the organization’s Young Elected Officials (YEO) Network, which he founded and which describes itself as “the first national program singularly-focused on providing a network of support to young progressive state and local elected officials.”At a PFAW dinner in 2011, Gillum said that even though he served as vice-mayor of Tallahassee at the time, his “best job” was actually his position as the organization’s youth director, where, he explained, he led YP4. He said his job there was to counter “the radical right,” singling out Ann Coulter and Karl Rove as individuals who needed to be opposed.A review of an archived version of YP4’s website from December 2016, while Gillum was still overseeing the group and while he was listed on the “staff” page, finds a site bursting with extremist rhetoric. Much of the same language still exists on the current version of the group’s website.The “Economic Justice” section of Gillum’s group’s website demanded that activists challenge what it described as U.S. “predatory capitalism” and instead work toward socialist-style economic ideals.That section, which is part of the mission of YP4, stated:We know that voracious predatory capitalism is a threat to the safety, well-being, and survival of our communities and our planet. As wages stagnate and intergenerational wealth is concentrated in the hands of the few, pathways to opportunity are becoming less and less accessible to the rest of us. At YP4, we are uniquely aware of the importance of challenging our system of predatory capitalism and working towards a set of institutional arrangements which allow us all to access the necessities of life — from housing, food, sustenance, and healthcare.In that spirit, we are committed to supporting the work of organized labor, cooperative economists, and those organizing against politics of austerity, both in the US and abroad. We believe in leveraging the power of our network to support Fellows engaged in this work — from those doing worker organizing to those providing direct services to under-resourced communities and researching tax justice issues.One “issues” section of the website accuses the U.S. government of being a colonialist power which must be held to account for perpetrating “structural violence” and “continued genocide.”Gillum’s YP4 said it “operates daily with the understanding that the lands upon which our movements organize–– and upon which our own offices are situated –– have been ripped from the hands of their historical inhabitants through the sustained, continued genocide of Native and indigenous peoples.”“By stripping Native Tribes of their sovereignty, divesting resources from indigenous communities, and consigning Native peoples to the dustbins of history, the U.S. government and agents of imperialism continue to perpetuate the structural violence which began hundreds of years ago,” continued the site. “YP4 believes strongly that we as an organization have an obligation to name our complicity in colonialism, support Native activists in their necessary work, and hold communities of colonizers accountable to our actions.”The organization implies illegal activism is acceptable: “As freedom fighters committed to lasting, meaningful change, we know that, while legal change cannot be the sole path to liberation, it is certainly a tool for agents of social justice seeking to reduce the harm of repressive legislation and winning long-withheld constitutional rights.”The “Racial Justice” section of Gillum’s website called for no less than the “the liberation of communities of color in this country and around the world,” and deployed socialist rhetoric demanding “collective liberation” amid the “obligation to state clearly that white supremacy kills.”Gillum’s group exclaimed on its website that “white supremacy” manifests in “colonialism, imperialism, slavery, and voracious predatory capitalism.”Gillum’s group called on activists to emulate the work of Dream Defenders, which, it said, fights “a prison industrial complex that disproportionately affects people of color.”The “Community Safety, Police Brutality, and Prison Abolition” section calls for what the title implies — an end to the U.S. prison system. Gillum’s group said it was working toward “ending the carceral State and challenging the presupposition that our communities are made safer when our fellow human beings are locked in cages.”YP4 rhetoric warned of “police forces procur[ing] increasingly militarized arsenals, and prosecutors shield[ing] police officers who’ve murdered members of the neighborhoods they purport to serve.”The “Spiritual Resistance” mission section calls for the “birthing” of a “movement for transformative justice” working to “push back against Christian hegemony which alienates and belittles other spiritual traditions.”The “Immigration” page says the Gillum’s group believes global events should cause “critical conversations around the ways our movements conceptualize and articulate issues of empire, national identity, and the construct of borders.” In the U.S., Gillum’s group said it works to “support young undocumented people, efforts to expand and protect immigrants’ access to Deferred Action for Childhood Arrivals (DACA) and Deferred Action for Parental Accountability (DAPA), as well as campaigns to halt the deportations of undocumented peoples and families.”The “Legal and Judicial Activism” mission page accuses “conservative legal opposition” in the U.S. of “suppressing the vote, expanding the role of money in politics, reinforcing patriarchal and heteronormative policies” and “justifying white supremacist policing practices.”The “education” section of the YP4 website advocated “alternatives to formal education” with the “raising” of “political consciousness throughout liberation movements.”Gillum could not stay at PFAW since the organization cannot legally be involved in partisan politics. But when he depoarted PFAW he didn’t go very far. He instead joined P&P Communications, a leadership consulting firm in Tallahassee founded by Sharon Lettman-Hicks, who served as Executive Vice President at the PFAW Foundation and reportedly recruited Gillum in 2002 to the PFAW. “We recruited him because of his advocacy and tenacity as a student leader,” she said.PFAW has been aiding Gillum’s mayoral campaign, and described how it helped him win the democratic primary earlier this year:Gillum is endorsed by PFAW’s Next Up Victory Fund, a program that helps young progressives win state and local elections. In the closing weeks of the primary, PFAW sent on-the-ground organizers to Florida to push people to the polls in support of Gillum. The group also launched a series of social media advertisements promoting his campaign.Gillum, Lettman-Hicks and Dream Defenders’ Agnew each are graduates of an Oakland, California-based training school for progressive revolutionaries that has spawned a list of activists who have gone on to become the who’s who of the far-left leadership world, with many taking senior positions at organizations financed by Soros.In scores of cases, graduates of the Rockwood Leadership Institute founded or directed notorious Soros-financed activist groups, such as Black Lives Matter, Media Matters for America, MoveOn.org and the Tides Foundation, one of the nation’s largest funders of progressive groups. Soros’s own Open Society Foundations sent top staff to Rockwood for training. Notorious radicals Van Jones and Linda Sarsour are among the many famous names listed as alums.Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.Joshua Klein contributed research to this article. \nIsrael / Middle EastMidterm ElectionPoliticsAndrew GillumDream DefendersGeorge SorosPeople for the American WayPhillip Agnew .Copyright © 2018 Breitbart"}