{"id": "Utah City Mayor, Father of Seven Killed in Afghanistan After ‘Insider Attack’", "paragraph": "Brent Taylor announced his one-year deployment to Afghanistan as part of an advisory team that trains members of an Afghan commando battalion. Over the weekend, his family and friends found out he had paid the ultimate price and would not return to his wife, Jennie, and their seven children.Taylor participated in a Facebook Live event in January to share his deployment, which he said was in keeping with his vow to serve God, his family, and his country, according to the Salt Lake City Tribune.“While I am far from perfect in any of these respects,” Taylor said, “I have given my life to serve all three of these loyalties whenever and however I can.”“Serving as the mayor of North Ogden city has been one of the greatest honors of my life and the highlight of my civilian professional career,” Taylor said. “Service is really what leadership is all about.“The Tribune reported:The attacker was immediately killed by Afghan Forces, according to NATO. The Utah National Guard hasn’t confirmed Taylor was killed in the attack, but Maj. Gen. Jefferson S. Burton, the adjutant general, in a news release, said: “My heart breaks for the loss and sacrifice of our soldier, particularly for the family. I wish them all the comfort and courage to face the difficult days ahead.”Those who knew him expressed their grief at his loss on social media.“I hate this. I’m struggling for words. I love Mayor Taylor, his amazing wife Jennie and his 7 sweet kids. Utah weeps for them today. This war has once again cost us the best blood of a generation. We must rally around his family. Thank you for your sacrifice my friend,” Utah Lt. Gov. Spencer Cox tweeted.I hate this. I’m struggling for words. I love Mayor Taylor, his amazing wife Jennie and his 7 sweet kids. Utah weeps for them today. This war has once again cost us the best blood of a generation. We must rally around his family. Thank you for your sacrifice my friend. 🇺🇸💔 https://t.co/uS9emZgv7s— Spencer Cox (@SpencerJCox) November 3, 2018Utah Gov. Gary Herbert posted a statement on Taylor’s death on Twitter.“The entire Herbert family mourns with this soldier’s family and we pray that their burdens may be lifted and that the hearts of all Utahns will reach out to comfort them in their grief,” Herbert wrote.Heartbroken that we lost one of our own today. @UTNationalGuard pic.twitter.com/SHFf5qmACU— Gov. Gary Herbert (@GovHerbert) November 4, 2018CNN reported that Taylor was elected to the local city council of North Ogden, 45 miles north of the capital Salt Lake City, in 2009 and became mayor in 2013.“We are devastated by the loss of our Mayor and friend, Brent Taylor,” the city said on its Facebook page.Taylor had said his service would help fulfill President Donald Trump’s order to increase troops and expand the capabilities of the Afghan units.In one of his last Facebook posts, posted on Twitter by Cox, Taylor reminded Americans to vote in next week’s midterm elections.This is Mayor Taylor’s last FB post. Here’s how to honor him:“As the USA gets ready to vote, I hope everyone back home exercises their right to vote. We have far more as Americans that unites us than divides us. United we stand, divided we fall. God Bless America.🇺🇲️👊🏻\" pic.twitter.com/aJRP9H320c— Spencer Cox (@SpencerJCox) November 3, 2018Friends have set up a GoFundMe page to raise money for Taylor’s family:Brent Taylor, Mayor of North Ogden, was killed in Afghanistan today. Mayor Taylor was a hero in every sense of the word.  He believed in his community, his country and in selfless service to his fellowman. He truly belonged to all of us in the community, but he ultimately belongs to Jennie and his seven amazing children.  At this time we cannot take away the loss for Jennie and his children but we can ease some of her financial burdens which will be with her for the rest of her life.  Please help us thank Mayor Taylor for giving the ultimate sacrifice to his country. Knowing his family is being taken care of financially will matter to Brent.  Please help us reach our goal, it is a lofty goal, but that is how our Mayor lived his life…setting lofty goals.WE LOVE this AMAZING FAMILY!As of Sunday afternoon, $160,000 of the $250,000 goal had been reached.Saturday’s attack is under investigation, officials said.According to the Department of Defense, 2,216 troops have died since the United States launched its war against terror in Afghanistan and Iraq following the Sept. 11, 2001 attack that killed nearly 3,000 people on U.S. soil.Follow Penny Starr on Twitter\nAsiaNational SecurityPoliticsAfghanistanBrent TaylorNational GuardTaliban .Copyright © 2018 Breitbart"}