{"id": "Iranian President: Saudis Murdered Khashoggi with ‘Protection of America’", "paragraph": "“No one would imagine that in today’s world and a new century that we would witness such an organized murder and a system would plan out such a heinous murder,” said Rouhani.“I don’t think that a country would dare commit such a crime without the protection of America,” he added. “The tribal group that is ruling [Saudi Arabia] has a security margin. That security margin is that it relies on U.S. backing. It is this superpower that is backing them,” Rouhani elaborated.Rouhani said the same American “protection” allowed Saudi Arabia to conduct its “brutal bombing” of Yemen, where the internationally-recognized legitimate government was deposed in 2014 by insurgents from the Houthi tribe supported – and, according to the U.S. government, armed – by Iran. Ending Saudi involvement in Yemen is a major Iranian foreign policy goal.Rouhani jeered at the United States for complaining about human rights in Iran while allegedly taking a payoff to let the Saudis get away with murder.“Today, the people all over the world are confused. Should they believe your claims about human rights or your announcement that you avoid comment on the [Khashoggi] issue for 450 billion dollars?” he asked.Radio Free Europe noted on Tuesday the Iranians have played their cards close to the vest on Khashoggi until now, given how quick they usually are to criticize Saudi Arabia. Analysts told RFE Iran was largely content with “getting out of the way of an adversary that is shooting itself in the foot,” as Ali Vaez of the International Crisis Group put it. The Iranians may also have held their tongues because they enjoyed seeing the world’s attention focused on Saudi Arabia and Turkey instead of their own political and economic situation, and because they wanted to keep their options open for improving relations with the Saudis and the United States, especially if the Khashoggi crisis forces Crown Prince Mohammed bin Salman to resign.The official silence was broken on Monday by the head of the Iranian judiciary, Sadegh Amoli Larijani, who accused the Saudis of “first setting out to cover up this crime with the help of the West” and then inventing an improbable excuse about “rogue elements” murdering Khashoggi once blanket denials became untenable.\nIsrael / Middle EastNational SecurityCrown Prince Mohammed bin SalmanIranIranian President Hassan RouhaniJamal KhashoggiSaudi ArabiaYemen .Copyright © 2018 Breitbart"}