{"id": "Indiana Asks Supreme Court to Uphold Abortion Law", "paragraph": "Indiana is asking the U.S. Supreme Court to hear arguments over a law that bars women from having abortions based on gender, race or disability. https://t.co/haEmCcC5Ug— WISH-TV (@WISH_TV) October 15, 2018House Enrolled Act 1337, signed into law by Mike Pence when he was Indiana’s governor, also required that aborted or miscarried babies be interred or cremated, a provision that challenged the practice of abortion clinics to contract with waste management companies that ultimately burn aborted babies with bio-hazard medical waste:\"A consideration of Indiana's ban by the Supreme Court would be a significant victory for many disability rights activists who are concerned about the high abortion rates for those with Down syndrome.\" https://t.co/N1uKk1lpn8 #dignity1337— IN Right to Life (@irtl) October 18, 2018The case may be the first on the issue of abortion the nation’s high court hears since Supreme Court Justice Brett Kavanaugh’s confirmation.The Indiana Department of Health filed the request for hearing the case of Commissioner of Indiana Department of Health v. Planned Parenthood of Indiana. In the request, the state asks the Supreme Court to consider two questions:The request for a Supreme Court hearing arose out of a lawsuit by Planned Parenthood of Indiana and Kentucky (PPINK) and the ACLU over the law. Planned Parenthood claimed the new law placed undue burden on a woman’s right to choose an abortion and that it violated women’s privacy since the group does not ask women the reason for seeking an abortion.Regarding the mandate to bury or cremate the aborted baby, Planned Parenthood said such a requirement introduces further costs for medical waste.As Indiana Attorney General Curtis Hill’s office explained in a press release, the Seventh U.S. Circuit Court of Appeals ruled against the state ban on discrimination abortions based on sex, race, or disability – asserting the law placed an undue burden upon women seeking abortion – and said that the provision regarding the remains of aborted babies served no governmental purpose.“Nothing in the Constitution prohibits states from requiring health facilities to provide an element of basic human dignity in disposing of fetuses,” Hill said in a statement. “These tiny bodies, after all, are in fact human remains.”“Further, states have every reason and right to prohibit abortions from being performed simply as a means of selecting the race, sex, or physical condition of a child,” the attorney general added. “The right to abortion declared by our Supreme Court protects only the decision not to bear a child at all, not a right to decide which child to bear. Our nation knows only too well the bitter fruits of such discrimination”:BREAKING: The state of Indiana has appealed @mike_pence's abortion law to the Supreme Court. https://t.co/4vIQhAc98r— Planned Parenthood (@PPIndKentucky) October 15, 2018PPINK President Christie Gillespie said in a statement that Indiana “continues to defend those unconstitutional and medically unnecessary abortion restrictions.”“By appealing to the Supreme Court, the state of Indiana is trying to not only chip away at Hoosiers’ rights, but also threaten the rights of people seeking safe and legal abortion care across the country,” she continued. “If they truly want to reduce the need for abortion in Indiana, our legislators should focus on expanding access to affordable birth control and comprehensive sex education, not blocking patients’ access to care.”The Supreme Court will now need to consider granting certiorari, which requires four justices to agree to take up the Indiana case.\nPoliticsAbortionBrett Kavanaughgenetic abnormalitiesHouse Enrolled Act 1337Planned ParenthoodSCOTUSSex-Selective AbortionU.S. Supreme Court .Copyright © 2018 Breitbart"}