{"id": "Exclusive–Kris Kobach: Migrant Caravan is ‘Most Advanced Stage’ of Left’s ‘Open Borders Psychosis’", "paragraph": "Kobach, in an exclusive interview with Breitbart News, said the migrant caravan of Central Americans — which consist of previously deported illegal aliens and job-seekers — is the final stage in the open borders agenda, dating back to the 1990s.“The Democrats’ reaction to the caravan … they’re reacting by calling it a ‘humanitarian crisis’ and cheering on the migrants,” Kobach said. “This is the most advanced stage of their open borders psychosis.”Kobach detailed that in 1996, Democrats, with President Bill Clinton at the helm, had supported pro-immigration enforcement.“It was a pro-enforcement bill that Clinton signed and many Democrats agreed with,” Kobach said.Later in the 2000s, though, Democrats changed their position on immigration enforcement and instead took a hardline pro-amnesty stance that focused on allowing the millions of illegal aliens living in the U.S. to permanently stay in the country.“Maybe they could stomach some enforcement of immigration, but they were cheering the illegal aliens already here,” Kobach said.Today, Kobach says the Democrat Party’s national platform is pro-illegal immigration, not only in the U.S., but now for foreign nationals seeking to arrive in the U.S. through the southern border making false asylum claims.“Now we have a new phase of the open borders psychosis which is the left cheering illegal aliens outside of the country to come in,” Kobach said. “Which is a huge process past advocating for amnesty for illegal aliens already in the country.”“They’re demanding the border be open,” Kobach continued.Kobach also noted that despite the establishment media’s claims of the caravan migrants fleeing a “humanitarian crisis” in Central America, there is “no war and no famine” in the region.In a column for Breitbart News, Kobach called the migrant caravan a “consequence of rewarding illegal immigration,” writing that the “caravan also illustrates the rampant abuse of our asylum laws.”I will be on Sean Hannity's radio show at 1:10 p.m. talking about my latest Breitbart column about the caravan and how we need governors who will work with President Trump to stop illegal immigration. #ksleg #ksgov You can read the column here. https://t.co/hQh9wSxxHq— Kris W. Kobach (@KrisKobach1787) October 24, 2018President Trump this week announced that he would begin the process of cutting off foreign aid to Honduras, Guatemala, and El Salvador for their inability to stop the migrant caravan from marching up to the U.S.-Mexico border. The president also called the caravan a “national emergency.”The Central American countries receive more than $500 million in federal aid from the U.S. every year. Trump has not yet indicated how much of that federal aid will be cut.Breitbart Texas reported that the migrant caravan stormed through Mexico last week, tearing down a border barrier in the process as they crossed from Guatemala to Mexico. A second group of about 250 migrants from El Salvador are expected to follow the current caravan and head to the U.S.-Mexico border next week.Less than six months ago, a similar migrant caravan was allowed to cross into the U.S. with weak asylum claims despite threats from President Trump to close down the border. Many migrants from that caravan are now illegal aliens living in the U.S. as they await their asylum hearings.John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder. \nImmigrationPoliticsasylum lawscaravanimmigrationKris KobachOpen Borders .Copyright © 2018 Breitbart"}