{"id": "Joe Donnelly Embraces Barack Obama Despite Donnelly Obfuscating His Democrat Affiliation", "paragraph": "Obama will campaign for Donnelly in Gary, Indiana, on Sunday to reassure the deep-red state that Hoosiers should re-elect the incumbent Democrat to the U.S. Senate.Hoosier businessman and Donnelly’s Republican challenger, Mike Braun, released a campaign statement on Sunday charging that Donnelly continues to double-down with the “liberal resistance movement by campaigning with Obama.“After joining the angry liberal mob against Supreme Court Justice Brett Kavanaugh, Mexico Joe Donnelly is doubling-down with the liberal resistance movement by campaigning with Barack Obama,” Josh Kelley, Braun’s campaign spokesman, said in a statement on Sunday.“While Hoosier job creator Mike Braun proudly stands with President Trump, it’s Mexico Joe Donnelly who has supported Obama’s Iran nuclear deal, served as a superdelegate for Hillary Clinton and stands with Barack Obama’s liberal philosophy,” Kelley added.Donnelly’s embrace of Obama strikes a stark contrast from a June interview with NPR, in which he stressed he was a bipartisan lawmaker representing Hoosier interests.“I’m not trying to tie myself to one label or another label. My label is a Hoosier label. My label as an American label,” Donnelly told NPR. “And that’s what we all should be doing.”In an October ad, Donnelly criticized “socialists” who want government-run health care and the “radical left” who wants to abolish the Immigration and Customs Enforcement (ICE) agency.Donnelly’s criticism of government-run health care contrasts with Obama, who embraced the socialized healthcare scheme as a “good new idea” during a speech in September.One study from the Mercatus Center found that Medicare for All would cost at least $38 trillion and even doubling the federal income tax would not pay for the Medicare for All’s immense costs.Despite Donnelly labeling himself as a bipartisan lawmaker who represents Hoosier interests in the Senate, Donnelly voted against confirming Judge Brett Kavanaugh to the Supreme Court even though a plurality of Hoosiers wanted Kavanaugh confirmed to the Supreme Court.Braun has attacked Donnelly for attacking free-trade and how it has hollowed out American manufacturing, while Donnelly’s family business has outsourced jobs to Mexico. The Hoosier businessman told Breitbart News that Donnelly exhibited the “ultimate level of hypocrisy” by attacking his business while outsourcing Hoosier jobs to Mexico.Last year the Associated Press (AP) reported that while Sen. Donnelly chastised Carrier Crop. for moving manufacturing jobs to Mexico, he profited from a family business that relied on Mexican labor to produce dye for ink pads.Donnelly, during his first run for the House in 2004, railed against the North American Free Trade Agreement (NAFTA) and called “outsourcing,” “a fancy term for ‘Someone in Indiana has just lost their job.”The Hoosier businessman then said that, similar to President Trump, “I have a business background and we get things fixed with hard decisions when you need to, put up some short-term pains for long-term gains and prosperity that comes with good decision making.”\nMidterm ElectionPoliticsBarack ObamaJoe DonnellyMike Braun .Copyright © 2018 Breitbart"}