{"id": "Watch – Gorka: ‘If You Liked the Last Two Years, It Is All on the Ballot in November’", "paragraph": "Gorka said he worked to illustrate the points in his books with personal anecdotes, such as the story of U.S. Navy Captain Eugene “Red” McDaniel, a naval aviator shot down over Vietnam and held prisoner by the Vietcong for six and a half years. His captors, Gorka explained, tortured him to the brink of death, but he endured and is still alive to this day.“There’s a moment when, after the initial round of torture, he’s got scabs, his arm is out of his socket, and another prisoner is brought in,” Gorka recalled. “And he looks at this man, and he says, ‘I finally realized why I’m here.’ Because he was struggling with what brought him to this place, and he said, ‘I may have been badly injured and tortured, but I saw my fellow American, and he was worse off than me, and I needed to minister to him.’”“He finds a deeper sense of Jesus. He understands what the suffering of our Lord was through this experience, never loses faith in God through six and a half years, becomes a kind of quasi-minister to his fellow Americans, holds Bible study in the prison, and then eventually is freed,” Gorka said.“Not only that! It’s an amazing story,” he added. “There’s a painting of him in the book where he goes back into service. The American Navy put him back into service, and he gets to command his own ship. It is the American story.”Gorka compared the strength of heroes like McDaniel to the modern era of “safe spaces” and “restricted free speech zones at U.S. colleges,” an era where quoting Winston Churchill is supposedly a racist blunder. He contended the stories in his book prove American valor is not a distant relic of the World War 2 generation.He also stressed the importance of the life and writings of Whittaker Chambers, author of the landmark biography Witness, which Gorka hailed as a “life-changer” for all who read it.“Whittaker Chambers grew up in very, very humble, simple circumstances, but very smart and an incredible writer. He joins the Communist underground before World War 2. He sympathizes with the Communist message, he’s an idealist – so much so that he becomes the courier, he becomes the messenger between the Kremlin and their covert agents in the U.S. government,” Gorka recalled.“During the war, after Stalin makes a pact with Hitler – the Molotov-Ribbentrop Pact – he sees the light and he says, ‘This is evil, this is wrong, I can no longer subscribe to this,’” Gorka continued. “He sees good Communists, loyal Communists, being killed, being kidnapped by Stalin and his paranoid purges. He says, “Oh, my gosh, am I going to be next?’ So he goes underground with his family, he goes into hiding. He hides all the microfilm documents of the messages he was carrying between the agents of the Soviet Union in America and the Kremlin, he goes into hiding.”“After the war, he becomes a real full-blooded patriot, and he says, ‘We’ve got a whole network of bad guys inside the U.S. government. I need to tell somebody.’ He goes to the FBI. The FBI: not interested. He gets connected to the Truman White House. The Truman White House: not interested. Finally, he gets connected to a guy called Richard Nixon who’s working on Capitol Hill, and Congress is very interested,” he said.This resulted in Chambers giving the first televised testimony against the Communist menace and accusing prominent left-wing elitist Alger Hiss of being a Soviet spy, launching a contest of political will that would echo for decades to come.“If you were shocked at Kavanaugh, open a book,” Gokra chortled, referring to the recent bitter battle over the confirmation of Supreme Court Justice Brett Kavanaugh. “Read Why We Fight. Because Whittaker Chambers was Justice Brett Kavanaugh before Kavanaugh was born. Because the Left unleashes the hounds of hell – the accuse him of being a homosexual, they accuse him of being an alcoholic. They accuse Whittaker Chambers of being responsible for the death of his own brother.”“And what happens? He resists the lies. He stands there as a righteous man, to be proven absolutely correct decades later when the Venona decrypts of Soviet intelligence communications prove that Alger Hiss was a Soviet spy,” said Gorka. “This man never ever gave up. Whittaker Chambers is included in my book Why We Fight because he didn’t wear a uniform, he didn’t carry a gun, but he was as much of a hero as Red McDaniel, as Stephen Decatur, as Chesty Puller, who are all in my book,” he said. “The bottom line is this: the left did not invent these tactics with Justice Kavanaugh. They didn’t invent them with Clarence Thomas, or with Judge Bork. They’ve been doing it for 70 years,” he said.Gorka used the exploits of Stephen Decatur, who became America’s youngest Navy captain after a daring 1804 mission to destroy a frigate that fell into the hands of pirates from Tripoli, to make two important points: “Lesson One, our fighting forces are amazing, always have been. And Number Two, we’ve been fighting jihadis for about 200 years.”In terms of handling threats to American security from open borders, Iranian malevolence, and Chinese ambition, Gorka said the media will never give President Trump the credit for intelligence and determination he saw when he served as Trump’s adviser.“When you go back to the speeches he’s given for 30 years on China and what they’re doing – the left will never, never give credit this administration, and especially the president, for knowing exactly what they are doing, and why they’re doing it, for Americans,” he said. “Evil is real,” Gorka mused. “Evil isn’t the mythology of Hercules. Evil walks the Earth right now, ladies and gentlemen. This is what was denied for eight years under the Obama administration. No, no, no, terrorism, evil things, it’s the product of climate change, global warming – going back to the theories of social science, it’s social movement theory, it’s grievances. Grievances lead to people being beheaded live on camera! This is the insanity.” “No, it’s evil,” he maintained. “Man is fallen, and we must fight evil wherever it is – whether it is the slave markets that exist today, right now, as we are sitting here, there are people being sold into sex slavery. Whether it is the 10,000 children that were sent into the hands of the coyotes to be smuggled into America – what kind of parent does that? Seriously, 10,000 children into the hands of the coyotes, that’s evil. There is no excuse for that. And what must we do? We must stand up to it. Otherwise, evil wins.”Gorka spoke forcefully against the media narrative on the disappearance of Washington Post contributor Jamal Khashoggi at the Saudi consulate in Istanbul.“Let’s first be accurate: the guy is not a journalist, and he’s not an American, okay?” Gorka said of Khashoggi. “He’s a foreign national killed in a foreign country who wasn’t a journalist. He was an opinion piece commentator for the left, Number One.”“Number Two, the amount of column inches and time dedicated to this story of a foreigner killed in a foreign land – could we compare that to the left’s coverage of Benghazi, where Americans are being killed in a foreign land?” he continued. Gorka said there is a “deeper story” behind the use of the Khashoggi story to bash President Trump’s policy in the Middle East, especially by supporters of President Barack Obama’s Iran nuclear deal.“These are the guys who are trying to defend giving $140 billion to Iran. Now they suddenly have pangs of conscience?” he scoffed.“Look, this guy is dead. It’s clear he’s dead. He may have been tortured. But the quality of the reporting – ‘a Turkish official heard from somebody who heard from somebody who may have heard the audio cassette’ Come on, guys, this is ridiculous,” he said.“I’ll tell you what this is all about,” Gorka said. “Let’s pray for his soul, for his family. This is about one thing: the president has finally stood up to the media, which has been pumping a tissue of lies for decades, and he’s calling parts of it – let’s be accurate here, they misquote him – he’s calling parts of the mainstream media ‘fake news.’ Now they think they’ve got him, and they can connect his righteous indignation at the lies with the death of this quote-unquote ‘journalist’ who is not a journalist. That’s what this is all about. They couldn’t care less. If this guy was not a journalist, they couldn’t care less about this man’s plight. This is about attacking Donald J. Trump, nothing more, nothing less.”When a caller questioned the relevance of the Khashoggi case to American policy, Gorka reflected that avoiding foreign entanglements is easier said than done.“If only the world were that simple. Isolationism didn’t work on Pearl Harbor in ‘41, it didn’t work on 9/11,” he said.“We don’t make an internal matter the primary thing in a bilateral relationship with another country, but we can’t have people who say they’re our friends putting out hit jobs on people they politically disagree with. There has got to be some consequence. It doesn’t mean it’s an earth-shattering strategic consequence for our national security, but if you say you’re our friend, you shouldn’t be behaving like this, and there have got to be some consequences,” he said.Gorka added the observation that if news reports of a 15-man team dispatched from Saudi Arabia to abduct or kill Khashoggi are correct, it could not have been a “rogue operation” by some over-enthusiastic courtier who overheard the royals grumble about Khashoggi’s criticism one day and decided to silence him.“15 guys on diplomatic passports on a private jet? That’s not a rogue unit. Somebody very high up in the Saudi administration okayed this. Is it the crown prince? I’ll tell you who’s going to find out. It’s a friend of mine: Mike Pompeo,” he said.Another important topic on the public mind is immigration, which Gorka thought has not received the attention it deserved in the last few weeks before the midterm election because other issues have crowded it from the news.“I will tell you one thing because I know it, because I’ve worked for the man, during the campaign, in the White House: He will never, ever go south on you. He will never betray the American people on the wall,” he said of President Trump’s position on illegal immigration.“He is a very, very kindhearted man,” Gorka added. There is a reason he invited the survivors of the Parkland shooting to the White House. He didn’t have to do that. It’s because he cares. He wanted to make a deal on DACA – not something I would have subscribed to, but he does that not because he’s jockeying for political position, but because he is compassionate.”“I will guarantee for you: he will never, ever go soft on us on the wall,” he stressed.Gorka said his own preferred solution begins with acknowledging that “we don’t punish children for the sins of their parents.”“But you’re never getting to be an America. You get to the end of the line, and we’ll let you apply for a green card if you arrived here under the age of 18 as a DACA person. But that’s it. You don’t get to jump the line. You don’t get citizenship. Why should you? You can live here if you pay taxes and you’re legal, but you get to the back of the line. It’s that simple.”Gorka said Republican voters should not take the midterm elections for granted.“Don’t just vote yourself,” he advised. “Get people out there you know who will not vote otherwise, because it’s raining. And please, for the next 19 days, get on social media. I don’t care how old you are, how much of a Luddite and klutz you are technologically, get a social media account on Facebook, Twitter, Instagram and support the president, and make sure that we keep the House. Because if you liked the last two years, if you like your 401(k), if you like ISIS being destroyed, being crushed, it is all on the ballot in November.”\nNational SecurityVideo2018 electionscold warDACADr. Sebastian GorkaimmigrationJamal KhashoggiSaudi ArabiaVietnam .Copyright © 2018 Breitbart"}