{"id": "Massive Crowd Comes for Trump’s Late-Election Push in Georgia", "paragraph": "Several thousand lined up hours early to see Trump make his closing argument for Georgia Republican gubernatorial nominee Brian Kemp, who faces Democratic gubernatorial nominee Stacey Abrams on Tuesday.(Jeff Poor/Breitbart News)The president emphasized the importance of Tuesday’s election right away after taking the stage and boasted about the “electricity in the air” as it approaches.“This is one of the most important elections of our lifetime,” Trump said during his introduction. “This is a very important election. I wouldn’t say it’s as important as 2016, but it’s right up there. It’s right up there. It really is. It’s become so incredible, and there is electricity in the air like I haven’t seen since the 2016 big victory that we all had together.”“Incredible electricity,” he continued. “And in fact, speaking of that, could I ask — look at this. It’s like the Academy Awards. Look at how many cameras. Could I ask you to turn around and shoot? They don’t have to do this with other celebrities when they come here that don’t have very big crowds. Look at the people back there. Shoot it. You’ve got to shoot it.”Trump listed the progress Georgia had made since his inauguration and urged attendees to elect Kemp to ensure it continues.“Jobless claims in Georgia just fell to their lowest level in 45 years,” Trump said. “More Georgia workers are employed today than at any time or any point in American history. Think of that. Do you want to see that end quickly? Do you want to see Georgia prosperity end quickly? Vote for the Democrat. She’ll end it quickly. She will end it quickly, and she’ll double up your taxes, and a lot of bad things will happen. We passed a massive tax cut for Georgia families, and we will soon follow it up with another 10 percent tax cut for the middle-class. We’re working on that now.”(Jeff Poor/Breitbart News)“Here in Georgia, the great news just keeps rolling in,” he continued. “Jobs are going up. Crime is going down. Wages are rising, the first time in many years. You saw that in the report on Friday. Poverty is plummeting, and confidence is at an all-time high. Other than that, we’re not doing very well. Under Republican leadership, Georgia is safer, Georgia is stronger, and Georgia is winning like never before. And I’ll tell you what, I know Brian. He will take it to new heights, heights that you wouldn’t even believe. I know him. This guy doesn’t stop, which is what you want. He’s an incredible manager. He’s been successful all the way up and down the line. This man will bring it to heights that you wouldn’t believe, even today with those great numbers.”(Jeff Poor/Breitbart News)The president also reminded rallygoers about now-Associate Supreme Court Justice Brett Kavanaugh’s confirmation process in the U.S. Senate, which some political watchers say gave Republicans a late-campaign surge in the polls. He also mentioned that one of Kavanaugh’s accusers had backtracked on her story.“To protect your rights and freedoms, we overcame the Democrat smear campaign and confirmed the newest member of the United States Supreme Court, Justice Brett Kavanaugh,” he said. “Boy, did he get treated badly. The Democrats treated him so badly, so unfair. And did you see what happened on Friday? You know what I’m talking about, right? They knew — you knew that before. You knew that these three women, they knew that before. They knew that a long time ago. So, a woman, who accused then Judge Kavanaugh of horrible, horrible crimes admitted that actually she never met Judge Kavanaugh or Brett Kavanaugh or Kavanaugh period. Never met him, never saw him and the act never happened, and it was a lie. It was a total lie. She made up the story, and she was forced to admit it.”Trump also touched on immigration, one of the key planks in his 2016 campaign election platform and warned if Democrats were elected, they would seek to “totally erase America’s borders,” among other things.(Jeff Poor/Breitbart News)“They want to take away and destroy your health care because that’s what’s going to happen, impose socialism and totally erase America’s borders,” he said. “How about that caravan? Do you want to let that caravan just pour in? I don’t think so. So we started the wall. $1.6 billion. Another $1.6 billion just approved. We’re building it in pieces and chunks, but I want to build it all at one time. In the meantime, you saw last week I called up the United States military. We’re not playing games, folks. There’s no games because you look at what’s marching up, that’s an invasion. That’s not — that’s an invasion.”(Jeff Poor/Breitbart News)After the Macon event, Trump headed to Chattanooga, TN for a Sunday evening event, and wraps up his campaign rally tour with stops in Cleveland, Fort Wayne, IN and Cape Girardeau, MO on Monday.In the Georgia race, polling has been mixed. However, the Real Clear Politics polling average has Kemp with a slight advantage over Abrams. But if Sunday’s rally is any indication, there’s no lack of enthusiasm among Republicans as Tuesday approaches.A midterm election rally pic.twitter.com/wXVjhk9dK4— Jeff Poor (@jeff_poor) November 4, 2018Follow Jeff Poor on Twitter @jeff_poor\nMidterm ElectionPoliticsBrian KempDonald TrumpGeorgiaMaconStacey Abrams .Copyright © 2018 Breitbart"}