{"id": "CNN’s Brian Stelter: Bomb Targets Were All ‘Criticized Mercilessly by Right-Wing Outlets’", "paragraph": "“There’s a lot we don’t know about these packages, but we do know what all the targets had in common: They have all been criticized mercilessly by right-wing outlets,” Brian Stelter said in a tweet, linking to a video of him appearing on CNN.There's a lot we don't know about these packages, but we do know what all the targets had in common: They have all been criticized mercilessly by right-wing outlets… pic.twitter.com/UKIw8hxs9b— Brian Stelter (@brianstelter) October 24, 2018Stelter said that while “there’s no need, there’s no reason to assume motives, to assume anything at this point,” the commonality in all targets is the fact that the right-wing media have attacked them.Stelter told fellow CNN personality Chris Cuomo:We do know what all of these targets have in common. These are all targets that have been criticized mercilessly by right-wing outlets, by fringe groups on the internet and by some right-wing commentators. And already, there’s this awful rush to try to claim it’s a false flag operation, figures like Rush Limbaugh, who have a lot of power, who have a lot of influence, who have a lot of fans, are out there saying awful things. Mail bombs were sent to the offices of CNN in New York City, as well as to the homes of Bill and Hillary Clinton, Barack Obama, and liberal billionaire George Soros Wednesday. Luckily, all the bombs were caught early and nobody was hurt.President Trump strongly condemned the attempted attacks, saying, “We have to unify, we have to come together, and send one very clear strong unmistakable message that acts and threats of political violence of any kind have no place in the United States of America.”However, this apparently wasn’t enough for CNN President Jeff Zucker, who issued a statement slamming the White House for a “total and complete lack of understanding” of “the seriousness of their continued attacks on the media.”Statement from CNN Worldwide President Jeff Zucker: pic.twitter.com/OXyIT6oSLT— CNN Communications (@CNNPR) October 24, 2018 \nMediaPoliticsBrian StelterChris CuomoCNNDonald TrumpJeff ZuckerMail Bombs .Copyright © 2018 Breitbart"}