{"id": "Florida sues Walgreens, CVS in connection with opioid crisis", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Florida filed a lawsuit against Walgreens and CVS on Friday for allegedly adding to the state and national opioid crisis.\n          Florida is accusing Walgreens and CVS in a lawsuit with contributing to the opioid crisis in the state and nationally.Attorney General Pam Bondi announced late Friday that she has added the nation's two largest drugstore chains to a state-court lawsuit filed last spring against Purdue Pharma, the maker of OxyContin, and several opioid distributors.“We will continue to pursue those companies that played a role in creating the opioid crisis,” said Attorney General Bondi. “Thousands of Floridians have suffered as a result of the actions of the defendants.”FEDS PROSECUTING FENTANYL OVERDOSE DEATHS AS HOMICIDES IN CRACKDOWN ON OPIOID DEALERSThe amended complaint alleges that Walgreens and CVS were two of the largest opioid distributors in Florida and failed in their duties under Florida law to stop suspicious orders of opioids they received, according to Bondi. The amended complaint also alleges that Walgreens and CVS dispensed unreasonable quantities of opioids from their pharmacies.Walgreens distributed 2.2 million opioid tablets from its store in Hudson, a Tampa-area town of 12,000, and in one unidentified town of 3,000, sold 285,000 pills in a month, the lawsuit says. In some stores, its opioid sales jumped six-fold in two years. The company paid $80 million five years ago to resolve a federal investigation that centered on inadequate record keeping of its Florida opioid sales that allowed the pills to reach the black market.Florida's accusations against CVS were more general, saying it sold 700 million opioid dosages between 2006 and 2014, including outsized sales in Hudson and two other nearby towns.CVS did not immediately respond Saturday to emails seeking comment, the Associated Press reported. Walgreens did not immediately respond to a phone message and emails. Both companies on their websites say they are committed to fighting opioid abuse.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}