{"id": "Stephen Colbert reveals why he returned to Catholicism after losing his faith", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Late night host Stephen Colbert opened up about the moment he returned to Catholicism in 1986.Late night television host Stephen Colbert is open about his faith but revealed in an interview that he became \"convicted of [his] atheism\" before returning to Catholicism.The CBS star told Father James Martin on his Catholic talk show “Faith in Focus” on Thursday night that there was a time in his life he turned away from God. However, a moment in 1986, when he was 22 years old, changed his mind while walking down the street in Chicago.“I had lost my faith in God, to my great grief,” he explained. “I was sort of convinced that I had been wrong all this time that I had been taught something that wasn’t true.”That day, while walking, a person handed the comedian a book.POLITICS ON LATE NIGHT: STEPHEN COLBERT RIDICULES PRESIDENT TRUMP’S MEDAL OF FREEDOM PICKS“And I was walking down the street and somebody handed me a little, green New Testament Proverbs and Psalms,” he said.“The Late Show” host said he had to crack the Bible open in order to read it because it was so cold outside.“And I open it up to a little glossary in the front and it said verses to read based upon if you [have] anxiety,” he said.He recalled the passage being from Matthew Chapter 5. The comedian said he immediately felt “lightened” after reading the passage.“For the first time I understood the real meaning of the phrase, it spoke to me. Like it read off the page. The words of Christ read off the page. There was no effort. I stood on that street corner in the cold and read that sermon. And my life has never been the same,” Colbert said.CHRIS PRATT DENIES HOLLYWOOD IS ANTI-RELIGIOUS“That’s beautiful,” the priest responded.“This gift of religion is something that can only be given in this way,” he continued.“And therefore you should be humble and accept this act of love. And see what it is they gave you without rejecting it,” he said.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}