{"id": "Voters defy violence and suicide bombers for Afghan parliamentary elections; 15 dead in Kabul", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Voters from the minority Sikh register to cast ballots in parliamentary elections in  Kabul, Afghanistan, Saturday. Tens of thousands of Afghan forces fanned out across the country as voting began in the elections that followed a campaign marred by relentless violence. (AP Photo/Massoud Hossaini)\n          Voters in Afghanistan defied deadly attacks Saturday to cast ballots in the country’s first parliamentary elections in eight years, according to reports.The most serious attack on a polling place was in a northern Kabul neighborhood where a suicide bomber blew himself up just as voting was about to end. The blast killed 15 people, including police officers, according to police and Interior Ministry officials.The BBC reported dozens of people killed or injured in scores of episodes across the country.The violence only added to the chaos, according to reports.A new biometric verification system led to technical problems, according to the BBC. Many polling stations opened as much as five hours behind schedule. And in some places, election workers failed to show up. Some polling places extended voting hours to handle the long lines of voters.\"The widespread reports today of confusion and incompetence in the administration of the elections ... suggest that bureaucratic failures and lack of political will to prioritize organizing credible parliamentary elections may do more to delegitimize the election results than threats and violent attacks by the Taliban and Daesh,\" said Andrew Wilder, vice-president of Asia Programs at the U.S. Institute of Peace, using the Arabic acronym name for the Islamic State group.\n      Women line up outside a polling station during the parliamentary election in western Herat city, Afghanistan, on Saturday. (AP Photo/Hamed Sarfarazi)\n      About 2,450 candidates are competing for places in the lower house, which has 250 seats, including one reserved for a candidate from the Sikh minority, Reuters reported. Under the constitution, parliament reviews and ratifies laws but has little real power.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}