{"id": "Woman in alleged GoFundMe scam claims she was ‘set up’ by boyfriend, homeless man", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    A New Jersey couple and a homeless Philadelphia man who were once the symbol of generosity in hard times allegedly conspired with each other to come up with a false story to earn GoFundMe donations and will now face charges.The New Jersey woman involved in the alleged GoFundMe scandal claims she was “set up” by her now-former boyfriend Mark D’Amico and homeless man Johnny Bobbitt.“I was set up by Mr. D’Amico and Mr. Bobbitt,” Kate McClure, who is reportedly no longer dating D'Amico, told the New York Post through her lawyer Friday.GOFUNDME SCAM? HOW A HOMELESS MAN, NEW JERSEY COUPLE'S ALLEGED FAKE SOB STORY UNFOLDED“Mr. D’Amico knew that I was a very kind person and that I was a bit naive,” McClure added. “Mr. D’Amico took advantage of that.”Both McClure, 28, and D’Amico, 39, claimed in a viral GoFundMe post in 2017 that Bobbitt, who was homeless, gave his last $20 to McClure so she could get gas when stranded in Philadelphia last November. To thank him, McClure and D'Amico created a GoFundMe account to raise funds for Bobbitt. Around 14,000 people donated to the campaign, which brought in more than $400,000 overall.But earlier this week, a New Jersey prosecutor --  who said an investigation began after Bobbitt claimed he wasn't getting the money that had been raised on his behalf and later sued the couple -- said the feel-good tale was a complete lie.\"The entire campaign was predicated on a lie,\" Burlington County prosecutor Scott Coffina said. \"It was fictitious and illegal, and there are consequences.”McClure didn't run out of gas and Bobbitt didn't spot her in trouble and give her money, Coffina said.Investigators said the three deliberately prevented donors from gaining information \"that would affect their judgment about solicited contribution to that fundraising effort,\" NBC 10 reported.Now, both McClure and D’Amico and the homeless man are facing charges for allegedly concocting the fake story that led to a $400,000 profit.Bobbitt, 35, was arrested Wednesday night by U.S. Marshals in Philadelphia and remained in custody Thursday on probation detainers and a $50,000 bond. D'Amico and McClure surrendered to authorities Wednesday night and were released.COUPLE'S GOFUNDME CAMPAIGN FOR HOMELESS MAN WAS A FAKE: PROSECUTORSAll were charged with theft by deception and conspiracy to commit theft by deception. The charges carry prison time of up to 5 to 10 years.Fox News' Jennifer Earl, Amy Lieu and The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}