{"id": "GOP's narrow path to deny Pelosi gavel could run through key districts offering shot to flip seats", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    House Minority Leader Nancy Pelosi appears supremely confident that she will lead the Democratic Party back to the majority in the House.MANCHESTER, N.H. – Eddie Edwards claims Nancy Pelosi is getting scared.“They’ve been nervous since day one. Since I declared my candidacy in April 2017, they’ve been nervous. And it shows right now. Nancy Pelosi has spent well over half-a-million dollars in the last week to try and distort my campaign,” the Republican nominee in New Hampshire’s 1st Congressional District said Saturday.  While Pelosi might not actually be losing sleep over Edwards’ candidacy, his race does represent somewhat of a wild card among the dozens of competitive House contests being held Tuesday. It’s one of the precious few Democrat-held seats Republicans have a chance at flipping, from blue to red. Those open races include battles for Minnesota's 8th District seat, held by a retiring Democratic incumbent; Minnesota's 1st, where incumbent Democrat Tim Walz is running for governor; and Nevada's 3rd, where incumbent Democrat Jacky Rosen is running for Senate. Minnesota's 8th, where Republican Pete Stauber faces Democrat Joe Radinovich, is considered perhaps the GOP's best shot to swipe a seat, but a strong performance in the others would give the party at least a chance to defy the odds and hold the chamber. Democrats are well aware of the New Hampshire race’s significance among these; in accusing Pelosi of distorting his record, Edwards was referring to a new TV ad by the House Majority PAC, the top outside group that supports Democrats running in congressional elections and is closely tied to House Minority Leader Pelosi.   In the final week of the New Hampshire campaign, the group shelled out nearly $700,000 to run a TV commercial targeting Edwards on the issue of health care. “Washington is attacking our health care and Eddie Edwards can’t wait to join the assault,” the narrator warns in the spot.The day after the ad hit the airwaves, an Emerson College poll put Edwards just 2 points behind Democratic nominee Chris Pappas, a three-term member of New Hampshire’s Executive Council. Pappas’ advantage was within the survey’s sampling error. Two previous polls showed the Democrat with larger single-digit leads.“We’ve run this whole campaign like we’re a few votes behind,” Pappas told Fox News.Minutes earlier, speaking to party activists at a canvass kickoff in Manchester, Pappas told the crowd, “This is a district that is going to help determine what Congress looks like going forward. Whether we’re going to have checks and balances going forward in D.C.”For the first time in 16 years, no incumbent is running for re-election for the seat, which has ping-ponged between Democratic and GOP control the past four elections. Sitting Democratic Rep. Carol Shea-Porter is retiring. “It’s one of the few quintessential swing districts in the country,” noted Colin Reed, a GOP strategist who ran former Sen. Scott Brown’s 2014 Senate campaign in New Hampshire.The Democrat-held district also is one of a handful nationwide that President Trump won in the 2016 presidential election. That’s why Republicans hope the seat can flip from blue to red as they mostly play defense elsewhere in hopes of holding their House majority. A potential pick-up here could be a key factor in whether the party can stave off the kind of Democratic takeover Pelosi, who has her eyes on the speaker's gavel, envisions.Two days before voters head to the polls, Democrats are still widely seen as having the edge in the race for House control. The Real Clear Politics map, Fox News' Power Rankings and other race raters all show Pelosi's party better-positioned going into Tuesday.'It’s one of the few quintessential swing districts in the country.'“We’re going to be asked ten or twenty years from now what we were doing in 2018 when our country needed us. We have to be able to answer that question. We have to be able to [say] we knocked on every door that we could, we made every phone call that we could,” said Pappas, who if elected would be New Hampshire’s first gay member of Congress.If Edwards wins on Tuesday, he would also make history, as the state’s first black member of Congress. The conservative candidate is a U.S. Navy veteran and former police chief of a small town who also served as the state liquor commission’s chief law enforcement officer.Edwards was joined Saturday morning at his jam-packed campaign headquarters by Republican Gov. Chris Sununu.“Those Republicans that were winning are winning by a little more. Those Republicans that were down are now leading by a little bit. The surge is here. It really is,” Sununu touted. “And it’s not because we spend all this outside money on television ads and that kind of stuff. It’s this. It’s the grassroots support.”Sununu was referring to that House Majority PAC ad, which also alleges: “Edwards supports a disastrous health care plan that would strip protections for pre-existing conditions, increasing the costs of your premiums and prescriptions.”Edwards argued the commercial was “full of lies and distortions.”He added he’s “talking about lowering the costs of health care in this country, I talked about pre-existing conditions and protecting pre-existing conditions.”Reed said the commercial’s a sign Democrats are concerned about holding the seat.“Look at the money. And the fact that outside third-party groups decided to spend on behalf of Pappas in the last ten days of the election, when resources are the most precious, that tells you this thing is tightening,” he explained.While House Majority PAC spent big bucks to help Pappas, neither the National Republican Congressional Committee (NRCC) nor the Congressional Leadership Fund – the major outside group backing GOP House candidates – reciprocated.Reed said that Republicans “are defending an incredibly large swath of territory and resources get limited. That’s just a reality of life.”But he pointed to a silver lining for the GOP candidate: “I don’t think it’s the worst thing in the world for Eddie Edwards to not be having the outside groups being in New Hampshire on his behalf because it allows him to bolster an independent image.”Pappas also enjoys a sizeable campaign cash advantage over Edwards, telling Fox News, “We have a significant capacity advantage over the other side to be able to talk to voters, to be able to knock on doors and make phone calls.”Edwards said he wasn’t concerned with the lack of last-minute outside help.“This is New Hampshire. This is all about grassroots, this is all about knocking on doors,” he said. “This is all about retail politics. That’s what Granite Staters appreciate the most. And that can overcome dollars at any level.”This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}