{"id": "Hawaii Supreme Court upholds permit for controversial giant telescope", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          FILE - This undated file artist rendering made available by the TMT Observatory Corporation shows the proposed Thirty Meter Telescope, planned to be built atop Mauna Kea, a large dormant volcano in Hilo on the Big Island of Hawaii in Hawaii. (AP Photo/TMT Observatory Corporation, File)\n          (The Associated Press)Hawaii's Supreme Court upheld a decision to grant a construction permit for an embattled, international giant telescope project planned for a mountain Native Hawaiians consider sacred.The court ruling Tuesday is a victory for the contentious Thirty Meter Telescope planned for Hawaii's tallest mountain, Mauna Kea. Opponents say the telescope will desecrate sacred land on the Big Island. Supporters say it will bring educational and economic opportunities to the state.Opponents and supporters have been awaiting the ruling because it was expected to help determine whether the project is built in Hawaii or moves to a backup location in Spain's Canary Islands that's less desirable to scientists hoping to use the instrument for groundbreaking discoveries.Plans for the project date to 2009, when scientists selected Mauna Kea after a five-year, around-the-world campaign to find the ideal site for what telescope officials said \"will likely revolutionize our understanding of the universe.\"The project won a series of approvals from Hawaii, including a permit to build on conservation land in 2011.Protests disrupted a groundbreaking and Hawaiian blessing ceremony at the site in 2014. After that, the protests intensified and divided the community, with some Native Hawaiians saying they were afraid to publicly support the project. Construction stopped in April 2015 after 31 protesters were arrested for blocking the work. A second attempt to restart construction a few months later ended with more arrests and crews retreating when they encountered large boulders in the road.Scientists revere the mountain for its summit above the clouds that provides a clear view of the sky with very little air and light pollution.The telescope will allow astronomers to reach back 13 billion years to answer fundamental questions about the advent of the universe, touts a website for the project. \"In the nearby universe, with TMT, astronomers will be able to discover and characterize, in detail, planets orbiting stars other than the Sun. There is the potential to examine these planets for signs of life beyond the Earth: this would be one of the most important discoveries of all time,\" the website says.Opponents appealed and in December 2015, the state Supreme Court revoked the permit, ruling the land board's approval process was flawed. That meant the application process needed to be redone, requiring a new hearing.After oftentimes emotional testimony for the hearing that spanned 44 days, the retired judge presiding over the proceeding recommended granting the permit, with conditions that employees attend mandatory cultural and natural resources training and that employment opportunities be filled locally \"to the greatest extent possible.\"Opponents appealed again after the land board approved the permit. They complained about various due process issues, including that the hearings officer had a conflict of interest because she was a member of a Big Island astronomy center.A group of universities in California and Canada make up the telescope company, with partners from China, India and Japan. The instrument's primary mirror would measure 98 feet in diameter. Compared with the largest existing visible-light telescope in the world, it would be three times as wide, with nine times more area.Mauna Kea, a dormant volcano, has been the first choice, telescope officials said, calling it the best location in the world for astronomy. They identified an alternate site on the island of La Palma in the Canary Islands if the telescope couldn't be built in Hawaii.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}