{"id": "Trump campaigns for Blackburn in Tennessee after stumping for Kemp in Georgia", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    President Trump speaks to crowd at MAGA rally in Macon, GeorgiaPresident Trump warned Georgia and Tennessee voters against allowing “radical Democrats” to turn back economic recovery in America, in back-to-back rallies for Republican candidates Sunday.Earlier in the afternoon, Trump said that Democratic gubernatorial hopeful Stacey Abrams would turn the state \"into Venezuela\" and \"make your jobs disappear like magic\" if she defeats Republican Brian Kemp in Tuesday's election. Trump campaigned for Kemp in Macon, and then went to Chattanooga, Tenn., to hold an evening rally on behalf of Republican Senate candidate Marsha Blackburn.\"Brian Kemp is an incredible fighter and a tireless champion for the people and for the values of Georgia, and he was with me right from the beginning,\" said Trump, who also warned that if Abrams is elected \"your Second Amendment is gone.\"\"You wouldn't mind [if] somebody comes knocking [and says], 'Please, we'd like to have your turns turned over to government,'\" Trump said, drawing a pained reaction from the crowd. \"Stacey Abrams is one of the most extreme, far-left politicians in the entire country. ... You put Stacey in there, and you're gonna have Georgia turn into Venezuela. I don't think the people of Georgia like that.\"Kemp, Georgia’s secretary of state, is locked in a close race against Abrams, who could become the first black woman to serve as a U.S. governor. Fox News has rated the race as a “toss-up.”The president stuck to national issues during the early part of the Georgia rally, including the most recent jobs report, the recent confirmation battle over Supreme Court justice Brett Kavanaugh and the approaching Central American migrant caravan.At one point, Trump called former Georgia Bulldogs coach Vince Dooley on stage to give brief remarks in support of Kemp. Former Heisman Trophy winner Herschel Walker, Dooley's greatest-ever player, endorsed Kemp earlier in the race.When Kemp took the stage, he thanked Trump for \"having Georgia on your mind.\"\"As you all know, many times the states are the laboratories of democracy,\" Kemp said. \"And the president needs some help at the state level from time to time, so I want to encourage you all to get out and vote on Tuesday.\"Trump held his Georgia rally at the same time former President Barack Obama was campaigning for Democratic candidates in Indiana and his home state of Illinois.The president arrived in Georgia the same day Kemp’s office announced it was investigating the state’s Democratic Party for \"possible cyber crimes\" related to an alleged attempted hack on state voting infrastructure. In a statement, the secretary of state’s office said the FBI and Department of Homeland Security had been notified about what it called a “failed attempt to hack the state's voter registration system.”CANDIDATE LAUNCHES PROBE INTO DEMOCRATIC PARTY'S 'POSSIBLE CYBER CRIMES'The Georgia Democratic Party has called the claims “scurrilous” and “100 percent false.”\"This political stunt from Kemp just days before the election is yet another example of why he cannot be trusted and should not be overseeing an election in which he is also a candidate for governor,\" the Georgia Democratic Party's executive director, Rebecca DeHart, said in a statement.Trump did not mention the controversy at Sunday's rally.Kemp previously has said he would not recuse himself from his office if the contest with Abrams goes to a recount, even though he would be overseeing that process.In Tennessee, Blackburn is hoping to keep retiring Sen. Bob Corker’s seat in Republican hands. A Fox News poll released last week showed her with a nine-point lead over Democratic former Gov. Phil Bredesen.Trump started his speech at the Blackburn rally by cheering the country’s economic recovery through his leadership, noting “we are over-performing.”He asked his supporters if they wanted “the resistance” to take it all away.“We have the hottest economy on earth,” noting more than 157 million Americans now have a job. “There is an electricity in the air. … We are breaking every record in the history of our country.”He called the Democrats the party of erasing borders and championing socialism, “the liberal agenda of high taxes and high crimes.”CLICK FOR COMPLETE FOX NEWS 2018 MIDTERMS COVERAGEHe said America has the worst immigration laws, and “the world laughs at us.”Four caravans are currently traveling inside Mexico, totaling some 12,000 Central American migrants.\"That's an invasion. I don't care what they say,\" Trump said to cheers. He received similar applause when promoting the economy, unemployment numbers and judicial appointments.Trump also condemned Democrats for humiliating Supreme Court Justice Brett Kavanaugh during his confirmation hearings in light of that Republicans on the Senate Judiciary Committee referred a woman to the FBI for “materially false statements” when she accused Kavanaugh of raping her. Senate Judiciary Committee Chairman Chuck Grassley referred Judy Munro-Leighton to authorities after his office said she alleged that Kavanaugh and a friend raped her in the backseat of a car -- only for that story to fall apart. The accusations were initially made via a “Jane Doe” letter to Sen. Kamala Harris’, D-Calif., office in September. Kavanaugh was asked about the allegations in an interview with investigators; he called the allegations a “crock” and a “farce.”When Blackburn took the stage, she reiterated the global policies made in the Trump administration.She said: “To keep this working, Tennessee needs a senator that says she is going to do what she says she is going to do when she gets to Washington, D.C.”She asked the crowd to stand with her to keep the Trump agenda going.Singer Lee Greenwood's hit \"God Bless the USA\" has been a standard at Trump's events ever since he announced his campaign for president.For Trump's rally in Chattanooga, Greenwood appeared on stage to deliver the song in person.Trump expressed surprise after Greenwood sang as the president took the stage. Trump told supporters: \"I didn't know Lee Greenwood would be here. That was a surprise.\"Fox News' Gregg Re and The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}