{"id": "Georgia certifies election results showing Kemp as victor in governor's race", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Democrat Stacey Abrams acknowledges that she can't defeat Republican Brian Kemp, but threatens legal action; reaction from political strategists Holly Turner and Robin Biro.Georgia Secretary of State Robyn A. Crittenden on Saturday announced the certification of election results from the disputed midterm elections, and, as anticipated, Republican Brian Kemp was the top vote-getter in the governor's race, besting Democratic competitor Stacey Abrams.With 100 percent of precincts tallied, the state's official election website showed Kemp with 50.22% of voters, or 1,978,408 votes. Abrams, by comparison, had 48.83 percent, or 1,923,685.Libertarian candidate Ted Metz had .095 percent of voters, or 37,235 votes, the website showed.\"After receipt of certified election results from all county election superintendents, the Secretary of State has tabulated, computed, canvassed, and certified the votes cast for all federal and state officers and questions voted for by voters of more than one county,\" the announcement said.Georgia, like Florida and Arizona, among others states, saw tensions flare and challenges bloom after the Nov. 6 midterms, amid claims of inaccurate counting, voter suppression and other irregularities. But Abrams acknowledged Friday that she could not defeat Kemp.Still, she vowed to pursue a federal lawsuit challenging the “gross mismanagement” of the state’s elections. While describing a variety of issues at the polls, Abrams said that \"the state failed its voters.\"\"I acknowledge that former Secretary of State Brian Kemp will be certified as the victor in the 2018 gubernatorial election. But to watch an elected official – who claims to represent the people in this state, baldly pin his hopes for election on the suppression of the people’s democratic right to vote – has been truly appalling,\" Abrams said. \"So let's be clear, this is not a speech of concession.\"Fox News' Elizabeth Zwirz contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}