{"id": "Dear Melania, it's been two years since your husband was elected -- An open letter to our first lady", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    First lady appears in public for the first time in weeks. Kayleigh McEnany debates Jehmu Greene.Author's note: The unceasing, unjustified and often unhinged attacks against first lady Melania Trump make me want to offer her some words of comfort in the form of an open letter.Dear Melania,We’ve had many great first ladies, married to presidents of different political parties. These presidential wives have been known for different accomplishments and many have made positive marks on our nation, working for a range of worthy causes.You follow in that proud tradition. However, I don’t know of any first lady who has had to endure the ferocity of rhetoric and sheer brutality of attacks that you have. I’m sure it isn’t easy.When you suddenly found yourself cast into the role of first lady you managed to stay true to who you are in a world where the many in the antagonistic, combative and outright hostile media have constantly sought to play a game of “gotcha.”When they couldn’t find anything of substance on which to fault you, members of the media and their friends in Hollywood went after your clothes, your accent and even your Christmas decorations. They’ve shown us just how low they’re willing to go, and it’s ugly down there.Through it all, you’ve been an example of grace and silent strength. In spite of the onslaught of attacks, you’ve stayed focused on what’s most important to you and you’ve avoided being provoked by your critics.This takes unimaginable restraint that most of us don’t possess.You’ve kindly asked that your critics focus on what you do and not what you wear. What woman hasn’t experienced that feeling – judged by how we look rather than what we say and what we accomplish?Those on the left are constantly telling us we need to do more to level the playing field for women. Asking that they focus on your actions and not your looks shouldn’t be such an unreasonable request in 2018.But then again, you’re not just any woman. You’re the woman who married Donald Trump – Public Enemy No. 1 in the eyes of “the resistance.”It’s been two years since your husband was elected president and America knew it was also getting a new first lady. Though it’s not a spotlight you sought, you’ve embraced your role, tuned out your critics, stayed focused on your family and won the admiration of many in this country.Your “Be Best” campaign addresses well-being, social media use and opioid abuse facing many of our nation’s children. These are serious issues and you deserve the thanks of all Americans for taking them on.You’ve received a lot of backlash for promising to take on childhood cyberbullying in the wake of your husband’s confrontational Twitter habits. You haven’t been shaken, proving that you are your own person, and as first lady you are going to take on causes that are important to you.Feminists – especially celebrity feminists – are always telling us that as women each of us needs to be our own person. But I guess that doesn’t count if the person is someone they don’t like.The same celebrities who tell us we are a nation of immigrants and claim to be defenders of immigration in all forms have thought nothing of mocking your Slovenian accent. How many of them speak six languages, as you do?Earlier this year late-night comedian turned anti-Trump stooge Jimmy Kimmel mocked the way you read a children’s book during the White House Easter Egg Roll.Actress and bitter anti-Trump activist Chelsea Handler last year falsely stated that you can “barely speak English,” and for that reason, she’d never have you on her Netflix show, which has since been deservedly canceled. And Victoria’s Secret model Gigi Hadid attempted a shameful imitation of your accent during her time on stage at the American Music Awards last year.Hypocritical Hollywood and the wealthy stars who boast of being so inclusively pro-immigrant seem to have a bad case of Trump Derangement Syndrome.Over the last two years, your shoes and your clothes have been a source of fascination and fixation by the media. Most recently on a trip to Africa where you visited schools, shelters, and hospitals to focus on child welfare, it was your outfits on which the media chose to focus.They compared you to Michael Jackson, Indiana Jones and Carmen Sandiego on Twitter after you wore a tan suit, black tie and hat on a stop in Egypt.And who can forget what was infamously dubbed “stiletto-gate?\" You were criticized for wearing heels while boarding a plane to visit Texas to tour the damage It’s been two years since your husband was elected president and America knew it was also getting a new first lady. Though it’s not a spotlight you sought, you’ve embraced your role, tuned out your critics, stayed focused on your family and won the admiration of many in this country.done by Hurricane Harvey.That you changed into sneakers on the plane didn’t attract nearly as much media attention. Maybe they’re all just really jealous of your shoes.It’s interesting how some of those who most strongly denounce sexism have no problem applying it to you. If Hillary Clinton had been elected president, can you imagine the media endlessly commenting on and criticizing the clothes, hats, shoes, and hairstyle of “first gentleman” Bill?It’s in times of great adversity that we learn what we’re made of, and over the last two years, you’ve shown us who you are and what you’re made of.We hear a lot of women tell us what it means to be a strong woman. By your actions, you show us what it means.Keep being true to yourself.Sincerely,Lauren DeBellis AppellOn behalf of millions of Americans who are proud to have you represent our country.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}