{"id": "Cluster of 1,000 octopuses discovered during California deep-sea expedition", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Scientists researching the Davidson Seamount off the coast of California encounter a rarely seen group of octopus females and their eggs.A huge group of brooding octopus \"moms\" were spotted hovering over their eggs roughly 2 miles below the ocean's surface off the coast of California in mid-October.Scientists admired the stunning sight while aboard the E/V Nautilus, a 210-foot research vessel owned by the Ocean Exploration Trust. The group was using a remotely operated underwater vehicle equipped with a camera to study an undersea mountain called the Davidson Seamount, located within the boundaries of the Monterey Bay National Marine Sanctuary, when they saw hundreds of octopuses on the ocean floor.“We went down the eastern flank of this small hill, and that’s when — boom — we just started seeing pockets of dozens here, dozens there, dozens everywhere,” Chad King, chief scientist on the Nautilus, recently told National Geographic of the Oct. 23 discovery.Most of the octopuses were in brooding positions, with their arms turned inside out to protect their egg clusters.\n      Scientists aboard the research vessel E/V Nautilus discovered a cluster of octopuses off the coast of California on Oct. 23, 2018.\n      ( Ocean Exploration Trust/NOAA)GIANT GROUP OF OCTOPUS 'MOMS' DISCOVERED OFF COAST OF COSTA RICA: 'IT'S SUICIDE'\"Clusters of octopus were positioned near shimmering fluid seeps, which were previously unknown to occur in this region,\" Ocean Exploration Trust explained in a statement to Fox News. \"Other species were observed to be associated with the fluid seeps including whelks, anemones, and shrimp.\"The location of where the cephalopods appeared to be gathering intrigued researchers, who believe they may have been crowding around warm spots in the ocean. However, Ocean Exploration Trust notes its underwater vehicle was not equipped with any devices that would be able to accurately collect information on the water temperature. It would be quite unusual if they did, indeed, decide to swarm around warmer waters.\"We went down the eastern flank of this small hill, and that’s when — boom — we just started seeing pockets of dozens here, dozens there, dozens everywhere.\"\"Exposure to higher temperatures jump-starts their metabolism, making them need more oxygen than the warm water can provide,\" Chicago's Field Museum previously explained in a blog post. \"All in all, not a great place to start an octopus family.\"At least 1,000 octopuses were documented during the 35-hour expedition, the non-profit confirmed.'PEA-SIZED' BABY OCTOPUSES DISCOVERED ON FLOATING TRASH IN HAWAII“Out of that 1,000, we might have seen two or three octopuses that were just swimming around,” King described to National Geographic, estimating at least 99 percent were brooding.\n      More than 1,000 octopuses were documented near the Davidson Seamount, located about 80 miles southwest of Monterey, Calif.\n      ( Ocean Exploration Trust/NOAA)The rare discovery comes roughly six months after researchers in Costa Rica found a group of 100 octopuses while exploring the Dorado Outcrop, a rocky area of the ocean floor created by an underwater volcano, with a drone.“When I first saw the photos, I was like ‘No, they shouldn’t be there! Not that deep and not that many of them,” Janet Voight, associate curator of zoology at Chicago's Field Museum and an author of a new study on the findings published in \"Deep Sea Research Part I,\" said in April.The \"dinner-plate-sized\" octopuses — a never-before-seen species of the genus Muusoctopus — were gathering around cracks in the outcrop, where warm liquids are released.“The focus of [our] expeditions to Dorado Outcrop was to study a cool hydrothermal system. In doing so, we discovered this fascinating congregation of brooding octopuses,” Geoff Wheat, a geochemist at the University of Alaska Fairbanks, said in a statement. “This is only the third hydrothermal system of its type that has been sampled, yet millions of similar environments exist in the deep sea. What other remarkable discoveries are waiting for us?”This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}