{"id": "Almost 60,000 migrants deemed dead or missing on dangerous journeys since 2014, study finds", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Migrants claim violation of due process under Fifth Amendment; Tucker Carlson takes on Nexus Services CEO Mike Donovan, the group which is financing the lawsuit.While global migration levels are currently at an unprecedented high – characterized by graphic images of refugees on the run in the Middle East, caravans traversing Central America and flimsy boats from Africa capsizing in the Mediterranean Sea – far less confronting is the silent toll of those who never make it a border, those who die or disappear on often-dangerous expeditions.A new Associated Press report has estimated that at least 56,800 migrants across the world have died since 2014 – almost twice the number documented by the UN’s International Organization for Migration (IOM). The most recent IOM findings, as of the beginning of October, listed 28,500 missing migrants.While the AP’s tally found an additional 28,300 unaccounted for, the report acknowledged its numbers were still low.“More bodies of migrants lie undiscovered in desert sands or at the bottom of the sea,” the report stated. “And families don’t always report loved ones as missing because they migrated illegally, or because they left home without saying exactly where they were headed.”INTERNATIONAL RED CROSS FEARS FOR CITY IN SYRIA IT CAN'T REACH WITH AIDThis year in Africa alone, more than 1,700 people died in the seas that separate Africa and Europe. And, since 2014, within the African continent itself, more than 18,400 migrants are believed to have died. This includes over 4,300 unnamed bodies in just one South African province. The IOM also asserted that many more likely disappear without a trace – perishing in the vast plains of the Sahara Desert.Moreover, at least 3,861 migrants are presumed to have died en route between Mexico and the United States since 2014.YAZIDIS SEEK RESCUE OF WOMEN AND CHILDREN ENSLAVED, MARRIED OFF TO ISISThe report highlights that many of the missing – or pronounced dead – are children. Some 2,773 minors have been reported to the Red Cross as disappeared on the journey to Europe, with an additional 2,097 adults reported missing by children.The AP report also indicated that that funding for projects to adequately track migration and its costs has waned, meaning that many will likely never be found or identified.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}