{"id": "Former Infowars editor Jerome Corsi says he expects Mueller indictment soon: 'My only crime was that I support Donald Trump'", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Former Infowars Washington Bureau Chief Jerome Corsi said in a livestream on Monday that he expects to be indicted soon for perjury in Special Counsel Robert Mueller's Russia probe, which has already produced dozens of indictments since it began in May 2017.Corsi said he had recently received a subpoena from two FBI agents who arrived unannounced on Aug. 28 at his home, leaving his wife \"startled\" just three days before his 72nd birthday.He added that his ongoing negotiations with Mueller and his team have \"just blown up\" in the two months since, even though he said he \"did everything\" he could to cooperate and thought he was \"doing a pretty good job\" of it, including by turning over two Apple computers to investigators and giving the FBI permission to review all of his email accounts and tweets.WHO'S BEEN CHARGED IN RUSSIA PROBE SO FAR? RUSSIAN NATIONALS, FMR TRUMP CAMPAIGN CHAIR, AND MORE\"I fully anticipate that in the next few days I will be indicted by Mueller for some form or other of giving false information to the special counsel or to one of the other grand jury -- or however they want to do the indictment. But I'm going to be criminally charged,\" he said.He added: \"This has been one of the most frightening experiences of my life. At the end of the two months, my mind was mush.\"Corsi, who wrote the anti-President Obama book \"The Obama Nation,\" said he is being targeted for political reasons.Several of those ensnared by Mueller's probe have faced indictments and convictions for matters unrelated to any illegal collusion with the Russian government. Former Trump campaign chairman Paul Manafort, for example, was convicted of unrelated bank fraud and tax crimes that stemmed from his earlier business dealings with Ukrainian officials. U.S. District Judge T.S. Ellis III, who presided over Manafort's first federal trial, openly accused prosecutors of targeting Manafort to get to Trump.\"My crime was that I dared to support Donald Trump.\"\"Criminals are running the Department of Justice. My crime was that I dared to support Donald Trump,\" Corsi said in the livestream. \"And that supporting President Trump, and since 2004 having written 20 books -- I guess those were my crimes. I guess I'm going to prison for the rest of my life because I dared to oppose the deep state.\"He then lamented that he'll \"die in prison\" because of a \"perjury trap,\" in which he said he was interrogated by authorities with a massive binder full of information and was \"quizzed\" about various highly specific topics several times for months.Meanwhile, Corsi associate and political operative Roger Stone last week revealed that Mueller is probing \"whether I somehow directed or urged Wikileaks to release the allegedly hacked e-mails from the DNC in the wake of the Billy Bush accusations against Trump on Oct. 7.\"Stone was unequivocal: \"I did not — and there is no evidence to the contrary,\" he wrote. \"In fact, Wikileaks publisher Julian Assange announced his release schedule on Oct. 2.\"Corsi on Monday denied knowing anything about Assange or the emails the organization leaked during the 2016 presidential campaign.SCHUMER THREATENS TO ADD MUELLER PROTECTIONS TO SPENDING BILLTwo sources close to the president's legal team told Fox News prior to the midterm elections they believe the Mueller probe is \"winding down,\" echoing other reporting that the investigation is coming to a close.But Corsi told his viewers that he expects his problems are just starting up. He announced that he has set up a Paypal to help him defray legal expenses, and said he expects to lose his home.\"I expect this is just going to be the beginning,\" Corsi said on his livestream.The development comes as former Trump attorney Michael Cohen, who pleaded guilty earlier this year to a variety of federal charges including tax evasion and making false statements to a financial institution, was spotted in Washington, D.C. by reporters. It was not immediately clear if Cohen, who took a plea deal with New York prosecutors as his business dealings in New York came under scrutiny, was there to speak to Mueller's team.Cohen's guilty plea to breaking campaign finance law by arranging hush money payments to adult film star Stormy Daniels and former Playboy model Karen McDougal “at the direction” of then-candidate Trump drew the most media attention, although legal analysts (including a former chairman of the Federal Election Commission) said it was unclear whether Trump himself -- or even Cohen -- could have been proven beyond a reasonable doubt to have actually violated the law. Cohen, set to be sentenced Dec. 12, dramatically reduced his potential sentence by taking the guilty plea.Over the weekend, Senate Minority Leader Chuck Schumer, D-N.Y., said that if Acting Attorney General Matt Whitaker does not recuse himself from oversight of Mueller's Russia probe, then Democrats will seek to tie protections for the investigation into the spending bill.\"We Democrats - House and Senate - will attempt to add to must-pass legislation, in this case, the spending bill, legislation that would prevent Mr. Whitaker from interfering with the Mueller investigation\" should Whitaker not recuse, Schumer said Sunday during an appearance on CNN's \"State of the Union.\"President Trump has long derided the Russia probe as a \"witch hunt.\" This summer, it was revealed in documents released by the government that on four occasions, the FBI told the Foreign Intelligence Surveillance (FISA) court that it \"did not believe\" former British spy Christopher Steele was the direct source for a Yahoo News article implicating former Trump aide Carter Page in Russian collusion.NEWLY UNEARTHED TEXTS BY STRZOK, PAGE SHOW FBI HAD 'COORDINATED MEDIA LEAK STRATEGY' TO TARGET PAGE, TRUMP TEAMInstead, the FBI suggested to the court, the September 2016 article by Michael Isikoff was independent corroboration of the salacious, unverified allegations against Trump in the infamous Steele Dossier. Federal authorities used both the Steele Dossier and Yahoo News article to convince the FISA court to authorize and renew a surveillance warrant for Page.But London court records showed that contrary to the FBI's assessments, Steele briefed Yahoo News and other reporters in the fall of 2016 at the direction of Fusion GPS -- the opposition research firm behind the dossier.Page, who has not been charged with any wrongdoing, is now suing the Democratic National Committee and others for alleged defamation.Fox News' Andrew O'Reilly and Lukas Milekonis contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}