{"id": "Macedonian police issue arrest warrant for former PM", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    SKOPJE, Macedonia – Macedonian police sought the country's former prime minister late Monday, looking to arrest him to begin serving a two-year prison term following his conviction on corruption-related charges.Interior Ministry spokesman Toni Angelovski told The Associated Press that police issued a warrant for Nikola Gruevski's arrest on instructions from Macedonia's criminal court.On Friday, judges rejected Gruevski's final appeal against serving the sentence. But several attempts by court clerks to locate Gruevski and personally hand him the order to present himself at prison proved fruitless.Live TV broadcasts late Monday from Gruevski's home showed plainclothes police knocking on his door, with nobody answering.Gruevski's passport had been confiscated, and Prime Minister Zoran Zaev said he did not believe his predecessor and major political opponent would flee the country.\"I do not believe that Mr. Gruevski would allow that, at least according to what he has already stated,\" Zaev said in an interview with state TV.The 48-year-old Gruevski was prime minister in 2006-2016. He is the former leader of the conservative VMRO-DPMNE party, which is the main opposition party. it claims he is being politically persecuted.He was convicted in May of unlawfully influencing officials to purchase a luxury car for government use.Gruevski also faces trial in four other cases that emerged from a wiretapping scandal which erupted in 2015 and plunged the country into a deep political crisis. He has been charged with abuse of office, electoral fraud, criminal association and incitement to violence.He remains a VMRO lawmaker, after a vote in parliament last week failed to produce a big enough majority for his formal expulsion.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}