{"id": "Texas woman’s divorce ends in explosion of wedding dress felt ‘15 miles away’", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    A Texas woman celebrated her divorce with a party and a massive explosion of her wedding dress that was felt ’15 miles away.’A Texas woman found a creative way to finalize the end of her 14-year marriage with more than just a signature.Kimberly Santleben-Stiteler, 43, celebrated her divorce with a party that culminated in a massive explosion of her wedding dress that was felt for miles.“We were all getting messages asking if that was our explosion people were feeling and hearing around the county, up to at least 15 miles away,” Carla Santleben-Newport, Kimberly’s sister, told The Centre Daily Times.FOOD FIGHT AT WHATABURGER BREAKS OUT BETWEEN HOUSTON-AREA HIGH SCHOOLS FOLLOWING FOOTBALL GAMERather than simply throwing the dress into a fire, Kimberly’s dad and brother-in-law came up with the idea of burning the dress with exploding targets.“I had a lot of advice and suggestions from friends and family, like donating it for premature babies and baptism gowns. However, to me, the dress represented a lie. I wanted to have a divorce party to burn the dress,” Santleben-Stiteler said.The dress was rigged with 20 pounds of Tannerite, an explosive component used for firearms training.\n      Facebook/Kimberly Santleben-Stiteler\n      (The explosion was felt about 15 miles away, neighbors said.)“We have a friend who is a bomb tech, and he kept saying, ‘that’s really a lot,’ like five different times, when we told him our plan, so we had to back it up,” Santleben-Newport said.FOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWSLuckily, Santleben-Stiteler had perfect aim, hitting the wedding dress on her very first shot.“It was liberating pulling that trigger. It was closure for all of us,” the new divorcée said.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}