{"id": "FDA warns against honey pacifiers after Texas infants hospitalized with ‘rare’ illness", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          The FDA issued the warning after receiving reports of four infants in Texas hospitalized with botulism.\n          (iStock)Parents, be warned: The U.S. Food and Drug Administration (FDA) is cautioning caregivers to not give honey to babies under one year of age, as four infants in Texas were recently hospitalized after using pacifiers that contained the sweet substance.SUCKING ON YOUR BABY’S PACIFIER TO CLEAN IT MAY BE GOOD FOR THEIR HEALTH, STUDY SAYSThe government agency issued the warning Friday after receiving “reports from the state of Texas that four infants have been hospitalized with botulism,” which is a “rare but serious” condition that can cause death in some cases.The honey pacifiers the infants used were purchased in Mexico though similar products can be found through online retailers in the U.S, the federal agency said.Botulism is “caused by a toxin that attacks the body’s nerves and causes difficulty breathing, muscle paralysis, and even death,” according to the FDA. The toxin is typically produced by the Clostridium botulinum bacteria.“Honey is a known source of Clostridium botulinum spores, which can multiply in a baby’s immature digestive system, and has previously been implicated in some cases of infant botulism,” the FDA explained online.The FDA said any parents who have purchased a honey pacifier -- either one dipped in the substance or filled with it -- should “stop using it and discard it immediately.”BOY WHO LOST LEGS TO MENINGITIS AS A NEWBORN LEARNS TO WALK ON PROSTHETIC LIMBS“The FDA recommends online retailers discontinue sales of honey-filled pacifiers,” it added.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}