{"id": "Miranda Lambert gets her 'name changed back' in new Pistol Annies music video", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    The country music superstars had been married for four yearsShe doesn't want to be \"a Mrs. on paper no more.\"Following her divorce from husband Blake Shelton in 2015, Miranda Lambert is singing about getting her \"named changed back\" in a new Pistol Annies song released on Monday.In the sassy video for the \"Got Her Name Changed Back\" tune about reclaiming singlehood, Lambert and her bandmates Angaleena Presley and Ashley Monroe are seen entering a courthouse where Lambert, 34, happily takes the witness stand as Presley and Monroe look on.“It takes a judge to get married, takes a judge to get divorced / Well the last couple years, spent a lotta time in court / Got my name changed back,” Lambert sings. “Well I wanted somethin’ new, then I wanted what I had / I got my name changed back.”She continues: “Well I’ve got me an ex that I adored / But he got along good with a couple road whores / Got my name changed back.\"After the hearing, a bottle of champagne is popped open and the entire courtroom celebrates.Towards the end of the video, which also features the trio visiting the DMV, the group takes a trip to the bank where they sing: \"I broke his heart and I took his money.\"The ladies won't say who the inspiration is, but Presley explains that there are two divorces and two ex-husbands between them.MIRANDA LAMBERT FURIOUS EX BLAKE SHELTON 'CALLED HER OUT' FOR DATING MARRIED MAN, REPORT SAYS \"It was a feel-good divorce song that was needed,\" Presley told The Associated Press on Tuesday. \"You're welcome.\"\"We can say whatever we want together a little more bravely than we ever would alone,\" Lambert added. \"Our whole catalog has been about celebrating things that weren't so positive and putting them in a humorous light.\"\n      In this Oct. 1, 2018 photo, Ashley Monroe, from left, Angaleena Presley and Miranda Lambert of the Pistol Annies pose for a photo at Sony Nashville in Nashville, Tenn., to promote their newest album, “Interstate Gospel,” out on Friday.\n      (Donn Jones/Invision/AP)MIRANDA LAMBERT-BLAKE SHELTON DIVORCE BECOMES HE SAID/SHE SAID TALE IN THE MEDIAThe women tackle failed marriages, desperate wives, female friendships and complicated women with a lot of wry humor and just the right amount of sadness on their first album in five years called \"Interstate Gospel,\" out on Friday.They wrote the record together without any outside writers, which has mostly been their pattern. \"We haven't written any songs with other writers,\" Lambert said, but then the other two correct her, noting there was one song on their first album that Shelton co-wrote with them.\"Oh well, he's gone,\" Lambert said with a laugh.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}