{"id": "C. African Republic militia leader turned over to tribunal", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    THE HAGUE, Netherlands – A commander in a Central African Republic militia has been arrested and turned over to the International Criminal Court to face charges that include murder and torture, the court announced Saturday.The court, established to prosecute atrocities such as war crimes, said Central African Republic authorities surrendered Alfred Yekatom on Saturday. Court spokesman Fadi El Abdallah would not say if Yekatom already had been sent to the court's headquarters in The Hague.The Central African Republic has been plagued by interreligious and intercommunal fighting since 2013, when predominantly Muslim Seleka rebels seized power in the capital and mainly Christian anti-Balaka militias fought back. The violence left thousands of people dead and displaced hundreds of thousands more.The court alleges that Yekatom commanded some 3,000 anti-Balaka fighters responsible for atrocities committed between December 2013 and August 2014 in the capital, Bangui, and other locations.It said Yekatom would make his first appearance before judges at the court \"in due course,\" when he will be asked if he understands the charges and his rights.The International Federation for Human Rights welcomed Yekatom's transfer to ICC custody.The move \"confirms the authorities' commitment to cooperate with the ICC when they are unable to pursue those most responsible for war crimes,\" said Drissa Traore, a vice president of the federation.The government of the Central African Republic asked the ICC in May 2014 to investigate crimes allegedly committed by both the Seleka and the anti-Balaka.Traore urged the court to follow up the charges against Yekatom with a case against Seleka leaders \"so that the ICC can target the perpetrators of these crimes and better reflect the totality of abuses suffered by victims.\"In June, ICC appeals judges overturned the conviction of former Congolese Vice President Jean-Pierre Bemba for atrocities committed by his forces in Central African Republic in 2002-2003.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}