{"id": "Broward election boss says racism may be behind clamor against her", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Broward County Supervisor of Elections Brenda Snipes is under fire for withholding information about Florida ballots.Embattled Broward County Election Supervisor Brenda Snipes claimed Saturday that racism is “probably” behind the widespread backlash against her.Snipes, who has come under heavy criticism over her handling of the Florida recount after the contentious midterm elections earlier this month, told The Guardian that she believes protesters camped outside the Broward recount center could be there out of hatred of her skin color.Though she declined to elaborate during her brief interview, when asked if race played a factor, she answered: “Probably. Probably.”Snipes, who has a history of election missteps, has been under the microscope ever since Florida ordered a statewide recount last Saturday.\n      Broward Supervisor of Elections Bremda Snipes listens Monday, Nov. 12, 2018, at the Broward Supervisor of Elections office in Lauderhill, Fla. The Florida recount continued Monday in Broward County. (Joe Cavaretta /South Florida Sun-Sentinel via AP)\n      Under her leadership, the county embarrassingly missed its machine recount deadline on Thursday. On Saturday, it had to temporarily stop its manual recount roughly an hour after it began; lawyers from both political parties pointed out that volunteers were counting the wrong ballots.To be sure, the pressure has been intense and it hasn’t helped that President Trump and other Republicans have called on her to resign. Former Florida Gov. Jeb Bush added his voice to the growing number of people calling for Snipes to be removed from her post amid the swirl of almost-constant controversy.“There is no question that Broward County Supervisor of Elections Brenda Snipes failed to comply with Florida law on multiple counts, undermining Floridians’ confidence in our electoral process,” Bush tweeted on Monday. “Supervisor Snipes should be removed from her office following the recounts.”Snipes has received threats of violence and harm, and a source in her office told Fox News she has requested that deputies give her rides home at the end of the night.There are also reports that she and Palm Beach County Elections Supervisor Susan Bucher have been \"doxxed\" -- their home addresses and pictures of their home have been published on the Internet.Information about the reporting doxxing and the group thought to be responsible has been turned over to the FBI.On Thursday, Snipes boasted about making the state’s deadline for machine recounts. “We are excited to be at this point,” she said Thursday afternoon.A few hours later, election officials were forced to admit the county had missed the upload deadline for the recount by two minutes, making its machine recount tally void.Gov. Rick Scott, the Republican challenger in the high-stakes Senate race in Florida, charged that Snipes intentionally submitted late results so that they would be invalidated.In the recount, incumbent Sen. Bill Nelson, the Democrat running against Scott, lost more votes than his opponent -- meaning Scott would have seen a net gain of 779 votes if Snipes hadn't been late.Fox News’ Gregg Re and The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}