{"id": "NJ leaders grappling with sex assault claim arising from Murphy gubernatorial campaign", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          New Jersey Gov. Phil Murphy. Katie Brennan, chief of staff at the state’s housing agency and a former volunteer for the governor’s campaign, first called the police in April 2017, one day, she said, after a campaign staffer allegedly forced himself on her. (Reuters)\n          Katie Brennan spent more than a year trying to get authorities to take action against the man she accuses of sexually assaulting her. Finally, she emailed New Jersey Gov. Phil Murphy.Ms. Brennan, chief of staff at the state’s housing agency and a former volunteer for the governor’s campaign, first called the police in April 2017, one day, she said, after a campaign staffer allegedly forced himself on her. After months of investigation, the county prosecutor’s office declined to file charges against her alleged attacker, saying it didn’t think a jury would convict him. She turned to state law enforcement and high-ranking members of the Murphy administration.  Nothing changed.Finally, the 31-year-old Jersey City resident, who said she turned down a $15,000 settlement offer from her alleged assailant if she signed a nondisclosure agreement, emailed Mr. Murphy and first lady Tammy Murphy directly.She didn’t explicitly mention the alleged assault in her June 2018 email, but asked to speak with the governor or his wife about a “sensitive matter” that had happened during the campaign. The governor responded within the hour and said he was looping in staff to arrange a time.“Hang in,” the governor wrote to Ms. Brennan in the email, which was reviewed by The Wall Street Journal. “We are on it.”A meeting with the governor was never scheduled. And months later, the accused, Albert J. Alvarez, was still working for the state, as chief of staff at the New Jersey Schools Development Authority. Mr. Alvarez resigned his position Oct. 2, the same day The Journal emailed him for comment.“At each turn, I’ve just felt so disappointed,” Ms. Brennan said in an interview. “I tried everything. And none of it worked. If I can’t get any justice, I just don’t seriously know who can.”Mr. Alvarez’s attorney, John Hogan, said his client “absolutely, positively denies these allegations of sexual assault.” He declined to comment further on any aspect of Ms. Brennan’s account. Neither Mr. Alvarez nor his attorney responded to additional attempts to reach them by phone or to an email with detailed questions.After his resignation, Mr. Alvarez was named in local and national press reports about the allegation. Ms. Brennan spoke publicly about the alleged assault for the first time for this article.New Jersey Republicans have called for an investigation into Mr. Alvarez’s hiring, and the state Senate’s Democratic leadership said in a statement they were disturbed by the allegations.Earlier this month, Murphy’s spokesman said his office received a separate accusation on Thursday against Alvarez. The accusation, which was referred to the New Jersey attorney general’s office, concerned an incident that allegedly occurred in 1999 or 2000, the spokesman said. Neither Mr. Alvarez nor his attorney responded to a request for comment on the allegation.For all the attention given to allegations of sexual assault in recent months, they remain difficult for the criminal-justice system. Such crimes often produce no conclusive evidence, making them hard to investigate and prosecute. Conflicting accounts can be the only material officials have to work with. Prosecutors tend to decline to pursue cases deemed unlikely to win a conviction.That can leave accusers feeling they are denied justice. The accused, meanwhile, can still experience life-altering impacts from the allegations alone, including a damaged career and stained reputation.Criminal-justice officials are now considering new ideas about how to handle such cases. More than a dozen states have passed legislation in the past two years aimed at improving the handling and testing of rape kits, according to the National Conference of State Legislatures. Proposals to broaden the legal definition of sex crimes, and to lengthen or eliminate the statute of limitations for sexual assault have passed or are pending in legislatures across the country.New training programs for police and prosecutors working on assault cases also are being rolled out, including in Alaska and Illinois.The governor’s spokesman said the Murphys didn’t find out that Ms. Brennan had accused Mr. Alvarez of sexual assault until the first week of October, when The Journal contacted the administration for comment. In a joint statement, Gov. Murphy and Ms. Murphy said they had asked the director of the Statewide Division of Equal Employment Opportunity and Affirmative Action to review how the state handles allegations of sexual misconduct.“We are confident that this allegation was handled appropriately by the administration and that policies and procedures were properly and promptly followed. However, it is clear that the process during the transition was inconsistent with our values, and the hire should not have happened,” the Murphys said. “We must now ask: how can we hold ourselves to a higher standard moving forward?”This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}