{"id": "Protests in Ireland after thong underwear cited as sign of consent in rape trial", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Protests erupted in Ireland after thong underwear was cited as a sign of consent in a controversial rape trial.Protests erupted in Ireland this week after thong underwear was cited as a sign of consent in a rape trial.On Saturday, a 27-year-old man was unanimously found not guilty by a jury of raping a 17-year-old woman, NPR reported. The decision sparked anger in the country.During the trial at the Cork Central Criminal Court, defense attorney Elizabeth O’Connell said in her closing address that the accuser wore a pair of lacy underwear.\"Does the evidence out-rule the possibility that she was attracted to the defendant and was open to meeting someone and being with someone? You have to look at the way she was dressed,\" O'Connell said, according to the Irish Examiner. \"She was wearing a thong with a lace front.\"IRELAND VOTERS REPEAL ABORTION BAN AS PRIME MINISTER HAILS ‘QUIET REVOLUTION’The underwear in question was shown to jurors, AFP reported.Protests took place in Dublin, Cork and Belfast in Northern Ireland. Women and men held signs with thong underwear on them with the hashtag “#ThisIsNotConsent.”Irish lawmakers have also commented on the case, including the country's prime minister, Leo Varadkar.\"Nobody asks to be raped. And it's never the victim's fault. It doesn't matter what you wear, it doesn't matter where you went, who you went with, or what you took — whether it was drugs or alcohol,” Varadkar said.Ruth Coppinger, a deputy in Ireland’s parliament, took a pair of thong underwear from her sleeve on Tuesday as she spoke to people in parliament.PASSENGER ARRESTED FOR VERBAL ASSAULT OF AIR INDIA CREW IS PROMINENT ANTI-ISRAEL BOYCOTT LEADER\"It might seem embarrassing to show a pair of thongs in this incongruous setting,\" she said. \"But the reason I'm doing it -- how do you think a rape victim or a woman feels at the incongruous setting of her underwear being shown in a court?\" she continued.Coppinger said fake tans and clothes have been used in a courtroom to “discredit women who have the bravery to go to court.”The government is reviewing \"rape trial procedures.\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}