{"id": "Rights commission expresses deep concern about Brazil", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Margarette May Macaulay, president of the Inter-American Commission on Human Rights, listens to a question during a press conference, in Rio de Janeiro, Brazil, Monday, Nov. 12, 2018. A delegation of the Inter-American Commission on Human Rights visited Brazil from November 5 to 12 to monitor the enforcement of human rights in eight states. (AP Photo/Silvia Izquierdo)Monica Benicio, widow of slain councilwoman Marielle Franco, asks a question during a press conference held by the Inter-American Commission on Human Rights, in Rio de Janeiro, Brazil, Monday, Nov. 12, 2018. A delegation of the Inter-American Commission on Human Rights visited Brazil from November 5 to 12 to monitor the enforcement of human rights in eight states. (AP Photo/Silvia Izquierdo)RIO DE JANEIRO – The Inter-American Commission on Human Rights expressed deep concern over human rights in Brazil on Monday, saying it will monitor what happens when the government of President-elect Jair Bolsonaro assumes office Jan. 1.After a one-week visit to eight states in Latin America's biggest country, the commission released a report highlighting violence suffered by indigenous people, the growing exclusion of those living on the streets, threats against freedom of expression, the vulnerability of minorities, and a culture of impunity among police.\"Killings committed by security forces must end. They must protect people, not kill them,\" the commission's president, Margarette May Macaulay, said at news conference. \"The focus must be on the protection of life.\"In 2017, an estimated 5,012 people were killed by police, which represents a 19 percent increase from the previous year. Brazil is one of the countries with the highest homicide rates in the world, with 30.8 violent deaths per 100,000 inhabitants.Urrejola also said Brazil is a country where \"intolerance and hate speech affect the freedom of expression, protests and meetings of LGBTI communities, women, Afro-descendants and indigenous peoples.\"During their visit, commission members met with members of the current government of President Michel Temer, in addition to social organizations and activists. They did not meet with anyone from Bolsonaro's future team.\"If there had been any interest, we were available,\" the report said.Brazilian officials did not make any immediate comment about the commission's report.But advisers to Bolsonaro, a far-right former army captain, in the past have had harsh words for the commission, which is a permanent body of the Washington-based Organization of American States.Gustavo Bebbiano, an incoming Cabinet member, has called the commission \"leftist\" and said it has \"zero credibility.\"The report expressed veiled criticism at some of the core proposals of Bolsonaro's government, including its hardline approach to security and its campaign promise to institute greater legal protections for police officers who commit crimes.\"Experience shows that the escalation of 'zero tolerance' speech strengthens the risk of higher numbers of extrajudicial executions,\" said, Antonia Urrejola, a member of the commission.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}