{"id": "North Carolina woman seen in viral racist rant faces 911 violation charge", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Susan Westwood, 51, reportedly turned herself in to police in Sunset Beach, Nort Carolina on Saturday after she was seen ranting racist remarks in a viral video.\n          (Brunswick County Sheriff's Office)A woman who was captured on video spouting off racist remarks to two black women who were having car trouble in a North Carolina parking lot reportedly turned herself in to police on Saturday.Susan Westwood, 51, contacted the Sunset Beach Police Department and was subsequently served by the Brunswick County Sheriff's Department with an outstanding misdemeanor warrant and four criminal summonses, WBTV reported.Law enforcement officials had issued a warrant for Westwood — dubbed \"South Park Susan\" — and released the two calls she made to 911 on Oct. 19. They said she misused the emergency line system when she reported sisters Leia and Mary Garris to police.The Garris sisters were waiting for AAA in an apartment complex parking lot in Charlotte when Westwood confronted them, asking where they lived because she didn't recognize them.In the 911 calls released by police and published by the news station, Westwood was heard identifying the women to police as \"African-American\" and saying, \"they've been hanging out here for a while, and they've been photographing me.\"BLACK BABYSITTER FOR WHITE KIDS FELT 'CRIMINALIZED' AFTER WHITE WOMAN CALLED COPS, HE SAYSAn emergency dispatcher was heard telling Westwood that first responders received a call about someone's car breaking down at the location Westwood indicated. Westwood, in response, said the situation was \"weird\" and she was \"concerned.\" She added that \"there's no car broken down, there's somebody trying to cause problems.\"\"No one breaks their car down in the best part of society. I'm sorry to have to do that out loud, but nobody breaks their car down here on purpose unless they're looking for money,\" Westwood told the dispatcher. \"They don't belong here.\"Westwood adds she'd pay \"$2,500 to get them out of here. ... Just get them the f--- out of here right now.\"One of the sisters, in her call to 911, was heard telling police: “The lady was pushing me in my face, and I’m a resident here just like she is. It surprised me, I’ve been living here for over a year and I’ve never been treated this way.\"A video filmed during the encounter showed Westwood saying, \"Hi, how are you? I'm hot and I'm beautiful. I'm 51. What are we going to talk about tonight? Being hot? Being beautiful? Being white?\" The woman was also heard asking if she needed to bring her concealed weapons, and mentioning that she made \"$125,000 a year.\"Westwood's employer, Charter Communications, told WSOC-TV that Westwood was fired, as the incident was \"a blatant violation of Charter's code of conduct and clearly disregards the company's commitment to inclusion and respectful behavior.\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}