{"id": "Neil Armstrong's Apollo 11 spacecraft ID plate sells for $468G in auction", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Heritage Auctions recently sold astronaut Neil Armstrong's personal collection of memorabilia from the Apollo 11 moon landing for hundreds of thousands of dollars.Neil Armstrong’s personal collection of memorabilia has taken flight.Collectibles that belonged to the first man to set foot on the moon were sold in a recent auction held by the Dallas-based auction house Heritage Auctions.The company held its “Space Collection Signature Auction” from Thursday to Saturday, which included items from the Armstrong Family Collection.Heritage Auctions says his spacecraft ID plate from Apollo 11’s lunar module Eagle went for $468,500 -- making it the highest-selling item.The company offered details about the item in an online listing.“Three of these Lunar Module-5 Identification Plates were flown to the moon on Apollo 11 and returned to Grumman Aircraft Engineering Corp,” Heritage Auctions explained. “They then mounted each ID plate on a wall plaque and one was presented to each crewmember.”ELON MUSK SAYS HE 'LIKES THE IDEA' OF TRUMP'S SPACE FORCEArmstrong, who died in 2012, was joined on the Apollo 11 mission in July 1969 by astronauts Michael Collins and Buzz Aldrin.A U.S. flag that the astronaut took with him to the moon, meanwhile, went for $275,000.Memorabilia that belonged to Armstrong that wasn’t part of the famous mission was also featured in the auction.NASA IS TEAMING UP WITH A CALIFORNIA SHOE COMPANY TO COMMEMORATE ITS 60TH ANNIVERSARYOne of those items -- the flight suit Armstrong wore aboard Gemini 8, the 1966 mission that performed the first docking of two spacecraft in flight -- brought the astronaut's family $109,375.Another, Armstrong's 1970 Hasselblad 500C camera, was sold for $25,000, per the auction house.“The entire total sale brought more than $7.4 million,” Eric Bradley, the director of public relations for Heritage Auctions, told Fox News in an email. “Just the Armstrong items alone brought more than $5.2 million.”Fans will be able to bid on more of Armstrong's items in two auctions slated to take place in May and November 2019, the auction house said in July.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}