{"id": "Twitter removed over 10,000 bots that pretended to be Democrats, tried to discourage voting", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Torrent of criticism can be brutal.Twitter deleted more than 10,000 automated accounts that were posing as Democrats and posting messages to discourage people from voting during this coming Tuesday's midterm elections after the party flagged the tweets to the social platform, Fox News has confirmed.The accounts were removed after the Democratic Congressional Campaign Committee (DCCC) called attention to them, according to Reuters, which first reported the news.\"For the election this year we have established open lines of communication and direct, easy escalation paths for state election officials, DHS, and campaign organizations from both major parties. Our singular goal is to enforce our policies vigorously and protect conversational health on our service. We removed a series of accounts for engaging in attempts to share disinformation in an automated fashion — a violation of our policies. We stopped this quickly and at its source,\" a Twitter spokesperson told Fox News.The number of accounts is relatively small when compared with the millions of accounts Twitter deleted that were said to be spreading disinformation during the 2016 presidential campaign.The tweets included ones that discouraged Democratic men from voting, saying that would drown out the voice of women, two of the sources familiar with the flagging operation told Reuters.DID 280 CHARACTERS MAKE TWITTER MORE CIVIL?Twitter has taken a more aggressive approach to battle disinformation and hate speech since 2016.On Oct. 31, Twitter updated part of its reporting process, allowing users to say \"the account tweeting this is fake\" when they flag a tweet as suspicious or spam.Even so, despite the existence of numerous websites that claim to track the activity of bots, Yoel Roth, Twitter's head of site integrity, recently said those sites' findings are based on probability, not fact.\n      Twitter CEO Jack Dorsey is seen at the New York Stock Exchange.\n      (AP)According to Roth, the lack of understanding about what constitutes a bot contributes to \"fear, uncertainty and distrust.\"\"When we talk about bots, we mean accounts engaged in platform manipulation and spam,\" Roth tweeted, adding that even then, identifying bots with only public data is difficult. \"We've seen bot detectors and dashboards created by commercial entities, which claim conversations are full of bots, seemingly in an effort to boost their own business models.\"FACING IPHONE TROUBLES, APPLE TRIES TO CHANGE THE STORYIndeed, even the founder of one of the most cited dashboards to monitor Russian bots, Hamilton 68, has called the narrative about the bots \"overdone.\"The other issue, according to Roth, is that some supposedly bot-like behavior, such as a very high number of retweets, actually could be a regular non-bot human user who is enthusiastic about certain topics.\"We continue to be committed to enabling academic research, at scale, using Twitter data. Our policies are written to support this work — including when the results are unflattering to Twitter,\" Roth wrote.He added: \"However, we believe that to protect our efforts promoting healthy public conversations, there’s a need to speak up here — a lot of this “bot research” is not peer reviewed and not reflective of the facts on any level.\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}