{"id": "Greece: Police, anarchists mark 1973 uprising with clashes", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Riot policemen try to avoid petrol bombs thrown by hooded youths during clashes in the Athens neighborhood of Exarchia, a haven for extreme leftists and anarchists, Saturday, Nov. 17, 2018. Clashes have broken out between police and anarchists in central Athens on the 45th anniversary of a student uprising against Greece's then-ruling military regime. (AP Photo/Yorgos Karahalis)A riot policeman raises his hands up as a petrol bomb explodes near to him during clashes in the Athens neighborhood of Exarchia, a haven for extreme leftists and anarchists, Saturday, Nov. 17, 2018. Clashes have broken out between police and anarchists in central Athens on the 45th anniversary of a student uprising against Greece's then-ruling military regime. (AP Photo/Yorgos Karahalis)ATHENS, Greece – A march to the U.S. Embassy in Greece held Saturday for the anniversary of a fatally suppressed 1973 student uprising was mostly peaceful, while police officers and anarchists clashed in Athens and the next two next largest cities long after dark.About 6,000 extra police officers were on hand to monitor the march from the university site of the uprising, the National Technical University of Athens, to the embassy. The military dictatorship that ruled Greece at the time violently put down the uprising, and many Greeks accuse the United States of supporting the 1967-74 regime.In the end, most of the trouble happened elsewhere.Police said a group of about 300 agitators in the capital erected barricades and threw firebombs and rocks at officers, who responded with tear gas and stun grenades.In Thessaloniki, Greece's second-largest city, officers faced off with about 200 anarchists threw an intense barrage of firebombs. At least ten people were detained. Another five people were detained in Patras after an unknown number of assailants attacked officers, police said.About 15,000 people participated in the march held earlier to observe the 45th anniversary of the student rebellion. The precise number of deaths in the uprising is unknown. Estimates range from 18-40.While the event went off relatively trouble-free, government ministers and other marchers representing Greece's ruling Syriza party had plastic bottles and coffee cups thrown at them outside the embassy.And in an indication of what would come later, a group that marched past the embassy attacked officers at a subway station across from Athens police headquarters, authorities said. Eight suspects were detained, police said.Two more were detained outside the university, also known as the Polytechnic.Municipal workers had removed the trash cans that demonstrators often use as makeshift barricades, so desks and other furniture were brought out from the university in their place. Others climbed onto rooftops inside the Polytechnic complex and threw Molotov cocktails and rocks on officers.Police brought a water cannon to the scene, but used it to put out fires because firetrucks would not approach the area.____Costas Kantouris reported from Thessaloniki.___Follow Kantouris on Twitter: https://twitter.com/CostasKantourisThis material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}