{"id": "Israel holds municipal votes as Jerusalem chooses new mayor", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    An Ultra-Orthodox Jewish man stands at the headquarter of of municipal candidate Yossi Daitch during the municipal elections in Jerusalem, Tuesday, Oct. 30, 2018. Israelis are voting in for municipal elections across the country. In the closest watched race Tuesday, four candidates are hoping to become the next mayor of Jerusalem. Posters read in Hebrew; \"Yossi Daitch, Jerusalemite at heart\". (AP Photo/Oded Balilty)An Ultra-Orthodox Jewish prays at the headquarter of of municipal candidate Yossi Daitch during the municipal elections in Jerusalem, Tuesday, Oct. 30, 2018. Israelis are voting in for municipal elections across the country. In the closest watched race Tuesday, four candidates are hoping to become the next mayor of Jerusalem. Posters read in Hebrew; \"Yossi Daitch, Jerusalemite at heart\". (AP Photo/Oded Balilty)JERUSALEM – Israelis voted in municipal elections across the country Tuesday, with a closely watched race in Jerusalem — a city with great importance to billions of people around the world.Just over 55 percent of eligible voters turned out nationwide before polls closed, but in Jerusalem only 35 percent cast ballots in a close mayoral contest.Jerusalem is a diverse city, with a Jewish population divided between secular residents, modern Orthodox and ultra-Orthodox. In addition, about one-third of the population is Palestinian.Few Palestinians vote, however, seeing participation as recognition of Israeli control over east Jerusalem, which Israel captured in the 1967 war and annexed in a move not recognized internationally. In a rare move, a Palestinian from east Jerusalem sought a seat on the city council, but it was unclear whether he would win enough votes.Final results were not expected until early Wednesday.The Jerusalem mayor's post was contested by Ofer Berkovitch, a young secular activist; veteran political activist Moshe Lion; Cabinet minister Zeev Elkin, who was supported by Prime Minister Benjamin Netanyahu; ultra-Orthodox candidate Yossi Daitch; and Avi Salman, a former aide to outgoing Mayor Nir Barkat.If no one wins at least 40 percent of the votes, the top two finishers will advance to a runoff.Tuesday's vote also featured the first municipal elections in Druze villages in the Golan Heights, which Israel captured from Syria in 1967 and later annexed. Voter turnout in the four communities was very low. Police dispersed Druze protesters who disrupted voting in the largest town, Majdal Shams.The Arabic-speaking Druze community adheres to a secretive offshoot of Islam. Many Druze, especially the older generation, remain loyal to Syria and dream of returning to Syrian control one day. The younger generation includes Druze who are much more integrated into Israeli life, or at least pragmatically believe that closer ties with Israel can improve their daily lives.The Syrian Foreign Ministry protested the elections in letters to the U.N. secretary-general and the Security Council president, calling the elections an \"attempt to pass their Judaization, settlement, and racist schemes,\" according to the Syrian state news agency.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}