{"id": "CNN President Jeff Zucker rips Trump, Sarah Sanders after explosive device received", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          CNN President Jeff Zucker issued a statement condemning White House officials after an explosive device was sent to the network's New York City headquarters.\n          (REUTERS, File)Hours after CNN's New York City headquarters were evacuated over an explosive device Wednesday, the network's president, Jeff Zucker, issued a statement condemning President Trump and White House Press Secretary Sarah Sanders, saying they \"should understand their words matter.\"Zucker decried what he called the administration’s “continued attacks on the media.”The statement continued: “The President, and especially the White House Press Secretary, should understand their words matter. Thus far, they have shown no comprehension of that.”Police say an envelope containing a live explosive and “some kind” of white powder was sent to the network’s headquarters at the Time Warner Center in midtown Manhattan forcing an evacuation.Similar packages were intercepted en route to the homes of former President Barack Obama and former Secretary of State Hillary Clinton. Another package arrived at a Florida office of Rep. Debbie Wasserman Schultz, the former head of the Democratic National Committee. And, a similar package arrived at the home of Democratic megadonor George Soros earlier this week.U.S. Capitol Police also were investigating a suspicious package addressed to Rep. Maxine Waters, D-Calif., at the Capitol Hill mail screening facility.  FBI IDENTIFIES 5 'SUSPICIOUS PACKAGES' CONTAINING 'POTENTIALLY DESTRUCTIVE DEVICES'A law enforcement official told Fox News that many of the devices have a similar packaging and labeling, leading them to believe a single person or group could be behind the threats. Trump responded to news of the devices earlier, saying “the safety of the American people is my highest and absolute priority.”PELOSI, SCHUMER SLAM TRUMP, CLAIM HIS WORDS CALLING FOR UNITY 'RING HOLLOW'“The full weight of government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice,” he continued. Sanders and Vice President Mike Pence also took to Twitter to condemn the threats. Fox News Samuel Chamberlain, Catherine Herridge and John Roberts contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}