{"id": "911 logs tell grim tale of Wisconsin teen Jayme Closs' disappearance and parents' murder", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Hundreds of tips but no suspects in the search for 13-year-old Jayme Closs; Matt Finn reports from outside the Closs house in Barron, Wisconsin.Details from a dispatcher’s call log released Friday by the Barron County Sheriff’s Department paint a clear and chilling picture of the early-morning shooting deaths of Denise and James Closs, parents of vanished Wisconsin teen Jayme Closs. Jayme, 13, of Barron, Wisconsin, was inside the family home when both parents were fatally shot. She had disappeared. by the time police arrived. According to the log, Jayme disappeared in four minutes' time.Monday, Oct. 15, 12:53 a.m.The chilling chain of events first unfolded at 12:53 a.m. with a single 911 hangup call, according to the new log. A dispatcher traced the call for help to 46-year-old Denise Closs’ cellphone, sending crews to the home. The log says the dispatcher heard yelling, but the caller didn’t speak. She sent three different Barron police officers on the graveyard shift. The first officer arrived at 1 a.m. — just over four minutes from the time of dispatch.\n      Barron County Sheriff’s Department in Barron.  (Madelin Fuerste)\n      12:56 a.m.“RECEIVED A 911 CALL FROM XXX-XXX-XXXX AND COULD HEAR A LOT OF YELLING. CALLED NUMBER BACK AND WAS UNABLE TO LEAVE A VOICEMAIL. PHONE PINGED TO THE ABOVE ADDRESS. ADVISED 317, 325, & 329.”With Denise Closs’ phone number identified, the dispatcher made more attempts to call the number back, to no avail. She also tries to call the Closs residence directly. The log said the phone was disconnected.1:03 a.m.From the Closs home, officers first advised dispatch of a possible suicide attempt. The call was entered into the logs as such, and officers requested EMTs.At 1:05 a.m., officers on scene relayed the first details from the scene within five minutes of arrival. They  did not yet appear to know that Denise Closs had been fatally shot.“325 ADVISED ONE MALE DOWN, MULTIPLE ROUNDS SPENT. REQUESTED THAT ADMIN BE NOTIFIED.”1:06 a.m.“...ADVISED THE DOOR HAS BEEN KICKED IN. ADVISED THAT THE MALE WHO IS DOWN HAD ANSWERED THE DOOR. UNKNOWN IF ANYONE IS MISSING.”By 1:11 a.m., some five minutes after a wounded James Closs answered the door, according to the log, officers indicated both James and Denise were down and unresponsive. Following their autopsies Barron County Sheriff Chris Fitzgerald confirmed that the couple were fatally shot; their deaths were classified as homicides.1:11 a.m.“317 ADVISED TWO SUBJECTS DOWN”1:19 a.m.“317 ADVISED THAT 501 RESPOND TO THE SCENE FOR TWO SUBJECTS DOWN, UNRESPONSIVE.”About 3:05 a.m., the Barron County 911 call log was changed to reflect the double homicide. (Following their autopsies, Barron County Sheriff Chris Fitzgerald confirmed that the couple were fatally shot; their deaths were classified as homicides.)The log made no mention of Jayme Closs’ disappearance until 3:57 a.m. Dispatch recorded a note using just her initials.3:57 a.m.“ENTERED JLC AS A MISSING JUVENILLE.”Another key entry revealed what officers learned as they combed the Closs home for clues and important details — that Jayme Closs was not in the home when officers arrived, nor was she located during their search. At 5:13 am, dispatchers blasted out the call to area law enforcement agencies that Jayme was to be considered a “Missing Endangered Child,” who was abducted from her family home. Police have not been able to issue a suspect or a vehicle description due to a lack of information. A gun was not found at the scene.Jayme remained missing six days after gunshots killed her parents in the middle of the night. She tops the FBI missing person’s list and is the subject of a nationwide search. This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}