{"id": "Khashoggi death account not ‘credible,’ lawmakers across aisle say", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Prosecutors say 18 Saudis are being held as suspects in columnist Jamal Khashoggi's death, Royal court adviser Saud al-Qahtani and deputy intelligence chief Ahmed Asiri have been fired; Benjamin Hall reports from Istanbul.Lawmakers on both sides of the aisle were fired up by Friday’s report that Jamal Khashoggi, the activist and writer who disappeared after entering the Saudi Consulate in Turkey earlier this month, had been killed in a fight, as reported by Saudi state media.Democrats and Republicans alike questioned the reported details of his death. It was said to have been preceded by “a brawl and a physical altercation” that erupted after “discussions between citizen Jamal Khashoggi and those who met him while he was in the Saudi Consulate in Istanbul,” Saudi Arabia’s attorney general said in a statement, according to The Wall Street Journal.State media also quoted prosecutors as saying 18 Saudi nationals were being held on suspicion of being involved in the Washington Post columnist's death.Rep. Adam Schiff, D-Calif., and Sen. Elizabeth Warren, D-Mass., both cast doubt on the findings, with Warren urging President Trump to react accordingly and not push \"their propaganda.\"“Saudi Arabia has had 2 weeks to get its story straight about the death of journalist Jamal Khashoggi, and ‘a fistfight that led to his death’ was the best they could do?” Warren tweeted. “@realDonaldTrump should be holding the Saudis accountable – not pushing their propaganda.”JAMAL KHASHOGGI, MISSING ACTIVIST AND WRITER, KILLED IN FIGHT, SAUDI STATE MEDIA REPORTSSchiff also took to social media, tweeting that “the claim” was “not at all credible.” He added that if Khashoggi “was fighting with those sent to capture or kill him, it was for his life.“The Kingdom must be held to account. If Administration doesn’t lead, Congress must,” he continued.The president, who addressed Khashoggi’s death Friday while attending a roundtable in Arizona, said that Saudi Arabia’s announcement of arrests was a “good first step,” and that he planned to collaborate with Congress on what the U.S. response should be.When a reporter asked whether he believed the details of Khashoggi’s death to be credible, Trump replied: “I do. I do.” He added that he wanted to speak with Saudi Crown Prince Mohammed bin Salman before making any decisions.“Saudi Arabia has been a great ally, but what happened is unacceptable,” Trump said. Regarding the arrests, he said, “It's a big first step. It's only a first step, but it's a big first step.”CONGRESS FACES TOUGH CHOICES ON SAUDI ARABIA IN WAKE OF KHASHOGGI KILLINGRepublican Sen. Lindsey Graham of South Carolina also offered an impassioned response to the Khashoggi news, tweeting that to describe him as being “skeptical of the new Saudi narrative about Mr. Khashoggi is an understatement.\"“First we were told Mr. Khashoggi supposedly left the consulate and there was blanket denial of any Saudi involvement. Now, a fight breaks out and he’s killed in the consulate, all without knowledge of Crown Prince,” he tweeted. “It’s hard to find this latest ‘explanation’ as credible.”Graham has made earlier fiery statements on Khashoggi’s disappearance as well, saying on “Fox & Friends” that he wanted to see the crown prince, who he described as being “toxic,” forced out of his position.“This guy has got to go,” Graham said. “Saudi Arabia, if you’re listening: There are a lot of good people you can choose, but MBS has tainted your country and tainted himself.”Khashoggi had written critically about Mohammed bin Salman for The Washington Post.CASTRO SLAMMED FOR ‘SLANDEROUS’ LIE AFTER SUGGESTING KUSHNER MAY HAVE ORCHESTRATED KHASHOGGI MURDERSen. Rand Paul, R-Ky., echoed other lawmakers' doubts about the fistfight scenario, saying that “the so-called ‘explanation’ from the Saudis is not even close to credible.”\"What they did was unacceptable and I call on my colleagues in Congress to join me in denouncing their behavior and changing how we treat them,” he tweeted.Sen. Patrick Leahy, D-Vt., also issued a statement on Twitter, saying “If ever a story reeked of a coverup, it is this one.”“It’s taken nearly three weeks for the Saudis to even admit that an American resident and journalist died in the Saudis’ own consulate. And throughout this ordeal, the only urgency apparent in our President’s handling of this crisis has been a compulsion to buy time for the Saudis to construct a story to protect the royal family,” the statement said. “The American people need and deserve to know what the White House and our intelligence professionals know. Our country must not be complicit in this coverup.”Republican Sen. Bob Corker of Tennessee tweeted that details surrounding Khashoggi’s disappearance have varied over time, and he urged Trump’s administration to decide on its own who should be held responsible.Fox News’ Matt Richardson, Alex Pappas and The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}