{"id": "Author Stephen King asks Iowans to vote against Steve King, calls GOP congressman 'racist dumbbell'", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          With Iowa Republican Rep. Steve King, right, engulfed in controversy, author Stephen King took to social media over the weekend to try to distance himself from the congressman.\n          (Getty Images / Congressman Steve King, File)Horror author Stephen King is scared.Scared that people will mistake him for controversial Iowa Rep. Steve King.With the Republican congressman engulfed in controversy over his past support of groups holding white-supremacist viewpoints, the author took to social media over the weekend to try distancing himself from the politician with the similar name, and to give Iowans some advice for when they head to the polls on Tuesday.“Iowans, for personal reasons I hope you’ll vote Steve King out,” King, the writer, tweeted. “I’m tired of being confused with this racist dumbbell.”The congressman's office did not immediately respond to Fox News' request for comment.The Iowa Republican has been quietly riding out the closing days of a re-election campaign against Democrat J.D. Scholten, although some of his old statements and tweets generated new controversy for their anti-immigration messages in the wake of the Pittsburgh synagogue shooting last weekend. The congressman fought back against any comparisons to the gunman, kicking out a man from an Iowa event after he said the politician and the gunman \"both share an ideology that is fundamentally anti-immigration,\" as the Pittsburgh Post-Gazette reported.King was once seen as easily winning reelection, but that has been thrown into jeopardy in the last week amid condemnation from many Republican leaders and the announcement by a number of companies that they no longer would contribute to his campaign.CLICK FOR COMPLETE FOX NEWS 2018 MIDTERMS COVERAGEThe Iowa lawmaker also has been slammed for speaking last summer to a publication linked to Austria's Nazi-founded Freedom Party -- and saying, among other things, that diversity was \"not a strength.\"Defending his interactions with the group, the congressman said it ousted former Nazis decades ago, aside from one with “a little youthful affiliation.” The party's current leader, Heinz-Christian Strache, reportedly was involved in neo-Nazi groups when he was younger.TWITTER: WE REMOVED OVER 10,000 BOTS THAT PRETENDED TO BE DEMOCRATS, TRIED TO DISCOURAGE VOTINGOn the opposite side of aisle, Stephen King has been a frequent critic of President Trump and Republicans.The Associated Press contributed to this report. This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}