{"id": "The Latest: Honduran migrant says he wants to return home", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    A group of Central American migrants gather in the central park of Ciudad Hidlago, Mexico, Saturday, Oct. 20, 2018. Mexican authorities for a second straight day refused mass entry to a caravan of Central American migrants held up at the border with Guatemala, but began accepting small groups for asylum processing and gave out some 45-day visitor permits that would theoretically allow recipients time to reach the United States. (AP Photo/Oliver de Ros)A child is carried over the border fence as thousands of Honduran migrants rush across the border towards Mexico, in Tecun Uman, Guatemala, Friday, Oct. 19, 2018. Migrants broke down the gates at the border crossing and began streaming toward a bridge into Mexico. After arriving at the tall, yellow metal fence some clambered atop it and on U.S.-donated military jeeps. Young men began violently tugging on the barrier and finally succeeded in tearing it down. (AP Photo/Oliver de Ros)TECUN UMAN, Guatemala – The Latest on a caravan of Central American migrants hoping to reach the United States (all times local):9:20 p.m.Migrant Gonzalo Martinez says he is voluntarily returning to Honduras from a bridge connecting Guatemala and Mexico because he was disappointed in the unruliness of caravan members and just wanted to head home.\"We thought the caravan was passive but there were unruly people, I was disappointed,\" said the 37-year-old farmer as he boarded a bus in Tecun Uman, Guatemala to take him back to Honduras.Martinez was referring to the clashes with police when migrants forced their way through a Guatemalan border fence and some then tried to get into Mexico, only to be prevented by Mexican police.He said he was trying to migrate from the province of Lempira to the United States because of the violence in Honduras.\"They killed some relatives; they shot my father and they also tried to kill me,\" he said, adding that the roughly $4 he earns in daily wages is not enough to feed his family of seven.Martinez was one of more than 500 Honduran migrants who voluntarily returned to their country.___5:30 p.m.About 2,000 Central American migrants who crossed a river from Guatemala into Mexico have voted in a show of hands to re-form their caravan and continue their march northward.The migrants in question crossed the river without registering unlike others who were processed by Mexican immigration officials at a border bridge.Rodrigo Abeja is one of the caravan's leaders. He says that tomorrow morning they will move on toward the city of Tapachula.In his words, \"We don't yet know if we will make it to the (U.S.) border, but we are going to keep going as far as we can.\"The migrants gathered in a park on the Mexican side of the river are shouting \"Let's all walk together!\" and \"Yes we can!\"Some of them are marching to the bridge to urge those still there to join them.___5:10 p.m.Mexico's governmental National Human Rights Commission says it has been working to guarantee the rights of migrants in a mass caravan that stalled at the country's southern border with Guatemala.The commission says in a statement that its agents have been providing bottled water and medical care for minor injuries as a result of falls, scuffles, tear gas and anxiety after the migrants were blocked by police on Friday.It says it has treated nine children; 18 women, two of them pregnant; six men; police officers who were hurt in the clash; and a reporter from Quadratin Noticias who was also injured.Commission personnel are providing legal advice to migrants, including procedures for making refugee applications.Still, it says there has been no confirmation regarding the migratory status of people who have been taken to a provisional shelter. The commission urges authorities to provide that.___4:40 p.m.By Saturday afternoon the Guatemala-to-Mexico border bridge where thousands of migrants spent the night after being blocked from passing by Mexican police is considerably emptier.Lots have opted to cross the Suchiate River to Mexican soil by wading, swimming or on rafts operated by local residents charging the equivalent of about $1.25. Others have applied for refuge and been allowed to pass in small groups.Many of those remaining on the bridge are women, children, elderly people. As kids scamper around and play, the adults are sitting on curbs and wondering, What next?There are numerous mounds of trash and cast-off clothing.Carlos Martinez is a 24-year-old man from Santa Barbara, Honduras. Locals from the Guatemalan side brought food for the migrants, and the plate of chicken with rice was the first bite to eat he'd had all day.Martinez called the donated food \"a blessing\" that gives him courage \"to keep waiting, as long as I can.\"Another group prayed to God for passage into Mexican territory.___1:15 p.m.Mexican authorities have allowed a second group of about 45 migrants to be processed at the border with Guatemala.They have also started giving some people 45-day visitor's permits, which in theory could allow them time to reach the U.S. border. Other migrants have been applying for refugee status in Mexico.Once they're processed, the migrants are being bused to an open-air, metal-roofed fairground in the city of Tapachula. There, the Red Cross is setting up small blue tents on the concrete floor.At least three women have fainted at the processing center just beyond the gates. The bridge is crowded, and whenever a small side gate opens to receive migrants, there is a desperate crush of bodies that push forward in the heat.People at the gate are clamoring: \"Please let us in, we want to work.\"Under the bridge a raft loaded with about 10 migrants crossed to the Mexican side. About a dozen other migrants swam across. None were apparently detained despite the presence of hundreds of police lining the bridge.__11:50 a.m.Many Central Americans in a mass caravan at the Mexican border with Guatemala appear inclined to apply for any kind of refugee status in Mexico, even though most initially intended to make it to the United States.Twenty-year-old Scarleth Cruz says she is going to apply for political asylum in Mexico because of threats and repression she faced back home in Honduras from the governing party of President Juan Orlando Hernandez.She said: \"Why would I want to go to the United States if I'm going to be persecuted\" there as well.Hondurans have also cited poverty and gang threats as their reasons for joining the mass caravan.Hector Aguilar is a 49-year-old sales manager who worked as a taxi driver in Yoro province to feed his four children. Aguilar says he had to pay the two main gangs there protection money in order to work. On Thursdays he gave the 18th Street gang the equivalent of $12.50, and on Saturdays he gave the same amount to MS-13. That's a significant amount in low-wage Honduras.On Saturday, Mexican agents unlocked a small side gate and allowed a group of about 40 migrants through for processing.In the heat and crush of bodies, one woman fainted and was carried to the Mexican side in the arms of rescuers.___11:10 a.m.Mexican officials are refusing to yield to demands from a caravan of Central American migrants that they be allowed to enter the country en masse from a border bridge with Guatemala where they camped out overnight.Officials announced they would hand out numbers to those waiting to cross and allow them to enter in small groups.It's a strategy similar to what's been seen in U.S. border cities when they became overwhelmed by large numbers of migrants.Those on the bridge watched with desperation Saturday as workers began erecting tall steel riot barriers.Twenty-year-old Scarleth Cruz hoisted a crying, sweat-soaked baby girl above the crowd. She cried out: \"This girl is suffocating.\"Some tore open a fence on the Guatemala side of the bridge and threw two young children, perhaps age 6 or 7, and their mother into the Suchiate River about 40 feet below. They were taken safely on a raft to Mexican territory.___8:50 a.m.Organizers of a caravan of migrants trying to cross into Mexico and ultimately the U.S. appear intent on avoiding a repeat of a rush on the border with Guatemala that ended when Mexican security forces with riot shields and pepper spray drove them back.Some women and children made their way toward the front of the caravan Saturday, while men were at the back.They have also moved about 30 feet (9 meters) back from the gate that separates them from Mexican police to establish a buffer zone. They had broken through the gate Friday but police drove nearly all of them back.About 1,000 migrants now remain on the bridge between Guatemala and Mexico.Selvin Flores, a 35-year-old shopkeeper from the Honduran city of Nacaome, says people who \"were causing disorder\" have been expelled from the group and handed over to Guatemalan police. He says the remaining migrants \"do not want misunderstandings.\"Flores has three children and says that he sometimes skips meals to ensure that they eat.He said he wants to reach the U.S. to work and save money before returning to Honduras. He says it's painful for him to leave his country but he did it \"out of necessity.\"___7:30 a.m.Thousands of Central American migrants participating in a caravan heading toward the United States woke up on a bridge that divides the borders of Guatemala and Mexico.The migrants have no fresh supplies of water or food and slept amid garbage that has piled up at the crossing. Without bathrooms, a foul odor wafted through the air.Jose Yanez woke up at 5 a.m. and said that his back hurt.The 25-year-old farmer had no blanket to fend off the chill, but vowed to continue on.\"From here, we're going on. From here, there's no turning back,\" he said.He said that he makes 150 lempiras a day, or about $6, and has no work benefits.On the Mexican side of the border, a group of about 30 migrants sang the national anthem of Honduras.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}