{"id": "How a museum became a beacon of reconciliation in America’s most divided city", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Power Player of the Week: Museum dedicated to the best-selling book in the world.For 2,000 years, the Bible has been the greatest source of division between Christians and Jews. In fact, our bitter history is full of biblically-driven religious intolerance and persecution. However, in America’s arguably most divided city – Washington D.C. – there is a place that serves as a model for respect and reconciliation: the Museum of the Bible, which opened one year ago, in November, 2017.How could such a museum, founded and funded primarily by Evangelical Christians in an era when church-state issues frequently concern the extent of government, play such a role?One would assume that such a museum would be an immediate turn-off to the Jewish community and our long memory. After all, Christianity is an offshoot of Judaism that since its inception has claimed that their New Testament has replaced our Old Testament.During the medieval period, Jews were dragged to churches for forced debates with church officials over the proper interpretation of the Bible. Jews were always the losers at these staged debates, with severe repercussions of forced conversion or death. Things didn’t get better in the modern era, which witnessed the terrible culmination of centuries of European Christian anti-Semitism in the Holocaust.Three weeks ago Saturday, a far-right white supremacist entered a Pittsburgh synagogue and opened fire. He yelled, “All Jews must die,” and killed 11 people –making it the deadliest attack against Jews in American history.As the grandson of Holocaust survivors, when I took my own Israeli children to Washington on a recent visit to the United States, I felt a strong contrast between the Museum of the Bible and the museum we visited almost directly across the street: the United States Holocaust Memorial Museum. The Holocaust museum reminds us of the power of hate. Museum of the Bible offers hope that ancient rivalries can be overcome.Rather than water down the Christian or Jewish narratives, Museum of the Bible presents both with passion and authenticity. Exhibits such as the “World of Jesus of Nazareth” transport visitors to a 1st-century village and “Washington Revelations” highlight biblical references found throughout D.C. The lesson is clear that the Christian Bible, which emerged from an ancient village in Israel, has shaped this modern American city.When it comes to presenting the Jewish Bible, the museum has gone to great lengths to honor Judaism, including amassing one of the greatest collections of Judaica and presenting those artifacts with reverence and respect.From their extensive collection of ancient codices and rare Bibles, the real achievement of Museum of the Bible can best be told through two of its ancient Torah Scrolls.The Museum has an 800-year-old Sephardic Torah Scroll written in Spain during the Golden Age of Spanish Jewry before that glorious era ended with the expulsion of the Jews from Spain. This extremely rare Torah Scroll from the 13th century must have been carried by Jewish refugees under grueling conditions on their sorrowful march from their homes in Spain. Carrying whatever possessions they could on their backs, including such a heavy parchment, bears witness to the faithful dedication of the Torah’s ancient Sephardic guardians who did everything in their ability to preserve it.Another antique Torah Scroll comes from this same time period but from the other side of the Jewish world. The museum also features one of the oldest, most complete Ashkenazi Torah Scrolls from 13th century Germany. This was also a period mixed with great Jewish cultural expansion and severe religious persecution. While boasting some of the most important rabbinic sages whose works are still studied today by Torah students and scholars alike, the Jews of 13th century Eastern Europe were the victims of crusades and massacres. The Museum’s Ashkenazic Torah Scroll, like its Sephardic one, likely saw its fair share of close calls and harrowing moments.Modern Jews are the descendants of these Sephardic and Ashkenazi Jews. Both communities survived for centuries under hostile conditions and extreme persecution, while producing great luminaries and Torah sages. The museum’s two Torah Scrolls silently testify to the heroic efforts made by individuals and communities of Jews in order to preserve the physical words of the Torah Scrolls and their spiritual messages for future generations.By honoring both the Jewish and Christian narratives and unique claims to the Book of Books under one roof, the Museum of the Bible is demonstrating that we are in a unique moment in history. The Bible, which has for generations been the greatest source of division between Jews and Christians, is now becoming a primary source of unity.The Bible says that in the end of days, the world will be at peace and ancient rivalries will be reconciled.  All of humanity will come together in common cause and shared values stemming from a newfound appreciation for the Bible. Isaiah 2:3 teaches that all the nations will stream as one towards the mountain of the Lord, “from Zion shall come forth Torah and the word of God from Jerusalem.”The Bible, which from then until today has been cherished by Jews and Christians, promised a time like the one we are seeing today.If a museum can reverse ancient religious rivalries and create a beacon of reconciliation in the heart of Washington D.C., we can have hope for greater unity and respect in politics and all realms of life.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}