{"id": "A timeline of Saudi statements on the killing of Khashoggi", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          A security guard stands behind barriers blocking the road leading to Saudi Arabia's consulate in Istanbul, Saturday, Oct. 20, 2018. Turkey will \"never allow a cover-up\" of the killing of Saudi journalist Jamal Khashoggi in Saudi Arabia's consulate in Istanbul, a senior official in Turkey's ruling party said Saturday after Saudi Arabia announced hours earlier that the writer died during a \"fistfight\" in its consulate. (AP Photo/Emrah Gurel)\n          ISTANBUL – The official Saudi statements on the fate of journalist Jamal Khashoggi have changed several times since he mysteriously disappeared after entering his country's consulate in Istanbul earlier this month.The latest announcement on Saturday, declaring that Khashoggi had died in a \"fistfight\" with officials that came to see him there, increased criticism over Saudi's handling of the case and concern over the kingdom's possible complicity in the killing of the prominent Washington Post columnist.Here is a look at the Saudi narrative regarding Khashoggi, as it developed.___Oct. 2: Khashoggi enters the Saudi consulate in a leafy neighborhood in Istanbul at 1.14 p.m. on Tuesday. He had left his mobile phones with his Turkish fiancé, who waited for him outside the consulate. She calls friends hours later to tell them that Khashoggi never emerged from the consulate.Oct. 3: In a wide-ranging interview, Saudi Crown Prince Mohammad bin Salman tells Bloomberg he understands that Khashoggi left the consulate after \"a few minutes or one hour.\" Bin Salman says his kingdom's authorities are in talks with the Turkish government to determine what happen. He insists Khashoggi is no longer inside the consulate and says Turkish authorities are welcome to search the diplomatic mission. \"We have nothing to hide,\" says the crown prince.Oct. 4: On Twitter, the Saudi consulate in Istanbul says it is following up on media reports of Khashoggi's disappearance \"after he left the building\" of the consulate.Oct. 4: Turkey summons the Saudi ambassador.Oct. 6: Saudi Arabia says it has dispatched a team to \"investigate and cooperate\" with Turkish officials over Khashoggi's case.Oct. 7: Turkish officials say Khashoggi has been killed at the consulate. A Saudi government statement describes the Turkish allegations as \"baseless.\"Oct. 9: Turkey says it will search the consulate.Oct. 11: Turkey says it has agreed with Saudi Arabia to form a joint group to shed light on the disappeared journalist's fate. The Saudi team arrives in Istanbul a day later.Oct. 13: Saudi Arabia's interior minister describes claims in the media that there were \"orders to kill (Khashoggi)\" as \"lies and baseless allegations.\" Turkish media quote officials as saying Khashoggi has been killed and dismembered inside the consulate.Oct. 14: Turkey's Foreign Ministry renews calls on Saudi Arabia to allow investigators to search the consulate.Oct. 15: Nearly two weeks after Khashoggi's disappearance, teams of Turkish investigators enter the consulate to start their search.Oct. 15: A Saudi-owned satellite news channel says the 15-member team referred to by Turkish media as Khashoggi's \"hit squad\" were \"tourists\" visiting Turkey.Oct. 16: Without warning, the Saudi consul in Istanbul, a key witness in the case, leaves Turkey to Saudi Arabia.Oct. 17: Turkish authorities begin searching the consul's residence in Istanbul.Oct. 19- In a late-night announcement, Saudi Arabia's public prosecutor says preliminary investigations show an \"altercation\" and \"fistfight\" led to Khashoggi's death shortly after he arrived at the consulate. He adds that 18 Saudi nationals were detained. A Saudi foreign ministry official says the kingdom is investigating the \"regrettable and painful incident of Jamal Khashoggi's death\" and forming a committee to hold those responsible accountable.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}