{"id": "Pelosi, Schumer claim Trump's words 'ring hollow' as he calls for unity over explosive devices", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    President Trump: We will get to the bottom of what happened with the suspicious packages.Senate Minority Leader Chuck Schumer and House Minority Leader Nancy Pelosi on Wednesday apparently rejected President Trump's call for bipartisan unity as federal authorities investigate who sent suspected bombs to several Democratic politicians, saying in a joint statement that the president has long approved of \"political violence.\"In their statement, they pointed to remarks by the president at a rally in Montana last week, when he praised a Republican congressman who body slammed a reporter as a \"tough cookie,\" and his frequent criticisms of CNN and other media organizations he has dubbed hopelessly biased.They also invoked Trump's initial response to the 2017 Unite the Right rally in Charlottesville, Virginia, when white nationalists demonstrated against the removal of a Confederate statue, with one participant accused of killing counterprotester Heather Heyer, 32. (On the anniversary of the rally in August this year, Trump wrote on Twitter, \"We must come together as a nation. I condemn all types of racism and acts of violence. Peace to ALL Americans!\")\"President Trump's words ring hollow until he reverses his statements that condone acts of violence,\" Schumer and Pelosi said. \"Time and time again, the President has condoned physical violence and divided Americans with his words and his actions: expressing support for the congressman who body-slammed a reporter, the neo-Nazis who killed a young woman in Charlottesville, his supporters at rallies who get violent with protesters, dictators around the world who murder their own citizens, and referring to the free press as the enemy of the people.\"\"Time and time again, the President has condoned physical violence.\"RAND PAUL WARNS OF ASSASSINATION PERIL: 'I REALLY WORRY SOMEONE IS GOING TO BE KILLED'Schumer and Pelosi added that they \"salute the heroism of America’s first responders as they work to counter the outrageous mail bomb attacks.\"The two top Democratic lawmakers didn't mention recent calls by political leaders on the left -- including former Secretary of State Hillary Clinton -- to abandon civil discourse with Republicans just weeks ahead of the pivotal Nov. 6 midterm elections.Their comments contrasted sharply with Trump's statements throughout the day, which began on Twitter when he retweeted Vice President Mike Pence's condemnation of the episode.Later, he said at the White House: \"The safety of the American people is my highest and absolute priority. I've just concluded a briefing with the FBI, Department of Justice, Department of Homeland Security, and the U.S. Secret Service. As we speak, the packages are being inspected by top explosive experts, and a major federal investigation is now underway. The full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice. We will spare no resources or expense in this effort.\"WATCH: TRUMP UNVEILS 'JOBS NOT MOBS' MIDTERM MESSAGINGHe continued: \"In these times, we have to unify. We have to come together, and send one very clear, strong, unmistakable message that acts or threats of political violence of any kind have no place in the United States of America.\"Several analysts on CNN and social media immediately criticized Trump's remarks, saying he has contributed to the declining civility in politics and should have shouldered more blame for the episode. Former Obama chief adviser Dan Pfeiffer blamed Trump for \"advanc[ing] a racist conspiracy theory\" about his old boss and for irresponsibly riling up his base.Last week, Pelosi was accosted by a mob calling her a \"communist\" during a Florida campaign stop.MAXINE WATERS ENCOURAGES SUPPORTERS TO 'HARASS' TRUMP OFFICIALS IN PUBLICFor their part, Republicans have been calling out Democrats for contributing to the charged political climate. Earlier this month, Clinton said it was impossible to be civil with Republicans as long as Democrats are out of power, and numerous high-ranking Republicans have been harassed in public in the past several months. Last year, House Majority Whip Steve Scalise, R-La., was nearly killed, and two others were wounded, when a left-wing gunman shouting, \"This is for health care\" opened fire at a GOP congressional baseball practice. Capitol police ultimately killed the gunman.The day's events began when packages containing suspected explosive devices were intercepted en route to some of the most prominent political figures in the country on Wednesday – including former President Barack Obama and Clinton – putting law enforcement on high alert and prompting evacuations and sweeps of several facilities.CNN's New York office was among those evacuated due to the discovery of an apparent explosive device. Law enforcement officers said the incidents appear related, and the devices appear to be pipe bombs. Fox News has confirmed that forensic examinations are now underway at the FBI lab in Quantico, Virginia.A law enforcement official directly involved in the investigation tells Fox News that the devices have similar packaging, labeling and postage -- leading investigators to believe that one person or group is responsible.WATCH: CNN NEW YORK STUDIO EVACUATED AS BOMB ALARM SOUNDS ON-AIRIn the latest incident, a law enforcement source told Fox News that U.S. Capitol Police are investigating a suspicious package addressed to Democratic California Rep. Maxine Waters, whom Trump has repeatedly mocked and derided. Waters had previously called on her supporters to openly harass Trump officials in public.“I have been informed by U.S. Capitol Police that my Washington, D.C., office was the target of a suspicious package that has been referred to the FBI,\" Waters said in a statement Wednesday. \"I am appreciative of the law enforcement entities who intercepted the package and are investigating this matter. I unequivocally condemn any and all acts of violence and terror.”Wednesday's flurry of activity comes after an explosive device was found Monday evening in the mailbox of liberal billionaire George Soros.Against this tumultuous backdrop, Trump is expected to speak Wednesday night at a rally in Mosinee, Wisconsin.Asked on CNN whether Trump should cancel the rally, Arizona Republican Sen. Jeff Flake, who said earlier that both political parties should tone down their rhetoric, offered another idea.\"I think he ought to use this rally as a way to actually make things better,\" Flake told anchor Wolf Blitzer. \"I don't begrudge him going to the rally. I just hope that he makes better use of it than he has in the past.\"Fox News' Catherine Herridge and Brooke Singman contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}