{"id": "Roughly $233G of alleged meth seized by Customs and Border Protection officers, agency says", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          More than a dozen packages containing roughly $233,000 worth of alleged methamphetamine was uncovered by Customs and Border Protection (CBP) officers, the agency announced Friday.\n          (Customs and Border Protection)More than a dozen packages containing roughly $233,000 worth of alleged methamphetamine were uncovered by Customs and Border Protection (CBP) officers, the agency announced Friday.Nearly 17 pounds of the suspected drug were seized from a vehicle Monday at the Juarez-Lincoln International Bridge, a news release from the agency said.BORDER PATROL ARRESTS DACA RECIPIENT ACCUSED OF SMUGGLING OVER $34G WORTH OF METHA CBP officer working at the bridge sent a 2016 Dodge Attitude and its 37-year-old male driver, who is a Mexican citizen, to undergo “a secondary examination,” the news release said.“Following a canine and non-intrusive imaging system inspection,\"  CBP officers discovered a total of 13 packages containing nearly 17 pounds of alleged methamphetamine in the vehicle, the news release said. “The narcotics have an estimated street value of $233,000.”Both the alleged drugs and the vehicle were taken by CBP officers and the driver was arrested, the agency said.BORDER PATROL ARRESTS RECORD NUMBER OF ILLEGALS CROSSING SOUTHERN BORDERThe seizure was praised by Port Director Albert Flores, Laredo Port of Entry.“Our officers continue to maintain their vigilance amid the inclement weather and utilized their inspections experience, canines and technology to intercept a significant load of methamphetamine,” Flores said.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}