{"id": "'90 Day Fiance' star Larissa Dos Santos Lima arrested for domestic battery: reports", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Larissa Dos Santos Lima (R), who stars on the current season of 90 Day Fiancé with Colt Johson (L) , was reportedly arrested for domestic battery in Las Vegas on Saturday, November 10.\n          (TLC)\"90 Day Fiancé\" star Larissa Dos Santos Lima was reportedly arrested for domestic battery in Las Vegas on Saturday, according to multiple outlets.Per People Magazine, Lima has since been released from custody. Us Weekly, citing the Clark County Detention Center, reports that Lima's bail was set at $1,000 and she is now expected to appear before a judge on Tuesday.A rep for TLC did not immediately respond to Fox News' request for comment.According to Us, the TLC star changed her Instagram profile name to @helpmeimwithoutphone on Saturday. The site also reports that the 32-year-old, who appears on the reality show with partner Colt Johnson, posted a series of messages on her account.“HELP ME …HE TURNED OFF HIDE MY PHONE HELP ME HE WANTS TO CALL THE POLICE HELP ME,\" Lima allegedly wrote.Following her arrest, Johnson, 33, reportedly addressed the incident.'90 DAY FIANCE' STAR PAOLA MAYFIELD SLAMMED ON INSTAGRAM FOR RACY PREGNANCY POSTPeople Magazine reports that a fan account posted a screengrab of Johnson's Instagram Story, which allegedly read: “Larissa was arrested this afternoon. She suffers from high anxiety and several (sic) depression. She over reacted to problems that do not exist.“I proceeded to deactivate her phone to try to defuse the situation,\" the message allegedly continued. \"This escalated issues and matters became worse. She felt this action was a threat towards her and tried to reach out for help. Not long after her cry was posted, the police came and knocked down the front door. They drew their guns at me and handcuffed me.'90 DAY FIANCE' STAR KARINE CONFRONTS FIANCE PAUL ABOUT THEIR RELATIONSHIP ISSUESHe allegedly concluded: “The police interviewed us but not long after they decided to arrest Larissa. No one was hurt and I did not press charges against my wife. However it is policy in the state of Nevada that since we are in a domestic partnership, someone had to be arrested.”Per the outlet, Johnson and Lima first met on social media. The pair then met in-person in Mexico before Johnson popped the question five days later. They currently star on season six of \"90 Day Fiancé.\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}