{"id": "Rep. Steve Stivers: Midterm elections offer America a simple choice – More progress or a return to pain", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    National Republican Congressional Committee Chairman Rep. Steve Stivers says a vote for Republicans is a vote for prosperity while a vote for Democrats is a vote for despair.In the midterm elections Tuesday, every American will have an important choice to make at the ballot box.Do you want our strong economy to grow even stronger, our low unemployment rate to go even lower, your taxes to be cut even further, and America to be made even greater? If so, vote for Republicans and keep the GOP the majority party in the U.S. House and Senate.Or do you want to reverse all the progress made on these fronts by President Trump and the Republican Congress over the last two years? Do you want to bring back a poorly performing economy, higher unemployment, higher taxes and a weaker and more problem-plagued America? If so, vote for Democrats.We already know that Democrats want to not only repeal the Republican tax cuts, but have plans that would require raising your taxes.Look no further than the Democrats’ prescription for health care: a single-payer government takeover that would cost a staggering $32.6 trillion over 10 years and end Medicare and Department of Veterans Affairs health care as we know it. Democrats would kick 179 million Americans off of their private health-care plans.A Republican-led Congress promises policies to keep our country on a path toward prosperity and continue to deliver results for the American people. A House of Representatives controlled by a Speaker Nancy Pelosi, D-Calif., would grind the progress of our nation to a halt and return the country to the economic stagnation and decline of the past.The October jobs report shows that our economy continues to boom, thanks to Republican economic policies including tax cuts and a commitment to reducing regulations.More than 250,000 jobs were created in October across the U.S., exceeding expectations. What’s more, wages are growing at an annual rate of 3.1 percent – the fastest pace in nearly a decade. The national unemployment rate in September and October was just 3.7 percent – the lowest rate since 1969. The U.S. now has more open jobs than job seekers.Health care, manufacturing, construction, transportation and warehousing fueled October’s strong job growth. The wage gains are coming at a time of record profits for U.S. companies after we’ve lowered the corporate tax rate from being one of the highest in the world.With the Republican-passed tax cuts, Americans are getting to keep more of their hard-earned money.Because of Republicans, more people have a shot at the American Dream today than ever before. Our policies have lifted up everyone, including those who had been forgotten for far too long. We finally have America moving forward. Why would anyone want to turn back?If you want results over dysfunction, I encourage you to vote Republican on Tuesday.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}