{"id": "Brazil newspaper asks probe of threats to election reporter", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Supporters of presidential candidate for the Workers Party Fernando Haddad, participate in a campaign rally in Brasilia, Brazil, Wednesday, Oct. 24, 2018. Brazilians return to the polls on Oct. 28 for the second round of voting. (AP Photo/Eraldo Peres)Supporters with T-shirts with the image of presidential frontrunner Jair Bolsonaro walk during a campaign rally in Brasilia, Brazil, Wednesday, Oct. 24, 2018. Brazilians return to the polls on Oct. 28 for the second round of voting. (AP Photo/Eraldo Peres)SAO PAULO – Brazil's biggest newspaper said Wednesday that it has asked federal police to investigate threats against a journalist whose story alleged backers of the front-running presidential candidate bankrolled a fake news campaign.The request comes amid an increasingly heated atmosphere ahead of Sunday's runoff between far-right candidate Jair Bolsonaro, who leads in opinion polls, and his leftist opponent, Fernando HaddadThe newspaper Folha de S. Paulo last week ran a report by Patricia Campos Mello saying businessmen linked to right-wing candidate Jair Bolsonaro had paid to spread fake news on the WhatsApp messaging service to benefit his candidacy. It said a blast message campaign also was planned for this week.Bolsonaro denied the report. Haddad called on Brazil's electoral court to investigate.The newspaper said Wednesday that there are indications Bolsonaro's campaign is threatening freedom of the press. The paper said Campos Mello has received numerous threats via WhatsApp and email.\"You should think about your son and his future. For your safety I would leave Brazil,\" read one of the threats contained in a document filed by the newspaper Tuesday requesting the investigation.The Associated Press called Bolsonaro's campaign seeking comment about the newspaper's move, but no one answered.Bolsonaro has expressed antagonism toward Folha de S.Paulo, which he has called the \"biggest provider of fake news in Brazil.\"Three days after Mello's report appeared, Bolsonaro told a large crowd of supporters in Sao Paulo \"that the newspaper would not receive any advertising revenue from his government and promised to do away those red bandits from Brazil.\"Marcelo Rech, president of Brazil's National Newspaper Association, criticized those comments.\"Coming from a presidential candidate, this kind of commentary is unfortunate, for it shows his incomprehension of the role journalism plays,\" Rech said.Reporters Without Borders also criticized Bolsonaro.\"The attacks against Folha de S. Paulo made by candidate Jair Bolsonaro and his followers are unacceptable and unworthy of a party that wants to govern the country,\" Emmanuel Colombie, director of the organization's Latin American office, told the newspaper.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}