{"id": "Chris Stapleton says he and his wife Morgane are going to have another baby: 'We're gonna make it five'", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Chris Stapleton said Friday he and his wife Morgane Stapleton are going to have another baby -- their fifth. \n          (Getty )Chris Stapleton got personal with his fans at a Friday concert.Stapleton, 40, discussed his growing family with wife Morgane Stapleton while performing at Madison Square Garden in Manhattan.“I’ve got an announcement to make,” he declared in a video The Blast posted Saturday. “Some of you may know that we have four children, and we just had twins about seven months ago. Now there’s four for us, but we’re gonna make it five!”CMA AWARDS: EVERYTHING YOU NEED TO KNOW ABOUT COUNTRY MUSIC'S BIGGEST NIGHTThe Stapletons have a son, a daughter and two baby twin brothers, who were born this spring.Morgane revealed the twin boys were born more than a month early in the first photo posted of the newborns in mid-April.The couple had missed the 2018 Academy of Country Music (ACM) Awards on April 15 because the babies had arrived early.LADY ANTEBELLUM ANNOUNCES 2019 LAS VEGAS RESIDENCY, 15 SHOW DATES“Thank you for all the love! We’re so grateful to finally be home with our sweet family,\" Morgane Stapleton captioned an April 17 post. “We would like to say a special thank you to all the incredible nurses & doctors at Centennial Women’s & Children’s Hospital in Nashville.”“At more than a month early, we had a week long stay in the nicu & the incredible people there kept our boys healthy & happy,” she added.The birth of their sons was announced during the ACM Awards after host Reba McEntire explained Stapleton’s absence.Country Living reports the Stapletons tied the knot in 2007 after first meeting each other in 2003.Fox News' Katherine Lam contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}