{"id": "For Honduran migrants in caravan, the journey is personal", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Honduran migrant Alba Rosa Chinchilla Ortiz poses for photos at a temporary shelter in the central park of Huixtla, Mexico, Tuesday, Oct. 23, 2018. Chinchilla's husband, an ex-soldier in the Honduran army has survived three attempts to kill him, Chinchilla said. Her partner of six years, he has applied for asylum in the United States and she's trying to join him and their son. (AP Photo/Moises Castillo)Honduran migrant Marel Antonio Murillo Santos, poses for photos at a temporary shelter in Huixtla, Mexico, Tuesday, Oct. 23, 2018. \"What I want more than anything is to pay for treatment my mother needs for her health,\" Murillo said. \"Build a home for her, have a bit of money in the bank and also, if I'm able, invest in something or start a business for my mother to run.\" (AP Photo/Moises Castillo)HUIXTLA, Mexico – A deportee from the United States trying to get back to the life he spent more than a decade building. A woman whose soldier husband already is in the U.S. with their 4-year-old son. A teenager desperate to earn money to support his diabetic mother back home.The caravan of Central American migrants traveling through southern Mexico — estimated at around 7,000 people, nearly all Hondurans — has attracted headlines in the United States less than two weeks before Nov. 6 midterm elections.But most of those walking through blistering tropical temperatures, sleeping on the ground in town squares and relying on donated food from local residents are unaware of U.S. political concerns or even that there's a vote coming up.While they commonly cite the same core reasons for migrating — poverty, violence — their stories are deeply personal.___\"MY RECORD IS CLEAN\"David Polanco Lopez, 42, is a former anti-narcotics officer from Progreso, Honduras. He's traveling north in the caravan with his daughter Jenifer, 19, and his 3-year-old granddaughter, Victoria, whom the adults take turns pushing in a stroller.Polanco came to the United States 13 years ago and applied for asylum after he was threatened by drug traffickers over his police work. He was given a court date, but he acknowledges he never showed up — in part because he didn't understand the court document's instructions, which were in English.Polanco put down roots in Arizona: He married, and got a home. He thought that as long as he stayed out of trouble, he'd be fine.\"If they catch me committing a felony, then go ahead and kick me out,\" Polanco said. \"But my record is clean.\"He came to the attention of U.S. immigration authorities three months ago when he caught a ride to work with a friend and Arizona police stopped them. Immigration officers later visited his home, he said, asked him to come outside and arrested him.After being deported, he immediately turned around and headed back toward the United States with the caravan in hopes of rejoining his wife, who is from Mexico.\"I came (to the United States) fleeing the drug traffickers. The U.S. police know that. They told me I qualified for asylum. But they didn't give it to me,\" Polanco said as he rested in the shade of a gas station in the far southern Mexican state of Chiapas. \"I can't live in Honduras because my life is in danger.\"Polanco said he will never give up on trying to return to the U.S. That's where his home, his family, his land are. He said he's been paying U.S. taxes for 13 years and never invested a cent in Honduras because \"it's unlivable, dangerous.\"\"If they deport me I'll just come back,\" Polanco said, \"because my place is there.\"___\"IT'S TOO MUCH\"It's been seven months since Alba Rosa Chinchilla Ortiz, a 23-year-old from Amapala in Honduras' Valle department, has seen her 4-year-old son.The boy's father is an ex-soldier who — like Polanco — received death threats because of his job. Three times he survived attempts to kill him, Chinchilla said. He has applied for asylum in the United States and she's trying to join him and their son.Life on the road has been demanding. At one point, Chinchilla worried she was too exhausted to go any farther. She's still moving forward, but fears dangers that may lie ahead — such as Mexican cartels, which have been known to kidnap, hold for ransom and kill migrants.The separation has been almost more than she can bear.\"The desire to see my son is too much,\" she said, speaking in the Mexican city of Huixtla, surrounded by dozens of fellow migrants and Mexican Red Cross workers.Breaking into sobs, she wiped tears from her eyes with her thumb and forefinger.\"It's the only thing that drives me,\" Chinchilla said, \"my son.\"___'TREATMENT FOR MY MOTHER'Reuniting with family in the U.S. is something those on the road north frequently speak of. Marel Antonio Murillo Santos is doing the opposite — leaving his loved ones behind in Copan, Honduras.After his parents separated five years ago, Murillo became the primary breadwinner for the family at age 13. His mom is diabetic, leaving her weak and missing a toe on each foot.Dressed in a brown V-neck T-shirt, Murillo said he left with just 500 lempiras (about $20) in his pocket, a bit of clothing and a spare pair of shoes. He heard about the caravan from a friend, and decided on the spot to take off for the United States where he hopes to spend five years working and saving.\"What I want more than anything is to pay for treatment my mother needs for her health,\" Murillo said. \"Build a home for her, have a bit of money in the bank and also, if I'm able, invest in something or start a business for my mother to run.\"Mile after mile, this baby-faced young man, now 18 with a whispy black chin-beard, is constantly thinking of home and his mom and 5-year-old brother.\"When I go to eat, I wonder if they have eaten, where they are, if they are in good health,\" Murillo said. \"I spend all day thinking about them, until I close my eyes and sleep.\"___'THEY'RE GOING TO KILL YOU'If there's any doubt about Honduras being a dangerous place, one need only talk to Joshua Belisario Sanchez Perez, a soft-spoken young man who worked odd jobs in the capital, Tegucigalpa. Back home, he had the misfortune of living in one of the most dangerous neighborhoods in a city full of them.He spoke with The Associated Press in an interview this week that aired on TV back home, and afterward gang members showed up at his mother's home angry that he had talked about the violence that forced him to flee.\"Because I had talked about all the gangs, and all the crime,\" Sanchez said.\"My mother said, 'They came to the house and they saw you on the news,'\" he continued. \"'If you come back they're going to kill you.'\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}