{"id": "Broward counts the wrong ballots as Florida races to finish manual recount ahead of Sunday deadline", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Sen. Joni Ernst weighs in on the Florida recount.FORT LAUDERDALE, Fla. – Fresh off its bungled machine recount, Broward County’s second day of manual recounting temporarily stopped about an hour after it began Saturday when lawyers from both political parties pointed out that volunteers were counting the wrong ballots.Hundreds of volunteers spent most of Friday sorting through 32,000 overvotes and undervotes in the Senate race between incumbent Sen. Bill Nelson and Republican Gov. Rick Scott. Broward officials announced Friday night they had finished their manual recount.On Saturday, the volunteers started sorting about 22,000 undervotes and overvotes in the contentious contest for Florida Commissioner of Agriculture.That came to a grinding halt when lawyers found thousands of overlapping ballots which clearly showed a vote in the agriculture race but were fuzzy in the Senate race.GOP'S MIA LOVE TAKES LEAD IN UTAH HOUSE RACE AS COUNT CONTINUES\n      Volunteers look over ballots during the hand count at the Broward County Supervisor of Elections office in Lauderhill, Fla., on Saturday, Nov. 17, 2018. \n      (Mike Stocker/South Florida Sun-Sentinel via A)“It appears there may have been some ballots from yesterday mixed in with the ones for today,” Broward Canvassing Board Judge Deborah Carpenter-Toye told reporters.Forty-seven manila envelopes from the Senate recount were mixed in with the envelopes distributed for the commissioner race.Broward County Canvassing Board Attorney Rene Harrod told Fox News the issue was caught in time and that none of the 47 envelopes made it to the canvassing board. It’s an important catch because it rules out the possibility of some votes being counted twice.FLORIDA RECOUNTS CONTINUE WITH SENATE: A LOOK AT WHERE WE ARE NOW WITH THE ELECTIONRepublican lawyer Joe Goldstein demanded the recount be stopped. Instead, the canvassing board decided to keep counting and instructed volunteers to flag any incorrect ballots from Saturday’s count. The news comes as Florida struggles to complete its mandatory manual recount in the U.S. Senate race by noon Sunday.  The Sunshine State – Broward County in particular - has been under the microscope since the recounts were ordered last Saturday.On Thursday, embattled Broward County Supervisor of Elections Brenda Snipes boasted about making the state’s deadline for machine recounts.“We are excited to be at this point,” she said Thursday afternoon.\n      On Saturday, the volunteers started sorting about 22,000 undervotes and overvotes in the contentious contest for Florida Commissioner of Agriculture.<br data-cke-eol=\"1\">\n      (Mike Stocker/South Florida Sun-Sentinel via AP))A few hours later, election officials were forced to admit the county had uploaded the results of the recount two minutes after the state’s 3 p.m. cutoff - making its machine recount tally void.Broward’s results from Election Night will stand until manual recount totals come in Sunday at noon.Scott’s campaign charged that Snipes intentionally submitted late results so that they would be invalidated. In the recount, Nelson, lost more votes than Scott -- meaning Scott would have seen a net gain of 779 votes if Snipes hadn't been late.Broward was one of three counties that did not make the machine deadline.RARE RECOUNTS UNLIKELY TO REVERSE ELECTION RESULTS, BUT IF THEY DO, DEMOCRATS ALWAYS WINHillsborough County intentionally refused to report its figures, which would have awarded Scott approximately 150 votes, because the recount turned up 846 fewer votes in total than the county's initial tally.\"Even though we achieved 99.84 percent success in our recount effort, we are not willing to accept that votes go unreported,\" Hillsborough County Supervisor of Elections Craig Latimer told reporters. \"For that reason, the Canvassing Board has decided that the first unofficial results will stand as our second unofficial.\"In Palm Beach, election supervisor Susan Bucher said the county found “dozens of precincts missing a significant number” of votes during the machine recount and indicated there may be entire boxes of ballots that weren’t counted, according to the New York Times.\n      Broward County Supervisor of Elections Brenda Snipes, left, talks with political attorneys during a hand recount, Friday, Nov. 16, 2018, in Lauderhill, Fla.\n      (AP Photo/Wilfredo Lee)She also blamed the county’s issues mechanical errors and said the scanning machine overheated.She flew in two mechanics to fix the problem. The technicians, though, witnessed Palm Beach County workers jam a paper clip into the scanner’s “enter” button to slow the high-speed scanner down. That action caused a short circuit that cut off the power, according to the New York Times.More than 8.1 million votes were cast in Florida. The state is scheduled to certify results in the Senate race on Nov. 20.Fox News’ Gregg Re, Sarah Chakales and The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}