{"id": "CNN slammed as ‘disgraceful’ after Jake Tapper silent when guest says Trump radicalized more people than ISIS", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Top anchors Carol Costello, Michaela Pereira and Ashleigh Banfield will be exiting HLN after three live shows get cut and the network refocuses on long-form programming.CNN and star anchor Jake Tapper are under fire after he stayed silent when a guest declared that President Trump had radicalized more people than ISIS. Hours later, CNN’s Don Lemon drew the ire of Majority Whip Steve Scalise by declaring that Democrats don’t kill people, completing a 24-hour span being labeled CNN’s “new low” by critics.CNN has preached a call for civility since its New York headquarters was evacuated when a pipe bomb was found in the mailroom last week but critics feel the network only cares about hate speech when it comes from the right. This theory came to a head when controversial GQ Magazine columnist Julia Ioffe was on Tapper's show, “The Lead,” on Monday during a heated debate about hateful rhetoric.“I think this president, one of the things that he really launched his presidential run on is talking about Islamic radicalization and this president has radicalized so many more people than ISIS ever did,” Ioffe said.Tapper did not chime in, but David Urban, the panel’s token conservative, didn’t appreciate the remark.Ioffe was continuing her rant about Trump's “radicalized” supporters when Urban interrupted.“Jake, for you not to push back on that is irresponsible. That’s irresponsible. For her to say the President of the United States has radicalized more people than ISIS is irresponsible,” Urban said.Tapper said, “OK, you disagree with it,” as other panelists talked over each other and Ioffe stood by her claim.A CNN spokeswoman said Tuesday evening: “CNN has diverse panels of guests with a variety of views and obviously no anchor, including Jake Tapper, agrees with everything each one says. Julia Ioffe’s comments were regrettable and we’re glad she apologized.”NewsBusters managing editor Curtis Houck told Fox News that the lack of pushback was “disgraceful.”“CNN is not interested in unifying this country because they'd rather bring on guests like Ioffe to sow further division and create split screens between the President and protesters as he visits the synagogue,” Houck said.Ioffe offered a brief apology later in the show, chalking her comment up to exaggerating during “an emotional and personal painful time” and she was booked for another appearance on CNN a few hours later.The widely-condemned comment was not the first time that Ioffe has come under fire for outlandish rhetoric aimed at Trump. She was fired from Politico in 2016 for an obscene tweet in which she implied that Trump was having an incestuous relationship with his elder daughter, Ivanka.“CNN invited on one of the most poisonous voices on the left. Someone who routinely trades in baseless conspiracy theories and ad hominem attacks,” conservative strategist Chris Barron told Fox News. “The results were predictable. Jake Tapper sat by while she spewed truly repulsive rhetoric completely unmoored from reality. CNN rewarded her for this abhorrent behavior with an invitation to appear on yet another show on their network. A new low for CNN.”Jake Tapper sat by while she spewed truly repulsive rhetoric completely unmoored from reality. CNN rewarded her for this abhorrent behavior with an invitation to appear on yet another show on their network. A new low for CNN.\"Despite outrage across social media, CNN invited Ioffe back on the network during primetime, when she made another batch of disturbing comments. During a conversation about anti-Semitism and racism on “CNN Tonight” with Don Lemon, Ioffe declared that Trump supporters condone heated rhetoric turning into hate.“You can’t overestimate the power of the bully pulpit of a president. The things he says, and the things he doesn’t say and the ways in which he says them. The way in which he condemns racist, when you can see it’s so half-hearted. It’s like a kid being forced to do something,” Ioffe said. “It’s not just the freaks… it’s also, kind of, the silent majority of Trump supporters that think this is OK, that continue to support this president despite what he said.”Lemon – unlike his colleague earlier in the day – questioned the comment, asking “You think it’s a silent majority?”“Yeah, I think that,” Ioffe responded.Ioffe then essentially said Trump supporters overlook hateful rhetoric in exchange for tax cuts as Lemon told her she “hit the nail on the head.”“If they don’t support it ... the silent majority, they enable it,” Lemon said.On the same episode of “CNN Tonight,” Lemon also caught the attention of Congressman Steve Scalise, R-LA, during a conversation about recent tragedies that have plagued America.“The right-wing group killed a woman in Charlottesville. This guy is a right-winger who killed the people in the synagogue. The right-winger sent bombs to CNN and to Democrats. I don’t see Democrats killing people,” Lemon said.Conservative commentator Mike Shields, who was a guest, quickly reminded Lemon that “they tried to.”Scalise – who survived an assassination attempt while practicing for a baseball game with fellow GOP lawmakers – made it clear on Twitter that he heard the comment and responded with a simple emoji of eyes watching and his spokesperson offered a statement condemning the remark.“Steve Scalise was nearly assassinated by a leftist who came to a baseball field with the specific intention of murdering several Republican members of Congress. While that reality may be inconvenient for the narrative Don Lemon is trying to push, the fact remains that Democrats do in fact have an issue with political violence that cannot be ignored or swept under the rug.\"“Steve Scalise was nearly assassinated by a leftist who came to a baseball field with the specific intention of murdering several Republican members of Congress. While that reality may be inconvenient for the narrative Don Lemon is trying to push, the fact remains that Democrats do in fact have an issue with political violence that cannot be ignored or swept under the rug,” Lauren Fine, a spokeswoman for Scalise, told Fox News.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}