{"id": "Some meat-free alternatives have more salt than seawater, study finds", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Of all the items surveyed, only three products were considered to be low in salt, containing 0.3g per 100g of salt or less.\n          (iStock)Heads up, vegetarians: Some processed meat alternatives may not be as healthy as you once thought — at least when it comes to sodium levels.A study conducted by Action on Salt — a U.K.-based group which focuses on salt and “its effects on health,” according to its website — found, on average, meatless burgers contain more salt than a traditional meat burger.COSTCO BUILDING ITS OWN CHICKEN FACILITY TO KEEP UP WITH $5 CHICKEN DEMANDSurveying more than 150 supermarket-bought meat alternatives, the researchers found a traditional beef burger has an average of 0.75g of salt per serving, while a meatless option contains 0.89g. That amount of sodium that makes meatless burgers “saltier than a portion of salt and vinegar crisps,” the researchers wrote in the study.The group also concluded two meatless items (Tofurky’s Deli Slices Hickory Smoked and Tesco’s Meat Free 8 Bacon Style Rashers) “contain much more salt per 100g than seawater,” adding these two items were the “saltiest products in the survey.”Of all the items surveyed, only three products were considered to be low in salt, containing 0.3g per 100g of salt or less, while roughly 18 percent of the products studied “have no portion size, making it hard for consumers to judge how much of a product they should eat and gauge their daily salt intake,” according to the study.Excessive sodium can lead to a variety of health issues, such as high blood pressure, heart failure, stroke and kidney disease, among others, according to the American Heart Association.The U.S. Food & Drug Administration recommends consuming 2,300 mg (roughly one teaspoon) of sodium or less a day, while the United Kingdom’s Food Standards Agency, which monitors food safety across the country, recommends children who are 11 years or older should not exceed 6g of salt each day.“The food industry [has] ensured greater availability of meat-free alternatives, but now they must do more to ensure that meat-free alternatives contain far less salt - at the very least lower than their meat equivalents,” Action on Salt nutritionist Mhairi Brown said in a statement.FOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWSGraham MacGregor, a professor of cardiovascular medicine at Queen Mary University of London and chairman of Action on Salt, echoed Brown's advice.“Reducing salt is the most cost-effective measure to reduce the number of people dying or suffering from entirely unnecessary strokes and heart disease. Given the vast amounts of strokes and heart disease that could be avoided and huge savings to the NHS, it is incomprehensible that Public Health England are not doing more to reduce the amount of salt in our food. We are AGAIN calling on PHE to take urgent action,\" MacGregor said in a statement.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}