{"id": "Georgia man convicted of murdering grieving man who bumped into him at bar", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Torry Bowman, 33, was sentenced to life in prison for murdering Alec Price, a 25-year-old man who \"accidentally bumped into\" him at a bar in Georgia in October 2017.\n          (Fulton County Sheriff's Office)A Georgia man was convicted Thursday of murdering a grieving man who \"accidentally bumped into\" him at a bar last year.Torry Bowman, 33, was found guilty in the October 2017 killing of 25-year-old Alec Price, who had been mourning the death of his grandmother, the Fulton County District Attorney's Office announced.FLORIDA TEEN KILLS MOM AFTER ARGUMENT OVER BAD GRADEPrice's grandmother had died earlier in the day after losing her battle with cancer, so he and his brother, Britian Price, visited the bar in Atlanta. At some point, Alec Price bumped into Bowman, investigators said.Later, Bowman's friend, Terrell Goodman, confronted the Price brothers about the accidental bump, according to prosecutors.\n      Alec Price died in October 2017 after \"accidentally bumping into\" two men at a Georgia bar. \n      (Facebook)Goodman and Bowman left the bar, but upon their return, a security guard noticed Bowman had a gun in his pocket. That security officer then escorted the two out.Prosecutors said the two men waited outside for the Price brothers to exit the bar — and when they did, \"Bowman fired four shots with a 9mm handgun at the two men.\" Three of the shots hit Alec — one of which struck his heart, killing him. Bowman and Goodman then fled the scene.Just over an hour later, Bowman was stopped for allegedly running a red light, and the two men were arrested for unrelated warrants and taken to jail.GANG-RELATED GUNFIRE THAT KILLED GIRL, 11, WAS AIMED AT WRONG HOUSE, POLICE SAYFour days later, while still in jail, Goodman apparently bragged to another inmate that he and Bowman had \"got into it with some guys\" at the bar — and eventually admitted he killed Price.Investigators determined that the gun used to kill Price was also used to commit an armed robbery and aggravated assault during a separate incident a week earlier. The victim in that event identified Bowman — who allegedly \"used his hands and feet to brutally beat and kick the man\" — in a photo lineup, which led to investigators linking Bowman and Goodman to Price's death.Bowman, who had previously been arrested 15 times, was convicted of murder, felony murder, aggravated assault with a deadly weapon, among other charges. He was sentenced to life in prison plus 15 years. Goodman has yet to stand trial.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}