{"id": "ABC journalist says Alec Baldwin once told her: ‘I hope you choke to death’", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Fiery actor and 'SNL' star Alec Baldwin has reportedly been arrested in New York City after allegedly punching someone in the face.ABC News White House correspondent Tara Palmeri is recalling how the celebrity hot-head Alec Baldwin once told her, “I hope you choke to death,” when she was working as a tabloid reporter in New York City.Palmeri shared the tidbit in a tweet Friday shortly after news emerged of the liberal actor’s arrest for assaulting a man over a parking space in Manhattan, The Hill reported.\"Alec Baldwin also told me 'I hope you choke to death' when I was on assignment, staking out his house,\" Palmeri wrote of an incident that she said happened in 2013 when she was a reporter for the New York Post.Palmeri alleged that Baldwin also grabbed her arm, according to the paper. The Post said the reporter played an audio recording of the actor's threat to the New York City Police Department.Baldwin reps did not immediately respond to a request for comment.ALEC BALDWIN CHARGED WITH ASSAULT AFTER ALLEGEDLY PUNCHING MAN DURING PARKING SPOT SPATPalmieri was reacting to a tweet by New York Times reporter Maggie Haberman who presented her Twitter followers with her personal bad-boy Baldwin story.“Baldwin was the first person I ever experienced being blocked by on Twitter, after he used his account with hundreds of thousands of followers to berate me for... writing about a fundraiser he’d hosted in a way he didn’t find satisfactory,” Haberman said.The Post reported in 2013 that Palmieri’s run-in with Baldwin came after she was on a stakeout and tried to question him about a lawsuit that had been filed against his wife.Baldwin admitted to making the comments but claimed that they weren't meant to be taken seriously, the Daily Mail reported.'SNL' STAR JOKES ABOUT CANDIDATE WHO LOST EYE IN AFGHANISTANBaldwin, 60, was accused of slamming his fist against the jaw of a man who swooped in and took a parking spot in the West Village that was being held for the actor last week.Hours after his release from police custody, Baldwin denied assaulting anyone.“Normally, I would not comment on something as egregiously misstated as today’s story,\" he said. \"However, the assertion that I punched anyone over a parking spot is false. I wanted to go on the record stating as much. I realize that it has become a sport to tag people (with) as many negative charges and defaming allegations as possible for the purposes of clickbait entertainment.\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}