{"id": "Supporters, opponents clash over Dutch character Black Pete", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    A Black Pete interacts with children during the arrival of Sinterklaas in Monnickendam, Netherlands, Saturday, Nov. 17, 2018. White people often daub their faces with black paint when they dress up to play the character. Opponents say such depictions of Black Pete promote racist stereotypes. Supporters defend the sidekick of Sinterklaas, the white-bearded, red-robed Dutch version of St. Nicholas, as a traditional children's character. (AP Photo/Patrick Post)Black Petes interact with children during the arrival of Sinterklaas in Monnickendam, Netherlands, Saturday, Nov. 17, 2018. White people often daub their faces with black paint when they dress up to play the character. Opponents say such depictions of Black Pete promote racist stereotypes. Supporters defend the sidekick of Sinterklaas, the white-bearded, red-robed Dutch version of St. Nicholas, as a traditional children's character. (AP Photo/Patrick Post)THE HAGUE, Netherlands – Scattered confrontations broke out Saturday between supporters and opponents of the divisive helper of the Dutch version of Santa Claus, police and media reported, amid a fierce and increasingly polarized debate about the helper known as Black Pete.White people often daub their faces with black paint when they dress up to play the character. Opponents say such depictions of Black Pete promote racist stereotypes. Supporters defend the sidekick of Sinterklaas, the white-bearded, red-robed Dutch version of St. Nicholas, as a traditional children's character.A nationally televised parade to welcome Sinterklaas in the historic village of Zaandijk north of Amsterdam went off peacefully, but at parades across the country there were a small number of confrontations.Police in Rotterdam tweeted they made three arrests as supporters of Black Pete clashed with anti-Pete protesters, but added that the vast majority of events were peaceful.In the northern city of Leeuwarden, police said they \"prevented two groups getting into a fight.\" In nearby Groningen, police separated two groups of protesters to prevent a confrontation.Police in The Hague said riot police kept pro-Pete activists away from anti-Pete protesters as they were escorted to the city's main railway station.Dutch media also reported that soccer fans confronted a small group of anti-Pete protesters in the southern city of Eindhoven.Prime Minister Mark Rutte had appealed for calm on Friday, saying: \"I think society agrees on one thing: we grant children the magic of the Sinterklaas party.\"A boat carrying Sinterklaas sailed into the harbor of the picturesque village of Zaandijk on Saturday accompanied by dozens of Black Petes, their faces painted varying shades — from uniformly dark to smudged with dark streaks.Thousands of children, many wearing Black Pete costumes, lined streets to greet Sinterklaas, many sitting on the shoulders of a parent and grabbing handfuls of candy handed out by Black Petes.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}