{"id": "'Master of Arms' hopes to showcase the history and artistry in firearms craftsmanship", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Trent, Zeke and Ashley address contestants on Discovery's \"Master of Arms.'\n          (Discovery Channel)Discovery debuted the first episode of “Master of Arms,” a show that seeks to show the world that weaponry isn’t violent, but rather a modern showcase of history and art. The new competition show pits master craftsman against each other in the hopes of finding out who is the master of arms. Through three rounds of competition, contestants will design everything including blades, bows and, yes, guns.However, despite the current controversial climate surrounding firearms in America, hosts Ashley Hlebinsky and Zeke Stout believe that what their show truly offers is a glimpse into history and craftsmanship as modern blacksmiths and forgers come from all over the country to showcase something that’s rapidly getting lost.“If anything I would hope to see that the people who aren’t super excited about firearms are going to see the artistry and the craftsmanship that goes into this. It’s something you see these guys putting their heart and soul into the work they’re doing to build a tool to help someone on the farm or help their family or even defend themselves if they have to .. .not necessarily the ones we’re building,” Stout, a certified firearms specialist and executive of one of the largest gunsmithing schools in the country told Fox News in a phone interview. “But there’s a lot of artistry that goes into this. So even if somebody is not into firearms atr all, they can appreciate the way we deliver it as an artistic craft as well.”“I think it is that combination of the practical application and the history. A lot of people think history is boring, but watching it come alive might inspire people to learn more about a specific time period, or maybe even learn the craft,” Hlebinsky, one of the leading firearms historians in the U.S. told Fox News,She noted that, while seeing the lethality of weapons throughout history is exciting to watch, she notes that the real appeal of “Mast of Arms” is the art.\n      'Mast of Arms' judge Zeke chopping at log with contestants knife. Trent and Ashley in background.\n      (Discovery Channel)Firearms are one of the least talked about decorative arts. From the 16h through the 18th century, they were highly sought after and gunsmiths were a lot of times considered traditional artists,” Hlebinsky said. “There’s an element of art of the firearm, the function vs the aesthetic beauty of it. There’s also the military history as well.”Despite the series hoping to focus on the history and art of modern firearm-building techniques on historical challenges, firearms are an undoubtedly controversial topic in the United States. However, Zeke and Ashley want to make it clear to fans that the show is not hoping to inspire a generation of firearm enthusiasts, but rather a generation of people hoping to innovate with their hands.“I hope people can come on and watch the show and then see the amount of work that goes into it. With a lot more modern weapons it’s all mechanical, there’s robots doing it,” Stout said. “These are guys that take their hands and create amazing things that are functional works of art. I also hope a younger audience that sees it starts to think, ‘hey, I can get out in my garage and do stuff with my hands.’ It might not necessarily be weapons, but there’s a lot you can do. I think innovation has started to stagnate a bit just because there is a lot more automation…. I think if more people get into this stuff, you’ll see more innovation start to happen.”This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}