{"id": "Voter turnout in Mississippi could impact control of the Senate", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    With a 38% African American population, Mississippi's forecasted high turnout could bode well for Democrat Mike Espy in his run for Senate.JACKSON, Miss. – “November, November the 6th,” a Mississippi blues singer belted between lines from popular songs. “Go out and cast your vote. Make it count. Mr. Senator Mike Espy!”The roomful of Mississippians tapped their feet along to the raspy sounds of the local, live band – before greeting Democrat Mike Espy, a candidate for U.S. Senate in the Magnolia State.Espy is vying for one of two Senate seats up for election in Mississippi. If elected, the former Congressman and U.S. Secretary of Agriculture would not only be the first Democratic senator the state’s seen in nearly 40 years, but also the first African American to hold the seat since the late 1800s.While the odds are stacked against him, analysts warn Republicans not to overlook Espy in the crowded special election.Two Democrats and two Republicans aim to replace longtime Republican Sen. Thad Cochran, who resigned in April.A recent poll from NBC shows the “jungle” primary will likely lead to a runoff between Espy and incumbent Republican Sen. Cindy Hyde-Smith, who was nominated to replace Cochran by Gov. Phil Bryant.The poll put State Sen. Chris McDaniel, a conservative firebrand, in third and political newcomer Tobey Bartee, a Democrat, last.Dallas Breen, director of the Stennis Institute of Government, told Fox News the most crucial thing in this midterm is voter turnout, which Breen said could allow Espy to create cracks in the Republican stronghold of Mississippi.“He’s going to win because people like me and everyone else in here are going to get people to go out and vote,” veteran Eugene Horowitz said at a catfish fry campaign event, while sitting next to his wife.“I think he’ll be able to win because the people are uniting for inclusiveness,” Patricia Horowitz told Fox News over the live blues music.The largely African American crowd cheered after Espy spoke about bettering health care and reaching across the aisle in the nation’s capital.With a 38 percent African American population, the state’s forecasted high turnout could bode well for Espy – who hopes to garner the same enthusiasm black voters showed President Obama in 2008 and 2012. But Espy promised he’s reaching across race and party lines.“I can’t just win with black votes alone,” Espy said. “I have to win with all votes, white votes, black votes, doesn’t matter to me. Votes are votes.”Standing in his way may be the current Sen. Cindy Hyde-Smith, the first woman in the Magnolia State to hold the seat.  She hopes President Trump’s endorsement will drive Republicans to the ballot box but acknowledges the race will likely lead to a run-off, since she appears to be splitting votes with McDaniel in recent polls.“We are not flat-footed, we’re looking ahead because we have vision, we can see what the potential is and what the concerns are,” Hyde-Smith told Fox News. “We will be ready for the runoff.”\n      Sen. Cindy Hyde-Smith addresses the crowd at the state's annual hobnob event hosted by the Mississippi Economic Council.\n      (Fox News)Some experts suggest the outcome of the race will come down to who rubs more elbows with everyday voters – that’s because with three candidates significantly polling, each ballot is about more than who you’re voting for, it’s also about who you’re voting against.“The raw numbers of people who come out to vote – regardless of party identification - those people will have more of an impact on their candidate,” Breen said.But McDaniel, a conservative firebrand who gave away an AR-15 rifle at a recent campaign event, laughed at the idea of the Deep South sending anyone but a Republican to Washington, D.C. – calling even Hyde-Smith too liberal.“This is a Republican state, and it’s going stay a Republican state,” McDaniel said. “Anybody who says otherwise doesn’t know this state very well.”Espy disagreed. He pointed to Sen. Doug Jones’ victory in Alabama’s special election last year – and he said he is using the fellow Democrat’s campaign as a guide for his own.CLICK FOR COMPLETE FOX NEWS MIDTERMS COVERAGE“[Anytime something takes] place next door, so to speak it, it always opens that question of - well, if it happened there, can it happen here?” Breen asked.However, unlike in Alabama’s case, where Republican contender Roy Moore faced allegations of sexual misconduct, Hyde-Smith has largely been without controversy. As a result, Breen said, Democrats in Mississippi aren’t driven to polls with the same force.Hyde-Smith’s steepest criticism draws from her past as a Democrat, switching parties in 2010.Her leading opponent, Espy, is also taking heat. He was indicted in 1997 for receiving improper gifts while agriculture secretary – though eventually acquitted of all charges.Should the pair make it to a runoff, Breen said Espy has one potential saving grace: voter apathy.The underdog has a chance to switch the narrative, Breen said, “if [one party has a] strong core base that says, ‘I’m going to vote for this candidate and if he or she doesn’t win the [jungle] primary, I’m not going to vote.’”MIDTERMS' BIGGEST CAMPAIGN CONTROVERSIESHe suggested that could be the case for McDaniel’s base.“What I believe 20 years ago is still what I believe today,” McDaniel supporter, Marc Cotham, told Fox News. This is why, he added, he probably wouldn’t cast a ballot at all if the race went to a runoff between Hyde-Smith and Espy, suspicious of Hyde-Smith’s history as a Democrat.Across the table, another voter agreed, saying she would opt to write-in a candidate because Hyde-Smith is “wishy washy.”\n      McDaniel poses with a supporter, who won the raffle for an AR-15 rifle ahead of Mississippi's special election.\n      (Fox News)But these voters appeared to be in the minority at a McDaniel campaign event Thursday. Many admitted they would vote for Hyde-Smith if there was a runoff between the incumbent and Espy, which means Espy’s steep climb to a victory will become even steeper.While unlikely, Mississippi’s special election could potentially be the key to whether Republicans or Democrats control the Senate – a determination that may have to wait until after Thanksgiving if one candidate does not earn a majority of the vote on Nov. 6 in the Magnolia State.“I couldn’t even speculate what those three weeks would look like in the state if that were the case,” Breen smiled. “It would definitely be a first in my time on this earth to see something like that [in Mississippi].”This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}