{"id": "Washington man who raped, took lewd photos of dying woman gets less than 3 years in prison", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    A Washington man who raped and photographed a young woman while she was having an overdose was sentenced to less than 3 years in prison, shocking even the judge.A Washington man was sentenced Thursday to less than three years in prison after he raped a high school student as she was dying from a drug overdose and texting explicit photos of her to friends.Brian Varela, 20, of Lynnwood, Washington, pleaded guilty to second-degree manslaughter, third-degree rape and unlawful disposal of remains as part of a plea deal in the February death of 18-year-old Alyssa Noceda.Superior Court Judge Linda Krese said Thursday she could not sentence Varela to more than two years and 10 months because it was the most prison time permitted for someone with no prior criminal record, the Daily Herald reported.Krese said she was “surprised, even outraged,” by the inadequacy of the sentence and suggested that state lawmakers may not have realized the impact of their decision when they set prison sentences for the charges.SUSPECT RAPED, TOOK LEWD PHOTOS OF DYING WOMAN, THEN STUFFED BODY IN CRATE, POLICE SAY“I’m not sure the Legislature really contemplated something like this,” Krese said.Varela told detectives that Noceda was at a party in a mobile park home on Feb. 3 northeast of the Seattle suburb of Lynnwood. In Varela’s room, he said Noceda snorted Percocet and also ingested liquid marijuana, court documents stated. Tests later showed she had taken a fatal mix of fentanyl and alprazolam, a generic name for Xanax.Varela told detectives the woman collapsed within a minute of mixing the two. Authorities said Varela never sought help for Noceda and instead sent semi-nude photos of her to friends and texting “LOL, I think she od’d, still breathing.”“Bro you killed her,” a friend responded to him, according to the Daily Herald.\n      Alyssa Noceda, 18, died in February 2018.\n      Varela played an online game until he fell asleep, waking up in the morning to find Noceda’s lips blue, court documents said.He continued his day by going to work at Dairy Queen and his co-worker contacted police in the following days after Varela said he didn’t know if Noceda was still alive when he was having sex with her. Court records say he told a friend that “she died having sex with me” and that he was having sex with her “to pass the time.”Varela was arrested later that day after executing a search warrant and finding Noceda’s body stuffed in a plastic crate at the suspect’s home. He told investigators he planned to bury Noceda with onions to mask the smell, police said. He also told detectives that after Noceda died, he used her thumb to unlock her phone Feb. 4 and send messages to make it appear she had run away.WASHINGTON POLICE CHIEF SAYS HE WON’T ENFORCE STRICTER GUN LAWS THAT ‘INFRINGE’ ON CITIZENS’ RIGHTSIn court Thursday, Varela said: “I’m sorry for my foolish actions. Whatever I get is what I deserve.”Noceda’s mother, Gina Pierson, told Q13 Fox she was heartbroken over the sentencing.“I’m heartbroken,” Pierson said. “She deserves justice and she’s not receiving it.”She said she hoped lawmakers would examine the case and consider changing the laws in the state.“I’m just appalled. It’s a joke. A slap on the wrist for taking someone’s life and violating another human being,” she said.Fox News’ Paulina Dedaj and the Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}