{"id": "Tunisia PM faces confidence vote amid political tensions", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Rene Trabelsi stands as he introduced as proposed new tourism minister by Tunisian Premier, Youssef Chahed, during a confidence vote at the National Assembly in Tunis, Tunisia. (AP Photo/Hassene Dridi)Rene Trabelsi poses for photographers before being introduced as proposed new tourism minister by Tunisian Premier, Youssef Chahed, during a confidence vote at the National Assembly in Tunis, Tunisia. (AP Photo/Hassene Dridi)TUNIS, Tunisia – Tunisian Prime Minister Youssef Chahed faced lawmakers in a marathon debate Monday ahead of a vote of confidence needed to approve the government he reshuffled a week ago in a bid to end a months-long paralyzing political crisis.The debate was still going 12 hours later, a sign of the enmity coursing through Tunisia's political scene.However, the prime minister was unlikely to lose the vote due in large part to support of the largest parliamentary bloc, the moderate Islamist Ennahdha party, which has 68 seats in the 217-seat parliament. Chahed needed 109 votes to keep his government from collapsing.Chahed pleaded for \"political stability the nation needs to overcome difficulties,\" notably economic and social, ahead of 2019 legislative and presidential elections.Joblessness is above 15 percent, inflation is nearly 8 percent and trade and other deficits are chronic in the North African nation. The budding democracy, also coping with extremist attacks, is having trouble overcoming political problems despite major strides since autocratic leader Zine el-Abidine Ben Ali was toppled in 2011.Chahed, 41, incurred new anger among detractors a week ago, including from the Tunisian president and the prime minister's prime political enemy, the president's son, with his appointment of 19 new Cabinet ministers. The changes were aimed at \"ending the political crisis,\" he said, but the reshuffle exacerbated enmity from his opponents.The office of President Beji Caid Essebsi, who chose Chahed for the job of prime minister in 2016, said the president was informed of the changes \"very late\" and by mail.The president's son, Hafedh, who has risen to the top of the Nida Tounes party created by his father, has for months been in open conflict with Chahed, a one-time party figure.The powerful UGTT union has also demanded \"profound changes in the government\" — including its leader.The friction has kept the government from tending to the nation's business, and the daily concerns of Tunisians.While naming a new justice minister, Karim Jamoussi, Chahed made no changes to key ministries like interior or defense. He also brought some surprise faces into the government, notably a Tunisian Jew, Rene Trabelsi, as tourism minister, a first in more than 50 years — and one topic that raised questions during Monday's debate. He also named as minister of public function Kamel Morjane, who served as defense and foreign minister under the now-toppled Ben Ali.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}