{"id": "Trump says he'll pull US from nuclear agreement with Moscow", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          President Donald Trump walks from the stage at Elko Regional Airport, Saturday, He spoke about the INF treaty following his rally in Nevada.(AP Photo/Carolyn Kaster)\n          President Trump says he'll pull the U.S. out of its years-old Intermediate-Range Nuclear Forces Treaty (INF) with Russia.Trump says Moscow has violated the terms of the weapons pact, which dates to 1987, but he offered no further details on Saturday afternoon.The pact helps protect the security of the U.S. and its allies in Europe and the Far East. It bars its signatories, the U.S. and Russia, from possessing, producing or test-flying a ground-launched cruise missile with a range of 300 to 3,400 miles.Trump made the announcement following a campaign stop and Make America Great Again rally in Elko, Nevada.National Security Adviser John Bolton was headed Saturday to Russia, Azerbaijan, Armenia and Georgia. An administrative official, speaking on the condition of anonymity, told Fox News earlier this week that Bolton would be informing Moscow of the INF pullout during the trip.“Across two administrations, the United States and our allies have attempted to bring Russia back into full and verifiable compliance with INF,\" said the source. \"Despite our objections, Russia continues to produce and field prohibited cruise missiles and has ignored calls for transparency.”Said Trump. \"We are going to terminate the agreement and then we are going to develop the weapons\" unless Russia and China agree to a new deal.The Associated Press and Fox News' John Roberts contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}