{"id": "North Dakota women could buy marijuana-infused ‘inserts’ for menstrual pain if recreational measure passes", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          North Dakota residents are voting to legalize recreational marijuana in November.\n          (AP Photo/Ted S. Warren)If North Dakota residents vote to next month to legalize recreational marijuana, women in the state could be able to purchase an unusual item that’s said relieve menstrual-related pain: cannabis-infused inserts.A company called Foria, which makes cannabis-infused inserts, or vaginal suppositories, could sell the product in the state if the measure passes, KVLY-TV reported. One Park River resident, Stephanie Carlson, told the new station she’d be willing to try the product, noting that she'd be the “first in line” to purchase it.OBITUARY FOR MOM WHO BATTLED DRUG ADDICTION GOES VIRAL“I just want to be able to have that one week a month to not be hunkered down in pain. I want to be functional,\" Carlson said.Foria, which, according to KVLY-News, already sells its products in states such as Colorado and California where recreational marijuana has been legalized, says on its website that the vaginal suppositories are “specifically formulated for relief from menstrual discomfort.”The product, called “Foria Relief,” “delivers the soothing benefits of full-spectrum cannabis directly to the area that needs it most — typically with little or no psychoactive effects,” the company added.The vaginal suppositories are made with 60mg of THC and 10 of CBD. When smoked or ingested, the former cannabinoid gives you a “high” effect, while the latter, another cannabinoid found in marijuana, does not have any psychoactive effects.When inserted, the compounds “activate certain cannabinoid receptors in the pelvic region,” Foria says on its website, adding the “cannabinoids directly impact the immune system and the nerve endings of the uterus, cervix, ovaries and surrounding smooth muscle tissues,” to assuage the pain.The company claims most users “do not report experiencing a psychoactive high when taking Foria Relief vaginally or rectally,” but noted those who use the product will test positive for cannabis during a drug screening.Some user claim they experienced relief from cramping and other menstrual-related side effects in about eight minutes, Women’s Day reported in 2016. OPIOID CRISIS IS MAJOR MIDTERM ISSUE IN AREAS HARD HIT BY DRUG DEATHS\"On a monthly basis, I'm dealing with not just one day of pain, two days of pain. It can be anywhere between five and ten days of extreme pain,\" Carlson told the news station.\"If legalization were to happen, women like her, women like me, women like you, everybody, all women can have this option to not be in pain,” she added.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}