{"id": "Most UK firms to trigger Brexit safety plans 'by Christmas'", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          British Prime Minister Theresa May walks off the podium after a media conference during an EU summit in Brussels, Thursday, Oct. 18, 2018. EU leaders met for a second day on Thursday to discuss migration, cybersecurity and to try and move ahead on stalled Brexit talks. (AP Photo/Alastair Grant)\n          LONDON – The vast majority of British firms are poised to implement their Brexit contingency plans by Christmas if there isn't greater clarity over the country's exit from the European Union, a leading business group warned Sunday.The Confederation of British Industry said these plans could include cutting jobs, adjusting supply chains outside the U.K., stockpiling goods and relocating production and services overseas.The warning comes amid growing fears that Britain may crash out of the EU in March without a deal on the future relationship. That could see tariffs placed on British exports, border checks reinstalled, and restrictions imposed travelers and workers — a potentially toxic combination for businesses.\"The situation is now urgent,\" said Carolyn Fairbairn, the CBI's director general. \"The speed of negotiations is being outpaced by the reality firms are facing on the ground.\"Discussions between the two sides have hit an impasse largely over how to maintain an open border between EU member Ireland and Northern Ireland, which is part of the United Kingdom.A summit of EU leaders last week failed to yield a breakthrough. December is now the next scheduled EU summit, leaving the Brexit process tight ahead of Britain's official departure date on March 29. Even if a divorce deal is forged, there are doubts over British Prime Minister Theresa May' ability to secure the necessary majority in Parliament, given bitter divisions on the topic.\"Unless a Withdrawal Agreement is locked down by December, firms will press the button on their contingency plans,\" said Fairbairn. \"Jobs will be lost and supply chains moved.\"Fairbairn's warning was based on a survey of 236 member firms tilted toward small and medium-sized companies with up to 500 employees, undertaken from Sept. 19 to Oct. 8. The survey found that 82 percent of firms will have started to implement contingency plans by December if the Brexit process isn't any clearer.The CBI also said that 80 percent of firms say Brexit has already had a negative impact on their investment decisions, more than double the 36 percent recorded a year ago. The survey found that 66 percent of businesses said Brexit has had an impact on the attractiveness of the U.K. as a place to invest, while 24 percent said there had been no impact.Some big companies are becoming increasingly vexed by the impasse in the Brexit talks. Last week, ahead of the summit in Brussels, pharmaceuticals giant AstraZeneca and carmaker Ford issued statements raising doubts about their investments in Britain.\"Uncertainty is draining investment from the U.K.,\" said Fairbairn.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}