{"id": "Human bones found near Vatican Embassy, reviving decades-old mystery of missing teen girl: report", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Human bones were uncovered amid renovation efforts near the Vatican’s embassy in Rome, reigniting discussions about a Vatican employee’s teen daughter who vanished more than three decades ago, according to a report.\n          (AP)Human bones were uncovered amid renovation efforts near the Vatican’s embassy in Rome, reigniting discussions about a Vatican employee’s teen daughter who vanished more than three decades ago, according to a report.The Vatican, which announced the discovery on Tuesday, said that Rome’s chief prosecutor, as well as forensics investigators, had been asked to work on the case, according to The Associated Press.NEW YORK WOMAN, WHO VANISHED ON BUS TRIP TO FIND TWIN SISTER, STILL BEING SOUGHT 8 YEARS LATERThe forensics officials reportedly are attempting to figure out the age and gender of the person to whom the bones belonged, and when that individual died.Emanuela Orlandi, the 15-year-old girl who vanished in 1983, was not referenced by the Vatican, which revealed only that the remains were located near the embassy in the residential area of Parioli, AP reported.GRUESOME POMPEII DISCOVERY: ANCIENT CITY REVEALS GRISLY SECRETStill, the discovery of the bones prompted a resurgence of talk about her disappearance, according to the news outlet, which said Italian media quickly linked her unsolved disappearance to the remains.Orlandi went missing after she left her family's Vatican City apartment to attend a music lesson in Rome. Her father was a lay employee of the Holy See.Since that disappearance, there have been attempts to link the case to a variety of narratives, according to the outlet.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}