{"id": "Saudi Arabian sisters found dead, duct-taped together off New York City river had applied for asylum: report", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Sketches were released of the two women who were found bound by duct tape in the Hudson River near New York City's Upper West Side.\n          (New York Police Department)Two Saudi Arabian sisters whose bodies were found duct-taped together in New York City's Hudson River had reportedly applied for asylum in the U.S. before they went missing.The females — identified as Rotana Farea, 22, and Tala Farea, 16 — washed ashore on Oct. 24, according to the New York Police Department.The mother of the women told detectives that the day before their bodies were discovered, she received a phone call from the Saudi Arabian Embassy, the New York Post reported, citing police sources.SKETCHES RELEASED OF 2 WOMEN FOUND BOUND BY DUCT TAPE NEAR NEW YORK CITY RIVERThe Embassy reportedly told her that her family's residency in the U.S. was in jeopardy because Rotana and Tala applied for immigration asylum.The following day, their bodies were found in the Hudson River on the Upper West Side. The two were fully clothed, with no obvious signs of trauma, bound together by duct tape and facing each other, according to police.BODIES FOUND NEAR NEW YORK CITY RIVER IDENTIFIED AS MISSING SISTERS FROM VIRGINIATala was last seen on Aug. 24, according to a now-removed posting on the National Center for Missing and Exploited Children's website. The alert said she might be with her sister.A cause of death for the two women — both of Fairfax, Virginia — has not yet been determined.The Saudi Arabian Consulate in New York tweeted on Sunday officials were closely following the investigation into the sisters' deaths.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}