{"id": "Will America survive the growing insider threat in our homeland today?", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Violence remains unrelenting 17 years after the first U.S. combat troops entered Afghanistan; Lucas Tomlinson reports on the numbers.The threat of insider attacks in Afghanistan has always been a reality, but never before has it been so close to disrupting U.S. vital interests in such a catastrophic way. The same can happen here in America.A gunman dressed in an Afghan army uniform opened fire Thursday on Gen. Austin “Scott” Miller and other senior U.S. and Afghan leaders in Kandahar Province in Afghanistan. Miller, known his entire stellar career as the consummate “silent professional,” bore his sidearm, but did not have to fire, according to sources in the meeting.Another brave U.S. soldier killed the attacker, but not before the Afghan National Police commander, Lt. Gen. Abdul Raziq, was killed along with key members of the Afghan intelligence community. At least three Americans – a soldier, a contractor and another civilian – were wounded.Raziq’s death is a solid blow to the capacity-building efforts of the coalition forces in Afghanistan. He was a hero to the Afghan people and helped restore that nation and defend against Taliban and Al Qaeda terrorism.The lesson learned here spans beyond Afghanistan. Insider threats are real. They exist in insurgencies such as Afghanistan and they exist in politics.One example is The New York Times op-ed by an anonymous Trump administration official that sharply criticized the president and claimed officials were secretly working from within against the president.Another example involved Jackson Cosko, a former low-level staffer for Senate Democrats. He was arrested on federal and local charges earlier this month after he allegedly broke into the offices of Republican senators and doxed – or outed – their home addresses and phone numbers so that members of the anti-Trump resistance could harass or harm them.Just as Raziq’s death is a blow to progress in Afghanistan, every day that we have a surreptitious resistance that could lead to potential violence on the home front threatens our national interests.The parallel between the insider threat in combat and that in domestic politics, or even business, is important.In combat, we face an enemy who is attempting to disrupt U.S. vital interests with deadly force.In domestic politics, we have a resistance that is often peaceful, but sometimes violent, with the stated purpose of removing the duly elected president of the United States from office.As a country – both in combat overseas and in day-to-day operations in the homeland – we must do a better job of identifying insider threats. While those threats are more lethal in combat environments such as Afghanistan, Iraq, and Syria, the rules for identifying and stopping such threats with military power are clear. Meanwhile, the opposite is true in the homeland. The political correctness that reigns today makes identifying insider threats more challenging.Thankfully, there are tactics, techniques and procedures for identifying these threats and we need the courage to employ them in the homeland. We are thankful that Gen. Miller and his team survived the insider threat in Afghanistan as they defend America’s vital interests and make us safer by denying sanctuary to our enemies.The question is: Will America survive the growing insider threat in our homeland today?This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}