{"id": "Saudi Khashoggi saw Turkey as base for a new Middle East", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          In this image made from an Oct. 18, 2018, video provided by Metafora Production, Eiad Alhaji, left, edits video in his studio as Jamal Khashoggi on a monitor speaks during an interview held in March 2018 at an undisclosed location. Eighteen days after Khashoggi disappeared, Saudi Arabia acknowledged early Saturday, Oct. 20, 2018, that the 59-year-old writer has died in what it said was a \"fistfight\" inside the Saudi consulate in Istanbul. (Metafora Production via AP)\n          ISTANBUL – Friends say Saudi journalist Jamal Khashoggi was a proud Arab who wanted to set up a base in his ancestral homeland of Turkey, contributing to the growing community of exiled Arabs who have taken refuge there.For Khashoggi, a history lover, the growing Arabic community and Turkey's power in the region echoed aspects of the Ottoman empire, when Istanbul was at the center of a rich and multicultural Middle East. With millions of Arab exiles who fled their homes because of wars or oppression, Turkey has become a fertile ground for talent and ideas, a place where Khashoggi might be able to pursue his own projects, including a pro-democracy group, a media watch group, a forum to translate economic studies and launching online magazines.Khashoggi was planning to marry his Turkish fiancée on Oct. 3, a day after he walked into the Saudi consulate in Istanbul to get his divorce from a previous marriage confirmed. He had bought a home in Istanbul and friends said he planned to split his time between there and Virginia, where he had owned a condo since 2008.He never emerged from the consulate. Saudi authorities said Saturday that he died in a brawl involving visiting officials, an account that has drawn widespread skepticism. Turkish pro-government media say a Saudi hit squad traveled to Turkey to kill the columnist for The Washington Post which has called for an investigation led by a U.N.-appointed panel to determine what happened.Khashoggi's killing sent a chilling message to the many exiled Arabs who have taken refuge in Turkey. Several anti-government Arab TV stations broadcast from Turkey and Istanbul's Arab Media Association has about 800 members. Turkey has also welcomed thousands of members of Egypt's now-outlawed Muslim Brotherhood group, after its then-President member was ousted from power by the military in 2013. Many Syrian groups opposed to President Bashar Assad have also unsurprisingly converged in neighboring Turkey, where nearly 3 million Syrians have fled to escape the war back home.Eiad Alhaji, a Syrian filmmaker who was working with Khashoggi on a video about an Ottoman military figure central to Arab-Turkish relations, described their time together after work and interviews.\"We used to go together to sit and talk, two strangers outside our country and society, about what is happening with the Arabs in Turkey and in America. Me as a Syrian, and him as a Saudi Arabian,\" said Alhaji.\"He was pained to be living in exile but at the same time, he was glad to be free in his opinion and new life.\"Another companion, Fatih Oke, of Istanbul's Arab Media Association, said Khashoggi was an important adviser to the group and \"we had plans to establish some projects.\"In his last interviews, Khashoggi declared his support for Turkey's policy toward Syria, while criticizing his own government's stance.Saudi Arabia has grown closer to the U.S. policy in Syria, openly supporting Kurdish-led forces in eastern Syria that Turkey sees as a threat. Khashoggi had criticized his country's rift with Turkey, arguing that an alliance between the two regional powerhouses should come more naturally than a U.S.-Saudi partnership.Khashoggi, once a Saudi royal family insider, grew critical of the kingdom's rulers following their crackdown on opposition, their war on neighboring Yemen and the severing of ties with the small Gulf state of Qatar.Khashoggi found a \"welcoming place\" in Istanbul, said Azzam Tamimi, a British-Palestinian.\"In Istanbul you don't feel like a stranger, the people, the food, the habits,\" Tamimi said. \"Also, Turkey's current political authority has been the closest to Arabs since the fall of the Ottoman Empire a hundred years ago. Erdogan and his party opened up to the Arabs.\"Turkey has itself faced criticism for jailing more journalists during a crackdown after an attempted coup in 2016.Khashoggi's ancestors lived in what is today central Turkey. The family's name means spoon maker and its Turkish spelling is \"Kasikci.\"Alhaji, the filmmaker, said Khashoggi was an \"encyclopedia\" of the region's history.Alhaji worked with Khashoggi on a documentary on the life of Fakhreddine Pasha, the last Ottoman governor and military commander in al-Medina who defended the city in modern day Saudi Arabia against an Arab revolt during World War I.The siege signaled the fall of the Ottoman Empire and the birth of new Arab states. Khashoggi's family was displaced during the fighting — some fled to Izmir, in modern Turkey, including his father, while others went to Damascus.The legacy of Fakhreddine, who fought against the birth of new nation states to preserve Ottoman influence, is a deeply divisive issue between Gulf leaders and Turkey.Last year, Gulf rulers, critical of Turkish President Recep Tayyip Erdogan, compared the two, accusing Fakhreddine of robbing them of their heritage by taking manuscripts out of al-Madina to Istanbul as he left. Ankara, which sided with Qatar, responded by naming the street in Ankara of the Emirati embassy after Fakhreddine.\"This period is a turning point for the future of all Arab countries and Middle East,\" said Alhajji on what he believed Khashoggi hoped to convey with their project. \"We (should) not be focused on Fakhreddine as a biography but we should deal with the history of this period.\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}