{"id": "Obama, at Indiana, Chicago rallies, says character of country is at stake in midterms", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Former President Obama campaigns in Gary, Indiana.Former President Barack Obama spoke Sunday in Gary, Indiana and at a second rally in Chicago, delivering a closing argument for Democrats aiming to put a firm check on President Trump’s policies in Tuesday’s midterm elections.Speaking on behalf of Sen. Joe Donnelly, D-Ind., who faces a stiff challenge from Republican businessman Mike Braun, Obama said the vote on Tuesday is for the character of the nation.“America is at a crossroads,” Obama said in Gary, which is just across the state line from Chicago. “In two days, you get to vote in what I believe will be the most important election of our lifetimes. I know politicians always say that, but this time it’s really true.”He noted that creating civil rights for Americans, better health care and workers’ wages — and also preventing them from being rolled back happens with actions at the polls.He said Democrats are responsible for progress and Republicans like to be reactionary to that progress for a better nation. “When you vote, you can be a check on bad behavior,” Obama said.Obama repeated his attack on the Trump administration, but never mentioning the sitting president’s name, as he’s often done on the campaign trail this season.“Society doesn’t work unless words have meaning and consequences,” Obama said, as The Indianapolis Star reported. “And the only check right now on the behavior of these Republicans is you and your vote.”Obama ended his speech paralleling his mantra of hope and change: “Change is gonna happen. Hope is gonna happen. With each new step we take, hope will spread. Goodness will spread. And you will be the ones who will have done it. It starts with you. Let’s go vote. Let’s go make change. Let’s go make hope.”Democrats are counting on wresting control of the House from Republicans and hoping for a longshot series of wins to take back the Senate as well. But Republicans are optimistic they can gain seats in a Senate map heavy on red states and haven’t given up on holding the House.For Donnelly, who frequently touts how often he votes with Trump, the Obama rally is a little more complicated.Donnelly has angered some Democrats by tacking to the right in recent weeks and embracing some of Trump’s pet priorities, such as building a border wall with Mexico.CLICK FOR COMPLETE FOX NEWS 2018 MIDTERMS COVERAGEObama, on the other hand, has proven a polarizing figure with independent and Republican voters and is credited with some of Indiana’s rightward political shift, even though he won the state in 2008.To win in Tuesday’s election, Donnelly not only needs high turnout from his party’s base but also must peel off some moderate Republicans and independents.Trump was keenly aware of Obama’s upcoming visit, which he mentioned Friday during an event at an Indianapolis-area high school.“It’s no surprise that Joe Donnelly is holding a rally this weekend with Barack H. Obama,” Trump said as the crowd jeered in the conservative Midwestern state. He later added: “We don’t want to go back to the Obama days.”The former president also campaigned in his hometown of Chicago for businessman J.B. Pritzker, Democrats’ nominee for Illinois governor in his race against Republican Gov. Bruce Rauner, who came into office an outsider promising responsibly spending, lower taxes and clean government. It’s been a battle of wealthy titans spending their way through potentially the costliest gubernatorial campaign in U.S. history. The tough-talking Rauner finds himself in danger of becoming only the third Illinois governor since 1900 — after Democrat Edward Dunne in 1916 and Republican Richard Ogilvie in 1972 — to serve one four-year term but lose re-election. Only two incumbents have lost by more than 10 percentage points since the 19th century — in 1948 and 1960.WILL IMMIGRATION MAKE A DIFFERENCE FOR GOP AT THE POLLS?Stumping for Pritzker, the 53-year-old billionaire heir to the Hyatt Hotel fortune, Obama questioned the present reality of the American spirit, and asked the rallygoers to mobilize to the polls. “We are in this together, and we rise and fall as one nation,” Obama said. “Goodness and decency are still out there, kindness is still out there, generosity is still out there, hope is still out there, we just have to stand up and speak for it.He said there is a contest of ideas presently about what America is now and what the nation is going to be, and he said to choose hope over fear, and that regular Americans can check the privileged who may use their power and rhetoric to divide with ballots cast for the Democratic Party, who always have to clean up the mess that Republicans make in office. “They’ve racked up enough indictments to field a football team. No one in my administration got indicted,” he said about the Trump administration.Obama said progress in America is summed up with: “Ordinary people did extraordinary things.”The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}