{"id": "Missionary from Indiana shot dead amid fighting in Cameroon", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    \n          Charles Trumann Wesco, a missionary from Indiana (pictured with his wife Stephanie), died in northwestern Cameroon after being shot in the head Tuesday amid fighting between armed separatists and soldiers. (Facebook)\n          A missionary from Mishawaka, Indiana, died in northwestern Cameroon after he was shot in the head Tuesday amid fighting between armed separatists and soldiers, investigators said.Charles Trumann Wesco, who had been in the region for just two weeks, was rushed to the hospital in Bamenda after he was gravely wounded while in his car, hospital director Kingue Thomson Njie said.“He died in our hospital after all attempts to save his life,” Njie told The Associated Press.Wesco’s wife and eight children were still in Bamenda, he said. It was unclear if any of them were harmed or if someone else was with him in the car.Bamenda is in Cameroon’s Northwest Region, the restive English-speaking area where armed separatists have been fighting to create an independent state. Fighting between armed groups and the military is ongoing.Regional Gov. Deben Tchoffo said armed groups staged attacks to stop the reopening of the University of Bamenda, and the military fought back Tuesday. He said Wesco might have been caught in the crossfire.Republican Rep. Tim Wesco of Osceola confirmed the death Tuesday morning of his older brother.Tim Wesco said of his brother, “He loved the Lord. He loved people. The Lord giveth. The Lord taketh away. Blessed be the name of the Lord.”LION AIR JET HAD REPORTED AIRSPEED PROBLEM THE DAY BEFORE IT CRASHEDGov. Eric Holcomb issued a statement saying he and his wife, Janet, “are thinking of Rep. Tim Wesco and his family as they grieve the death of his brother Charles. We ask that all Hoosiers join us in offering prayers and condolences to the Wesco family.”Military spokesman Col. Didier Badjeck told the AP the military killed at least four suspects in Wesco’s death and arrested many others. He did not specify if the people detained were military personnel or separatists.Cameroon’s military said last week after launching attacks on suspected separatist training grounds that “many have been killed.” The attacks happened the day after President Paul Biya was declared the winner of a seventh term.AT LEAST 11 KILLED AS VIOLENT STORMS SLAM ITALYThe increased violence began after the government clamped down on demonstrations by English-speaking teachers and lawyers protesting what they called their marginalization by Cameroon’s French-speaking majority.Armed factions emerged after the government crackdown and have been using violence to push for an independent state they call “Ambazonia.”Protests against the 85-year-old Biya’s Oct. 7 re-election have been ongoing.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}