{"id": "Italian president calls WWI a warning to Europe to co-exist", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Frecce Tricolori  (Three Colors Arrows) acrobatic squad of the Italian Air Force flies over the Vittoriano, background center, the unknown soldier monument, on the occasion of the 100th anniversary of the end of WWI and Armed Forces Day, in Rome, Sunday, Nov. 4, 2018. (AP Photo/Gregorio Borgia)A woman holds a photo of New Zealand World War I soldier Vincent Stephensen prior to a World War I Centenary memorial service at the New Zealand Battlefield Memorial in Le Quesnoy, France, Sunday, Nov. 4, 2018. (AP Photo/Virginia Mayo)ROME – Italy's president lamented World War I's roots in \"aggressive nationalism\" and held up the European Union on Sunday as the \"highest expression\" of a commitment to common good needed to prevent catastrophic military conflicts.Commemorating the 100th anniversary of the end of the war, Italian head of state Sergio Mattaella also recalled Europe's history of anti-Semitism as he urged young people to remember the conflict's lessons while striving for peaceful coexistence.\"To celebrate together the end of the war and to jointly honor the fallen - all the fallen - signifies to reiterate with force, all together, that over the path of war, we prefer to develop friendship and collaboration,\" Mattarella said at a ceremony in Trieste, a port city not far from some of the deadliest battles between Italian soldiers and troops of the Austrian-Hungarian empire.The event was part of a week of observances planned for the centenary of Armistice Day. More than 60 heads of state and government, including U.S. President Donald Trump and Russian President Vladimir Putin, are expected to attend an international ceremony at the Arc de Triomphe in Paris on the Nov. 11 anniversary.French President Emmanuel Macron started a six-day tour of World War I battlegrounds Sunday night in the eastern French city of Strasbourg. Accompanying him were his wife, Brigitte, and German President Frank-Walter Steinmeier.On Monday, Macron plans to attend a ceremony in memory of the soldiers who died early in the war, during the Battle of Morang in 1914.In Trieste, Italy's president singled out the memory of a \"simple soldier,\" Vittorio Calderoni, who died from his wounds at age 17 just after World War I ended. Calderoni was the son of Italians who had immigrated to Argentina, but he sailed to Europe to enlist in the army and fight for Italy.Mattarella said he chose to pay tribute to him \"because Vittorio Calderoni was Jewish, the youngest of some 400 Italians of Jewish origin who died in the Great War.\" The president said he considered it his duty to note that in the same square where he spoke, late Italian dictator Benito Mussolini delivered a 1938 speech that ushered in \"the dark and tragic\" period of the Fascist regime's anti-Jewish laws.Mattarella encouraged young people to keep an \"active\" memory for the victims of wars as a way to consolidate freedom and harmony as \"irreversible\" choices for Europeans.In contrast, Mattarella said, the war demonstrated the \"incapacity of the European ruling class\" to pursue \"national aspirations and interests in a peaceful\" way and to thus surrender to \"aggressive nationalism\" and the desire for power.Rome is a founder of the European Union, the unity of which is being tested by rising nationalist sentiments in several member countries, including Italy, where a populist government took over in June.___Thomas Adamson in Paris and Luigi Navarra in Redipuglia, Italy, contributed to this report.___Frances D'Emilio is on Twitter at www.twitter.com/fdemilioThis material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}