{"id": "Kentucky state House candidate wins race by just one vote", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    A state House election in Kentucky shows that every vote counts. Jim Glenn, the Democratic candidate beat incumbent Republican Rep. DJ Johnson by just one vote.A state House election in Kentucky came down to the wire as one candidate was able to claim victory by just one vote.However, Jim Glenn, the Democratic candidate running for Kentucky’s state House District 13, beat incumbent Republican Rep. DJ Johnson with the crucial single vote.6,319 of those votes went to Glenn while Johnson received 6,318, The Washington Post reported.“I won by one vote,” Glenn told The Washington Post. “But a win’s a win — whether it’s by one vote or 1,000.”GOP’S MIA LOVE TAKES LEAD IN UTAH HOUSE RACE AS COUNT CONTINUESJohnson told The Associated Press he has not investigated to find out if any of his friends and family members did not vote.\"If someone came up and said that to me, I certainly wouldn't hold them guilty,\" he said. \"I have fought that urge to second guess. I know I ran the best campaign I could.\"\n      Democrat Jim Glenn's victory in Owensboro, Kentucky, was one of six state House races decided by a handful of votes.\n      (AP)It was not immediately clear who cast the last vote but Glenn told The Associated Press that 25 people approached him to tell him that they were that person who put in the crucial vote.Glenn previously represented the district from 2006 to 2017 but Johnson was able to take the seat from him for a year, The Washington Post reported.REPUBLICAN YOUNG KIM LOSES LEAD IN CALIFORNIA HOUSE RACE, ACCUSES OPPONENT GIL CISNEROS OF HARASSING VOTE COUNTERSThe Kentucky State Board of Elections will meet next week to certify the results, but Johnson said he intended to ask for a recount. State law would require the majority-Republican House of Representatives to oversee that process by appointing a commission of between five and nine members.Other elections that were close in the state included District 27, where Democrat Jeff Greer lost to Republican Nancy Tate by six votes. In District 96, Republican Jill York lost to Democrat Kathy Hinkle by five votes.All of the House races were upheld on Thursday by county boards of elections, when a review of results from voting machines did not change the outcomes.The Associated Press contributed to this report.This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}