{"id": "\nAlmost 700,000 march to demand ‘people’s vote’ on Brexit deal\nPeople’s Vote? ‘I want to tell my grandkids that at least I tried’The Observer view on the urgent need for a fresh vote on Europe | Observer editorialWhy the lies, Boris? The best banners from the People's Vote marchPeople's Vote: 'The last protest I went to was 47 years ago'", "paragraph": "Huge London demonstration was largest since the protest against the Iraq war in 2003\nToby Helm, \nMichael Savage and Eleni Courea\n\nSat 20 Oct 2018 20.40 BST\n\n\nLast modified on Sun 21 Oct 2018 12.37 BST\n\nThe centre of London ground to a halt as an estimated 700,000 people from all over the UK marched peacefully on parliament to demand a second referendum on Brexit. It was the biggest outpouring of public opposition to government policy since the anti-Iraq war protest in 2003.The number who descended on the capital to call for a “people’s vote” exceeded all expectations of both the organisers and police. Addressing the crowds, which included dozens of MPs from all political parties, the TV personality and food writer Delia Smith said Brexit threatened to cause “unmitigated chaos”.“The only way we can avoid this total madness and win back our future has to be a people’s vote,” she declared to loud cheers.The Liberal Democrat leader Vince Cable said the march showed that British people were beginning to realise that politicians could not deliver a successful Brexit that would protect their jobs, livelihoods and their children’s futures. They were afraid of the havoc that would ensue, and wanted a chance to stop it.“People have woken up to the potential disaster,” Cable said. “We’ve realised there isn’t a good deal coming out of this and a lot of people are frightened, people are worried.”The march coincided with a call from a senior government minister for Tory MPs to drop their “ideological obsessions” over Europe, which he said were now threatening to drive the country “off a cliff”.Foreign Office minister Sir Alan Duncan, the de facto deputy to foreign secretary Jeremy Hunt, said Conservative MPs and ministers now had a duty to show people they could deliver a sensible, moderate Brexit that was in the national interest. But this would never be achieved if so many remained entrenched in different ideological camps and refused to compromise.“There simply is no ideal outcome that will suit everyone,” he said. “People have to step back from their ideological obsessions and accept a pragmatic compromise. Otherwise we risk inflicting on ourselves massive economic damage, as well as political damage, domestically and internationally, for years to come.”He added: “This is the biggest ‘get real’ moment of my political life. The fate of our country for decades will depend on this. It is as if we are driving towards a cliff, but won’t face up to the reality that the road we have chosen will take us over the edge.”This weekend, however, there was no indication that Tory infighting over Brexit was subsiding. Theresa May is being warned by pro-Brexit cabinet ministers that they will vote against any deal she proposes unless they see legal guarantees that Britain can make a clean break in the future from the EU. Ministers including Andrea Leadsom, Penny Mordaunt, Esther McVey and Michael Gove are among those with concerns that moves to solve the Irish border issue could tie the UK to the EU for the long term. Tensions are expected to surface at this week’s meeting of cabinet ministers and a key gathering of May’s inner Brexit cabinet on Thursday.With May’s authority on the wane, Eurosceptic MPs and donors have been openly discussing the prospect of installing David Davis, the former Brexit secretary, as a short-term leader. A leadership challenge is triggered when 48 Tory MPs submit a letter to Sir Graham Brady, chairman of the backbench 1922 committee, demanding a contest.The Observer has spoken to MPs considering submitting their letters this week. “It is entirely possible that Brady will be making an announcement this week – that is how bad things are,” said one MP. “I’m afraid the last week has rightly reopened questions about the leadership.”Demonstrators on the march brandished placards saying “Parliament’s divided, the people must decide it”, “Why the lies, Boris?”, and “Time for an EU turn”.John Bramich, who made a four-hour car journey from Stockport to take part, said: “We hold a general election to choose a new government every five years or less. Brexit is something far more important. Saying that it’s undemocratic to hold another vote on it is nonsense.”Rodolfo Hermans, a Chilean-German national and nanotechnology researcher at University College London, who joined the demo, said: “The climate towards immigrants such as myself has become terrible. This atmosphere is a true hostile environment, and it is affecting not just those from the EU but people from across the world.”A Downing Street source said there would be no second referendum: “We had a people’s vote in 2016. A second referendum would really be a politicians’ vote – politicians telling the people they got it wrong the first time and should try again. That would do lasting damage to faith in democracy.Another pro-remain rally took place in Northern Ireland on Saturday, which converged on Belfast city hall. The crowd, waving EU flags and carrying anti-DUP placards, heard Alliance party leader, Naomi Long, describe the EU as a force for peace.She said the Brexit debate was not about protecting the UK’s union or creating a united Ireland, as it has been characterised by some on opposite sides of the issue.Long said: “This is about the people of this place coming together and saying, just like the EU, we value cooperation, we value immigration, we value working together in the best interests of everyone in this society.“That is why we value the EU, it is not just a model of cooperation, it underpins the very cooperation that we need here.” A pro-Brexit counter-protest in Harrogate, organised by Nigel Farage, was attended by roughly 1,200 people."}