{"id": "\nAltered States: Love Without Limits review – Louis Theroux treads his tightrope\n", "paragraph": "With his patented tone of careful interest, Theroux unpicked the world of polyamory, or people openly sleeping with other people while their partners keep determinedly smiling\nLucy Mangan\n\nSun 4 Nov 2018 22.00 GMT\n\n\nLast modified on Mon 5 Nov 2018 01.28 GMT\n\nWell, it turns out Portlandia didn’t show the half of it. Love Without Limits (BBC Two), the first episode of Louis Theroux’s new documentary miniseries, Altered States, took him to Portland, Oregon, the epicentre of polyamory, or ethical non-monogamy, as it is now called. It is centred on the facility of “compersion” – taking pleasure in seeing your significant other(s) happy in whatever way it takes. If you’re exhausted already, I’d advise you not to read on.Theroux gently interrogates three poly groups. Joelle, Mattias and AJ live and love together on an eco-homestead (I told you not to read on) and have other partners, too. Or in Joelle’s case: “‘Sweeties’ ... I tend not to use hierarchical terms in my polydynamics.” AJ is pregnant by Mattias and takes on another “metamor” (another non-hierarchical term used by the poly community) during filming. Mattias is surprised to find this testing his compersion capacity.Then there are Bob, Nick and Amanda, who live as a “thruple”. The latter pair were college sweethearts, but when Amanda developed feelings for Bob, she proposed inviting him into their relationship rather than breaking up. Nick – after a year of discussion – agreed. He remains monogamous with Amanda. They used to have threesomes because “we thought we had to”, but that didn’t work because “Bob lasts a really long time in bed and I don’t. So I’d have to go first or I’d fall asleep. Or go down and play video games or,” he added with a grin, “have lunch. But I’m better at foreplay, I enjoy it more.” Now they take it in turns. It seems to be working quite well. Not least, one suspects, for Amanda. “Is there a part of you that wishes you were enough for Amanda in the same way as she is enough for you?” Theroux asks the men in his patented tone of careful interest. “A little part of me wishes I could make her completely happy,” says Bob. At least one little part is working as hard as it can at that already.And then there is the married couple Heidi and Jerry; her lover, Joe; and his wife, Gretchen. To the casual observer, Heidi and Joe seemed to be stretching the definition of ethical non-monogamy. Gretchen said she was happy that Heidi was having the sex with Joe that she had lost all interest in having while they worked on other problems in their marriage. Jerry had a thousand-yard stare and a very soft voice while he insisted that everything was fine, after his period of “adjustment” when first an old friend of Heidi’s and then Joe inserted themselves into his marriage. “It was hurtful,” he remembers with a dreadful smile. “And anxiety-producing.” He has not yet found a partner. “But when I do it will be awesome.”Theroux presses both women on Jerry’s – self-evident, to Theroux and us – loneliness. Echoing other polys he has interviewed, they are both very clear. “I am not responsible for Jerry’s happiness,” says Heidi. “You are responsible for your own happiness,” says Gretchen. Jerry suggests he could join Heidi and Joe one night. Or at least watch. Heidi’s face tells you all you need to know about who their setup is benefiting. She slams the lid down hard on the idea. Compersion is a one-way street, apparently.Theroux, as ever, treads his tightrope without a wobble (unless you count the unnecessary stunt of sending him to a borderline-orgy, even if it did provide a little light relief). He asks just enough and just hard-enough questions to challenge his interviewees and force them (and us) to think, without alienating them, and hangs back enough to let the answers’ openness or person’s defensiveness, body language, pauses and silences say at least as much again. By the end, the issue is complicated rather than simplified and your own questions fill your head as the credits roll.Is polyamory a new way of dealing with ancient problems or just a new way of trying to avoid them? Is infidelity immoral, or only when it produces the look Jerry has on his face between determined smiles? What if it always, always does, somewhere along the line? Are we hardwired to betray or feel betrayed, or are these only constructs? If we’re not hardwired then why did we construct them in the first place? Is being responsible only for your own happiness a better basis on which to build a relationship or a society, or selfishness of the highest order that will sew the seeds of its own destruction? Are the polyamorous denying their essential humanity, indulging it or evolving beyond it?Answers on a postcard please. I am truly exhausted."}