{"id": "\nBrexit could kill off entire industries, says Jaguar Land Rover chief\n", "paragraph": "Ralf Speth calls for political action as CBI survey finds four out of five businesses have cut investment ahead of EU exit\nMichael Savage\n\nSun 21 Oct 2018 00.05 BST\n\nKey industries will be destroyed by a hard Brexit, one of the country’s most powerful chief executives has predicted, amid warnings that Britain’s imminent EU exit has dented investment by four in five businesses.Ralf Speth, the boss of Jaguar Land Rover, said that such an outcome would lead to the closure of plants and major job losses as he warned that some exposed industries would have “no way to survive a hard Brexit”.His stark intervention comes as Downing Street desperately tries to reassure the business community over Brexit, despite senior Tories such as William Hague now putting the chances of a “no-deal” outcome at 50%. Theresa May conducted a conference call on Friday involving around 130 business figures after a chaotic week that veered perilously close to the collapse of Brexit talks. She told them an emergency summit could still be called in November to finalise a deal.Speth stood by his claim that tens of thousands of jobs would be lost. “That’s correct,” he told the Your Money channel during a trip to Australia last week. “Everybody can do the maths. It is very open and very transparent. It is not only at Jaguar Land Rover, but it is also an element for the supplier industry and export industry in the UK.”It will be very, very critical if we see a hard Brexit or no deal. Companies will disappear, plants will be closed. There’s no way to survive a hard Brexit for many industries. But I hope again that the politicians see it and act for the benefit of their own population.”Speaking on the same programme, Hague said he believed that May was at the most precarious moment of her premiership. “That’s the realistic situation,” he said. “If everybody sticks to their current position, a deal won’t happen. There isn’t at this moment a majority in parliament.”British manufacturers have particular concerns over any introduction of border checks and delays. “The phrase ‘as frictionless as possible’ is no good to us,” said one industry figure. “We need zero friction, or we have problems.”In the latest survey of business opinion by employers’ organisation the CBI, 80% of companies reported that Brexit had had a negative impact on investment decisions. Almost two-fifths (39%) said they would trigger further contingency plans if there was no clarity by next month.Most companies said they would implement damaging contingency plans if there was no certainty over Brexit by December.One in five (19%) said that the moment the execution of contingency plans could be stopped had already passed. The survey included 236 businesses, representing 101 large companies and 135 small and medium-sized firms.Carolyn Fairbairn, the CBI’s director general, said that the prime minister’s negotiations were being “outpaced by the reality firms are facing on the ground”.“The situation is now urgent,” she said. “Unless a withdrawal agreement is locked down by December, firms will press the button on their contingency plans. Jobs will be lost and supply chains moved.“The knock-on effect for the UK economy would be significant. Living standards would be affected and less money would be available for vital public services including schools, hospitals and housing.“Many firms won’t publicise these decisions yet their impact will show in lower GDP years down the line. As long as ‘no deal’ remains a possibility, the effect is corrosive for the UK economy, jobs and communities.”John Longworth and Richard Tice, from the pro-Brexit Leave Means Leave group, dismissed the survey as no more than “political propaganda”.They said: “This lightweight survey, with a sample size of just 236 companies, is not indicative of the overall mood music of businesses up and down the country who just want the government to get on with it,” they said. “The CBI are crudely being the mouthpiece for ruthless multinationals and political elites who are prepared to sacrifice our long-protected democracy for their own pensions and profit margins.”"}