{"id": "\nDele Alli: ‘We don’t look back on the Iceland defeat with such anger now’\nJadon Sancho and Callum Wilson point to bright England future | Jacob SteinbergWayne Rooney tears stop Gareth Southgate’s England dressing-down", "paragraph": "\nPaul Wilson\n\nSat 17 Nov 2018 22.30 GMT\n\nThe situation for England on Sunday afternoon is somewhat strange, with both sides involved in the summer’s World Cup semi-final now capable of topping their Nations League group above Spain or being relegated to a lower level, though it certainly achieves the objective of providing a competitive fixture. Dele Alli shrugs and smiles. The last couple of years have been odd, full of ups and downs. He is used to it.“It is a strange one, but it’s another stepping stone for us,” the Tottenham forward says. “Croatia have proved they are a great team, so we know it’s going to be a difficult game, but we are still improving as I think we have shown. Our morale was always high even before the win in Spain, but to post a result like that was a big statement. We know what we are capable of and no one wants to be relegated.”England drew in Croatia last month, but came up short in Russia when in sight of the World Cup final after leading for much of the game. “Everyone was down after that, it probably rates as one of the worst dressing-room feelings I’ve ever had,” Alli says. “But it wasn’t the worst. I don’t think anything could match the Euros [in 2016] after the Iceland defeat for that.“This time it didn’t take too long to identify the positives and start feeling good about ourselves again. We knew reaching the last four in the World Cup was a massive step for us and the nation as well, we really felt like we were all in it together. As a player you are in your own little bubble at the World Cup, but we saw videos of how the fans were reacting and you could see it was really special.“When I got home from the tournament I had a lot of people coming up to me saying: ‘Thank you,’ and: ‘Well done,’ and sometimes they weren’t even Spurs fans. We are not perfect yet, we know we have still got things to work on, but we have proved we can beat the best teams and I don’t think we are that far away from winning trophies.”This is all a long way from the despondency Alli and his teammates felt in Nice in 2016 after the defeat that prompted Roy Hodgson’s resignation and led, via a short dalliance with Sam Allardyce, to the appointment of Gareth Southgate as England manager.To the dismay of most of the players, one of Southgate’s first acts was to make them relive the Iceland game. “We watched some of the game back and it was the first time I had seen it, because I had just been trying to pretend I wasn’t there,” Alli explains. “I think all the players just wanted to bury it, forget about it, but Gareth said to get over things like that you have to go through them again and see what went wrong. It was difficult watching it, everyone was very quiet, but I do actually think it helped. We still don’t really like to talk about it a lot, but we don’t look back on it with such anger now.”If anger seems an odd choice of word it is important to remember Alli was only 20 at the time and full of excitement at being called up. “For a few of us it was our first tournament with England and you have such high hopes, you go there with all that self-belief and then something like that happens which you just don’t expect. You go from feeling really proud of yourself to wanting to hide forever, and then you go from that sort of low to reaching a World Cup semi-final.”The next step for England, or stepping stone as Alli would have it, is to gain a result against Croatia to make up for the World Cup disappointment. Perhaps nothing will ever make up for the Euro 2016 exit, but Alli believes the side have grown up since the Iceland debacle. He says they were not expecting anything like that to happen, but he now realises they should have been better prepared.“When they took the lead we just froze,” he admits. “We didn’t expect it, we didn’t have another plan. It was like everyone was asking: ‘What do we do now?’ And nobody had an answer. When I was playing in that team I felt like we could beat anyone, then when it turned out we couldn’t beat Iceland I realised we had a lot of stuff we needed to work on. We should have had a second plan, but mainly we should have taken a deep breath, stuck to how we wanted to play and regained control of the game.“I would say we are better equipped to do that now. We are stronger mentally. I don’t want to jinx anything but the feeling around the team at the moment is quite different. You never quite know what is going to happen in football so you have to be ready for anything.“We’ve been working on preparing for situations like that and trying to stay calm. We might still go behind in games, but I don’t believe this team is going to panic.”"}