{"id": "\nPost-Brexit US trade deal risk to food safety, says ex-environment minister\nSafety controls on food imports at risk from no-deal Brexit, says report", "paragraph": "Lord Deben believes the British public will not accept lower standards of animal welfare\nFiona Harvey Environment correspondent\n\nSun 4 Nov 2018 22.11 GMT\n\n\nLast modified on Mon 5 Nov 2018 12.33 GMT\n\nFood safety in the UK and public confidence in it will be placed at risk if the government pursues a free-trade agreement with the US, a former Conservative environment minister has said.If imports of US-standard food were allowed, “you would have a huge decline in food safety,” said Lord Deben, now chairman of the Committee on Climate Change. “Food safety is a huge issue.”He said the US would stipulate allowing exports of its agricultural products to the UK in any free-trade agreement. “I know this – I’ve negotiated with them, for the whole of the EU,” he told the Guardian.“You have four times as much food-borne disease in the US,” he said, adding that the country’s standards on aspects of food safety, including meat and other agricultural products, were lower than those in the UK and Europe.Better known as John Selwyn Gummer, Deben was environment minister from 1989 under Margaret Thatcher and secretary of state for the environment from 1993 to 1997 under John Major. He is often cited by green groups as one of the best environment ministers, and has long experience of food safety issues. At the height of the BSE crisis, he became famous for feeding his daughter a hamburger on television to demonstrate the safety of British beef.Deben said the UK public would not countenance such a deal with the US because of concerns over food safety and lower standards of animal welfare in the US. “We wouldn’t treat our animals as badly as they do there,” he said. “I don’t think the British people would put up with it.”Agricultural standards became a flashpoint in the Brexit negotiations last year when Liam Fox suggested that US products such as chlorinated chicken could be imported. This raised concerns, partly over food safety, and also among the farming industry, because it could undercut higher-standard UK food, and jeopardise the UK’s farm exports to the EU.Michael Gove, the environment secretary, stepped in to say the UK’s high food standards would be maintained in any deal, a position that he has repeated.A government spokesperson told the Guardian: “We have been absolutely clear that we will not water down our high food safety in the pursuit of any future trade agreements. As we leave the EU, we are committed to securing the best deal for the food, fishery and farming sectors. While it is vital that we explore new trading opportunities, these should not mean a dilution of the standards for which British food is world renowned.”However, the issue is likely to remain a sore point, because the politically influential farming lobby in the US is likely to insist that agricultural products are part of any free-trade deal post-Brexit.Deben said: “If the US wants a free-trade agreement, they will want agriculture to be part of it. Fox won’t be able to do that. Fox is saying we will have a good deal. We will not, because the British people will not have it. You can’t sell that to the British people.”Deben is a vocal supporter of remaining within the EU. “Brexit will be a disaster,” he has said.A US government spokesman highlighted one form of food-borne illness: “According to both EFSA and US Centers for Disease Control, European consumers face far higher food-borne illness rates, particularly campylobacter, than US consumers. In 2016, campylobacter was the most commonly reported food-borne illness in humans in the EU and has been so since 2005. Nearly 250,000 cases were confirmed that year and the EU notification rate was 66.3 per 100,000 people.“This represented an increase of 6.1 percent compared with 2015. The United States has comparatively low rates of campylobacter. In 2016, 11.79 cases per 100,000 people were reported, a decrease from 2013, when 13.7 cases per 100,000 people were reported.”The spokesman added: “American food is produced in a different way than food from the EU. The ultimate outcome, however, for the consumer is the same-high quality, safe food at a reasonable price.“There is a wide range of agricultural techniques used in America. We are a world leader in farmland and products that are certified organic. Ninety-five per cent of US farms are family-owned.“Consumers can choose to purchase products that are certified as free range, cage-free and cruelty-free if they desire. At the same time, individuals and families who may not able to afford food produced by these more expensive methods have access to a wide range of high-quality, safe, and nutritious food products.”"}