{"id": "\nEngland sift through options for Sri Lanka, with Moeen a chance at No 3\nChris Woakes’s first Test hundred puts England in full control against IndiaBangladesh fall short as England secure victory on final day of first Test", "paragraph": "Pitch and weather have not helped Joe Root and Trevor Bayliss make up their minds for Tuesday’s first Test at Galle\nVic Marks in Galle\n\nSun 4 Nov 2018 22.11 GMT\n\n\nLast modified on Sun 4 Nov 2018 22.42 GMT\n\nLet us begin with the certainties. Jonny Bairstow is unavailable for selection for the Galle Test match on fitness grounds. Er, that’s it.Both Joe Root and Trevor Bayliss were singing from the same hymn sheet on Sunday but there was very little on it. We cannot be sure who is going to bat at No 3 for England on Tuesday; the balance of the side has yet to be finalised and we don’t even know who is going to keep wicket.They are not being deliberately obstructive. That has not been their way in recent times. In England they have usually been more than happy to name their side days before the start of a match since it can help the players to know what is going on as soon as possible. But here there are too many imponderables – about the pitch and the weather – and they need to do some more talking among themselves.As Bayliss reminded us, the system for picking the team is clear enough. “On tour it is Joe and myself. Obviously Ed [Smith] is here so we’ll run a few things by him. It’s not a vote sort of system. We’re all man enough to have a discussion, talk over the pros and cons and then come to an agreement”.It is bizarre that they have not decided upon their wicketkeeper, yet understandable. Much hinges upon the No 3 slot in the team. A week ago that position seemed destined for Joe Denly. This now seems less likely though this conclusion is reached via the odd nuance here, a change of emphasis there. It’s all good fun unless you are craving early clarity.Bayliss said: “Mo certainly could bat at three.” Root talked about the yearning to be bold and adventurous, which might involve changing the batting order during a game. One concern about Moeen Ali batting at No 3 – and there may be several – is that he may have just come off the field having bowled 40 overs.“We will see,” said Root. “We have so many different options we can go with [Bayliss suggested there were five]. It is not as clearcut as having a set order over here”If Moeen is earmarked for No 3 then the prospect of a debut for Ben Foakes, whose batting could be as productive as anyone else on the edge of the Test team, is real, especially since the perception remains that he may be the most gifted keeper here.Or there is the possibility of playing yet another all-rounder, Chris Woakes, who is probably too polite to point out that he hit a century in the last Test match played at Lord’s. However the likelihood of the phoneticist’s dream of Stokes, Foakes and Woakes in the same team remains small.Unless it rains so much that the duration of the game is severely limited, then the anticipation is that England will play three spinners. Asked if this was a viable option, Bayliss replied: “Very much so here in Galle. But that might be different at one or two of the other grounds.” The three-spinner option does not entirely rule out Stuart Broad but it would reduce his chances of playing.Root addressed the possibility of omitting Broad, who has just about been a fixture in the side for a decade. “It is always hard to leave out someone who has taken over 430 wickets. The great position we are in is that Stuart has practised really well; his action looks really strong and he is bowling with good pace. He looks right on top of his game so you can’t ask for more from a player.”At this point it sounded as if Broad was in, then the captain added: “For Stuart it wouldn’t so much be a case of being dropped. It would be for the balance of the team or for the situation with the surface, which could mean going with a different formula.” Later Bayliss added: “If he [Broad] does miss out on this one there’s every opportunity to play the next one”.Whatever the permutations, Root knows his team is overdue a win away from home and that historically Galle is not the likeliest venue to achieve this. England have not won a match overseas since squeaking home against Bangladesh in Chittagong over two years ago. However he remains refreshingly positive about this tour, despite all the impediments.He draws a contrast with last winter’s Ashes expedition: “It just proves how brilliant Test cricket is that you can go to two very different parts of the world and play two different styles of cricket which are both entertaining and great fun to be involved in while offering completely different challenges.” Even so it will be a relief to him and just about everyone else when the selection riddle is solved and we can focus on what is happening out in the middle – thunderstorms permitting.England (possible): Burns, Jennings, Moeen, Root, Stokes, Buttler, Foakes, Curran, Rashid, Leach, Anderson.Sri Lanka (probable): Karunaratne, Silva, Mendis, Chandimal, Mathews, de Silva, Dickwella, Dananjiya, Perera, Herath, Lakmal"}