{"id": "\nJonny Bairstow may have to serve England’s drinks a little while longer\nJoe Root can make England team his own as winter of rare content beckons | Tim de Lisle", "paragraph": "Joe Root has confirmed that Ben Foakes will start the second Test which suggests Bairstow is unlikely to force his way back into the starting XI in Kandy\nVic Marks in Kandy\n\nMon 12 Nov 2018 21.59 GMT\n\nThe stadium in Pallekele is something of a rarity in the cricketing world: an out-of-town venue that works really well. The practice facilities had the England team purring and they kept going for more than three hours in anticipation of a lighter workout on Tuesday in the interests of energy conservation. It is heating up in Sri Lanka and the locals say the rain has passed.The net pitches are excellent, though probably more helpful to the seam bowlers than the playing surface that awaits them in the middle, which is drier than anticipated. The outfield is a lush green carpet; the grassy banks square of the wicket are manicured and ready to receive thousands of English supporters and, hopefully, Sri Lankan ones. The stand, which houses the dressing rooms and the VIPs, not to mention the VVIPs, is spotless. In the background are the lush forests on the hillsides, a lovely sight, reminiscent of the Queen’s Park Oval in Trinidad, a venue England seldom visit now because it is not a prime holiday destination.England arrive in far better order than their opponents. Since Galle Sri Lanka have lost their captain Dinesh Chandimal to injury and their best bowler, Rangana Herath, to retirement, while Akila Dananjaya’s bowling action is now under scrutiny, though this does not prevent him playing in Pallekele if selected – he had a rotten time in Galle. The team manager, Charith Senanayake, has resigned “for personal reasons”.By comparison life is a breeze in the England camp. Suddenly for the Test side they are agonising over who to leave out rather than who the devil to pick. In recent times that has only ever been the case with the ODI team.As at Galle Joe Root was understandably reluctant to name his XI early; there had to be more pitch inspections, more fitness assessments of Jonny Bairstow and maybe a bit more thinking. He did offer one concrete bit of information, which was not a great surprise. Ben Foakes will keep wicket. It would have been quite a story if the opposite had been the case. After the Test at Galle Foakes said: “I guess he [Bairstow] is the number one and if I play one game I’m quite happy with that one”. This was never going to come to pass and even then Foakes’ remark seemed a consequence of post-match light-headedness or extreme politeness.Foakes had to play again, as Root explained: “We’ve come to Sri Lanka to win this tour and in these conditions I think Ben is the best option behind the stumps. Jonny is a fine keeper and what he’s done over the last couple of years has been exceptional. He’s pretty much been faultless, not really standing out which is probably a good thing for a wicketkeeper. Long term I see him as a focal part of the team. It is a great opportunity for Ben to show his ability and I think you’ve got to reward a performance like his last week.”The situation is tricky because it is common knowledge Bairstow wants to keep the gloves – Jos Buttler is less bothered at the prospect of being a specialist batsman. There is an element of tiptoeing around a sensitive issue in order to keep Bairstow as happy as possible. Buttler is now the vice-captain, so his words carry more weight and his praise of Bairstow – and Foakes – was equally fulsome. “Ben had a fantastic game in Galle and probably the best debut ever in Test cricket. By lunch on day two he had a hundred, a stumping and a catch. It’s going pretty well for him.“But you can’t forget what a fantastic wicketkeeper/batsman Jonny’s been for England for a long period of time. He’s done that job extremely well. You have to remember what a brilliant player he has been, one of England’s best for a number of years.”However warm the words there remains a good chance Bairstow will remain on the sidelines for at least one more match. The only player England could contemplate changing from Galle is Adil Rashid. He could be replaced by a batsman [Bairstow] or just conceivably by a paceman [Stuart Broad or Chris Woakes] though the likelihood of the latter is fading because of the dryness of the pitch. In Galle Root must have enjoyed having six bowlers at his disposal; he is unlikely to sacrifice that luxury.Buttler is the favourite to bat at No 3, even though Ben Stokes might be a better long-term option when the ability to play against fast bowlers with the new ball becomes more important.Buttler is up for the job. “In this part of the world it doesn’t matter too much. The style of cricket required is very similar wherever you bat with a 90% chance of starting your innings against spin. Potentially number three could be the best time to bat.”There is another very good time to bat in Pallekele: in the first innings of the match. A big toss awaits on Wednesday morning."}