{"id": "\nRepublicans break ranks with Trump over Saudi dissident’s death\nDisappearance of Saudi journalist Jamal Khashoggi – timelineJamal Khashoggi's death: what will Saudi Arabia do next?No one is convinced by the Saudi story of a ‘fistfight’ that went wrongUS ready to move on from Khashoggi case but will Turkey play along? | Patrick Wintour", "paragraph": "\nEmma Graham-Harrison, \nJulian Borger and \nBethan McKernan\n\nSat 20 Oct 2018 21.00 BST\n\n\nLast modified on Sat 20 Oct 2018 23.27 BST\n\nScorn and disbelief at Saudi Arabia’s official explanation of the death of dissident journalist Jamal Khashoggi mounted over the weekend, despite US president Donald Trump dubbing Riyadh’s belated confession that he had died “credible”.Speaking to reporters in Nevada, Trump said that it was possible that the Saudi leader, Crown Prince Mohammed bin Salman, had been unaware of the death.In America it became increasingly clear that top Republicans did not share their president’s view of Saudi claims. Riyadh said the journalist was killed in a “fist fight” as part of a rendition attempt gone wrong, after denying for weeks that he had come to any harm in the Saudi consulate in Istanbul.Florida senator Marco Rubio called the Saudi account of the journalist’s death “bizarre” and slammed authorities in Riydah for their lack of transparency. “Saudi Arabia’s changing stories on Khashoggi’s murder is getting old,” he wrote on Twitter.Along with other senior US politicians, Rubio said he would insist on a full investigation by US intelligence, and called for those responsible to face sanctions under the Magnitsky Act, legislation named after a murdered Russian lawyer which punishes Russian human rights offenders.Saudi Arabia released its account of Khashoggi’s death on the state news agency. It claimed the 59-year-old had got into a fight with 15 officials sent to bring him back to Saudi Arabia by force, including several members of the security forces.His body was disposed of by a “local collaborator”, officials later added. That claim allowed Saudi officials to disassociate themselves from the search for remains, which could potentially contradict their account.Turkish authorities have presented an entirely different version of Khashoggi’s last moments. In details slowly leaked to international and national press, investigators alleged the journalist was tortured and murdered and his body dismembered with a bone saw.They have provided details of 15 men who arrived in Istanbul from Riyadh on private jets owned by the Saudi royal family on the day of Khashoggi’s death, who included members of crown prince Mohammed bin Salman’s security staff and a well-known forensics expert.The Republican chair of the powerful Senate foreign relations committee, Bob Corker, also questioned the Saudi account.“The story the Saudis have told about Jamal Khashoggi’s disappearance continues to change with each passing day, so we should not assume their latest story holds water,” he said.“The US administration must make its own independent, credible determination of responsibility for Khashoggi’s murder under the Global Magnitsky investigation.”Under the law, the administration has 120 days from the day the Senate invoked Global Magnitsky, 10 October, to present the results of an investigation and a decision on sanctions.Khashoggi was a Saudi national but a US permanent resident, and wrote a regular column for the Washington Post. Saudi Arabia had been under significant pressure from the White House to offer an explanation in the escalating diplomatic crisis.Its eventual account appeared designed to protect the crown prince – the country’s de facto ruler – by painting a picture of failure in an operation run without his direct knowledge.The statements said 18 men had been arrested in connection with the “cover-up” and two senior officials, who were also close confidantes of the crown prince, had been sacked.Saudi Arabia’s allies in the region expressed support for the explanation. Trump described it as “credible” and the UK, another ally, cautiously acknowledged the Saudi version of events.A statement from the Foreign Office said the government was considering its next steps.But it was not clear the explanation, the sackings and claimed arrests would contain the damage to Riyadh. Its account raises serious questions, and the abrupt admission of murder after two weeks insisting Khashoggi had left the consulate alive have shredded Riyadh’s credibility.The UN secretary general António Guterres was “deeply troubled”, a spokesman said. He called for “a prompt, thorough and transparent investigation into the circumstances of Khashoggi‘s death and full accountability for those responsible”.The human rights group Amnesty International questioned the Saudi account and the executive director of the Committee to Protect Journalists, Joel Simon, derided Riyadh’s account as “ridiculous”. Both called for an impartial international investigation.Friends and colleagues of Khashoggi added a personal note to calls for justice when they resumed a vigil outside the Saudi consulate in Istanbul where he was killed, mourning his death and demanding “true justice” for those responsible.However Donald Trump’s son, Eric Trump, signalled continued Trump family support, insisting in an interview on Fox News that US-Saudi relations were too commercially and strategically important to allow the murder of a journalist to affect them.“What are you going to do?” he asked. “You’re going to take [that relationship] and you’re going to throw all of that away?”"}