{"id": "\nBernardo Silva criticises ‘complicated’ Wembley pitch after win over Spurs\nCan Mauricio Pochettino afford to tie his career to Tottenham’s stadium? | Barney Ronay", "paragraph": "• Manchester City midfielder says surface was far from perfect• Silva hails ‘big win’ that took City top of Premier League\nDavid Hytner\n\nTue 30 Oct 2018 22.30 GMT\n\n\nLast modified on Wed 31 Oct 2018 00.29 GMT\n\nBernardo Silva has lent his voice to the growing band of critics of the Wembley surface, describing it as complicated and a long way from perfect.The Manchester City midfielder played on it on Monday night, in his team’s 1-0 win over Tottenham – a result that returned them to the top of the Premier League and felt like a significant staging post in their title defence.Silva was surprised to see the state of the pitch, which was hard and without grass in long strips down the middle and the flanks. It was a legacy of three NFL games having been staged there in two weeks, together with last month’s Anthony Joshua title fight.Tottenham have committed to playing a further seven matches at Wembley – five in the league; two in the Champions League – because of the delays to the construction of their new stadium and there are concerns about the deterioration of the turf.“Everybody knows how difficult it is to play at Wembley against one of the best sides in England and with a pitch in those conditions,” Silva said. “It was a bit complicated. Everyone knew how the pitch was. The conditions were not even close to perfect. It was the same for both teams. We knew we had to try to win anyway.”Silva described the result as a “big win” and he acknowledged how City had now ticked off their away fixtures at Arsenal, Liverpool and Spurs. “It’s important to win these games, although we drew at Anfield,” Silva said. “They all now have to come and play at the Etihad, which is a bit better for us in front of our home fans.“We know we are one of the best teams in the world and we know our qualities. We want to keep going this way. It helps us a lot that we have won the title, previously. The team has a lot of confidence in all the players and we know what we are capable of. We know we can still improve a lot. We have to stay concentrated.”"}