{"id": "\nOfficer fatally shoots security guard who detained gunman at suburban Chicago bar\n", "paragraph": "Jemel Roberson, 26, was pronounced dead at hospital, and four other people were shot and wounded during incidentAssociated Press in Chicago\n\nMon 12 Nov 2018 22.17 GMT\n\n\nLast modified on Tue 13 Nov 2018 14.59 GMT\n\nA police officer fatally shot an armed security guard who witnesses say was trying to detain a man following a shooting at a suburban Chicago bar, authorities said.Investigators said 26-year-old Jemel Roberson was pronounced dead shortly after being taken to a hospital following the shooting early on Sunday at Manny’s Blue Room in Robbins, just south of Chicago. Four other people were shot and wounded during the incident, including a man who police believe fired a gun before police arrived, the Cook county sheriff’s spokeswoman, Sophia Ansari, said.When police arrived at the scene, Roberson was holding “somebody on the ground with his knee in his back, with his gun in his back,” witness Adam Harris told WGN-TV.“Everybody is screaming out, ‘He’s a security guard,’” Harris said.Roberson was licensed to carry a firearm, Ansari said.Charges were pending on Monday against the man who investigators believe fired the initial shots during a dispute. His name has yet to be released, and he remained hospitalized on Monday, Ansari said.Investigators said the initial gunfire was reported around 4am. An officer responding from nearby Midlothian encountered and shot “a subject with a gun”, the Midlothian police chief, Daniel Delaney, said in a statement. The person was later identified as Roberson.No details have been released about the officer. Roberson, who was black, was the only person killed in the shooting. The other four people who were shot suffered wounds that were not considered life-threatening, Ansari said.The Rev Marvin Hunter said Roberson was an “upstanding young man” and a promising keyboard player who played at his and several other area churches. Roberson was working to “enough money together for a deposit on a new apartment”, said Hunter, the great uncle of Laquan McDonald, a black teenager fatally shot in 2014 by a white Chicago police officer.Illinois state police are handling the investigation into Roberson’s shooting. The agency said it would not comment on the investigation until it is completed."}