{"id": "\n‘The coolest thing': Rahul Mandal crowned Great British Bake Off champion\n", "paragraph": "Mandal beats Ruby Bhogal and Kim-Joy after making doughnuts and an ‘edible landscape’\nJim Waterson Media editor\n\nTue 30 Oct 2018 21.15 GMT\n\n\nLast modified on Wed 31 Oct 2018 19.16 GMT\n\nA Rotherham-based Indian research scientist who started baking only two years ago has been crowned champion of this year’s Great British Bake Off.Dr Rahul Mandal said winning the programme was “the coolest thing that I have done in my life”. He said he had gained confidence by appearing on the show, adding: “I hope it helps me try new things and be a bit more adventurous in baking and life itself.”The series was filmed over the summer but the results have been kept under wraps until now. Mandal beat fellow contestants Ruby Bhogal and Kim-Joy after being asked to make doughnuts, bake bread on an open fire, and create an “edible landscape”.“Growing up in India we didn’t ever eat doughnuts, so I have never had one let alone made one,” said Mandal, explaining the difficulty of the challenge.Mandal said he had been baffled by the reaction on social media, where he has attracted praise from, among others, JK Rowling.“I watched the final with my parents, who are over from India, and friends and colleagues. It was very emotional but it was lovely to have the people who have helped me throughout my Bake Off journey watch it with me.”“Bake Off has given me a new family, I felt I had a mum, dad, brother, sister, aunt, uncle, as everyone in the Bake Off tent supported me in a weird and wonderful way. It was a very lovely experience with so many happy memories that I will never forget.”Mandal grew up in Kolkata before moving to the UK seven years ago on a scholarship to study for a PhD at Loughborough University.He is based at the University of Sheffield’s Nuclear Advanced Manufacturing Research Centre, where he helps to develop light-based measurement techniques allowing engineering components to be automatically inspected for contamination or flaws.“I love my work as a research scientist, and I think baking is a combination of physics, engineering and chemistry,” he said. “Baking and science are very related, the ratios have to be correct to make it work. I would like to make the science behind baking more accessible to everyone.”Judge Prue Leith added: “The amazing thing about Rahul and why I am so proud of him is that he came in unconfident, but he just kept going, and he never reined in his ambition. He always tried to do a bit more than everybody else, and it paid off.”The show has continued to be a major hit for Channel 4, who poached the show from the BBC in 2016 after agreeing to pay about £75m for three series.Despite introducing a new presenting line-up, ratings have remained strong for the commercial channel, with the latest series attracting about 9 million viewers per episode – down on its BBC peak but still making it by far Channel 4’s biggest show.However, the current deal runs out at the end of next year’s series and the channel could face competition from rivals as it prepares to renegotiate the rights to the programme."}