{"id": "\nChildhood obesity linked to air pollution from vehicles\nAir pollution linked to increased mental illness in childrenChildren are breathing dirty air – and parents are being left to fix it | Maria Miller and Ed Miliband", "paragraph": "Research suggests first year ‘critical window’ in which toxic air can increase weight gain\nDamian Carrington Environment editor\n\nSun 4 Nov 2018 22.00 GMT\n\n\nLast modified on Mon 5 Nov 2018 01.00 GMT\n\nEarly exposure to air pollution from vehicles increases the risk of children becoming obese, new research has found.High levels of nitrogen dioxide, which is emitted by diesel engines, in the first year of life led to significantly faster weight gain later, the scientists found. Other pollutants produced by road traffic have also been linked to obesity in children by recent studies.Nitrogen dioxide pollution is at illegal levels in most urban areas in the UK and the government has lost three times in the high court over the inadequacy of its plans. The pollutant also plagues many cities in Europe and around the world.“We would urge parents to be mindful where their young children spend their time, especially considering if those areas are near major roads,” said Jeniffer Kim, at the University of Southern California, who led the new research. “The first year of life is a period of rapid development of various systems in the body [and] may prime the body’s future development.”The World Health Organization (WHO) revealed last Monday that 90% of the world’s children are breathing unsafe air, a situation described as “inexcusable” by the WHO’s head. Concern over the impact of toxic air on children’s health is rising as research reveals serious long-term damage to both their physical and mental health.A large recent study found toxic air significantly increases the risk of low birth weight, leading to lifelong damage to health. Others linked air pollution with birth defects, cot deaths and the first direct evidence of pollution particles in mothers’ placentas has also been revealed.The new research, published in the journal Environmental Health, followed 2,318 children in southern California and built on earlier work which had identified traffic pollution as a major risk factor for the development of obesity in children.The research investigated the impact of air pollution from busy main roads, where diesel trucks are common, in the crucial first year of life. They found that by age 10, children suffering high early exposure were almost 1kg heavier on average than those with low exposure. The scientists took a series of other factors into account, including gender, ethnicity and parental education, and think it is unlikely that variations in diet could explain the strong link found.“Our study suggests that early life may represent a critical window of exposure where increased [air pollution] may result in increased risk for higher childhood [weight] trajectories, which in turn may lead to childhood obesity,” the researchers concluded.Other pollutants emitted by vehicles have also been linked to childhood obesity. A 2017 study in Boston implicated particulate pollution, while a 2012 study in New York City found the same for children exposed to polyaromatic hydrocarbons while in the womb.The new research was not able to examine how air pollution increases weight gain in the children, but Kim said inflammation was a possibility: “The most common thought is inflammation of body systems like the lungs which may spill over into the entire body – the brain which regulates appetite and changes in fat metabolism.”“This study showing an association between increased body mass in children and exposure to air pollution from roads is important since it is compatible with previous studies showing an association between type 2 diabetes and air pollution in adults,” said Prof Jonathan Grigg, at Queen Mary University London and not involved in the research.“However, more research is needed to explain how toxins inhaled into the lungs affect fat cells throughout the body,” he said. In mice experiments, brain inflammation caused by air pollution has been shown to result in anxiety-induced overeating.A separate new study on asthma, a disease long linked to air pollution and that is the most common chronic respiratory disease in the world, has estimated that between 9m and 33m emergency visits to hospital result from dirty air every year.The upper estimate represents almost a third of all emergency admissions suffered by the 358 million asthma sufferers in the world. “The findings estimate the magnitude of the global asthma burden that could be avoided by reducing [outdoor] air pollution,” the scientists said."}