{"id": "\nWill anyone prevent Manchester City from retaining their title?\nRock-solid John Stones shows quiet magnificence for Manchester City | Barney RonayLa Liga could teach the Premier League about being competitive", "paragraph": "Only 11 teams have done it, and only Manchester United and Liverpool have done it more than a couple of times, but Pep Guardiola’s men look a good bet to join the club this season\nPaul Wilson\n\nSat 17 Nov 2018 20.00 GMT\n\nOnly 11 clubs have ever done it, and one of the first was called the Wednesday. The official retitling of Sheffield Wednesday only happened in 1929, just in time to see it achieved again in 1930. Aston Villa managed it during the Boer war, Huddersfield between the wars and Portsmouth and Wolves during the cold war. The first time it occurred was in 1890, when Vincent van Gogh was still alive, just, and the most recent occasion was in 2009, when a frustrated Rafa Benítez famously came up with a list of “facts” about Sir Alex Ferguson’s supposed influence over referees.The subject under discussion is the retention of the English title, which has happened on 25 occasions in the 130-year history of organised league football. Manchester United can claim a record seven of those feats, six coming under Ferguson’s stewardship, and with five, mainly in the 70s and 80s, Liverpool are the only other team with more than a couple of back-to-back wins.Manchester City have won the title on five occasions without managing to retain it, or ever really looking likely to retain it, though the early signs this season suggest that could be about to change. In winning the title with a record total of 100 points last season, Pep Guardiola and his players gave themselves a hard act to follow. Yet the Premier League table indicates they remain on course. Their present total of 32 points from 12 games is not only higher than anyone else’s, it means if they carry on at their present rate City should once again end up in the high nineties after 38.Carrying on at their present rate may be the difficult part, naturally, though it is worth remembering that in those 12 games City have already beaten Arsenal, Tottenham and Manchester United, in addition to drawing at Anfield. Chelsea are the only one of their immediate rivals they are still to play, and the first meeting of the season takes place at Stamford Bridge in early December. By then Chelsea will have played Spurs at Wembley, welcomed back Claudio Ranieri for the derby with Fulham, and travelled to Wolves, where the newly promoted side somewhat surprisingly held City to a draw back in August. Maurizio Sarri has made a brilliant start in England – no newcomer to the Premier League has ever done better – though he faces some tough challenges if his side are to remain unbeaten until City come calling.Liverpool are also unbeaten and, despite losing three games, Tottenham are hardly out of touch, but as they demonstrated so effectively in last Sunday’s Manchester derby, City have the quality to rise above most rivals and stay out of reach.They still have Kevin De Bruyne to return from injury, too, which is unlikely to hamper their ability to move the ball around and break down stubborn opponents, but even without the Belgian Guardiola has class and creativity at his disposal in Bernardo Silva, Riyad Mahrez, Ilkay Gündogan, Phil Foden and the extraordinary David Silva.The only drawback to this sumptuous array of talent is the question Guardiola keeps being asked about whether the club’s murky financial background and lack of Uefa-compliant transparency will one day amount to an asterisk in the record books to indicate some trophies were won with unfair assistance. That is a polite way of saying some of City’s closest rivals are already accusing the club of cheating, the Football Leaks revelations having confirmed many suspicions and handed competitors a way of attacking Guardiola’s team away from the field.In reality it is not quite as simple as that. City were investigated by Uefa in 2014, before Guardiola arrived, and a settlement reached. Uefa’s financial fair play initiative is itself a flimsier structure than it might sound, and is widely believed to be a fairly crude attempt to prevent ambitious clubs such as City and Paris Saint-Germain using private money to break into the established elite, and long considered challengeable in court.City have so far not denied any of the allegations that have recently surfaced, though equally Uefa, having looked into the matter once, does not seem in a hurry to reopen proceedings.City have spent an inordinate amount of money and left themselves open to criticism, though the main offence is one of scale. It would be naive to imagine that other big clubs around Europe do not get away with what they can. As with PSG the City policy has been to try to smash the Uefa cartel through the force of money rather than legal confrontation, which may have been a strategic mistake, though unlike the French club they have at least ended up a convincing proposition on the pitch.To return to title retention, PSG have won the French league five times in the past six seasons and lead Ligue 1 by 13 points after 13 games thanks to a 100% record. That is impressive, though they are only third in their Champions League group after two draws against Napoli and a defeat at Liverpool.City are in a slightly easier group, it must be said, and they would have qualified for the last 16 by now but for Hoffenheim’s late equaliser against Lyon in the last round. Guardiola was disappointed because he wanted to put the issue to bed so as to be able to concentrate on the domestic fixtures between now and the turn of year.City will qualify if they avoid defeat in France next week, which should in turn give them an advantage over their closest domestic challengers, with Liverpool still having to take on PSG and Napoli. Liverpool have the Merseyside derby after their trip to Paris, then entertain Manchester United at the end of the week that brings Napoli to Anfield, so there are some high-intensity fixtures for Jürgen Klopp to worry about before he takes his team to the Etihad at New Year.Apart from their visit to Stamford Bridge, City have a relatively comfortable-looking run to the end of 2018. Appearances can be deceptive, but as José Mourinho pointed out in defeat last week, City came into the game with 12 goals in two games, as a result of “easy” victories over Southampton and Shakhtar Donetsk.City certainly made them look easy, for when they line up against most teams the gulf in class is as wide as the one found in the French League. The difference is that in this country there are a handful of powerful clubs who can still give City a game. Whether they can knock them off the top of the table is another matter. Having finally discovered real stability and consistency after more than a century of trying, City look a good bet to retain their title."}