{"id": "\nWomen drive record applications to Oxbridge and medical schools - Ucas\nApplying to university? Here's your step-by-step guide", "paragraph": "More students than ever before have applied for medicine as new medical schools open to make the NHS “self-sufficient”\nRachel Hall\n\nThu 25 Oct 2018 00.02 BST\n\n\nLast modified on Fri 26 Oct 2018 10.29 BST\n\nMedical schools have attracted record numbers of applications after the government expanded places to plug NHS doctor shortages, according to data published by Ucas, the university and colleges admissions body.This year, 65,870 people applied to elite courses and universities with a 15 October deadline, which include all courses at Oxford and Cambridge universities and most medicine, dentistry and veterinary science schools elsewhere. This represents a 7% rise on last year, which also saw record numbers.The number of applicants for medicine courses reached a five year high of 22,340 – a 12% rise on last year.In 2016, the former health minister Jeremy Hunt announced plans to train 1,500 extra doctors by 2020 at English universities to make the UK “self-sufficient in doctors” after Brexit. This has translated into an additional 500 places being made available this year, including at new medical schools which have opened in areas that struggle to recruit doctors, including Sunderland, Lancashire, Canterbury, Lincoln and Chelmsford.Clare Owen, assistant director at the Medical Schools Council, said that medicine courses have seen record applications for several years running. “Despite eventful times in higher education and beyond it remains one of the most highly regarded courses,” she said.She added that medical schools are looking to “encourage applications from groups that haven’t historically had a large presence in medicine”. This is in part thanks to the expansion of initiatives such as the gateway to medicine courses, aimed at students from low socio-economic backgrounds, which have grown from two in 2002 to 17 in 2019.Overall UK applications by the early deadline are up 9% from last year, despite a demographic dip which has meant there are 1.8% fewer 18-year-olds this year. EU demand has flatlined, while applications from international students from outside the UK have risen by 6%. Early deadline applications typically represent around 10% of the total cohort.The increase in applications is primarily driven by women who live in the UK, with 25,670 applying – a 12% rise compared with last year. Men saw a 4.7% bump, to reach 19,980 applications.In January, Oxford University offered more places to women for the first time in its more than 1,000 year history.Oxford did not disclose figures on the applicant gender split. A Cambridge spokesperson said there were slightly more male than female applications, which is “not unusual for us”. He added that there has been an increase of just over 1% in female applications compared with last year.Oxford’s director of undergraduate admissions and outreach Dr Samina Khan said the increase in applications was “down to many factors”, adding that the university “has worked hard to reach out to talented candidates from all backgrounds, particularly those from groups under-represented at Oxford”.Clare Marchant, Ucas’s chief executive, said the figures show that Oxbridge, medicine, dentistry and veterinary science are “as competitive as ever”.“At this early point though, only around 10% of this year’s cohort have applied,” she said. ““We will have to wait until the main deadline on 15 January 2019, and the cycle to progress further, to understand what the overall patterns of demand look like, changes in interest in specific subjects, and to see the impacts of efforts to widen participation and access across the board.”"}