{"id": "\nElectric fences and armed patrols: on the frontline of New Zealand's avocado war\n\nElectric fences and armed patrols: on the frontline of New Zealand's avocado war\nRecords smashed as avocado prices in New Zealand hit all-time highAvocado shortage fuels crime wave in New Zealand", "paragraph": "As the popularity of the fruit soars, growers in the Bay of Plenty have been forced to resort to extreme lengths to protect their crop from thieves\nEleanor Ainge Roy in Katikati\n\nTue 30 Oct 2018 22.06 GMT\n\n\nLast modified on Wed 31 Oct 2018 10.52 GMT\n\nIt was the wrong side of dawn when the makeshift alarm sounded, its shrill whirr slicing through the frigid winter night. Ashby Whitehead sprung from his bed and ran to his ute, hoping that his homemade booby traps had finally paid off.“I’d set up surveillance systems, a car alarm and tripwires but when it came down to it I wasn’t fast enough to catch them,” says Whitehead, an avocado grower whose orchards have been targeted five years in a row.It's hard to get your head around the things that happen for the sake of a fruit“It has moved on from opportunists to organised crime – they’re not scared any more, they’re so brazen, its just like money growing in the trees.”The global lust for avocados is driving a crime wave in New Zealand’s Bay of Plenty, where orchards line the state highway heavy with fruit – and largely unprotected.Sold on the blackmarket for a dollar apiece, thieves can easily pick thousands of dollars’ worth of fruit in one night. As demand has soared, gangs with links to organised crime in the nation’s biggest city are using increasingly sophisticated methods to target the superfood, including scouring satellite images on Google Earth to identify unsecured orchards.On the back of the fruit’s trendy reputation – and its popularity with millennials – New Zealand’s industry is undergoing a phenomenal growth spurt, rising from a net worth of NZ$70m in 2013 to NZ$198m in 2017.In the off-season, avocados can sell for NZ$7.50 each in New Zealand supermarkets. But the avocado has become a victim of its own popularity, forcing farmers to take the law into their own hands to protect their crop.“We’ve been working on the scarcity principle driving demand, but that’s backfiring a bit now,” says Ron Bailey, 78, an avocado grower in Te Puke for three decades.“People have been intimidated and attacked, its got a fair amount of scale behind it now. There’s a growing nervousness among growers – the thieves are getting bolder and pushing the limits.”There is no reliable data on the number of avocado thefts in New Zealand because police do not differentiate the fruit from other produce thefts, but anecdotal evidence suggests the crime is becoming more widespread and common.At least two people have been attacked by thieves on their orchards this season, and dozens of overnight raids have taken place on farms. The raids have been largely confined to the Bay of Plenty, though one Northland grower had 70% of his orchard pinched at a cost of NZ$100,000, according to reporting in the local press.Previously, avocado thefts have been treated as a bit of a lark, with reports of two elderly men robbing an orchard on their mobility scooters, and others using bed linen and garden rakes to nab their haul.But in the past two years the burglaries have become increasingly sophisticated – and increasingly dangerous – growers say, and they’ve been forced to respond with inventive means of protecting their homes, orchards and livelihoods.Electric fencing, CCTV cameras and sensor lights have become standard security features of avocado orchards in the past five years, but homespun protection methods include armed night patrols in hotspots, electrified tripwires and booby traps hooked up to firearms that fire blanks.“The last five years it has just exploded, it’s hard to get your head around the things that happen for the sake of a fruit,” says Alistair Young, a director at Southern Produce, an avocado supplier in Te Puna in the Bay of Plenty.“We’ve had more than a dozen incidents this season, and gangs coming back a second and third time once they realise they can get away with it.”Young has had two of his growers attacked when confronting thieves on their orchards. We haven’t seen the worst of this, because we’ve not yet reached peak avocado“They feel really invaded, it’s quite frightening and dangerous to have people on your property right next to your home – bloody cowards. Soon this whole region will be side-by-side electric deer fences.”Some fruit sellers and consumers are willing to turn a blind eye to criminal connections so long as their access to the green gold is guaranteed. Facebook has also become a prime outlet for selling hot fruit, police say, while some are offloaded at pop-up roadside stalls and at large produce markets in Auckland.According to industry body New Zealand Avocado global demand is growing 10% each year.Local growers – largely geared towards the valuable export market where massive expansion to Asia is planned – have been unable to keep up with the surge in appetite back home, where local avocados are the only option owing to strict biosecurity laws.When the veteran avocado grower Bailey and his wife visited California avocado orchards they were stunned to see 10 metre-high fences protecting the fruit, and more stunned when a local sheriff approached, asking what they were doing “casing out” the trees.“Police don’t have the time or the manpower here to race into the back blocks and chase down avocado burglars, so its up to growers to protect ourselves,” Bailey says. “We haven’t seen the worst of this, because we’ve not yet reached peak avocado.”In response to calls for assistance by industry leaders, New Zealand police have ramped up their response to the avocado crime wave. Senior Sergeant Alasdair Macmillan says a number of prosecutions are proceeding through the courts.And it’s not just fashionable avocados being targeted any more, says Macmillan – asparagus has started disappearing in “epidemic” proportions in the central North Island.“We don’t want to encourage people to go to arms but the intensity and the scale of the avocado crime has definitely stepped up and we know that is extremely frustrating for growers whose livelihood is threatened,” Macmillan says.“What we’re seeing now with avocados is similar to how the honey crime started, and that has now reached enormous proportions, with millions and millions of dollars of honey and bees stolen.”Ashby Whitehead says it is astounding to see the power that a humble fruit can exert, and how the landscape of the Bay of Plenty has changed as growers try to protect the region’s most valuable crop.“I bought tents and put them in the orchards with torches on all night, I had fences, gates, security cameras – the whole nine yards,” Whitehead says. “Nothing stopped them.“You used to get shot for rustling horses, you don’t get shot for stealing avocados. At least not yet.”‘We are experiencing a substantial earthquake’, the Deputy Speaker Anne Tolley says before asking people to clear the gallery in New Zealand’s House of Representatives"}