{"id": "\nJacob Stockdale scores only try as Ireland earn historic win over All Blacks\nAll Blacks’ Steve Hansen hails Ireland as best in world after defeatIreland’s 113-year wait over as O’Mahony and Marmion make magic | Andy BullIreland 16-9 New Zealand: rugby union international – live!", "paragraph": "• Ireland 16-9 New Zealand• Ireland see out their second victory over New Zealand\nRobert Kitson at the Aviva Stadium\n\nSat 17 Nov 2018 21.03 GMT\n\n\nLast modified on Sun 18 Nov 2018 00.20 GMT\n\nBrutal does not even begin to describe the contest but, for Ireland, the outcome was as beautiful as any in their rugby history. For the first time they have beaten the All Blacks on Irish soil and not a single Kiwi can say it was undeserved. If New Zealand are still officially the world’s best team, it did not particularly feel that way at the final whistle.It made for a legendary Dublin night. New Zealand may have escaped against England at Twickenham but not this time; the world champions were hassled and harried to a virtual standstill by a home team as composed and clinical as they were physical and powerful. A solitary 48th-minute try scored by Jacob Stockdale did not entirely reflect Ireland’s compelling efforts with and without the ball.At times it felt like one of those old-school heavyweight bouts: Ali v Foreman, the whole world watching. The body shots were shuddering, the commitment absolute on both sides from first to last. Rugby like this is as much elemental as anything else.New Zealand had not been rendered try-less since the second Lions Test in Wellington last year; once again they ended up choked in Andy Farrell’s defensive blanket.At the end it was hard to tell if the home players collapsed to the ground in ecstasy or sheer exhaustion. In the not-too-distant past Irish sides ran out of puff in the final quarter; as impressive as anything else on a clear, still evening was the manner in which they soaked up New Zealand’s inevitable second-half rally. The tackle counts of Josh van der Flier and James Ryan were almost as conspicuous as Tadhg Furlong’s front-row contribution but, ultimately, there were green giants right across the home team-sheet.Steve Hansen has spoken about past November losses feeling like rocks under his beach towel. In the context of next year’s World Cup in Japan, this one will feel boulder-sized. The next time these two sides meet could be in Yokohama on 2 November 2019 with the Webb Ellis Cup at stake. There are assorted other possible permutations but should the two sides win their respective pools another Rumble in the Jungle-type epic looks more than possible. If so, on this evidence, Ireland will be utterly unfazed, even if New Zealand are still clinging on to their world No 1 ranking for now.Under the command of Joe Schmidt, Farrell and their veteran captain, Rory Best, the Six Nations grand slam winners now exude the kind of inner belief that was once solely the preserve of the All Blacks. They should certainly have led by a wider margin than 9-6 at the interval, with New Zealand so flustered they conceded nine penalties to the hosts’ two. Johnny Sexton kicked three of them and almost created a try with a left-footed chip for Rob Kearney which a back-pedalling Jack Goodhue could not gather. The referee, Wayne Barnes, initially thought it was a try but the TMO spotted a fractional knock-on by Kearney on the floor.The All Blacks, thanks to a penalty and a snap drop goal from the fly-half Beauden Barrett, had to work hard simply to stay in the fight. With Devin Toner superb at the restarts and Van der Flier conspicuous in his scarlet headguard, the absence of Conor Murray, Sean O’Brien and Dan Leavy swiftly ceased to matter. The Irish still have remarkable totems such as Peter O’Mahony and Furlong, who has now played six Tests against New Zealand for Ireland and the Lions and lost just two.Already missing Sam Cane’s muscularity, the All Blacks also had to soldier on without Liam Squire, who limped off to be replaced by Scott Barrett. They badly needed a break, which almost arrived four minutes into the second half. Stockdale tried a little chip over the advancing cover, only for a leaping Kieran Read to charge it down. Had the Kiwi skipper scooped up the rebound it would surely have been a soft seven-pointer; crucially, the stooping No 8 could not quite do so.Instead it was Ireland who kept the clearer heads. Sexton, once again keen to explore the blindside, switched the ball right to Bundee Aki, who in turn fed Stockdale. This time the Ulster winger’s chip was perfect, as was the bounce. Over he slid, despite the attentions of Aaron Smith and Damian McKenzie, and the Aviva erupted.If the last quarter was rather more fraught, it further underlined the impressive depth at Schmidt’s disposal. Soon after the final whistle the triumphant strains of U2’s Beautiful Day blasted out into the still evening air; Chicago 2016 was special but this was pretty much New Zealand’s best-available team, with Japan 2019 just over the horizon. Can Ireland really win the World Cup? It is fast becoming a case of who can stop them."}