{"id": "\nGareth Southgate using Croatia’s ‘favourites’ claim against them\nCroatia coach Zlatko Dalic to speak to Dejan Lovren after Ramos elbow bragJadon Sancho and Callum Wilson point to bright England future | Jacob SteinbergWayne Rooney tears stop Gareth Southgate’s England dressing-down", "paragraph": "• England need Wembley win to reach Nations League finals• Defender Jedvaj said Croatia ‘favourites despite playing away’\nDominic Fifield\n\nSat 17 Nov 2018 22.30 GMT\n\n\nLast modified on Sat 17 Nov 2018 22.32 GMT\n\nGareth Southgate and his players hope to exploit Croatian over-confidence in Wembley’s winner-takes-all tie and end a resurgent year on a high by securing passage into the inaugural Nations League finals.Members of Zlatko Dalic’s squad have made a point of referencing Croatia’s extra-time victory over England at the World Cup – when they had apparently been motivated by a perceived lack of respect from their opponents – in the buildup to Sunday’s third meeting in four months. Tin Jedvaj, the Bayer Leverkusen defender whose stoppage-time winner defeated Spain on Thursday, suggested England had been beaten “without any problems” in Moscow and the visitors at Wembley should be considered “favourites, despite the fact we are playing away”.Those comments have been noted by England, who had created the better chances in a 0-0 draw behind closed doors in Rijeka last month, as they prepared for a game that could see either team claim the group and a place at the finals in June, but will definitely result in one of the sides being relegated to League B.“Whenever people speak, you give the opposition the opportunity to use those words as they see fit,” said Southgate, whose side must win to progress, with defeat or a score draw meaning demotion. “There were some comments from Sweden in the summer that we definitely used to our advantage. And you can steer that in any way, because half the players thought it was a current Sweden player and it wasn’t [Hakan Mild, a midfielder who played for Sweden in the 1990s, had spoken publicly before the quarter-final between the teams]. I wasn’t going to argue with them.“You always have to be conscious of how your words can provide motivation to the opposition. But for Croatia, it’s about how our mindset is for the game. We’ve got to play bloody well. They’re a good team and, with and without the ball, we’ve got to be spot-on to beat them. There’s no doubt there’s been huge positive strides this year. But for us, as a group of players and staff, we want to finish with a win that would take us to another semi-final.“We want to be involved in those games that matter all the time, and if we’re knocking on the door and picking up those experiences, that’s how you progress as a team. That’s how you learn to win these important matches. It would be the icing on the cake if we could win this game and take another forward step as a team.”Southgate’s selection for Thursday’s comfortable friendly victory over the United States had always been with Sunday’s critical tie in mind, and he will welcome back senior figures such as Harry Kane, John Stones, Raheem Sterling, Jordan Henderson and Marcus Rashford into his lineup. Joe Gomez, who has trained fully the last two days, will be restored to central defence, while Ross Barkley is preferred to Dele Alli alongside Henderson and Eric Dier in the midfield three. Only Jordan Pickford is expected to start a second game in succession.Southgate is insistent lessons have been learned from previous encounters, most obviously from the defeat in the Luzhniki Stadium in July. “We’d had just a couple of days to prepare for that game and months to watch it back since,” he added. “We haven’t beaten top teams, historically. That’s not perception, that’s the truth. It just hasn’t happened.“Winning this match wouldn’t change that for good, but what has been exciting is that we looked at the summer and what we achieved and asked: ‘What do we do to progress that forward?’ If you look at the five games we have played since, some of the performances have been very good, some of the results have been good, with wins against top 10 nations, and there’s been the emergence of more young players that has given us greater depth to the squad. This period is one where there has been improvement and progress.”Kane is seeking a first England goal since the World Cup knockout win over Colombia after a seven-game scoreless streak, his longest at this level. “I’d say we’re a better team now than we were in the summer,” the captain said. “We’ve learnt from those experiences and a lot from beating Spain in October, a victory I’ll remember for the rest of my life. We said after the summer the most important thing was not to fall off and go to the Euros without any momentum. We have done well in this Nations League. There’d be no better way to finish the year than by winning and getting into these semi-finals.”"}