{"id": "\nBali Nine prisoner Renae Lawrence to be released after 12 years in jail\nMember of Bali Nine drug smuggling gang dies in prisonAnother Day in Paradise review – a raw, emotional insight into Bali Nine artist's life on death row", "paragraph": "Lawrence’s father says he has known for some time that his daughter would be released next week Australian Associated Press\n\nMon 12 Nov 2018 23.29 GMT\n\nThe father of Bali Nine drug smuggler Renae Lawrence hopes she’ll be left alone to rebuild her life when she returns home next week after 12 years in Indonesian jails.Lawrence’s father says he’s known for some time that his daughter would be released later this month, after a series of reductions to her 20-year jail term for heroin smuggling.“We knew ages ago she was getting out on the 21st. She just wants to come home and get on with her life. We hope everyone respects her wishes,” Bob Lawrence told the Newcastle Herald.Officials in Bali’s corrections division have confirmed the 41-year-old will be released from prison that day, before being deported to Australia. Lawrence was a member of the Bali Nine group, caught trying to smuggle more than 8kg of heroin from the Indonesian island to Australia in April 2005.When she was arrested at Bali’s airport, she had 2.6kg of heroin strapped to her back and legs. She was sentenced to 20 years in jail, however her sentence was reduced last year.The Bali Nine ringleaders, Andrew Chan and Myuran Sukumaran, were executed by firing squad in 2015.Another member of the group, Tan Duc Thanh Nguyen, died of cancer while serving a life term.The other five – Su Yi Chen, Michael Czugaj, Matthew Norman, Scott Rush and Martin Stephens – are all serving life terms.In 2006, Lawrence used a media interview to apologise to the Australian public for the disgrace she brought upon the nation, but insisted she was forced into being a drug courier after her family was threatened.She said she was sorry for her actions but believed others would have done the same if they were in her situation. In August 2017 Lawrence had six months taken off her sentence, paving the way for her to be potentially released in 2018.Speaking through an interpreter, Bali’s head of Board Corrections, I Made Badra, told Ten News his team had been working with the Australian consulate on the logistics of Lawrence’s release.“On the day of her release, we’ll take her to Denpasar immigration for her passport and plane ticket with her status of deportation,” he told Ten News.Australia’s foreign affairs department would not confirm whether the reports were accurate.“The Department of Foreign Affairs and Trade continues to provide consular assistance to an Australian woman detained in Bali, in accordance with the consular services charter,” the department said in a statement.“Due to our privacy obligations we will not provide further details.”"}