{"id": "\nSoldier On review – veterans and actors join forces to tell military tales\n", "paragraph": "The Other Palace, LondonEx-service personnel work alongside professional actors in Jonathan Lewis’s ingenious piece of meta-theatre\nMichael Billington\n\nTue 30 Oct 2018 22.30 GMT\n\nWritten and directed by Jonathan Lewis, this is a play about the military community. What makes it unusual is that professional actors work alongside veterans in a show jointly presented by the Soldiers’ Arts Academy, which is dedicated to helping ex-service personnel fulfil their artistic potential. When, however, we were asked in a curtain speech to think of the Academy as “the Invictus Games of the arts”, I felt, as a critic, I was being put in an impossible position. Is one being asked to review a play or applaud a cause?That said, Lewis has created an ingenious piece of meta-theatre in which we watch a harassed director, convincingly played by David Solomon, persuading a group of ex-combatants and their families to tell their stories. We quickly grasp that post-traumatic stress disorder has a devastating effect on the families of those affected: wives have to cope with violent or estranged husbands, mothers feel alienated from sons. There are also examples of a communal spirit: the most moving involves a colonel, suffering from prostate cancer, recounting how a colleague covered up his involuntary urination at a memorial service.The truth is, however, that many films and TV documentaries have dealt with the difficulties of adjustment to civilian life. Although this show is very well staged and vigorously acted by a 21-strong company, it still leaves certain questions unasked: I’d like to have heard if ex-combatants feel a retrospective political anger at the sacrifices they were asked to make. What does emerge strongly is that the act of putting on a play is itself one of the most enlightened forms of rehabilitation.• At The Other Palace, London, until 24 November. "}