{"id": "\nFamine in Yemen could become one of worst in living memory, UN says\n", "paragraph": "Country is in ‘clear and present danger’ of mass deaths from starvation, top aid official says\nEmma Graham-Harrison\n\nThu 25 Oct 2018 00.00 BST\n\n\nLast modified on Fri 2 Nov 2018 16.48 GMT\n\nYemen is sliding fast toward what could become one of the worst famines in living memory, the UN’s top emergency relief official has warned.The country is in “clear and present danger” of mass deaths from starvation, and as many as 14 million people – half the population – could soon be entirely dependent on aid to survive, the under-secretary general for humanitarian affairs, Mark Lowcock, said.Fighting is blocking shipments from getting into the country, let alone to those who need it. Even after expanding relief operations to help an estimated 8 million people, it is not possible to reach all those in need. The looming disaster could be “much bigger than anything any professional in this field has seen during their working lives,” he said.Food prices have also nearly doubled in the country, Save the Children said in a new report.Yemen has been at civil war for three years after Houthi rebels backed by Iran seized much of the country, including the capital, Sana’a. Saudi Arabia and allies including the United Arab Emirates joined the war in 2015.Thousands of civilians have been caught in the middle by airstrikes and mortar bombardments. Trapped also by minefields, huge numbers are hungry and vulnerable to infectious diseases. The country’s cholera outbreak has become the worst in history.At least 10,000 civilians have been killed and millions displaced in what has become an urgent humanitarian catastrophe.Lowcock said intense fighting around the rebel-held port city of Hodeida, once the entry point for much of the country’s food, posed a particular threat. He called for a halt to fighting around ports, and protection for relief convoys across the country.Both aid and commercial shipments of vital food and fuel are unloaded at Hodeida, but fighting has blocked roads east and damaged infrastructure. Enough aid to feed 3.7 million people for a month is trapped in one warehouse.Hours after Lowcock addressed the UN, however, Yemeni officials said they were bracing for a fresh wave of attacks after the Saudi-led coalition – which backs the internationally recognised government of Yemen – sent reinforcements to the coast near the port. They include tanks and armoured vehicles provided by the UAE, the Associated Press reported.Each wave of fighting causes further damage to the port and its infrastructure, as well as adding to the death toll. At least 65 people have been killed and hundreds injured in the last 48 hours across Yemen, official sources said.The direct impact of the violence has been compounded by the slow collapse of the national economy. Many public sector salaries haven’t been paid for months or even years,. With up to a third of Yemenis employed in the civil service, millions have been left without any income.Even for those who are still getting paid, feeding themselves and their families is a challenge. The Yemeni riyal is now worth barely a third of 2015 levels, and the weakness of the currency and supply shortages caused by the war have combined to push food prices up.“The economic collapse is Yemen’s silent killer. Many Yemenis are struggling just to survive. Parents tell our staff how they’re skipping meals or are going up to two days without food to give what little they have to their children,” said Tamer Kirolos, Save the Children’s country director for Yemen."}