{"id": "\nDonald Trump sees terrorists everywhere, but not under his own nose\n", "paragraph": "The US president has been quick to paint the migrant caravan approaching America as a grave threat, but is muted on liberal figures being targetedContact author\n\nWed 24 Oct 2018 22.38 BST\n\n\nLast modified on Fri 26 Oct 2018 08.28 BST\n\nThis blunt-spoken White House, best known for its smash-mouth president, doesn’t usually shy away from fightin’ words. Just this week a tough-talking Donald Trump declared himself a nationalist, accused Democrats of organizing mobs, and dismissed Puerto Rico’s entire leadership as inept.Which makes it so glaring when Team Trump tiptoes so gingerly while talking about a series of pipe bombs. Normal people call a coordinated series of bombs something as simple as terrorism. This White House calls them “terrorizing acts”, presumably performed by actors rather than terrorists.For a group that campaigned on its desire to talk about “radical Islamic terrorism”, this is perplexing. Terrorism is meant to sow confusion and fear, but there’s nothing quite as befuddling to the Trumpsters as what appears to be anti-liberal terrorism.George W Bush used to say you were either with us or with the terrorists. Donald J Trump prefers to say there are very fine people on both sides.When he finally emerged to condemn the terrorism, Trump couldn’t bring himself to say the word. Instead he conjured up something altogether different. “Acts and threats of political violence have no place in the United States of America,” he said at the start of an event about opioid addiction.Acts and threats of political violence covers a wide range of stuff: insults, mobs, tweets, and apparently pipe bombs. There are Isis and Taliban terrorists who no doubt think they are engaged in acts of political violence. This president has chosen to call that terrorism. Then again, this president has also chosen to whip people at his mob-like rallies into a hate-filled frenzy. So it must have been someone else who made him say this: “In these times, we have to unify. We have to come together.”We surely do. And that unity needs to start at the top of the political system, inside a White House whose current unity-minded slogan is “jobs not mobs” and likes to talk about the media as the enemy of the people.Still, it’s good to know the Trump White House has great confidence in how these fear-inducing incidents will be handled.“These terrorizing acts are despicable, and anyone responsible will be held accountable to the fullest extent of the law,” the White House press secretary, Sarah Sanders, said in a statement. “The United States Secret Service and other law enforcement agencies are investigating and will take all appropriate actions to protect anyone threatened by these cowards.”Such confidence sounds just as strange as the weasel words about terrorizing acts.Because when it comes to the Great Terrorist Threat from the Southern Border, the White House has no idea how this country can respond. Faced with several thousand people several weeks away from its border, America is all but naked and helpless.“Criminals and unknown Middle Easterners are mixed in,” Trump tweeted on Monday about the migrant caravan making its way to the United States. “I have alerted Border Patrol and Military that this is a National Emergy [sic].”The “Emergy” services are all over this. US Customs and Border Patrol is the largest law enforcement agency in the country, with almost 20,000 border patrol agents alone. There are 19,000 national guard in Texas alone. The San Ysidro border crossing in California handles more than 2 million car passengers each month. The courts processed 22,000 asylum cases in 2016.America has most definitely got this. For obvious reasons, Trump hasn’t.As the midterm election campaign enters its final days, our tough-guy-in-chief has spent the last several days taking the fight to assorted brown-skinned people, imaginary terrorists and the enemy within who call themselves Democrats. In that context, you can understand why his response to real terrorism is so muted, confined to agreeing wholeheartedly with his vice-president.This muscular president thought he had found his perfect foil: a veritable caravanserai of the unclean, unsavory and un-American folks known as migrants. These people – if we can think of them as such – are in no way similar to the boatloads of unclean, unsavory and un-American folks who arrived on these indigenous-free shores over the last century.One of those floating caravans included Friedrich, a German teenager from Kallstadt who wanted to make his fortune and avoid military conscription. In this land of plenty, his grandson grew up to become an immigrant-hating president who married no less than two immigrants. That’s progress for you.People fleeing war and poverty like Grandpa Friedrich should not be confused with people fleeing violence and poverty today. There are several thousand of them currently walking the 1,000-mile journey from southern Mexico to the US border.Today’s huddled masses obviously include criminals and terrorists, according to the tough guy in the Oval Office. They are totally unlike his grandfather who hid his German heritage through two world wars because his type were widely considered to be the enemy.Those unsavory immigrants were so very unlike the Middle Eastern characters Trump claims have hidden themselves among the migrant travelers. And so very unlike the real terrorists who are sending pipe bombs to the president’s political opponents and the media.That’s the problem with creating fake crises to distract voters and journalists from an election campaign that is otherwise circling the toilet bowl. Real crises tend to poke their way through the sewage.For the last several days, media and political elites have suggested that we should either ignore Trump’s lies about the caravan or acknowledge that they are a brilliant political strategy. Both suggestions are about 1,000 miles away from the border known as reality.First, even Trump was forced to admit how baseless his own fantasy was. When asked for proof of his claim that Middle Eastern migrants were in the caravan on Tuesday, he admitted: “There’s no proof of anything but they could very well be.” Brilliant, this is not.Second, what kind of leader projects so little confidence in his own national security? Democrats should take pride in America’s border patrol if Republicans won’t. President Clinton supposedly said of George W Bush that “strong and wrong” beats “weak and right”. Somehow Donald Trump manages to combine weak and wrong at the very moment when he thinks he’s strong and right.Of course, in addition to playing one on TV, Donald Trump desperately wants you to know that he’s a tough guy. Those who oppose his hardman positions on trade, immigration or Russia are obviously the laughingstock of the world.Gone are the days when the world laughed behind the back of a weak superpower. Now they just laugh in his face at the United Nations. Gone are the days when America was weak on national security. Now we’re strong on caravans and weak on terrorists.The challenge for wannabe tough leaders is that you need do something tough when the tough times arrive. Agreeing with your vice-president doesn’t quite cut it. Because if you want to play the politics of fear, you should know that real fear trumps fake fear every time.Richard Wolffe is a Guardian US columnist"}