{"id": "\nQueensland pressured to abandon legal fight against domestic violence victim\nDoctors urge Queensland to help defeat anti-fluoride 'conspiracy theorists'", "paragraph": "Exclusive: Shadow attorney general says government should compensate Julie* for privacy breach\nBen Smee\n\nTue 30 Oct 2018 22.00 GMT\n\n\nLast modified on Tue 30 Oct 2018 22.02 GMT\n\nThe Queensland government is facing increased pressure to back away from a legal fight with a domestic violence victim, who is seeking compensation for breach of privacy.Julie* was forced to go into hiding after a senior constable, Neil Punchard, accessed her address from the police QPrime database and sent it to her violent former husband.The government does not dispute that Julie’s details were leaked. But it will fight the case at a Queensland Civil and Administrative Tribunal hearing next week in an attempt to avoid having to pay compensation for having to relocate her family.The Queensland shadow attorney general, David Janetski, said it was “hard to believe the lengths that this government has gone to cover-up for their own failures in this case”.“[The government] breached this poor domestic violence victim’s privacy by leaking her details to her violent former husband and they should compensate her for that,” he said. “Now they are trying to flex their muscle against her in any compensation claim in QCAT. The police officer involved may have been disciplined, but that doesn’t bring the matter to an end.”The Queensland premier, Annastacia Palaszczuk, has previously told Guardian Australia it would be inappropriate to intervene in the matter while a case was before the tribunal. The attorney general, Yvette D’Ath, would not comment on the case.But legal experts say that because the government is a party to the case it can easily choose to make a fair compensation offer to Julie, rather than seek to fight in the court system.Experts also say the state cabinet has oversight of the “model litigant” rules, which dictate how agencies are supposed to conduct themselves in legal matters. Those rules include provisions to ensure governments do not fight cases on technicalities, or take advantage of people who lack resources.Julie is self-represented in QCAT, which promotes itself as “fair, just, accessible, quick and inexpensive”. The government has been granted permission to brief a barrister at the hearing, despite any compensation being capped at $100,000.The police service has admitted during previous tribunal sessions that Julie’s privacy was breached. A recent interim judgment in the case noted the fact her details were leaked was not in dispute. The government will fight the case by claiming it is not responsible for the actions of the individual police officer who accessed the data system and passed on Julie’s address.Gabrielle Appleby, an associate professor in law from the University of New South Wales, told Guardian Australia the Queensland government’s model litigant rules state that the government must not seek to take advantage of an “impecunious opponent … which might indicate that the government has acted in breach of this rule in this case”.Appleby said governments took the position that model litigant rules were self-imposed, and therefore the responsibility of cabinet or the attorney general to police.Mark Thomas, a Queensland barrister and law lecturer at the Queensland University of Technology, agreed that cabinet was responsible for oversight of how government agencies conducted litigation.“The foundational principles which give rise to the concept of a model litigant come back to the rule of law. It’s not a long step from there to say the way [the government goes] about enforcing the law should meet certain standards.”The officer who leaked Julie’s details was disciplined but not suspended, sacked or charged with an offence.He accessed her address from the police QPrime database and sent it to her former husband, who has been convicted of domestic violence and faces another charge of breaching a domestic violence order.Punchard sent text messages to Julie’s former husband joking about the matter.“Just tell her you know where she lives and leave it at that. Lol. She will flip,” Punchard wrote in one message that was later sent to the Crime and Corruption Commission.* Julie is a pseudonym to protect her identity."}