{"id": "\nExpenses spared: Japan’s rugby union players are being paid just £13 per day\nEddie Jones calls on England to ‘physically smash cheeky Japan’Kieran Read suggests retirement plans before All Blacks beat Japan 69-31", "paragraph": "\nSean Ingle\n\nMon 12 Nov 2018 21.59 GMT\n\n\nLast modified on Mon 12 Nov 2018 22.25 GMT\n\nIf Eddie Jones’s warning that they will be “physically smashed” against England on Saturday was not jarring enough for Japan’s players, their coach has revealed his squad are being paid only £13.64 a day (2,000 yen) to represent their country.That amount does not even cover a steak (£19.45) or burger with chips (£13.75) at their trendy south-west London hotel and is a lot less than England’s 23-man squad who are on £25,000 a match per man.However, Jamie Joseph said his team are more concerned about making their mark at Twickenham than any financial reward. “Our guys here who are amateur, they are employees of companies, they get 2,000 yen a day. While our professional players, the foreigners we have in our team, don’t get paid for playing for Japan.“But they do it because they want to play a high level of rugby that they don’t get in Japan. Playing a team like England is a great opportunity. If you put that altogether we have got different motivators and we just want to get out and leave our footprint behind.”Joseph also refused to get drawn into a war of words with the England coach, who joked at the weekend that Japan’s team needed to “go to the temple and pray”. However, he admitted his young team could be up against it at Twickenham.“I am not sure we can run away from the big boys,” said Joseph, who has given up coaching the Super Rugby side the Sunwolves to fully concentrate on the preparations of the national team before next year’s Rugby World Cup on home soil. “One to 15 they are pretty big compared to our blokes. At the end of the day rugby is pretty simple, you have got to create momentum from set pieces and that is our first challenge and we are working on that.“When we can do that we can score tries and we did that against the All Blacks and we have done it against tier-one teams, France, Wales. But we are playing at Twickenham and the players are going to experience a different style of footy. The game in England is very different to other parts of the world and we have a realistic opportunity.”With some key players absent, Joseph is expected to blood a fairly inexperienced team at Twickenham although the captain, Michael Leitch, who inspired Japan to their shock win over South Africa in the 2015 Rugby World Cup when Jones was in charge of the Brave Blossoms, is still in the lineup.“There was a real rugby fever after the World Cup because of the success of the team,” Joseph said. “The majority of those players have moved on now so we have had to rebuild and bring new guys through. It has settled down but expectation internally in Japan is always high. Every team I have coached, there is always expectation to win. Externally, I don’t think there are many in this country who think we can do it.”Japan, who trained in torrential conditions on Monday, will need the weather to be fine to help their fast-paced phase play. “When we’ve got the ball and guys are really excited about playing, we’ve got a different style of play; we’re not as big as others, but we’re quick,” Joseph said.“In tough conditions it’s tough to get our game going, so we’re hoping and praying for a bit of weather. I’m not sure I’m going to the temple though!“We don’t want rain come kick-off time and I think we’ve shown over the last couple of years if we can get our game going we can push teams hard.”"}