{"id": "\nTrump says he'd prefer to choose woman as US ambassador to UN\nTrump says US will withdraw from nuclear arms treaty with Russia", "paragraph": "Nikki Haley to step down and Trump had suggested there was ‘no one more competent’ to replace her than daughter IvankaGuardian staff and agencies\n\nSat 20 Oct 2018 22.28 BST\n\n\nLast modified on Mon 22 Oct 2018 09.45 BST\n\nDonald Trump said on Saturday he would prefer to pick a woman to take over as United Nations ambassador when Nikki Haley steps down.Haley, a former governor of South Carolina, surprised Washington earlier this month when she said she would quit at the end of the year.Speculation immediately swirled around whether Trump would appoint his daughter Ivanka to the role. He acknowledged that would prompt charges of nepotism but said he was “not sure there’s anybody more competent”.The same day the president said that, Ivanka Trump, who like her husband Jared Kushner is a presidential adviser, tweeted: “It is an honor to serve in the White House alongside so many great colleagues and I know that the president will nominate a formidable replacement for Ambassador Haley. That replacement will not be me.”Trump has said he will consider Dina Powell, formerly deputy national security adviser in his White House. The ambassadors to France and Canada have also been reported to be under consideration.On Saturday, speaking to reporters in Elko, Nevada, after a campaign rally, the president said he was interviewing three women and two men for the position and would “pick someone very quickly”.Trump was asked: “Would you prefer it to be a woman.”“Ah, yes,” he said. “I’m going to pick the best person. We are interviewing five people, three women, two men. I think I might prefer that, but we’ll see.”Under Trump, working on national security and foreign policy does not convey job stability or a quiet life.Secretary of state Mike Pompeo is the second man in that job, after Rex Tillerson. Former Bush UN ambassador John Bolton is Trump’s third national security adviser, succeeding Michael Flynn and HR McMaster.In the same gaggle with reporters in Nevada, Trump announced that the US will withdraw from a 1987 nuclear weapons treaty with Russia."}