{"id": "\nAt home and abroad, Emmanuel Macron ploughs lonely furrow\n", "paragraph": "\nSimon Tisdall\n\nSat 17 Nov 2018 21.41 GMT\n\nEmmanuel Macron’s domestic difficulties and plunging approval ratings present a sharp contrast with his rising international profile. In a Europe lacking strong leaders ready or able to stand up to hard-right, populist nationalists at home and authoritarian regimes abroad, the French president cuts an exceptional figure. Or, at least, that is how he would prefer to be seen.As last weekend’s gathering of more than 60 foreign leaders at armistice services and a “peace forum” in Paris showed, Macron – France’s youngest leader since Napoleon – is not without ambition on the world stage. Le Figaro suggested the elaborate ceremonies marked the start of an “intense” French global diplomatic offensive in support of democratic, humanitarian and multilateralist values.Macron has backed events to celebrate the 70th anniversary of the Universal Declaration of Human Rights – Human Rights Day is on 10 December – and is preparing to use France’s 2019 presidency of the G7 to advance what he deems a progressive, internationalist agenda. He views May’s EU parliamentary elections as crucial to stemming Europe’s populist tide, and will actively campaign.Macron has already served notice on Viktor Orbán, Hungary’s anti-immigrant, anti-EU prime minister who was re-elected in a landslide earlier this year, that his ideas about “illiberal democracy” cannot stand. He has also targeted Matteo Salvini, Italy’s far-right deputy prime minister. Nationalism and hate were spreading “like leprosy all around Europe”, he declared last summer.Such a robust defence of Europe’s postwar social democratic order goes down well with centrist voters in countries such as Germany, the Netherlands and Sweden, where moderate parties of left and right have lost electoral ground. Macron frankly reviles France’s Rassemblement National (formerly the Front National) and Germany’s anti-immigrant Alternative für Deutschland.But the issue is not as clear-cut as his fans might pretend. Europe’s “mainstream” centre of gravity has shifted palpably to the right following the 2008 financial crash and large-scale refugee influxes. Orbán has many allies among Polish, Czech and Slovak nationalists. His views are echoed in Sebastian Kurz’s Austrian coalition, which includes the once-banned far-right Freedom party, and on the fringes of Angela Merkel’s ruling CDU-CSU alliance in Berlin. Enduring support for Brexit in Britain reflects this shift.Orban has helped create a new normal inside the EU.“Orbán has helped create a new normal inside the EU, a situation in which the bloc faces a choice between trying to force illiberal governments to toe some sort of liberal line and compromising with them as an acceptable reality. There are indications the Brussels bureaucracy may be going for the latter option,” wrote Bloomberg analyst Leonid Bershidsky.Macron’s attempt to play Europe’s champion is further undermined by claims that he is not quite the progressive he likes to appear. His own record on immigration is mixed, featuring border spats with Italy and Spain. His critics say he, too, harbours a haughty, authoritarian streak and that his neoliberal economic policies favour the better-off. Thanks largely to Merkel’s slow eclipse and Italy’s fiscal rebellion, his vaunted eurozone reforms appear dead on arrival.Macron’s one-man crusade to save multilateralism and the rules-based international order, while praiseworthy in principle, looks similarly ill-timed – and ill-fated. His attempts to seduce the arch-nationalist and protectionist Donald Trump with a mix of Gallic charm and straight-talking seemed to work for a while. The two engaged in an embarrassing love-in at last year’s Bastille Day parade.But all Macron’s wooing – he was dubbed the “Trump whisperer” – failed to shift Trump on key issues such as climate change, Iran, and trade tariffs. Last weekend, Macron lambasted America First-style nationalism, as Trump looked on stonily. Suddenly, the “bromance” was over. Caustic Tweets mocking France’s wartime record and jibes saying Trump lacked “common decency” ensued.The trouble is, where Trump leads, the world’s current crop of like-minded authoritarian leaders, from Russia and China to Turkey, Egypt and Saudi Arabia, follows. Macron may be in the right. He certainly has history on his side. But is that enough? Abroad, as at home, he is treading a lonely path."}