{"id": "\nDemocrat Andrew Gillum concedes Florida governor's race\n", "paragraph": "Candidate congratulates Republican opponent in campaign that went to the wireStaff and agencies\n\nSat 17 Nov 2018 23.22 GMT\n\n\nLast modified on Sat 17 Nov 2018 23.37 GMT\n\nTallahassee mayor, Andrew Gillum, has officially conceded the Florida governor’s race as a recount of ballots from the US midterm elections neared its end.“This has been the journey of our lives. We’ve been so honored by the support that we’ve received,” Gillum said in a video statement. “We know that this fight continues, in spite of the outcome of this election.”Gillum posted a live video on Facebook on Saturday afternoon in which he congratulated Republican rival Ron DeSantis. Gillum had conceded to DeSantis on election night, but retracted it after the margin between the two candidates narrowed.The race went to a legally required recount, but after an initial machine recount DeSantis still led Gillum by more than 30,000 votes.Gillum, who is Tallahassee’s mayor, isn’t saying what he plans to do next. “Stay tuned,” he said in his brief remarks. Nonetheless, Gillum says he will remain politically active, adding “the fight for Florida continues.”Gillum’s announcement came hours after the US president, Donald Trump, said on Twitter that Gillum will be a “strong Democrat warrior” and a “force to reckon with.”Congratulations to Andrew Gillum on having run a really tough and competitive race for Governor of the Great State of Florida. He will be a strong Democrat warrior long into the future - a force to reckon with!There was no immediate response from DeSantis or his campaign.Not many experts expected Gillum to win the primary to become the Democratic candidate in hotly contested Florida. As the nominee, he faced a difficult fight in a state that Trump carried comfortably in 2016, but he frequently polled ahead of DeSantis for much of a campaign that became a symbol for a fight between a predominately white Republican party and a rapidly diversifying Democratic opposition."}