{"id": "\n‘Backlash’: Northern Territory alcohol floor price divides community\nNorthern Territory repeals alcohol laws ‘discriminatory’ to Indigenous peopleRemote work-for-the-dole scheme a 'national disgrace', former Fraser minister says", "paragraph": "Minimum price for a standard drink was passed into law with minimal outrage. Then the price of beer went up\nBen Smee\n\nSat 20 Oct 2018 20.00 BST\n\n\nLast modified on Sat 20 Oct 2018 20.01 BST\n\nOne night in 1964 an Aboriginal man was dragged from his bed in the Bagot community, a settlement in suburban Darwin, and charged with the offence of drinking liquor.A report in the Northern Territory News, published the following day, said a “native” was sentenced to 14 days’ jail. Next to the article was a half-page advertisement showing a white man drinking a “beer that’s really beer”.This is how it’s always been in the Territory – a “dualistic framing” – according to Peter d’Abbs, the professor of substance misuse studies at the Menzies School of Health Research.“Aboriginal drinking is [viewed as] a problem, to be policed,” d’Abbs said. “Drinking by non-Aboriginal people is ... a ‘core social value’ and part of the ‘unique Territory lifestyle’.”The Territory has the highest per-capita rate of alcohol consumption in Australia, one of the highest in the world, and the highest rate of hospitalisations due to alcohol misuse. The statistics are worrying for both Aboriginal and non-Aboriginal people.Attempts to “dam the rivers of grog” have rarely been backed by effective resources or evidence, and almost all disproportionately targeted Indigenous people – until now.This month, the Northern Territory’s Labor government brought into effect a new policy, a “floor price” for alcohol; recommended by an inquiry and strongly backed by health researchers, academics, social organisations and a body of evidence that shows it has a tangible benefit in other countries.The measure, which sets a minimum price of $1.30 for a standard drink of alcohol, was passed into law with cross-party support and minimal outrage.Then the price of beer went up in Darwin.“It wasn’t handled well,” an NT Labor source told Guardian Australia. “We won’t drop the policy, and I don’t think we should. But we are in a muddle over it.“The [Northern Territory News] has just hammered us. No one thought it would be possible to lose government in 2020 but now I think we’re at the point where we will be running a sort of defensive campaign where we’re portrayed as the nanny state.”Labor won power in the Territory in 2016 with 59% of the two-party preferred vote. The government holds 18 of 25 seats in the legislative assembly. The opposition Country Liberal party has just two.The CLP was hounded from office after a four-year term that included two chief ministers, eight deputy leaders and 16 cabinet reshuffles, on top of a list of defections, sex scandals and stuff-ups. The new chief minister, Michael Gunner, promised stable government.In his government’s first two years, there have been no major political scandals, no leadership tensions, no cabinet sackings. That stability has, some sources say, irritated ambitious backbenchers forced to wait longer than expected for a promotion.Polling leaked to the ABC last month showed Labor leading the CLP 53-47 – a result that close would deliver a hung parliament. And now the mood of voters has turned darker.Gunner said earlier this year he wanted to “tear up the liquor act” and start again, amid reports of rampant anti-social behaviour caused by alcohol. The former supreme court chief justice Trevor Riley held an inquiry and came back with a suite of recommendations, including the floor price. The government set the floor price at $1.30 per unit of alcohol, deliberately set just below the current the price of non-premium Australian beer.The government gave assurances the measure would not affect the price of beer and it passed the parliament with little fanfare, and with strong bipartisan backing.Within days of the new laws coming into effect, bottle shops in Darwin reportedly increased prices for cartons of beer by up to 20%. Soon after, the CLP withdrew its support.The party’s leader, Gary Higgins, said that decision was made after “overwhelming feedback from Territorians sent a clear message to the opposition. We listened and pulled our support accordingly.”Higgins said the government had misled people about the impact of the policy. He said the government would also not commit to an independent evaluation of the floor price until after the 2020 election.“The implementation of this policy has been a complete failure by Labor, primarily caused by its lack of honesty with Territorians on the effect of the floor price.“The alcohol floor price completely fails to address the levels of chronic alcoholism in the Territory, and its effects on responsible drinkers.”The floor price effectively mandated price increases to the cheapest of cheap grog: cleanskin bottles of wine, cask wine and port. A study of drinking patterns among Darwin’s homeless found a preference for beer, but that port was consumed in the greatest quantity, because it was cheaper.Retailers went public last week and claim they’re now unable to offer popular bulk specials on beer. NT Consumer Affairs warned the cost of beer and other drinks may be increasing “well beyond the floor price legislation” and voted to investigate retailers who blamed hikes on the new laws.Wine retailers have pulled their products from the Territory. One online retailer, Naked Wines, said it had increased costs.The winemakers’ federation of Australia even suggested the floor price was “unconstitutional” but agreed to support the government in an attempt to evaluate whether the measure was effective.“We would hate to see other states bringing in a measure that is not only illegal but doesn’t work,” the federation’s chief executive, Tony Bataglene, said.Backlash has been stirred and sustained by local media. The Northern Territory News dedicated five front pages to the politics of the floor price in recent weeks. Talkback callers have been angry. Anti-government sentiment has amped up on social media. An NT News poll showed 80% of people were opposed to the floor price.The health minister, Natasha Fyles, admits the government “might have been simplistic” in its explanation of how the floor price would operate.“We’re trying to give consumers the tools so they understand how it works,” she said. “It only affects 25 to 30 products and some specials, there’s only a very small number of products it impacts on, but the evidence shows it works.”Fyles said retailers “can price their products wherever they want” but that those decisions were commercial, not related to the floor price. She said the government would continually monitor the program and that a formal review would be conducted in three years, as recommended by the Riley inquiry.“This is just one measure of 219 that we’re putting in place,” Fyles said. “Grog and the harm it causes has always been an issue in our community. As a responsible government we need to put this measure in place and give it time.”The floor price is backed by the Alcohol and Drug Foundation, the Foundation of Alcohol Research and Education, the Public Health Association and the National Alliance for Action on Alcohol.A coalition of health, justice and social services organisations in the Territory released a statement last week to back the plan, amid growing criticism.“It is disappointing to see politicians step away from a strong evidence base under the influence of popular opinion,” the groups said.John Boffa, a doctor who speaks for the People’s Alcohol Action Coalition, has been campaigning for similar measures in central Australia since the late 1980s. He said that a week after the floor price was introduced, combined with a more permanent presence of police outside bottle shops, emergency department presentations at the Alice Springs hospital dropped from 150 a day to 95.“We’ve known for a long time that to reduce consumption and harm, you’ve got to address price,” he said. “The floor price doesn’t make us a nanny state. The state is trying to meet its obligation to keep its citizens free from preventable illness, injury, violence and neglect.”Boffa rattles off figures – every week in the NT there are two deaths, 52 hospitalisations and 69 assaults due to excessive drinking. Territory drivers are 20 times more likely to be caught drink-driving. The road death toll is four times the national average. Alcohol is a factor in 53% of assaults and 65% of reported family violence.He says Territorians, “Aboriginal and non-Aboriginal alike”, have a problem with alcohol.“43% of Territorians drink at risky levels, yet Aboriginal people make up just a third of the population. The alcohol-related death rate for non-Aboriginal Territorians is twice the national average and the assault rate amongst non-Aboriginal men, largely alcohol-related, is nearly as high.“The backlash is because this is affecting people who wrongly think they’re responsible drinkers. We think it’s going to make a huge difference.”D’Abbs said the Territory had, prior to 2016, taken a “grandstanding” approach to liquor policy.“We had a pretty unseemly sequence of governments rejecting the notion that alcohol was some sort of community-wide problem and using the language of the ‘problem drinker’,” d’Abbs said.“For most of that period [since self-government was granted in 1978], most of the measures ... rested on the assumption that alcohol problems equal Aboriginal problems and that the plainly obvious culture of heavy drinking in the Territory among non-Aboriginal people is something to be overlooked or celebrated.“Population-based policies around drinking are very difficult to sell because of this notion that drinking is some sort of inalienable right”."}