{"id": "\nThe People’s Vote is a cause worth marching for\n", "paragraph": "\n\nSun 21 Oct 2018 00.05 BST\n\n\nLast modified on Sun 21 Oct 2018 00.06 BST\n\nApproaching 700,000 people marched on Saturday for a People’s Vote – from London’s Marble Arch to Parliament Square. The crowd seemed endless. Yet as the marchers knew full well, they have no purchase on either a Conservative party consumed by civil war and unable to coalesce around any kind of compromise, or on a Labour leadership absurdly wanting to be both in and out, and soon to descend into its own civil war. So did the march mean anything?I was there, walking all the way with marchers that Saturday’s Sun leader had described as having a collective hissy-fit and full of hate. A less hate-filled crowd you could scarcely find. It was good humoured, funky and fun. But for all that, the question I was asked repeatedly was if I thought anyone was listening. Was the march worth it?Unambiguously yes. This was the biggest protest on the streets of London since the Iraq war. The Sun was no less scornful of the protesters then, and the political class no less equally keen to ignore them. But 15 years on there is no doubt that the Iraq war was a first-order calamity. It triggered mayhem in the Middle East for zero gain, along with stunning death and destruction. When people are roused in their hundreds of thousands to give up their time for peaceful protest, they are never wrong. They are not wrong now. The Leave “side” could not mount a protest of a similar scale – and if did, it really would be consumed by hate and rage.For the political energy and momentum is with Remain. The EU is a noble cause – and leaving it will weaken us in every way. Brexit, as the many witty placards proclaimed, was a lie built on a con. If there is another vote, it will undoubtedly be won by Remain.It will also shatter the Conservative party. Around what proposition on Europe could its warring factions unite for a general election manifesto? Ignore the absurd arguments that the people having a second vote is somehow undemocratic – or that there would be civil disturbances if Remain won. They are from Conservative apologists keenly aware that for Tories the stakes are now existential: the ongoing coherence of their party. We Remainers did not start or want this de facto civil war. But the message of Saturday was that we will contest Brexit every inch. We are as passionate as any Brexiter, and there are a lot of us. The Sun was wrong on Iraq. It is wrong on Brexit."}