{"id": "\nWayne Rooney: some ex-players cannot come to terms with this England team\nDele Alli: ‘We don’t look back on the Iceland defeat with such anger now’Gareth Southgate using Croatia’s ‘favourites’ claim against them", "paragraph": "\nJacob Steinberg\n\nSat 17 Nov 2018 22.30 GMT\n\n\nLast modified on Sat 17 Nov 2018 23.42 GMT\n\nWayne Rooney believes some of his former international teammates are struggling to embrace England’s success under Gareth Southgate. The former captain made sure not to cause any embarrassment by revealing who he was talking about, though the DC United forward stressed that he has not been weighed down by any bitterness since his retirement from international football last year.“I know there are some ex-players who I’ve spoken to who can’t come to terms with England doing well,” Rooney said. “That is wrong. I’m not like that. I’m a fan now. I want England to do well. I am proud to have played for England so many times and I always have been. I’ve had my time. I am happy with what I’ve contributed to the national team and I look forward now to the next few years and watching this team progress.”Rooney, who won his 120th cap as he made a farewell appearance during Thursday’s friendly victory over the USA, tipped Southgate’s young side to improve on their run to the semi-finals of last summer’s World Cup. Yet it is clear from his remarks that not everyone shares his positive attitude. England’s record goalscorer played in teams that rarely justified the “golden generation” hype at major tournaments, with repeated failures leading to criticism of elite players such as David Beckham, Rio Ferdinand, Steven Gerrard, Frank Lampard and John Terry. That led many supporters to fall out of love with the Three Lions before Southgate’s arrival in 2016.However, there was no hint of resentment from Rooney when he was asked if the current team is more worthy of acclaim. “The team I played in had superstars, but this team has also got superstars,” the 33-year-old said. “Harry Kane, Raheem Sterling, John Stones – one of the best centre-backs in world football. England have got great players and they’ve also got young players.“I think this is a great squad, with other players who can come in if there are injuries. I have also seen first-hand that they are getting coached right, with good ideas, and the players are responding well to that. Hopefully this team can be the one to bring a trophy home.“Everyone can see the potential in the team is huge. They have come off the back of a hugely successful World Cup, but in a strange way I think the game against Spain will give them even more confidence than what they did in the summer. That was a massive result, to win away in Spain. To be around the squad, to see how Gareth is coaching, was great.”Rooney’s involvement against the USA gave him a chance to get a close look at Jadon Sancho, who sparkled on his first England start. The 18-year-old winger created Trent Alexander-Arnold’s goal in the first half and showed no fear as Southgate’s side warmed up for Sunday afternoon’s Nations League game against Croatia with a comfortable 3-0 win.“I’m not surprised by him,” Rooney said. “He is a fantastic talent. I spoke to him before the game and he said he was nervous, which is normal, but the important thing for me was that he showed he isn’t afraid to make mistakes. He’s only 18. It happens. Of course you’re going to make mistakes. I told him to have an impact and a few moments that people will remember – and he certainly did that.”Rooney laughed off a question about whether he feels envious of Sancho, who has impressed for Borussia Dortmund this season. “I’m not jealous,” he said. “I’m a fan now. I’ve had my time. Are you jealous of me because I’m younger than you? Of course I’m excited for him. I’m excited for all of them, I’m excited for England. This is a great opportunity for this group of players to make that next step.“They’ve already got to a World Cup semi-final, but they can’t sit back and be happy about doing what the 1990 team did. They have got the potential to go further. This is a young group of players, but I can see the mentality is right and they’ll be pushing for more.”"}