{"id": "\n‘There will never be another Stan Lee’: fans and stars pay tribute\nFrom X-Men to Deadpool: Stan Lee's Marvel movie cameos – in pictures", "paragraph": "Actor Robert Downey Jr, Chris Evans, Winston Duke, and Seth Rogen among those who hailed the creator of Marvel comics\nErin Durkin and agencies\n\nMon 12 Nov 2018 21.36 GMT\n\n\nLast modified on Thu 15 Nov 2018 11.15 GMT\n\nTributes poured in from fans and celebrities hailing the comic creator Stan Lee on Monday, who died at the age of 95.“There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy,” Captain America actor Chris Evans said on Twitter. “He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!!”There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!!Lee was the co-creator of characters including Iron Man, the Fantastic Four, Spider-Man, Daredevil and the X-Men.“He felt an obligation to his fans to keep creating,” his daughter JC Lee said. “He loved his life and he loved what he did for a living. His family loved him and his fans loved him. He was irreplaceable.”The Iron Man actor Robert Downey Jr said of Lee: “I owe it all to you.” Mark Ruffalo, who plays the Hulk, was among a host of other Marvel actors who paid their respects, and tweeted: “You let us be extra human … superhuman even.” Kevin Feige, the president of Marvel Studios, said: “No one has had more of an impact on my career and everything we do at Marvel Studios than Stan Lee. Stan leaves an extraordinary legacy that will outlive us all.”Marvel rival DC Comics wrote on its Twitter account: “He changed the way we look at heroes, and modern comics will always bear his indelible mark. His infectious enthusiasm reminded us why we all fell in love with these stories in the first place.”Lee created the Marvel Universe that stretched across comic books, movies and TV, and revitalized the comic industry with superheroes who had complex emotional lives to go along with their action adventures.Mark Hamill, who portrayed Luke Skywalker in the Star Wars films, wrote that Lee’s “contribution to pop culture was revolutionary and cannot be overstated. They say you should never meet a childhood idol. They are wrong.”Director Joss Whedon, the creator of Buffy the Vampire Slayer, wrote: “Thanks for so much of my life. You’ll never not be in it.”Another Marvel actor, Winston Duke, credited Lee with creating “characters that continue to stand the test of time and evolve with our consciousness”.“You taught us that there are no limits to our future as long as we have access to our imagination. Rest in power!” he tweeted.THANK YOU, @TheRealStanLee. You gave us characters that continue to stand the test of time and evolve with our consciousness. You taught us that there are no limits to our future as long as we have access to our imagination. Rest in power! #EXCELSIOR #StanLee #rip pic.twitter.com/hnSmnHIDln“Thank you Stan Lee for making people who feel different realize they are special,” wrote actor Seth Rogen.Wolverine star Hugh Jackman weighed in: “We’ve lost a creative genius. Stan Lee was a pioneering force in the superhero universe. I’m proud to have been a small part of his legacy and .... to have helped bring one of his characters to life.”We’ve lost a creative genius. Stan Lee was a pioneering force in the superhero universe. I’m proud to have been a small part of his legacy and .... to have helped bring one of his characters to life. #StanLee #Wolverine pic.twitter.com/iOdefi7iYz“Damn... RIP Stan. Thanks for everything,” said Deadpool actor Ryan Reynolds.Singer Josh Groban said: “Thank you for making my childhood, teen years and adulthood so fun, especially during darker days.”• This article was amended on 13 November 2018 to remove a quote that was incorrectly attributed to Scarlett Johansson."}