{"id": "\nManchester United will take belief into Juventus game, says Chris Smalling\nJuventus’s Paulo Dybala hands Ronaldo winning return to Manchester UnitedRashford’s late winner seals Manchester United comeback at Bournemouth", "paragraph": "• Chris Smalling confident after last-gasp Bournemouth win• Defender says: ‘We will get chances against Juventus’\nBen Fisher at the Vitality Stadium\n\nSun 4 Nov 2018 22.30 GMT\n\n\nLast modified on Mon 5 Nov 2018 10.39 GMT\n\nChris Smalling has acknowledged Manchester United must start making quicker starts to games but the defender believes their latest last-gasp win provides further evidence of a team spirit reminiscent of the Alex Ferguson era. Marcus Rashford’s stoppage-time winner at Bournemouth on Saturday earned a third Premier League victory in four matches and provides a lift before this week’s match at Juventus and the Manchester derby on Sunday.Smalling described it as a pivotal period for United and insists the value of victory in upcoming matches is priceless. “I think that it would galvanise us,” he said. “We know we’re going into a very tough week now but we can come out with some good results and it can be seen as a good month. It is an especially tough month now and potentially after the international break when we have a lot of home games it’s all about making sure we get results and move up that table despite the tough games.”José Mourinho was livid with his side’s “disastrous” first-half performance and Smalling – who described that 45 minutes as their worst this season – has urged United to eliminate any sloppiness in Turin on Wednesday or risk being punished by the Serie A leaders.“In the last few years I think we have been known for shutting up shop and not conceding many goals so this season has been very unusual to what I have experienced,” Smalling added. “We need to work on that because normally we don’t concede many and we win the game. It starts at the back, and as a team collectively, and we will be working on it every day.”Paulo Dybala scored the only goal of the game as Juventus outclassed United at Old Trafford last month, but Smalling insists he and his teammates will arrive buoyed after recording another late win.“We can take the second half to Turin and I think we will be more on the front foot and you will see a better performance in the first half. We need to take the second-half performance that we had against them at home and we need to do that from the off and we’ll give them a good game and get chances.”Rashford and Alexis Sánchez, against Newcastle United, have both scored stoppage-time winners in recent weeks, which has also led to comparisons with Ferguson’s reign, during which his team often prospered late on.Asked if such comebacks reminded him of playing for the Scot, who signed Smalling from Fulham in 2010, he said: “Yes, we’re showing that attitude, never giving in. No matter how bad the first half was, the second half we all believed we could go and win. It’s a great feeling and it’s bringing us closer together. As games are getting tougher and tougher – I think they’re closer than ever – it is often coming down to fine margins. Who can give that added burst in the last five minutes? We’re going to win a lot of points that way, and a lot of other teams are going to gain or lose points that way.”Smalling recognises that United’s indifferent start has left them with an uphill task in order to attain a top-four finish but he knows any criticism comes with the territory. “We as players have to stand tall and the spotlight will be on us because we are supposed to be in the top four. We are doing everything we can to get there, the 28-year-old said.”“To be at a club like this, and last as long as I have, you need to have that courage and belief in your ability, because you’re not going to have good days every week and the bad days are often highlighted when you’re at a big club, but I believe in myself. As players you need to have thick skin and we need to have belief that you will have bad days but it’s about making sure you have more good days than bad.”"}