{"id": "\nFowl play: Untitled Goose Game captures the pure joy of being a huge nuisance\nRed Dead Redemption 2 gamers queue for midnight releaseFortnite: schools warn parents of 'negative effects' of video game on students", "paragraph": "It started out as an in-joke, then the trailer went viral. The team behind the game in which you play a naughty goose takes Guardian Australia behind the scenes\nPatrick Lum\n\nTue 30 Oct 2018 22.32 GMT\n\n\nLast modified on Tue 30 Oct 2018 23.22 GMT\n\nUntitled Goose Game has a very simple pitch: you are a horrible goose and your aim is to ruin everybody’s day.“We thought this was a funny thing, with niche appeal,” says programmer Nico Disseldorp of House House, the four-person Melbourne-based development studio behind Untitled Goose Game. “We thought, ‘Oh, we’d love a game about a naughty animal.’“We completely underestimated that everyone else seemed to want the same thing.”After their initial PC trailer became something of a breakout hit, House House found themselves blessed with internet goodwill, a publisher and enough resources to fund an additional version on Nintendo Switch – both due out in 2019 but previewing at PAX in Melbourne over the weekend – a fairly impressive feat for a game based on friend group in-jokes about a stock photo of a goose.“We don’t have these geese experiences. We’re complete outsiders,” says Disseldorp. “To us, they might as well be a cartoon animal you don’t actually ever see in real life.”People think game development means you get to play games all day, but they're wrong - it means you talk about geese pic.twitter.com/I8XvTWy7b1While searching for ideas after their debut multiplayer game, Push Me Pull You, the team found themselves constantly joking about a hypothetical goose simulator, until they finally decided to just make the thing.“The idea of interacting with a bunch of people was there from the start,” animator Stuart Gillespie-Cook says. “You have to have some feedback to get a good idea of how naughty you were being.“You don’t want to just destroy stuff in the background – you want to show them what you’ve done.”While aspects of the gameplay remain familiar to traditional stealth fans – in some ways, it’s reminiscent of a Hitman level: you begin by assessing the situation and figuring out how to manipulate the system to achieve your next set of objectives; you’ll crouch in bushes, avoiding sentries and stealing small objects – the general vibe is much more low stakes and comedic, though no less entertaining. And, like many stealth games, confrontation often descends into farce. Perhaps the primary difference is in the focus not on power fantasy, but on the sheer, physical slapstick of seeing a beleaguered gardener run around a farmyard chasing a honking goose who has stolen his keys and won’t let go.“There’s probably more influence from clowning than from stealth games,” says Gillespie-Cook, inviting comparisons to Looney Tunes cartoons or the films of Buster Keaton. Indeed, the game feels designed to encourage really getting into character – there’s even a dedicated button for flapping your wings, which has no functional purpose at present but is nonetheless deeply satisfying.“One thing that was interesting to me was how many people tend to say ‘the goose in your game – that’s me!’” Disseldorp says. “Or they’ll tag their friends in a post or something and say, ‘that’s so you!’.“I guess a lot of people try and play games trying to be this cheeky no matter what, trying to be subversive, trying to bend the rules – so there’s maybe something really appealing about a game where that’s just your character from the get-go.”Untitled Goose Game’s aesthetic is based strongly on the quintessential sleepy northern English village. “We looked at the British TV shows we grew up with – Postman Pat, Fireman Sam – stop-motion, little diorama worlds,” artist Jake Strasser says. “There’s a vague sense of Englishness that we want to achieve.”“There’s a little bit of timelessness that I like to invite, too,” Gillespie-Cook adds. “The ur-village, so to speak.”Both of House House’s projects so far have been supported by Film Victoria, and the team credits the organisation with helping them set up the company properly. “They were very focused on making us sustainable and making us into a real studio,” Gillespie-Cook says. “Even the idea that a government body had faith in us was super important.”Disseldorp says: “Through the entire production of Push Me Pull You, we didn’t pay ourselves at all. Now we’re able to hire other people, and work for ourselves.”The goose remains an object of fascination, with the team still trying to determine why exactly their naughty little waterfowl took flight. “I think it’s a question of attitude,” Gillespie-Cook says. “They’re a bit like magpies, really.”“They’re somehow socially bad,” Disseldorp says. “But also very, very silly.”"}