{"id": "\nTrump says US will withdraw from nuclear arms treaty with Russia\nUK backs Trump's nuclear treaty withdrawal, blames Russia for breakdownUS Nato envoy's threat to Russia: stop developing missile or we'll 'take it out'", "paragraph": "Experts warn of ‘most severe crisis in nuclear arms control since the 1980s’ as Trump confirms US will leave INF agreement\nJulian Borger in Washington, \nMartin Pengelly in New York and agencies\n\nSun 21 Oct 2018 02.29 BST\n\n\nFirst published on Sat 20 Oct 2018 21.17 BST\n\nDonald Trump has confirmed the US will leave an arms control treaty with Russia dating from the cold war that has kept nuclear missiles out of Europe for three decades.“We’ll have to develop those weapons,” the president told reporters in Nevada after a rally. “We’re going to terminate the agreement and we’re going to pull out.”Trump was referring to the 1987 Intermediate-range Nuclear Forces treaty (INF), which banned ground-launch nuclear missiles with ranges from 500km to 5,500km. Signed by Ronald Reagan and Mikhail Gorbachev, it led to nearly 2,700 short- and medium-range missiles being eliminated, and an end to a dangerous standoff between US Pershing and cruise missiles and Soviet SS-20 missiles in Europe.The Guardian reported on Friday that Trump’s third national security adviser, John Bolton, a longstanding opponent of arms control treaties, was pushing for US withdrawal. The US says Russia has been violating the INF agreement with the development and deployment of a new cruise missile. Under the terms of the treaty, it would take six months for US withdrawal to take effect.US hawks have also argued that the INF treaty ties the country’s hands in its strategic rivalry with China in the Pacific, with no response to Chinese medium-range missiles that could threaten US bases, allies and shipping.Bolton and the top arms control adviser in the National Security Council (NSC), Tim Morrison, are also opposed to the extension of another major pillar of arms control, the 2010 New Start agreement with Russia, which limited the number of deployed strategic warheads on either side to 1,550. That agreement, signed by Barack Obama and Dmitri Medvedev, then president of Russia, is due to expire in 2021.This is the most severe crisis in nuclear arms control since the 1980s“This is the most severe crisis in nuclear arms control since the 1980s,” said Malcolm Chalmers, the deputy director general of the Royal United Services Institute. “If the INF treaty collapses, and with the New Start treaty on strategic arms due to expire in 2021, the world could be left without any limits on the nuclear arsenals of nuclear states for the first time since 1972.”Speaking to reporters in Nevada, Trump said: “Russia has violated the agreement. They’ve been violating it for many years and I don’t know why President Obama didn’t negotiate or pull out.“We’re not going to let them violate a nuclear agreement and do weapons and we’re not allowed to. We’re the ones that have stayed in the agreement and we’ve honoured the agreement but Russia has not unfortunately honoured the agreement so we’re going to terminate the agreement, we’re going to pull out.”Asked to clarify, the president said: “Unless Russia comes to us and China comes to us and they all come to us and they say, ‘Let’s all of us get smart and let’s none of us develop those weapons,’ but if Russia’s doing it and if China’s doing it and we’re adhering to the agreement, that’s unacceptable. So we have a tremendous amount of money to play with with our military.”Jeffrey Lewis, the director of the East Asia nonproliferation program at the Middlebury Institute of International Studies at Monterey, said: “This is a colossal mistake. Russia gets to violate the treaty and Trump takes the blame.“I doubt very much that the US will deploy much that would have been prohibited by the treaty. Russia, though, will go gangbusters.”Russian state news agencies on Saturday cited a foreign ministry source as saying Washington’s move to pull out of the treaty is motivated by a dream of a single global superpower.“The main motive is a dream of a unipolar world. Will it come true? No,” a foreign ministry source told Ria Novosti state news agency.The official said that Russia has “many times publicly denounced the US policy course towards dismantling the nuclear deal”.Washington “has approached this step over the course of many years by deliberately and step-by-step destroying the basis for the agreement,” the official said, quoted by Russia’s three main news agencies.“This decision is part of the US policy course to withdraw from those international legal agreements that place equal responsibilities on it and its partners and make vulnerable its concept of its own ‘exceptionalism’.”Russian senator Alexei Pushkov wrote on Twitter that the move was “the second powerful blow against the whole system of strategic stability in the world, with the first being Washington’s 2001 withdrawal from the anti-ballistic missile treaty”.“And again the initiator of the dissolution of the agreement is the US,” Pushkov wrote.The Pentagon has been generally supportive of the INF treaty but defense secretary James Mattis warned other Nato ministers earlier this month it would no longer be tenable if Russia did not withdraw its Novator ground-based missile, which the US has argued for nearly four years violates the INF range restrictions.Nato ministers issued a joint statement saying the INF agreement “has been crucial to Euro-Atlantic security and we remain fully committed to the preservation of this landmark arms control treaty”. But they urged Russia to come clean about the capabilities of its new missile.This president who is constantly telling us he is deal-maker has failed utterly to save Reagan’s nuclear legacyThe Chinese arsenal has also been a source of concern for the US Pacific Command. Its former commander, Adm Harry Harris, told the Senate in March: “We have no ground-based capability that can threaten China because of, among other things, our rigid adherence, and rightfully so, to the treaty that we sign on to, the INF treaty.”Lewis disagreed that the INF leaves the US at a significant disadvantage in the Pacific.“The China stuff is nonsense,” he said. “INF does not prohibit sea- and air-based systems, not does it prohibit South Korea and Japan from developing long-range missiles. If China were a real problem, the US and its allies could have acted long ago.”Alexandra Bell, a former senior state department official and now senior policy director at the Centre for Arms Control & Non-Proliferation, said: “When problems arise in arms control, you work and fix them.“What shocks me is that this president who is constantly telling us he is deal-maker has failed utterly to save Reagan’s nuclear legacy. He did nothing with his relationship with Putin. There were trades to be made to fix this treaty and he couldn’t pull it off.”She added: “Why would the North Koreans have any reason to believe in any deal made with this president, with Bolton whispering in his ear.”Agence France-Presse contributed to this report"}