{"id": "\nKevin De Bruyne concerned about playing Spurs at Wembley after NFL game\nDavid Silva inspires Manchester City to brush aside Shakhtar Donetsk", "paragraph": "• Manchester City midfielder raises concerns about pitch• ‘We have to go there and show our intent to remain on top’\nMarcus Christenson\n\nWed 24 Oct 2018 22.30 BST\n\n\nLast modified on Wed 24 Oct 2018 23.55 BST\n\nManchester City’s Kevin De Bruyne has admitted he is not looking forward to playing Tottenham Hotspur at Wembley on Monday night, roughly 26 hours after the NFL game between Jacksonville Jaguars and Philadelphia Eagles at the same venue.The Belgian, who made his first start of the season in the 3-0 win against Shakhtar Donetsk on Tuesday night, and could be in line for his first full 90 minutes of the campaign against Mauricio Pochettino’s side, has experienced playing on an NFL pitch before and did not enjoy it.“Yes [I have done it before], in a preseason, and it’s not nice. It’s going to be difficult. I’m not sure how it’s going to be. We hope it will be OK and that we can play like we normally do.”The difficulties that the pitch might bring on Monday night, however, appears the only cloud on City’s horizon at the moment. Pep Guardiola’s side have now won six of the seven games played since the surprise defeat against Lyon in the Champions League on 19 September, and go into the game against Spurs high on confidence.“These games [against the other top teams] are the most important ones. We have to go there and show our intent to stay on top. They will try to do the same because they are close [in the table and on points]. It’s a big one.”Guardiola was delighted with the team’s performance in Kharkiv and with the first half in particular. The Spaniard described the first 45 minutes as “incredible” and added that “the first half was the best we have played in the last three seasons, since I’ve been here”.De Bruyne, however, was unable to agree with his manager, saying that it is difficult to compare one game to another. “We play so many games that it’s difficult to say that,” he said.“Each game has different aspects. Shakhtar are a team that likes to play football so when we pressed them high it worked well for us. We should have scored more but to go away with 3-0 victory is good. We lost against Lyon so it was important to recover and now we want to be first in the group.“There are still three games to go and we have work to do. We’ve one player more than we had last season, but I don’t know if we are better equipped – about the same I’d say.”The Belgian also praised how his teammates had played during his long injury absence. “We’ve done well [without me], obviously most of them were games that we should have won but we’ve done really well. We only lost the Lyon game so we’ve been fine, but to be honest I didn’t expect anything less.”"}