{"id": "\nGlobal share markets tumble amid fears the rise of big tech is over\nPopulists like Trump exacerbate rather than cure corruption | Barry Eichengreen", "paragraph": "Apple shares were down 5% after suppliers cut their forecasts, causing the tech-heavy Nasdaq and other tech stocks to fallReuters and staff\n\nTue 13 Nov 2018 04.44 GMT\n\n\nFirst published on Mon 12 Nov 2018 23.02 GMT\n\nStock markets in Asia have tumbled after a sharp selloff on Wall Street hit leading companies including Apple, Goldman Sachs and General Electric.With Monday’s losses, all three major Wall Street bourses erased the gains from their brief rally after the US congressional elections on 6 November.President Donald Trump blamed his defeat in the midterms for the fall, claiming fears of “Harassment by the Dems” was causing “big headaches!”The prospect of Presidential Harassment by the Dems is causing the Stock Market big headaches!Shares in Asia Pacific followed suit on Tuesday morning with the Nikkei diving 2.2% in Tokyo and the market in Seoul down 0.84%. Shares in Hong Kong were also down 1.5% in early trade and Shanghai was off 0.5% before both recovered.Australia’s beleaguered banks led the benchmark ASX200 down by 1.7%. The Australian dollar also took a hammering as the greenback climbed to its highest level against a basket of currencies since June 2017.Asian stocks excluding Japan have fallen nearly 17% this year, after a 33.5% gain in 2017, with October 2018 the worst month since mid-2015.“A fair number of factors are weighing on the market currently, such as seeming weakness in some US tech giants and lingering worries about the Chinese economy,” said Yoshinori Shigemi, global market strategist at JP Morgan Asset Management in Tokyo.The falls on Wall Street appeared to be sparked more by fears that the historic rise in tech companies such as Apple was coming to an end. Apple shares fell 5% after several suppliers to the company, including Lumentum Holdings, whose components power the iPhone’s Face ID technology, cut their forecasts. Apple’s decline impeded the tech-heavy Nasdaq, which fell more than 2%.Lumentum shares plunged 33%. Shares of several chipmakers that sell to Apple, such as Cirrus Logic, Qorvo Inc and Skyworks Solutions, dropped as well. The Philadelphia SE Semiconductor index dropped 4.4%. Apple suppliers in Asia fell sharply on Tuesday with Taiwan-based assembler Foxconn down more than 3% and rival Pegatron off more than 5%.“The concerns are all about global economic growth, specifically demands for the products of companies like Apple,” said Kate Warne, investment strategist at Edward Jones in St Louis. “Investors are becoming more concerned about faster-growing companies and whether they will continue to grow at that pace.”On Wall Street, Goldman Sachs shares dropped 7.5% after Bloomberg reported that Malaysian finance minister Lim Guan Eng said the country was seeking a full refund of all the fees it paid to the Wall Street bank for arranging billions of dollars of deals for troubled state fund 1MDB. Goldman Sachs was the biggest drag on the Dow, which fell more than 2%.Energy stocks also accelerated their decline towards the end of the session as oil prices fell.General Electric Co shares fell 6.9% after new chief executive officer Larry Culp said the company was saddled with too much debt and would urgently sell assets to reduce leverage. The shares dropped below $8 for the first time since March 2009.“At the moment it seems the path of least resistance is down,” said Peter Jankovskis, co-chief investment officer at OakBrook Investments in Lisle, Illinois."}