{"id": "\nChelsea loan pair Mason Mount and Fikayo Tomori primed for elite test\nChelsea coach Marco Ianni fined £6,000 over José Mourinho fracas", "paragraph": "• Players will represent Derby County against their parent club• Gianfranco Zola says game is ‘opportunity to grow up quicker’\nDominic Fifield\n\nTue 30 Oct 2018 22.29 GMT\n\n\nLast modified on Wed 31 Oct 2018 00.30 GMT\n\nChelsea’s decision to grant Mason Mount and Fikayo Tomori permission to play for Derby County in the Carabao Cup against their parent club was aimed at providing the pair with a test against elite opposition to speed further development.The England Under-21 players are on season-long loans working under Frank Lampard at the Championship side and Chelsea have taken the unusual decision to allow them to play in Wednesday’s tie at Stamford Bridge. Mount, who is hopeful of overcoming a foot injury, has scored five times and earned a call‑up to the England squad, while Tomori has established himself in Lampard’s defence. Both played in the third-round elimination of Manchester United at Old Trafford.Maurizio Sarri’s assistant first‑team coach, Gianfranco Zola, insisted Chelsea’s special relationship with Lampard had not influenced the decision. “Mason and Tomori are growing up as players,” he said. “We believe that, by playing against us, it is an opportunity for them to grow up quicker. The more they play against Premier League teams, the more experience they get. And we can make better evaluations on them. It was a great opportunity to see them play in front of us, so we took it.“Certainly there will be a lot at stake. From a technical, tactical and physical point of view, it will be a game on a higher level to the ones they play in their own league. But there will also be a psychological component. They will have to play in front of a big crowd, the crowd of the team they belong to. It will give them a good test.” Zola confirmed the club would consider such arrangements with loanees on a match by match basis.Lampard, who scored a club record 211 goals in 648 Chelsea appearances, returns as a manager for the first time with Zola insistent the 40-year-old’s achievements eclipse even his own at the club. “Look at the results and the trophies that Frank achieved with Chelsea, there is no doubt he is the bigger legend,” said the Italian, voted Chelsea’s greatest ever player by supporters in 2003, with his final two years spent as Lampard’s teammate. “He has achieved so much with this club.“I know that, like many others, I was very important for the club because we started a process of getting better, becoming a well-established team in England and Europe. I know I have done very well like Dennis Wise, Roberto Di Matteo and many others. But Frank has really made a big mark, a big impression, like also John Terry. So he deserves the credit. It will be a big night for him, for sure.”"}