{"id": "\nBrussels tells Theresa May - delaying Brexit will cost UK £10bn\nLabour gains three-point lead as May’s Brexit plan hits Tory supportThe Observer view on Brexit – the people must have a chance to give their verdict", "paragraph": "EU says longer transition would lead to a bigger bill as PM prepares for critical week\nDaniel Boffey, \nMichael Savage and \nToby Helm\n\nSat 17 Nov 2018 21.00 GMT\n\n\nLast modified on Sat 17 Nov 2018 23.45 GMT\n\nTheresa May’s hopes of securing her Brexit deal were dealt a new blow on Saturday night as the EU warned the UK would have to pay about £10bn more to Brussels to win extra time for a smooth exit.Ahead of what Downing Street said was a “critical” week for the prime minister, cabinet ministers also piled on the pressure by publicly insisting that she change the proposals. Pro-Brexit cabinet minister Andrea Leadsom said there was “still more to be done” to achieve the Brexit “that 17.4 million people voted for”.Leadsom is one of a team of cabinet ministers – including environment secretary Michael Gove – who want alterations to the deal, although Brussels insists it cannot be changed.These include reassurances that the so-called “backstop” that could keep Britain tied in a customs union with the EU will never be needed.As the prime minister tries to prevent a coup by hardline Brexiters determined to oust her in a vote of no confidence, she will hold talks with EU leaders through the week, ahead of a Brussels summit next Sunday.Downing Street said May was entirely focused on delivering Brexit – but sources appeared to acknowledge that the next few days could be decisive for her and her Brexit plans.“The PM isn’t going to be distracted from delivering the best possible Brexit deal,” said a No 10 source. The next seven days are critical with all her focus on the next stage in the negotiations – the full future framework – in time for the special summit next Sunday. That framework will deliver a more secure and more prosperous Britain.”The latest Opinium poll for the Observer on Sunday delivers more bad news for May, with Labour opening up a three-point lead. It shows Tory Leave supporters appear to be deserting May’s party in droves.Compared with a month ago, the Conservatives have dropped five points to 36% while Labour has gained three to stand on 39%. The proportion of Leavers backing the Tories has dropped by 10 points in one month.As May’s allies sprang to her defence and said she was “winning over the country”, Brussels threw a new spanner in the works by saying any extension of the 21-month transition period designed to smooth the UK’s exit must last at least a year beyond the end of December 2020.May told an EU leaders summit last month that she might ask for a “few months” extra time if that was what was needed to complete an EU-UK trade deal and prevent the Irish backstop from coming into force.But on Saturday night Brussels was making clear that if the UK wants an extension of the transition – during which it is tied to the EU economic system but with no say over its rules – it must last at least a further year.A year-long extension would cost about £10bn on top of the £39bn divorce bill already agreed. Such a prospect will appal hardline Brexiters who already complain that the UK will have to spend almost two more years tied to the EU after Brexit on 29 March next year.Negotiators working under the EU’s Michel Barnier, will insist that the maximum length of an extension is nailed down this week, ahead of Sunday’s summit. As it stands, the withdrawal agreement says that a joint EU-UK committee would “before 1 July 2020, adopt a single decision extending the transition period up to [31 December 20XX]”.No 10 sources insisted that despite the tough language, details of any extension were “still part of an ongoing negotiation” and the outcome could not be predicted.Officials said the prime minister, senior ministers and officials would all be locked in intense talks with the EU for much of this week, which could involve May visiting several European capitals including Brussels.On Saturday night backbench allies of May were rallying behind her, joining what they called a “massive fightback”. Downing Street strongly denied claims that it had been informed that Sir Graham Brady, chairman of the 1922 committee, had received the 48 letters necessary to trigger a vote of confidence among Tory MPs.Charles Walker, vice-chair of the 1922 committee, said colleagues trying to ditch May were putting the future of the party in serious jeopardy. “While I respect all my colleagues’ views on our future relationship with the EU, if Conservative MPs plunge the party into an irresponsible leadership contest at this moment of such national importance and the result is a government under Jeremy Corbyn, the Conservative party will be finished as a viable political force.”Downing Street insisted again on Saturday there that there is no hope of unpicking the EU divorce deal. There is, however, limited scope to alter a document setting out the potential future relationship with Brussels.As May’s deal looks increasingly likely to be voted down in the Commons, supporters of a second referendum are stepping up their campaign to convince MPs to agree to put the issue back to the people.The People’s Vote campaign said it now had more than 170 groups in every region, with constituency activity ensuring that MPs get sent a clear message. The campaign has distributed 20,000 “Knock and Drop” surveys to the groups to canvass and lobby their local MPs."}