{"id": "\nDonald Trump and Joe Biden exchange blows in Nevada as midterms loom\nJohn James: ‘Battle-tested, ready to lead’ … and a black American for TrumpTrapped at the border: the forlorn Hondurans hoping to reach the US", "paragraph": "\nMartin Pengelly and agencies\n\nSat 20 Oct 2018 21.50 BST\n\n\nFirst published on Sat 20 Oct 2018 20.00 BST\n\nJoe Biden took the fight to Donald Trump in Las Vegas on Saturday, before the president staged a rally in rural Nevada and on the day early voting began in the state ahead of the 6 November midterm elections.Vegas touts itself as the “boxing capital of the world”. The two septuagenarian politicians have often expressed interest in physical combat but on Saturday they settled for rhetorical blows or, in the fistic vernacular, trash talk.Biden mocked Trump as an egotist destroying time-honoured and globally admired American values. Trump mocked Biden as “1% Joe”, a pitiful figure taken “off the trash heap” by Barack Obama.Biden entered the ring first, telling unionised workers and Democratic activists America’s values were “being shredded by a president who is all about himself”. America was built on basic decency, he said, which was “being shredded right now”.The US had built “the great alliances in literally the history of the world” over the past 70 years, Biden said, adding: “But my God, think of what’s going on now.“It’s all about Donald.”The 75-year-old former Delaware senator, two-time candidate for the Democratic presidential nomination, vice-president to Obama and frontrunner among possible 2020 candidates was speaking in support of Jacky Rosen, who is in a tight Senate race with the Republican Dean Heller.Biden and Rosen rallied with members of Culinary Union 226, which represents about 57,000 housekeepers, bartenders and other workers in the casinos and hotels of the city. Turnout from the heavily immigrant union was credited with giving Democrats key wins in Nevada in 2016, when Hillary Clinton won the state.Biden spoke shortly before Trump, 72, mounted a rally for Heller several hundred miles away in rural Elko. In a tweet, the president said Heller had “become a good friend” who was “all about #MAGA” – a reference to Trump’s campaign slogan, Make America Great Again.Trump also backed Adam Laxalt for governor. His race, against the Democrat Steve Sisolak, also remains close.Addressing supporters, Trump called Biden “1% Joe”, a reference to his failed in presidential runs, and said in 2008 Obama plucked Biden “off of the trash heap and made him vice-president”.Trump also boasted about the size of his crowd and said that though Biden drew only a few hundred in Las Vegas, “he was thrilled that’s one of the biggest crowds he’s ever had”. He later repeated the jibes to reporters and said: “I wish Joe Biden the best, I hope he’s the nominee, actually.”The president wants immigration to be a defining election issue. On Thursday in Missoula, Montana, he said the midterms would be “an election of the caravan”. That was a reference to a group of around 4,000 would-be migrants from Honduras which has reached Mexico.On Saturday in Nevada, Trump said Democrats backed an “extremist immigration agenda”. He had “already figured out”, he said, how to solve the problem of immigration and “make a lot of people happy”. But he did not explain how.“I think I’ll keep it a little bit low-key until the election,” he said.At a Friday night rally in Arizona, Trump said Democrats were “too extreme and too dangerous” to take control of Congress. Democrats are well placed to take the House but, according to nonpartisan analysts, look likely to leave the Senate in Republican hands.On Saturday, Trump told supporters he doubted a much-vaunted “blue wave” of Democratic victories would happen.“All the Democrats want is power and they’ve got this blue wave deal going,” he said. “Not looking like a blue wave.”Nevada is attracting the big names. On Monday, Obama will campaign in the state, which he won in 2008 and 2012. During the 2014 midterms, Democrats stayed home and Republicans won key races."}