{"id": "\nPolitics and science need more women, says Angela Merkel\n", "paragraph": "German chancellor makes speech in Berlin on 100th anniversary of female suffrageAgencies in Berlin\n\nMon 12 Nov 2018 23.26 GMT\n\n\nLast modified on Mon 12 Nov 2018 23.50 GMT\n\nThe German chancellor, Angela Merkel, has said that her role as the most powerful woman in Germany should not let society off the hook for the small proportion of women in politics.As Germany marked the 100th anniversary of women’s suffrage, Merkel said in a speech in Berlin that there was a lot still to do to achieve gender equality, notably in the worlds of politics, business, science and culture.“The goal needs to be equality, equality everywhere,” she said.Much had been achieved over past decades on the road to gender equality, Merkel told an audience of mostly female ministers, lawmakers, mayors and others. But “a swallow does not a summer make”, she added. “The fact that I exist should not be an excuse.”Merkel, the country’s first female chancellor, highlighted the fact that only 30.9% of politicians in the current Bundestag were female, down from 36.5% in the previous one.“That’s the proportion of women that Sudan has in its parliament,” said Merkel. “I think that the proportion of women in our parliaments is a basic issue of our democracy.”Women are also few and far between in the highest echelons of the country’s businesses. While 90% of the biggest listed companies in the US have two women on their boards, in Germany only 17% meet this criteria.“I hope it will become a matter of course for men and women to share work, child-raising and housework equally and no one will be forced into a role or a specific task because of his or her gender,” said Merkel. “And I hope we won’t have to wait 100 years to achieve that.”Merkel listed some of the progress that had been made in recent years such as providing better childcare and maternity leave. Merkel, who is a physicist by training, added that girls should be encouraged to choose future-oriented jobs in technology.As for her own role, she acknowledged to roaring applause she had made a contribution: “Nobody laughs any more if a girl says she wants to become a chancellor.”"}