{"id": "\nOwen Farrell is an England certainty. But where he plays is less clear\nEddie Jones splits captaincy between Dylan Hartley and Owen FarrellAlex Lewington’s late try adds gloss to Saracens’ routine win over Lyon", "paragraph": "\nPaul Rees\n\nSat 20 Oct 2018 22.07 BST\n\n\nLast modified on Sat 20 Oct 2018 23.57 BST\n\nEddie Jones smiles when he is asked if he is anxious as he approaches next month’s encounters with the southern hemisphere’s big three and the team he coached in the last World Cup, Japan, given England’s chronic injury list. The Australian is one of the few head coaches around who enjoys sparring with the media, a relic of the amateur era.“No. You can only play with the cards you are dealt,” he says. “You can talk about season structure, rugby, club versus country but it does not matter at the end of the day. You can only do what you can and for me that is selecting the side and getting the players organised and in the right attitude to play.“The most important thing is to know where you want to go. We have a team to win the World Cup but we need our best players available, fit and united. We want to win every game, but what is important is to keep moving forward; sometimes the scoreboard does not show that. My job is to maximise what I have. All I want to do is coach this team well.”Jones will be without the Vunipola brothers, Joe Launchbury, Chris Robshaw, Anthony Watson and Jonathan Joseph, as well as a dozen back-up players, for the four-match series that starts on 3 November against South Africa, but his most valuable player, Owen Farrell, remains fit. The question is where the Saracen will start against the Springboks next month : at fly-half, where he forged his international reputation and his club position, or inside-centre, where he has been largely deployed by England in the past three years.“I see him as an even number,” says Jones when asked whether he now viewed Farrell as a fly-half first and a centre second. “There is a possibility Owen will play at 10 and there is a possibility George [Ford] will play there with Owen at 12. I don’t think I have seen a hungrier player for England than Owen.”Jones will be aware that the sudden jettisoning of Ford from fly-half by Stuart Lancaster after the first match of the 2015 World Cup affected England’s attacking game, creating confusion where there had been certainty. The Australian started with Ford at fly-half in 26 of his first 27 matches in charge of England, the one exception being the opening Test in Australia in 2016 when defensive uncertainty in midfield brought Ford from the bench after 29 minutes.Ford has started two of the past four Tests, dropped for Farrell for the final match of this year’s Six Nations against Ireland and then making way for Danny Cipriani in the third Test against South Africa, on both occasions after two defeats.With Farrell named as co-captain with Dylan Hartley, a departure for Jones, Farrell is being groomed to take over at some point and a leader would surely command his preferred position. Farrell as the first‑choice fly-half would explain the omission of Cipriani from the squad, with Jones not needing a back-up to a deputy.“You have got to find the right people as co-captains,” says Jones. “In terms of skillset and character, Dylan and Owen are the perfect fit. If one gets injured, we would not necessarily have co-captains. Is there another Owen? No. Is there another Dylan? No. They are unique characters, so we would look at another leadership model.“I have never had co-captains before but after the South Africa tour I thought it was a no-brainer.It is our most powerful leadership team: the two boys are both desperate to win. Their only concern is to make England the best side in the world. They are so distinctly different that they will look after different areas of the game; that’s the beauty of it. Owen is very strong tactically while Dylan is the guy who says: ‘Let’s bash them,’ upfront, more emotional and in-your-face. It is a nice blend of character.”Jones’s thinking at fly-half will be partly determined by his midfield options. He will assess the fitness of the centre Manu Tuilagi, who has missed only one match this season in his latest comeback and was back to his barnstorming best for Leicester against Scarlets on Friday, and Ben Te’o, who came on the field from Worcester’s bench against Ospreys after 52 minutes on Saturday having not played since May.“Who is at outside-half depends on a number of factors,” says Jones. “Who is available in the centre, the sort of opposition we are playing against, what sort of attack we want to play and how many momentum runners we have. We will look at using one of the games as a World Cup trial in how we balance players as we have two games in Japan four days apart.”He will need more than one 10."}