{"id": "\nAlex Lewington’s late try adds gloss to Saracens’ routine win over Lyon\nDanny Cipriani sent off for shoulder to face as Munster beat GloucesterOwen Farrell is an England certainty. But where he plays is less clear", "paragraph": "• Saracens 29-10 Lyon• Maro Itoje opens scoring as Saracens make it two wins from two\nMichael Aylwin at Allianz Park\n\nSat 20 Oct 2018 19.47 BST\n\n\nLast modified on Sun 21 Oct 2018 00.21 BST\n\nThis is no time to be sniffy if you are an Englishman in Europe, so two wins from two for Saracens, English flag-bearers, is on balance an achievement to celebrate. But the faithful of north London remained largely in their seats throughout this mundane exercise in result collection.No one thought for a moment that Saracens would not win; nor did they have to do a whole lot for victory. Alex Lewington’s try with three minutes remaining brought the garnish of a bonus point – and was by some distance the most pleasing element.“It was a scratchy, patchy performance,” said Mark McCall, the Saracens director of rugby. “We’re quite disappointed with how we played.”Not that anyone should complain. Last Sunday’s win over Glasgow was a bruising affair. Saracens just wanted to make it through this one and did so, the late bonus-point try so inevitable it was as if they had everything under control all along.As first seasons in Europe go, Lyon’s has already proved inglorious. This was not quite a throwback to the bad old days of French indifference on the road but one is never entirely confident about likely levels of engagement when a Top 14 side travels the week after a home defeat and makes 10 changes, especially when that trip is to a team such as Saracens, who opened with an away win.We were unlikely to see the sort of result Clermont pulled off here last season. Lyon, though, are one of the bigger spenders in the Top 14 – and sitting in third place – so talk of weakened sides is relative. Their defence was pretty solid but neither of Saracens’ first-half tries was the kind you would expect to see a team concede in anything like an urgent frame of mind.Maro Itoje galloped home from the halfway line for the first, having ripped the ball all too easily from the grasp of Etienne Oosthuizen. For the second, a delighted Sean Maitland scooped up the loose ball, after Jean-Marc Doussain had failed to deal with Alex Goode’s grubber, for a free run-in. And so it was 17-0 with only a quarter gone. We feared for the worst.Which is pretty much what we got for the next quarter, although Saracens’ inability to rouse themselves was as responsible for that, the difficulty for the home side under these circumstances often overlooked. The knock-ons by both sides were not conducive.Saracens extended their lead in the third quarter but it did little to shake the contest from its torpor, as humdrum an example of the driven lineout as that most prosaic device can offer. Brad Barritt disappeared into the pile-up and emerged as the credited try-scorer – 24-3 and all that remained was to settle the matter of that bonus point.Lyon finally crossed with 10 minutes remaining, Virgile Lacombe following up after Doussain quickly tapped the third of three penalties that had set the visitors deep into Saracens territory.Breaks from Goode and Itoje threatened to secure the fourth try but in the end it was Lewington who stepped through, worked clear off a smart midfield move from a scrum. Job done, no more. The former champions are probably saving themselves for later."}