{"id": "Canada drops tariff on U.S.-made aluminum cans amid beer can shortageEconomyTop Stories", "paragraph": "October 18, 20183:23 PM EDTTORONTO — Canada’s move to drop a 10 per cent duty on U.S.-made aluminum cans is good news for Canadian beer makers battling a shortage of tall cans, according to brewing industry executives.The aluminum products excluded from tariffs last week include cans that brewers have been struggling to keep in stock, said Luke Harford, president of trade association Beer Canada. Reuters reported in July that some Canadian breweries were scrambling to find aluminum cans.“It’s very positive for us,” said Harford. “The 473 ml tall cans are all purchased from U.S. suppliers and that particular can is one of the fastest-growing cans… particularly amongst small brewers.”Canada announced tariff exemptions on a range a products last week after the domestic industry complained of shortages that could affect production of everything from cars to beer. The rollback underscores the unintended consequences of retaliatory tariffs.The Canadian tariffs on cans were part of its response to U.S. President Donald Trump’s steel and aluminum tariffs. But they hit a product already in short supply after the closure of a Crown Holdings Inc plant in Massachusetts in January.At least one small brewery, Alberta’s GP Brewing Co, was forced to halt production for two weeks in July after it ran out of cans. Harford said many other producers are still filling cans with beer as quickly as they can get them.Steve Beauchesne, co-founder and chief executive of Beau’s Brewing Co in Ottawa, said his brewery is waiting three to four months for orders to be filled, and has had to delay some product launches.He said the tariffs had effectively benefited U.S. brewers, whose filled cans of beer were not subject to the tariff when they crossed the border into Canada: “By making us exempt, they’re at least putting us on even footing.”While small breweries were most vocal about the shortage, Harford said all Canadian breweries selling beer in tall cans rely on U.S. producers. Tall cans are made by Ball Corp as well as Crown, according to Harford.Major beer companies with operations in Canada include Molson Coors Brewing Co and Anheuser Busch Inbev’s Labatt Breweries of Canada.© Thomson Reuters 2018We want to improve your reading experience"}