{"id": "Bank of Canada's rainbow-and-unicorns outlook doesn't add up for investorsInvesting ProTop Stories", "paragraph": "October 29, 20186:40 PM EDTLast UpdatedOctober 30, 20188:51 AM EDTThe Bank of Canada is hard to fathom these days. At its meeting last week it hiked overnight rates, which wasn’t unexpected but their overly hawkish tone certainly was. Terms such as “outstanding momentum” were used to describe the bank’s view of the Canadian economy while the global economic outlook “remains solid.”When I heard this, I almost fell out of my chair.It was as if the Bank of Canada were stuck in 2017, when the global reflation trade was the consensus among both market participants and economists. However, a lot has changed both here in Canada and abroad.An obvious place to start is in equity and bond markets, which have become very worried about a flattening yield curve, a higher U.S. dollar and tightening of financial conditions. Consequently, every single market is in negative territory this year with our own S&P TSX down more than eight per cent. Even bond markets are down anywhere from two to 7.5 per cent depending on the duration. Oil markets, which are good proxy for the state of the global economy, have also rolled over 12 per cent from their beginning-of-the-month highs on a weakened demand outlook.Here in Canada, our nation is facing a tapped-out consumer with household credit growth falling to its slowest pace in 35 years. In September, home sales fell for the first time in five months, dropping 8.9 per cent over last year. Another significant component of GDP is the energy sector, but there was barely any acknowledgement by the Bank of Canada regarding the made-in-Canada energy crisis that is currently plaguing the Western provinces with record-setting discounts to global pricing.We just think there is a potential benefit to being on the other side of the Bank of Canada and their rainbows-and-unicorns outlook.What we mean by this is that investors have hit the Sell button on anything with a yield on worries over aggressive rate hikes. As a result, many of the dividend payers have recently sold off anywhere from 15 to 30 per cent from their 52-week highs, and thereby offering some attractive upside should the Bank of Canada disappoint. Meanwhile, investors can get paid rather handsomely to wait it out with dividend yields ranging from 4.5 per cent to over six per cent on certain well-run blue-chip Canadian stocks.We think there is a potential benefit to being on the other side of the Bank of Canada and their rainbows-and-unicorns outlookFor some idea as to this potential upside, we took a look back at the average 10-year dividend yields for a number of these companies and compared them with their current yields. As a caveat, some of the variance is stock specific and these yields have come in a period of unusually low interest rates.For example, we calculate that the Bank of Nova Scotia (BNS:TSX) dividend yield is 12 per cent above its 10-year average; Great-West Life (GWO:TSX) is 13 per cent higher; BCE Inc. (BCE:TSX) is 17 per cent higher and Manulife Financial (MFC:TSX) is 21 per cent higher.Then there is the utilities sector, which has been decimated, with Canadian Utilities Ltd. (CU:TSX) now yielding 58 per cent more than its 10-year average and Enbridge Inc. (ENB:TSX) 89 per cent more.The bottom line is that by being bearish on the Bank of Canada doesn’t mean we’re bearish on the economy or the market. In fact, we hope the economy does as well as the bank expects. But we are a market participant and there is no money to be made jumping on the Bank of Canada bandwagon — in fact we think there is more to be made jumping off.Martin Pelletier, CFA is a Portfolio Manager and OCIO at TriVest Wealth Counsel Ltd., a Calgary-based private client and institutional investment firm specializing in discretionary risk-managed portfolios as well as investment audit and oversight services."}