{"id": "End-of-the-cycle volatility is rising. How to play defence using ETFsInvestingTop Stories", "paragraph": "November 16, 20189:46 AM ESTNorth American markets may be reaching the end of a cycle, but Andres Rincon says investors are having trouble letting go of their favourite momentum stocks.Rincon, TD Securities’ director of equity and derivatives strategy, says the conversation goes the same way every time. When portfolio managers recommend that investors lower their exposure to risk, they say it’s not the right time but that they’ll consider it at a later point.“And we all know, later never comes and we see what Bitcoin did, what blockchain stocks have done and what marijuana stocks have done over the last few weeks.”As interest rates rise and momentum stocks suffer from high volatility, Rincon and three other speakers at BMO’s ETF Roadshow at the Adelaide Hotel in Toronto on Thursday suggested that investors should be transitioning toward a defensive portfolio.One easy way to do so, they said, is through ETFs.Perhaps the simplest defensive maneouvre is to invest in an ETF that is made up of trusted, large-cap U.S. companies with a lower beta risk, Rincon said. One such ETF being offered by BMO outperformed the S&P500 by four per cent in two weeks, as the markets corrected, he noted.On top of investing in blue-chip stocks through ETFs, Rincon suggested two particular sectors that investors should target: Health care and real estate. Both sectors stand to continue to offer investors “defensive growth” during a market slowdown, he said.In health care, he suggested, investors should look to ETFs that are equal weight on U.S. companies. That’s because many of the small-cap firms found in such funds generate most of their revenue domestically so they benefit from tailwinds of a strong U.S. economy and aren’t hurt by a higher U.S. dollar.Real estate investment trusts offer a similar opportunity for protection and growth, Rincon said. As the Bank of Canada continues to hike interest rates, REITs offer investors an opportunity to invest in a sector where the central bank’s decisions have little impact. The performance of REITs has risen side by side with interest rates, Rincon said. ETFs focused on Canadian real estate could also take continued advantage of a bullish market.Investors aren’t just looking to dodge volatility in North American markets, BMO Global Asset Management ETF portfolio manager Chris Heakes said. Investing in emerging markets has caused investors pain over the ast few months, but they shouldn’t be looking to pull out of the continent, he said.(The key is) playing it very simple and somewhat boring in CanadaThe headline risk in Europe, mostly caused by Brexit tensions, is increasing market volatility. Interest rates, however, remain low and so investors should be looking into low-volatility ETFs that are outperforming the MSCI Europe Index by eight per cent this year, Heakes said.In Canada, Heakes suggests a similar strategy that focuses on reducing risk. Selling off energy and materials “tends to be a winning view,” he said, adding that investors should instead be exposed to telecommunications, grocers and companies such as Shoppers Drug Mart and Tim Hortons in their ETFs.“(The key is) playing it very simple and somewhat boring in Canada,” he said.Those looking for a more complicated offering might choose a covered-call ETF, Rincon said.In such ETFs, managers write call options against their holdings, adding additional income that can pad returns or offset declines.“They outperform when it matters the most to you — in a sideways market, in a slightly bullish market and obviously in a down market,” Rincon said.• Email: vferreira@postmedia.com | Twitter: VicF77This content was provided by Market One for commercial purposes."}