{"id": "Tom Bradley: Don't fear the bear and more lessons I learned from an investment industry legendInvesting ProTop Stories", "paragraph": "November 2, 20182:32 PM EDTLast week I attended the Investment Industry Hall of Fame Dinner in Toronto. It was special for me because one of the inductees, Bob Hager, was one of my biggest influences.Bob was not well known to the largely eastern audience, although most people had heard of the firm he co-founded, Phillips, Hager & North (now part of RBC). By the time he retired in 2001, PH&N was the largest independent asset manager in Canada.That Bob wasn’t a household name is not surprising because PH&N was headquartered in Vancouver and Bob avoided the limelight like the plague. Besides, the areas where he had the most impact weren’t headline grabbers.Bob was the conscience of a firm that was known for its conscience. His long-time partner, Dick Bradshaw, said that decisions were never made to benefit PH&N and build the business. Rather, it was “let’s look after our clients.”Sharing the ownership in the firm was important to Bob. He didn’t mind selling shares to a new partner if he/she made the business better. He was happy to own a smaller piece of a bigger success.But besides being a builder and ethical pillar, Bob was a great investor. There are many lessons my partners and I learned from him that are still applicable today.KISSBob had a simple approach to investing. More than once he reminded us in our morning meeting that it’s bottom-line profits that drive stock prices, not the fashionable EBITDA (earnings before interest, taxes and depreciation) or other more creative measures. He abhorred hyped-up structured products and would invariably point out that investment bankers hadn’t created a new source of return. These securities would perform in line with their underlying assets, namely stocks and bonds.Against the herdAlong with Art Phillips, one of his co-founders, Bob was a student of investor sentiment. It was important to know when investors were getting too greedy or fearful because at market extremes, he wanted to be going in the opposite direction.Don’t fear the bearBob’s most lasting lessons came in bad markets. While he worried incessantly about his clients, it was weak markets and fearful investors that got his juices going. That’s when he was at his best. I’ve kept a number of his notes and emails from those times.“With every bear market, there are always unknowable concerns, and every time we’re told that this bear market is different.”“If you wait for certainty, you’ll miss the market.”Bob always felt that trying to figure out the implications of the world’s economic problems was a mug’s game. Weak markets were not a time for precision.“My best trades turned out to be the ones when my hand was shaking as I gave Janice (our equity trader) the blue ticket.”Doing the right thing is usually a lonely endeavour. With blood in the streets, there won’t be a crowd of people cheering you on when you’re buying stocks.“Make sure you go up with more stocks than you went down with.” Starting a bear market with 70 per cent of your portfolio in stocks and the recovery with 50 per cent is a sure way to lose ground. You don’t want to let the market manage your asset mix.An example of Bob’s steely resolve came in September of 1998. Canadian stocks had dropped more than 20 per cent in August and the research team was shaken. A not-so-subtle note from Bob pushed us to start buying stocks.“The Canadian market has been particularly hard hit in recent sessions. It is important to remember that picking the bottom of the market is virtually impossible. We are, however, starting to see some values in Canada that look quite compelling. We will be buying into these companies as the market declines.”In reflecting on Bob Hager and his contribution to the investment industry, I have one lingering regret. I wish he’d been better known in Eastern Canada where a bulk of the analysts and portfolio managers reside. The investment industry would be a better place if they’d been privy to his warmth, wisdom and integrity.Tom Bradley is President of Steadyhand Investment Funds, a company that offers individual investors low-fee investment funds and clear-cut advice. He can be reached at tbradley@steadyhand.com"}