{"id": "It's Small Business Saturday, so head out and engage with your brave neighbourhood entrepreneursEntrepreneurTop Stories", "paragraph": "October 20, 20185:13 AM EDTLast UpdatedOctober 20, 20185:13 AM EDTWhen I think of what I love most about my neighbourhood, I think of the Persian bakery with the amazing barbari bread and my super-friendly drycleaner who folds my shirts at no extra charge. I also think of the local hardware store, and my dentist who was able to squeeze me in at the last minute when I broke a tooth. These local businesses add colour to my neighbourhood, and give it life and energy. They’re part of the community.That’s why CFIB partnered with Interac six years ago to create Small Business Saturday, a day to recognize the contributions of our small businesses. Not only do local businesses forge the identities of our neighbourhoods, municipalities and regions, they also drive our economy. In fact, more than 95 per cent of Canadian businesses have fewer than 20 employees.Small businesses can be found everywhere, in all industries. They diversify our economy. Without them, many of us wouldn’t have jobs; small businesses alone employ close to 8.4 million workers in the country, which represents 57 per cent of jobs in the private sector.Small business owners are job creators and innovators. Between 2005 and 2015, they helped create 95 per cent of the new jobs in Canada. More than 80 per cent of small businesses have innovated by improving their services or practices, or by creating new products. When small businesses flourish, they can invest back in their communities and develop new markets — to the benefit of everyone.Apart from the numbers, behind each small business are the men and women who dared to try. We can’t forget that to get a business off the ground, one needs courage, willpower and determination. Small business owners have to commit without knowing whether the wild idea they dreamed up will actually come together as they imagined. That often means putting aside job security and a steady paycheque and accepting the risk of failure. It also typically means working longer hours than anyone else, putting off family vacations and free time until the business is well established.That’s why today, I want to say thank you to all those entrepreneurs who took that chance. Join me and stop by your local businesses today. Let’s celebrate these men and women who put their fear aside and took the leap to enrich our communities. To find a great local business you may never have heard of before, visit Thank you to the owners of small coffee shops who help us start our day off on the right foot, to the artisans who create unique works that transform our homes and to the pioneering creators who make life in the neighbourhoods more vibrant. Let’s celebrate those who made the big decision to start small.• Dan Kelly is president of the Canadian Federation of Independent Business and lead spokesman and advocate for the views of CFIB’s 110,000 small and medium-sized member businesses across Canada."}