{"id": "Foreign tech brings cash and jobs, but at what price?Top Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.November 15, 20183:50 PM ESTLast UpdatedNovember 16, 201812:06 PM ESTCanada has a rich history of innovation, but in the next few decades, powerful technological forces will transform the global economy. Large multinational companies have jumped out to a headstart in the race to succeed, and Canada runs the risk of falling behind. At stake is nothing less than our prosperity and economic well-being. The FP set out explore what is needed for businesses to flourish and grow. Over the next three months, we’ll talk to some of the innovators, visionaries and scientists on the cutting edge of the new cutthroat economy about a blueprint for Canadian success. You can find all of our coverage here.At first blush, Uber Advanced Technologies Group’s downtown Toronto office in the MaRS building looks pretty unremarkable. There are long rows of workstations with big curved computer monitors, mostly used for writing computer code. The conference rooms have whiteboards with inscrutable notes and symbols scribbled on them. De rigueur for any self-respecting tech company, there is a well-appointed kitchen with candy dispensers, snacks, catered lunches and beer in the fridge.The toy car parked in the back corner of the office is the only hint that some cutting-edge fundamental research is happening here. The little white model Volvo is about a half-metre high and made of plastic, but it has a big black cone stuck on the roof, which takes the place of what will be a light detection and range (LIDAR) sensor that will hopefully allow full-sized cars to one day drive autonomously through cities, revolutionizing transportation and upending the world.“We focus on building the brain of the self-driving car,” said Raquel Urtasun, Uber ATG’s chief scientist and head of the Toronto lab, which is one of the key outposts for the San Francisco-based ride-sharing company’s autonomous vehicle work.Urtasun is the sort of highly in-demand expert in machine learning that Canada is becoming famous for. She wears a lot of hats. As well as her job at Uber, she’s an associate professor in computer science at the University of Toronto, and a Canada Research Chair in Machine Learning and Computer Vision. When people in the tech world talk about “top talent” they’re talking about people such as Urtasun.And that’s what makes the Uber ATG lab such a divisive thing. Top talent is in short supply, and critics say that Uber and other giant companies are using Canada as a sort of colonial outpost, setting up branch plants to gobble up university grads, siphon off all the economic benefit, including the intellectual property, and smother homegrown tech companies in their infancy.Foreign company interest in Canada’s tech scene is undeniable, especially since Toronto and Montreal are globally significant centres for artificial intelligence research. According to MaRS, which supports the innovation sector in Toronto, $1.4-billion worth of new investment announcements by tech companies in the city were made in September alone.But aside from a monster $500-million real estate deal by Ottawa-based Shopify Inc., all the other investments came from companies based outside Canada.Microsoft Corp. said it will expand its Toronto office, investing $570 million and adding around 500 new jobs, while Intel Corp., Pinterest Inc. and Instacart also made announcements about plans to expand there, too. And Uber chief executive Dara Khosrowshahi visited Toronto in mid-September to announce plans to invest $200 million, partly to expand Urtasun’s ATG lab work on autonomous vehicles.Such investments would seem to be a good thing, creating high-paying and interesting jobs that can entice the best and the brightest to stay home, but you don’t have to look hard to find local voices grumbling about the investments. The lack of available talent often tops their complaints.“You can’t find that talent in Canada because your government is bringing in all these foreign entities who have amazing brand names,” said Carl Rodrigues, chief executive of SOTI Inc., a Mississauga company that makes software to connect mobility devices and internet-connected sensors.“If I could hire 300 top-tier software engineers here in Canada right now today, I would. I have the need for it. You know, I just can’t find that fast enough here in Canada, and one of the reasons is that thousands of these software engineers in Canada are hired by Microsoft, hired by Google, Facebook, et cetera.”Instead, SOTI is doing the next best thing. Last month, the company announced plans to expand its Ireland office, hiring 150 workers overseas.Rodrigues said that companies making splashy hiring announcements in the tech sector is nothing to get excited about.“We are at full employment,” he said. “If I want to hire somebody to do a job in this country, I literally have to steal that person from another company. I’m not creating a job.”But it looks like many Canadians don’t share Rodrigues’ concerns about foreign technology investment, according to an online poll 1,111 Canadians done for the Financial Post by research company SurveyMonkey.The poll found that 18 per cent of respondents thought there were too many foreign technology companies investing in Canada, but 33 per cent said there was “the right amount” and 43 per cent felt there were too few.The argument for more FDI is neatly laid out by a 2016 report by the federal Advisory Council on Economic Growth: “Foreign direct investment (FDI) is a critical driver of economic growth for both developing and advanced economies. In slower growing advanced economies, new investment by foreign firms in productive capacity can provide a boost to national income and employment. In any economy, it can help raise productivity, competitiveness, and living standards over the long term.”That same 2016 report voiced concerns that Canada is “falling behind” global peers, and that fear is borne out by Organisation for Economic Co-Operation and Development data.The OECD reported that Canada had US$69.3 billion in foreign investment in 2013, but that has steadily slipped to just US$24.7 billion in 2017.The slide is even more dramatic when expressed as a percentage of GDP. Canada ranks 27th when comparing foreign investment to the total size of the economy, according to the OECD, behind the U.S., India, Slovenia, the United Kingdom and a host of other countries.But even though the economic case to reverse dropping FDI numbers is easily made, some in the technology sector continue to complain about the amount of interest foreign players have in Canada.Part of their unease is the tight labour market, but another widespread complaint is that foreign tech companies that do research and development work in Canada are developing valuable intellectual property on the backs of Canadian workers, but the value of that IP ultimately goes outside the country.Software is infinitely replicable, so once developers build a product, companies can sell it an unlimited number of times, thereby deriving huge value from the intellectual property.Most citizens don’t see that as a concern, and welcome foreign tech investment. Indeed, the SurveyMonkey poll found that 55 per cent of respondents said the Canadian government is not doing enough to attract such investment.The poll coincided with a visit to Ottawa by SurveyMonkey chief executive Zander Lurie. The company is based in San Mateo, Calif., but he called Ottawa the company’s “HQ east” and said he plans on significantly expanding his workforce in Canada.“We by no means feel like we’re coming in and stealing jobs,” he said “In fact, when we come into a market, we try to concentrate and focus on having a few thriving offices as opposed to many branch offices, so for us, this is very much a consolidated effort to invest in the market, serve our customers better, reward our employees with valuable investments and compensation, and be an active participant in the community.”The idea of being an active part of the local tech community is something that comes up a lot in discussions about the industry’s talent shortage. To have a thriving sector, such as there is in Silicon Valley, you need a complete ecosystem, and that means a good mix of big and small companies.The big players are magnets for top talent, and they give the best new graduates their first jobs out of university, offering training and experience. But those tent-pole players don’t hold onto employees for life.As people progress in their careers, they move to bigger roles at different companies, or they follow their entrepreneurial startup dreams. When some of those startups inevitably fail, the tech giants offer a soft fallback job for mid-career tech professionals.Big, established tech companies could be even more important to the Canadian tech sector — even if they’re foreign companies — because a recent study by University of Toronto professor Richard Florida, director of the Martin Prosperity Institute, suggested that the domestic tech scene is decidedly underwhelming without them.Florida, working with Ian Hathaway, a senior fellow at the Brookings Institution, a U.S. research group, looked at 100,000 venture-capital deals across 300 cities around the globe to quantify the relative levels of tech startup activity.By focusing on just venture-capital deals, the study gives a picture of what the Canadian tech scene looks like once you strip away the FDI from big tech companies.“Decidedly third tier” is how Florida described Toronto’s startup ecosystem compared to the innovation powerhouses of the world, namely Silicon Valley, New York, Beijing and Shanghai. Montreal and Vancouver sit another tier below even that.Florida said the U.S. made up between 90 and 95 per cent of global venture-capital deals in the 1990s, but that has now fallen to less than 50 per cent. Toronto makes up less than one per cent of such deals to rank 20th overall. The next-best Canadian cities are Vancouver at No. 35 and Montreal at No. 47.“I hope we get these things right, but I think we’re missing the boat more in terms of startups and also in terms of FDI,” Florida said.Ultimately, the issue of foreign players setting up in Canada is more than simply focusing on whether U.S. tech company branches hurt local tech companies, because Florida’s research shows the actual competition is global.Back in the Uber ATG lab, Urtasun said she’s an example of how things really work.Urtasun said she moved to Canada four years ago from the University of Chicago in no small part because Toronto is a hotbed for interesting artificial intelligence research, and she took Uber’s job offer rather than staying in academia because it offered her the resources to do the most exciting, cutting-edge research.“The competition that we have is not just Canada. We are in a global market, where, you know, if people have better opportunities elsewhere, they’re going to go elsewhere,” she said, pointing out the U.S. is often that destination.“If you have more talent here, that attracts more talent that can actually feed the local ecosystem. And one of the things that is very interesting is that a lot of the local startups have said that since the opening of all these foreign labs, they have a much easier task in attracting talent.”• Email: jmcleod@nationalpost.com | Twitter: jamespmcleod"}