{"id": "IPhone XR review: The best $250 you ever saved on a new phonePersonal TechTop Stories", "paragraph": "October 24, 20189:22 AM EDTLately, Apple has made shopping for an iPhone complicated. So let me simplify: If you’re in the market for an upgrade, buy the iPhone XR.I don’t blame anyone who’s been holding on to an old iPhone 6, 6S or 7. The data shows people are waiting longer and longer to upgrade, with good reason: Phones haven’t been getting that much better, yet prices have pushed to US$1,000, or even US$1,450 for the top iPhone.With the US$750 iPhone XR, arriving in stores on Friday, you have the opportunity to leap ahead to better technology — like a superior camera and more screen — without getting a nosebleed from the price tag. The best part: Your battery will last an astounding three hours longer than the US$1,000 iPhone XS, according to my tests. Just promise you’ll do one thing before you buy: Go to a store and see whether the XR’s larger shape fits your hand.Apple confused everyone this fall by introducing three new models: the iPhone XS (large), the iPhone XR (larger) and the iPhone XS Max (largest). Yet the prices didn’t increase with size — the only one that costs less than a grand is the XR, pronounced “ten-R.” To further complicate matters, Apple waited an extra month to sell or even show off the XR in stores while it marketed the dickens out of the expensive models.But like all middle children, the XR shouldn’t be overlooked. This phone isn’t an old model with a colorful paint job. It’s 95 per cent as good as the very best, for 75 per cent of the cost. Think of the iPhone XR as the top Toyota you buy instead of the Lexus. It’s Chandon sparkling wine instead of Moët champagne. It’s the Backstreet Boys instead of ‘N Sync.Why bother upgrading? And what do you give up by not splurging on the XS and XS Max? Answers below.———For anyone using a phone from 2016 or earlier, I think the XR will feel like a dramatic upgrade, the most significant since the iPhone 6 first brought Apple into the big-phone trend.What you’ll notice first about the XR is how much more screen there is for playing games, reading articles and going down YouTube rabbit holes. The 6.1-inch screen is 45 per cent larger than that of the iPhone 6 — a godsend because nobody’s eyes are getting sharper. Apps are bigger, type is bigger, and the on-screen keyboard is bigger, making for fewer embarrassing auto-correct moments.The downside is the screen isn’t just larger because it goes from edge to edge. The iPhone XR is also physically larger — a third of an inch wider than an iPhone 6 and more than two ounces heavier. Because the phone has a large waist, my grip on it wasn’t solid. At a store, I recommend holding it like a gun with your index finger and thumb to see if it might slip out. (A case might make it more grippy; Apple isn’t selling its own yet, but others are available.) Also, while holding it in one hand, swipe your thumb in an arc to see how much of the screen you can reach.(Why do phones keep getting bigger? Sales point to the idea that people can’t get enough screen, even if they might be nervous about carrying it around. Still, I wish Apple had made the XR a little smaller, or would revive its petite iPhone SE line.)The other controversial change: the trusty home button, with its Touch ID fingerprint reader, is gone. It’s been replaced by Face ID, which scans your mug to unlock, and a swipe-up gesture from the bottom that brings you back to the home screen. It’s weird at first, but you get used to it, and in my tests FaceID on the new phone seems to work a little faster on the XR than last year’s X. If a home button is a dealbreaker, you can still buy an iPhone 8 with one, or switch to an Android phone, many of which have buttons on the back or buried inside the screen.A few other aspects of the XR will undoubtedly delight older iPhone owners. The processor, called A12 Bionic, is Apple’s fastest ever, so it can fly through apps or run new augmented-reality experiences. The XR is water-resistant up to a meter, so it can survive a swan dive into the loo.The XR’s cameras are significantly better. Since 2014, Apple has not only increased the camera’s resolution but also the size and sensitivity of the sensor that captures images, allowing it to take night photos that look much more like the eye sees. A new generation of flash fills the background, so subjects don’t look like raccoons caught in the act. The XR also uses software to stabilize video, so that piano recital or baseball game looks less like you’re riding a roller coaster.And I saved the best for last: battery life. The XR is a beast, topping its more expensive sibling, the XS, because it has a larger battery and uses a different screen technology. It also lasted 2 hours longer than an iPhone 7 in my stress test, which involves scrolling through websites nonstop. None of this is going to let you go without charging your phone at bedtime, but it will certainly be welcome on a busy day.But let me be clear: You don’t have to buy anything. Most existing iPhones can get a free upgrade with iOS 12, software that was designed, in part, to make older iPhones more stable. And through the end of the year, the company — caught slowing phones with old batteries — is offering to replace the battery in iPhone 6, 6S, 7 and 7 Plus phones for US$30. Not buying a new phone is also much better for the environment.———Of course, the XR isn’t the best iPhone, which is usually the way to go with Apple products. So what’s the difference between the iPhone XR and XS? Mostly 250 of your hard-earned dollars.Phones keep getting pricier mostly because some of us will pay for them. There’s a set who will settle for no less than all the iPhone they can get: They live on their phones and use them more for work than even a laptop. For them, the US$1100 iPhone XS Max, with a 6.5-inch Jumbotron, is a no-brainer.But after an honest assessment of the latest Apple lineup, I think many people would choose the XR and hold on to their cash.First, there’s a bunch of important stuff that’s exactly the same: They both use the same processor. They both unlock with the same Face ID cameras. They both come with a minimum 64 gigabytes of storage.The differences start with the screen. The XR uses an older technology called LCD. It’s still better than the iPhone 8, but when you hold the XS and XR side by side, you might notice the blacks are not quite as dark and the colours are not quite as rich as the OLED screen on the XS. The pixels aren’t as dense, either, but you’d need a magnifying glass to tell.Second, the XR’s body isn’t quite as sturdy. Apple says it has the newest, most shatterproof glass on the front, though not on the back. And its frame is made of aluminum, not steel. I didn’t have any damage when I (accidentally) dropped the XR on hardwood and carpeted surfaces or (on purpose) into a toilet. A drop onto concrete or from on high could be more of a problem.Call quality and data download speeds were similar, though slightly superior on the XS, which supports a faster style of connection. The XR also comes in more colours — a lovely blue! — but you’re probably going to cover it in a case anyway. If you have your heart set on gold, that only comes in the XS.And finally, there’s the camera, which I put it through the ringer. The front-facing selfie camera is exactly the same as the XS, but on the back, the XR has just one camera instead of two. Standard wide-angle shots look exactly the same. But when it comes to portraits, the XR doesn’t have data from a second lens to make the background blurry. In my tests, it didn’t do quite as good a job figuring out the edges around hair, but it was still decent.I missed the second lens mostly for zoom shots. It can bring your subject twice as close without losing image quality. As an avid photographer, I’d have a hard time giving this up on the XR. But if you’re upgrading from an older iPhone, the camera on the XR will already be such an improvement, you probably won’t even notice.The takeaway? Apple has finally made a phone with most of the latest tech innovations that doesn’t cost a thousand bucks. Now you just have to figure out what to do with all that money you saved.The Washington Post"}