{"id": "Hitman 2 review: When more of the same isn't so badTop Stories", "paragraph": "November 16, 20181:00 PM ESTScore: 8.0/10  Platform: PlayStation 4 (reviewed), Xbox One, Windows PC Developer: Io Interactive Publisher: Warner Bros. Interactive Entertainment Release Date: November 13, 2018 ESRB: MThe purpose of the medium of video games is, to at least some degree, to give players a chance to safely experience dark fantasies. That could mean becoming a morally vacant thug in a Grand Theft Auto game, living through the trench-based terrors of the First World War in a Battlefield game, or, in the case of the Hitman series, becoming a bald-headed, barcode-tattooed contract killer.Hitman 2 picks up right where 2016’s Hitman — which rebooted the long-running franchise — left off, with Agent 47 and his handler Diana continuing to take on paid assignments for clients with the ulterior motive of learning more about 47’s erased past. But while Hitman gradually doled out its handful of missions over the course of “season” lasting several months, all six of Hitman 2‘s primary missions are, thankfully, available right from the get-go, allowing eager players to binge and master them at their own pace.It does, however, feel less like a sequel and more like a second season — not only in how it continues the story without missing a beat, but also in that it feels very much like new content within the same game. There’s little in the way of new features, altered mechanics, or improved presentation. This will understandably irk some players hoping for something bigger and better — the traditional pillars of game sequels — but it also means that those who enjoyed the original Hitman will be able to hit the ground running, so to speak, and begin wading into Hitman 2‘s huge assassination sandboxes without wasting any time learning how to play.And those sandboxes are quite something. Hitman 2, like its predecessor, is all about choice. Whereas some games provide just one or two ways to accomplish an objective, the number of ways to go about assassinating your targets in Hitman is too big to easily count. You’ll be dropped into a living world — like a suburban neighbourhood, or the busy stands and offices surrounding a high octane car race — filled with potentially hundreds of non-player characters going about their business. How you go about Agent 47’s business is up to you. You can don disguises to infiltrate off-limits areas, set traps and poison drinks, lure foes to secluded locations, or just go in with guns blazing. Actually, that last one isn’t recommended. Agent 47 isn’t superhuman, so if you cause too much commotion your best bet to survive is to think on the fly and change tactics.Creating and programming such dynamic worlds must be a monumental task, and telltale cracks eventually begin to show. Guards are sometimes a bit dumber and more predictable than you’d hope, and 47 can get away with being a bit more suspicious than you’d think — design weaknesses that can be exploited by the observant player. Still, few other games even attempt this level of sandbox freedom. Developer Io Interactive deserves applause.Indeed, Hitman 2 is at its lethal best when you take the time to absorb everything it offers. Patience — by which I mean slowly exploring the world and getting to know specific locations and characters — often yields unanticipated and satisfying openings. You should always pay attention to what bystanders are talking about as you pass by, because some of their conversations will reveal side stories that provide additional insight into various plots while providing unique opportunities to get closer to and creatively kill your main targets. I’d provide specific examples, but to do so would ruin the pleasure of discovering them yourself. Suffice to say there are plenty, and many are satisfyingly creative.This kind of emergent play gives Hitman 2 a terrific longevity, allowing players to go back to completed missions and experience them in a completely different way. And the more you play a mission the more you can customize it in future play-throughs, unlocking new infiltration and points and places where you can stash weapons and gear to pick up along the way.Add in Sniper Assassin mode (which lets you customize scenarios) and Elusive Target missions (downloadable competitive missions in which you’ve only one chance to eliminate a specific target), and the replayability goes through the roof. I’ve encountered few single-player games that remain as fresh and fun on the third or fourth run as they were on the first.And, in the end, this is what makes Hitman 2‘s assassination fantasy so compelling. We’re provided complete control over how Agent 47 does his job. He can go about his business in truly stealthy fashion, or he can set the world on fire. We can have him live by a code of professional ethics, taking down only those who’ve been targeted for killing (they’re generally obvious nogoodnicks, in case you were wondering whether they’re deserving of his lethal attention), or we can turn him into a cold-hearted murderer who remorselessly dispatches anyone who gets in his way.And in creating a scoundrel of our choosing, we might actually end up learning a little bit about ourselves."}