{"id": "Whatever the stock market's problem, it's worse in tech sharesInvestingTop Stories", "paragraph": "October 30, 20183:01 PM EDTTech wreckage keeps piling up.The once high-flying stocks that propelled the S&P 500 Index to records have been leading the way down amid signs of hedge fund flight.Equity market fear has become more focused in technology stocks, according to options markets. As domestically sensitive U.S. segments like homebuilders and regional banks have tread water over the past week, the Nasdaq 100 Index has fallen nearly 5 per cent.It’s pushed the spread between the Cboe NDX Volatility Index and the Cboe Volatility Index close to the highest levels of the year. The former measures the implied volatility of the Nasdaq 100 over the next month, while the latter does the same for the S&P 500.Catching a falling knife in tech will be hard. Not only have positive catalysts — like the highest beat rate on earnings this reporting season — failed to buoy shares, but it’s also tough to know just where investors can be confident the selling will abate based on the fundamentals.“Unlike industrials or materials stocks, there isn’t any clear ‘valuation floor’ for tech,” said Pravit Chintawongvanich, equity derivatives strategist at Wells Fargo. “It’s a function of how much you’re willing to pay up for growth.”The Nasdaq 100’s forward price-to-earnings premium relative to the S&P 500 is near its lowest levels of 2018. But even after this narrowing, it would still make for the biggest valuation gap compared to the prior three years.“We saw for over two years how the market bowed at the altar of Amazon, Apple, Alphabet, Microsoft, and Facebook,” said Dave Roberts, a Washington-based independent trader of volatility options and products. “Breadth was weak, signs of deterioration showed up almost everywhere, yet it was all covered up by five stocks. Now, they’re broken.”Mandy Xu, chief equity derivatives strategist at Credit Suisse, contrasts the relatively low level of implied and realized correlation among S&P 500 members with the opposite in tech stocks.“Despite the sharp correction over the past month, we’re still trading at below average levels of correlation and about 35 points below where correlations typically trade in a large S&P 500 drawdown environment,” she writes. Meanwhile, the implied correlation among Nasdaq 100 constituents has seen “a significant surge over the past week, up 15 points to 55 per cent indicating more widespread concern over the sector’s outlook.”Realized correlation among the stocks in Goldman Sachs VIP basket of hedge fund longs has also more than quadrupled over the past month, she added. That’s a sign some of the carnage is driven by the community checking out from hedge fund hotels.At the same time, signs that the pendulum has swung too far away from risk assets has some on Wall Street sniffing out an ideal buying opportunity.Christopher Harvey, head of equity strategy at Wells Fargo Securities, notes that the realized swings in the S&P 500 compared to a basket of low-volatility stocks from the benchmark gauge has reached “risk aversion extremes.”For the Nasdaq 100, the spread is even wider — the most since 2009.“Once we hit a risk aversion extreme, the trend usually reverses itself over the next 1-3 months with the market rewarding ‘risk-on’ stocks over ‘risk aversion’ names,” writes Harvey. “Current vol spread levels support our view that now is the time to take on risk.”Some of his high-quality recommendations within the Nasdaq 100 include Facebook, Microsoft, PayPal and Nvidia.Bloomberg.comThis content was provided by Market One for commercial purposes."}