{"id": "Ottawa's annual spending breaches $300B for first time, pushing up Canada’s debt ratioEconomyTop Stories", "paragraph": "October 19, 201812:54 PM EDTLast UpdatedOctober 19, 20187:47 PM EDTOTTAWA — Federal spending continued to rise over the last fiscal year, ballooning to over $300 billion for the first time and helping push up Ottawa’s net debt-to-GDP ratio, long touted by the Liberals as evidence of their controlled spending habits.Spending in the fiscal year reached $332 billion, largely due to a recent accounting change that categorizes certain debt liabilities as program expenses. That compares to $287 billion in spending in 2016-17, which Finance estimates would have equalled roughly $312 billion under the current accounting rules.The federal debt-to-GDP ratio now stands at 31.3%, up from the 30.4% projection in the 2018 budgetSpending also rose due to higher program expenses, including for national defence, various Crown corporation expenses and other government costs, according to Ottawa’s annual financial report released Friday.The accounting changes raised Canada’s net debt-to-GDP ratio, a key fiscal anchor that Finance Minister Bill Morneau has repeatedly cited as proof that Ottawa’s balance sheet remains healthy.Ottawa still managed to lower its debt-to-GDP to 31.3 per cent, down from 32 per cent in 2016-17, when adjusted for the new accounting system. But that ratio now stands well above the 30.4 per cent that was projected in the 2018 budget, under the old accounting rules.Ottawa also added around $20 billion to the national debt in the 2017-18 fiscal year. As of March 31, Canada’s net debt now stands at $758 billion, up from $734 billion in 2016-17.The higher spending came as personal income tax revenues increased over the year, and amid a strong Canadian economy. Bank analysts and other experts have said Ottawa should instead lower its spending amid a tight labour market and robust economy, keeping more cash in hand should the global economy flounder.Ottawa added around $20 billion to the national debtPrime Minister Justin Trudeau had initially promised to return to surplus in the years following his election win, after running an initial deficit of $10 billion. The deficit is now just under $20 billion, with Ottawa abandoning its plan to balance the books before the election.Canada’s net debt-to-GDP ratio still remains among the lowest and healthiest of any developed nation. In the U.K., for example, the ratio is around 70 per cent.Personal income tax revenues grew by $9.9 billion, or 6.9 per cent, a rise that came in part due to controversial tax changes introduced by the Liberal government last summer.The annual deficit came in at $19 billion, virtually unchanged from the year priorThe changes included a higher tax rate on “passive” investment holdings above a certain threshold. That prompted many high-wealth individuals to defer their earnings and skirt the higher rates in 2016-17, blowing a hole in government revenues last year.However, Finance officials said the rise in personal income tax revenues suggested Ottawa has now recouped some of this initial losses.The annual deficit came in at $19 billion, virtually unchanged from the year prior.We want to improve your reading experienceCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}