{"id": "Canada Goose steps into footwear, as global expansion hits VancouverRetail & MarketingTop Stories", "paragraph": "November 2, 20185:58 AM EDTLast UpdatedNovember 2, 20185:59 AM EDTCanada Goose Holdings Inc. is slowly expanding beyond its parka roots, entering the footwear realm on Thursday with a $32.5 million acquisition that comes as it continues to grow its roster of flagship stores around the world.The deal to acquire Baffin Inc., which will see the Ontario-based winter-boot maker continue to operate as a standalone entity, is part of a transition that CEO Dani Reiss says has seen the company — which found international renown with its extravagantly priced, Arctic-proof parkas — morph into a full-fledged “three-season lifestyle brand.”“Lots of companies that have a little bit of brand velocity just start making all kinds of stuff and throwing their logos on it,” Reiss said. “Personally, I believe that’s the way to ruin a brand. We don’t do that…. We make best-in-class products and this is an opportunity to buy best-in-class technology and use it for our own footwear line.”Footwear will eventually join a widening roster of offerings that already includes a number of lighter weight products, such as rain gear and knitwear.That means, as the company eyes new locations for expansion, it won’t be confined to desperately cold places, Reiss said.That expansion will take its next step on Friday, when Canada Goose opens a flagship store in temperate Vancouver, to be followed by others in Montreal and Beijing before the holiday shopping season begins in earnest.The Beijing store comes after the opening of a Canada Goose flagship in Hong Kong last month, and the opening of a Shanghai regional office and a China e-commerce sales partnership through through the Alibaba Group. Since its wildly successful initial public offering last year, Canada Goose has been focused on its entrance into China while continuing to grow its retail stores.“We’ve built this brand by doing things that other people aren’t doing,” Reiss said. “Now, in these times, more often than not, brands are closing stores … There’s this so-called retail apocalypse.“To be able to be in a situation where we’re opening stores in this kind of landscape … that’s just another example of how, even as a larger company, we can continue to swim upstream.”The push to open news stores started in 2016, with the goal of opening up to 20 locations by 2020 – a target Reiss said Canada Goose is on track to meet with stores currently in Toronto, New York, London, Chicago, Boston, Calgary, Tokyo and New Jersey. Next, Reiss said, he sees more “geographic opportunities” in the U.S. and Europe, as well as more in China and Canada. But he wouldn’t say where.“If you had to guess the list, I think you’d probably do pretty well,” he said. “I won’t rule out hot climates. But we have a long list of cities that we’d like to be in and we want to do it very carefully and methodically.”To be able to be in a situation where we’re opening stores in this kind of (retail) landscape ... that’s just another example of how … we can continue to swim upstreamBut that kind of expansion can’t be without complications. Asked if there were challenges to growth in China, Reiss said “there’s a lot of bureaucracy in China that you have to be prepared to deal with.” The expansion could have also riled the giant department store chains that are his wholesale partners, upset with the prospect of competing with Canada Goose store in certain markets. But that didn’t happen, Reiss said.“If you asked them, ‘Would you rather if Canada Goose opened a store or not?’ They’d say no. And that’s natural, right?” he said. “But not even! That’s not even true, entirely. Because, you know, flagship stores for global brands are common and really help elevate the brand both in global and local markets. So no, we really have experienced little pushback.”Reiss, who two decades ago took over the family business his grandfather started in the 1950s, has become an ardent protector of the Canada Goose brand. To date, he said, he has inspected each location before signing the lease and visits each store on an annual basis.“Depending on how many stores we have, one day I might not be able to do that,” he said. “But we’ll take that one day at a time, or one year at a time, or one month at a time or something like that.”Calculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}