{"id": "Trade war, market drag creating opportunities in China, CPPIB chief saysFP StreetTop Stories", "paragraph": "November 9, 20184:57 PM ESTMounting pressures on China, including the latest trade tensions with the United States, are creating potential investment opportunities for the Canada Pension Plan Investment Board, says Mark Machin, chief executive of the pension management organization.“Our teams are busy,” Machin told the Financial Post on Friday in a phone interview during his latest trip to China.“I think given the softening markets in China and related markets (we) will probably see some interesting investment opportunities emerge.”He said the trade tensions over tariffs arrived when China was already “wrestling” with a number of domestic issues, including deleveraging its economy, reducing the shadow banking sector, and unwinding some of the stimulus that helped the country weather the financial crisis of 2008.“The combination of all these (elements) has put quite a lot of pressure on the private sector in particular in China, which will throw up interesting opportunities for us over time,” he said. “They’ll need capital.”CPPIB, which has invested $28 billion in mainland China since establishing a local Hong Kong office in 2008, plans to boost the proportion of its portfolio invested in China from less than eight per cent to up to 20 per cent by 2025.In August, the pension management organization committed US$1.4 billion to the Goodman China Logistics Partnership, which was established by CPPIB and Goodman Group in 2009 to invest in logistics properties in prime locations across mainland China. Goodman and CPPIB have committed a total of US$5 billion to the partnership.Machin said the trade issues and fiscal tightening are developments that could nonetheless have an impact on economies around the world.“It’s a concern that we have this really high trade tension between the U.S. and China…. I think it’s unlikely it goes away quickly, unfortunately,” he said.Still, prices remain buoyant in the U.S., where future earnings expectations are much higher than elsewhere in the world, possibly unrealistically so, Machin suggested.“We’re quite late cycle in the U.S. Markets are pricing in quite an optimistic outlook for corporate performance,” he said.It’s a concern that we have this really high trade tension between the U.S. and China…. I think it’s unlikely it goes away quickly, unfortunately“When we’re looking at investments we have to be very careful the companies we’re investing in are actually priced appropriately for the risk that they’re not going to be able to meet those lofty expectations in the future.”CPPIB reported investment returns of 0.6 per cent in the three months ended Sept 30, a period in which a strong Canadian dollar created a “currency drag” on returns. Many investments are held in foreign currencies, but the pension management organization reports in Canadian dollars and does not hedge currencies.Machin said returns can be expected to fluctuate with global economic cycles, and more focus should be placed on five- and 10-year returns because sustainability of the CPP Fund, which is invested to pay future benefits of the Canada Pension Plan, is measured over a 75-year period.The five and 10-year returns are 12.1 per cent and 9.1 per cent, respectively.We want to improve your reading experience"}