{"id": "It will take much bigger thinking if Canada is to compete with giants in the ideas economyTop Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.November 15, 20182:18 PM ESTLast UpdatedNovember 16, 201812:40 PM ESTCanada has a rich history of innovation, but in the next few decades, powerful technological forces will transform the global economy. Large multinational companies have jumped out to a headstart in the race to succeed, and Canada runs the risk of falling behind. At stake is nothing less than our prosperity and economic well-being. The FP set out explore what is needed for businesses to flourish and grow. Over the next three months, we’ll talk to some of the innovators, visionaries and scientists on the cutting edge of the new cutthroat economy about a blueprint for Canadian success. You can find all of our coverage here.We no longer understand how to generate wealth. We think we do, but we don’t. We marvel at the ability of companies such as Amazon.com Inc. and Alibaba Group Holding Ltd. to bend economies to their will, yet we spend little time thinking about how those companies became so big. Our lack of curiosity is impeding Canada’s ability to generate the economic growth that will be necessary to fund the healthcare system, schools and universities, and public pensions. By sticking with an outdated view of how the economy works, we are leaving money on the table. There are reasons why the biggest publicly traded company in the United States is one that fundamentally changed the way the world consumes and shares information, and the most valuable company in Canada is a bank that generates 60 per cent of its revenue at home and an additional 25 per cent in the U.S. “We have to move beyond energy as the driver of our economy,” Wayne Wachell, chief executive of Vancouver-based Genus Capital Management, which manages assets worth about $1.5 billion, told me in an interview. “Toronto has a bunch of banks. What do the rest of us do? Sell insurance and wealth management? Nobody seems to be having that conversation. How do we make the country more entrepreneurial?”An unexpected consequence of the media’s obsession with the NAFTA talks was that a business story became one of the most talked about issues in the country. The narrative implied either a weak grasp of how modern business works, or an unwillingness to challenge the stories of lobbyists for legacy industries. In August 2017, Chrystia Freeland, the Foreign Affairs Minister, presented six broad objectives for the NAFTA negotiations, a list that she said was based on 21,000 public submissions. First among them was a commitment to “modernize” the North American Free Trade Agreement, a commercial arrangement completed three years before Sergey Brin and Larry Page registered Google as a domain name. “NAFTA needs to address this, in a way that ensures we continue to have a vibrant and internationally competitive technology sector and that all sectors of our economy can reap the full benefits of the digital revolution,” Freeland said. She was right. A shallow dive below the surface of Canadian hiring data would have revealed that the action in the economy was around services, including in the area that Statistics Canada describes as “professional, scientific, and technical services.” That category is a proxy for the “intangible economy,” where wealth is generated by things such as intellectual property and work processes, rather than tangible goods such as canola and brake pads. Ocean Tomo, a merchant bank, estimates that about 85 per cent of the value reflected in the Standard & Poor’s 500 stock index is derived from intangible assets, compared with about 30 per cent in 1985. The intangible economy isn’t about the future; it’s the present. Yet Freeland left the impression that her nod to modernizing the North American Free Trade Agreement was to satisfy readers of the Economist, or perhaps a few vocal technology entrepreneurs.Politicians and journalists like to root big concepts like international trade with real-world examples. Freeland is both, so it was unsurprising that she dropped the names of a few companies. Her choices were telling. She didn’t mention Ottawa-based Shopify Inc., the brightest of the new economy stars. Nor did she talk about CGI Group Inc., the Montreal-based information-technology firm that employs more than 72,000 people around the world, or Open Text Corp., the Waterloo, Ont.-based provider of data-management software. Instead, the heroes of Freeland’s tale about why trade matters were three champions of the pre-Google era: Magna International Inc., the Aurora, Ont.-based maker of automobile parts; Pratt & Whitney, the American builder of jet engines that has a large operation outside of Montreal; and Precision Drilling Corp., the Calgary-based supplier of oil rigs. All fine companies; but none are good examples of the kind of economy we should be striving to create. The combined contribution of the automobile and aerospace industries to gross domestic product is less than that of the firms that StatCan bundles under the heading “computer system design and related services,” according to Stephen Poloz, the Bank of Canada governor. The oil-and-gas industry has some track left, but its ability to generate wealth likely has peaked given the global shift away from carbon. The mining and oil-and-gas industries added about 18,000 jobs from the start of 2017 through August of this year, compared with about 92,000 in the healthcare industry, according to StatCan’s monthly survey of company payrolls. Yet we still tend to talk about ourselves as a country that derives its wealth from resources, automotive plants, and (maybe) financial services. At a recent event hosted by the CBC, Freeland was asked by a member of the audience what she thought Canada had gained from the NAFTA talks. She said that her “personal favourite” was the removal of Chapter 11, which allows companies to sue governments. Freeland also said that she was pleased to have gotten rid of the clause that gives the U.S. guaranteed access to Canadian energy, and that she was happy to have won enhanced market access for exports of margarine and sugar. That was her top-of-mind list. Nothing about intangibles. “Because of decades of failed innovation policies that completely ignored IP ownership, Canada is a large net importer of IP, so this is a bad deal for Canada’s plans to build a 21st century economy,” Jim Balsillie, the former co-chief executive of Research In Motion, the company that created the BlackBerry, said in a statement after Canada, Mexico and the U.S. agreed on a revised trade agreement at the end of September. The way we talk about the economy matters because generating economic growth from ideas instead of goods will require different policies than the ones with which we have become comfortable. Gina Cody, the former executive chair of CCI Group Inc., a Toronto-based engineering firm, thinks Canada’s position to capitalize on the shift to intangibles “couldn’t be better.” That’s mostly because we remain open to immigration at a time when the U.S. is issuing fewer visas, giving us a competitive advantage in the global war for talent. But liberal immigration rules won’t be enough. Cody, who serves as chair of Concordia University’s industrial advisory council, told me in an interview that the country’s post-secondary institutions are underfunded, which is one of the reasons they end up doing deals with Big Tech that grants the rights to any IP to the non-Canadian funders of the research programs universities must offer to lure the best students.In their book, Capitalism Without Capital, Jonathan Haskel and Stian Westlake argue that an economy that wants to excel in the intangible economy must be prepared to spend heavily on education. That will be a challenge. As a society, we’ve come to associate good governance with balanced budgets; the federal government and most of the provinces are running deficits, so there will be resistance to significant new spending. This problem is exacerbated by Canada’s lack of an endowment culture; Cody said she donated $15 million to Concordia’s department of computer science and engineering earlier this year partly to spur more wealthy graduates to do the same.  “We need an educated population,” she said. The kind of company that a serious commitment to ideas creates looks like Toronto-based Scientus Pharma, which is close to securing a patent on a new process for extracting the active ingredients from cannabis. The company’s founders benefited from spending time at the MaRS Discovery District, an incubator for technology upstarts. The early research benefited from government grants. The company now employs about 30 people and has a new production facility in Whitby, Ont. Har Grover, the chief executive, said in an interview that the company’s success will be depend on the extent to which its patented extraction process becomes the industry standard. (Scientus says its method ensures a consistent level of active ingredient in capsules and oils, a problem the cannabis industry hasn’t yet solved.) That will require taking advantage of the lead Canada achieved by legalizing recreational pot, and lobbying governments to apply the same standards to the marijuana industry that they demand of medicine and food. “Canadian companies need to be aggressive about maintaining leadership,” Grover said. Aggressiveness isn’t a trait for which this country is known, at least away from the hockey rink. We will need to be, because companies such as Scientus Pharma will be going up against international behemoths that long ago figured out that their most valuable assets were their ideas, and that the best way to protect that wealth was to set the rules by which everyone would play. Canada might have gained more access to the North American market for Canadian margarine, but the U.S. successfully extended patent protection for its pharmaceutical industry.  “It is hard to compete with giants,” said Cody. “That’s an obstacle.”Financial Post• Email: kcarmichael@nationalpost.com | Twitter: carmichaelkevin"}