{"id": "Apple revamps MacBook Air for first time since Steve Jobs introduced it 8 years agoPersonal TechTop Stories", "paragraph": "October 30, 201812:38 PM EDTApple Inc. overhauled two of its oldest Macs after sales of the company’s personal computers fell to the lowest point since 2010 last quarter.On Tuesday in Brooklyn, New York, the technology giant debuted a new MacBook Air with a sharper screen and redesigned the Mac mini desktop with a focus on professional users.The revamp of the some of the most popular products in the Mac line comes on the heels of new devices from Alphabet Inc.’s Google and Microsoft Corp. Apple also launched new iPads on Tuesday, showing the company continues to spread its bets with gadgets beyond the key iPhone line.The MacBook Air was refreshed with faster processors last year. But it hasn’t been fully overhauled since the current design was introduced by co-founder Steve Jobs in 2010. It was originally launched a decade ago, a year after the original iPhone.The new MacBook Air includes the same 13-inch screen size as the previous model, but it is a higher-resolution Retina display, a feature that fans of the laptop have been requesting for years. It also includes thinner sides around the screen, shrinking the device’s overall footprint. It has faster Intel Corp. processors, a Touch ID fingerprint scanner for logging, a larger trackpad, and better speakers.The new MacBook Air is 10 percent thinner than the previous model and is a quarter-pound lighter. It has the same 12 hour battery life as the previous model. The Air’s aluminum casing is made from 100 percent recycled aluminum, Apple said.It will cost US$1,199 and go on sale today, Cupertino, California-based Apple said. In Canada, the MacBook Air starts at $1,499.Apple also introduced a new Mac mini, its traditionally low-cost desktop computer that comes without a screen, keyboard, or mouse. Originally introduced in 2005, the Mac mini has been a popular device for server storage environments and home media centres. In recent years, the computer hasn’t seen any notable updates and was last equipped with faster processors in October of 2014. Like the MacBook Air, it got a major overhaul in 2010.The new Mac mini is geared toward professional users and costs US$799, up from US$499 of the previous model. In Canada, it costs $999. It includes faster processors, making it five times faster than the previous model. All Mac minis now use faster flash storage as well with capacities up to 2 terabytes, Apple said. It also goes on sale today, Apple said.Bloomberg.com"}