{"id": "Bank of Montreal eyes 1 million new customers as competition intensifiesFP StreetTop Stories", "paragraph": "October 24, 20185:13 PM EDTThe Bank of Montreal said Wednesday that it is looking to add one million new customers to its personal banking business over five years, joining its rivals in setting big client-acquisition targets in an already competitive Canadian market.  “We’re confident in the number for one reason primarily, and that is our primary customer growth over the last couple of years has been double digit,” said Cam Fowler, president of North American personal and business banking for BMO, during the lender’s investor day in Toronto. “We are here to grow this business.”To add to the more than seven million customers it already has in its personal business, BMO said it would boost its sales force, particularly its number of financial planners and mortgage specialists, as well as put its data and digital capabilities to work. The bank will be increasing its spending on marketing over the next five years as well.BMO’s new goal also comes in the wake of similar targets set by its Canadian competitors. Royal Bank of Canada said at its investor day in June that it was targeting more than 2.5 million new Canadian banking clients by 2023, while Bank of Nova Scotia said in February it was aiming for one million new primary banking customers in both its Canadian and international banking units.The banks are setting these targets at a time when the Canadian market has some favourable tailwinds behind it for the lending business. The Canadian economy continues to grow, and the Bank of Canada has been hiking its policy rate, with the latest increase announced on Wednesday.Speaking with reporters, Fowler said that the one-million-customer target was a “realistic” goal given the number of people looking to switch banks, as well as the number of new adults and new Canadians entering the market. Fowler also highlighted BMO’s business in China, which can give the bank an introduction to potential customers who are coming to Canada.“There are a couple million customers that are in play in Canada every year,” he said. “It’s just us saying we’d like a little more of that share than we’ve been taking in the past.”Even with the favourable outlook on the home front, the banks are looking to diversify, and BMO is no exception.The bank projected Wednesday that, over five years, one-third of its earnings could flow from the U.S. As of the end of its third quarter, in which BMO reported approximately $1.56 billion in adjusted net income, the bank’s U.S. business had made up 28 per cent of its adjusted earnings for the year to date, up from 24 per cent for the previous fiscal year.CEO Darryl White told the investor day attendees that the lender would generate this U.S. growth “organically, through the initiatives that we’ve got in place.”“It’s not just because the environment is good,” White said. “But it’s also because we believe that we can compete with anybody in the market. And we’re taking share, and we’re beating the market in the businesses where we’re choosing to compete in the United States.” Major domestic lenders that have expanded into the U.S. have been enjoying the perks of a growing economy and corporate tax cuts. Having a presence in the U.S. is also helping the banks to serve customers who want to conduct cross-border business. According to White, a survey of his bank’s wholesale customers found that 70 per cent were either currently or intending to conduct transactions on both sides of the U.S. border. On the capital markets side of BMO’s operations, White said that the quarterly U.S.-based investment banking revenues have been outstripping those of the bank in Canada, “more often than not,” over the past few years.“It’s a balance that we like,” White said. “And it’s a balance that’s reflective of the unique approach that I’m talking about.”• Email: gzochodne@nationalpost.com | Twitter: GeoffZochodneWe want to improve your reading experienceCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}