{"id": "When markets tumble, investors need to remember the long gameInvesting ProTop Stories", "paragraph": "November 15, 20184:47 PM EST“Life is getting better — and at an accelerating rate…. Though the world is far from perfect, necessities and luxuries alike are getting cheaper; population growth is slowing; Africa is following Asia out of poverty; the Internet, the mobile phone, and container shipping are enriching people’s lives as never before. The pessimists who dominate public discourse insist that we will soon reach a turning point and things will start to get worse. But they have been saying this for two hundred years.” — Matt Ridley, The Rational Optimist, HarperCollins Publishers, 2010.As I write, the U.S. stock market (S&P500) has declined about eight per cent from its highs at the beginning of October. Investors, generally being the short-term animals that they are, are now showing definite signs of concern that the end of this extraordinarily long bull market is coming to a theatre near you.They may be right: Even after the recent plummet in stock prices, the Shiller PE Ratio is still trading at approximately the same level as at the market tops back in 1929, preceding the Great Crash. Interest rates appear to have bottomed after spending the past decade at some of the lowest levels ever. Higher rates naturally mean future earnings and cash flows are valued at lower levels today. Many investors have become shorter in terms of their investment horizon. Daily fluctuations in stock and bond prices have been and remain their focus.As the famous late economist Herbert Stein said, “If something cannot go on forever, it will stop.”Well, history has shown Stein to be correct in this statement, especially when it comes to stock markets climbing ever higher. At some point, they stop going up and, surprise, surprise, they can actually go nowhere for long periods or, worse still, will go down. For example, the Dow Jones Industrial Average started the beginning of the previous century at 68. On Aug. 24, 1921, it was at 64. Almost 21 years with no return. From the top of the market in 1929 until June 1949, another 20-year stretch, the market declined more than 57 per cent. The period 1966 until 1982, 16 years, the market declined 22 per cent. And let’s not forget the most recent debacle, which some of you still remember, 2000 to 2009, during which the market dropped more than 42 per cent.Yet, during each of these periods, the American economy grew even though owning stocks was neither fun nor profitable. Two examples: From 1900 to 1921, U.S. GDP grew at a compound annual rate of 6.1 per cent. From 2000 to 2009, it grew at 4.5 per cent.Perhaps it’s at exactly a time like this that investors need to think more in terms of a longer horizon. And when you do that, it becomes evident that the human condition has never been better.My grandfather was born in 1880. I was fortunate to have known him until he died at 90 years of age in 1970. When you look at the world he was born into, it looks nothing like it does today. Transportation was mainly by horse, trains and ships/boats. No cars, no airplanes. He was born 23 years before the Wright Brothers made the first powered flight. He also was unfortunate enough to be born in Russia and lived through the Russian Revolution. Starvation, pogroms, political and economic chaos was his world. Survival of he and his family was at the top of the list.Health care? In 1900, the leading causes of death in the U.S. were pneumonia, tuberculosis (TB) and diarrhea/enteritis. In fact, life expectancy between 1871-1880 was only about 40 years.From that time on, conditions improved immensely. The 20th century saw massive public health improvements and the average life expectancy for Americans today has nearly doubled since 1880, reaching 78.7 years.It’s nearly impossible to keep up with daily advances in technology, medicine and scienceWe humans seem to love focusing on the risks. The front pages and the internet emphasize the negative. The list of disasters and bad news is overwhelming: nuclear proliferation, climate change, overpopulation, the spread of terrorism. People, in an almost masochistic way, seem to enjoy reading this stuff (as long as it doesn’t involve them).However, even in the past 50 years, the number of technological developments has been staggering. As for the future, the possibilities are unending in terms discoveries and inventions. In fact, it’s nearly impossible to keep up with daily advances in technology, medicine and science.So, what does this mean for investors? Well, if they can stop watching the daily “scoreboard” of violently fluctuating stock prices and invest in companies that have an excellent chance of being worth much more over the coming years, I believe they and the world as a whole will experience a future filled with incredible advances my grandfather couldn’t even have dreamed of.What it requires is fortitude to weather the current turbulence and take advantage of lower prices to buy terrific businesses that have a high probability of increasing in value over time. Companies that will participate in the advances described above and enrich those endowed with the right temperament, as Warren Buffett describes it, to enjoy the long-term capital appreciation that, I believe, time will deliver.Larry Sarbit is the CEO and CIO at Winnipeg-based Sarbit Advisory Services. Sarbit is the sub-advisor on three funds for IA Clarington."}