{"id": "Stocks tumble as sentiment suddenly soursInvestingTop Stories", "paragraph": "October 18, 20184:20 PM EDTA risk-off tone gripped global financial markets, with U.S. stocks sliding while Treasuries climbed with the yen on demand for havens.American equities fell the most since last week’s rout as investors fretted over the U.S.-China trade war’s impact on economic growth, the Italian debt crisis and rising interest rates. High-flying technology shares again led the sell-off, while defensive sectors like utilities and real estate fared better. Mixed earnings, with disappointments from key industrial and tech names, added to investor anxiety.The S&P 500 slid back toward its 200-day moving average, the Dow Jones Industrial Average shed more than 300 points and the Nasdaq 100’s rout topped 2 per cent.The weakness comes after China sank overnight, bringing losses in its major benchmark to 30 per cent since January highs. The dollar touched the highest in more than a week, while the 10-year Treasury yield fell to 3.17 percent. Italy’s yield spread over Germany’s hit the highest level since 2013 as European Union officials questioned the country’s budget plan.“Like every other spurt of volatility, it’s hard to give an exact reason, but we have all the usual culprits: concern about global trade, earnings season and companies potentially staring down the barrel of another tariff maybe over the winter,” said Kevin Caron, a senior portfolio manager at Washington Crossing Advisors. “It’s a hodgepodge. You have all these things that come together at the same time.”Earnings remain in focus though the depth of the sell-off overshadowed most major reports. Weak results from Germany’s SAP and Taiwan Semiconductor dragged American tech indexes lower. Earnings misses from several U.S. industrial firms and a Bank of America downgrade of the housing sector fueled worries that higher interest rates and the trade war are hitting profits. Philip Morris surged on strong demand, buoying consumer shares.Here are some key events for the rest of this week:Third-quarter GDP for China comes Friday in addition to last month’s retail sales and factory output.These are the main moves in markets:StocksThe S&P 500 Index declined 1.4 per cent as of 4 p.m. New York time, the most since Oct. 11. The Nasdaq Composite fell 2.1 per cent, while the Nasdaq 100 dropped 2.2 per cent, both the most since Oct. 10. The Dow Jones Industrial Average slid 324 points to 25,382.50. The Stoxx Europe 600 Index fell 0.5 per cent. The MSCI Emerging Market Index sank 1.4 per cent. The MSCI Asia Pacific Index declined 0.7 per cent.CurrenciesThe Bloomberg Dollar Spot Index rose 0.4 per cent, hitting the highest since Oct. 9. The euro fell 0.4 per cent to US$1.1456. The British pound fell 0.7 per cent to US$1.3020. The Japanese yen increased 0.4 per cent to 112.17 per dollar.BondsThe yield on 10-year Treasuries fell three basis points to 3.17 per cent. Germany’s 10-year yield fell five basis points to 0.42 per cent.Britain’s 10-year yield fell four basis points to 1.54 per cent.CommoditiesWest Texas Intermediate crude decreased 1.5 per cent to US$68.71 a barrel. Gold rose 0.1 per cent to US$1,228.00 an ounce.–With assistance from Yakob Peterseil.Bloomberg.comThis content was provided by Market One for commercial purposes."}