{"id": "Canada falling behind in the knowledge economy due to ‘outdated thinking’: BalsillieTop Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.November 16, 20187:27 PM ESTCanadian governments need to radically rethink their approach to the knowledge economy if the country is to be anything more than a branch plant for global technology giants, former BlackBerry Ltd. co-CEO Jim Balsillie told a breakfast gathering in Toronto Friday.“I think they confuse a cheap jobs strategy … (and) foreign branch plant pennies with innovation billions,” Balsillie said. “I think it’s just outdated thinking, people without the expertise making decisions.”Balsillie made the comments in conversation with Financial Post columnist Kevin Carmichael as part of the launch of the Post’s Innovation Nation project.Balsillie has argued that the “intangible” economy of data, software and intellectual property is fundamentally different from the classical industrial economy built on the trade of goods and services, and that because Canadian policymakers fail to understand that difference, they keep being taken for rubes.On Friday, Balsillie was particularly critical of the federal government’s policy when it comes to “branch plant” investments in Canada in the technology sector.He said that in the traditional economy of goods and services, foreign direct investment (FDI) is a good thing, because there’s a multiplier effect — $100 million for a new manufacturing plant or an oil upgrader might create $300 million in spinoff economic activity.But if you’re just hiring programmers to write software, the picture is different, he said. It’s a much smaller number of jobs with fewer economic benefits, and, more importantly, the value created through intellectual property flows out of the country.“Our FDI approaches have been the same for the intangibles, where, when you bring these companies in, they put a half a dozen people in a lab, they poach the best talent and they poach the IP, and then you lose all the wealth effects,” Balsillie said.“Don’t get me wrong. I believe in open economies. They’re going to come here anyway; I just don’t know why we give them the best talent, give them our IP, give them tax credits for the research, give them the red carpet for government relations, don’t allow them to pay taxes, and then have all the wealth flow out of the country.”When Carmichael asked about the recent push for tax cuts in Canada to match those enacted by U.S. President Donald Trump, Balsillie suggested that the bigger story is how the U.S. is entrenching its advantage on digital trade.“We had lower taxes than the U.S. for 15 years, and our productivity went down, tick, tick, tick, for 15 years,” he said. “Now, what the U.S. has said is that you’ve got a one-time holiday to repatriate all your cash, but from now on all your IP gets taxed in the U.S. so they’re accruing the economic benefits and state power that comes with building those intangible assets.”I think they confuse a cheap jobs strategy … (and) foreign branch plant pennies with innovation billionsWhile Balsillie said that for years Ottawa didn’t listen as he sounded the alarm on intellectual property issues, he said he is now getting feedback from politicians that suggests the message is starting to get through.During Friday’s conversation, Balsillie also stressed that, if small countries such as Canada make a point of prioritizing the intangible economy, there are huge opportunities. He pointed to Israel, Finland and Singapore as examples of how smart policies and specialization can reap big rewards.“I could literally see enormously powerful positions for Canada if we choose the right places. I mean, there are some obvious ones: value added in the food business, and precision data and IP in agriculture; certainly in energy extraction and mining, which are data and technology businesses,” he said.“We actually have enormous opportunities to build the resilience and opportunity,” he said. ”And how can you threaten a country with a picture of a Chevy and 25 per cent tariffs when you’ve built these kinds of very powerful innovation infrastructures that you can’t stop with a tariff because they move with the click of a mouse?”"}