{"id": "What investors in the U.K. are talking about, when they aren't talking about BrexitInvesting ProTop Stories", "paragraph": "November 16, 20181:42 PM ESTI’ve been working from London this fall. The idea is to get new perspectives and experience another way of life. That means black cabs on the wrong side of the road. Pubs on every corner. Football, not football. And hopefully, different views on markets and investing.My notebook is filling up from investment conferences and meetings with asset managers. Below are some items that I’ve highlighted.One-way streetAttending investment events, it’s struck me that few of the analysts and portfolio managers around me have ever experienced a sustained period of rising interest rates. Rates peaked in 1981, which means even grizzled veterans like me have only seen yields decline (I started in 1983). Those who started in the last 10 years only know low single-digit rates.This trend has meant decades of good bond returns and a constant tailwind for interest-rate sensitive securities, including stocks in the financial, utility and real estate sectors. But rates have been rising for two years now, which suggests a new paradigm.Pricing anomaliesThe U.S. stock market has looked relatively expensive for some time, but the value-oriented managers I’ve met have a different view. Anne Gudefin, CEO of London-based Velanne Asset Management (manager of our Global Equity Fund), points out that the S&P 500’s high valuation is misleading. It’s skewed by high price-to-earnings multiples on the well-loved growth stocks, including the FAANGs. Meanwhile, there are bargains to be had in the ignored or even hated sectors like healthcare, asset management, (non-Netflix) media and oil services.With the recent market weakness, there may also be bargains emerging in the consumer area, but the tone in London toward these sectors has changed. In previous visits, I was barraged with managers touting the power of global brands. Their thesis was that the big consumer companies were unstoppable and worth paying a premium for.It now appears the bloom is off the rose. Analysts are questioning that view in face of changing distribution channels (on-line), influencers (social media) and a growing number of craft and local offerings. They’re asking how the mega brands will adapt.Strong get strongerIn one presentation, an analyst pointed out that recessions shift the power from weak hands to strong hands. He was referring to the fact that profitable companies with strong balance sheets can use tougher times to consolidate the industry and improve their competitive position.Fortunately, or unfortunately depending on your perspective, he also noted that the mighty weren’t fully rewarded during the 2008 financial crisis. The capital market declines were sharp but short, so marginal players were able to survive with the help of central bankers (low interest rates) and governments. We’ll have to wait until the next slowdown to fully test the analyst’s theory.A big, growing worldWhen emerging markets managers talk about the opportunities in Asia, it provides much needed perspective. While we focus on pipelines, U.S. and Ontario politics, and Brexit, a big chunk of the world is in growth mode.Consumption in China, India and the rest of Asia is in a strong, upward trend. The expanding middle class is moving from buying basics to spending on discretionary items (vehicles, travel, experiences). The use of technology is ahead of the western world in many areas due to a lack of legacy systems. Government policies are becoming more business friendly in large countries like India and Japan. And trade within Asia now is almost double that of North America and Europe combined.When economists and commentators agonize over whether China is growing at 6.5 or 6.7 per cent, I can’t help but think they’re missing the forest for the trees.Emerging opportunitiesAnd finally, I’m hearing that the areas in the stock market with the most opportunity are in those forests. One manager described valuations in Asia as being at “distress levels.” A number of managers told me their emerging market portfolios, which include South America and parts of Europe, are as cheap as they’ve ever been. Uncertainty around trade has severely hit both the stocks and currencies in the developing world.Hmmm, it’s becoming clear where my wife and I should camp out next.Tom Bradley is President of Steadyhand Investment Funds, a company that offers individual investors low-fee investment funds and clear-cut advice. He can be reached at tbradley@steadyhand.com"}