{"id": "Facebook morale, hurt by dropping shares, suffers another hit after yet another corporate scandalPersonal TechTop Stories", "paragraph": "November 16, 20184:12 PM ESTOn Thursday, Facebook Inc. employees returned to work in the aftermath of yet another corporate scandal.The night before, the New York Times had reported that Sheryl Sandberg, Facebook’s chief operating officer, worked behind the scenes to prevent the company’s board and the public from understanding the full extent of Russia’s misinformation campaign on the social network.The employees were used to the public microscope. But this time was different, employees said: The story brought readers into boardrooms and the halls of Congress where their top executives were making questionable decisions. At lunch, workers shuffled through the staff cafeterias at the company’s Menlo Park, California headquarters in quiet contemplation — more quiet than usual. But their phones were lighting up.Most discussion at Facebook happens on the company’s workplace version of the social network, in various company groups. But when the news is about Facebook’s leadership, some employees have found it easier to talk when they’re unnamed. They used Blind, the anonymous employee chat app, to raise their concerns, according to screenshots obtained by Bloomberg. On Thursday, the conversations were full of outrage. How could Sandberg — and chief executive officer Mark Zuckerberg — have failed to see the threat to the company? And how could they have managed all of this so poorly?“Why does our company suck at having a moral compass?” one employee asked, in a message linked to the New York Times story.“Zuckerberg defers too much to others on issues where he needs to make a call,” another said, also anonymously, in the same thread.“I’m f-ing exhausted of cleaning up after the sloppy and careless mistakes that made so many of the people responsible for them so, so rich,” said a third.Getting rich has been a sore subject inside Facebook recently, especially for those, like the third poster, who joined long after the 2012 initial public offering. The company’s stock has been on the decline, ever since Facebook reported in July that it expected growth to slow in future years. Thursday marked a regularly scheduled vesting event for employee stock, according to people familiar with the matter. But it’s worth 34 per cent less than at its peak in July of this year.Why does our company suck at having a moral compass?There’s frustration, according to some employees, that the things the company has to do to fix its public perception issues — like add people to review harmful content and limit data collection — are going to further depress growth, and therefore the stock price. In an October employee survey, 52 per cent said they were optimistic about Facebook’s future, down from 84 per cent the year before, according to numbers first unearthed in a Wall Street Journal report this week. Zuckerberg has told employees at internal meetings that they’re doing the right thing for the long term.“It has been a difficult period, but every day we see people pulling together to learn the lessons of the past year and build a stronger company,” Facebook said in a statement. “Everyone at Facebook has a stake in our future and we are heads down shipping great products and protecting the people who use them.”The Times story suggested Sandberg and Zuckerberg weren’t as involved with the serious issues facing the company as they should have been and instead were more concerned about continuing to defend Facebook’s reputation. Sandberg, particularly, was working to prevent the board and the public from knowing too much about the Russia campaign, and then leading an aggressive lobbying effort to fend off critics. Zuckerberg answered questions about his decision-making on a call with the media Thursday.“To suggest that we weren’t interested in knowing the truth, or that we were trying to hide what we knew, or that we tried to prevent investigations is simply untrue,” Zuckerberg said.The article focused more squarely on Sandberg, and how angry she was that then-chief of security, Alex Stamos, investigated Russia’s campaign without approval. Sandberg didn’t appear on the call, though Zuckerberg defended her leadership. “Sheryl is doing great work for the company. She’s been a very important partner to me and continues to be, and will continue to be,” he said. Sandberg later said the idea that she personally stood in the way of disclosures on Russia was “just plain wrong.”Stamos, who left the company earlier this year, said on Twitter that “there were a lot of heated discussions about what to publish and when,” but that the failure to understand the Russia threat was unrelated to his “getting chewed out in a meeting.”After deciding to disclose the Russia campaign and submit to Congressional questioning, Sandberg worked to improve relationships behind the scenes with lawmakers. The company hired a Republican firm, Definers Public Affairs, which worked to discredit critics. At one point, it drew links between critics of the company and billionaire financier George Soros, who has been a target of anti-Semitic attacks. Zuckerberg said he and Sandberg were unaware of the messaging linking critics with Soros, and cut ties with the firm.Despite the controversy, some employees on Blind defended the tactics.“I think the reality of running a global corporation as large as FB is that you have to dirty yourself in the trenches,” one person said. “These all seem like pragmatic albeit ruthless and morally sketchy business decisions.”“Honestly, I respect Sheryl a lot more after reading this,” another said.Bloomberg.com"}