{"id": "'I didn't sleep well last night': Bitcoin's slide just the beginning as analysts brace for a 70% dropBlockchainTop Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.November 16, 20183:04 PM ESTBitcoin’s no longer boring.After months of tranquility that became the envy of equity investors, The biggest cryptocurrency roared back into the public consciousness this week with the biggest sell-off since August, another fork and a cameo in a major semiconductor earnings report. Some digital asset industry pundits have already begun referring to it as the crypto winter.Bloomberg Intelligence says the drama’s just starting. Analysts predict the price could fall to US$1,500, which would indicate another drop of more than 70 per cent from current levels. The digital token tumbled 12 per cent on Wednesday alone to its lowest level in over a year, and has lost more than 60 per cent of its value so far this year. Many of Bitcoin’s closest peers, including XRP, the cryptocurrency also known as Ripple, fell in tandem.“I didn’t sleep well last night,” Travis Kling, founder of the hedge fund Ikigai, said on Thursday as he tracked the Bitcoin Cash split. “There’s a small chance that, it’s difficult to estimate, that something really bad could happen related to Bitcoin Cash that could then impact the entire crypto market.”Some investors believe that two versions of Bitcoin Cash, which had broken off the original Bitcoin in 2017, could be sucking investment and miners away from the largest cryptocurrency.That rang true to Mike McGlone, the Bloomberg Intelligence analyst who warned that the slide could get much worse.The slump “was sparked by the pump for the Bitcoin Cash hard fork,” said McGlone. “That pump that began a few weeks ago, got the market a bit too offsides with speculative longs playing for the good-old days. But this is an enduring bear market.”The bad news didn’t stop there. Chipmakers were also hammered Friday as Nvidia Corp. issued weak sales forecasts for the current quarter, saying that it saw lingering loss of demand from the collapse of cryptocurrency mining. The mining of digital tokens, computer code that carries value in online transactions, had helped stoke demand for the company’s graphics chips. Shortages related to a spike in demand from miners led to an oversupply of parts when the crypto market crashed.“The drop in the stock price of Nvidia is reflective of a future where cryptocurrency fuelled demand has cratered,” said Peter Mallouk, president and co-chief investment officer of Creative Planning, in an email. “While this is, of course, bad news for Nvidia, it is really the canary in the coal mine for Bitcoin and other cryptocurrencies.”Nelson Saiers, a former hedge fund manager turned artist, is hoping the renewed focus will help raise the profile of his work — he’s installing inflatable Bitcoin rats in London and Washington to showcase the token’s influence on society.“They exist without permission. They are hated, hunted and persecuted,” he said about rats, which serve as a proxy for Bitcoin in his art. “And yet they are capable of bringing entire civilizations to their knees.”Or maybe just those who bet big on cryptocurrencies.Bloomberg.com"}