{"id": "Carr, Morneau plan China visit to build business ties, but no free trade yetNewsTop Stories", "paragraph": "October 18, 20183:51 PM EDTOTTAWA — Two senior Liberal cabinet ministers are off to Beijing next month to co-chair a high-level business conference and to push Canada’s trade interests with China.International Trade Minister Jim Carr says he and Finance Minister Bill Morneau will be in the Chinese capital for two days starting on Nov. 11 to advance Canada’s trading interests.Carr is also reiterating that nothing in the recently negotiated United States-Mexico-Canada Agreement prevents Canada from doing just that.Carr was asked during testimony before the Senate trade committee about a controversial clause in the new USMCA.It allows any of the countries to withdraw from the deal on six-months’ notice if one of the partners starts free trade negotiations with a non-market economy — widely assumed to be China — to which they object.Carr says Canada and China aren’t embarking on formal free trade talks so, for now, it has nothing to tell its North American partners.“We will look to deepening and broadening our trading relationships with China, sector by sector. If at some stage of the game we enter into a conversation about a full free-trade agreement, we will inform our North American partners as we are obliged to do,” said Carr.“But it does not constrain us in continuing to deepen our ties with China, or any other nation in the world.”Carr says the clause is “reciprocal” and applies to the U.S. and Mexico as well. If Canada does enter into free-trade talks with China, it will duly inform the North American partners, he added.“And if our partners don’t like it, they have the capacity to bolt from the agreement, just as they do now.”Carr noted the current North American Free Trade Agreement as well as the newly negotiated USMCA have a broad termination clause that allows any party to leave the agreement, for any reason, by giving six months’ notice.The Chinese embassy in Ottawa has blasted inclusion of the new clause, saying it targets China’s potential trading partners and unfairly brands it as a non-market economy.Trade experts and analysts support the careful approach Carr is advocating because it gives Canada room to talk to China, without overtly angering the U.S.The U.S. is embroiled in a trade war with China that has seen the imposition of hundreds of billions dollars of tariffs by the Trump administration on Chinese goods and retaliation by Beijing.We want to improve your reading experience"}