{"id": "Therapy records are an explosive issue in custody battlesPersonal FinanceTop Stories", "paragraph": "October 30, 201812:21 PM EDTFor some years, the courts in Canada have been grappling with the many litigants appearing before them who have mental health issues. It is now quite common for judges to take training to help them deal with such litigants, who also often appear in court without a lawyer.If asked, judges and lawyers both would usually agree that high-conflict family law cases often involve spouses with addiction or mental health issues. In these cases, and especially when custody and access issues are involved, judges may have to decide whether a spouse’s private medical or therapeutic counselling records will be produced to the other spouse.Earlier this year, such issues were raised in a case in which the mother of a two-and-a-half-year-old girl asked Justice M.D. Faieta to order copies of all of the father’s medical records from his doctor, psychiatrist, and “any other medical, psychiatric or health professional and any hospital and addiction treatment facility regarding his mental health and/or alcohol dependency” from the year of their child’s birth to date. The mother also asked for a “decoded OHIP summary” which would set out all of the treatment the father had during the period in issue.In the case, the mother alleged that the father had serious mental health and substance abuse issues, had serious anger management issues, that he had been admitted to hospital because of an overdose, and that he regularly engaged in binge drinking for extended periods.The father did not deny that he had been alcohol dependent, indicated he had been in regular treatment for 20 years, had been seeing his psychiatrist regularly since 2011 and denied that his issues affected his ability to parent their daughter.The father had already agreed to provide relevant medical records to the Office of the Children’s Lawyer, which confirmed with the father that they would do their best only to obtain the records that were directly relevant and necessary to assess the medical concerns raised by the mother.In support of his position, the father also provided a letter from his psychiatrist which stated that the father’s depressive disorder and alcohol dependence disorder were stable, that he was abstaining from alcohol and that he had complied with all treatment recommendations. The psychiatrist indicated that there were no concerns on his part with respect to the child’s safety in the father’s care.The father also relied on the fact that he had been continuing to care for his young daughter for about the past year.The father’s psychiatrist expressed concern about the production of the father’s psychotherapy records, saying, “The effectiveness of psychotherapy rests on a multitude of factors, and one important factor is the expectation of confidentiality of the therapy sessions. In order for patients to feel comfortable exploring difficult affects (sic) that impact their functioning, it is imperative that they know that what they expose in session will be kept confidential (within the limits of confidentiality with respect to safety of self and others). When there is a threat that one’s private therapy sessions can be exposed to third parties, the effectiveness of the treatment will be compromised.”In deciding whether the father’s records should be produced, Justice Faieta had to determine if the records were relevant, and if so, whether they were protected by privilege.The father’s emails, introduced as evidence, included messages such as “youre a complete selfish asshole to (our daughter) last night and put your self furst seberal times while I took care of her like I always do” and “Then give me half the money YOU F****ING THIEF I SWESR YO GOD IM GOING TO SUE YO FOR EVERY CENT….” (spelling as in the original text). Justice Faieta concluded that the father did indeed have the anger management issues alleged by the mother.As to whether privilege protected the psychotherapy records, Justice Faieta applied the Supreme Court of Canada’s test in M. (A.) v. Ryan.A document is privileged if the communication originated in confidence, the confidence is essential to the relationship in which the communication arises, the relationship is one which should be ‘sedulously fostered’ in the public good, and the interests served in protecting the communications from disclosure outweigh the interest in getting at the truth and disposing correctly of the litigation.Justice Faieta decided that the father’s records satisfied the first three portions of the test set out in Ryan. As well, the judge held that as the father’s psychiatrist had proffered evidence and the father had allowed the Children’s Lawyer access to his records meant that the father supported the release of information regarding his mental health and addiction issues in order to better determine the custody and access issues.However, His Honour limited the release to “only records relating to the (father’s) mental health and alcohol dependency issues and … any medical records referenced (in the Children’s Lawyer’s report).”He also directed the mother and her lawyer not to share or communicate the information with any other person other than for the purpose of the litigation regarding the parties’ daughter.In refusing the request to produce the decoded OHIP summary, however, Justice Faieta referred to this part of the mother’s request as a “fishing expedition.”The decision in the case places many family law litigants in an unenviable position. Appropriate treatment for mental health issues is both necessary and important for spouses to appropriately parent their children.For those spouses receiving treatment, it is also reasonable for the responding spouse to request his or her treating health professional to provide some evidence of the diagnosis, the treatment and a status report.To then have the treatment records made public because that spouse provided evidence of his professional treatment, may well result in a chilling effect for those who need treatment.Unfortunately, of course, the father in this case was also his own worst enemy.He, like thousands of other warring parents, provided the best evidence he could to the mother about his inability to control his own anger, by repeatedly emailing and texting the wife vile messages.At the end of the day, it seems likely Justice Faieta got this one right.Laurie H. Pawlitza is a senior partner in the family law group at Torkin Manes LLP in Toronto.lpawlitza@torkinmanes.com Calculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}