{"id": "Former Valeant, Philidor executives get prison for fraud in secret kickback schemeFP StreetTop Stories", "paragraph": "October 30, 20182:11 PM EDTNEW YORK — A former executive at Valeant Pharmaceuticals International Inc and the former head of a start-up mail-order pharmacy were sentenced to one year in prison on Tuesday after being convicted of defrauding the drugmaker through a secret kickback scheme.Gary Tanner, 41, the former Valeant executive, and Andrew Davenport, 50, the former chief executive of Philidor Rx Services LLC, were also ordered to forfeit US$9.7 million, representing the alleged kickbacks.The sentences were imposed by U.S. District Judge Loretta Preska in Manhattan.Both defendants had been convicted in May on four charges, including honest services wire fraud and conspiracy to commit money laundering.Prosecutors had recommended prison terms of between 2-1/2 and 10 years for Tanner, and 2-1/2 and eight years for Davenport. The defendants said no prison time was justified.Lawyers for Tanner and Davenport did not immediately respond to requests for comment.The case was the first criminal prosecution arising from multiple probes into Valeant’s business practices, including its ties to the now-defunct Philidor.Those ties began drawing scrutiny in October 2015, when investors learned that Valeant had in 2014 acquired an option to buy Philidor, and was suspected of using it to boost sales.The revelations contributed to a steep fall in Valeant’s share price that was compounded by the probes and the Laval, Quebec-based company’s heavy debt load.Management was overhauled, and Valeant changed its name to Bausch Health Cos in July, taken from the name of its Bausch & Lomb eye care unit.Tanner had managed Valeant’s relationship with Philidor as well as Valeant’s “alternative fulfillment” program, through which the drugmaker sought to increase prescriptions for its own drugs instead of generic substitutes.Prosecutors accused Tanner of steering Valeant business to Philidor, while concealing a US$9.7 million kickback from Davenport that came from the roughly US$50 million Davenport received when Valeant acquired the option to buy his company.“I deeply regret giving money to Gary Tanner,” Davenport told Preska.Prosecutors said that to keep the scheme secret, Tanner often used an email account with the name “Brian Wilson” to communicate with Davenport and sabotage potential business with rival pharmacies.“Tanner was entrusted to manage Valeant’s relationship with Davenport’s company,” U.S. Attorney Geoffrey Berman said in a statement. “Instead, they devised a scheme to pillage Valeant and share the proceeds.”The case is U.S. v Tanner et al, U.S. District Court, Southern District of New York, No. 17-cr-00061.© Thomson Reuters 2018We want to improve your reading experience"}