{"id": "Power Corp's Desmarais family extends fintech push with fresh cash poolFP StreetTop Stories", "paragraph": "October 30, 20182:40 PM EDTPower Corp. of Canada is ready to pour fresh cash into fintech startups to stay close to an industry that could put its own financial services business model at risk.Power Corp’s in-house venture fund Portag3 has raised $198 million (US$150 million) in its second round of funding, with about half coming from units of the Montreal-based holding company and half from outside investors including National Bank of Canada and Intact Financial Corp. Power Corp. entities previously spent $240 million on fintech companies.“What brings together all of the investors is that they view the financial services industry as being ripe for change and they want to be positioned to take advantage of that change,” said Portag3 co-Founder and Executive Chairman Paul Desmarais III, the son of Power Corp.’s co-chief executive officer Paul Desmarais Jr.Desmarais said the fintech companies Portag3 invests in are giving Power Corp. a window into the latest trends in tech and consumer adoption. In exchange, they benefit from the global company’s deep pockets and extensive network. Power Corp. has already deployed $165 million from its first funding round into Wealthsimple, a robo-adviser that targets millennial investors.Increased competition in the wealth-management industry and a decade of low interest rates have taken a toll on the shares of Power Corp., which controls some of Canada’s biggest insurance and mutual-fund businesses. While looking for large acquisitions to spur growth, it’s using its foray into fintech as a way to force its own companies, such as Great-West Lifeco Inc. and IGM Financial Inc., to improve their digital services.While a direct competitor to some of Power’s wealth-management companies, Wealthsimple tends to attract younger customers who distrust established players. Wealthsimple manages $3 billion in assets for more than 100,000 clients.As a controlling shareholder, Power supports Wealthsimple’s plans to go public in the future, according to Desmarais.“Our goal is to create a global category leader based in Canada, and I think we’re well on our way to doing that,” he said in an interview.Portag3’s strategy is to inject cash in early stages, help the start-ups grow and stay for the long term, according to Desmarais. The new fund will focus on Europe and North America and take higher stakes than the initial fund, Desmarais said.“I believe that in fintech you need a minimum of 10 years to see winners emerge,” he said. “We want to accompany companies through that cycle.”Fintech services haven’t fully bloomed in Canada, where only 18 per cent of people say they are regular users, well below the 33 per cent global average and China’s 69 per cent, according to a report by accounting firm EY. Canadian banks have taken a collaborative approach with startups to make their own operations more efficient and add features for customers who are increasingly using mobile devices and computers for routine banking.–With assistance from Doug Alexander.Bloomberg.comWe want to improve your reading experience"}