{"id": "Weaker than expected economic data not seen delaying Bank of Canada rate hikeEconomyTop Stories", "paragraph": "October 19, 20189:37 AM EDTOTTAWA — Although Canadian inflation and retail sales data came in weaker than expected on Friday, market operators predicted the Bank of Canada still would raise interest rates again next week to keep a booming economy in check.Statistics Canada said the annual inflation rate in September dipped to 2.2 per cent from 2.8 per cent as price pressures from gas and air travel eased. Analysts in a Reuters poll had forecast an annual rate of 2.7 per cent.September marked the eighth consecutive month that the overall inflation rate has exceeded the Bank of Canada’s 2.0 per cent target.The central bank, which predicts inflation should move back down toward 2 per cent by early 2019, will announce its next interest rate decision on Oct. 24 and markets are expecting a hike. The bank has lifted rates four times since July 2017.“We always knew we were going to see headline CPI inflation trend back down towards 2 per cent … the hike next week is going to happen,” said Andrew Kelvin, senior rates strategist at TD Securities.Market expectations of an interest rate hike in October, as reflected in the overnight index swaps market, dipped slightly to 96.95 per cent from 98.53 per cent before the release of the inflation data.“Beyond next week, we see two more hikes in the first half of 2019,” said Paul Ferley, assistant chief economist at the Royal Bank of Canada.Separately, Statscan said the value of Canadian retail trade unexpectedly fell by 0.1 per cent in August, the second decline in three months, in part due to lower sales of gas and clothing. Analysts in a Reuters poll had forecast a 0.3 per cent gain.The Canadian dollar quickly sank after the release, dropping to a five-week low of 76.29 U.S. cents, down from 76.65 U.S. cents.The central bank’s three core inflation measures all fell, for the first time since November 2016. CPI common, which the bank says is the best gauge of the economy’s underperformance, dipped to 1.9 per cent from 2.0 per cent in August.Statscan showed gasoline prices had increased by 12.0 per cent over September 2017, down from the 19.9 per cent year-over-year jump in August. The cost of air transportation fell by 16.6 per cent from a year earlier.© Thomson Reuters 2018We want to improve your reading experience"}