{"id": "Why investors are still cool on oil stocks despite blockbuster earningsInvestingTop Stories", "paragraph": "October 30, 20187:54 PM EDTThe largest Western oil companies are expected to announce the most significant profits they’ve seen in years on the back of higher crude prices, but wary investors are still keeping their distance, prolonging a slump in energy company shares.In the past year, the MSCI World Energy Index, which tracks the sector’s performance, has eased one per cent, despite a 22 per cent increase in the price of West Texas Intermediate benchmark crude, which closed Tuesday at US$66.18 per barrel.During the same time frame, Exxon Mobil Corp. saw its shares drop 5.6 per cent while Royal Dutch Shell’s shares have been essentially flat.Canadian producers have also failed to see share price gains, with Suncor Energy Inc.’s stock down slightly over the past year, and Canadian Natural Resources seeing an 18 per cent decline.Suncor will release its third-quarter earnings report on Wednesday. Canadian Natural Resources and Exxon will both report their earnings next week. These companies are all expecting the highest profits they’ve seen since before global oil prices crashed in 2014.For the Canadian companies, the explanation as to why those results aren’t being fully reflected in their stocks is simple.“One word: pipelines,” Veritas Investments Research Corporation analyst Jeffrey Craig said. “No matter how well you run an oil company, your profitability depends on how well you’re able to sell that oil close to benchmark prices.”Canadian oil is selling for a massive discount in comparison to the WTI benchmark and in the past year, prices fell by nearly 40 per cent to $25.04 per barrel. Canada produces a significant amount of low-quality crude but struggles to get it to market because of a lack of pipeline space to send it to the U.S. for refining.Downstream companies like BP plc are seeing profits swell. The Britain-based oil refining company posted a US$2.11 billion profit in its third-quarter earnings report and attributed much of it to the firesale prices of Canadian crude.Even with the discount, Craig said many Canadian oil companies are expecting strong third-quarter earnings.According to Barclays Bank, Suncor is expected to report $1.77 billion in upstream and downstream earnings in comparison to the $1.07 billion the company reported in the third quarter of 2017. Cenovus, meanwhile is expected to report $822 million in oilsands and downstream income, up from $597 million in 2017.Profits are expected to be even larger for the companies based outside Canada, such as Exxon and Shell, but investors are still wary of buying shares. Investors have seen these companies spend most of the money they make, Craig said, on projects that would involve drilling.“Some investors are expressing concern that companies are going to end up raising capital, but they’ve been pretty disciplined up to this point,” said Jason Gabelman, vice-president at Cowen and Company LLC.The lustre around the industry was buffed away. The markets view these as less attractive businessesGabelman said the expected profits are a result of both oil prices and refining margins being strong. Investors, however, are still skeptical on these companies in the market, he said, because the companies have struggled to translate higher earnings to higher cash flows. For now and into the near future, they’ll still need to spend money but do so more wisely, he said. Exxon seems to be one of the only outliers and will raise its capital expenditure to $35 billion from $25 billion.In Canada, Raymond James Investments analyst Chris Cox said there’s simply a lack of opportunities for companies to spend on projects like they did in the past. That may, in turn, result in them looking inward. Cox expects companies such as Suncor, Imperial Oil and Canadian Natural Resources to focus on generating free cash flow so that they can continue to pay down their debt and buy back shares.While this quarter’s results may surprise, all three analysts are projecting a painful fourth quarter for the energy sector because of heavier differentials making upstream producing in Canada more challenging. Fears about a continued selloff in global markets, and possible global slowdown, may lead to even more skittishness from investors, Cox said.“The lustre around the industry was buffed away,” Cox said. “The markets view these as less attractive businesses.”This content was provided by Market One for commercial purposes."}