{"id": "With $2.8 million in assets, biggest question surrounding this couple's retirement is when can it startFamily FinanceTop Stories", "paragraph": "November 2, 20189:37 AM EDTSituation: Couple with solid savings wants to know if they can retire at 60, or should stick it out to 65Solution: Perform a full financial analysis to assess both optionsA couple we’ll call Jack and Martha, both 53, live in southern Ontario. Jack runs his own consulting company, which specializes in product management. Martha is a health care professional working part time in her practice and part time for Jack’s company. They bring home $10,375 and add tax refunds to make disposable income $11,845 per month. Their worry is that if they retire at 60 they won’t be able to maintain their present way of life nor travel as much as they do now.“Will our plans work at 60 and 65?” Jack asks. “Would we have to sell our house to raise retirement cash?”(E-mail andrew.allentuck@gmail.com for a free Family Finance analysis.)Family Finance asked Derek Moran, head of Smarter Financial Planning Ltd. in Kelowna, B.C., to work with Jack and Martha. As he sees it, Jack and Martha have done most things right. Their house, estimated to be worth $1.4 million, is just about half their net worth, which is a high ratio but typical for upscale Ontario communities. They manage taxes by carefully apportioning income, for Martha puts in significant time working for Jack’s consulting business.The issue they face is, ironically, that they have structured their affairs so well that, while they can have the retirement income they want, they are in a sense paying too much to get it, Moran says.Cost managementThey pay an astonishing $14,640 per year for term insurance and long term disability coverage. Jack is a critical person in his company, but with the curtain coming down on the business when Jack and Martha shut the door, it would be a useful exercise to see if they need to spend so much, Moran suggests. They have sufficient net worth — about $2.8 million including the house and investments, so that they really no longer need so much coverage. There is no mortgage debt, indeed they have no liabilities. They are paying a lot to insure risks they don’t have. Moreover, their disability coverage, which only goes to 65, is meaningless if they close the business or retire soon.There are other costs that can be contained. Their non-insured medical costs of $6,000 per year for massages and optical products might be reduced with purchase of supplemental medical or health insurance that covers these expenses. They spend $2,040 per year on their pet, which is not out of line with veterinary costs these days. They might shop for a less costly or less elaborate program of pet care and benefit both their pet and their budget.There is room for tax management. Jack and Martha have $315,000 in taxable investment accounts. Jack is in an appreciably higher tax bracket than Martha. He could do a spousal loan to lend her his savings in taxable accounts and she could invest the money in her name. She would have to pay interest to Jack for the loan and document it in writing with a proper loan note. The result would be that in her tax bracket all dividends from Canadian companies would be tax free. Currently, Jack pays 30 per cent tax on those dividends. Over an extended period, tax savings would be quite significant, Moran notes.Retirement plansJack and Martha will be entirely on their own when they retire. There are no company pension plans or matching defined contribution retirement accounts. There will be no need to sell their house if they spend as they do now less savings and big insurance costs.Jack and Martha have $909,000 in their Registered Retirement Savings Plans. If they continue to add $2,700 per month and if the accounts grow at 3 per cent per year after 3 per cent inflation, they will become $1,366,000 in 2018 dollars in seven years when they are both 60. That capital could support payouts of $69,700 per year for 30 years to their age 90.The couple’s Tax-Free Savings accounts currently total $103,000. If they add $5,500 each per year and if the accounts grow at 3 per cent after inflation, they will rise to $170,100 in seven years. That capital could generate annuitized payouts for 30 years of $8,425 per year.The couple’s taxable accounts total $315,000. If there are no further contributions, then with 3 per cent growth after inflation, they will have a value of $387,410 in seven years. That sum will be able to support payments of $19,765 per year for the next 30 years.We are attaching no value to the sale of Jack’s business other than its cash subject to tax when paid out. With unknown termination costs, we are leaving it out of our estimates.Income estimateFrom their ages 60 to 65, they will have RRSP benefits of $69,700, TFSA untaxed payouts of $8,425 per year, and taxable investment benefits of $19,765 per year. The sum, $97,890 if split with no tax on TFSA payouts, would, with 15 per cent average tax on the remainder, provides $7,040 per month. With elimination of $4,800 savings and life insurance costs, one car lease and a few maintenance bills, their expenses would drop to $7,045 per month and thus be supportable.From their age 65 forward, their income would add two Old Age Security benefits of $7,210 each and expected CPP benefits totaling $20,415 per year. The couples’ total income before tax would be $132,725 per year. Without TFSA benefits of $8,425 per year, their income would be $122,707. If taxed at an average rate of 18 per cent, they would have $9,200 per month to spend. After 90, they would still have their house, government benefits and any additional savings.The plan to wait to age 65 to start CPP benefits is wise, for early application at 60 would cut $300 per month out of Jack’s benefits and $170 out of Martha’s CPP benefits. Waiting to 70 for CPP benefits would add 42 per cent to the benefits but require that they take money from other savings. The question of whether to take CPP early at 60 or late at 70 is partially a matter of how long one lives and what funds paid out of CPP or other accounts might earn as investments if not spent.“They will be more prosperous, comfortable and secure than they expected.”Retirement stars: 5 ***** out of 5Financial PostE-mail andrew.allentuck@gmail.com for a free Family Finance analysis.-2°CA few cloudsFeels like -4°CCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}