{"id": "Sure, excess regulation is holding Canada back, but who really has the will for change?EconomyTop Stories", "paragraph": "November 2, 20186:43 PM EDTLast UpdatedNovember 5, 20188:28 AM ESTThird in a three-part series on how Canada’s heavy regulatory burden is choking competitiveness.My first idea for a column on domestic protectionism and over-regulation was to detail all the ridiculous ways that Canada’s federation makes life impossible for executives. For example, an employer with a 10-province and three-territory strategy would have to order eight different first-aid kits to stay on the right side of various labour laws. There’s plenty more where that came from. Almost half of the 345-page Canadian Free Trade Agreement that was agreed to last year is devoted to exemptions.But that take would have been inaccurate. Life isn’t impossibleMake no mistake: the regulatory thicket between the provinces and territories is holding us back. A Senate Banking Committee report in 2016 said internal free trade would increase gross domestic product by as much as $130 billion, and by at least $50 billion. However, that is an “opportunity cost,” so it doesn’t show up in hard data, with the possible exception of Canada’s notoriously woeful productivity numbers.On the other hand, provincial finance ministers know exactly how much revenue they can expect from their various monopoly companies and regulatory fees. “The revenue aspect is an important factor,” Joseph Day, the New Brunswick senator who co-wrote the banking committee’s internal-trade report, said in an interview Friday.The result: inertia.Canada may have dropped to No. 22 on the World Bank’s annual Ease of Doing Business rankings in 2018, but that’s still higher than Germany (No. 23), and there is probably little risk of significant capital flight to the former Soviet republic of Georgia (No. 6) or Lithuania (No. 14).So executives cope. Fresenius Kabi, a German pharmaceutical company, waited six months as various approvers looked over the company’s new $11-million compounding facility in Mississauga, Ont. Still, Matthew Rotenberg, chief executive of the company’s Canadian unit, said he didn’t mind.“Mississauga walked us through it,” he said in an interview this week. “On balance, (the process) met our expectations.”Nor was Rotenberg bothered by having to satisfy the requirements of 10 provinces. The new plant was built in anticipation of demand from hospitals that would rather outsource their custom medicine preparations than upgrade to comply with new national standards.The provinces, of course, will adapt the federal mandate to their own circumstances and at varying speeds. I would find that frustrating, but for Fresenius Kabi, it’s just the way things are. “Everyone is looking ahead,” Rotenberg said of his various regulators.The unwillingness of executives to join the debate over regulation makes it hard to launch a proper campaign for change.The free-market think tanks behind the One Market, One Country campaign sponsored a conference in Ottawa on Oct. 31 to focus attention on the issue. The quality of the debate was excellent, but no actual job creators took part. Their absence meant the discussion lacked authenticity.The head of the British Columbia wine lobby cracked a good joke about how he would have liked to have brought some good bottles from the Okanagan Valley, but doing so would have risked jail time. The joke would have been even funnier if Canadian taxpayers weren’t currently on the hook for the defence of B.C.’s possible discrimination of U.S. wine imports at the World Trade Organization.The unwillingness of executives to join the debate over regulation makes it hard to launch a proper campaign for changeThe business lobbies talk a good game on internal-trade barriers, but they often are as conflicted as the politicians, because some of their members benefit from local barriers.To be sure, the leaders of the oilpatch have become extremely vocal about Canada’s inability to build pipelines, but they waited until the situation became extreme before speaking out. As we were reminded last summer when entrepreneurs freaked out over losing the right to sprinkle their incomes among family members, most executives only engage after they’ve lost something.That’s why a Bloomberg News interview this week with Paul Desmarais III stood out. The scion of the family behind Power Corp. said financial technology companies in Canada have to deal with too many regulators that are too stretched to deliver timely decisions. The risk is that dozens of companies with lots of potential never get off the ground.“A six-month delay for a certain fintech can mean life and death,” said Desmarais, who oversees Power’s investments in the emerging industry, which include a stake in robo-adviser Wealthsimple Financial Inc.Politicians say they are motivated to do something about internal trade.The mandate letter that Prime Minister Justin Trudeau wrote for Dominic Leblanc orders his new intergovernmental affairs minister to “collaborate with provinces and territories to eliminate barriers to trade between each other, and work toward a stronger, more integrated Canadian economy.”Trudeau also plans to assemble the premiers before the end of the year to work on freer trade within the federation. There appears to be support for the idea from a couple of the prime minister’s harshest critics, Doug Ford and Scott Moe, the Conservative premiers of Ontario and Saskatchewan, respectively, who said on Oct. 29 that they would seek to eliminate rules that impede trade between their two provinces.“I hear from business leaders that this is one of the primary obstacles to attracting new investment and jobs to our country,” Ford said.… Trudeau and the premiers likely would agree to erase barriers to the exchange of beer and wine. That would be a start. The risk is that it also would be an endingThose business leaders should follow the lead of Desmarais and speak for themselves.Darrell Dexter, the former New Democratic premier of Nova Scotia, told the One Country, One Market conference that Trudeau and the premiers likely would agree to erase barriers to the exchange of beer and wine. That would be a start. The risk is that it also would be an ending.Day doesn’t sense there is any more political will to make tough decisions today than there was two years ago when the Senate banking committee published its report.“It’s going to take some goodwill,” he said. “The federal government is going to have to come up with some significant incentives.”The other alternative might be going back to the well of support the Trudeau government used in order to survive the renegotiation of the North American Free Trade Agreement. The same economic arguments apply, and better access to provincial markets could be a hedge against Donald Trump’s penchant for trade wars.But Canadian executives are going to have to show they want it.•Email: kcarmichael@postmedia.com | Twitter: CarmichaelKevinWe want to improve your reading experienceCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}