{"id": "Bank of Canada raises rates: Read the official statementEconomyTop Stories", "paragraph": "October 24, 201810:02 AM EDTHere’s the Bank of Canada’s official statement for its interest rate decision on Wednesday, October 24, 2018:The Bank of Canada today increased its target for the overnight rate to 1 ¾ per cent. The Bank Rate is correspondingly 2 per cent and the deposit rate is 1 ½ per cent.The global economic outlook remains solid. The US economy is especially robust and is expected to moderate over the projection horizon, as forecast in the Bank’s July Monetary Policy Report (MPR). The new US-Mexico-Canada Agreement (USMCA) will reduce trade policy uncertainty in North America, which has been an important curb on business confidence and investment. However, trade conflict, particularly between the United States and China, is weighing on global growth and commodity prices. Financial market volatility has resurfaced and some emerging markets are under stress but, overall, global financial conditions remain accommodative.The Canadian economy continues to operate close to its potential and the composition of growth is more balanced. Despite some quarterly fluctuations, growth is expected to average about 2 per cent over the second half of 2018. Real GDP is projected to grow by 2.1 per cent this year and next before slowing to 1.9 per cent in 2020.The projections for business investment and exports have been revised up, reflecting the USMCA and the recently-approved liquid natural gas project in British Columbia. Still, investment and exports will be dampened by the recent decline in commodity prices, as well as ongoing competitiveness challenges and limited transportation capacity. The Bank will be monitoring the extent to which the USMCA leads to more confidence and business investment in Canada.Household spending is expected to continue growing at a healthy pace, underpinned by solid employment income growth. Households are adjusting their spending as expected in response to higher interest rates and housing market policies. In this context, household credit growth continues to moderate and housing activity across Canada is stabilizing. As a result, household vulnerabilities are edging lower in a number of respects, although they remain elevated.CPI inflation dropped to 2.2 per cent in September, in large part because the summer spike in airfares was reversed. Other temporary factors pushing up inflation, such as past increases in gasoline prices and minimum wages, should fade in early 2019. Inflation is then expected to remain close to the 2 per cent target through the end of 2020. The Bank’s core measures of inflation all remain around 2 per cent, consistent with an economy that is operating at capacity. Wage growth remains moderate, although it is projected to pick up in the coming quarters, consistent with the Bank’s latest Business Outlook Survey.Given all of these factors, Governing Council agrees that the policy interest rate will need to rise to a neutral stance to achieve the inflation target. In determining the appropriate pace of rate increases, Governing Council will continue to take into account how the economy is adjusting to higher interest rates, given the elevated level of household debt. In addition, we will pay close attention to global trade policy developments and their implications for the inflation outlook.We want to improve your reading experience"}