{"id": "Apple's iPad Pro devices get iPhone features in tablet revivalPersonal TechTop Stories", "paragraph": "October 30, 201812:02 PM EDTLast UpdatedOctober 30, 201812:38 PM EDTApple Inc. is giving its iPad the most extensive upgrade since 2015, the latest effort to revive a product that has suffered falling sales in recent years.On Tuesday in Brooklyn, New York, Apple executives unveiled new iPad Pro models in two screen sizes — 11-inch and 12.9-inch — that include key features from the latest iPhones. The updated tablets include slimmer sides that make the displays look nearly edge-to-edge, faster processors, an upgraded back camera, and Face ID for unlocking the device, making payments, and sending customized emojis.IPad unit sales peaked at 26 million units in the fiscal first quarter of 2014. Apple sold about half that during last year’s key holiday quarter. The average selling price has also fallen. Still, there’s reason for optimism. While the tablet market is contracting overall, the iPad has been slowly regaining momentum thanks to new software and lower-priced models, but also because competitors like Amazon.com Inc. and Samsung Electronics Co. haven’t wowed the market lately.The iPad models unveiled Tuesday could keep the rebound going. The update to the iPad Pro is the first since June 2017. The A12X Bionic chip in the latest model brings speeds, artificial intelligence processing, and graphics up to par with the latest iPhones.Face ID, Apple’s 3D facial recognition system, replaces the iPad fingerprint scanner. On the software side, the iPads now have a gesture-controlled interface like the latest iPhones, so users can swipe up from the bottom of the screen to close apps, or swipe side-to-side to move between apps.The new models are also notable for what they lack: a home button, headphone jack and the Lightning connector used on Apple mobile devices since 2012. The headphone jack is gone in favor of Bluetooth headphones like AirPods, and the Lightning connector has been abandoned in favor of a USB-C port, the first time such a connector is being used on an iOS device.The iPads are also more expensive. The 11-inch model starts at $999 in Canada or US$799, up US$150 from the US$649 10.5-inch version from last year. A top of the line iPad Pro with cellular connectivity, 1 terabyte of storage, and the larger screen costs $US1,899, which makes it far more expensive than most full-featured laptops.Besides the iPads themselves, Apple also announced a new version of its Apple Pencil accessory.Bloomberg.com"}