{"id": "How to market your product where the eyeballs areSmall BusinessTop Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.November 12, 20186:12 AM ESTLast UpdatedNovember 16, 201812:53 PM ESTThe pen may be mightier than the sword, but the camera is mightier than both. As Canada’s Internet users increasingly flock to online video content, small businesses have an opportunity to impress them.A global survey of 5,000 consumers by content delivery network Limelight Networks found that the time spent watching online video per week had jumped 57 per cent from 4.28 to 6.75 hours in the past two years. Consumers watch videos mostly at home, on smartphones or computers, making them prime targets for video content that can help small businesses build a relationship with them.Even the smallest businesses can now afford to produce online video on a shoestring, using a smartphone, a tripod, moderately priced microphones and a basic lighting kit. You can edit the video smoothly using a low-budget package like Adobe Premiere Elements 2018, or Apple’s free iMovie program, and you can source audio relatively cheaply from copyright-free libraries like AudioJungle, Audio Network or Bedtracks.What to sayWhile small businesses can stage a video marketing campaign without breaking the bank, but there’s one thing they can’t easily buy: a message. The most important thing is to figure out what to say, and how.The first piece of advice is to keep it short. Online video marketing company Vidyard analyzed more than 250,000 videos from the 600 businesses using its platform. Its results showed that 59 per cent of people finished videos that lasted 90 seconds or less. That dropped to 36 per cent for a five-to-10 minute video, and to 14 per cent for videos longer than 30 minutes. This means that you should also put the most vibrant, engaging content up front to keep the Internet’s increasingly distracted denizens interested.Small businesses can tackle a variety of topics in their videos, but according to Vidyard’s numbers, the most popular kind were product videos, demos and explainer videos.Explainer videos, which often use animation to communicate a product’s or service’s unique sales proposition, have flourished in the past few years and they’re deceptively easy to produce these days. Services like Powtoon, Vyond and RawShorts are three options among many. For small businesses with online services or software, screencasts can help demonstrate your product. Wistia’s Soapbox is a simple way to capture your screen and your webcam at once.Product demos are just one way to wow your audience. Other topics include educational videos that help users with quick, practical pieces of information but also open the door to building a longer-term relationship. If you’re selling custom sheds, for example, a video series of shed design tips can get potential customers excited enough to call your number.The flipside of educational is experiential. Showing customers the inside of your company is a good way to build a rapport while entertaining them at the same time. If you have a product that lends itself well to a “making of” video, ranging from food to fashion goods, customers will appreciate an inside look. Who doesn’t want to see a time lapse video of your top baker icing a cake? If you’re a services-based outfit, give customers a personal feel for the staff they’ll be dealing with.Where to say itAfter putting together your marketing campaign, you’ll need a place to put the content. Be sure to use the promotional features of whichever platform you use. For example, filling out the search keywords you want to rank for in Youtube’s submission forms will help your video rise to the top. Creating playlists of your videos will encourage more viewing, and YouTube “end cards” — end screens that contain links to follow — are a great promotional tool. These are great places to put your call to action (CTA, in marketing lingo), encouraging viewers to take the next step and visit your product page or sign up to your newsletter.Include a 'call to action' so your viewers will take the next step and engage with your companyEmbed your video in other areas that make sense for your business. One place is landing pages — those subpages on your web site that you put in online ads promoting a particular product or service. Vidyard’s report found that the number of businesses using video on landing pages jumped from 49 per cent last year to 60 per cent this year. Other useful distribution channels include email newsletters (embed thumbnails of your video in your emails to entice people to click).Social media will also be a big part of your video distribution. This extends beyond Facebook’s video advertising or posts to Twitter and Facebook-owned Instagram. Use platform-specific features like Instagram’s Stories function, which lets you post streams of videos and photos that disappear within 24 hours.Who saw it?Finally, close the circle by analyzing who saw your video and how. Facebook, YouTube, Instagram, Vimeo and others offer analytics tools that can tell you how your videos are performing. As you get more advanced, you can play with such tools as unique links from your videos that will enable you to tell which videos prompted viewers to visit your web site.For small businesses with a camera and something to say, online video represents a golden opportunity. After all, if a picture is worth a thousand words, then how much is a video worth at 30 frames a second?"}