{"id": "How to ensure you take advantage of all the tax benefits that come with being a landlordTaxesTop Stories", "paragraph": "November 2, 201810:59 AM EDTIt seems like nearly everyone you talk to these days is a landlord or is thinking of becoming one. While some of us may simply rent out our basement to bring in extra income to help cover the mortgage, others are forgoing more traditional retirement savings vehicles such as RRSPs and TFSAs for the allure of investing in residential real estate. After all, why not collect some rental income to help offset some of the expenses with a view to disposing of the real estate in a future year, hopefully at a significant profit?Some people even boast of the tax benefits associated with being a landlord, as they seek to use any rental losses generated from their rental properties to reduce taxes owing on other income, such as employment or business income.But you need to be careful if your properties don’t generate enough income to cover the associated expenses as the rental losses that you are generating may not be tax deductible. The Canada Revenue Agency (CRA) has said that if, for example, you rent out a part of your home and your expenses exceed your income, you cannot claim your expenses if you have no reasonable expectation of making a profit. So, if your expenses exceed your income on a consistent basis, you may not be able to claim any losses.Indeed, in some cases, where you ask a person living with you, such as a relative, to contribute a small amount to cover part of the upkeep of your home or common expenses such as a portion of groceries, the CRA will view the situation as a “cost-sharing arrangement.” In this case, the amount received need not be included in your income, nor should any expenses be deducted.If you choose to rent your property at less than market rates, for instance if the tenant is a personal friend, and you do not cover your expenses, no loss can be claimed for tax purposes. Only if your friend pays the same amount as you would charge any tenant (i.e. fair market value rent), and you expect to earn a profit, would you be able to deduct a loss against your other income.A recent tax case, decided last month, involved a taxpayer who was reassessed by the CRA for claiming rental losses totaling between $5,000 and $8,600 for the seven taxation years from 2005 through 2011.The taxpayer, a former Canada Post employee who retired 14 years ago, testified that he purchased two bungalows in Hamilton, Ont., “for investment purposes.” The taxpayer financed part of the acquisition costs of the properties by taking a five-year mortgage on each property. The properties were not new and required minor renovations. The taxpayer testified that the two properties were always rented and that he never lived in them. He found tenants by putting a sign on the property to be leased and by advertising in the local newspaper.The taxpayer admitted that he charged rent “below fair market value due to high rental vacancies rates in Hamilton between 2005 and 2011 years … to attract tenants.” In addition, he was told by his insurance company that if the properties remained vacant, it would not cover him.The first bungalow was rented from Nov. 1, 2005 to April 30, 2006 for a monthly rent of $425 and then again from May 1, 2006 to August 2007, also for a monthly rent of $425. The property was vacant from September 2007 to Jan.31, 2008 and was later rented to the taxpayer’s niece from Feb. 1, 2008 to December 31, 2011 for a monthly rent of $200.The second bungalow was rented out from May 1, 2006 to Oct. 31, 2007, for a monthly rent of $425. The property was vacant from Nov. 1, 2007 to February 2008 and thereafter was rented out to “a personal friend” from March 1, 2008 to Dec. 31, 2011, for a monthly rent of $475.The court compared these rental rates to data from the Canada Mortgage and Housing Corporation (the “CMHC”), which reported Hamilton vacancy rates between 3.2 and 4.3 per cent, with an average rent between $800 to $900 per month, per unit, for the 2005 through 2011 years. Hamilton Community Foundation data revealed similar results.The CRA denied the rental losses, stating that “at no relevant time did the appellant have a reasonable expectation of profit” as the taxpayer did not rent the two properties at fair market value for the seven tax years under review. The taxpayer, “did not conduct any rental activity … in a sufficiently commercial manner, for profit.”The taxpayer objected, justifying the lower rents by saying that “his primary objective was to recover the interest portion of the mortgage payments, the property taxes and the insurance costs to ensure that the properties were not vacant to maintain the insurance coverage.”The Tax Court judge referred to the seminal 2002 Supreme Court of Canada decision on reasonable expectation of profit, which introduced the test that should be followed to determine whether a taxpayer’s activities constitute a source of income. The starting point is to ascertain whether the taxpayer’s activity is undertaken in “pursuit of profit” or is personal. Where there is a personal element, the activity must have a sufficient degree of “commerciality” to be considered a source of income.The judge in the present case found “there is a material personal element in that one of the properties was rented out to the (taxpayer’s) niece for $200 per month, i.e. well below the fair market value and well below the rent charged to the other tenants.” The second property was rented out to a friend.The judge therefore concluded that the taxpayer “did not conduct his rental activities in a commercial manner for profit. His expressed intention was not to make a profit but to recover the cost of certain expenses. The (taxpayer) was not in pursuit of profit and he did not realize a profit during the … taxation years under appeal. The (taxpayer) did not carry out his rental activities in a business-like manner.”The taxpayer’s rental losses were therefore denied.Jamie.Golombek@cibc.comJamie Golombek, CPA, CA, CFP, CLU, TEP is the Managing Director, Tax & Estate Planning with CIBC Financial Planning & Advice Group in Toronto.Calculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}