{"id": "Apple shares fall on lacklustre expectations for holiday salesInvestingTop Stories", "paragraph": "November 1, 20187:17 PM EDTApple Inc. gave an underwhelming forecast for the key holiday period, suggesting weaker-than-expected demand for the company’s pricier new iPhones.The Cupertino, Calif.-based technology giant expects fiscal first-quarter 2019 revenue to be between US$89 billion and US$93 billion. Analysts were looking for US$92.7 billion, according to data compiled by Bloomberg.Apple said it will stop reporting unit sales of iPhones, iPads, and Macs beginning in fiscal 2019, CFO Luca Maestri told analysts on a conference call.Apple’s shares extended a slump in late trading after the comments, falling as much as 7.4 per cent.Apple has long reported unit sales and revenue numbers for its major devices, such as the signature iPhone. Maestri said a 90-day snapshot of how many units are sold isn’t an accurate picture of Apple’s business.Fiscal fourth-quarter sales rose 20 per cent to US$62.9 billion, Apple said. Profit came in at US$2.91 a share. Analysts expected revenue of US$61.4 billion and earnings of US$2.78 a share.The company sold 46.9 million iPhones in the quarter, generating revenue of US$37.2 billion. The number fell short of analysts’ estimates and was a disappointment, considering there were no big iPhone launches in the same quarter last year. But higher prices of newer iPhones helped. The period included about a week and a half of sales of the high-end iPhone XS and iPhone XS Max models, which cost as much as US$1,449.The iPhone XR is one of the few outliers from the trend of more costly Apple gadgets. With a starting price of US$749, it’s expected to be a popular holiday gift, luring owners of older iPhones to upgrade. The iPhone still looms large over Apple’s fortunes, accounting for more than 60 per cent of revenue. It’s also the central hub for connecting the other devices and using services.The average iPhone selling price was US$793. Analysts were looking for 48.4 million iPhone units in the quarter, and an average selling price of US$729.This content was provided by Market One for commercial purposes."}