{"id": "'Borderline treasonous': Oil executives sound alarm as foreign investors fleeEnergyTop Stories", "paragraph": "November 15, 20186:39 PM ESTCALGARY — Canadian energy executives are becoming increasingly vocal about the country losing its competitive edge relative to their peers in the United States, saying it’s “very, very worrisome” that investors are exiting the domestic energy sector.“If the people of Canada think for one moment that we can only have Canadian investors and hope to drive any type of business going forward, they are absolutely, massively mistaken,” Grant Fagerheim. president and CEO of Whitecap Resources Inc., said in in an interview about the exodus of foreign investors in the domestic oil and gas industry.Their concerns were echoed by a foreign institutional investor in a letter to Prime Minister Justin Trudeau that was shared with the Financial Post. The letter marks the second time in recent weeks a fund manager outside of Canada has directed their concerns to Trudeau.“Moving forward, I hope your government will start to recognize the numerous issues that are affecting Canada’s energy sector, and do everything in its power to support an industry which has benefited Canadian prosperity for a long period of time,” Susan Johns, a U.K.-based fund manager, said in the letter, dated Nov. 7.It follows a similar note last month by Darren Peers, an analyst and investor at Los Angeles-based Capital Research, a US$1.7-trillion fund, which criticized Ottawa for allowing Canadian energy competitiveness to lag.Johns, who was previously with London-based Consulta, but is now running her own fund called Susan Johns LP, stated in her letter that she has invested in Canadian junior and intermediate companies for more than 30 years.It is “hard for me to watch such a vibrant industry being strangled by regulation, carbon taxes and the inability of producers to get their product to world markets,” she said in the letter.Fagerheim said Johns is a household name among junior and intermediate energy CEOs in Canada. Johns did not respond to a request for comment.In his Oct. 19 letter, Peers said that while he recognizes that Ottawa “has done a lot to maintain Canada’s competitiveness as a country to invest in, when it comes to energy it has not done enough.”Executives said the two letters should create a sense of urgency that Ottawa needs to take corrective action quickly.“It is very, very worrisome what is happening to the energy industry in Canada from a competitiveness perspective. That worry for me is even more exacerbated when I look at what’s happening south of the border,” said Cenovus Energy Inc. president and CEO Alex Pourbaix.Pourbaix said the U.S. government is working to streamline permit applications there and “Canada ignores these red flags at its peril.”“No one is required to invest in Canada,” Pourbaix said.It’s mystifying to me why there still doesn’t seem to be action taken. It’s borderline treasonousEric Nuttall, Toronto-based senior portfolio manager with Ninepoint Partners, who invests in Canadian oil and gas stocks, said “it’s not surprising” that other fund managers are coming forward with their concerns.“It’s mystifying to me why there still doesn’t seem to be action taken,” Nuttall said. “It’s borderline treasonous.”But energy executives say fund managers and investors don’t normally like to be in the limelight. Pourbaix said instuitional investors don’t normally embark on letter-writing campaigns, and other executives agreed.“I don’t think investors like to be in the public eye with their investment risks and strategies. I don’t think it’s common behaviour,” said Precision Drilling Corp. president and CEO Kevin Neveu.Neveu said all of the country’s investment banks track investment flows in and out of Canada, and the numbers show there’s very little flowing into the country’s oil and gas sector. That should be alarming to Ottawa, he said.“Our government doesn’t need investor letters to show them what is going on — the data is there,” Neveu said.• Email: gmorgan@nationalpost.com | Twitter: geoffreymorganCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}