{"id": "Free trade in the age of Trump: Can Canada save the crumbling WTO?EconomyTop Stories", "paragraph": "October 23, 20183:17 PM EDTCanada will step back into a familiar role this week when it kick starts a 13-nation mission in Ottawa to help bridge the bitter impasse threatening to sink the beleaguered World Trade Organization.In the unwieldy 164-member club of the WTO, where solutions to larger problems often begin life in smaller, informal gatherings, Canada has frequently played the part of an influential middle power pushing for compromise.The question now, given U.S. President Donald Trump’s clear contempt for the central organ of the world’s multilateral trading system, is how effective the approach will be this time around.The slow moving animal of the WTO is facing an urgent crisis as the United States continues to block the appointment of judges to its appellate body — or top court — an action that could leave it powerless by late next year.And the early Canadian suggestions for reform — outlined in a discussion paper provided ahead of this week’s meetings — have already been criticized by Dennis Shea, the U.S. Ambassador to the WTO, for not taking a tough enough stand.“I think the whole tenor of the paper is more trying to be a middle road kind of approach, like let’s have more discussions, let’s start a discussion,” Shea said during an event at the Center for Strategic and International Studies earlier this month. “I think we’re beyond that point. Yes, discussion is important, dialogue is important, but we need to get some actions in place.”Canada’s Minister for International Trade Diversification Jim Carr, who will host the Ottawa meetings, remains undeterred. Any reform to the complex international organization will ultimately require broad consensus that is best accomplished “incrementally, but also with purpose,” he said in an interview.“It’s not just talking,” he said. “There has to be a sense of movement. There has to be a sense that we’ve got to do better than we have done. There’s lots of purpose and I’m very hopeful it will take us to a place further along that path than we are now.”The meetings in Ottawa starting Wednesday will include senior ministers from Australia, Brazil, Canada, Chile, the European Union, Japan, Kenya, South Korea, Mexico, New Zealand, Norway, Singapore and Switzerland.Crucially, they will not include China or the United States, a decision Carr has said is part of a strategy to first build consensus among countries that believe in a rules-based trading system before moving out to bring others on board.Present or not, the influence of the world’s two largest economies — currently locked in a trade war in which tariffs on US$360 billion in goods have been exchanged — will undoubtedly loom large over the talks.You've got a bully of a Trump administration, you've got China and you've got a system that is collapsing and has actually become irrelevantU.S. President Donald Trump has repeatedly threatened to pull out of the WTO, accusing it of treating the United States harshly while failing to address unfair trade practices by China, including its alleged use of industrial subsidies, its policies around state-owned enterprises and its requirements that companies hand over technology in exchange for market access.With the seven-member appellate body now down to three judges — the minimum required to hear WTO cases — continued American efforts to block appointments could soon render it paralyzed.That would leave countries without a mechanism to address trade disputes, paving the way for a proliferation of bilateral deals, the application of more tariffs and an overall breakdown of the system, trade experts warn.“You’ve got a bully of a Trump administration, you’ve got China and you’ve got a system that is collapsing and has actually become irrelevant,” said Gregory Shaffer, director of the center on globalization, law and society at the University of California, Irvine.“The Trump administration is threatening tariffs and imposing tariffs, all of it in violation of WTO rules. So the system only exists in name right now and the question is how to make it effective at all.”Canada’s ideas for reform, described in the discussion paper, focus on three main issues. The first calls for improving the monitoring function of the WTO, under which members are required to notify the organization of how they are applying its rules and give other countries the opportunity to object. Another identifies the need to update aging trade rules and the framework for deciding what sorts of obligations developing countries are exempted from.The most contentious point tackled, give U.S. frustrations, is how to strengthen and safeguard the WTO’s dispute settlement system. Canada’s suggestions include streamlining proceedings, excluding some issues from adjudication and using mediation in certain cases.Solving the impasse over the appointment of appellate body members — an issue that “threatens to bring the whole dispute settlement system to a halt” according to the paper — will mean addressing concerns that its rulings have interpreted the rules in a way that has added to the obligations of members, it states.Canada’s blueprint for change “addresses everything the U.S. wants vis a vis China on substantive rules and is even open to curtailing the power of the appellate body,” said Shaffer of UC Irvine.“I think Canada is operating in the shadow of power. It is trying to position itself in a neutral, principled way here but of course in doing that it’s going to address the U.S. concerns quite seriously because if you argue the U.S. is playing in bad faith you’re not going to get anywhere. To make it effective you’ve got to address the U.S. position, you’ve got to play the broker and that’s what Canada is trying to do.”Ottawa isn’t the only force trying to organize a rewrite of the WTO’s complex rulebook for global trade. The EU issued a separate blueprint for reform in September. Like Canada’s submission, it calls for solving some disputes through “plurilateral discussions” involving smaller groups of interested players rather than by seeking unanimous approval of all member states. The U.S. has also engaged with the EU and Japan to develop new rules and methods of enforcement.A key difference among the proposals comes back to the Canadian approach, which stands in contrast to the top-down efforts of the Trump administration, says Robert Wolfe, professor emeritus at the School of Policy Studies at Queen’s University in Kingston.We'd done all the easy liberalization and what we were then asking was to do the hard stuff and nobody wants to do the hard stuff“The Americans want to say we’ve got a good idea and we’re going to use our weight to get everyone to do it,” he said. “Well, Canada’s not big enough to say ‘we have the solution, do it’ but that wouldn’t be our way anyway and I don’t think that would work. China isn’t going to change how it governs state-owned enterprises because you tell them to. It’s going to do it by working with you and coming to the conclusion that the way they manage state-owned enterprises isn’t working for them and is causing problems for other people.”The more the dispute between the U.S. and China intensifies, the harder it could become to achieve a compromise on key issues. That adds to the urgency of the situation and also makes excluding the two superpowers from this week’s talks a reasonable decision, said Simon Lester, a trade policy analyst at Washington’s Cato Institute.“When you have these big powers going at each other like the U.S. and China are, I think its reasonable to think well, you’re not going to get to a solution with them in the room,” Lester said. “It’s a perfectly reasonable and sensible approach to try and do it this way. Whether it has a chance for success, I don’t know. It’s certainly worth considering and I don’t have any other great proposals for what to do about the current situation.”Shea has credited the “disruptively constructive leadership” of the U.S. for prompting a renewed interest in WTO reform that many countries acknowledge is necessary. The WTO and its post-war predecessor, the General Agreement on Tariffs and Trade (GATT) are credited with lowering tariffs and increasing global trade volumes — a dynamic economists credit with reducing poverty and lifting living standards. However, in recent decades, the pace of liberalization has slowed and failed to address newer areas of trade including services.“If you look at the WTO after 1995, not a whole lot got done” said Lester. “Throw Trump into the mix and it all looks a lot more chaotic and confrontational but it was already really difficult. We’d done all the easy liberalization and what we were then asking was to do the hard stuff and nobody wants to do the hard stuff.”But part of the challenge in charting a path for reform is determining exactly what changes the U.S. wants, he added. Despite deriding various aspects of the WTO, he said, the U.S. has put forward few concrete proposals for how they should be overhauled.“Arguably it’s just a negotiating strategy where they make everybody so concerned that they’ll be willing to give the U.S. everyone what they want. Maybe you can look to the NAFTA experience as a guide. The changes to NAFTA weren’t earth shattering. Maybe we’ll go in the same direction at the WTO but it’s not clear how it’s going to play out.”• Email: npowell@nationalpost.com | Twitter: Naomi_PowellWe want to improve your reading experienceCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}