{"id": "What you need to know about the tax consequences of employee stock optionsTaxesTop Stories", "paragraph": "November 9, 20181:53 PM ESTEmployee stock options continue to be a popular form of incentive remuneration among a variety of companies, especially in the technology, junior mining and exploration and cannabis industries. While stock-option plans can be helpful to attract, retain and reward key employees, it’s important for option recipients to fully consider the tax consequences of both the exercise of an employee stock option and the subsequent sale of the underlying stock. As we’ll see, this is particularly important should the price of the stock decline in value after you exercise your option.A recent court decision demonstrates exactly what can go wrong in such a situation. Before reviewing the facts of the case, let’s review the general tax rules associated with employee stock options.The lawIf an employee purchases a share of her employer under an employee stock-option plan, the difference between the fair market value of the shares at the time the option is exercised and the exercise price is treated as a taxable employment benefit. In most cases, the employee is then entitled to the “stock-option deduction,” which is equal to 50 per cent of the employment benefit. The net result of the deduction is that stock-option benefits generally get taxed at beneficial capital gains-like tax rates and thus provide businesses with an attractive tool to attract and retain highly skilled employees. The key point to remember, however, is that the stock option benefit is not actually a capital gain but rather is classified as employment income.The problemThis can later become a problem for an employee whose shares subsequently decline in value below the fair market value of the shares when the employee exercised the options and received the shares. If those shares are sold, the resulting loss, equal to the difference between the new, lower fair market value of the shares and the fair market value of the shares on the date of option exercise, is considered to be a “capital loss.” A capital loss can only be used to offset other capital gains and cannot be deducted against the taxable employment benefit that arose upon acquisition of the shares through the option exercise.It is this mismatch of capital loss against employment income that has caused serious tax problems in the past for employees of various stock plans when the tech bubble burst in the early aughts. Indeed, you may recall the much-publicized case of the employees of B.C.-based SDL Optics, Inc. (later acquired by JDS Uniphase, now Vivai Solutions) who received company stock only to have the value of their shares subsequently plummet. It ultimately led to the federal government granting two remission orders in 2007 and 2008, forgiving both the income taxes and arrears interest of 45 former employees of the company that arose from participation in the company’s stock purchase plan.While many have blamed the problem on a flaw in the tax law, the real issue is that once an employee decides to exercise her options and not immediately sell her newly acquired stock, she steps out of the shoes of an employee and into the shoes of an investor. As the Canada Revenue Agency has stated, “The tax system reflects the result that, at the point of acquisition, those employees who hold their shares have chosen to accept a market risk as an investor, in the expectation of a return on that investment, including the future appreciation in the value of those shares. Thus, they are subject to the same general income tax rules respecting capital gains and losses on the underlying shares as other investors.”The caseIn the recent case, an Alberta executive was denied a remission order for the tax he owed after the shares he received upon exercising his stock options plunged in value. He went to Federal Court seeking a judicial review of the government’s refusal to recommend remission of his 2007 tax liability.In 2004, the taxpayer was granted an employee stock option allowing him to purchase 75,000 shares of his employer’s stock at a cost of $0.95 per share. On March 22, 2007, the taxpayer exercised his option and acquired the 75,000 shares at that price when the shares were worth $13.70 per share. As a result of purchasing the shares at less than their fair market value, the CRA assessed a taxable employment benefit for the 2007 tax year in the amount of $956,250, or $12.75 per share.The taxpayer objected to the assessment and ultimately filed an appeal to the Tax Court, arguing that since the shares acquired were subject to numerous blackout periods and he was considered an insider of the company, he was restricted from selling the shares immediately and the assessed value of the shares should be reduced. The Canada Revenue Agency agreed to reduce his employment benefit by 30 per cent to $648,000.But the taxpayer’s tax problem occurred when he ultimately sold his shares in 2011 for $3.05 per share or $228,750 in total, thereby realizing a capital loss of $419,250. But the capital loss could not be used to offset the $648,000 benefit. As a result, the taxpayer was liable to pay income tax on the taxable employment benefit.The taxpayer then applied for a remission of the resulting income tax and interest. To support his request, he cited the two remission orders providing relief to SDL employees who were unable to offset taxable employment benefits with a subsequent capital loss on the sale of employee stock purchase shares.The government refused the taxpayer’s remission request, on the basis that his circumstances were not the same as those of the other taxpayers, since they had participated in a stock purchase plan rather than a stock option plan and there were no extenuating circumstances that could warrant remission, as the taxpayer’s decision to purchase, hold and sell the shares were all decisions within his control.The Federal Court judge had to decide whether the government’s decision not to grant a remission order was unreasonable. The judge reviewed the facts of the case and compared them to the facts and circumstances of the SDL employees and concluded that the government properly exercised its discretion not to issue a remission order.In the 2010 budget, the government changed the law to ensure it collects its taxes when options are exercised. Employers are now required to withhold tax at source for the period in which the employee exercises a stock option. Employees still need to be mindful that if they continue to own the stock, and it drops in value, they may be left with a capital loss that can only be used against capital gains.Jamie.Golombek@cibc.comJamie Golombek, CPA, CA, CFP, CLU, TEP is the Managing Director, Tax & Estate Planning with CIBC Financial Planning & Advice Group in Toronto.Calculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}