{"id": "Bullish on Bolsonaro: Why investors are high on Brazil's markets under president-elect who pumps up military dictatorshipsInvestingTop Stories", "paragraph": "October 29, 20186:14 PM EDTLast UpdatedOctober 30, 201810:23 AM EDTHis controversial comments on women and his praise of his country’s former dictatorship may have left detractors fearful of a Jair Bolsonaro presidency in Brazil, but so far investors do not appear to be among them.As global markets continue to be punished by a worldwide selloff, Brazil’s market has been rising with Bolsonaro’s political fortunes, which culminated Sunday with a comfortable win for the far-right candidate in presidential elections.Between Sept. 28 and Oct. 29, the iShares MSCI Brazil ETF, which tracks the Brazilian market and counts miner Vale S.A. and oil producer PetroBras among its biggest holdings, rose 22 per cent to a Monday high of US$41.39. The ETF lost steam in the afternoon and closed at US$38.775.According to one analyst, the recovery in Brazilian markets hasn’t been as much because investors were high on Bolsonaro but more because they shuddered at the prospect of any other option.“The Bolsonaro effect is a derivative of the Brazilian market not wanting another term of the PT Party in power,” said Andean Capital Investments president Daniel Osorio. “One of their leaders — Lula — is in prison. One of their leaders — Dilma Rousseff — was impeached.”Brazil’s PT Party had been in power from January 2013 until 2016. The party became synonymous with the web of corruption that still plagues Brazil. Lula, the former president, remains in prison on a 12-year sentence for corruption and money laundering.For voters, Bolsonaro was a shift from the norm. Dubbed “the Trump of the Tropics,” Bolsonaro is a hard-line politician who campaigned against crime and corruption. The former army captain has promised heightened power to the military and to the police, including the ability to kill suspects. Osorio called him an “unabashed admirer of the vicious, vicious military dictatorship” that ruled Brazil between 1964 and 1985.Bolsonaro’s rhetoric has proved beneficial to certain sectors.“Weapons manufacturers have done better on the expectation that, one, he’s going to be tougher on crime and, two, one of his campaign promises was to allow people to arm themselves to fight crime,” said Jorge Mariscal, emerging markets chief investment officer for UBS Global Wealth Management.Bolsonaro once told Brazilian newspaper O Globo that he really “doesn’t understand much about the economy” and will be relying on experts to run it. His chief economic advisor is Paulo Guedes, a University of Chicago-trained free-market economist.With Guedes leading the way, Bolsonaro has promised to introduce pension reform in Brazil, deregulate industries, privatize state-run companies like PetroBras and cut away at red tape.The markets could continue to boom, Mariscal said, if Bolsonaro keeps his promise to allow Guedes, who is expected to be named economy minister, the autonomy needed to carry out his plans. The inverse could be true if Bolsonaro himself takes charge.“(Bolsonaro) is a soldier,” Mariscal said. “He has little experience if at all with macroeconomic issues of the size and importance that Brazil faces.”Mariscal, however, expects Brazil to continue to see growth as the market continues to price in good news. Consolidation could be on the horizon, he said, and Brazil may even see a positive re-rating and follow India’s path to become the “next big long-term story.”Whoever says they know what Bolsonaro is going to do in terms of policy making is lyingFor international investors looking to make up losses suffered in the ongoing selloff that has seen the Dow Jones Industrial Average and the S&P 500 Index slip into negative territory on the year, Brazil could be a tempting option. Mariscal said equities remain cheap, the Real is “reasonably priced” and bonds, which have been performing well, still have upside. Interest rates are at an all-time low of 6.50 per cent.Osorio, however, warns, that “Brazil is not for beginners” because of the high volatility of the market and the inflationary pressures it normally suffers.The next steps towards consolidation, according to IHS Markit associate director, country risk, Carlos Caicedo, will be to see if Bolsonaro brings forth a solid pension reform plan during his inauguration in January. The markets, he said, will likely receive another boost if he does. In February, it’s “crunch time” because he has to elect the head of the lower house and the head of the senate.Until then, the market faces uncertainty. Bolsonaro, as shown by his decision to change political parties nine times in his 28 years in politics, is a wild card.“That’s where I think there’s a bit of wishful thinking in the market,” Caicedo said. “Whoever says they know what Bolsonaro is going to do in terms of policy making is lying.”Email: vferreira@nationalpost.com | Twitter: VicF77This content was provided by Market One for commercial purposes."}