{"id": "GE plunges to almost decade low after dividend slashed to penny and accounting probe adds to woesInvestingTop Stories", "paragraph": "October 30, 20187:56 AM EDTLast UpdatedOctober 30, 20182:25 PM EDTGeneral Electric Co. plunged the most in three years after the company disclosed an expanded federal accounting probe and worsening troubles at its ailing power business.The Securities and Exchange Commission is widening its investigation of the company’s accounting to look at a US$22 billion charge in the power-equipment unit, the company said Tuesday as it reported earnings for the first time since Chief Executive Officer Larry Culp took over. The Justice Department is also examining the writedown, which GE revealed on Oct. 1, when it announced that Culp would replace John Flannery.The federal investigations pile pressure on GE, which already was contending with one of the deepest slumps in its 126-year history amid cash-flow shortfalls and declining demand for its gas turbines. The announcement about the probes, made during an earnings call with analysts, overshadowed Culp’s first steps in his turnaround plan: a reorganization of the power division and a deep cut to its quarterly dividend that all but wipes out the payout.The shares tumbled 10 per cent to US$10.03 at 1:48 p.m. in New York after dropping to as low US$9.96, marking the biggest intraday drop since August 2015 and reaching its lowest price since April 2009. GE had already plunged 36 per cent this year through Monday to levels last seen shortly after the recession in 2009. Culp’s appointment sparked a mini-rally earlier this month that has since evaporated.Criminal PotentialThe Justice Department’s involvement was particularly worrisome.“It’s just stepping up the seriousness of it,” said Holly Froum, a legal analyst at Bloomberg Intelligence. “The SEC can file civil charges, but the DOJ can file criminal charges.”GE said in January that the SEC was looking at accounting in the power division and an old insurance portfolio that prompted a US$6.2 billion charge. It quantified the power unit’s writedown this month, which was related to goodwill impairment.“When there’s new investigations from the SEC and the Department of Justice, that’s just not the stuff that you can build much of an investment case around in the near term,” Jeffrey Sprague, an analyst at Vertical Research Partners, said in a Bloomberg TV interview. Sprague also noted that the company didn’t deliver any guidance on earnings or cash-flow Tuesday.The power unit has grappled with falling demand for gas turbines, declining market share and, recently, technical problems. The Boston-based company in September disclosed that its flagship turbine was facing an oxidation issue that forced a customer to temporarily shut down two U.S. power plants.Analysts had been bracing for a writedown after Flannery acknowledged that power assets acquired from Alstom SA in 2015 weren’t performing up to expectations. The previous CEO, Jeffrey Immelt, pushed through the US$10 billion deal just as the market started to sour. The operation’s third-quarter sales plunged 33 per cent.‘Deeper Impact’The power unit’s difficulties will “persist longer and with deeper impact than expected,” Chief Financial Officer Jamie Miller said on a conference call Tuesday. As a result, GE will miss its full-year target for cash flow by a significant amount, she said.Culp is attempting to accelerate a turnaround plan centered on cost cuts and a more-focused portfolio of manufacturing businesses. On Tuesday, the company said it would cut the dividend to just a penny a share from 12 cents currently.Debt investors at first applauded the dividend cut, expecting that the US$3.9 billion it would save could help pay down about US$115 billion in debt. But GE’s bonds reversed earlier gains. Its 4.418 per cent bonds due 2035, the most actively traded in the investment-grade market, fell almost a cent to a record low of 89.312 cents on the dollar, according to Trace bond-price data.While the dividend cut was a blow to investors, it wasn’t unexpected. Flannery had suggested a reduction was likely, following a separation of the health-care unit in another year. Many analysts had predicted the move would come sooner once Culp was ushered in.Culp, who joined GE’s board in April, has been visiting the company’s businesses since taking over. GE had said he won’t give a thorough analysis until early next year.The new CEO did, however, move to resuscitate the power unit by splitting it in two. A unified business will combine the gas product and services groups, while a second unit will hold the portfolio of GE Power’s other assets, including steam, nuclear, grid solutions and power conversion.GE has been the hardest hit by a industrywide slump in demand for gas turbines because of aggressive bidding on contracts and services that are biting into profits, said Sprague, of Vertical Research. It could take years for GE to turn around that business.“These problems in this business are very deep rooted,” said Sprague, who has a hold recommendation on GE. “This is not something that’s going to be fixed in a quarter or two, and even really a year or two could be optimistic.”GE Aviation, one of the bright spots for the company, boosted sales 12 per cent as it rolls out a new engine for narrow-body commercial jets.Total sales dropped 3.6 per cent to US$29.6 billion, GE said in a statement. Adjusted earnings fell to 14 cents a share, well shy of the 20-cent average of analyst estimates compiled by Bloomberg. Patience Wanes Culp said the company is “moving with speed to improve our financial position” and plans to continue with a strategy to shed the Oil & Gas unit and health-care business.But investor patience is thin after waiting for Flannery to roll out his plan, only to see him exit abruptly earlier this month, Sprague said.“The liabilities are going up and the cash flow is going down and the company is highly levered,” he said. “We think the company is vulnerable financially.”Bloomberg.comThis content was provided by Market One for commercial purposes."}