{"id": "Canada eyes sweeping free-trade deal with China but remains open to sector dealsEconomyTop Stories", "paragraph": "November 12, 20184:14 PM ESTOTTAWA — A full-scale trade deal between Canada and China is possible even as Canada remains open to striking smaller sector-by-sector agreements, says International Trade Minister Jim Carr.Speaking in Beijing Monday after bilateral economic meetings, Carr said China is interested in a wide range of Canadian products across many different sectors.But while Canada is in talks with China on a number of fronts, he insisted those efforts don’t preclude a wide-ranging trade agreement between the two countries.“It’s not one or the other,” he said. “These are trade conversations over a period of time. Trade is not an event and we’re having a continuous dialogue with our Chinese counterparts about a whole variety of products.”Last week, Treasury Board President Scott Brison told the Globe and Mail the best way to move forward quickly with China on trade would be to focus on opportunities for immediate gains in areas such as food and agriculture.And indeed Canada has sector-by-sector targets, including an aim to double Canadian agricultural exports to China to $75 billion by 2025, Carr said. “We’re well on our way to meeting those goals,” he said.Brison’s comments echoed those put forward by dozens of business experts in a recent Public Policy Forum paper, warning that a sweeping deal risks provoking the United States. President Donald Trump has been raising trade barriers with China.Canada’s efforts to start formal free-trade talks with China stalled late last year after Chinese leaders bristled at a Canadian trade agenda that includes gender, labour and Indigenous rights.Meanwhile, concerns have been raised over a clause in the new United States-Mexico-Canada (USMCA) trade agreement that allows any of the countries to withdraw from the deal on six months’ notice if one of the partners enters a free-trade agreement with a non-market economy — language widely seen as referring to China.China questioned Canada about the USMCA during talks this week and was informed of the provision that could affect negotiations between China and any of the three USMCA countries, Carr said.A number of federal and provincial officials have been in China over the last week to talk trade and drum up import and export deals between Canadian and Chinese businesses. Canadian companies taking part in the China International Import Expo last week secured $1.67 billion in agreements.China’s interest in so many Canadian products could ultimately lead to a comprehensive trade agreement, Carr said.Finance Minister Bill Morneau, who’s also in China, said high-level economic and financial discussions this week between the two countries were productive, and those talks will continue regularly to keep the momentum going.But he also noted that while Canada is actively promoting itself as “open for business” with China, when it comes to state-owned enterprises looking to invest in Canadian companies, Canada will be cautious.“We will examine those investment to make sure there are no security or other challenges for the Canadian economy,” Morneau said. “It’s consistent with the way other countries consider these investments.”We want to improve your reading experience"}