{"id": "When the going gets tough, Donald Trump turns to misdirectionInvesting ProTop Stories", "paragraph": "October 18, 20186:17 PM EDTLast UpdatedOctober 19, 20188:54 AM EDTIf you’ve been wondering how Donald Trump, Stormy Daniels, Saudi Arabia, Jerome Powell, the recent stock-market slump and China are all inter-connected — and hey, who hasn’t? — then you can stop wondering. All shall be revealed.Let’s begin with the most pressing question: What possessed the president of the United States to call Daniels “Horseface”?Some might conclude this was a prima facie case of Trump being Trump. After all, the slur came on the heels of his winning a minor legal battle with the porn star, who claims an illicit liaison with the future POTUS back in 2006. The President must have been feeling rather triumphal, and triumph tends to bring out the meanness in him. Yet even allowing a predilection for misogyny and rhetorical counterpunching, you have to wonder about the sanity of invoking a nasty pejorative to describe a woman’s appearance just three weeks before the midterm elections, especially with Trump’s approval ratings plummeting — even among white female voters.Here’s a more politically plausible theory: he was engaging in a bit of stage business known as misdirection. Consider that he instigated l’affaire Horseface just as criticism was building over his tepid response to the disappearance of dissident Saudi journalist Jamal Khashoggi in Istanbul and the increasing likelihood that the Saudi Arabian government was behind it. Why not try to change the media narrative? Maybe it didn’t exactly work — the Khashoggi story isn’t going away — but at least it gave his base (who presumably think porn stars should keep their mouths shut) something to defend him over.So let’s assume the validity of the Trump-as-master-of-misdirection line of reasoning. What the heck does that have to do with Jerome Powell and the stock market, you ask? The likely answer is obvious: the President is using the same sleight-of-mouth to direct blame for the recent stock selloff toward the Federal Reserve chair.He has, in fact, been quite explicit about this. In media ops, Trump has been banging the drum that the Fed and Powell comprise the “biggest threat” to the U.S. economy and the stock market because they are raising rates too fast, and has said that’s he’s “disappointed” in Powell (whom Trump appointed, by the way).Of course, Trump could be right. The Fed might be moving too fast toward normalization; time will tell. But Powell isn’t doing anything that we haven’t seen coming for a long while. There is nothing in the data, and nothing in the recently released minutes from the Fed’s September meeting, to suggest it is veering from a course it set months ago, and which markets should have priced in already.Yet the recent stock-market freeze seems to have encouraged the President to double down on his one-sided feud with the Fed. Why? Well, for one thing, it sets up a scapegoat for when the good times end for the U.S. economy. For another, it misdirects attention away from the emerging reality that Trump’s trade war with China is shaping up to be a disaster.And not just for China, although that’s bad enough. Investors and businesses there have been spooked. The Shanghai index is down more than 13 per cent since the end of September, and more than 25 per cent on the year, as retail investors sell off and the yuan has devalued against the U.S. dollar. The China Caixin Manufacturing purchasing managers’ index fell to 50 in September, suggesting that factories expect no growth — that’s its lowest level in 16 months. We can expect more bad news from the Middle Kingdom if, as seems likely, there is no resolution to the trade dispute by the new year and U.S. import taxes on US$250 billion of Chinese goods go to 25 per cent from 10 per cent. Trump is also threatening additional tariffs on the rest of China’s imports.Trump's trade policy is a disaster in the sense that it's not working. Its justification is to lower the trade deficit with China – a misguided measure, and suggests Trump’s confrontationalism is having the opposite effectYet the casualties from Trump’s trade war don’t stop there. The International Monetary Fund shaved its global growth projections recently, in part owing to trade frictions. A slower Chinese economy translates into lower commodity prices — oil has dropped to less than US$69 a barrel, reversing all the gains it made in the past month. U.S. stocks, as we have seen over the past week or so, aren’t immune to the worry.Trump’s trade policy is also a disaster in the sense that it’s not working. Its justification is to lower the trade deficit with China — a misguided measure, and one that suggests Trump’s confrontationalism is having the opposite effect. The U.S. trade-in-goods deficit with China has soared under his administration. It rose 8.2 per cent in 2017, and was up nearly nine per cent through the first eight months of 2018 over the same period last year.Of course, Trumpists would argue that’s because China is continuing its unfair trade practices; they claim Beijing’s promises to improve competitiveness, IP protections and business conditions for foreign companies have been empty. But that’s not wholly true. A recent survey from the U.S.-China Business Council found that nearly 60 per cent of its members have seen at least some tangible benefits from China’s economic reforms; on IP, specifically, China is making strides to increase enforcement and rewards for damages, as well as to eliminate bias against non-Chinese firms.Meanwhile, back in the U.S., tariffs put upward pressure on prices — pressure that, at current levels, seems to have had little effect on inflation. But that could change as tax rates escalate and the tariff targets broaden. If inflation kicks in, Powell might be forced to do what Trump is already accusing him of, and raise rates too fast.No wonder markets are skittish. And no wonder Trump would want to practice a little misdirection, whether the subject is porn stars or trade wars."}