{"id": "The bull market isn't done yet, but the days of double-digit returns may be, analysts sayInvestingTop Stories", "paragraph": "October 23, 20186:47 PM EDTLast UpdatedOctober 24, 20189:58 AM EDTA highly volatile October does not necessarily mean the longest bull market in history is coming to an end, but analysts are warning that investors should temper their expectations when it comes to portfolio gains going forward.Wall Street’s main indexes have seen significant losses this month after a two-day selloff beginning Oct. 10 saw the Dow Industrial Average Index drop 1,377 points, or 3.9 per cent. In Canada, the S&P TSX index has dropped more than 500 points — 3.41 per cent —  since the rout.On Tuesday, the markets seemed primed for another major sell-off as the Dow lost 500 points in early morning trading. The index recovered recovered throughout the day but still closed down 125 points.This newly found volatility is signalling a new era in the market, according to Allan Small, senior investment advisor at Allan Small Financial Group – HollisWealth, but not an end to bull market. Gone are the days, Small said, where investors can expect their portfolios to make 20 per cent because of market-wide growth.“As investors, we got a little spoiled,” Small said. “The market really benefitted from not having much competition for a while. Interest rates were so low that if any investor wanted to see growth in their portfolio, they had to be in the market.”The bull market began on March 9, 2009 after equities began to rebound from the global recession in 2008. In less than a decade, the Dow has seen its value increase by more than 250 per cent. In that time, investor portfolios have been buoyed by low interest rates and central banks that have been accommodating with their economic policies, Small said.By definition, a bull market only ends when stocks have fallen 20 per cent from their peak —  despite suffering through a painful October, the Dow has only dropped 6.5 per cent from its all-time high of 26,951.81 points on Oct. 3, 2018. A 20 per cent drop in the indexes would also likely signal a recession, and despite some yellow flags in the U.S., such as a flattening yield curve, analysts aren’t ready to make that prediction.What the market is going through now is most likely a five to ten per cent correction, Small said. But, he added, “it didn’t have to be this way.” The factors fuelling the market are mostly political, he said, pointing to the trade war between the U.S. and China and the tariffs that U.S. President Donald Trump has levied on both Beijing and Ottawa.Trump’s tariffs are starting to show in the profits of companies like Caterpillar Inc. In an earnings report published on Tuesday, the construction machinery company said tariffs on steel and aluminum resulted in $40 million in extra costs.Kevin McCreadie, president and chief investment officer of AGF Investments Inc., said that if companies begin to pass those losses over to consumers it means inflation could pick up. Central banks might then continue to raise interest rates, which would only put additional pressure on equities.Though he doesn’t believe the bull market is ending, McCreadie also warned that markets could see more volatility come November, when the U.S. holds midterm elections.“If the Republicans lose both houses … that would be a negative for the markets,” McCreadie said.When it comes to Canada, however,  Raymond James Investments vice president and portfolio manager Jason Castelli suggested the going may not be as tough.While markets here face several headwinds — from higher taxes and more regulations to the lagging price of Canadian oil — there may be a respite on the horizon.Castelli said Raymond James is positive on oil prices and the energy sector as whole and sees the differential to other global producers narrowing in the near future.“These headwinds are starting to come off and so as these headwinds become tailwinds, it’s actually quite a positive thing for the Canadian market,” Castelli said.As investors deal with volatility and a market correction, they have to lower expectations for their portfolios. Castelli said most investors holding balanced portfolios can expect four to five per cent yearly returns going forward. McCreadie said investors are trying to de-risk among the volatility and are “trying to play defence” by putting funds into utilities companies or even moving into fixed income.For Small, the solution isn’t to “stick your head in the sand” or to chase popular sectors.“Individual investors are at times not logical,” he said. “Investors have to wrap their heads around (the correction) or else they’re going to find themselves chasing these hot investments — and that’s when they can get hurt.”  This content was provided by Market One for commercial purposes."}