{"id": "'Texas cage-match' level of competition leads Canadian cannabis companies to Wall StreetInvestingTop Stories", "paragraph": "October 18, 20188:18 PM EDTWith cannabis now legal in Canada, some the country’s major pot companies are looking to ride the green rush all the way to Wall Street.On Thursday, Leamington, Ont.-based licensed cannabis producer Aphria Inc. submitted its registration to list its shares on the New York Stock Exchange, making it the second major Canadian producer to pursue a listing on the NYSE this month.Aphria’s bid followed that of Aurora Cannabis, which announced Thursday that its shares will begin trading on the NYSE as of Oct. 23 after receiving approval, and earlier moves to secure U.S. listings by Canopy Growth Corp. and Cronos Group Inc.B.C.-based Tilray Inc., meanwhile, skipped a Canadian listing altogether and made its initial public offering on the Nasdaq exchange in New York in July.In the cases of Cronos and Tilray, share prices almost immediately skyrocketed, with Tilray surging as high as US$300 in September after listing at just US$17 two months earlier.According to Paul Rosen, CEO of Tidal Royalty, which invests in U.S. cannabis companies, Wall Street not only opens these companies up to a new pool of investors but grants them a chance to separate themselves from competitors.“These companies are in a Texas cage-match level of competition among each other,” said Rosen, who is also the former CEO of Cronos. “They’re all following a successful path laid down by others … to increase their ability to raise capital from multiple sources and ultimately lower their cost of capital, which would be a competitive advantage to their peers who are not able to cross over through the gatekeeper of the U.S. exchange.”In order to be able to make the move onto Wall Street, these companies need to prove with an application that they’re not violating U.S. federal laws, which do not allow cannabis to be imported into the U.S.Buying into Canadian pot companies such as Aurora was already possible in the U.S. — but it would’ve had to have been done through over-the-counter trading, which most high-end investors tend to eschew. The other issue is that some American investors are still wary of buying shares of cannabis because the drug is still illegal in most states. When these companies are listed in U.S. exchanges, they immediately gain comfort and credibility among investors, Rosen said.The move may also be pre-emptive because of the expectation that the U.S. will follow Canada’s lead and legalize marijuana in every state — which Rosen expects will happen within the next four years. If it does come to fruition, Rosen suggests the U.S. market will become the “largest durable cannabis economy that will ever ferment.” After Aphria and Aurora, he expects CannTrust Holdings and HEXO Corp. could be next.Listing shares in U.S. marketplaces may also be a way for Aurora and Aphria to begin to hedge toward securing a future in a potential U.S. cannabis industry, said Aaron Salz, founder of consulting firm Stoic Advisory. Salz said Aurora and Aphria’s moves were a “no-brainer,” especially in the long term.“If they’re listing on the U.S. (markets), they’re positioning themselves to pick up assets in the U.S.,” Salz said. “The day it becomes legal, they’re definitely in a good position.”Now's the right time (to list). Everyone in this industry is always concerned you're going to wake up tomorrow and no one is going to care. So when people care, you've got to make the big movesSalz expects share prices to continue to be volatile as they are driven by retail investors looking to cash in on event-driven funds. Successful cannabis companies have all mastered “swinging big” when there’s hype around the sector. So it’s of no surprise that Aphria announced its application and Aurora revealed its listing date one day after legalization in Canada.“Now’s the right time,” said Salz. “Everyone in this industry is always concerned that you’re going to wake up tomorrow and no one is going to care. So when people care, you’ve got to make the big moves.”The expected boost in share prices might even help these companies expand, said Mike Hickey, a Benchmark Company analyst. Hickey, who has buy recommendations on Tilray and Canopy, said if Aurora and Aphria are looking to make acquisitions in the future, they’d be able to get more value out of using their stock as part of the deal.Getting a boost in share prices would only be a short-term win, Hickey said, and that’s if they’re able to hold the higher price point. The longer-term goal for these companies should be to establish a global brand. For now, institutional investors simply remain curious.The first step is to be listed on Wall Street. Next, they have to separate themselves from their competition using their new capital to make strategic allegiances and acquisitions to continue to grow away from being cannabis farmers to developing a brand that is globally recognized.“I can make beer in my basement, but I’m not Bud Light,” Hickey said.• Email: vferreira@postmedia.com | Twitter: VicF77This content was provided by Market One for commercial purposes."}