{"id": "Trump’s USMCA trade deal could be upended as Democrats vow to withhold supportEconomyTop Stories", "paragraph": "November 12, 201812:23 PM ESTWASHINGTON — President Donald Trump’s promise to quickly pass a revamped North American Free Trade Agreement has been upended by the midterm elections, with Democrats who will soon control the House vowing to withhold their support to extract greater protections for American workers.Administration officials remain confident they will corral the votes for the new United States-Mexico-Canada Agreement (USMCA), which Trump speedily negotiated in September to claim a big win on one of his signature issues before the November elections.While White House officials considered pushing the revised deal through the coming lame-duck session, they did not want to risk a backlash from lawmakers in both parties.Trump made it seem like this was a done deal, but there is a long, long way to goDemocrats, emboldened by their midterm win and eager to outshine Trump as defenders of the American worker, are unlikely to sign off on any deal that does not include significant changes that labour leaders and newly elected progressives are demanding. That could involve reopening negotiations with Mexico, although U.S. and Mexican negotiators have both publicly ruled out that possibility.“Trump made it seem like this was a done deal, but there is a long, long way to go,” said Rep. Bill Pascrell, D-N.J., who is likely to be named chairman of the House Ways and Means Subcommittee on Trade.The House will consider the agreement first under the Constitution’s provision mandating that revenue bills originate in the lower chamber. A vote could take up to nine months or longer, according to senior administration officials.House Democrats are particularly concerned about a provision that would require at least 30 per cent of the labour used to build each car in Mexico to be completed by workers earning at least US$16 an hour. That amount will rise to 40 per cent by 2023 but the US$16 wage is not indexed to inflation, meaning the increase will be diluted over time as prices rise.The text of the agreement also requires Mexico to make it easier for workers to join unions.All of these actions were intended to make it less likely that automakers and other manufacturers would shift American jobs south for cheaper labour. But Democrats and their allies in manufacturing unions — who have remained neutral on the proposed pact — maintain that the new requirements, while an improvement on the original NAFTA, do not go far enough.They are demanding more specifics about how the deal will be enforced, and raising questions about whether the US$16-an-hour benchmark for Mexican workers — which is about four times the typical wage for Mexican autoworkers — is high enough to stanch the flow of American jobs to Mexico.“Without enforcement you don’t have anything. Without it, you are, shall we say, just rebranding NAFTA,” Rep. Nancy Pelosi, D-Calif., said last week, days before voters swept her party back into power.“Right now, it is a work in progress,” said Pelosi, a former speaker who is expected to reclaim that post. “Mexico has to pass a law about labour rights in Mexico, so that has not happened yet and that is a predicate of this agreement. Most important of all are the enforcement provisions in terms of labour and the environment. Enforcement, enforcement, enforcement.”Senate Majority Leader Mitch McConnell, R-Ky., and House Speaker Paul Ryan, R-Wis., have both said publicly that they will not take up the agreement this year, although several free-trade proponents in their own party, led by Sen. Patrick J. Toomey of Pennsylvania, are urging them to reconsider.Toomey has his own reservations about the deal — he believes it includes too many potential restrictions on free trade — but he warned his fellow Republicans that entering a protracted negotiation with Democrats would be a losing strategy.“I would be shocked — shocked — to learn that Nancy Pelosi is going to make passing new NAFTA, which would be a big win for the president, her top priority,” he said.Robert E. Lighthizer, the U.S. trade representative, has repeatedly assured Trump that he will be able to sell the deal to Democrats and the leaders of the United Steelworkers Union, the AFL-CIO and the United Auto Workers Union, according to current and former White House officials.“We are very confident that Congress will approve USMCA,” said Jeff Emerson, a spokesman for the U.S. trade representative, referring to the United States-Mexico-Canada Agreement.“From the beginning, Ambassador Lighthizer has worked closely with Democrats and Republicans in the House and Senate on the renegotiation of this agreement,” he said, adding that the pact “is a balanced deal with strong provisions that will benefit U.S. businesses and workers and that enjoys broad support among key stakeholders.”But there are signs that Lighthizer, who has a close working relationship with many labour leaders and pro-union Democrats like Sen. Sherrod Brown of Ohio, may have a tougher time than he anticipated.“Words on a paper won’t stop jobs from going to Mexico, unless there’s real teeth behind them,” Brown said.In late October, Leo Gerard, the president of the United Steelworkers Union and chairman of the U.S. trade representative’s labour advisory council, reviewed the preliminary text of the deal and concluded that the new agreement contained provisions that “undermine the interests of workers and consumers” while doing too little to “curtail the illegal suppression of wages in Mexico,” according to a letter sent to Lighthizer.In the letter, Gerard took issue with the administration’s decision to maintain steel and aluminum tariffs against Canada and questioned the effectiveness of the agreement’s proposed automotive rules of origin intended to increase the percentage of cars built by American workers.But he saved his sharpest criticism for the Mexican wage provisions, arguing that the US$16 hour average wage mandated in the deal “is arguably too low to make a significant difference” in persuading manufacturers to keep their plants in the United States. He suggested making the wage standard a minimum, rather than an average, and suggested indexing it to inflation to ensure that the wage increases aren’t “meaningless.”Andrés Manuel López Obrador, a populist who was elected president of Mexico in July, supports wage increases but it is unclear if he can pass sweeping labour reforms through the country’s legislature.During a private meeting with House members of both parties last month, Lighthizer conceded that the labour provisions needed to be strengthened, but he declined to reopen talks with Mexico, according to three people who attended the meeting.The NAFTA vote will be up or down and Congress cannot amend the text, according to the rules governing fast-track trade agreements. But negotiators from each country are free to negotiate potential changes to secure enough votes for passage in their respective chambers.Mexican officials have said the labour standards in the deal are sufficient. Emerson said Lighthizer rejected as “false” the idea that he would consider reopening the deal. The labour standards included in the deal, he added, “are ambitious and enforceable,” he said.But Rep. Sander Levin, D-Mich., who attended the meeting last month, called the provision “a major flaw” and said “there will have to be some attempt to discuss this with Mexico” for the deal to win Democratic backing.Lighthizer remains eager to conclude a deal as quickly as possible, people close to him said, so he can focus on China, whose trade practices he sees as a far bigger threat to American workers than NAFTA, which has helped stitch together the economies of Mexico, Canada and the United States.But there’s one tactic he refuses to use to break the logjam: withdrawing from NAFTA as a means of pressuring legislators to act quickly.Trump has raised the possibility repeatedly since being elected, but has been talked out of it by Lighthizer and other advisers, most recently the National Economic Council director, Larry Kudlow, according to a senior administration official with knowledge of the situation.We want to improve your reading experienceCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}