{"id": "Realizing the possible: Mentoring women to be heard in the boardroomEntrepreneurTop Stories", "paragraph": "October 24, 20188:28 AM EDTLast UpdatedOctober 24, 20188:28 AM EDTWith her father’s encouragement, Daniela Tixi learned to fly a plane at the age of 16, even though she wouldn’t be able to get her driver’s licence for another two years. This accomplishment would set the mantra for her entire career: Never feel boxed in, because anything is possible.Today, as CEO of Strategic HR Asset (SHRA) and the first female president of the M&A Club in Toronto (a professional network created to encourage M&A and financing conversations), Tixi is proving this mantra true. She has earned a reputation as a mentor, change advocate and avid promoter of Canadian brands across Europe and the U.S.Through her boutique company, SHRA, which she founded in 2016, Tixi is leveraging human capital and business strategies to scale small and medium-sized enterprises in Canada to Europe and or the U.S. The organization, which fluctuates in number of employees depending on project, employs entrepreneurs and C-Suite executives as well as HR specialists. Tixi considers herself a “visionary culture champion” inspiring employees to “live and breathe” their brands, and has a portfolio of clients ranging in assets from $5 million to $1 billion.Last November, Tixi was approached by the folks at M&A to present on the important role of strategic HR in terms of due diligence in finance discussions.Soon after, she was approached by the group’s founder to head the Toronto chapter as president, a post she officially began in January 2018. Discovering that there were so few female members, Tixi has made it part of her agenda to improve the gender ratio. “I don’t want to feel like I’m filling a quota, but I’ll do anything I can to promote the validity of females in leadership roles,” says Tixi. “Perhaps we’re not seeing more women participating in M&A discussions because they’ve never been invited to the table.”The daughter of Italian diplomats, Tixi’s business and leadership savvy was instilled early on. “My father was an orphan raised in the air force who ended up working on high-level strategies for diplomatic missions around the world,” she says. “My mother spoke five languages and was a commissioner with the Italian Trade Commission while raising five kids.” Dinner conversations would often focus around global politics and trade opportunities. “It was a very rich education overall, and certainly not typical dinner conversations for a child,” says Tixi. “Both my parents are the reason I feel confident as a woman today because they’ve never distinguished between the genders.”Born and raised in downtown Rome and the oldest of the siblings, Tixi was trained in accounting and worked at various Italian-based companies in her early career. There she quickly realized that the leadership traits encouraged by her parents would never be put to good use. “In a room full of voices, the women were never heard,” she says of the atmosphere in those first workplace settings, noting that similar issues still prevail across Europe. “I always had to have a male on my team to advance my ideas.”So in 1994, at the age of 24, she moved to Toronto, landing a job at Telelatino (now part of Omni Television) and helping the Italian Trade Commission expand its markets for top Italian brands — from helicopters to food and fashion. In 1997, Tixi joined Ferrero Canada well before its hazelnut chocolate confectioneries became a household name. “When I joined the company it was losing millions and only the Italian community knew the brand in Canada,” she recalls. “We were told this was a peanut butter country and that we’d never sell our brand.” As the first woman to join and ultimately design the company’s HR department, Tixi was instrumental in building the executive team and helping persuade the top executives to build the company’s largest confectionery plant in Ontario instead of New Jersey, which resulted in the creation of thousands of jobs.I see myself as a conscientious vessel through which other women can voice their decisions in the boardroomOne of her biggest breakthroughs came soon after in working with Pusateri’s Fine Foods. There she helped restructure and reposition the Toronto-based family grocer, which eventually led to a partnership with Saks Fifth Avenue. Her success with Pusateri’s prompted her to open a business where she could help startups with the funds and strategies to find their own successes. “The more I talked to other companies, the more passionate I got about this made-in-Canada concept,” she says. “It’s really about how I can help these Canadian companies scale up and bring their brands to Europe and elsewhere.” In fact, Tixi was part of the first CETA trade delegation in Milan and Rome with Prime Minister Justin Trudeau in 2017.Tixi also thrives in mentoring women behind the scenes, saying that she could have used some female mentors herself. “I sit down and help women structure their companies but then it’s their success to claim,” she says. “All throughout my career, I saw myself as a conscientious vessel through which other women could voice their decisions in the boardroom — and I was promoting women executives in every organization I ever worked for.”Caroline Spivak, founder and principal of Profile Communications in Toronto, met Tixi at a women in finance investment event more than a year ago. “Her high energy, drive, strategic mind and overall success made us immediate kindred spirits,” says Spivak. “I aspire to achieve her level of success and am privileged to benefit from her enthusiasm and guidance.”Spivak says Tixi provides her with direct and practical advice on an ongoing basis, and has championed her business ideas while opening doors to others in her network. “Everyone needs help at every level of their career or business development in order to scale to the next level,” says Spivak, who just celebrated her company’s 10th anniversary. “Mentorship is not just for those starting their careers.”As for future plans, Tixi points to bold aspirations ahead. “My dream is for Canada to be at the forefront of trade and for our governments to help us get there,” she says. “I want to inspire women and companies to realize what they think is the impossible.”"}