{"id": "Canada not sending anyone to Saudi Arabia business summit and never planned to: sourceFP StreetTop Stories", "paragraph": "October 18, 20185:19 PM EDTLast UpdatedOctober 19, 201810:41 AM EDTOTTAWA — The federal government has no intention of sending anyone to a major investment conference in Saudi Arabia next week at a time when Riyadh is the target of global outrage — and one source insists Ottawa never had plans to dispatch a delegation.Cabinet ministers, federal officials and embassy staff will skip the Future Investment Initiative in Riyadh, which is sometimes referred to as “Davos in the Desert,” a senior government insider said Thursday.Last year, then-natural resources minister Jim Carr attended the inaugural edition of the summit.This year’s event comes as Saudi Arabia faces intense global pressure following the disappearance and apparent death of Jamal Khashoggi, a Saudi citizen and U.S. resident who has written critically of the Saudi regime.In recent days, key international figures have announced they’ve cancelled plans to attend the Saudi summit. They include top business executives, U.S. Treasury Secretary Steven Mnuchin, European cabinet ministers, International Monetary Fund head Christine Lagarde and World Bank President Jim Yong Kim.On the bilateral front, Canada’s relationship with Saudi Arabia has deteriorated significantly since the summer.In August, Riyadh suspended diplomatic ties with Canada and expelled the Canadian ambassador after Foreign Affairs Minister Chrystia Freeland criticized the regime on Twitter for its arrest of social activists.The Canadian official, speaking on condition of anonymity Thursday, declined to draw a direct link to recent events when asked why Canadians were skipping the summit — they said Canada is just not going.On Thursday in the House of Commons, Freeland called Khashoggi’s disappearance deeply troubling as she was pressed by opposition MPs to explain why the government is honouring a multibillion-dollar arms contract with a Saudi regime accused of human rights violations and war crimes.“Canada has said this with a very strong voice. That’s the message I transmitted to Saudi Arabia’s foreign affairs minister,” Freeland said in reference to the Khashoggi case.“I’ve also discussed this subject with my counterparts in Germany, the United Kingdom and the United States. We join our partners in calling for a thorough investigation and accountability for this act.”In response to another question on Saudi Arabia, she said: “Canada’s position on human rights in general, very much including in Saudi Arabia, is clear and firm.”U.S. President Donald Trump has said that, during their recent conversation, the Saudi king firmly denied allegations that he or his crown prince had any knowledge of or role in the disappearance of Khashoggi, who was last seen entering the Saudi consulate in Istanbul.— with files from The Associated PressWe want to improve your reading experience"}