{"id": "Couple left devastated by stock market crash of 1987 still trying to escape its long shadowFamily FinanceTop Stories", "paragraph": "November 16, 20189:38 AM ESTSituation: Couple lost massively in the past, now invests only in GICs barely pacing inflationSolution: Migrate slowly to structured bond ETFs and real return bond ETFs that have low loss riskA couple we’ll call Ivan, 71, and Millie, 51, live in B.C. A few years ago, Ivan, with a serious back injury, retired from his contracting business with no pension. His only income base is his RRSP and TFSA savings. He receives CPP and OAS and gets an $8,000 annual disability tax credit that eliminates all of his tax liability and, with a transfer, some of Millie’s as well. Millie works for a government unit as an administrative assistant and participates in its pension plan.Ivan and Millie have had bad luck over the years. They were devastated by the stock market meltdown on Oct. 19, 1987 which wiped out 22.6 per cent of the value of NYSE stocks and 22.5 per cent of TSX stocks in Canada. The leveraged investment company in which they had put all their savings dissolved. They were left with just $20 at a critical time when their children were young. To recover, Millie worked four part-time jobs at once. They used up much of their savings recently to pay off their mortgage, sold their two-bedroom condo and moved into a one-room studio. They have no car. They use public transportation or their feet to get about. Their lives are about staying afloat financially. Their issue — unless they raise investment returns, inflation will eventually impoverish them.Family Finance asked Graeme Egan, head of CastleBay Wealth Management in Vancouver, to work with Ivan and Millie. “Their situation is problematic, but it is not as bad as they think,” he says. “There are ways to give them a comfortable retirement.”Today, they have net worth consisting of a $209,000 condo, $5,000 in chequing, $125,000 in RRSPs and $89,000 in TFSAs. Their incomes total $77,000 per year before tax and many deductions from Millie’s gross pay, but that sum will decline when she retires as early as 2022. Then their belts will have to be tightened.(Email andrew.allentuck@gmail.com for a free Family Finance analysis.)Their take-home income from all sources adds up to $5,116 per month, half of which they save for a rainy day their experience tells them will come again. Their question — when will Millie be able to retire? Their goal is to have $3,000 per month after tax.Retirement incomeIf Millie contributes a total of $600 per month to her $125,000 of RRSPs invested entirely in GICs as they are at present, they would earn at most one per cent after inflation and thus grow to $168,470 in five years. Assuming that the RRSPs are entirely paid out over 25 years from Millie’s age 55 to her age 80, they would have investment income of $7,632 per year or $636 per month.Their $89,000 in TFSAs, to which they add $350 per month, growing at one per cent per year, will rise to $115,200 in five years and support payouts of $5,175 per year or $431 per month.From age 55, Millie could start her government pension at $1,156 per month and add Ivan’s CPP of $600 per month and his Old Age Security of $601 per month, all at 2018 rates. That’s a total of $2,357 per month before tax. RRSP income of $636 per month and TFSA income of $431 per month would boost total pre-tax income to $3,424 per month. After sharing Ivan’s disability tax credit, they would have little or no tax to pay.When Millie is 65, her job pension would drop to $925 per month, but she would add $525 of CPP benefits and $601 monthly OAS benefits for total income of $4,319 per month with little or no tax due.Millie could start her Canada Pension Plan benefits at age 60 with a 36 per cent reduction in benefits. It’s a permanent cut and unwise, Egan says.Boosting incomeWith investments entirely in Guaranteed Investment Certificates backed by the Canada Deposit Insurance Corporation, they have no risk of loss by theft or market drop but a guaranteed loss to inflation. Frugality is their hedge against future costs, but inflation will be devastating, Egan explains.Spartan living has given the couple the means to cope with the present costs of living but not with future costs such as drug expenses not covered by their provincial plan and even with the possibility that they will live longer than the age 80 which Millie believes is her life expectancy.They have had the strength to recover from a financial disaster. They think they might sell their condo one day to raise cash, though the chances are that the proceeds of the $200,000 or so they might get from the condo if they sell it themselves would not pay much rent, especially if they rely on GICs to generate income.They are also concerned that their four children may seek financial assistance. The kids are all grown and have families of their own, but, Millie says, they still think of their parents as lenders of last resort. “We don’t want to be their bank, though we would like to be able to leave them money when we’ve passed away,” Millie explains. The irony is that their income, adequate for now, will be reduced through inflation, reducing the value of what they may leave after they depart.Risk managementIvan and Millie could improve their financial future were they to invest their capital in assets with low risk but higher returns. For example, 5- or 10-year government bond ladders sold as low-fee exchange traded funds could pay perhaps 3 per cent to 4 per cent per year and would tend to preserve capital by rolling expiring bonds into new bonds at current interest rates, thus avoiding price erosion caused by rising interest rates that make old bonds with lower rates less attractive to investors.There are other strategies for maintaining purchasing power with limited risk of price erosion. For example, they could buy ETFs that hold real-return bonds whose value and gains are based on inflation rates rather than on interest rates.Their largest challenge will be the death of the first partner and loss of one Old Age Security payment, Egan notes. But raising returns will help to maintain their income. “Inflation is a guaranteed enemy,” he adds. “Dependable, higher returns will be their best defence.”Retirement stars: 2 ** out of 5Financial PostE-mail andrew.allentuck@gmail.com for a free Family Finance analysis. -2°CA few cloudsFeels like -4°CCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}