{"id": "Apple gets pounded, dragging markets down with itInvestingTop Stories", "paragraph": "November 12, 20184:11 PM ESTU.S. stocks started the week on a sour note, with tech shares tumbling as Apple Inc. faltered on signs of weak iPhone demand. The dollar rose, and the pound slid as the U.K.’s premier fought to save her Brexit divorce plan. Oil gave up early gains.The S&P 500 Index and Dow Jones Industrial Average finished Monday near session lows. The Nasdaq 100 dropped for the third day and the Russell 2000 small-cap benchmark erased its gains for the year. Major suppliers for Apple also fell as investors fretted about one of the most important product lines in the technology sector, and U.S. chip stocks followed suit.The Dow Jones Industrial Average fell 602.12 points, or 2.32 per cent, to 25,387.18, the S&P 500 lost 54.79 points, or 1.97 per cent, to 2,726.22 and the Nasdaq Composite dropped 206.03 points, or 2.78 per cent, to 7,200.87.“The midterm bump was a relief rally that for once the polls were right, but then investors started thinking about what it all really means for fundamentals,” said Max Gokhman, head of asset allocation for Pacific Life Fund Advisors. “It doesn’t mean that much. We’ll keep seeing volatility into year-end, with key milestones being the Trump-Xi meeting at G20, a Brexit treaty, and the December Fed meeting.”General Electric Co. extended a rout after its chief executive officer’s attempt to reassure investors fell flat. California utilities plunged as wildfires swept the state. Goldman Sachs Group Inc. fell the most since 2011 after Malaysia’s finance minister said the nation would seek a “full refund” over bond deals for its sovereign wealth fund that have landed the company in the midst of corruption probes.The dollar rallied versus most of its major peers. Crude oil had advanced early as OPEC and its allies started laying the groundwork to cut supply in 2019, but those gains evaporated, with U.S. President Donald Trump tweeting, “Hopefully, Saudi Arabia and OPEC will not be cutting oil production,” and saying prices should be “much lower based on supply!”The pound declined for a third day as pressure built on U.K. Prime Minister Theresa May to ditch her Brexit plan, while the euro slumped to its weakest level in more than 16 months ahead of more potential stress around Italy’s budget. Italian bonds fell as most euro-zone debt edged higher, while Treasuries didn’t trade because of a U.S. federal holiday.Investors have a lot on their plate right now, from deciding whether the recent earnings season was a peak to watching Brussels, where the European Commission is ready to escalate a battle with Italy over its budget deficits, and China, which produces key economic data on Wednesday.There’s also a renewed debate on the direction of bond yields — traders have been dialing down inflation expectations before U.S. consumer price data on Wednesday, which may offer the next clues on the trajectory of borrowing costs.The Stoxx Europe 600 Index was led downward by tech and personal goods shares. The benchmark gauge in Asia retreated, though stocks in Japan and Hong Kong finished in a tight range and those in China jumped. Emerging-market stocks and currencies fell.Bloomberg.com This content was provided by Market One for commercial purposes."}