{"id": "The ins and outs of claiming moving expenses on your tax returnTaxesTop Stories", "paragraph": "November 16, 201810:32 AM ESTIf you moved at some point this year, you may be entitled to a tax break for your moving expenses come tax time. But be careful, because not all expenses associated with your move may be tax deductible, as a Quebec taxpayer learned in court last month. Before reviewing the specifics of her case, let’s go over the rules for deducting moving expenses.The rulesUnder the Income Tax Act, you can write off your moving expenses if you moved for work, to run a business or to be a full-time student. To qualify, your new home must be at least 40 kilometres closer to your new work or school.Assuming you qualify, you can claim reasonable moving expenses that you paid for moving yourself, your family, as well as your household items. Eligible moving expenses include the obvious things, such as the costs of packing, hauling, movers, in-transit storage, and insurance for your household items, as well as travel expenses. These may include vehicle expenses, meals, and overnight accommodation to transport you and your family to your new home. Temporary living expenses for up to a maximum of 15 days for meals and temporary lodging near the old and the new home are also deductible.But moving expenses can also include ancillary costs such the cost of cancelling the lease for your old home as well as other incidental costs related to your move, such as fees paid to change your address on legal documents, replace your driver’s license and utility hook-ups and disconnections for either home.You can also deduct the costs, up to a maximum of $5,000, associated with your old home when vacant after you move, provided you make reasonable efforts to sell your home. These costs can include mortgage interest, property taxes, home insurance premiums and the cost of heating and utilities.Costs associated with selling your old home are also tax deductible, including advertising, notary or legal fees, real estate commissions, and any mortgage penalty associated with paying off your mortgage before maturity. Similarly, costs associated with buying your new home, including legal or notary fees, as well as any transfer taxes paid for the transfer or registration of title to your new home, are also tax deductible.Meal & vehicle expensesWhen it comes to deducting your moving-related meal and vehicle expenses, you have two choices: the detailed method and the simplified method. If you choose the detailed method, you must keep all your receipts which allows you to claim the actual amount you spent.On the other hand, if you choose the simplified method, you can simply claim a flat daily rate, per person, for meals. For more than a decade, that rate has been limited to $17 per meal, to a maximum of $51/day, per person.Similarly, if you choose to use the simplified method to calculate the amount to claim for vehicle expenses, multiply the number of kilometres you drove for the move by the cents/km rate for the province or territory where the travel began. For example, for 2017 in Quebec, the amount was 50.5 cents per kilometre.The caseIn the recent case, the taxpayer, a science editor with Quebec’s Ministry of Sustainable Development, Environment and the Fight against Climate Change, deducted a variety of moving expenses on her 2015 tax return associated with her work-related transfer.For more than ten years, the taxpayer worked in Montreal, where she owned a condo. In April 2015, the taxpayer was transferred to Quebec City and from April through June 2015, the taxpayer regularly made Quebec City-Montreal round trips because she still owned her Montreal condo.Taxpayer’s moving expensesDuring these three months, the taxpayer incurred temporary living expenses while staying with friends in Quebec City for a total of 51 days, at a cost of $25 per night. The taxpayer therefore deducted $25 per day for lodging (total of $1,275) as well as $51 per day for food (total of $2,601) using the simplified calculation method described above.In July 2015, the taxpayer purchased and moved into a condo in Quebec City where she incurred $8,770 in expenses for cleaning and repairs. Those expenses included: washing the condo, installing a washer/dryer, purchasing and installing light fixtures, laying ceramic in the kitchen, and purchasing an air conditioning unit. The taxpayer testified that she had to incur these expenses “to duplicate the quality of life she had in her Montreal condo.”The reassessmentThe Canada Revenue Agency allowed some of the taxpayer’s moving costs, including: the cost of her mover ($1,702), travel ($131), hook-up of utilities ($268), notary public fees ($1,845) and land transfer taxes ($2,000). It limited her claim for meals and lodging to 15 days, allowing $25/day ($375) for lodging and $51/day ($765) for meals. It denied all other moving expenses.The ruling The taxpayer objected and the matter went to Tax Court. While there was no doubt that the taxpayer paid her moving expenses as the result of an eligible move, the only issue was the acceptability of the various expenses she claimed.While the list of eligible moving expenses contained in the legislation is not necessarily exhaustive, the judge quoted prior jurisprudence that found that for moving expenses to be deductible, those expenses “must pertain directly to a move and cannot be incidental expenses.”The judge therefore concluded that the $8,770 in cleaning and repair costs were not valid moving expenses as they were incurred “only to maintain the lifestyle that she had in her Montreal condo … these expenses are incidental to the move.”As for the temporary living expenses the taxpayer incurred for lodging and meals, the Tax Act is very strict and states that such expenses are deductible for a maximum of 15 days. The taxpayer was not required by her employer to divide her time between Montreal and Quebec City. Rather, it was her “personal decision to keep living in her Montreal condo during the period from April to June 2015,” and thus the judge concluded that “the (taxpayer) cannot deduct an amount greater than 15 days for temporary accommodation and the meals arising from it.”The judge therefore disallowed the taxpayer’s temporary living expenses beyond the amounts allowed by the CRA for 15 days and denied the rest of her moving expenses beyond what the CRA allowed, calling them “unfounded.”Jamie.Golombek@cibc.comJamie Golombek, CPA, CA, CFP, CLU, TEP is the Managing Director, Tax & Estate Planning with CIBC Financial Planning & Advice Group in Toronto.Calculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}