{"id": "Bombardier shares plummet amid Quebec watchdog probe of executive stock tradesFP StreetTop Stories", "paragraph": "November 16, 201811:28 AM ESTBombardier Inc. tumbled to its lowest level in two years after Quebec’s financial markets regulator said the company’s executive stock-sale program is under review and ordered all such transactions to be suspended pending the probe. Bonds also dropped.The Autorite des Marches Financiers said it’s examining “all operations surrounding the establishment” by Bombardier of the stock-sale plan, according to a statement late Thursday. The provincial agency also said it asked Bombardier to advise brokers that the executive transactions will be suspended until further notice.Quebec’s scrutiny piles pressure on Bombardier a week after the company lost a quarter of its value following a weak cash-flow forecast and rising doubts on a turnaround plan. Bombardier announced the stock-sale plan in August, saying transactions would take place over two years. The Ontario Securities Commission said the next month that top executives including Chief Executive Officer Alain Bellemare were aiming to sell millions of shares.Bombardier’s widely traded Class B shares plummeted 14 per cent to $1.79 at 10:01 a.m. in Toronto after sliding to as little as  $1.75, the lowest intraday price since November 2016. The stock is on track for its worst week since 2008, based on the intraday decline Friday.Bombardier’s US$1.5 billion in bonds due 2025 led declines among global high-yield notes denominated in U.S. dollars Friday, falling 2.3 US cents to 90 cents on the dollar. The bonds are down 11 per cent since Nov. 7.The shares closed at $4.64 on the day the stock plan was announced. Bellemare and other top executives aimed to sell shares worth a combined $164 million (US$124 million), based on the share price at the time.Bellemare wanted to sell as many as 7.04 million Class B shares, and Chief Financial Officer John Di Bert planned to unload 4.36 million shares, according to the filing. Chairman Pierre Beaudoin, whose family controls Montreal-based Bombardier through multiple-voting shares, intended to sell as many as 3.1 million shares.A company spokesman declined to comment Thursday on whether any executives have sold shares since the sale plan was announced in August.Bombardier said it’s fully cooperating with the AMF on the review and has suspended all stock sales by executives, according to a statement Thursday.“With the pressure on Bombardier’s stock, preceding and following the release of our financial results on November 8, some had raised doubts about trading that may have occurred in the last months,” said Olivier Marcil, a company spokesman.Marcil said the trading plan was reviewed by the AMF before it was put in place. The plan, known as an ASDP, is a mechanism to ensure the orderly disposal, on a predetermined basis, of securities held by management. Trades under the plan are completed without any oversight or direct input from the participants, he added.Bloomberg.comWe want to improve your reading experience"}