{"id": "Canada's jobless rate at 40-year low — but big picture not so cheeryEconomyTop Stories", "paragraph": "November 2, 201811:57 AM EDTCanada’s unemployment rate fell back to four-decade lows, but sluggish wage increases and slumping exports offer little evidence the economy is running hot enough to warrant accelerated interest rate increases.Statistics Canada released jobs data Friday that showed modest employment gains, but with a shrinking labour force and the slowest wage gains in a year. A separate trade report continued to show sluggish flows in September, with both exports and imports recording back-to-back monthly drops.The message for the Bank of Canada: Keep on tightening, but take your sweet timeThe numbers reveal a lukewarm economy, one that is unlikely to convince the Bank of Canada a faster pace of rate increases is needed. The central bank has increased borrowing costs five times since mid-2017. Odds for a hike at the December meeting fell to 25 per cent, from 30 per cent Thursday.“Canada’s economy isn’t roaring ahead, but it still sits at what looks like full employment,” Avery Shenfeld, chief economist at CIBC Capital Markets, wrote in a note to investors. “On balance, this isn’t the kind of data the Bank of Canada will need to advance a rate hike into December.”The jobless rate and labour supply numbers provide evidence for an economy that’s close to capacity. The unemployment rate fell back to 5.8 per cent in October, matching a four-decade low. That was due in part to an 11,200 increase in employment, but also a falling labour force, which was down 18,200 for the month.While the labour force numbers suggest the jobs market may be tightening, wage pressure isn’t yet evident — which should ease the Bank of Canada’s concern about an overheating economy.In addition, Canada’s labour force has increased by just 62,500 so far in 2018, one of the smallest 10-month gains in recent history. The participation rate fell to 65.2 per cent last month, the lowest in two decades.Wage gains slowed for a fifth straight month, and were up 2.2 per cent from a year ago, the slowest since September 2017 and down from as high as 3.9 per cent earlier this year. Wage gains for permanent workers were 1.9 per cent, also the slowest in more than a year.September trade numbers released Friday also weren’t particularly robust. Exports fell 0.2 per cent, after a 1.5 per cent drop in August, while imports declined 0.4 per cent. In real terms, which strips out price changes, imports fell 1.5 per cent and exports were down 1.2 per cent.The Canadian dollar erased gains on the reports and was trading little changed at 76.3 US cents against its U.S. counterpart at 9:16 a.m. in Toronto.“Despite matching multi-decade lows on the jobless rate, wage gains have eased back to just barely above inflation,” Doug Porter, chief economist at Bank of Montreal, said in a note to investors. “The message for the Bank of Canada: Keep on tightening, but take your sweet time.”With assistance from Erik Hertzberg.Bloomberg.comWe want to improve your reading experience"}