{"id": "Manulife shares jump after Saskatchewan rule change lowers risk of hedge fund lawsuitFP StreetTop Stories", "paragraph": "October 30, 201812:01 PM EDTManulife Financial Corp. got a boost from insurance regulators in Saskatchewan in its battle with a hedge fund over investment policies that had prompted short seller Muddy Waters to short the stock of Canada’s biggest insurer.The Canadian province published regulations Monday limiting the amount of premiums a life insurer may receive or accept for deposit in life insurance policies. That’s the crux of a lawsuit by hedge fund Mosten Investment LP, which sued Manulife, claiming it should be allowed to deposit unlimited amounts of capital and earn high interest rates based on a 1997 insurance policy. Bank of Montreal and Industrial Alliance Insurance and Financial Services Inc. face similar legal challenges.“Given the new Saskatchewan regulations, Manulife and the other life insurers involved in similar matters plan to make submissions to the court, asking it to dismiss the claims that life insurers can be compelled to accept unlimited premium payments,” the Toronto-based insurer said Tuesday in a statement. “Manulife believes these regulations should accelerate the resolution, in its favor, of the principal matters in the Mosten litigation in Saskatchewan.”Manulife jumped 5.6 per cent to $20.98 at 9:52 a.m. in Toronto, the biggest jump in two years. “This change of law could put the litigation to rest,” Gabriel Dechaine, an analyst with National Bank Financial said Tuesday in a note to clients. “The amendments to the Saskatchewan Insurance Act could protect MFC (and others) even if plaintiff litigation goes against them.”The case is tied to life insurance policies sold more than two decades ago, when interest rates were higher, that allowed holders to invest their surplus funds into side accounts with guaranteed rates of at least 4 per cent. Mosten claims it should be allowed to deposit unlimited amounts of capital with Manulife based on a universal life insurance policy it owns. Manulife reiterated in the latest statement that Mosten’s position is “legally unfounded.”Short seller Carson Block, who runs Muddy Waters, announced a short position in the firm this month, saying the trial could lead to billions in losses for the Canadian insurer that operates John Hancock in the U.S. Block declined to comment Tuesday on the Saskatchewan ruling, saying they are gathering more information.Ronald Miller, a lawyer at McDougall Gauley who represents Mosten, didn’t immediately respond to emails requesting comment.Mosten is led by Michael Hawkins, a consultant and farmer in Ontario who started buying these life insurance policies from others in 2007 in provinces that allowed such deals, the Wall Street Journal reported this month. He placed the policies in a trio of private partnerships named after old Saskatchewan railway stops — Ituna, Mosten and Atwater, and investors of those partnerships earned a share of interest income on the policies, the Journal said.Interest rates have since tumbled, so that a 4 per cent rate on a policy today is more than double the Bank of Canada overnight rate.The Canadian Life and Health Insurance Association, which appealed to the Saskatchewan regulators in the Manulife case, said in a separate statement that it plans to ask other Canadian provinces and territorial governments to take similar steps.“We intervened in the Saskatchewan litigation as the position taken by the Ituna Investment LP, Mosten Investment LP and Atwater Investment LP is contrary to the nature and intended purpose of the product, fundamental insurance law concepts and Canada’s regulatory system,” President and Chief Executive Officer Stephen Frank said.Bank of Montreal and Industrial Alliance also welcomed the move.“We are pleased to see regulation in Saskatchewan that reinforces our view of the case — universal life insurance policies are simply not designed to accept unlimited deposits,” the bank said in an emailed statement.Bloomberg.comWe want to improve your reading experience"}