{"id": "David Rosenberg: Things aren't nearly as rosy as the Bank of Canada believesInvestingTop Stories", "paragraph": "October 24, 20185:15 PM EDTLast UpdatedOctober 25, 20189:20 AM EDTThe surprise Wednesday was not the Bank of Canada’s 25-basis-point rate hike to 1.75 per cent, which was baked in the cake, but rather the strident, if not outright hawkish, tone to the press statement. If there are typos in this missive, it’s because I’m still shaking my head.The first line said it all: “The global economic outlook remains solid.” Obviously, the BoC didn’t see the extremely soft PMI readings out of the Euro area Wednesday or the recent weak macro readings out of China.How does “solid” comport with the fact that the Organization for Economic Co-operation and Development’s leading indicator has declined now for nine straight months, and is at its lowest level since the Brexit scare in July 2016?How can anyone in their right mind declare that the outlook is anything close to constructive when the Chinese stock market is down nearly 30 per cent from its highs, the ex-U.S. global MSCI is off nearly 20 per cent from its 2018 peak, the entire world equity index is down 11 per cent and the TSX is down seven per cent?We have corrections or bear markets in 38 of the 47 of the members of the MSCI global stock market composite and the BoC said “global financial conditions remain accommodative.” Is that true in Italy, too?What is truly laughable is that right at the same time the bank released its statement, adding in that “the U.S. economy is especially robust,” U.S. September home sales data were released and showed a whopping 5.5-per-cent plunge to its lowest level (553,000 units at an annual rate) since December 2016.The underlying theme in the text of the BoC’spress statement was the successful resolution to the trade file: the USMCA “will reduce trade policy uncertainty in North America.” A similar remark showed up three different times and this parting of the clouds led the BoC to boost its forecast for exports and business investment growth for this year and next.The bank stated that “household spending is expected to continue growing at a healthy pace” — no reference, mind you, to the fact that retail sales volumes have fallen in each of the past three months, and in four of the past five. You would also never know that the BoC’s preferred inflation measure dipped to two per cent in September from 2.1 per cent in August.The bank believes the consumer is being supported by “solid employment income growth.”What data is it looking at?First, the year-on-year growth in hours worked has collapsed to 0.7 per cent after expanding more than three per cent at the turn of the year. Second, median hourly wages are now barely growing at all: 0.4 per cent from roughly two per cent at the onset of the year. Third, average wage rates have also substantially slowed, to 2.4 per cent from 3.5 per cent year-over year at the start of 2018.The bank also seems more confident that the “composite of growth is more balanced.” This, at the margin, is an upgrade from the comment in the last press statement back on Sept. 5 that “the rotation of demand towards business investment and exports is proceeding.”One by one, the bank has reduced the risks and uncertainties surrounding its forecast.Another new wrinkle was that the overnight rate “will need to rise to a neutral stance.” This is the first time we have seen such a Jerome Powell-like reference to neutral, which is estimated to be between 2.5 and 3.5 per cent (with the bank emphasizing the midpoint).This stems from another new development in the form of the BoC telling us that the economy is “operating at capacity.” For quite a while, Governor Stephen Poloz has expressed a degree of confidence that there was still some evidence of slack remaining in the economy (“… growth to average near potential” was the depiction in the last statement). That no longer seems to be the case.If the BoC thinks the output gap is closed, and is forecasting growth to be at potential, then it stands to reason that a central banker would move to neutral and not waste much time getting thereIf the BoC thinks the output gap is closed, and is forecasting growth to be at potential, then it stands to reason that a central banker would move to neutral and not waste much time getting there.The bank also removed the phrase that it will “continue to take a gradual approach,” which leaves the door open for a quicker pace if it sees fit. That is the new risk and the front end of the Canada curve — and the loonie picked up on this right away.There were some caveats in the statement that could be construed as not being that hawkish — such as expecting the U.S. economy to moderate and noting the ongoing decline in commodity prices (though the bank curiously attaches this to the U.S.-China trade skirmish).But what has not changed is the view that there is a moderate amount of slack left in the economy, and that the BoC will not have to get anywhere close to neutral to achieve its inflation target.The truth is always in the price, so let’s have a look at a few of the prices.Core CPI, excluding indirect taxes, dipped 0.1 per cent in September, and a decline has only happened four times in the past six years. The year-over-year trend slowed to 1.5 per cent in September from 1.7 per cent and is showing no sign of any acceleration. The six-month trend, for example, is running at just a 0.9-per-cent annual rate.Producer prices fell 0.5 per cent in August on top of a 0.2-per-cent decline in July, the first successive retreat since the summer of 2017.The BoC’s own commodity price index sagged 0.3 per cent in September and has fallen now in each of the past four months — and is at a -27-per-cent annual rate over this time frame.On top of that, average hourly earnings of permanent workers (the bank’s favourite wage indicator) are at their slowest pace in a year — how is this trend consistent with an economy operating with no spare capacity? — Statistics Canada’s new house price index has shown absolutely no net change since the turn of the year, and 10-year inflation break-even levels are at 170 basis points, nowhere near the BoC’s inflation target.… the selloff we saw at the front end of the Canada curve is a nice buying opportunity and the rally in the Canadian dollar is an equally nice selling opportunityMy sense is that the selloff we saw at the front end of the Canada curve is a nice buying opportunity and the rally in the Canadian dollar is an equally nice selling opportunity.My bet is more with the caveats in the press statement than the deliberate changes made to the wording in a more hawkish direction. If there is anything we have learned about the Poloz-led BoC, it is that it can change its tone on a dime.One final note: the Canadian economy has managed to expand by merely 1.9 per cent in the past year, a full percentage point below the U.S. trend. The U.S. economy is already operating with an output gap that has been breached and wage growth is accelerating (not to mention actual and pledged fiscal stimulus).None of these conditions apply in Canada. Moreover, Canadian energy producers are saddled with a blended oil price of nearly US$40 compared with almost US$70 for the U.S. oil industry.In other words, the case for the U.S. Federal Reserve tightening is far greater than it is for Canada and that is one reason why the Canadian dollar is highly unlikely to sustain any strength. Selling the bounces should remain the optimal strategy.• David Rosenberg is chief economist and strategist at Gluskin Sheff + Associates Inc. and author of the daily economic report, Breakfast with Dave.This content was provided by Market One for commercial purposes."}