{"id": "Apple, suppliers tumble as signs mount of weak iPhone demandPersonal TechTop Stories", "paragraph": "November 12, 201810:38 AM ESTApple Inc’ and major suppliers to the company’s iPhone fell Monday as investors fretted that one of the most important product lines in the technology sector was seeing weak demand.The latest warning sign was Lumentum Holdings Inc. cutting its second-quarter outlook after one of its largest customers asked to “meaningfully reduce shipments” for previously placed orders. Lumentum didn’t name the customer, but Apple is its biggest, according to Bloomberg supply-chain data. Shares of Lumentum plummeted a record 30 per cent while Apple dropped as much as 4.1 per cent. Oclaro Inc., which is being bought by Lumentum, lost 11 per cent, on track for its biggest drop since April.“We think investors should consider Lumentum’s updated guide as reflecting as much as a 30 per cent cut in Apple orders,” Wells Fargo analyst Aaron Rakers said in a note to clients.Loop Capital Markets also said the customer is likely Apple. The development “is not entirely surprising” but “it seems very likely to us that the market for 3D sensing-related light sources and other components is going to be smaller next year than previously anticipated,” analyst James Kisner said in a research note.Among other Apple suppliers, Cirrus Logic Inc. dropped 10 per cent at 9:49 a.m. in New York. Qorvo Inc. slid 7.3 per cent, Skyworks Solutions Inc. fell 2.8 per cent, Finisar Corp. dropped 4.7 per cent and Broadcom Inc. fell 5.3 per cent. Semiconductor stocks were broadly lower with the Philadelphia Semiconductor Index down 3 per cent. Lumentum’s outlook comes a week after Nikkei reported that Apple was cancelling a production boost for its iPhone XR line, and less than two weeks after Apple’s fourth-quarter results showed tepid unit sales growth. The company also said it would stop providing unit sales for iPhones, iPads, and Macs in fiscal 2019, a step Nomura Instinet said raised “the spectre of a sustained iPhone downturn.”Adding to Monday’s negative news, Longbow Research cautioned that Apple is facing weak iPhone demand in China. And Citi downgraded Skyworks to neutral and slashed its price target to US$85 from US$116, citing both “disappointing iPhone XR unit sales” and “broad smartphone weakness.” Last week, Skyworks gave a first-quarter outlook that missed expectations because of smartphone weakness, prompting at least two other downgrades.Citi also cut its target on Qorvo on Monday due to iPhone XR weakness.–With assistance from Kamaron Leach.Bloomberg.com"}