{"id": "Apple to unveil iPad, MacBook laptop overhauls on Oct. 30Personal TechTop Stories", "paragraph": "October 18, 20183:02 PM EDTApple Inc. said it will hold a product announcement Oct. 30 in Brooklyn, New York, likely to unveil new iPads and Mac computers.The invitation to media reads, “There’s more in the making,” without specifying what would be introduced. The Cupertino, California-based technology giant is planning the biggest revamp to the iPad Pro since it first went on sale in 2015, as well as a lower-cost MacBook laptop and a new Mac mini desktop, Bloomberg News reported earlier this year.On its website, Apple said the event will be live streamed. This will mark the first Apple product introduction to take place in New York since the company unveiled its digital textbooks service in 2012. It is, however, the second Apple product launch outside of California this year. In March, the company announced new education software and an update to the entry-level iPad at a Chicago-area high school.The October launch, the month in which Apple has previously debuted new Macs and iPads, will take place at the Brooklyn Academy of Music’s Howard Gilman Opera House.The new iPads will inherit features from the latest iPhones, bringing Face ID and a nearly all-screen look to the company’s tablets for the first time, people familiar with the product told Bloomberg earlier this year.Apple is planning new iPad Pros in two screen sizes — 11 inches and 12.9 inches — that will both use facial recognition for unlocking, rather than a Home button with a fingerprint sensor. The new models are also expected to include faster processors and an Apple-designed graphics chip for the first time, but will lack the more vibrant OLED screens used in the iPhone X and iPhone XS.When Apple launched the iPad in 2010, it quickly became one of the company’s most important products. However, iPad sales have slowed in recent years in favour of laptops and other larger screen devices. Apple has propped up demand with cheaper models and the more-capable iPad Pro, which works with a keyboard.Beyond tablets, the company is planning an entry-level Mac with a high-resolution screen to succeed the once-popular MacBook Air. The new Mac mini desktop will focus on professional users.The launch event continues a busy fall season for Apple, which last month released the iPhone XS, iPhone XS Max, and a new Apple Watch. The iPhone XR, a lower-cost iPhone with a nearly all-screen front, goes on sale Oct. 26.Bloomberg.com"}