{"id": "Campbell Soup 'accelerates' executive's departure after George Soros conspiracy theory tweetRetail & MarketingTop Stories", "paragraph": "October 30, 20185:54 PM EDTA Campbell Soup Co. executive who had planned to retire next month left last week instead after sharing a conspiracy theory on Twitter about a migrant caravan in Mexico, the company said Monday.Campbell said the company and the executive, Kelly Johnston, vice president of government affairs for 16 years, had agreed to “accelerate” his retirement after he said on Twitter last week that a foundation led by George Soros, the billionaire philanthropist and liberal activist, was the driving force behind a caravan of thousands of migrants headed toward Mexico’s border with the United States.Soros’ activism has made him a lightning rod for criticism among some conservatives and right-wing activists. Last week, a pipe bomb was delivered to his house in Westchester County, New York. It was one of 14 explosives sent to people who are regularly disparaged by the right. Authorities have charged an outspoken supporter of President Donald Trump with sending the bombs.On Oct. 22, Johnston shared a Twitter post about the caravan, adding a comment in which he said, “See those vans on the right? What you don’t see are the troop carriers and the rail cars taking them north. @OpenSociety planned and is executing this, including where they defecate. And they have an army of American immigration lawyers waiting at the border.”Campbell Soup said in a statement Monday that Johnston had been scheduled to leave the company in early November. “In the last few days, the company and Mr. Johnston agreed that under the current circumstances it would be best to accelerate the timing of his departure,” the company added.Johnston’s last day was Thursday, the company said.The Open Society said in a Twitter message last week, “Mr. Johnston, neither Mr. Soros nor Open Society is funding this effort. We are surprised to see a @CampbellSoupCo executive spreading false stories. We do support the historic U.S. commitment to welcoming people fleeing oppression and violence in their homelands.”Keith R. McLoughlin, Campbell Soup’s interim chief executive, wrote to Patrick Gaspard, president of Open Society Foundations, last week to tell him that Johnston’s remarks did not represent the company’s position and were “inconsistent with how Campbell approaches public debate.”“We regret that this episode happened and has coloured his service to us,” McLoughlin said in the letter, which was dated Oct. 23.Soros founded Open Society more than 30 years ago to promote democracy and human rights. He made his fortune running a hedge fund and has donated to Democratic candidates in the United States and to liberal causes.Soros has been a target of anger from right-wing groups and of anti-Semitic smears. Roseanne Barr, whose television show was cancelled by ABC after she posted a racist message on Twitter, is among those who have spread far-right conspiracy theories about Soros, accusing him of being a Nazi and wanting to overthrow the U.S. government.The conspiracy theories about Soros have been spread against a backdrop of increasing hostility toward Jews in the United States. The Anti-Defamation League said there was a 57 per cent increase in anti-Semitic incidents in the United States last year compared with 2016.On Saturday, a man who told police that he “wanted all Jews to die” killed 11 people in a rampage at a Pittsburgh synagogue.Other executives and officials have run afoul of their employers over comments on social media. In one prominent instance, CBS fired a company lawyer, Hayley Geftman-Gold, last year after she said on Facebook that the victims of a mass shooting in Las Vegas were “Republican gun toters” who did not deserve sympathy.The New York TimesCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}