{"id": "The real reason Apple’s stock is falling (and its $1 trillion valuation is at risk) Top Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.November 2, 201812:03 PM EDTApple Inc.’s decision to stop reporting how many iPhones it sells landed with a thud.As the company released fourth-quarter results Thursday, it said it would stop providing unit sales for iPhones, iPads, and Macs in fiscal 2019, a step toward becoming more of a services business. While some pundits praised the move as a way to highlight a potent new business model, many analysts complained it was an attempt to hide the pain of a stagnant smartphone market.No one saw that coming. What are they hiding?“Big companies often clam up when numbers turn sour,” said Neil Mawston, executive director of the global wireless practice at Strategy Analytics. Motorola, a once-formidable industry player, reduced public reporting of mobile phone shipments when things turned bad a few years ago, he noted.Apple analysts cut their price targets on the stock Friday, fearing weakness in the company’s most important product line after it said it would stop reporting how many iPhones it sells each quarter.The reduced disclosure “raises the specter of a sustained iPhone downturn,” wrote Nomura Instinet analyst Jeffrey Kvaal (neutral), who cut his target to US$185 from $215 (avg PT $234). Kvaal added that results in other units “were also generally uninspired,” leading him to lower his earnings expectations for the next two years.The stock was down 6.7 per cent at US$207.36 by mid-day Friday, putting the company’s US$1 trillion market valuation at risk.Apple has been praised for being one of the lone major technology companies to break out how many of each of its major products it sells each quarter. When iPhones were the hot new thing, like in 2015, it was easy for the company to tell investors it shipped 46 per cent more of the devices.Now, the smartphone market has matured and growth is harder to find. Global shipments fell 8 per cent in the third quarter, compared with a year earlier, leaving the industry “effectively in a recession,” Strategy Analytics wrote in a research note after disappointing Apple results on Thursday.Apple is trying to shift the discussion to services and recurring revenueIn its fiscal fourth quarter, Apple said iPhone unit sales were about the same as a year earlier. Starting next quarter, Apple will no longer report that number, or similar statistics for iPads and Macs. Those two product lines saw declines in unit sales.Reporting 90 days of unit sales no longer presents an accurate picture of Apple’s performance, Chief Financial Officer Luca Maestri said. Chief Executive Officer Tim Cook likened reporting unit sales of products to disclosing how many items are in a shopping cart at the grocery store versus how much the items cost.Some analysts were unimpressed. “No one saw that coming. What are they hiding?” Neil Campling, head of tech, media and telecom research at Mirabaud Securities Ltd., wrote in a note to clients.Others saw the change as a strong signal that Apple sees itself becoming more of a services business with digital subscriptions anchored to an installed base of more than 2 billion active users of its devices.“Apple is trying to shift the discussion to services and recurring revenue, because the more recurring revenue, the higher your valuation becomes,” Shannon Cross of Cross Research said.Indeed, Maestri said the company will provide more data on its Services division, such as the cost of sales. That part of the business has been growing well, powered by iCloud and Apple Music subscriptions, app downloads, and iTunes video purchases. The company is working on digital newspaper subscriptions and original video content for next year.Maestri said the company hasn’t given up on unit growth, but will focus on increasing revenue and maximizing gross profit margins. Maestri and Cook also plan to provide relevant information during future earnings announcements.Campling said that sounded like Apple will give commentary when it has good news, but not when things are bad.Still, the move is not without precedent. Apple has done it before, and other tech companies have, too — with differing results:Before the Apple Watch went on sale in 2015, the company said it wouldn’t disclose unit sales. That product is slowly turning into a hit. Starting in 2013, Apple stopped breaking out Mac revenue into both laptops and desktops. The latter product has faded in importance. The company stopped reporting iPod sales at the end of 2014. That gadget became obsolete.Semiconductor giant Intel Corp. is arguably the best example of a company that stopped giving investors precise details of how badly it was doing. For more than a decade it poured billions of dollars into mobile phone chips that failed to make a dent in the market. In 2015, Intel folded the unit into its giant personal computer processor business and has stopped reporting the numbers. Analysts had mostly given up on the mobile business by then.Cisco Systems Inc. used to disclose sales of switches and routers, its biggest product lines. In October 2017, those divisions were wrapped into a category called Infrastructure Platforms, in part to emphasize the company’s shift toward software and networking services. Analysts were suspicious at first, but Cisco was clear that the new strategy would take time and overall revenue growth has returned. The stock is up 19 per cent this year.In June, database maker Oracle Corp. stopped breaking out sales from cloud apps, platform products and infrastructure services. Some analysts worried the change would mask poor performance of its cloud-based software. Shares fell more than 7 per cent the day after the company announced the decision.With assistance from Ian King and Nico Grant.Bloomberg.com"}