{"id": "How this woman can find the extra $10,000 per year she needs to make her retirement plan workFamily FinanceTop Stories", "paragraph": "November 9, 20189:46 AM ESTLast UpdatedNovember 9, 201811:06 AM ESTSituation: Three years from retirement, woman needs to raise her savingsSolution: Grow RRSPs TFSA to use all available space, then retire at 65In Alberta, a woman we’ll call Helen, 62, makes a good living as a health care professional. She brings home $6,400 per month and has a fully paid-for townhouse with an estimated value of $280,000 and other assets of $456,000 plus a deferred profit sharing plan worth about $117,000. It’s a tidy financial picture, but Helen, mindful of the future, worries that her assets and her Old Age Security and Canada Pension Plan benefits will not support her goal of having $50,000 per year after tax in retirement. She is keenly aware that she has only three years to go to the end of her career. That’s the time left to get her financial future in order.“I want to work to age 65,” Helen explains. “What will my retirement finances look like in three years? Will I have the money for a new or newer car? For other things like travel?”(Email andrew.allentuck@gmail.com for a free Family Finance analysis.)Family Finance asked Eliott Einarson, a financial planner with Exponent Investment Management Inc. in Winnipeg, to work with Helen. “If she works another three years, her retirement savings will be sufficient for a long and financially secure retirement,” he says. “She will be much better off if she can also raise her investment returns.”Present incomeThe base for Helen’s retirement is her present annual income of $109,435 before tax plus quarterly bonuses of $2,667. Her spending is modest, about $3,300 a month with the balance of her take home income, $3,100, going to savings — $700 per month to her Registered Retirement Savings Plan and $2,500 per month to fill up Tax-Free Savings Account space. In addition, she adds six per cent of her income at source, $600 monthly, to a Deferred Profit Sharing Plan. It is matched by her employer. She has no debts.Helen’s issues are two-fold: First, she has questions about the timing of her retirement. She wonders if she will be able to generate her target of about $4,200 per month as early as age 63. She has no defined benefit work pension. Therefore, her RRSP and TFSA accounts will be critical to achieving her target income.Second, she is concerned that she is paying too much in investment management fees, and wonders if she can free up more money to spend by reducing them. Her fees are high because she has been relatively passive in buying mutual funds that are offered to her.Retirement incomeIf Helen continues to add $700 per month or $8,400 per year to her $434,000 RRSP and if the account grows at 3 per cent per year after inflation, she would have $500,986 in 2018 dollars in her RRSP in three years at age 65. In addition, if she continues to have six per cent of her income go to her DPSP plan, which is matched by her employer, for three more years at three per cent a year after inflation, it will grow from $116,764 today to $172,100, also in 2018 dollars, Einarson explains.Adding up her investment income, at retirement at age 65, she would have $673,086 of taxable assets. That capital, if spent over a 30-year period to Helen’s age 95 with a 3 per cent annual return after inflation, would generate $33,340 per year. Add in CPP at $13,610 and OAS at $7,210 per year and she would have annual total taxable income of $54,160. After average tax of 17 per cent, she would have $44,050 per year to spend.Finally if Helen adds $2,500 per month to her $22,000 TFSA account, then in about 15 months, the account will have grown to its 2019 maximum cumulative contribution limit of $63,000. In another 15 months, when Helen is 65, with $5,500 annual contributions for two years for her 64th and 65th years, the TFSA would have a balance of $85,437. That sum, if annuitized to pay out all income and principal for the next 30 years, would generate $4,360 a year. That would give her a total of about $48,400 to spend, close to her $50,000 annual target income.Closing the gapTo generate cash, Helen could trim a few expenses, though her budget is already rather lean, or cut investment management fees. With about $573,000 of financial assets to be managed, Helen could obtain independent asset management services for one to one and a half per cent per year. Her present mutual fund investments have fees averaging 2.6 per cent on equity assets. Assuming that she will pay these fees without discounts, she would be charged $14,890 per year. If she were to pay one per cent of assets under management, her fees would be about $5,730 a year. The difference, $9,160 per year, would not just close the gap, but would push her disposable income to nearly $58,000 per year. Higher advisory fees would reduce her net return. If she were to pay as much as 1.5 per cent, her management cost would be $8,595, still a reduction from estimated present fees for a potential annual saving of $6,295. If Helen chooses to take control of her investments, she could reduce the amount her manager handles and cut fees in that fashion, Einarson says.There would also be clarity, for unlike some mutual fund distributions, which may include returns of capital, Helen would have transparent accounts with more tax visibility, would have trades for her needs rather than the needs or preferences of other unit holders who may want cash in a downturn or have a desire for risky stocks when markets are rising. Her manager would trigger sales to realize cash or make investments based on her own life expectancy, for example. The alternative to study capital markets and grow into the task of managing her financial assets is hers. She has the aptitude to do it, Einarson says.Three years more work and improved investment returns will give her a secure foundation in her RRSP, her Deferred Profit Sharing Plan, and in what is now going to be an aggressively funded TFSA, Einarson notes. That’s the key to the discretionary spending she wants.“Helen is bright, focused, and fully in charge of her future,” Einarson says. “If she makes the adjustments we have suggested, her future can be fulfilling in that she has the base for a comfortable life after work.”Retirement stars: Three *** out of fiveFinancial PostE-mail andrew.allentuck@gmail.com for a free Family Finance analysis.-2°CA few cloudsFeels like -4°CCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}