{"id": "Bank of Canada inches closer to normal with rate hike — and signals more to comeEconomyTop Stories", "paragraph": "October 24, 20182:56 PM EDTLast UpdatedOctober 24, 20184:26 PM EDTThe Bank of Canada can finally see “home” on the horizon.Governor Stephen Poloz and his deputies on the Governing Council raised the benchmark interest rate a quarter-point to 1.75 per cent on Wednesday, as expected.They said they feel pretty good about the economy, now that politicians in Canada, Mexico, and the United States have agreed on a revised trade agreement, and that evidence suggests households are adjusting well to higher borrowing costs. Policy makers raised their outlook for business investment and exports, suggesting the economy is becoming less reliant on debt-fuelled spending and the housing market.“The Canadian economy continues to operate near its capacity, and growth is relatively broad-based across sectors and regions,” Carolyn Wilkins, the senior deputy governor, said at a press conference in Ottawa. “What stands out is that, even with today’s increase … monetary policy remains stimulative.”Wilkins’s emphasis on the still-low level of borrowing costs was a reminder that the public needn’t panic at the sight of marginally higher interest rates, and a gentle warning that no one should expect interest rates to stay at this level.The economy is growing a little faster than the Bank of Canada predicted a few months ago, and “vulnerabilities” from elevated levels of household debt are “edging lower,” it said. Policy makers reiterated that interest rates must rise, and for the first time offered a more definitive notion of where it wants to go.“Governing Council agrees that the policy interest rate will need to rise to a neutral stance to achieve the inflation target,” the bank said in a statement explaining the latest policy decision.Poloz, who took over as the governor of Canada’s central bank in 2014, has talked wistfully about returning interest rates to a level that economists associate with normal, a place where the cost of money is neither stimulating expansion nor curbing growth. The central bank estimates that “neutral” interest rate — which Poloz has characterized as “home” — is something between 2.5 per cent and 3.5 per cent.There will be a debate on Bay Street and Wall Street about how fast the Bank of Canada wants to close the gap between the neutral rate and the current setting. Analysts tended to call the central bank’s latest communication “hawkish,” a widely used term that implies the central bank is more apt to raise interest rates than to cut them or leave them unchanged. The value of the dollar jumped in the minutes following the release of the policy statement, as traders noticed that “gradual” had been dropped from the text. Policy makers had used that modifier in three consecutive policy statements to make sure the public knew that the economy was facing a lot of headwinds.There will be a temptation to assume the central bank’s decision to take out the eraser is a signal that interest-rate increases will become more frequent. In fact, the Bank of Canada’s outlook is about the same as it was a few weeks ago; if there’s a shift, it’s that policy makers are more confident that outlook will come true.More likely, Poloz, who has made a point of avoiding explicit guidance, wanted to keep investors and others from reverting to their old habits of putting textual analysis ahead of number crunching. The new policy statement says the pace of interest-rate increases will be determined by “how the economy is adjusting to higher interest rates, given the elevated level of household debt” and “global trade policy developments.” The resolution of the North American trade dispute is a relief, but the central bank expressed heightened concern of the U.S. trade war with China.“You may have noticed that we have not used the word ‘gradual’ to describe the pace of policy adjustments,” Wilkins said. “This is to avoid the impression that we are following a preordained, mechanical path.”Poloz acknowledged that the new wording gives the Governing Council more flexibility, but that he and his lieutenants have no idea how they will use that maneuverability. He said he was prompted to make the change because the Street had come to associate “gradual” with an increase every couple of meetings. “This is serving notice that it could be faster or it could be slower,” Poloz said.That’s probably right. The numbers suggest interest rates could be higher, but that understanding of how the economy works is based on periods when household debt was much lower than it is now. The central bank went out of its way to say that even though it’s comfortable with the way Canadians are adjusting to higher borrowing costs, household vulnerabilities “remain elevated.” Wilkins also said stronger business investment probably means the economy has more capacity to produce inflation-free growth. If so, the central bank’s path “home” could still be gradual, although policy makers might refrain from calling it that.“It’s amazing how markets can focus on one word,” Tom O’Gorman, director of fixed income at Franklin Bissett Investment Management in Calgary, said. “They are going to be data dependent and that makes sense.”• Email: kcarmichael@nationalpost.com | Twitter: carmichaelkevinWe want to improve your reading experienceCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}