{"id": "Stocks are rising around the world after report Trump has asked for draft of China trade dealInvestingTop Stories", "paragraph": "November 2, 20188:42 AM EDTStocks extended gains globally, Treasuries dropped and the dollar fell on Friday as a buoyant mood swept markets on the back of fresh hopes for trade between the world’s two biggest economies.U.S. equity-index futures advanced even as shares of Apple Inc. dropped in pre-market trading after underwhelming sales forecasts. The Stoxx Europe 600 Index headed for its best week in two years, with carmakers and basic resources leading the charge. Stocks from Hong Kong to Tokyo surged, taking gains on the MSCI Asia Pacific Index to 5 per cent for the week. Emerging-market equities jumped the most since March 2016, while currencies from South Korea to Australia joined the rally. The euro gained even as a drop in Italian manufacturing dragged the region’s PMI to a two-year low. Italy’s bonds climbed.The boost to sentiment came after Bloomberg News reported U.S. President Donald Trump is interested in reaching an agreement on trade with Chinese President Xi Jinping at the Group of 20 nations summit in Argentina this month, and has asked key officials to begin drafting potential terms.Prospects for easing protectionist tensions are helping round out a week that’s seen appetite for risk assets return following the October rout in equities. Doubts remain, though, on the capacity of earnings to deliver. Apple’s disappointing forecast for the key holiday period suggested weaker-than-expected demand for the company’s pricier new iPhones. Next up is the U.S. jobs report for October later Friday, while investors are also looking ahead to mid-term elections next week.“Either President Trump is paving the way for a trade deal being agreed at the Buenos Aires G-20 summit later this month, or he’s cynically driving up equity indices ahead of U.S. mid-terms,” said Kit Juckes, the London-based global fixed-income strategist at Societe Generale SA. “What’s for sure, is that talk of a trade deal has added further juice to the last few day’s risk appetite.”Talks between the U.S. and China may not be straightforward, with intellectual property theft still a stumbling block. A Chinese state-owned company was charged Thursday with conspiring to steal trade secrets from American chipmaker Micron Technology Inc. as the Justice Department steps up actions against the Asian nation in cases of suspected economic espionage.Meanwhile, WTI extended a decline as fears over a supply disruption eased after the U.S. was said to agree on giving waivers to eight nations to continue importing Iranian crude. Bloomberg’s gauge of industrial metals extended a rebound from a 15-month low as copper, zinc and nickel led gains in other raw materials.Here are the main moves in markets:The Stoxx Europe 600 Index advanced 1.2 per cent as of 7:50 a.m. New York time, hitting the highest in more than three weeks with its fifth consecutive advance. Futures on the S&P 500 Index gained 1 per cent to the highest in two weeks. The MSCI All-Country World Index climbed 0.9 per cent to the highest in two weeks. The U.K.’s FTSE 100 Index increased 0.9 per cent, and Germany’s DAX Index climbed 1.7 per cent. The MSCI Emerging Market Index jumped 3.1 per cent to the highest in more than four weeks on the largest surge in more than two years.The Bloomberg Dollar Spot Index declined 0.3 per cent to the lowest in more than a week. The euro advanced 0.4 per cent to $1.1449, the strongest in more than a week. The British pound climbed 0.1 per cent to $1.3019. The Japanese yen dipped 0.2 per cent to 112.89 per dollar.The yield on 10-year Treasuries advanced three basis points to 3.16 per cent, the highest in more than a week. Germany’s 10-year yield advanced three basis points to 0.43 per cent. Britain’s 10-year yield increased three basis points to 1.484 per cent. Japan’s 10-year yield climbed one basis point to 0.129 per cent.West Texas Intermediate crude dipped 0.2 per cent to US$63.54 a barrel, hitting the lowest in 20 weeks with its fifth straight decline. Gold climbed 0.2 per cent to US$1,235.42 an ounce, the highest in more than 15 weeks. Copper increased 2.5 per cent to $2.79 a pound, the highest in three weeks on the largest climb in six weeks.Bloomberg.comThis content was provided by Market One for commercial purposes."}