{"id": "Tim Hortons grows Canadian sales amid efforts to fix rocky relationship with franchiseesRetail & MarketingTop Stories", "paragraph": "October 24, 20187:17 AM EDTLast UpdatedOctober 24, 20183:49 PM EDTThe parent company of Tim Hortons saw sales growth at Canadian locations of the coffee-and-doughnut chain as executives say their work to mend fraught franchisee relations is paying off, though more work remains.Restaurant Brands International Inc. is pleased with the Canadian results, said CEO Daniel Schwartz in an interview with The Canadian Press.Sales at Tim Hortons restaurants in Canada open for 13 months or more, a key retail metric, increased 0.9 per cent in the quarter ending September 30, according to the company’s third-quarter earnings report. That’s up from 0.6 per cent in the same quarter the previous year and outpaces the system-wide growth of 0.6 per cent, which includes restaurants outside of Canada, for the current quarter.Executive changes, including hiring Duncan Fulton as chief corporate officer in July, and initiatives from the company’s “Winning Together” brand plan helped, said Schwartz.He highlighted the launch of all-day breakfast nationwide in late July as adding incremental sales and profitability.The plan also includes renovating restaurants — a $700-million investment that adds open-concept seating. The company has completed about 100 renovations to date, and plans to do hundreds more in the fourth quarter.“These improved results don’t even reflect several of the initiatives that we have not yet launched,” he said.Tim Hortons will add a kids’ menu this quarter, he said.The company also plans to launch a loyalty program nationwide sometime in the first half of 2019, said Tim Hortons president Alex Macedo. The program, dubbed coffee pass, is already being tested in two cities and the trial will expand to several others.Self-service kiosks, which are already present at some locations in and around the Greater Toronto Area, will start to roll out more broadly early next year, he said.The U.S. market was a little softer, said Schwartz, adding the brand’s team is disproportionately focused on getting Canada in the right place due to the size of the Canadian business, as well as “everything that was going on in Canada.”The chain has grappled with an unsanctioned group of franchisees who formed the Great White North Franchisee Association in an effort to remedy alleged mismanagement of the brand. The group has claimed to represent more than half of Canadian Tim Hortons franchisees and launched multiple lawsuits against RBI, its subsidiaries and several executives. RBI also launched its own lawsuits against the group and some of its members.In recent months, two prominent GWNFA members, its former president David Hughes and Mark Kuziora, left the company. The group has been fairly silent since late August when it alleged the coffee pots franchisees are required to purchase and use have been shattering and injuring employees. RBI and the manufacturer denied allegations they had changed how they make or source the pots.The GWNFA’s membership is “still well above” half, said spokeswoman Patti Jameson in an email, adding the group has a new president.In the past, RBI executives refused to speak with the group, but later admitted they could have better handled franchisee relations and made more of an effort to engage franchisees, including in building the “Winning Together” plan.“We still have some room to go to work even better with the restaurant owners but I think the confidence is starting to be built,” said Macedo, adding the company’s decision to listen more, as well as give and receive feedback faster has helped it execute the plan.Sales at the company’s other two chains, Burger King and Popeyes Louisiana Kitchen, also grew, lifting RBI’s third-quarter profit.The company’s profit attributable to shareholders totalled US$133.6 million or 53 cents per diluted share, up from $91.4 million or 37 cents per diluted share a year ago. The Oakville, Ont.,-based company keeps its books in U.S. dollars.Revenue totalled $1.38 billion, up from $1.21 billion in the same quarter last year.Burger King’s comparable-store sales increased 1.0 per cent, while Popeyes Louisiana Kitchen saw comparable-store sales improve 0.5 per cent.On an adjusted basis, RBI earned 63 cents per diluted share for the quarter, compared to 58 cents per diluted share a year ago. Analysts expected a profit of 65 cents per share, according to Thomson Reuters Eikon.Calculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}