{"id": "Ditch the dog walker and sell the house: Couple with too much debt must learn to live within meansFamily FinanceTop Stories", "paragraph": "October 19, 201811:37 AM EDTLast UpdatedOctober 19, 201812:56 PM EDTSituation: Spending exceeds income, debt service takes 44 per cent of budget, savings inadequateSolution: Sell house and rent, direct discretionary income to paying down debt, cut spendingA couple we’ll call Sam and Susie, both 50, live in Ontario with their two children, who are in university. The parents work in high tech and bring home $7,068 per month, but they are in trouble. They owe $550,630 including their $496,591 home mortgage. They are also spending all their income and then some, with their monthly allocations topping $7,500, including meager $100 contributions to their RRSPs.(Email andrew.allentuck@gmail.com for a free family Finance analysis.)Family Finance asked Guy Anderson, a financial planner with Parkview Financial Inc. in Toronto, to work with Sam and Susie. “Overspending will cripple their way of life,” Anderson says. “They need to slash debt.”The dilemmaThe couple’s current monthly budget allots $2,459 for their home mortgage and other costs for servicing unsecured debts. Altogether they spend 44 per cent of their monthly take home income on mortgage payments and servicing loans, while other expenses, such $200 per month for dog walking, add up quickly.Drastic budget surgery is in order. First, they must cut expenses. $2,400 a year to walk the dog is out — maybe a neighbour can do it for less. They have critical illness insurance and other insurance policies that cost them an astonishing $800 per month or $9,600 per year. If they cut that by half down to basic coverage for death, they can save $4,800 a year. Redirect the $5,000 tax refund they give to their children to help with post-secondary studies — summer jobs can fill the gap — and they would have $12,200 of annual savings. That’s $1,017 per month. It should go to retirement savings, Anderson says.Debt managementThe couple spends $33 per month on a 12 per cent credit card debt of $2,751, $150 per month on an $18,989 unsecured line of credit at 8.2 per cent, and $500 per month on a $32,319 secured line of credit at 5.2 per cent. That’s a total of $683 per month. They need more cash for payments and a plan to slash interest expense.They can raise $150 per month by finding a new supplier of phone and internet services for which they now pay $356 per month. That money can go to debt reduction.Their highest interest loan is their $2,751 unsecured credit card loan with 11.99 per cent annual interest. Boosting their existing paydown of $33 per month by $150, they will have paid the balance in full in 15 months.Next, tackle the $18,969 unsecured line of credit at 8.2 per cent interest. In 15 months, the loan should have a balance of about $16,700. Now apply $183 from the first loan paydown to the existing $150 monthly paydown for a total of $363 per month or $4,356 per year. At this rate, it will be paid off in another four years.The largest balance outstanding, $32,319, has the lowest interest rate, 5.2 per cent. With no further action and continued $500 monthly payments it will be paid in full in about 5 ½ years. Sam and Susie will be 56. $683 per month or $8,196 per year of previous debt service payments can now go to retirement savings. RRSP refunds will lower tax brackets and eventually make TFSAs more attractive.Sam and Susie must also liberate capital. Their house has a value of $640,000. If they sell and get 95 per cent of the price after commissions or other selling costs, they will walk away with $608,000. If they then pay off their $496,591 mortgage, they will have about $111,409 left. Adjusted for mortgage prepayment penalties, moving costs and needed repairs before sale, they would have $100,000 cash. The current mortgage payment, $2,459, can cover rent in an apartment or townhouse.Retirement planningThe $100,000 captured — we’ll assume this happens within a year — can go to retirement savings.Their existing RRSP savings from previous jobs total $82,606. To that they already contribute $100 per month, and will have freed up an additional $1,017 per month from spending cuts and $683 from debt service payments they no longer have to make, for a total contribution of $1,800 per month.This strategy will lift present RRSP balances of $82,606 to $520,500 at their age 65. This sum, paid out for 30 years at 3 per cent after inflation to exhaust all capital and interest would generate about $25,800 per year.Susie also saves through a work-based defined contribution plan. She has a new job that matches her three per cent of gross income. Her gross income is $4,040 per month and her combined personal and company contributions are therefore $2,908 per year. In 16 years when she is 65, and assuming that her RRSP grows at 3 per cent per year after inflation, her balance will be $56,600. That sum will support payouts of $2,800 per year for 30 years.At 65, Sam can expect $696 per month or $8,352 per year per month from the Canada Pension Plan and Susie, at 65, can expect $466 per month or $5,592 per year from CPP. Each will receive an Old Age Security benefit of $7,065 for having been resident in Canada for 39 of the 40 years after age 18 required to receive full OAS benefits.Adding it up, their total annual income when both are 65 will be about $56,854 per year. With age credits and splits of eligible pension income, after 10 per cent average tax they would have $4,260 per month to spend. They would be debt-free and, with only rent and some utilities to pay, about $3,000 per month, they would have $1,260 per month and any TFSA balances for discretionary spending.“The irony is that our couple has invested in more life insurance than they are likely to need and invested less in retirement savings that they must have,” Anderson explains. “If they sell a house they cannot afford, rent what they can afford, and pay all debts, they will get to age 65 and have modest but adequate retirement income and security.”Retirement stars: 1 * out of 5Financial PostE-mail andrew.allentuck@gmail.com for a free Family Finance analysis.-2°CA few cloudsFeels like -4°CCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}