{"id": "Rate hikes to cost Canadian households $2,500 each year — but it isn't uncharted territory: reportEconomyTop Stories", "paragraph": "October 24, 20184:47 PM EDTCanadian debt holders — especially millennials — may see their savings and discretionary spending under pressure as the Bank of Canada announced it would be hiking interest rates to 1.75 per cent, according to an Environics Analytics study.Canada’s central bank raised interest rates by a quarter point — marking the fifth time it has  done so since the summer of July 2017. Canadian interest rates have remained relatively low since the global recession in 2008 as the bank attempted to stimulate the economy. But now the bank is more optimistic about the economy, pointing to the USMCA trade deal signed with the U.S. and Mexico on Sept. 30.Rising interest rates may mean that mortgage and non-mortgage debt-holders “are starting to feel the pinch,” Environics research associate Isanna Biglands and senior vice president of research and development Peter Miron wrote.“Over the past 10 years Canadian debt holders haven’t had much reason to fret about interest rates, but they may now,” they wrote.In 2017, the average Canadian household only paid an additional $286 of their discretionary income — what’s left of household income after deducting personal taxes, shelter and food. While most may not notice spending an additional 0.57 per cent, that number isn’t completely accurate, according to the study. The full-year effect of the hikes actually means that Canadians would’ve been spending, on average, an additional $686.When the 2018 hikes are taken into consideration, the average Canadian household will actually be spending an additional $1,715. The study notes, however, that the full effect of the hikes can only be determined after five years. In that event, the cost rises to $2,516 per household per year, which equals five per cent of discretionary income.The Bank of Canada says that while it’s not dismissive of the difficult adjustment for those who will be renewing their mortgages at higher interest rates, it had been laying the ground for quite a while.“It’s precisely why we have put in place a two percentage point stress test for getting a new mortgage,” Bank of Canada governor Stephen Poloz said at a press conference Wednesday. “Because everybody knew interest rates were lower than they would end up being, so it made perfect sense. We advocated it for quite a long time before it became practice — that people should be self testing.”While baby boomers may see a boost in discretionary spending because of the rate hikes, millennials and members of Generation X may face the worst consequences. According to the study, debt holders that belong to mid-affluent suburban areas of Canada — social groups that the authors call “suburban upscale diverse” and “suburban younger” — will be impacted significantly.The study defines these areas as being of “new development on the edge of major cities,” where most first-time homeowners and younger families would be living. Unlike baby boomers, millennials living in these areas haven’t spent years building savings accounts.“These younger families have not had time to build up their capital and will find their consumption and savings rates pinched, particularly by the increased interest payments on their higher mortgage balances,” Biglands and Miron wrote.Urban social groups, meanwhile, won’t see much of a difference because of lower levels of home ownership. The groups that the study said is most “insulated” from the rate hikes are those it defines as being Francophone. This is because the homes in these areas have appreciated very little over the years and as a result, owners haven’t seen increased mortgage debts.It’s not all bad, though, Biglands and Miron wrote. Higher interest rates are a sign of a stronger economy, which should in turn result in higher household incomes.“Additionally, even when fully factoring in the five interest rate increases observed so far, the debt service ratio is still only at pre-financial crisis levels; this is not uncharted territory,” they wrote.Email: vferreira@nationalpost.com | Twitter: VicF77We want to improve your reading experienceCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}