{"id": "Bank of Canada widely expected to hike rates today — but what happens then?EconomyTop Stories", "paragraph": "October 24, 20187:18 AM EDTBank of Canada Governor Stephen Poloz will resume hiking interest rates Wednesday as the country’s new trade deal with the U.S. and Mexico eliminates what was probably the biggest risk to the economy.All 23 economists surveyed by Bloomberg predict Poloz will lift the key rate a quarter percentage point to 1.75 per cent at a decision in Ottawa. It would be the third increase this year and the fifth since the central bank began raising rates last year. The decision will be accompanied by new forecasts that are likely to show an improving outlook.Policy makers are determined to return the nation’s historically low borrowing costs to more normal levels, as a run of strong data suggests the economy is coping with higher rates. It’s a confidence that has only increased since Prime Minister Justin Trudeau reached the last-minute agreement with President Donald Trump last month.“The uncertainty related to NAFTA was a key road block in preventing a hike this week,” said Ian Pollick, head of rates strategy at Canadian Imperial Bank of Commerce. The pact “has effectively sealed the deal for the third interest rate hike of 2018.”The increase would also put the Bank Canada more in sync with the Federal Reserve, which has raised rates three times this year as well — making the two central banks easily the most hawkish in the Group of Seven.Still, borrowing costs remain low compared with historical levels. Indeed, the policy rate remains below the rate of inflation — an abnormal situation for an economy that is running up against capacity constraints.Even so, Bank of Canada officials have taken pains to make clear they will proceed only gradually given major risks to the outlook, including lingering trade tensions and the impact of higher rates on indebted households. In practice, that has meant increases about once a quarter.There is some speculation Poloz may choose to accelerate that schedule now that the trade deal is signed, though the market consensus is that it simply cements the existing path. Swaps trading suggests four more rate increases — including one on Wednesday — by the end of next year. That would bring the policy rate to 2.5 per cent, where the hiking cycle is expected to end.A 2.5 per cent rate would only bring borrowing costs to the bottom end of what is the Bank of Canada’s best guess of the “neutral” rate — a level that is neither stimulative or contractionary. The central bank estimates this rate could be as high as 3.5 per cent, meaning there could be scope for even more increases beyond the four expected by investors.Jean-Francois Perrault, chief economist at Bank of Nova Scotia, says the market may be underestimating the extent of the cycle. He cites “serious” capacity constraints and a favorable outlook stoked by a strong U.S. economy and poised to get a boost from the new Royal Dutch Shell Plc-led natural gas project in British Columbia.“These outcomes should push Canada into modest excess demand through 2019,” Perrault said in an Oct. 15 quarterly forecast, predicting the policy rate will rise to as high as 3 per cent.The central bank has acknowledged its models say it’s behind the curve. At the September decision, policy makers even debated the possibility of removing the word gradual from their rate statements.But high household debt will continue to be a constraint, as will recent developments that have seen a collapse in Canadian oil prices relative to world prices. A strengthening Canadian dollar is another reason for Poloz to be wary of raising much above 2 per cent, according to CIBC’s Pollick.“We see them going in October and January and then they’re done,” Pollick said. “That’s the tightening cycle.”Bloomberg.comWe want to improve your reading experience"}