{"id": "Pfizer, Bain form startup focusing on central nervous disordersFP StartupsTop Stories", "paragraph": "October 23, 20183:20 PM EDTLast UpdatedOctober 25, 20182:40 PM EDTPfizer Inc. and Bain Capital LP and are launching a neuroscience startup with US$350 million in funding to focus on finding treatments for Alzheimer’s, Parkinson’s and other disorders of the central nervous system.Pfizer will get a 25 per cent stake in the Boston-based venture, called Cerevel Therapeutics, the two companies said this week. The New York-based drugmaker will contribute a portfolio of compounds that are in various stages of development, including three in clinical testing.Pfizer has been cutting its in-house neuroscience efforts while investing in outside ventures. The pharmaceutical giant ended its neuroscience research earlier this year, calling the move “an extremely difficult decision.” But its venture unit has since dedicated US$150 million, a quarter of its available capital, to investments in early-stage neuroscience companies like System1 Biosciences Inc. and Magnolia Neurosciences Corp.Pfizer didn’t allocate any cash to Cerevel, according to Patricia Kelly, senior director of communications for Pfizer.The most advanced assets in the Cerevel portfolio from Pfizer are a treatment for symptoms of Parkinson’s disease nearing late-stage trials, and a drug for epilepsy in mid-stage testing.It’s not the first time a large pharmaceutical company has off-loaded products in the R&D pipeline to a smaller venture that can provide more focused attention to them. Many drugmakers routinely comb through their shelves for compounds to out-license.In other cases, they’ve spun out whole divisions, forming major new businesses. AbbVie was spun off from Abbott Laboratories in 2012 to focus on drug development and research. In 2016, Biogen Inc. announced Bioverative, a spinoff, would house its hemophilia business.Morris Birnbaum, Pfizer’s chief scientific officer of internal medicine, and Doug Giordano, senior vice-president of worldwide business development, will serve on Cerevel’s board of directors. Adam Koppel and Chris Gordon, managing directors at Bain Capital, will also take seats on the board.Bain didn’t immediately respond to a request for comment."}