{"id": "Canada’s inflation drops sharply, easing rate hike pressureEconomyTop Stories", "paragraph": "October 19, 20189:14 AM EDTCanadian inflation unexpectedly tumbled in September on a sharp reversal of price hikes in the travel industry, which should knock down concerns that pressures are building in an economy near full capacity.The consumer price index recorded an annual pace of 2.2 per cent, the lowest in four months and a drop from 2.8 per cent in August, Statistics Canada reported. Economists had expected inflation of 2.7 per cent. Core measures of inflation — considered a better indicator of underlying pressures — also ticked lower and averaged 2 per cent last month.Slower headline inflation and easing core numbers will reassure policy makers the recent spike in gasoline prices and other products like air transportation is transitory. The 2 per cent core rate is consistent with an economy at full capacity — but not one that is overheating and that should give the Bank of Canada scope to proceed with gradual interest-rate increases.Inflation had hit 3 per cent in July — the highest in seven years — on the back of gasoline and a jump in prices for air transportation and other travel-related services.Air transportation costs, which jumped 16 per cent in July, plunged 17 per cent in September. Traveller accommodation service prices were down 6.2 per cent last month. Statistics Canada has changed the methodology in measuring prices in that sector that is capturing more of the seasonal variation in costs.In its most recent forecasts released in July, the central bank estimated inflation would average 2.5 per cent in the third quarter — which ends in September — before returning back to near the 2 per cent target by 2019. Inflation actually averaged 2.7 per cent in the third quarter.• Monthly inflation dropped 0.4 per cent in September, versus analyst expectations for a 0.1 per cent gain. It’s the largest monthly drop this year and the first back-to-back monthly declines since 2016 after prices fell 0.1 per cent in August• On a seasonally adjusted basis, prices were down 0.1 per cent, the first month over month drop since May 2017All three measures of core inflation fell. The “common” rate dropped to 1.9 per cent from 2.0 per cent, the “median” declined to 2.0 per cent from 2.1 per cent and the “trim” rate fell to 2.1 per cent from 2.2 per cent• Gasoline prices were down 1.1 per cent in September from August, paring year-over-year gains to 12 per cent. Excluding gasoline, annual inflation in Canada was 1.9 per centBloomberg.comWe want to improve your reading experience"}