{"id": "How to build your small business credit score — and keep it highSmall BusinessTop Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.November 1, 20181:41 PM EDTSmall businesses are often those that need credit the most as they finance future growth, yet they can also find it hardest to get. In its forthcoming 2018 Small Business Industry Insights Report, credit agency TransUnion will reveal that many small businesses still have trouble accessing credit, resulting in many tapping into their own personal assets as additional sources of financing.How can small business owners increase their ability to get credit and finance their business during the difficult early years? Credit experts offer some tips.Don’t mix personal and business creditKeep business and personal finances separate so that one doesn’t pollute the other. This also means keeping business credit separate from personal credit. “Do not co-mingle the two,” warns Pamela Dodaro, executive director of business solutions at credit ratings agency TransUnion Canada. “Manage them as two separate credit lines if you’re able to do so. It’s best to keep your personal credit health and your business credit health separate,” she says.This means not using the business to finance personal loans, which could create problems when going for business financing. Conversely, avoid using personal credit to finance business expansions.One way to help keep business and personal credit separate is to get a small business credit card. This will enable you to track business expenses separately, and paying it off monthly is also a good way to build better business credit.Keep your consumer credit in good standingWhile business owners must view their personal credit separately from the business, lenders often do not. “Historically, consumer credit has been used as a proxy because there has really been historically no one-source credit footprint for small business lending,” says Dodaro.This means problems with your personal credit could show up when asking for business loans, and it’s another reason to keep business and personal credit separate. “If you’re over-leveraging your personal credit, those lenders who are making business lending decisions based on your personal credit may not see you as creditworthy,” she adds.The Government of Canada advises people to keep their personal credit healthy by building a long credit history, which you can do by keeping a credit card open and active for a long time. You can also maintain a good credit rating by limiting the amount of your credit capacity that you use to no more than 35 per cent, it says.Limiting the number of “hard hits” on your credit report, such as credit card applications or credit checks, is also important. If lenders see too many checks in a short period, they may think you’re urgently trying to get credit, which can raise red flags. If you’re shopping around for a mortgage or car loan, try to get quotes from lenders within a two-week period so that they are combined and treated as a single inquiry for your credit score.Get your credit reportBefore improving your credit rating, you need to know what it is. Get a copy of your personal credit report to see if you’re in good standing and to correct any inaccuracies on it. Do the same for your business by talking to credit agencies such as TransUnion and Equifax.Look after your cash flowJust as paying your bills on time is important when keeping your personal credit score up, keeping your cash flow on track and covering all your payments is the single most important factor in keeping your business credit rating high. Neil Wechlser, CEO at small business lender Evolocity Financial Group, lends on cash flow rather than collateral, and has an intimate knowledge of business finances.“We look for small business borrowers that don’t have NSFs in their history,” he says. Non-sufficient funds are payment accounts that don’t have enough money to cover transactions. Bounced cheques are a good example of an NSF.Managing cash flow properly includes setting enough money aside for business taxes, and dealing with Canada Revenue quickly and assertively if you see your business tax situation going sideways. It’s better to work out a payment plan with the CRA for taxes owed, than to wait for the agency to freeze your finances.“Frozen bank accounts are a bad thing for people like us, because we get paid by debiting bank accounts,” Wechsler says, adding that evidence of a frozen account would generally prompt a decline.“Your suppliers are critical to the financial health of your business. If you can’t afford to pay your suppliers on time, you may not be able to produce your productPay your suppliersYou may pay down your business credit card, your commercial loans and your taxes, but don’t slip up when paying suppliers, says Dodaro.Credit agencies like TransUnion get information on late payers from industry associations across Canada, which in turn get it from their members. Late or missing payments will eventually show up on your business credit score.“Your suppliers are critical to the financial health of your business,” she says, adding that late payments are a red flag for business lenders. “If you can’t afford to pay your suppliers on time, then you may not be able to produce your product.”Ask for trade creditIt may be possible to avoid paying suppliers immediately and actually use this to boost your credit rating by asking for trade credit. This stipulates an interest-free grace period before paying for goods and services, and the typical 30-day payment terms seen on many business invoices are a form of trade credit.By asking for a formal trade credit agreement you can offset payments and free up cash flow while remaining in good standing with your supplier. If the supplier reports healthy use of the arrangement to credit agencies (known as a trade line) it can help your company’s credit standing.Small businesses may be nervous about applying for credit, and assume that they cannot get it. In reality, success rates are higher than you might think. According to the Statistics Canada 2017 Survey on Financing and Growth of Small and Medium Enterprises, 87 per cent of all SMEs applying for debt financing from financial institutions were approved. With these tips, very small businesses can increases their chances of being among them."}