{"id": "Goldilocks has left the building, David Rosenberg warns, so best get readyInvestingTop Stories", "paragraph": "October 24, 20189:36 AM EDTThe best place to pick up the pieces from the end of the U.S. bull market will be in the credit market, according to David Rosenberg.“There will be a lot of money to be made in the corporate bond market where the price dislocations versus the fundamentals are far more out of whack than they are in the equity market,” said Rosenberg, chief strategist at Toronto-based Gluskin Sheff & Associates Inc., which manages $8.9 billion. “Get ready to pounce on the massive volume of BBB bonds that will be downgraded into non-investment grade status.”Inflation and the Fed have ended every single bull market and economic expansion in the modern eraTo know that the end of the bull market is here, one only needs to look at the two-year Treasury note, the “quintessential leading indicator of the market,” said Rosenberg, former chief North America economist for Merrill Lynch during the financial crisis. The near doubling of yields to just under 3 per cent over the past year is a clear signal the U.S. economy, stock market and credit market have peaked and a recession is likely on the way, he said.“We are scraping the bottom of the barrel on the pool of available labour. That is inflationary,” Rosenberg said in an interview Tuesday as equities plunged, before paring losses later in the day. “Inflation and the Fed have ended every single bull market and economic expansion in the modern era.”Tax cuts, deregulation and easy money are behind the markets, he said. “What’s left are tariffs and trade barriers and a high degree of political uncertainty layered on top of that, and a Fed chairperson with a slightly hawkish bent.”It’s hard to say when the next recession will hit but Rosenberg says he’s building a base case for the second half of next year. He recommends investors stand ready to take advantage of a “renewed, dramatic widening in credit spreads,” and be defensive in stocks, including utilities and consumer staples. Financials however “offer good value now.”He favours companies with low cyclicality, high earnings visibility and high capital-labor ratios that won’t suffer margin compression from rising costs. “It’s more about style than price points,” he said, declining to give a target for U.S. stock markets. Investors should cull their portfolios, remain highly defensive and focus on liquidity.Gluskin Sheff’s balanced funds are at about 50 per cent equity, 15 per cent equity alternatives and 35 per cent fixed income and its risk average portfolios are at 40 per cent equities and 60 per cent fixed income, Rosenberg said.Bloomberg.comThis content was provided by Market One for commercial purposes."}