{"id": "Canadian Natural slams rivals and 'dysfunctional' regulatory environment for heavy oil discountsInvestingTop Stories", "paragraph": "November 1, 20182:40 PM EDTLast UpdatedNovember 2, 20181:38 PM EDTThe knives are out in the oilpatch as Canadian companies plan to cut production as the industry is forced to sell its oil at a third of global market prices.Canadian Natural Resources Ltd., the country’s largest oil producer, said it will “strategically shift capital, curtail volumes, shut in production and delay completion of recently drilled crude oil wells,” due to lack of market access for its oil, regulatory uncertainty, lack of fiscal competitiveness and rivals that are exacerbating the country’s stressed pipeline takeaway capacity.Clearly some parties who capture windfall revenues at the expense of Alberta citizens and Alberta producers are determined to continue to capture windfall revenueThe company plans to reduce 10,000 to 15,000 bpd of heavy crude oil production in October and is targeting 45,000 to 55,000 bpd in November and December, in response to wide differentials. The company also reduced its 2018 production outlook in its North American segment as it announced its third-quarter earnings results Thursday.“Market access for lack of takeaway capacity is a major driver of the current Canadian pricing,” Tim KcKay, chief operating officer at Canadian Natural told analysts in a conference call. “Root cause for the lack of takeaway capacity is Canada’s dysfunctional regulatory, legal and political systems that allow endless delays to be put forward by minor distractors.”The company also blamed the nomination process on pipelines “that’s ineffective and creates further distortions in the market.”“Canadian Natural is working with producers in the crude oil logistics committee to optimize the nomination process,” McKay said. “It is taking some time as clearly some parties who capture windfall revenues at the expense of Alberta citizens and Alberta producers are determined to continue to capture windfall revenue.”MEG Energy Inc. said it also plans to reduce its fourth quarter production by 4,000 to 6,000 bpd and is advancing a portion of its 2019 scheduled maintenance programme in November.“MEG plans to mitigate exposure to the differential through increased use of rail and inventory management,” the company said in its quarterly earnings statement Thursday.MEG, which is fighting to stave off a bid from Husky Energy Inc., sold around 31 per cent of blend volumes in the U.S. Gulf Coast in the third quarter, capturing higher prices.To get around the issue of choked pipelines, MEG recently secured a three-year agreement to ship 30,000 bpd at Cenovus Energy Inc.’s Bruderheim terminal.MEG expects the Western Canada Select differentials to moderate into the high to low US$20s through 2019 as Canadian rail export volumes increase significantly and PADD II refineries come back online “after what has been the largest turnaround season in the last five years,” a company executive said at a conference call.Cenovus Energy Inc. said on Wednesday it was limiting output due to severe discounts and said it expected the price of domestic heavy crude to rise by mid-2019 as increased rail volumes ease transport bottlenecks.The company did not specify how much production it was restricting but said it has slowed output at both its Foster Creek and Christina Lake sites.While rivals take cover, Suncor Energy Inc., Canada’s second-largest energy producer, does not need to reduce crude output as some of its peers are doing to cope with low prices.Suncor, which has dedicated pipeline space for its crude as well as refineries in Canada, is mostly insulated from the impact of growing price discounts that U.S. refineries apply to Canadian oil, which have hurt rival producers, chief executive Steve Williams said on Thursday. Those discounts are largely attributed to pipeline constraints.“The higher-cost producers are having to pull back because they’re not making any margin on their last barrel. We’re not in that circumstance,” Williams said on a call with analysts in response to a question on whether Suncor would cut production. “If we were, we wouldn’t hesitate to pull throughput back.”Discounts should abate this year, with more significant relief arriving when Enbridge Inc.’s expanded Line 3 pipeline comes online late next year, Williams said.Canadian heavy crude for December delivery in Hardisty, Alberta, was at US$46.50 a barrel below North American crude futures on Thursday, according to Shorcan Energy brokers. That meant Canadian crude was trading at less than half the benchmark price.Despite their troubles, Canadian oil companies managed to turn in a good performance.Canadian Natural’s quarterly profit more than doubled and beat analysts’ estimates, helped by higher production and average realized prices. The company is looking to produce more light crude, which is easier to extract and refine, to take advantage of a more than 20 per cent year-over-year rise in global oil prices.MEG posted net earnings of $118.2 million for the three months ending Sept. 30, compared to $83.9 million for the same period last year.Suncor’s operating profit, which excludes one-time items, was $1.6 billion, in the quarter, up from $867 million in the year-ago period.Financial Post Staff with files from Thomson ReutersThis content was provided by Market One for commercial purposes."}