{"id": "As Trans Mountain stalls, TransCanada begins preliminary work on Keystone XLEnergyTop Stories", "paragraph": "October 18, 20182:12 PM EDTLast UpdatedOctober 18, 20182:16 PM EDTCALGARY — More than a decade after it was first proposed by TransCanada Corp., the Keystone XL project is moving closer to the construction phase in Canada and the U.S., despite legal obstacles facing the company.Preliminary work has begun on the pipeline route in Alberta, Saskatchewan, Montana and South Dakota — except for the state of Nebraska, where it faces a legal challenge, a TransCanada spokesperson told the Financial Post.The company is delivering pipe, conducting civil engineering work on pump stations and clearing vegetation along the route ahead of full construction, which is expected to start next year though the company has yet to officially announce a final investment decision.“Later this year we will start moving equipment to prepare workforce camp and camp modules,” TransCanada spokesperson Matthew John said.In Canada, John said, there will be some increased truck traffic between Camrose, Alta. and Regina as the company is moving pipe.The long-delayed Keystone XL has emerged as a critical lifeline for Canadian oil companies as existing export pipelines have filled up, leading to record-breaking US$50-per-barrel discounts for Western Canada Select, a heavy oil blend.Amid the crippling discounts, the Trans Mountain pipeline expansion project to the West Coast has stalled after a Federal Court of Appeal ruling in August that went against the federal government, which recently took ownership of the project. Relief for the oilpatch isn’t expected until Enbridge Inc. completes its 370,000 barrels per day Line 3 replacement pipeline to Wisconsin in the second half of next year.Analysts now expect Keystone XL to be completed before the Trans Mountain project.“Pipeline capacity will get a boost when Line 3 and then the third Keystone leg (XL) kick in by as soon as late 2019 or early 2020 (Line 3),” said Scotiabank in a note earlier in the week. “Two out of three ain’t bad pending future Trans Mountain developments. This too should help ease the pipeline bottlenecks that are causing a discounted glut.”First proposed in 2008, the Keystone XL pipeline has been delayed multiple times amid opposition by a group of landowners in Nebraska and by former U.S. president Barack Obama, who denied the project a presidential permit. The southern leg of the pipeline, from Kansas to Texas, which didn’t need a presidential permit, has been built.U.S. President Donald Trump revived the US$8-billion pipeline project that would carry 830,000 barrels of oil per day from Alberta to the U.S. Gulf Coast through an executive order in 2017. Since then, the company has worked through a regulatory process in Nebraska, which is currently being challenged.The company has indicated that it would begin construction early next year.The preparatory work on the pipeline is considered a victory in the Calgary oilpatch“I think they want to try and expedite this as much as they can to get this either completed or sufficiently complete before Trump leaves office,” Raymond James analyst Chris Cox said of the preparatory work under way on Keystone XL. “They’re going to try to advance the project as much as they can,” Cox said.It would take two years to build the project, which is unlikely to be compressed given the sheer quantity of pipe that would need to be installed.Still, the preparatory work on the pipeline is considered a victory in the Calgary oilpatch.“I’m encouraged that they’re doing these things,” said Dennis McConaghy, a former TransCanada executive who oversaw the Keystone XL pipeline saga for years and has since written a book on the project.“I think they have a fundamental expectation that they are going to prevail but they are doing it cautiously,” McConaghy said, noting the project still faces a court obstacle.Opposed landowners in Nebraska challenged the state’s Public Utilities Commission’s decision to approve the pipeline through the state along an alternative to the company’s preferred route. The challenge, which is before the Nebraska Supreme Court, hinges on whether the PUC had the authority to approve an alternative route.TransCanada’s John said oral arguments in the Nebraska Supreme Court case will be made beginning Nov. 1, but couldn’t say when a decision on the case is expected. Analysts have speculated a decision on the high-profile case could be made by the end of this year, or in the first quarter of 2019.• Email: gmorgan@nationalpost.com | Twitter: geoffreymorganCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}