{"id": "Oil and gas firms sound alarm as capital once destined for Canada flees to more competitive U.S.EnergyTop Stories", "paragraph": "November 2, 20189:17 AM EDTLast UpdatedNovember 2, 20186:22 PM EDTSecond in a three-part series on how Canada’s heavy regulatory burden is choking competitiveness.CALGARY – Enerplus Corp. chief executive Ian Dundas has not “written off” Canada as a place to do business, but he is not planning to shift spending back to the country from the U.S. anytime soon.“We’ve transitioned our business into the U.S. — dramatically transitioned it,” he said. “This year and next, we will spend 90 per cent of our capital in the United States.”Dundas said Enerplus’s capital budget was once more weighted toward Canada, but the company in 2015 started shifting its capital to the U.S.“When you hear ‘capital,’ the synonym for that is ‘jobs,’” he said, adding that Enerplus has staffed up considerably in the U.S. in recent years. Annual disclosures show the company employed 139 people in the U.S., compared with 265 people in Canada at the end of last year.Dundas and other oil and gas executives point out that U.S. regulatory processes are more predictable and streamlined, its regulations change less frequently and it takes less time to get regulatory approvals to develop a resource, which has led the industry to become increasingly critical about Canada as a jurisdiction to drill for oil and gas and less likely to invest here.They also point to reports such as the World Economic Forum’s Global Competitiveness Index ranking, which was updated on Oct. 16. Canada fell two places and is now the 12th most competitive jurisdiction in the world.The WEF ranked the U.S. first overall, which oil and gas executives say is significant because it has become Canada’s main competitor for investment dollars in the energy industry — a trend that Dundas called a “massive change that changed everything.”Capital spending in the U.S. oil and gas sector rose 38 per cent to $120 billion last year, Reynold Tetzlaff, PricewaterhouseCoopers LLP national energy leader, said in an email, citing data compiled by the Fraser Institute.“The U.S. is more competitive in the oil and gas market today,” he said.Now, Canadian-domiciled oil and gas producers are getting more vocal about the issue.The U.S. is more competitive in the oil and gas market today“There are four key challenges facing the oil and natural gas industry: market access, regulatory effectiveness, cost structure and fiscal competitiveness,” Canadian Natural Resources Ltd. said in an emailed statement.CNRL is Canada’s largest upstream oil and gas producer with daily production exceeding one million barrels per day, or more than 20 per cent of the country’s total production.“It is imperative that we maintain our high regulatory and environmental standards while also overcoming these challenges,” the company said.Federal Finance Minister Bill Morneau has said Ottawa is tracking Canadian business competitiveness and regulatory burdens relative to the U.S., which also has the advantage of getting recent major tax cuts. But his government has not announced any changes yet.As it stands, the energy industry blames a combination of provincial and federal governments for what they call “duplicative” and incremental regulations that hurt business competitiveness without improving environmental stewardship.This month, staff from Environment and Climate Change Minister Catherine McKenna’s office flew to Calgary to meet with chief executives from major pipeline and oilsands companies and listen to criticism about Bill C-69, which would reorganize the National Energy Board and establish a new assessment agency, to die on the order paper.Caroline Theriault, an Environment and Climate Change spokesperson, said the government will continue to meet with stakeholders in the energy sector and that “Bill C-69 is supported by many in the resource sector across the country.”But industry executives say the legislation will further stymie investment in the resource sector by introducing new and unpredictable regulatory reviews, and prevent new pipelines from being built in the country. They have repeatedly stated they want Bill C-69, currently before the Senate, to die on the order paper.In addition to new pipelines, PwC’s Tetzlaff said the energy industry needs to see a Canadian response to the U.S.’s tax reforms and efforts to streamline the regulatory processes.“We need to utilize all of these components to regain our edge as an energy leader,” he said.It already takes weeks longer to get well licences in Alberta than in places such as Texas, according to a report published in September by the Canadian Association of Petroleum Producers, the industry’s largest advocacy group.The report noted that oil and gas companies wait between 79 and 119 days for a routine well licence in Alberta, compared to between 30 and 60 days in Texas. For non-routine well applications, or applications for which “statements of concern” are filed by interveners, the timelines in Texas can be up to 190 days shorter.The report was particularly critical of the regulatory process in Alberta, where it can take up to six years to get approval for a steam-based oilsands project.“What we should strive for is a streamlined and efficient regulatory system that maintains the standards that Canadians expect,” CAPP chief executive Tim McMillan said.He said CAPP and several individual companies have been meeting with politicians about the issue for years, but “over the last few years, it has gotten worse.”For example, McMillan noted Mick Mulvaney, one of U.S. President Donald Trump’s cabinet members and the director of the Office of Management and Budget, has asked all other U.S. federal government departments to put forward plans to streamline their regulatory processes.“You see the results,” he said. “Capital growth in the U.S. oil and gas industry is up almost 40 per cent this year. In Canada, it is declining.”The Alberta Energy Regulator, which oversees oil and gas activity in the province, disagreed with some of the timelines CAPP highlighted in its report.“The AER posts estimated application processing times on its website and meets the targets more than 90 per cent of the time,” spokesperson Monica Hermary said in an email.Capital growth in the U.S. oil and gas industry is up almost 40 per cent this year. In Canada, it is decliningShe added that longer timelines could arise from complex development or factors that are outside the regulator’s control, “including if the application is incomplete or if stakeholder consultation requirements have not been met.”Hermary said the AER is working with the energy industry, including CAPP, “to gather input on how to make the regulatory system more efficient and the areas we need to focus on that will make a positive difference.”But for producers that have already shifted their capital spending to the U.S., it will be difficult to draw them back without major changes.Enerplus’ Dundas said the company has now developed assets in the U.S. as a base for future growth rather than in Canada.“Our assets today in Canada do not support a shift back,” he said.• Email: gmorgan@nationalpost.com | Twitter: geoffreymorganCalculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}