{"id": "Time to do some active planning to beat the passive income tax changesTaxesTop Stories", "paragraph": "October 18, 20184:28 PM EDTEarlier this year, the government passed new tax legislation governing Canadian-controlled private corporations (CCPCs), including incorporated professionals. As we enter the final weeks of 2018, one new measure is of particular concern — the potential looming loss of the small business deduction (SBD) in 2019 for corporations with more than $50,000 of passive investment income in 2018.The SBD provides a low rate of corporate tax on the first $500,000 (known as the “SDB limit”) of active business income annually. Business owners and incorporated professionals who don’t need to pay out corporate earnings to fund their personal lifestyles are able to enjoy a significant tax deferral of up to 41 per cent by simply leaving funds in their CCPC and investing them.Indeed, the tax deferral was seen by the government as so valuable that it took legislative steps in the 2018 federal budget to substantially reduce it in some circumstances. Beginning in 2019, the SBD limit will be reduced based on the amount of “adjusted aggregate investment income” (AAII) the CCPC earned in the prior year. AAII is effectively passive investment income — think interest, dividends and capital gains — with a few adjustments.Under the new rule, the SBD Limit will be reduced by $5 for each $1 of AAII that exceeds $50,000 and will reach zero once $150,000 of AAII is earned in a year. In practical terms, this means that if your CCPC has at least $50,000 of AAII in 2018, then in 2019 some (or all) of the income that would have qualified for the low SBD corporate tax rate (e.g. 12.5 per cent for Ontario in 2019) would be taxed at the higher, general corporate tax rate (26.5 per cent in Ontario).Is losing the SBD a big deal? The short answer is — it depends.If you are going to take the after-tax business income out of the company in the year it’s earned, then you’re not enjoying any tax deferral and the loss of the SBD is likely immaterial. If, on the other hand, the after-tax corporate income is retained in the corporation and not paid out as a dividend until a future year, then losing the deferral available on SBD income could be material.In a worst-case scenario, a complete loss of the SBD, which would only occur when the AAII is greater than $150,000, means that $500,000 of income that would have been taxed at the low rate of, say 12.5 per cent in Ontario in 2019, would be taxed at the higher, general rate of 26.5 per cent. That difference, representing 14 per cent, translates to $70,000 less to invest, which can make a big difference with years of investing.If your CCPC is nearing or exceeding the $50,000 threshold for AAII, here are some strategies to consider in 2018 to reduce the impact to the SBD Limit in 2019.RRSP/TFSA contributionsConsider withdrawing sufficient corporate funds to maximize your RRSP and TFSA contributions, rather than leaving the funds inside the corporation for investment. Given sufficient time, RRSP and TFSA investing would generally outperform corporate investing when earnings come from interest, eligible dividends, annual capital gains, or a balanced portfolio. And removing funds that would otherwise be invested within the corporation could reduce future AAII.Investment strategiesDepending on the level of AAII otherwise earned in a particular year, you may wish to consider investments that lean towards growth rather than annual interest or dividend income, as you may better be able to time the recognition of a capital gain. In addition, since capital gains are only 50 per cent taxable, it would take $100,000 of realized capital gains to generate $50,000 of passive income that is counted towards the AAII test.Consider a “buy and hold” strategy to defer capital gains if a corporation is approaching the $50,000 AAII threshold in 2018. By deferring some capital gains, the SBD Limit may be maintained in 2019.It may also be possible to stagger dispositions of investments between calendar years. For example, if there will already be more than $150,000 of AAII in one year, consider triggering additional capital gains in that year, rather than the next, if that might reduce AAII below the threshold in the next year. Conversely, you may wish to trigger capital gains or losses in a specific year because capital losses cannot be carried forward to a future year for purposes of reducing AAII. As a result, you may wish to realize capital losses and gains in the same taxation year.Some investments, such as certain notes, T-class units of mutual funds and REITs, pay a mixture of income and a return of capital. A return of capital is not included in income in the year received; rather, it reduces the adjusted cost base of the investment and increases the capital gain (or decreases the capital loss) on the future disposition of the investment.When considering these investment strategies, you should take into account your overall investment plan, as well as AAII expectations for future years.Individual Pension PlansAn Individual Pension Plan (IPP) is a defined benefit pension plan created for one person, rather than a large group of employees. Since the corporation contributes to the IPP and the income earned in the IPP does not belong to the corporation, that income is not AAII. The tax benefits of an IPP need to be offset against the administrative costs, including actuarial costs, to set up and maintain the plan.Corporately-owned permanent life insuranceYou may choose to invest after-tax income of the corporation into a corporately-owned life insurance policy that insures the life of the business owner, or some other individual. The death benefit may flow out partially, or perhaps even entirely, as a capital dividend that is generally tax-free to the shareholder.Income and growth on the underlying investments are tax-sheltered within the life insurance policy and are not included in the corporation’s income on an annual basis, so they don’t form part of AAII.Jamie.Golombek@cibc.comJamie Golombek, CPA, CA, CFP, CLU, TEP is the Managing Director, Tax & Estate Planning with CIBC Financial Planning & Advice Group in Toronto.Calculate your monthly mortgage paymentsCompare payments and other costs associated with getting a new mortgageBegin the process of finding out how much you can borrowSee how much you have left to save and where your money is being spentSee how much your investment savings could be worthWhat will it take to help reach your savings goalsCompare currencies from across the globeCalculate what it will take you to save one million dollars"}