{"id": "Investors are spending hundreds of millions to short cannabis stocks, despite huge lossesCannabis InvestingTop Stories", "paragraph": "November 12, 20187:14 AM ESTInvestors are pumping more money into shorting pot stocks, despite the fact that doing so has resulted in estimated year-to-date losses of US$892 million, according to a U.S. firm that specializes in short-selling research.Ihor Dusaniwsky, managing director for predictive analytics at S3 Partners, says his data show investors have spent US$1.4 billion shorting cannabis stocks in the United States and Canada since mid-year, but that they are struggling to find winning names.“There is no cannabis short that is making more than US$20 million but there are several that are losing over US$100 million,” Dusaniwsky said.Investors are nevertheless continuing to test the sector, Dusaniwsky said, because they believe it is “flying too close to the sun” and is due for a reversal.So far this year, Canopy Growth Corp.’s stock is up more than 73 per cent, while shares of Tilray Inc. have risen 541 per cent — the latter just since its July IPO.According to S3’s data — which measure short sales for 141 cannabis securities in the U.S. and Canada — Canopy, Aurora Cannabis Inc. and Tilray are the top three companies being shorted when combining the short interest in dual-listed shares. These also happen to be the stocks that have seen short-seller losses in excess of US$100 million this year.It isn’t just the positive overall performance of the cannabis sector that has posed a challenge for short sellers.Currently, Dusaniwsky said, the shorts’ biggest problem is that it has been difficult for brokers to locate shares to borrow and as a result the cost to do so has become inflated.Cannabis shares are mostly owned by retail investors, most of whom do not have the margin accounts necessary to borrow and lend shares, Dusaniwsky said. So high demand and low supply have resulted in borrowing fees that have reached the 30 to 40 per cent range and beyond, in some cases.Investors looking to short shares of Tilray currently have to deal with a 38 per cent borrow rate, according to S3. With a total short position worth about US$415 million as of Friday, that means shorts altogether are paying approximately US$388,000 per day to short the company.So far this year, shorting Tilray has been a costly trade, with total losses suffered by short sellers reaching US$340 million, according to S3.You've got to be right and you've got to be right pretty quick or else the stock borrow price is going to eat into your (profits)Those interested in Cronos Group will have to deal with a 42 per cent borrowing fee, while the highest borrowing fee — 50 per cent — belongs to shares of Mississauga, Ont.-based The Green Organic Dutchman Holdings Ltd.Because of the borrowing costs, Dusaniwsky said, most investors cannot risk shorting cannabis stocks over the long term.“You’ve got to be right and you’ve got to be right pretty quick or else the stock borrow price is going to eat into your (profits),” he said.While they’re interested in shorting individual companies, investors have shied away from shorting ETFs such as the Horizons Marijuana Life Sciences Index ETF. Dusaniwsky said this might suggest that investors are still confident the sector as a whole will continue to perform well, but individual companies may not.Going forward, long investors will continue to be enticed by the sector in hopes that a U.S. market solidifies, Dusaniwsky said, something that could bring more volatility — and more short sellers.Never miss a beat on stocks, mutual funds, and ETFs with customized Watchlist and Email Alerts. Sign up now."}