{"id": "Rising rates and slowing economy expected to push Canadian delinquency rates higher by early next yearDebtTop Stories", "paragraph": "This section was produced by the editorial department. The client was not given the opportunity to put restrictions on the content or review it prior to publication.October 19, 201812:14 PM EDTA slowing economy and rising borrowing costs will probably push Canadian delinquency rates higher in coming months, according to the country’s largest credit reporting firm.Bill Johnston, vice president of data and analytics at Equifax Canada, predicts the rate of late payments on consumer debt — credit cards, auto loans and other non-mortgage liabilities — will begin rising in late 2018 or early 2019. Delinquencies reached 1.06 per cent in the second quarter, close to the lowest level since the 2008 financial crisis.The Bank of Canada has raised rates four times since mid-2017 and is widely expected to do so again next week as it seeks to normalize the cost of borrowing. Johnston said higher rates, slowing economic growth and a reduction in mortgage volumes will likely strain household balance sheets.“We are probably hitting that level out point, and maybe even a bit of a backup as we go forward now,” Johnston said in a telephone interview, referring to delinquency rates, which peaked at 1.65 per cent in early 2010 and have since trended steadily downward. “We are starting to see interest rates have an effect,” he said.Equifax tracks the proportion of people who fully pay off their credit cards each month, data that provides a good measure of cash flow, Johnston says. The proportion has declined on a year-over-year basis every month since August 2017, shortly after the Bank of Canada started hiking rates again after a seven-year hiatus. “We do think cash flows are starting to be impacted,” he said.According to Johnston, about 43 per cent of all non-mortgage debt is lines of credit, much of it home equity lines of credit, which is variable rate. Every time borrowing costs rise by 25 basis points, “your monthly payment changes. We’re starting to see that flow through a little bit, because people are still using a lot of lines of credit.”There’s also a “lag effect” of about 3 months to 6 months between when credit growth slows and when delinquency rates rise, he said. Johnston declined to give an exact forecast for delinquencies, saying the timing is tricky, but probably in the fourth quarter this year or the first quarter next year, the rate will start to tick higher “by a few basis points.”“We don’t see it spiking or whip-lashing back up,” he said. However, “we’ve become used to seeing this down trend where it’s been improving every single quarter. That’s sort of where we see it coming to the end.”Bloomberg.com"}