{"id": "ATO spoofed: Scammers use cloned tax office phone number to trick victimsYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Criminals acting with impunity are using a cloned Australian Taxation Office phone number to convince thousands of people they have been caught evading taxes.The latest scam is so effective that the tax office has placed an automated message on its main switchboard number in Canberra warning people that phone calls they have received from the number aren't genuine.Recorded calls from the scammers tell people that someone has informed the tax office that they have been avoiding taxes, and an investigation has begun than could lead to their arrest.They are told to respond to a series of prompts that lead them to pay large amounts to the scammers.The tax office believes the calls are timed to prey on people who have just filed their end-of-financial-year tax returns.There has been a jump in spoofing-scam complaints this year to the National Identity & Cyber Support Community Service, an industry and government-funded service for victims of internet and ID fraud.Experts say they don't believe anyone has been prosecuted, mainly because the frauds involve relatively small individual amounts and are usually conducted from overseas.\"The offshore nature of scams like this makes law enforcement problematic and recovery of funds virtually impossible,\" a tax office assistant commissioner, Kath Anderson, said.The technology used to display a fake incoming phone number, known as spoofing, used to require specialist computer software. Today it can be legally purchased on web app stores.\"Spoofing is very easy to do,\" said David Lacey, a professor of cybersecurity at the University of the Sunshine Coast. \"Fixing it appears to be almost impossible. It's a low-value, high-volume business.\"Since July 1 Australians have reported 28,000 scam attempts to the tax office and said that they have handed over almost $1 million. The real figure is likely to be higher because many people do not realise they were the victim of fraud.Some scammers will seek payment in a untraceable cryptocurrency such as bitcoin. In the past iTunes vouchers were common.One recent target was specialist in financial fraud at accounting firm KMPG, Gary Gil. The Sydney-based partner received a voicemail warning he would be arrested if he didn't cover an outstanding tax bill. He deleted the message straight away.\"There is no way they would do anything like that,\" he said. \"There is always an element of the population who is gullible. But if the ATO is asking you to make a payment in bitcoin, that wouldn't happen.\"Displaying a fake phone number on an incoming call is not illegal, and is legitimately used by call centres and other organisations.The law is not clear whether spoofing used to commit fraud is illegal and the phone industry doesn't know how to prevent it, Professor Lacey said.\"Talking with the relevant stakeholders and the telecom industry, they don't seem to have a solution,\" he said.One way government agencies, including the tax office, try to combat scams is by providing information to the Australian Scam Awareness Network, an information service run by the Australian Competition and Consumer Commission.Some targets of spoofing scams have found criminals have used their phone numbers to go after other victims. This sometimes happens when the original targets provide the criminals \"with free career advice,\" Professor Lacey said.The retribution disrupts businesses that are bombarded with calls from people who think they are trying to defraud them.Other tax office scams use legitimate-looking emails or text messages known as phishing to obtain personal or financial information.Almost 6000 people have fallen victim to phishing scams this financial year, according to the tax office, which said it never demands immediate payment of debts.\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}