{"id": "China, Myanmar finally move ahead with $US7b sea portYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Beijing | China and Myanmar are moving ahead with a China-backed deep-sea port project in Kyaukpyu, 250 miles northwest of Yangon, following nearly three years of twists and turns.Myanmar officials and Chinese investors signed a framework agreement for the Kyaukpyu port project on Thursday in the capital city, Nay Pyi Taw, a spokesman at Myanmar's Ministry of Commerce told Caixin.A consortium led by China's state-owned investment conglomerate Citic Group won a tender to build the port in 2015. It was part of a broader project for the Kyaukpyu special economic zone launched by Myanmar's former President Thein Sein. Total investment in the port was estimated at more than $US7 billion, of which China could account for as much as 85 per cent, according to the original agreement.But the project was held up after elections in 2015 ended Myanmar's military rule and the new government had concerns about financing, equity and debt issues related to the project.China-led investment under the Belt and Road infrastructure program has faced increasing scrutiny in neighbouring countries out of concerns over potential debt-related risks. In early October, Pakistan cut the size of a key Chinese railway project by $US2 billion, citing debt worries.In August, Malaysia's newly elected Prime Minister Mahathir Mohamad announced that more than $US23 billion of Chinese projects, including railways, were \"cancelled for now\".On the Myanmar port project, negotiations had made little progress by October 2017 as Myanmar investors \"want more shares, but they don't want to take more financing responsibility,\" Yuan Shaobin, executive president of Citic Myanmar, told local media.In May this year, several international media outlets reported that the Myanmar government launched a re-evaluation of the port project because of concerns that it might put Myanmar heavily in debt to China.But the freeze apparently thawed after the two countries signed a memorandum of understanding in September to establish the China-Myanmar Economic Corridor as part of the Belt and Road program. The Kyaukpyu port is the first project to move forward under the accord.According to Aung Naing Oo, director of Myanmar's Investment and Company Administration (DICA), the Chinese consortium will take a 70 per cent stake in the port project with the remaining 30 per cent split between the Myanmar government and a consortium of local businesses. The Myanmar stake was increased from the previously agreed 15 per cent.Investors in the China consortium include China Merchants Group, China Harbour Engineering, Tianjin Teda Group, Yunan Construction Engineering Group and Thailand's Charoen Pokphand Group.Earlier this month the Myanmar Times quoted deputy commerce minister U Aung Htoo saying that the port project would be carried out in four phases. The first-phase construction of a terminal with capacity for two to three vessels will involve initial investment of $US1.3 billion, down from a previous estimate of $US1.6 billion.Citic Myanmar's Yuan said the framework agreement will be just the beginning of a lengthy procedure before construction starts, including the signing of several related contracts and regulatory approvals.This article was originally published by Caixin.\n\n\n                        \n                                              Caixin\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}