{"id": "A cancer researcher on the keto diet for 6 years explains how he does itYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Six years ago, David Harper considered himself relatively healthy.The anatomy and physiology professor loved an occasional cookie, but he exercised often, cooked nutritious meals at home, and tried to stick to conventional nutrition advice: not too many calories, low amounts of fat.But Harper started to realise that saturated fat might not be so bad, and that maybe it was the carbohydrates he ate that were causing him to pile on extra pounds and increasing inflammation.\"We've been telling people to eat the wrong diet for 40 years, and we've seen the results,\" Harper told Business Insider.He is convinced that carbohydrate-heavy, low-fat diets are a major reason we're seeing high rates of diabetes, high blood pressure, obesity, and cancer. That's because a diet high in sugar can quickly raise insulin levels in the body. Over time, those spikes can lead to insulin resistance and eventually to long-term health issues like high blood pressure, Type 2 diabetes, inflammation, and obesity.So years before the likes of LeBron James and the Kardashians figured out there might be some benefits to a low-carb, high-fat ketogenic diet, Harper gave it a try.Trained in mathematical biofluiddynamics, Harper teaches anatomy, physiology, and pathology at the University of the Fraser Valley in British Columbia, Canada. He said that's part of the reason the keto diet made sense to him.\"It was the knowledge that I gained through my career teaching anatomy, physiology, and pathology that led me to the conclusion that this is absolutely right in terms of the way the human body works,\" he said.Harper went on the diet with his wife to test what it was like for a few months.\"Over 12 weeks, I lost about 22 pounds [10kg] of body fat,\" he said, adding that most of it was around his midsection. He wasn't a big guy before – about 5-foot-9 and 177 pounds – but today he weighs 150 or so.The reason the keto diet is effective for weight loss and some disease control is that it fundamentally shifts the way our bodies run. On a traditional diet, our bodies automatically reach for carbohydrates to burn first, before using fats, because carbs are quicker and easier to break down.But if no carbs are available, our bodies start burning fat as a primary fuel source and producing ketones in the liver, which the body can turn into energy. This metabolic state, called ketosis, is what happens when someone is starving. But it's also how Harper's body works every day. His system relies on fats like butter, oil, and lard as a primary energy source instead of packing them on as in-case-of-emergency poundage.Harper said he doesn't even feel hungry if he skips a meal or two.Harper said he often starts the day by eating high-fat yoghurt topped with a few berries and some roasted nuts. Other mornings, his breakfast might be bacon and eggs with tomato and avocado.His sweet tooth is gone, he said. Instead, he gets hankerings for fatty foods.\"What I crave is butter,\" he said. \"I like grass-fed butter. I could eat that stuff like cheese.\"If he's out and about during the day, he might order a breve latte, which is made with cream instead of milk. Most keto dieters shy away from even the fattiest milk because it contains too many carbohydrates (specifically sugar) to be ketosis-friendly. Harper keeps a stash of nuts with him at all times when he's on the go.For lunch, he often opts for a salad with chicken or fish on top. The dinners he cooks are usually pasta-style dishes, or maybe the occasional meat-and-potatoes-type meal, except he replaces any potatoes or grain-based pasta with low-carb alternatives like cauliflower or squash. Often, he tops the meal off with cheese.He avoids beans and apples, which have too many carbs to be considered keto, but he sometimes has a glass of wine or munches on berries for a sweet treat.\"It's all real food that comes from plants, and I don't eat huge amounts of meat,\" Harper said.If he does cook chicken, he keeps the fatty skin on, and the small cuts of steak he picks out are marbled with fat.Harper doesn't think the keto diet should be tried as a quick fix, and he's not a fan of keto \"cycling\", a practice that involves switching back and forth between being in a state of ketosis and eating meals with more carbs.\"You need to be committed, and you need to really say, 'I've been on the wrong path for a long time, and I'm willing to give up a lot of these foods that I really love, that I'm emotionally attached to, and I'm going to change to a different diet because that's going to provide better health,'\" he said.But a few disclaimers about the keto diet are in order. It's not for everyone – people with a history of kidney or liver issues, as well as pregnant women, can put themselves in severe danger if they try the diet. The plan should not be tried without consulting a professional.Harper also said many people might confuse going keto with having an excuse to fill up on bacon and eggs every morning, but it isn't that. A proper keto diet is about 70-80 per cent fat, with no more than 10-15 per cent carbs. That means most people on it try to keep their carbohydrate intake below 50 grams a day and stick to only moderate amounts of protein.Other kinesiologists think the keto diet could have dangerous effects on athletic performance, and it's tough to know what potential side effects a long-term high-fat diet might have for a healthy person, since we don't have any solid study results yet. Low-carb diets like keto can make it easy to neglect key nutrients like magnesium, calcium, and potassium found in fresh, high-carb foods like beans, bananas, and oats.Ketogenic diets are, however, a well-established way to help control Type 2 diabetes, and the plan has for nearly 100 years been used to reduce instances of childhood epileptic seizures. Some scientists also think the high-fat diet may hold promise for staving off Alzheimer's, and there are some early indications it might help improve certain cancer treatment outcomes when used in conjunction with drugs. (Harper is part of a research team investigating how the diet might help boost treatment among people with breast cancer.)But Harper doesn't think keto should be considered a fad diet.\"You can't do this half way,\" he said. \"You have to be all in, and all in forever.\"This story first appeared in Business Insider. Read it here or follow BusinessInsider Australia on Facebook.\n\n\n                        \n                                              BusinessInsider.com.au\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}