{"id": "Extortionists target Aussie defence shipbuilder after cyber security breachYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Australia's biggest defence exporter has been targeted by extortionists who launched a successful cyber attack to breach the company's data management systems.ASX-listed Austal, a major shipbuilder for both Australia and the US Navy, said on Thursday that it referred the breach and extortion attempt to the Australian Cyber Security Centre (ACSC) and the Australian Federal Police.It is understood the hackers accessed ship designs. Austal has confirmed details of staff addresses and mobile telephone numbers were compromised.Austal said ship design drawings, which may be distributed to customers and fabrication sub-contractors or suppliers, were neither sensitive nor classified.The company said it had restored the security and integrity of its data systems and beefed up security to prevent further breaches.\"A small number of stakeholders who were potentially directly impacted have been informed,\" it said.\"Austal's business in the United States is unaffected by this issue as the computer systems are not linked.\"No company wants to lose control of its information, but there is no evidence to date to suggest that information affecting national security nor the commercial operations of the company have been stolen.\"Following the breach, the offender purported to offer certain materials for sale on the internet and engage in extortion. The company has not and will not respond to the extortion attempts.\"In September, Austal secured a new deal with the US Navy to build two more combat ships at its shipyards in Mobile, Alabama.The deal brought to 17 the number of Independence class littoral combat ships ordered from the shipyards.The federal government has engaged  Austal to building 21 patrol boats for Pacific nations at its shipyards south of Perth in Western Australia.The government also pushed for Austal to be part of the consortium building 12 offshore patrol boats for the Australian Navy, but the company was unable to reach an agreement with lead contractor Luerssen. In a joint statement the Department of Defence, Department of Home Affairs and the Australian Cyber Security Centre, said no compromise of classified or sensitive information or technology had been identified so far with investigations continuing.\"This incident reinforces the serious nature of the cyber security threat faced by defence industry, and the need for industry partners to put in place, and maintain, strong cyber defences,\" the statement said.\"Defence and the ACSC have provided cyber security assistance to Austal and are working with Austal to assess and mitigate harm.\"\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}