{"id": "Royal commission erodes trust in banks: new poll You have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Only one in five Australians believes banks act ethically and only one in four thinks banks take responsibility for mistakes and keep their promises to customers, according to the damning findings in a new national survey.The survey underlines that the job of repairing customer trust in the wake of the Hayne royal commission will be a long and challenging road.The inaugural Deloitte Trust Index - Banking 2018 has found the public's dim view of banks is not influenced by major political party persuasion, class or gender. Nor are branch customers any more trusting than those banking over the internet.The IPSOS poll, conducted by Deloitte in association with corporate law academic Justin O'Brien's The Trust Project and published exclusively in The Australian Financial Review on Monday, supports a core finding in the banking royal commission interim report, that banks have been too focused on managing for the short term.The survey finds 59 per cent of customers believe banks have the interests of shareholders at heart, but only one-third say banks always look for new ways to provide better services to customers, and only one in five says banks have customer interests at heart.\"Banks' actions have been reflecting short-term shareholder interests, not the interests of the corporation as a whole, which after all, is the directors' ultimate fiduciary duty,\" Professor O'Brien said.\"This survey brings into sharp sunlight the ethical failures and, as such, acts as the ultimate disinfectant.\"The results also back up Commissioner Kenneth Hayne's finding over regulatory failures: only one in three Australians believes regulators are doing a good job to hold banks accountable for their treatment of customers.The confronting findings from the Deloitte Banking Trust Index show the majors will have their work cut out to calm investors nervous about remediation bills surging in response to the Hayne inquiry.Three of the major banks will brief the market over the next week, with ANZ Banking Group reporting its full-year profit on Wednesday, National Australia Bank on Thursday, and Westpac Banking Corp next Monday, November 5.The four major bank CEOs will front the commission in November.Analysis conducted on the survey results by Deloitte, to determine the issues respondents find most important, indicates putting customers at the centre of what they do  will help banks restore their social licence.Customers want to be shown respect, want banks to listen to their gripes, to admit mistakes, and to be open and honest. These matter more than the terms and conditions of particular products or technical competency.Deloitte partner Willem Punt, who oversaw the survey, said there was no indication consumers did not trust banks to keep their money safe. But with one in four saying they would change banks due to the ethics of senior leaders, banks that get resetting trust right could be at a competitive advantage against peers.\"Today's business world is far more about communities and relationships and far less about transactions,\" Mr Punt said.\"Customers consider the mindset of the seller far more important in rebuilding trust than the detailed characteristics of what is being sold. The companies that get this, at the deepest level, are exhibiting the kinds of behaviours that genuinely build trust.\"The survey results show that competitive forces in the system remain strong and that price still matters: fifty-three per cent of people say they would consider changing banks because of \"better fees, rates or products elsewhere\".But customers are more inclined to doubt the ethics of a bank than its capability: 52 per cent of customers have some doubts that banks are ethical, while only 43 per cent raised doubts about capabilities.Professor O'Brien said this showed banks' big investments in technology was not improving how they were perceived by the public. \"People think there is lots of capability in banks and ethics are important. But they don't think there is an alignment between capability and ethics and that's the problem,\" he said.Privacy breaches, poor responses to complaints, and unreliable staff or systems are more important drivers to switch banks than the quality of the online banking app or work banks are doing to support communities, the survey found.The index findings reveal dangers for banks from the government's open banking policies, which by mid-way through next year will require banks to let customers move transaction data to competitors. Almost half of customers say they doubt or don't believe their private details are secure in their own bank, while 42 per cent of respondents say they would change banks if private information was given out without consent.The survey's finding that 56 per cent of customers say their own bank deals with compliants and queries in an effective manner reinforces banks' attempts to speed up customer remediation programs. The bank CEOs told recent parliamentary hearings in Canberra this was a key focus.The index was created after an IPSOS poll of 2072 people representing a cross-section of society was completed in August. With a federal election due after Commissioner Hayne's final report at the end of January, the Deloitte banking Trust Index shows Labor and Coalition supporters have nearly identical sentiment towards banks: 55 per cent and 56 per cent respectively trust them overall. But levels fall among alternative party voters, where only 44 per cent trust banks.Geographically, the highest trust levels are in Victoria, where 53 per cent of customers are trusting, whereas this falls to 47 per cent in Queensland. The results also show older Australians are more distrustful of banks, and trust levels are lower among more educated people. Level of income, occupation and gender have little effect on trust levels.People are also more trusting of their own bank than banks in general. While only 26 per cent of respondents said banks in general kept promises to customers, just under half of people said they trusted their own bank to do so – still a minority.The Deloitte banking Trust Index has created a weighted index number of 33, a base against which future performance will be measured. The index was constructed so scores of 70 and above are desirable.The results of this survey are consistent with findings of the Edelman Global Trust Barometer, which showed a rapid decline in trust across major institutions, including corporates, government and media.In recent weeks, the issue of growing public insecurity in institutions and democracy has been explored in major features in global publications including The Atlantic and Foreign Affairs. The slump in bank trust in Australia also comes after heavy falls in global markets last week.Commonwealth Bank CEO Matt Comyn, during his recent appearance in Canberra, described trust as \"absolutely the cornerstone of any financial institution – it needs to be – and of course we recognise it has been damaged and that is an enormous concern to us\".National Australia Bank CEO Andrew Thorburn told the House of Representatives economics committee that banks' \"drift\" from a long-term view to a short-term one partly explained their troubles, and \"given the risks and nature of our business, we should be planning over a five to 10-year horizon, not just one to two years.\"\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}