{"id": "Julian Assange speculation shows why charges should be public: Noah FeldmanYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    The word-processing error that unintentionally revealed the Justice Department's sealed charges against WikiLeaks founder Julian Assange is fascinating, not least because analogous mistakes can be found in texts going all the way back to the Babylonian Epic of Gilgamesh.It also raises important legal policy questions: In a free, open society, what justifies the use of secret indictments? Are they a nefarious tool of the deep state, like secret trials? Or are they a valuable mechanism for allowing law enforcement to do its job?The accidental disclosure of an Assange case originated with a federal prosecutor who was filing a motion with a federal court in Virginia to seal the criminal complaint against one Seitu Sulayman Kokayi. Twice in the short document, the name of the person whose charges were supposed to be sealed was given as \"Assange\" rather than \"Kokayi.\" The Kokayi case was recently unsealed, and the error was discovered by Seamus Hughes, a terrorism expert who monitors court cases.Anyone who's ever worked as a lawyer or a paralegal can tell you how this happened. Law firms and legal offices keep copies of sample documents containing boilerplate language - like the language prosecutors use to explain why a sealed criminal complaint is necessary.Often, the sample documents have names filled in. When I was a summer associate at a white-shoe firm 20 years ago, all the sample documents used the name of the investment bank that the firm had faithfully represented for more than half a century.In the Assange case, the sample document was probably changed and saved when the prosecutors filed the Assange sealing request.The lawyer drafting the document has the job of changing the names from the sample. The prosecutor in the \"Kokay\" case was most likely in too much of a rush - and didn't proofread.But don't be too scornful. The error is as old as books - or rather older.Consider this example from the ancient Gilgamesh epic, pointed out to me by the brilliant Bible scholar Idan Dershowitz, who is writing a book on what he calls \"errorology\".The epic tells the story of a worldwide flood and a man who survives it on an ark filled with animals. (Sound familiar?)In the Gilgamesh version, the role of Noah is played by a man called Utnapishtim. But in Tablet XI of the epic, the text accidentally calls the same hero by the name Atra-hasis.This slip-up allowed scholars to realise that the flood story must have been taken from an earlier text, in which Atra-hasis is the hero.When it comes to Assange, the error also conveys information - namely that prosecutors prepared a request to seal the charges. Subsequent reporting confirmed that the case is out there, although we don't know what the alleged crime is.The justification for sealing an indictment is typically that if the defendant knew he had been indicted, he would evade arrest by fleeing or avoiding capture. Sealing is supposed to be a last resort, usable only when the government couldn't simply redact the defendant's name from the charging documents.The decision is up to the court, not the prosecutor. That's why the request to seal was being filed in the Kokayi case and why it was filed in Assange's case as well.The legal requirement of justification, as well as the assignment of the authority to the judge, not the prosecutor, both signal that sealed indictments aren't desirable.The US Constitution requires that criminal trials be open to the public. It's a basic principle of the rule of law in a democracy that there be no secret criminal proceedings. Publicity enables scrutiny, oversight and protest if the law isn't being followed or if it isn't being applied fairly.Secret indictments come uncomfortably close to secret trials. In principle, the public should be able to know whom the government seeks to punish.Assange is a perfect example of why the public ought to know who is being charged. The case most likely raises tricky questions about freedom of speech. If he was a pure recipient and publisher of leaks, he deserves First Amendment protection. If he went further than that, and solicited criminal disclosures or coordinated his leaks as part of a conspiracy to distort electoral results, his conduct may have been outside the reach of the Bill of Rights and plausibly criminal.We don't know what he did or is alleged to have done - and that's just the point. Sealed indictments don't satisfy the public need to debate and consider the rightness of the prosecution.Yet it must also be remembered that if Assange is apprehended and stands trial, we would immediately know the nature of the charges. And if he's never caught, he'll never be put on trial. The US doesn't try people in absentia.It could be plausibly argued that the sealed chargers were needed in this case to help the US catch him.I'm not sure that argument should have convinced a judge. Assange has certainly long known that the US was interested in extraditing him. That's one reason he has stayed so long in the Ecuadorian Embassy in London. The sealing may therefore not have been warranted, all things considered.But that decision was properly for a judge to make. There are some situations where sealing an indictment is clearly warranted.And we now know about this one - courtesy of an epic fail of find-and-replace.Noah Feldman is a professor of law at Harvard University and was a clerk to US Supreme Court Justice David Souter.\n\n\n                        \n                                              Bloomberg\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}