{"id": "Airport that's set to become the world's biggest opens in IstanbulYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Istanbul | Recep Tayyip Erdogan has held plenty of grand opening ceremonies in his 15 years at Turkey's helm. On Monday he unveiled one of his prized jewels - Istanbul New Airport - a megaproject that has been dogged by concerns about labour rights, environmental issues and Turkey's weakening economy.Erdogan is opening what he claims will eventually become the world's largest air transport hub on the 95th anniversary of Turkey's establishment as a republic. It's a symbolic launch, as only limited flights will begin days later and a full move won't take place until the end of the year.Tens of thousands of workers have been scrambling to finish the airport to meet Erdogan's October 29 deadline. Protests in September over poor working conditions and dozens of construction deaths have highlighted the human cost of the project.Istanbul New Airport, on shores of the Black Sea, will serve 90 million passengers annually in its first phase. At its completion in 10 years, it will occupy nearly 19,000 acres and serve up to 200 million travellers a year with six runways. That's almost double the traffic at world's biggest airport currently, Atlanta's Hartsfield-Jackson.\"This airport is going to be the most important hub between Asia and Europe,\" Kadri Samsunlu, head of the five-company consortium Istanbul Grand Airport, told reporters on Thursday.The airport's interiors nod to Turkish and Islamic designs and its tulip-shaped air traffic control tower won the 2016 International Architecture Award. It also uses mobile applications and artificial intelligence for customers, is energy efficient and boasts a high-tech security system.All aviation operations will move there at the end of December when Istanbul's main international airport, named after Turkey's founder Mustafa Kemal Ataturk, is closed down. Ataturk Airport now handles 64 million people a year. On the Asian side of the city, Sabiha Gokcen Airport handled 31 million passengers last year. It will remain open.Erdogan is expected to announce the official name of the new airport, part of his plan to transform Turkey into a global player.Turkish Airlines will launch its first flights out of the new airport to three local destinations: Ankara, Antalya and Izmir. It will also fly to Baku and Ercan in northern Cyprus.Nihat Demir, head of a construction workers' union, said the rush to meet Erdogan's deadline has been a major cause of the accidents and deaths at the site that employs 36,000 people.\"The airport has become a cemetery,\" he said, describing the pressure to finish as relentless and blaming long working hours for leading to \"carelessness, accidents and deaths.\"The Dev-Yapi-Is union has identified 37 worker deaths at the site and claimed more than 100 dead remain unidentified.Turkey's Ministry of Labour has denied media reports about hundreds of airport construction deaths, saying in February that 27 workers had died at the site due to \"health problems and traffic accidents\". It has not commented since then.Airport workers in September began a strike against poor working conditions, including unpaid salaries, bedbugs, unsafe food and inadequate transport to the site. Security forces rounded up hundreds of workers and formally arrested nearly 30, among them union leaders. The company said it was working to improve conditions.Megaprojects in northern Istanbul like the airport, the third bridge connecting Istanbul's Asian and European shores and Erdogan's yet-to-start plans for a man-made canal parallel to the Bosporus strait are also affecting the environment. The environmental group Northern Forests Defence said the new airport has destroyed forests, wetlands and coastal sand dunes and threatens biodiversity.These projects are spurring additional construction of transportation networks, housing and business centres in already overpopulated Istanbul, where more than 15 million people live. Samsunlu, the airport executive, said an \"airport city\" for innovation and technology would also be built.The five Turkish companies that won the $US29 billion ($41 billion) tender in 2013 under the \"build-operate-transfer\" model have been financing the project through capital and bank loans. IGA will operate the airport for 25 years.Financial observers say lending has fuelled much of Turkey's growth and its construction boom, leaving the private sector with a huge $US200 billion debt. With inflation and unemployment in Turkey at double digits and a national currency that has lost as much as 40 per cent of its value against the dollar this year, economists say Turkey is clearly facing an economic downturn.Despite those dark financial clouds, the airport consortium hopes the world's growing aviation industry will generate both jobs and billions of dollars in returns.\"Istanbul New Airport will remain ambitious for growth and we will carry on mastering the challenge to be the biggest and the best. That's our motto,\" Samsunlu said.\n\n\n                        \n                                              AAP\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}