{"id": "New Prospa competitor Lumi launches with $31.5 million raiseYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Lumi, a new small-business lender, has raised  $31.5 million from Israeli and Australian investors to enter the local market and take on the likes of Prospa. The SME lender was founded by Yanir Yakutiel, who was previously chief executive at another small-business lender called Sail. However, he left along with some of his former staff to found Lumi after a disagreement with other executives over its direction.\"The key lesson was that a start-up is a team sport. It doesn't matter who you have at the top, or at the side, it's the strength and cohesiveness of the team that is paramount and it's impossible to do otherwise,\" Mr Yakutiel told The Australian Financial Review.\"The second thing is that you have to have all the stakeholders properly aligned on the same vision. Things change, it's like a marriage … but you need a basic alignment of culture, vision and values that will let you transition as the business changes.\"That was really fundamental for me in this capital raise, we wanted investors who were aligned with our vision and our dream.\"Lumi, which offers loans between $5000 and $100,000 for up to 12 months, raised $25 million in debt from Israel's largest specialist credit fund Arbel Fund, while $6.5 million in equity came from investor Josh Liberman, as well as venture capital fund Follow[The]Seed and Merchant Group's Justin Klintberg.It is one of a growing number of SME lenders in the Australian market and it sees its biggest competitors as Prospa, Capify, GetCapital, Moula, OnDeck and Spotcap.​All of the players signed an industry code of practice earlier this year which aimed to bring transparency and increased disclosure to the sector. Lumi also intends to sign this charter.Prospa attempted to float on the ASX in June and would have come to market with a $576 million market capitalisation, but following queries from the Australian Securities and Investments Commission \"in the context of an industry wide review\", it delayed its listing 15 minutes before it was due to start trading.This led to nervousness amongst underwriters and bankers from Macquarie Capital and UBS decided it was \"in the best interest of the company and new investors\" to permanently delay the initial public offering.In the lead-up to the listing it had been revealed that Prospa's average annual interest rate was 40 per cent (which has since declined to 37 per cent).Lumi will have a similar clientele but has smaller loan sizes and shorter repayment times (Prospa offers up to $250,000 loans for up to 24 months).Mr Yakutiel would not disclose the peak interest rate Lumi could charge, saying it was risk-adjusted based on the borrower, but said rates would start in the high teens.\"With these businesses [that are borrowing money] … it's very easy to approve the very good ones and decline the very bad ones. We look in the middle,\" he said.\"We have to see what will lead us to approve or decline it. A strong advantage is that we analyse data algorithmically, so it's easier to pick up trends than if it was a human underwriter.\"Lumi combines the traditional financial data of an applicant with information gathered on the business owners' \"social footprint\". Mr Yakutiel would not go into detail on what these social data points were.\"The behavioural attributes of the business sometimes can be seen within the behaviours of its stakeholders. If we see negative or positive attributes, given their high level of influence on the business they can be used with a high level of certainty,\" he said.Lumi is based in Bondi Junction and has 15 staff, it is targeting 20-30 per cent market share in the non-bank SME lending space within the next few years. It will use the capital raised to fund the loans and intends to exhaust its pool of capital within the next nine months. At this time it will look to raise more financing, either by tapping on the shoulder of Arbel again, or through an additional institutional investor.Mr Yakutiel's previous venture, Sail, also raised $8 million of capital in 2016, but with Lumi he said he wanted to bring on board offshore backers.\"As credit markets tighten in Australia, our ability to fund ourselves offshore is of a strategic importance to us,\" he said.\"It's no coincidence that we went to an institutional funder and leapfrogged family office debt capital because that market is not deep enough. [Originally] I thought there would be a deeper debt private capital market in Australia than there is.\"\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}