{"id": "Kiwis to get 20-times NBN speeds for similar priceYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    New Zealanders will soon be getting internet speeds 20 times faster than those enjoyed by most Australians for just a few dollars more a month, further widening an already-huge gap between the two countries' broadband networks.Chorus, the ASX-listed company that operates New Zealand's broadband network, revealed on Wednesday it would slash the wholesale price of its ultra-fast one-gigabit plan.From the middle of next year, the price of the plan will go from $NZ65 ($61) to $NZ60 ($56.30) a month. Chorus will further reduce it to $NZ56 the following year.Internet speeds of one gigabit per second (Gbps) are 20 times faster than the most popular speed available on Australia's national broadband network of 50 megabits per second (Mbps), the plan almost half of NBN users are on. NBN Co sells its 50 Mbps plan to retailers for $45 a month, only $7.50 less than Chorus will charge for its 1 Gbps plan by 2020.NBN Co's 100 Mbps bundle, meanwhile, costs $65 a month. That means even today, New Zealand retailers are paying less for a plan that is 10 times faster. Overall, New Zealand's fixed-line fibre broadband is delivering much faster speeds to households than Australia's NBN.Of the half a million connections to Chorus' high-speed network, about 70 per cent are on 100 Mbps plans. No connections are less than 50 Mbps, and 36,000 connections are 1 Gbps.By contrast, of the 4.5 million connections to Australia's NBN, 40 per cent are on speeds of 50 Mbps, and 30 per cent on speeds of just 12 Mbps. Less than 10 per cent are on speeds of 100 Mbps, while fewer than 600 individual connections are on speeds higher than 100 Mbps.Unlike the NBN, New Zealand's network is 100 per cent fibre to the premises, meaning it can easily support much higher speeds at lower wholesale costs.Australia's network is a mix of fibre to the premises, fibre to the node, fibre to the kerb, and hybrid fibre-coaxial. According to telecommunication expert Paul Budde, this mix of high and low quality technologies created a \"limited network\" that could not \"handle\" high-speed internet for everyone.\"It's not fitted for true high-speed internet,\" Mr Budde said.\"This is as good at it gets in Australia for the time being. The government will have to bite the bullet and bring fibre to the premises, or at least to the kerb. But that's going to cost an extra $30 billion to $40 billion.\"That, he said, meant going through yet more political wrangling, inquiries and attempts to legislate.\"It's not a pretty picture,\" he said.Former NBN Co chief Bill Morrow responded to the constant negative comparisons with New Zealand's network in a blog post last year, in which he argued comparing the two countries was comparing \"apples with oranges\". One of his central points was that unlike the NBN, the New Zealand network was built by Chorus, the infrastructure arm of formerly nationally-owned Telecom NZ, which already owned the nation's copper network.NBN Co, by contrast, had to buy or lease Telstra's network, massively increasing the cost. Australia was unable to follow New Zealand's model because it did not split Telstra into a retail and wholesale business when the telco giant was privatised in the late 1990s and early 2000s.An NBN Co spokesperson said: \"Our priority is to complete the network build by 2020, which will provide wholesale broadband access of at least 25Mbps for all Australians and 50Mbps to 90 per cent of the fixed-broadband footprint at price point that is attractive to internet providers, ensures a certain level of customer experience and recoups the investment made by the federal government.\"\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}