{"id": "US Vice-President Mike Pence to throw down the gauntlet to China during PNG visitYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    US Vice-President Mike Pence will continue the Trump administration's assault on China's \"authoritarianism and aggression\", using a speech in Australia's backyard to business chiefs to outline the US's rival vision for the Indo-Pacific that extols the superiority of private investment over state-controlled funding to build regional infrastructure.With Donald Trump opting to skip the East Asia and Asia-Pacific Economic Cooperation summits this week, Mr Pence and the President's hardline national security adviser John Bolton will travel to Singapore and Papua New Guinea to push back against Beijing's attempt to assert its influence on both economic and security fronts.Mr Pence will also hold a series of bilateral meetings with Prime Minister Scott Morrison and other key regional leaders, but the centrepiece of his trip is a speech at the APEC chief executive forum on Saturday morning in Port Moresby. Mr Pence will deliver his speech just minutes after Chinese President Xi Jinping speaks at the forum, which Mr Morrison will also address.US officials said the speech would \"connect\" to one Mr Pence delivered in early October accusing China of stealing US intellectual property, suppressing human rights and meddling in US elections – an address analysts said marked the start of a cold war between Washington DC and Beijing.With tensions already high between the US and China over trade, the two countries are locked in a race for regional influence in Asia and the Pacific. Mr Pence will seek to counter China's Belt and Road Initiative with the promise of US assistance for infrastructure development.It is expected Mr Pence will flesh out details of a new trilateral partnership with Australia and Japan, to support infrastructure development, with several projects identified.Amid concerns over Mr Trump's isolationist \"America first\" rhetoric, Mr Pence will stress how a private-sector driven approach can bring prosperity to both the Indo-Pacific as well as the US. He will also emphasise the importance of sovereignty for the countries in the region, including a transparent and corruption-free civil society, free and open internet and freedom of navigation rights for shipping and aircraft – a direct shot at China for trying to coerce less powerful nations.In his speech and throughout their visit, Mr Pence and Mr Bolton will also hammer China over its militarisation of the South China Sea, the importance of keeping up economic and diplomatic pressure on North Korea to denuclearise and the ongoing fight to counter terrorism.Mr Pence will \"deliver the message that authoritarianism, aggression, and the disregard for other nations' sovereignty by any nation in the Indo-Pacific will not be tolerated by the United States\", his spokeswoman said.In an opinion piece for The Washington Post published on the weekend, Mr Pence wrote that \"Businesses, not bureaucrats, will drive our efforts, because governments and state-owned enterprises are incapable of building lasting prosperity\"The United States will work with like-minded nations – from India to the Pacific islands – to advance our shared interests. Together, we will stand up to anyone who threatens our interests and our values. The United States seeks collaboration, not control.\" Mr Pence's trip to the region will be a prelude to a crucial meeting between Mr Trump and Mr Xi on the sidelines of the G20 summit in Argentina later this month, talks that could pave the way for peace or an escalation in the trade war between the US and China.The Vice-President will base himself in Cairns during APEC, flying to Port Moresby each day for events. He will arrive on Friday and meet Deputy Prime Minister Michael McCormackPrime Minister Scott Morrison will use APEC as a chance to meet many Pacific Island nation leaders, hard on the heels of announcing a pivot in foreign policy last week to put greater emphasis on the region, including making $3 billion available in loans and export grants.He will host them for a barbecue at the Australian High Commissioner's house on Sunday evening, although Mr Xi is also planning his own reception for them.Australia's aims at APEC will be to emphasise the virtues of open trade and investment. Key policy themes will include digital trade and economic integration. However climate change – an issue of existential importance to Pacific islands – risks being marginalised in light of the US's well-documented opposition to the Paris emissions reduction pact. With both Mr Trump and Russian President Vladimir Putin skipping APEC, Mr Xi will be the most notable world leader at the summit.\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}