{"id": "Seven West Media and News Corp explore co-productions and marketing initiativeYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Seven West Media and News Corp are exploring a number of strategic tie-ups, including co-productions and marketing initiatives, which would see the pair's media portfolios work more closely without a corporate transaction.Sources said Seven and Foxtel could work together in a similar way the pay TV broadcaster did with Network Ten on the co-production of reality show Gogglebox, which is now into its sixth season and airs on both free-to-air and subscription TV.Seven, the home of House Rules and My Kitchen Rules, and News Corp have a history of working together on projects, including drama A Place to Call Home, which Seven produces for Foxtel, the Pride of Australia Awards and subscription video on-demand service Presto, which was shut down in in 2016. The pair also partner in Western Australia, where Seven prints a number of News Corp newspapers.\"We are always exploring opportunities to partner with a wide range of organisations,\" A Seven spokesman said.\"We've worked with News on a number of marketing initiatives, and produced four seasons of  A Place To Call Home for Foxtel and no doubt we will work together in the future.\"The metro network's production business, Seven Studios, has become an integral part of its overall business, nearly doubling earnings before interest and tax over the last six years to make up close to a quarter of Seven's $235.6 million EBIT for 2017-18.Seven will hold its annual upfronts on Friday, where it will outline its content and strategy for the year head. However, talks with News Corp are believed to be in their early stages and there are no expectations of tie-ups being announced Friday.In August, Seven boss Tim Worner flagged the the network would look for deeper ties with News Corp in the wake of the announcement of the merger of rival Nine Entertainment with Fairfax Media, publisher of The Australian Financial Review.While not ruling out M&A, Mr Worner said it wasn't a necessity.\"You don't need corporate transactions to be able to effectively compete. Some of those opportunities may well involve News Corp and that doesn't necessarily mean a corporate transaction. There's going to be opportunities for us to deepen commercial ties,\" Mr Worner said.\"The News Corp audience is far more compatible with the Seven audience, so you may well see more development in that regard.\"New Corp's Australian News Channel, which owns Sky News, has done deals with Nine Entertainment to create new free-to-air and subscription channel Your Money and WIN Corporation for a 24/7 news channel across 29 regional markets.After News Corp co-chairman Lachlan Murdoch missed out on Network Ten last year, which was snapped up by US studio giant CBS, the publisher ran the ruler over a potential transaction with Seven, as revealed by the Financial Review in May. However, ultimately nothing progressed in terms of a transaction and sources said News Corp's primary focus is turning around Foxtel.Seven is also known to have held talks with Fairfax, prior to the later's merger deal with Nine.Seven's share price recovery has also made a takeover scenario more unlikely. Seven's stock has jumped close to 50 per cent in calendar 2018.While still incredibly competitive rivals, Australian broadcasters have made no secret of the fact they are open to working together if a project is mutually beneficial.Nine and Seven are owners of the newly created NPC Media, which provides a playout hub and consolidating infrastructure, and allow the networks to instead compete in areas such as content. Southern Cross Austereo, which broadcasts to many parts of regional Australia recently signed up to use NPC Media.Nine, Seven, Ten and Foxtel, via industry body ThinkTV, are working to create a new briefing portal which plugs in all their various trading platforms to allow advertisers and agencies to brief the broadcasters on a campaign in a single location.\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}