{"id": "Gina Rinehart 'pays more tax than any other Australian'You have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Iron ore magnate and company tax cut advocate Gina Rinehart says she is now Australia's single-biggest taxpayer after her private company reported a big jump in annual profit to $1.37 billion.Hancock Prospecting's profits increased by 28 per cent in 2017-18 and it paid $860 million in federal and state taxes, up from $698 million last year.The company's flagship $US10 billion ($14.05 billion) Roy Hill iron ore project in Western Australia was a big contributor as revenue increased from $4.45 billion to more than $6 billion.Hancock Prospecting has paid almost $5 billion in taxes over the past eight years and the company highlighted the contribution made by Mrs Rinehart in a statement accompanying the annual results.\"Mrs Gina Rinehart, personally and through HPPL (Hancock Prospecting) private group, pays more tax than any other Australian,\" it said.\"Mrs Rinehart continues to primarily direct investment into Australia and pays substantial taxation in Australia, while providing employment and opportunities for many thousands of Australians, directly and indirectly.\"The daughter of iron ore industry trailblazer Lang Hancock regularly speaks out in favour of cuts in company taxes and red tape to boost the Australian economy.She is also a fan of Donald Trump's tax policies and credits him for reviving the American economy by slashing the corporate tax rate from 35 per cent to 21 per cent.Hancock Prospecting is yet to receive any dividends from Roy Hill, which achieved its 55 million tonne a year nameplate capacity in September last year, with cash flow from the project being used to pay down debt by about $800 million.The three Hope Downs mines, subject to a partnership agreement with Rio Tinto that sees royalties flow to Hancock Prospecting, operated at or above nameplate capacity of 45 million tonnes.Hancock Prospecting said the average iron ore price achieved was virtually unchanged on the previous year, with Roy Hill remaining immune from substantial discounting in the price of lower grades.\"The impact on ore produced by Roy Hill, which is priced on the higher 62 per cent index was much more limited, with Roy Hill continuing to achieve more than 90 per cent of the 62 per cent Platts index on average over the year,\" it said.Mrs Rinehart's continuing legal battles with two of her four children and with the heirs of Lang Hancock's former business partner Peter Wright cast some shadow over the annual results.Although Hancock Prospecting paid $191 million in dividends another additional $338 million was set side and payment delayed because of the dispute with her two eldest children, John Hancock and Bianca Rinehart, related to the Hope Margaret Hancock Trust.The dispute is now in arbitration after action in the Federal Court but, in the meantime, Hancock Prospecting said under the terms of the deed it had increased the provision for unpaid dividends to $1.24 billion at September 30.The annual results also refer to Supreme Court action by Wright Prospecting over royalties from the Hope Downs mining operations and for a part-ownership in mining tenements formerly known as East Angelas and now known as Hope Downs 4, 5 and 6.Hancock Prospecting's Australian Outback Beef, the owner of the S. Kidman & Co cattle empire purchased for $387 million in late 2016, increased its revenue to $51.1 million with underlying next profit after tax of $10.1 million.The company described itself as the most successful private mining and agriculture company in Australia's history and said it would continue to look at more acquisitions in those sectors.It recently acquired junior miner Atlas Iron after staring down Andrew Forrest's Fortescue Metals Group, advanced the first $US250 million tranche of its investment in UK-based potash mine developer Sirius Minerals and paid about $69 million for a 19.9 per cent stake in Riversdale Resources, the owner of the Grassy Mountain hard coking coal project in Canada.Hancock Prospecting said it was investing in exploration and evaluation of wholly owned iron ore projects and on future Hope Downs mines with joint venture partner Rio Tinto.\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}