{"id": "Encryption laws threaten $3b cyber security industry, tech firm Senetas warnsYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    New powers for spy agencies to snoop on phones and electronic communications threaten to scare off local investment in cybersecurity research and development and could force some tech companies to shift overseas, a leading encryption software company claims.The warning from listed tech company and government contractor Senetas has had Labor signal its concern over the potential commercial impact of the Morrison government's proposed encryption laws, amid growing alarm from businesses and industry groups that the changes jeopardise internet security and erode trust in privacy.But Home Affairs Minister Peter Dutton has highlighted the importance of encryption laws in the wake of Friday's Bourke Street terror attack in Melbourne, arguing they would make it easier for security agencies like ASIO to keep on top of threats.\"And as we say, and as ASIO and the Australian Federal Police have said for a long time, where you've got a soft target, that is a place of mass gathering whether it's a shopping centre or a mall, wherever it might be and you've got a low level of sophistication – so somebody grabbing a kitchen knife and picking up a couple of gas bottles – it's very hard unless you've got direct evidence,\" he told the ABC.\"It's made even harder at the moment because many terrorists are communicating through encrypted messaging apps and the agencies aren't able to access that information in a way that they would have through a text message or a telephone call even five or six years ago.\"In its submission to Parliament's joint intelligence committee inquiry into the encryption laws, Senetas – which provides encryption technology for the Australian and US military – said there would be \"damaging consequences\", including harming the reputation of Australian developers and manufacturers and resulting in a loss of trust in Australian cybersecurity products.Senetas says the proposed laws are similar to Canberra's treatment of Chinese device manufacturer Huawei, which security agencies have recommended be banned from participating in the 5G network rollout because of national security laws that compel Chinese tech companies and telcos to co-operate with intelligence gathering.\"Foreign governments and competitors will use the existence of this legislation to claim that Australian cybersecurity products are required to use, or collaborate in, creating encryption \"back doors\" or key escrows,\" the submission said.\"With export values exceeding $3 billion we face the real prospect of sales being lost, exports declining, local companies failing or leaving Australia, jobs in this industry disappearing and related technical skills deteriorating.\"Senetas is also concerned by the increased risk that hackers and other cyber criminals could become aware of weaknesses introduced into systems at the request of security agencies.\"From the perspective of an internal or external 'bad actor', becoming aware of a \"systemic weakness\" may act as an incentive to misuse that information, make it known to others and/or sell the information discreetly,\" the submission said.Shadow attorney-general Mark Dreyfus said Labor had a bipartisan approach to national security matters but it was important legislation had in place practical measures that did not have unintended consequences.\"This is an important contribution from Senetas – it appears that the potential commercial impact on Australian business of this legislation may have been overlooked by the government,\" he said.\"I look forward to scrutinising this issue further in upcoming hearings of the Parliamentary Joint Committee on Intelligence and Security. This is exactly the purpose of the PJCIS inquiry process, which has consistently resulted in bipartisan recommendations that have strengthened and improved proposed national security legislation, and which the government has consistently endorsed.\"\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}