{"id": "Did Camp David doom the Palestinians?You have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    The Camp David Accords have long been hailed as a pre-eminent example of US diplomacy at its best – a landmark agreement that produced the framework for the Egyptian-Israeli peace treaty, as well as the guidelines for an interim period of Palestinian self-rule and for future final-status negotiations that Washington hoped would resolve the Israeli-Palestinian conflict.Seth Anziska's new book, Preventing Palestine: A Political History From Camp David to Oslo, tells a very different story. Rather than celebrating the Camp David Accords, he portrays them as largely responsible for denying the Palestinians self-determination and statehood.Aside from challenging the conventional wisdom about the Camp David Accords, the author's personal story is bound to increase interest in the book. He was raised as an Orthodox Jew in the United States and travelled to Israel to study at a religious school known as a yeshiva during his year between high school and college. His yeshiva was in Gush Etzion in the West Bank, and his year began in August 2001, at the height of the Second Intifada. The Second Intifada was bloody – 1100 Israelis and close to 4000 Palestinians were killed. Palestinian suicide bombers attacked Israeli buses, cafes, restaurants and other public places – and Israel's crackdown and closures in response cost the Palestinians in the West Bank dearly.For Israelis, this wave of Palestinian terrorism came after their government had been poised to make far-reaching concessions that would have provided for a Palestinian state. It was not just that Yasser Arafat, the leader of the Palestine Liberation Organisation (PLO), rejected proposals in July 2000, but he also said no to US President Bill Clinton's parameters presented in December of that year – parameters that went well beyond what then-Israeli Prime Minister Ehud Barak proposed at the summit in July. I played a key role in drafting the parameters that the US government presented as a bridging proposal at the request of both the Israeli and Palestinian negotiators. And I was present at the meeting between Arafat and Clinton when Arafat rejected them. His rejection and the resort to violence left the Israeli public believing that there was no Palestinian partner for peace.What makes Anziska's perspective especially unique is that his reaction to being in Israel and the West Bank at this time produced not only revulsion at Palestinian acts of terrorism and empathy for what Israelis were feeling, as was no doubt the case for many of his classmates. In addition, he describes the hardships that Palestinians were subjected to and how it affected him: \"We would pass through a large checkpoint on the outskirts of Beit Jala, a Palestinian town adjacent to Bethlehem. There would always be a long line of Palestinians sitting in their cars or standing nearby, waiting to pass. As our bus bypassed the line and zipped through the checkpoint, I would peer at them from the bulletproof window. Something did not sit right with me on those frequent journeys.\" He saw what he calls the bleak conditions that Palestinians endured and how that stood in stark contrast with the \"Jewish population living or travelling through the West Bank\".These disparities troubled him and led him in the aftermath of his year at the yeshiva to take a much greater interest \"in the political nature of the conflict between Israel and the Palestinians\". Anziska's empathy for Palestinian suffering says something about his own humanity and drives him to try to understand what could have led the Palestinians to carry out violent acts of terrorism.He sees the conflict as rooted in the denial of Palestinian national rights and believes it endures because of that. For this reason, he decided to investigate why – and when – the process of denying Palestinian rights took hold.After becoming an academic, his study ultimately led to a PhD. at Columbia University and this book – a study that, among other things, draws extensively on archival and declassified materials. Some of those documents are publicly revealed in his book for the first time, and many readers are likely to find them interesting. (Full disclosure: Anziska describes a number of memos that I wrote in the 1980s during the Reagan administration.)Anziska's core argument has several parts: The Camp David Accords allowed the Israeli vision for the territories to win at the expense of Palestinian national rights; that vision – which was really the brainchild of former Israeli Prime Minister Menachem Begin – not only permitted limited cultural, functional, and economic autonomy for Palestinians as individuals but also denied them the collective right of self-determination and sovereignty over the land in the West Bank and Gaza; it permitted Israel to greatly expand settlements and control the West Bank without formally annexing it; both the United States and Egypt might have talked a good game about Palestinian rights but acquiesced to the Israeli vision, particularly because the Israelis were far more determined than either the Americans or the Egyptians; and that by excluding the PLO from the diplomacy, at a time when it was evolving and interested in engagement, the other three parties excluded the key representative of the Palestinian national movement and denied the Palestinians any say in their own future, thereby ensuring their statelessness and deep frustration. Finally, Anziska argues, the Oslo peace process of the early 1990s inherited the structural architecture of Camp David – meaning autonomy and a transition period rather than true statehood – and produced the Palestinian Authority (PA). But the PA remains powerless to affect Israeli settlement building and expansion and is far from being a state.These particular points find constant expression throughout the book. It is interesting that US policymakers at the time, myself included, did not believe that the die had been cast the way Anziska suggests. It is true that the Camp David structure established in 1978 would influence all subsequent efforts from the Madrid Conference in 1991 to the Oslo Accords of 1993, but those of us negotiating the agreements did not see them as denying Palestinian rights.Anziska's core critique of Camp David and its aftermath is that a \"tendency to canonise Camp David – even by President [Jimmy] Carter himself – has obscured the structural deficiencies enshrined by these early negotiations\". For Anziska, those deficiencies were centred on but not limited to the meaning of autonomy and its implications.\"In emphasising individual rights and de-territorialised autonomy, rather than allowing for collective self-determination,\" he argues, \"the Israeli government and their compliant US and Egyptian counterparts helped solidify a non-national, non-statist arrangement for Palestinians.\" Crucially, the reality of the Camp David Accords and the autonomy talks it produced set the stage, Anziska contends, for limiting what was possible by the time the Oslo process came along in the 1990s. \"By conditioning Palestinian political rights on a narrowly functionalist and non-territorial definition of autonomy alongside continued Israeli settlement expansion in the occupied territories,\" he writes, \"the earlier talks undercut the possibility of Palestinian sovereignty long before the 'peace process' of the 1990s had begun.\"For Anziska, Oslo's failure should be blamed on the foundational mistakes that were made at Camp David and afterward – but this raises the question of whether, and why, the United States and Egypt acquiesced to Israel's preferences. He argues that Carter became consumed with daunting regional and international challenges: the revolution in Iran, the hostage crisis, the Soviet invasion of Afghanistan, and the Iraq-Iran War. These diverted his attention away from follow-through on Camp David and the autonomy talks. The looming 1980 presidential election probably played an even greater role in Carter's calculus at this stage, according to Anziska. The appointment of Robert Strauss, a longtime stalwart of the Democratic Party, as the first US negotiator in the autonomy talks showed an awareness of the political sensitivity of the negotiations at this time. But Strauss had previously been a successful trade negotiator, and Carter trusted him. Appointing a savvy political operator did not mean that he was unwilling to oppose Israel's position, as Anziska suggests. (On the contrary, in my later discussions with Strauss about the autonomy talks, he left little doubt that he pushed the Israelis on certain issues.)As for the Egyptians, Anziska points out that Egyptian President Anwar Sadat opposed a Palestinian state because he was convinced the PLO would run it and it would become a Soviet-client state – and he had switched sides in the Cold War from an alliance with the Soviets to a close relationship with the United States, starting after the 1973 war with Israel. Moreover, Sadat was most concerned about getting his land in the Sinai Peninsula back and gaining serious economic support from Washington – which he desperately needed. Anziska leaves no doubt that Sadat sacrificed Palestinian interests so he could reach a bilateral agreement with Israel:\"In Egypt's feeble response and explicit countenancing of the Israeli notion that autonomy would preclude rather than facilitate Palestinian statehood, Cairo had enabled the breakthrough on bilateral peace at Camp David to thwart a political solution for the Palestinians.\" Sadat certainly put Egypt's interests first. But, in my view, he was not trying to prevent a political solution for the Palestinians.In addition, Anziska contends that both the United States and Egypt were also guilty of keeping the PLO out of the process before and after the Camp David Accords. This was especially egregious not only because the Palestinians needed to take part but also because the PLO was evolving and sought diplomatic engagement. Indeed, Anziska argues that after the October 1973 war, \"the PLO sought a place within the comprehensive diplomatic negotiations, which required political compromise and the eventual embrace of a state on far less territory than historic Palestine\". It was, he continues, shifting away from armed resistance in favour of engagement. \"Without ignoring the violence\" of Palestinian groups during the 1970s, he writes, \"it is possible to highlight a strategic rethinking of Palestinian national aims and motivations that was under way on the eve of crucial Arab-Israeli negotiations\".Why, then, did the Carter administration exclude the PLO given these changes? One key factor, according to Anziska, is that Washington was constrained by the \"straitjacket\" of former Secretary of State Henry Kissinger's prior commitments to the Israelis. In 1975, as part of the Sinai II agreement, Kissinger had promised Israel that the United States would not deal with the PLO until it recognised Israel's right to exist and accepted United Nations Security Council Resolutions 242 and 338. (UN Security Council Resolution 242, adopted after the Six-Day War of 1967, came to be known as the land-for-peace resolution because it called for withdrawal from territories occupied to secure and recognised borders and for all states in the region to live in peace. Resolution 338 was the cease-fire resolution that ended the 1973 war and called for negotiations to implement Resolution 242.)And here we begin to get into the fundamental problems I see with the book – both as someone who has studied the period and as a practitioner who has been deeply involved in Arab-Israeli diplomacy since the early 1980s as an official in the Reagan, George H.W. Bush, Clinton, and Obama administrations.The Carter administration was mindful of the Kissinger commitments but felt it could reinterpret them. Because Resolution 242 referred to the Palestinians only indirectly as refugees, Carter and his secretary of state, Cyrus Vance, agreed that the PLO could accept 242 with a reservation – that Palestinians must be dealt with as a people. The Saudis indicated that Arafat would accept 242 on those terms. Gone was the need to recognise Israel's right to exist or even to accept 242 and 338 as is. Still, the PLO rejected the offer, also embarrassing the Saudis in the process. Anziska acknowledges this failed attempt but blames it on the PLO's factional politics, noting the competing factions in the PLO meant Arafat \"had little room for manoeuvre\".Further, he acknowledges that there were \"intensive American efforts to engage with the organisation via intermediaries and secret channels\" to secure acceptance of 242 but that the internally divided PLO refused \"to concede recognition of Israel without guarantees of a state in return\".But Carter and Vance were not asking for recognition – just acceptance of a modified version of 242. Here it is worth recalling that Israel does not appear by name in 242. What this episode reveals is that the PLO had an opportunity to join the process but chose not to do so. Interestingly, while Anziska at one point suggests that Arafat may have overplayed his hand, he nonetheless justifies Arafat's decision because he was not getting recognition of statehood in return. Anziska asserts that Arafat's \"worries were well-founded, as statehood was not ever fully on the table\".But, crucially, Anziska ignores what Arafat could have gotten, had he accepted what was offered multiple times by Carter and repeated during the 1980s when the Reagan administration, in concert with Jordan's King Hussein, was prepared to initiate discussions with a joint Jordanian-PLO delegation if Arafat accepted 242. The Reagan administration, in which I served, pursued this effort throughout 1985 and 1986, believing we could launch a serious diplomatic process that would bring that joint delegation into direct talks with Israel. The United States was trying to include the PLO, provided Arafat would accept 242. Repeatedly, King Hussein told us that Arafat was ready and a meeting could be set up and then at the last minute Arafat would back away, hedge, or qualify what he could say. This process went on until King Hussein gave up, telling us he would no longer tie his credibility to Arafat's.If Arafat had accepted the Carter or Reagan formulas, he almost certainly would have triggered a breach between the United States and Israel. As a result, Arafat would have shifted the onus onto Israel, benefited from an inevitable US-Israel imbroglio, and found himself at the table. But Arafat was unable or unwilling to take advantage of a clear opening.A fundamental part of Anziska's critique of the Camp David Accords is the exclusion of the Palestinians. But the Palestinians effectively excluded themselves on multiple occasions – a reality he chooses to minimise. Moreover, Anziska suggests that Palestinian violence had mostly ended except for the acts of dissident factions in the PLO after 1973. Yet former Israeli Prime Minister Yitzhak Rabin would tell me later that Arafat was directly involved in ordering the attack and killings of schoolchildren in Maalot in  1974. And Anziska himself acknowledges that the Coastal Road massacre – to this day the single deadliest terrorist event in Israel – was carried out by Fatah, Arafat's faction, in March 1978. Later, the hijacking of the Achille Lauro and the killing of Leon Klinghoffer in 1985 was carried out by Abu Abbas, a member of the PLO Executive Committee. Arafat did not condemn any of these acts of terrorism, nor did he expel Abu Abbas from the Executive Committee.Anziska also does not explain the real reason President George H.W. Bush suspended the dialogue with the PLO in June 1990 after an attempted terrorist attack in Tel Aviv that Abu Abbas was behind. It was because Arafat refused Washington's quiet entreaties to condemn the attack and expel or suspend Abu Abbas' membership in the PLO Executive Committee if he wanted to preserve the dialogue with the United States. It's possible that Anziska did not know the backstory to the US suspension of the dialogue; I do, because I was involved in it.Anziska's book at times seems to dismiss Israel's security concerns. He refers to Begin's \"maudlin readings of Jewish history\" as if they are overwrought and necessarily exaggerate what Israel felt it needed from a security standpoint. Similarly, he quotes Yosef Burg, the Israeli negotiator in the autonomy talks with the Egyptians, as saying \"no hostile element or agent or force dare control the heartland [the West Bank] of this land … and thereby hold a knife to the jugular vein of Israel\". Anziska cites Burg to prove that Israel did not intend to surrender sovereignty or control of the West Bank, but Israel's security fears were also real.In Israeli eyes, the PLO's actions, not occasional rhetorical hints of moderation, defined what the organisation was.Israeli security concerns, given the actual behaviour of the PLO and other security threats, led many on the Israeli right to believe it was too risky to give up the territory. While Begin's ideology coloured his view of the West Bank and Gaza, Burg and others' perceptions of what they could live with might well have been altered by the emergence of a genuine Palestinian partner who did not play a double game on terrorism and who understood Israeli fears and was willing accept security arrangements that addressed them.Instead, Arafat repeatedly failed to condemn violence against Israelis and didn't accept Resolution 242 until 1988, when he was trying to prove his relevance given the impact of the First Intifada – a grassroots uprising initiated and organised by ordinary Palestinians in the West Bank and Gaza, not by Arafat. That uprising forced Arafat to demonstrate his relevance, and later, having chosen the wrong side in backing Saddam Hussein during the Gulf War, he was desperate to get back in the game and play a role in the Oslo process that produced his recognition of Israel in 1993.Anziska's book too often seems to absolve the Palestinians of any responsibility for their predicament. They were excluded but essentially because they chose to be – from 1977 until 1988. Arafat could have said yes to Carter or Reagan, but the lowest common denominator defined the PLO's policies until the costs of irrelevance become too high.Perpetuating the impression that the Palestinians are purely victims who played no part in their being victims, unfortunately, perpetuates the narrative that the conflict is everyone else's fault. The Palestinians are not and have not been powerless to affect their reality. Regrettably, however, the sad truth is that at critical junctures, Palestinian leaders chose to say no and the Palestinian people have paid the price for their leaders' rejection.The idea of autonomy that originated at Camp David did not ensure that Palestinian statehood would be denied later on.After all, in December 2000, the Clinton parameters offered the Palestinians a viable state with 97 per cent of the West Bank's territory, 100 per cent of the Gaza Strip, and a guaranteed corridor connecting the two; this would have been an independent state. Clinton administration negotiators, including me, presented the parameters at the request of both sides to bridge differences that they could not overcome; these parameters went well beyond what was on offer earlier that year. Still, in my presence, Arafat rejected the Clinton parameters.But it was not only the Clinton parameters that would have undone the limits of autonomy, had the Palestinians said yes or offered a serious counterproposal. Prime Minister Ehud Olmert's offer in 2008 and the Obama/Kerry principles in March 2014 would have done the same. There was no serious response to these proposals. Palestinian leaders have on several occasions either said no or failed to respond when they had the chance to achieve their national aspirations.None of this is to say that Israel made it easy for the Palestinians or that its settlement policy was compatible with the emergence of a Palestinian state. The growth of settlements and the settler population – from roughly 5000 at the time of Camp David to 100,000 at the time of Oslo to more than 300,000 outside of Jerusalem today – has made Palestinians both feel powerless and doubt Israel's genuine commitment to two states.There is one point that Anziska gets absolutely right: He observes that Begin was willing to grant Palestinians in the West Bank citizenship, and had he done so, that would have demographically transformed IsraelBegin, who was liberal when it came to civil law and human rights, did not want to relinquish the territory of the West Bank, and that meant for him that the civic rights of those already there would have to be recognised – and that there could not be one law for Jewish Israelis and another for Arab Israelis. As a result, he was going to give phased-in citizenship to the Palestinians in the occupied territories over a seven-year period if they wanted it, and he hoped that the immigration of diaspora Jews would preserve Israel's Jewish majority.In fact, this policy would have led to a binational state. The current Israeli government may not embrace Begin's concept of citizenship for Palestinians, but unless it preserves the option of separation by building only within the existing settlement blocs and not outside them, its current path is leading toward a single Jewish-Arab state. (I don't believe the alternative of one state in which Palestinians are denied equal rights – a perversion of Begin's vision and the Zionist ethic – is sustainable over time.)It is not too late for Israel to avoid this outcome, but it will have to act in a way that preserves the possibility of a Palestinian state if it is to remain a Jewish and democratic state. Given Anziska's view that Camp David was about denying Palestinians a state, it is a remarkable irony that the very vision he claims prevented a Palestinian state may yet produce an Israeli imperative for it.Dennis Ross is the former US envoy to the Middle East and counsellor at the Washington Institute for Near East Policy. He is the author of several books, most recently Doomed to Succeed: The US-Israel Relationship from Truman to Obama.Preventing Palestine: A Political History From Camp David to Oslo by Seth Anziska, Princeton University.\n\n\n                        \n                                              Foreign Policy\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}