{"id": "Cyber security experts fear more attacks on defence contractorsYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Cyber security experts have warned contractors involved in Australia's $89 billion naval shipbuilding program to brace for ever more sophisticated attacks, in the wake of extortionists targeting leading Royal Australian Navy and Border Force shipbuilder Austal.Professor Craig Valli said cyber criminals and foreign intelligence services would continue to target infrastructure providers, and the breach at Austal, Australia's biggest defence exporter and a major shipbuilder for the US Navy, served as a reminder for increased vigilance.\"Anyone that does any work with the military or defence is going to be a target and a heightened target,\" he said. \"And they may need to change the way the currently do their cyber security.\"Professor Valli, the director of Edith Cowan University's Security Research Institute and member of the Interpol cyber crime experts group, rated state-backed cyber attackers a more difficult threat to counter than the criminals who threatened to sell Austal's stolen data on the dark web.\"Some of these attacks, if coming from foreign intelligence services, will be of the highest sophistication,\" he said.Cyber security company Archtis, chaired by former defence and foreign affairs minister Stephen Smith, called for a better co-ordinated industry, Department of Defence and federal government response to the threat.\"The Austal breach highlights that both organised crime and state actors are targeting high-value targets throughout their supply chain,\" Archtis chief executive Daniel Lai said.\"If this can happen to Austal, a company that has significant resources to protect itself from cyber attack, then what about its sub contractors and suppliers?\"\"Obviously traditional security models and commercial products are not up to task.\"Prime Minister Scott Morrison said there would never be a 100 per cent guarantee cyber security breaches would not occur, but Australia was investing strong in safeguards.Australia established the Information Warfare Division last year with a brief to boost defences and to develop cyber weaponry of its own.ASX-listed Austal referred the breach and extortion attempt to the Australian Cyber Security Centre (ACSC) and the Australian Federal Police.It is understood the hackers accessed ship designs, which Austal said may be distributed to customers and fabrication sub-contractors or suppliers and were neither sensitive nor classified.Austal has confirmed details of staff addresses and mobile telephone numbers were compromised.\"A small number of stakeholders who were potentially directly impacted have been informed,\" it said in a statement to the ASX late on Thursday.\"Austal's business in the United States is unaffected by this issue as the computer systems are not linked.\"No company wants to lose control of its information, but there is no evidence to date to suggest that information affecting national security nor the commercial operations of the company have been stolen.\"Austal is the only foreign shipbuilder since the American War of Independence to build warships as a prime contractor for the US Navy, providing littoral combat ships and fast transport vessels for its shipyards in Mobile, Alabama.The federal government has engaged Austal to building 21 patrol boats for Pacific nations at its shipyards at Henderson, south of Perth, and it has Cape-class patrol boats for the Royal Australian Navy and Border Force.The government also pushed for Austal to be part of a consortium building 12 offshore patrol boats for the Australian Navy, but the company was unable to grab a share of the $3 billion project after failing to reach an agreement with lead contractor Luerssen.Austal is eyeing work on the $35 billion frigate-build contract awarded by BAE Systems, where its chief executive David Singleton is a former top executive.In a joint statement the Department of Defence, Department of Home Affairs and the Australian Cyber Security Centre said no compromise of classified or sensitive information or technology had been identified so far, with investigations continuing.\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}