{"id": "British fracking operations of AJ Lucas' Cuadrilla get off to shaky startYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    London | The fracking debut of British shale explorer Cuadrilla Resources, which is half-owned by listed Australian mining services company AJ Lucas, has got off to a somewhat shaky start – literally.The company began hydraulic fracturing operations at its Preston New Road site in northern England on October 15, but in its first two weeks the company has issued three press notices of seismic events, the last of which prompted an 18-hour pause in operations.Cuadrilla had to suspend operations at 11.30 am local time last Friday after it detected a micro-seismic event measuring 0.76ML on the Richter scale, which registers as a \"red event\" in the traffic-light system used by the British Oil and Gas Authority and requires an automatic suspension of activity.This followed earlier micro-seismic events of 0.3ML on Thursday and 0.48ML on Wednesday, both of which qualify as \"amber events\". The British Geological Survey has recorded 17 tremors in the Blackpool area around the site since fracking began, most of which were reportedly \"trailing events\" that happened after the fracking had stopped.The company said in a statement after Wednesday's tremor that a seismic event falling between 0 and 2.0 on the Richter scale was \"hundreds of orders of magnitude below what is capable of being felt, much less cause damage or harm, at surface\".After Thursday's tremor it said that an average of around 8000 micro-seismic events were detected around the world each day, and were very rarely deemed newsworthy.\"Everything so far has been within our operational expectations, in line with the work we're carrying out and reported appropriately,\" according to Thursday's statement. And \"local residents should be reassured that the monitoring systems in place are working as they should\", the company added in Friday's statement.A more significant risk than the public concern or surface impact is the potential effect on the well itself. The company said on Friday the well's integrity remained intact. It did not comment on any financial impact from the pause.Cuadrilla first tried to carry out fracking in 2011, but operations were halted by a 2.3 magnitude quake. The British government has since set up a regulatory system to monitor the seismic impact of the high-pressure fracturing, and the company has battled its way through several legal challenges from environmentalists and local activists.AJ Lucas owns 47 per cent of Cuadrilla and a 23.75 per cent direct interest in the Bowland licences where the fracking is taking place. US private equity firm Riverstone Holdings is the other major shareholder with 45 per cent.The two horizontal shale gas wells at Preston New Road are both more than 750 metres long and more than 2000 metres below the surface. The fracturing involves high-pressure, high-volume pumping of sand, water and chemicals into the wells to release gas from the rock.The Bowland rock formations are assessed to contain a large volume of gas, which the British Geological Survey estimates at between 822 and 2281 trillion cubic feet. Cuadrilla's licences cover only a proportion of this and the site's viability depends not on the volume but on the rate at which the gas flows.\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}