{"id": "Telstra watches Trump's tweets amid 'Cyber 9/11' fearsYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Telstra's cyber security boss has revealed that the telecommunications giant has a member of its team permanently monitoring the Twitter feed of US President Donald Trump, in case his unpredictable behaviour is an early indicator of a crisis to threaten global businesses and markets.Speaking as part of a panel discussion at the Sibos conference in Sydney, Telstra head of cyber security Jacqueline McNamara admitted the US President's tweets formed part of her company's plans for a so-called \"black swan\" event that comes out of the blue with potentially devastating results.Ms McNamara also advocated for the creation of a global law enforcement body to police the dark web as part of the discussion that focused on the potential for a \"Cyber 9/11\" event to rock society. The likelihood of an era-defining cyber incident was high, she said, given the lack of general awareness of latent threats among the population, and predicted it would occur probably as a result of unintended consequences or misadventure.Ms McNamara said the spread of fake news during the US election, and its wider societal repercussions, illustrated the need for a co-ordinated international response in order to prevent an attempt by a criminal to use misinformation to make money, spiralling into a public panic that would threaten institutions. \"I actually think a black swan cyber event will probably be an accident ... We do have someone in our team who monitors Trump's Twitter feed, which does have an impact on where security events come from, so we find that a great little intelligence tool,\" she said.\"If fake news takes off and sparks a panic and people start pulling their money out of bank accounts to stuff under the mattress, it could inadvertently create serious widespread problems.\"Ms McNamara, who is a former intelligence officer with the Australian Defence Force, also cast doubt over the likely effectiveness of controversial proposed laws that would give local spy agencies sweeping powers to access electronic devices and read messages from encrypted services such as WhatsApp.Then prime minister Malcolm Turnbull vowed last year to force tech companies to co-operate with law enforcement agencies, warning that terrorists and other criminals were able to use online messaging services to plot without surveillance.However, Ms McNamara said these changes would be of only minor use in comparison with better co-ordination between nation states and a central global body to respond to threats. She observed it was often impossible to get hold of anyone from global non-profit body ICANN, which co-ordinates the maintenance of web domains, until an incident was already over.\"Things like being able to easily access ICANN and look up IP addresses is a lot more important than accessing the minutiae of encrypted data communications,\" she said.\"In terms of law enforcement, looking at the collaborative frameworks betweens our governments globally and moving towards a more globally centric model for regulation is really important.\"Sure the Australian government may be able to determine attribution as a result of getting into those encrypted communications, but who are they going to call? What will Vlad say?\" Asked about how Telstra ensures its own security as the owner of crucial national infrastructure, Ms McNamara conceded that even its own relatively tech-savvy staff could fall victim to a social engineering phishing attack.She said her team had tested staff two weeks ago with an email that purported to contain an incorrectly directed payslip, and asked them to open it\"Clearly you shouldn't click on the attachment, but 60 per cent of people did,\" she said.\"With phishing attacks you know not to click on links but it seems nobody can resist looking at somebody's payslip, and in social engineering there is always a way around security.\" After publication The Australian Financial Review was contacted by Telstra to clarify Ms McNamara's role at the company, which was described in the article as presented at Sibos.Telstra statement: \"Ms McNamara is no longer employed by Telstra and was not speaking on Telstra's behalf. Her last role for Telstra was with Cyber Security Enterprise Solutions. She was not Head of Cyber Security for Telstra as reported.\"\n\n\n\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}