{"id": "Record crowd marks 100 years since end of WWIYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    A record War Memorial crowd including Prime Minister Scott Morrison and Opposition Leader Bill Shorten stood in silence to mark 100 years since the end of the war that was supposed to end all wars.The Great War claimed 62,000 Australian soldiers, more than half of all Australians who have died in battle.The last Australian World War I veteran died in 2009, but the National War Memorial in Canberra was still packed with 12,000 people, many of them veterans remembering their mates on Remembrance Day.\"I think it's right and proper that we see so many folks here today just to remember and hope that it doesn't all happen again,\" Brian Edwards said in Canberra on Sunday.Mr Edwards, who fought in British Malaya and Vietnam, said it was tough seeing more names added to the honour roll of Australia's war dead.\"We keep hoping it won't happen again ... certainly there should be an honour roll, but I wish there wasn't,\" he said.Mr Morrison said soldiers were often described as fearless, but actually they were brave.\"They feared greatly but acted nonetheless, and it is this that embodies our highest aspirations as a nation and as people,\" he said in his keynote speech.\"To live for others even when to do so is unimaginably hard and the cost extreme.\"War Memorial director Brendan Nelson said the record crowd – about four times as large as usual – was a message to those who have served and continue to serve.\"It says we remember you, we honour you, we seek to learn from the mistakes we've made as a nation,\" he told reporters.Mr Shorten said the day was a solemn reminder of the sacrifices made to defend Australia and bring peace.\"We must do better for our veterans and their families,\" he said in a statement. \"Our veterans have done their duty, now we must do ours.\"Dr Nelson said it had been pleasing to see greater attention placed on Remembrance Day than in any year he could remember.\"We have paused to remember how fortunate we are to be Australians, whether by birth or by choice,\" he said.The memorial was originally built to mark the Australians who died in World War I, but is getting a $500 million expansion to fit in all the other wars fought since.\n\n\n                        \n                                              AAP\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}