{"id": "Donald Trump's decision to dump the nuclear missile treaty was rightYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    I have been critical of the Trump presidency because I think it has been a calamity for America and the world. But just because President Donald Trump does something doesn't mean it's wrong. Even Trump gets a few things right, and it's incumbent on his critics to acknowledge it when he does.Case in point: Trump's decision this week to withdraw from the 1987 Intermediate-range Nuclear Forces (INF) Treaty. This was a landmark arms-control agreement between President Ronald Reagan and Soviet leader Mikhail Gorbachev that banned land-based missiles with a range of 310 miles to 3400 miles (5470km). It led to the destruction of thousands of missiles, lowered tensions in Europe and contributed to the end of the Cold War.But that was then. This is now.Under Vladimir Putin, Russia has been building an intermediate-range cruise missile, codenamed the SSC-8 by NATO, that is in violation of the treaty. This is not a figment of Trump's imagination, like the presence of \"unknown Middle Easterners\" among a caravan of Central American refugees. The Obama administration discovered the Russian violation in 2014, and the United States has been working unsuccessfully ever since to convince the Russians to come into compliance.Meanwhile, China, which is not bound by the INF Treaty, has been rapidly expanding its intermediate-range rocket forces. It has recently begun deployment of the DF-26 ballistic missile, which has been dubbed both a \"Guam killer\" and a \"carrier killer\" because it can effectively target both the US naval and air bases at Guam, and the US aircraft carriers that have been the mainstay of American naval dominance since 1942. The military balance of power is shifting against the United States in the western Pacific, in no small part because of China's missile buildup.Because of the limits still imposed on the United States by the INF Treaty, the United States today can only respond with a relatively small number of intermediate-range Tomahawk cruise missiles carried on vulnerable, costly platforms such as Arleigh Burke-class destroyers (cost $1.8 billion).\"Ground-launched systems with an intermediate range in, for example, Guam, Japan and northern Australia would provide planners with a means to augment air and maritime strike platforms with new land component capabilities at a fraction of the cost,\" argues Eric Sayers of the Centre for Strategic and International Studies. China would have to devote greater resources to missile defences rather than power projection, he argues, and would find it harder to cripple the US military by striking a handful of major US bases in Asia. Land-based missiles could be deployed in many locations, protecting against a Pearl Harbour-like first strike and increasing deterrence.There is scant chance that China would join the INF Treaty and voluntarily give up one of its core military advantages. It might be possible to renegotiate the treaty with Russia to limit its sphere to Europe, or to negotiate a new three-way treaty with Russia and China limiting the number of intermediate-range missiles but not banning them altogether. But simply staying in the INF Treaty and making futile protests about Russian violations wouldn't achieve anything.Declaring that the United States is ready to walk away is a good first step toward dealing with the security challenges of today's world, which are vastly different from those of 1987. The United States can now develop a new land-based intermediate-range ballistic missile to counter a growing Chinese threat–- a successor to the Pershing II missiles destroyed under the INF Treaty – while retrofitting the Tomahawk cruise missile, already ubiquitous at sea, for launchers on land. Hypersonic weapons might be a promising new technology.So why are so many well-respected foreign-policy experts and American allies aghast at the administration's decision? Trump has no one to blame but himself. When it comes to international obligations, he is the boy who cried wolf. Trump is a unilateralist and nationalist who has never seen an international obligation he liked. He has walked away from the Trans-Pacific Partnership, the Paris climate accord, the Iran nuclear deal, the UN Human Rights Council and the UN Relief and Works Agency for Palestine Refugees in the Near East. The administration is even exiting the Universal Postal Union, a convention that has governed international mail delivery since 1874.Trump's worst instincts are reinforced by his national security adviser. John Bolton is a lawyer, not a strategist, and he nurtures an irrational hatred of international law, which he sees as a threat to American sovereignty. He even devoted his first speech as national security adviser to trashing the International Criminal Court, an obscure and ineffectual boogeyman that has long obsessed him.Every one of the administration's decisions to withdraw from international obligations was a mistake – until now. But, given its track record, it's nearly impossible for the administration to convince anyone that it made the INF Treaty decision on the merits alone.There is a valuable lesson here for Trump and his aides in the unlikely event that they are prepared to learn from their mistakes: Stop making so many ridiculous, erroneous, offensive arguments. Otherwise, when you have a good case to make, no one will be listening.\n\n\n                        \n                                              The Washington Post\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}