{"id": "To burn the most calories, it helps if you watch what time you eat atYou have   left for this month. For unlimited access upgrade to Premium Digital", "paragraph": "\n        For full functionality of this site it is necessary to enable JavaScript.\n        Here are the \n        instructions how to enable JavaScript in your web browser.\n    Next time you raid the fridge in the wee hours of the morning, consider this new research finding: At roughly that hour, the most basic operations of the human body throttle back their caloric needs by about 10 per cent compared with the rate at which they will burn calories in late afternoon or early evening.Maybe you'd prefer to come back around dinnertime.This pattern of calorie use doesn't significantly vary based on whether you're the waitress working the graveyard shift or a 9-to-5'er stopping in for breakfast after eight hours of shut-eye, the researchers found.Humans' \"resting energy expenditure\" - the body's use of calories to power such basic functions as respiration, brain activity and fluid circulation - follows a predictable cycle that waxes as the day progresses and wanes as night sets in.The new study, published this week in the journal Current Biology, offers further evidence that circadian rhythms dictate not just when we feel the urge to sleep but how complex mechanisms like metabolism operate across a 24-hour period.It may help explain why people who keep irregular sleep schedules, including swing shift workers, have higher rates of obesity and are more likely to develop metabolic abnormalities such as type 2 diabetes.And it demonstrates that whether we hear it or not, our body's clock is always ticking, locating us in our daily cycle with uncanny precision.At \"hour zero\" - roughly corresponding to somewhere between 4am and 5am - our core body temperature dips to its lowest point and our idling fuel use reaches its nadir.From that point, at first quickly and then a bit more slowly, the body's \"resting energy expenditure\" rises until the late afternoon/early evening.After reaching its peak at roughly 5pm, the number of calories we burn while at rest plummets steadily for about 12 hours.And then, just as surely as day follows night, we start again.These new findings are a reminder that no matter how 24/7 our schedules have become, our bodies were built for a slower, simpler world in which humans moved around all day in search of food, ate while the sun was up, and slept when the sky was dark.Today, our appetites and the all-night availability of tempting food may induce us to eat well after sundown.And our jobs may demand that we sleep during the day and wait tables, care for patients or drive trucks through the night.But our bodies still adhere to their ancient, inflexible clocks.The study's findings also come with an implicit warning: When we disregard the biological rhythms that rule our bodies, we do so at our peril.Resting energy expenditure accounts for the majority of the minimum calories we burn in a day.Just to spend a day eating, sleeping and breathing uses up 60 per cent to 70 per cent of our \"resting energy expenditure\".So a serious mismatch in the time when calories are consumed and the time when most of them are burned could prompt the body to make decisions - like storing calories as fat - that aren't necessarily healthy.The new study adds to a growing body of evidence suggesting that a good 12-hour fast, when aligned with darkness and our bodies' nocturnal response, may be a way to prevent or reverse obesity.In lab animals and a growing number of people, Salk Institute researcher Satchin Panda has demonstrated the impact of dietary obedience to our circadian rhythms.Others have demonstrated the power of timing by showing how readily it can be disrupted.In a 2014 study, 14 lean, healthy adults agreed to turn their days upside-down over a six-day period.Fed a diet sufficient to maintain their weight, the subjects quickly adapted by turning their thermostats down.Compared with the baseline readings taken upon their arrival (when they were awake by day and asleep eight hours at night), the subjects burned 52 fewer calories on day 2 of their swing-shift schedule, and 59 fewer calories on day 3 of that schedule.Do that for a couple of days and you might feel a little off.Do it for months, years or a lifetime, and the result could be too much stored fat and metabolic processes that go haywire.\"One take-away is indeed that for optimal health, including metabolic health, it's best for us to have a regular schedule seven days a week - getting up and going to bed at the same time and eating our meals at the same time,\" said senior author Jeanne Duffy, a neuroscientist and sleep specialist at Brigham & Women's Hospital in Boston.\"We have these powerful clocks in ourselves and they're prepared to deal with certain events  - eating and sleeping - at particular times every day.\"So we want them to be optimally prepared for that.\"To get to these findings, the researchers had to coax seven people to spend three weeks sequestered in windowless rooms without clocks, cellphones or internet service.In what is called a \"forced desynchrony protocol\", the researchers extended the subjects' days by four hours.All got a minimum of eight hours in bed at the end of their extended day, but then woke up and marched through an 18-hour period of artificial \"daylight\" before being allowed to sleep again.At first, they seemed to race to keep up with this odd clock. But after three weeks of such discombobulation, subjects essentially come to rely on their own internal clocks to set the duration of their days and separate their days from nights.The individual rhythms that each subject fell back into did not show that much variation: Without alarm clocks or other cues, they eventually found their way back to a cycle of sleeping and waking that hovered closely around 24 hours, Duffy said.By the end of week one, the patterns in their hour-by-hour resting energy expenditure had become clear: In a span of time ranging from 23 to 24.5 hours, subjects who were disconnected from day and night cues showed patterns of resting energy use that were remarkably similar, and that followed the same daytime rise and nighttime decline.These patterns remained unchanged until the end of week three.Along with that were similar patterns of \"macronutrient utilisation\".Subjects burned the most carbohydrates early in their waking day.Carbohydrate use then declined steadily, with a small jump in the middle of the night.The burning of fat was lowest in the morning, peaked in early evening, and declined from there.\"We were impressed by the fact that these patterns were so similar between individuals,\" Duffy said.\"That told us this was something real.\"The number of calories we burn - or store as fat - is likely to be influenced not just by our size, what we eat and the amount of exercise we get, Duffy said.The timing of our eating matters too.When we sleep late on weekends, hopscotch across time zones, or work on schedules that have us up all night then back on the day-shift, \"we're disrupting our clocks and making our metabolisms inefficient, and in the long term, that will lead to disease\", she said.\"Staying on the same schedule is the best way to prevent that.\"\n\n\n                        \n                                              MCT\n\nThe Australian Financial Reviewwww.afr.comSorry, you have entered an incorrect email address or password.Please enter your email addressPlease enter your passwordNew to The Australian Financial Review ?Get unlimited access to Australia's best business news and market insights, including our award-winning app.Already a subscriber? Log in\n"}