{"id": "President Trump's Latest Explanation for Stock Market Declines? Democrats' Promise to Investigate Him", "paragraph": "President Donald Trump turned to a new explanation for stock market declines Monday, blaming scrutiny his administration could face from Democrats who recently won the majority in the House of Representatives.“The prospect of Presidential Harassment by the Dems is causing the Stock Market big headaches!” he tweeted Monday.The justification was the latest offered by a president who frequently touted stock market gains early in his administration as evidence of the nation’s economic health and his success in governing. But declines amid concerns over his trade policies and Federal Reserve tightening have led to turbulent trading in recent months, complicating that message.The prospect of Presidential Harassment by the Dems is causing the Stock Market big headaches!— Donald J. Trump (@realDonaldTrump) November 12, 2018As he tweeted, the Dow Jones Industrial Average and the S&P 500 were down just more than 1 percent for the day. Both indexes extended declines as the session progressed, with Apple Inc. tumbling on signs of weak iPhone demand and Goldman Sachs sinking.Ahead of the elections, Trump tweeted stocks would “go down” if Democrats prevailed. The S&P 500 rallied 2.1 percent the day after the vote, but has fallen in each of the three days since, erasing the post-election rally as concerns about global growth re-emerge.Trump tweets have moved financial markets throughout his presidency. It happened 10 days ago, when he said trade talks between the U.S. and China were “moving along nicely’’ and stocks soared. In April, he criticized big tech companies and they plunged. Oil prices and the dollar have also felt the wrath.Still, Trump appears eager to shift blame for future losses to his newly empowered political opponents — while also seeking to head off congressional investigations into ethical scandals and policy controversies during his first two years in office.Representative Adam Schiff, the top Democrat on the House Intelligence Committee, said over the weekend he could investigate whether the president used “instruments of state power” to punish news organizations. House Judiciary Committee raking Democrat Jerrold Nadler said he’d ask acting Attorney General Matthew Whitaker to testify about his plans for the special counsel probe into possible ties between Russia and the Trump campaign.The president’s efforts at blame-shifting aren’t new. Ahead of the elections, Trump tweeted stocks would “go down” if Democrats prevailed. That warning came after stocks fell follow reports that the administration would move forward with additional tariffs against China in early December if the two countries don’t make enough progress resolving their trade dispute. Trump will meet with Chinese President Xi Jinping in Argentina at the end of November.Democrats won control of the House, capturing at least 225 seats, but Republicans expanded their advantage in the U.S. Senate. Key races in both chambers are yet to be called.In data going back to 1901, stocks have returned more when the government is divided than when it’s unified, according to a report by OppenheimerFunds.Trump previously blamed the Federal Reserve for stock declines, complaining after the central bank raised its benchmark rate three times this year. In an interview last month with the Wall Street Journal, Trump said he “maybe” regretted appointing Federal Reserve Chairman Jerome Powell.Contact us at editors@time.com."}