{"id": "Boy Meets World's 'Mr. Feeny' Comes Through Again By Thwarting Home Burglary Attempt", "paragraph": "A lot has changed in the decades since Boy Meets World premiered in 1993.But how the fact that the show’s fictional principal, Mr. Feeny, always comes through, is not one of them.William Daniels, 91, who played George Feeny (beloved history teacher-turned-principal) in Boy Meets World’s seven-season run, foiled an alleged burglary attempt at his Studio City, Calif. home on Saturday night. “Someone tried to break in to the home of Mr. and Mrs. William Daniels on Saturday evening. Luckily, Mr. Daniels was able to frighten away the person and the LAPD quickly responded. They are both well. Mr. Daniels thanks all his fans for their concern,” the actor’s spokesperson told People.The Los Angeles Police Department told TIME that a burglary attempt occurred on Saturday evening around 9:30 p.m. at a Studio City, Calif. home, but would not say whose home it was.The alleged burglar did not enter the home, according to an LAPD spokesperson.Daniels reprised his role as Mr. Feeny on the Disney Channel spinoff Girl Meets World from 2014 to 2017. The actor is also known for his film roles as Mr. Braddock in The Graduate (1967) and Arthur Lestrange in Blue Lagoon (1980).The actor’s role as friendly neighborhood Mr. Feeny — whose character arc also included living next-door to his student (and the show’s lead), Cory Matthews (Ben Savage) — provided episodic wisdom to all of the high school students he taught.Naturally, he became a teacher for all of the ’90s kids watching ABC, who are now taking to Twitter to express their heartfelt reactions to the news of Daniels saving himself and his wife — through memes of Mr. Feeny. pic.twitter.com/jKEUZpQPxY— Georgina Cabadas (@ginacabadas) October 30, 2018 pic.twitter.com/5xo9cmSdCh— marissa. (@MarissaJaay_) October 30, 2018Imagine trying to get your theft on and Mr. Feeny jumps through the window and hits you with a 3 piece with Lil Scrappy’s “No Problem” blaring in the background. Gotta just retire from life after that.— Stokely Hathaway (@StokelyHathaway) October 30, 2018In these uncertain times, this millennial is super comforted to know Mr. Feeny still out here slaying https://t.co/kG6B7NMPCo— Kavitha A. Davidson (@kavithadavidson) October 30, 2018Even Daniels’ Boy Meets World co-star Will Friedle got in on the fun.Don’t ever mess with Mr. Feeny! #LoveYouBillAndBonnie https://t.co/YpaZsdeRPH— Will Friedle (@willfriedle) October 30, 2018Write to Rachel E. Greenspan at rachel.greenspan@time.com."}