{"id": "Rural America Is the Real Prison in Showtime's Escape at Dannemora", "paragraph": "New York’s Clinton Correctional Facility has a startlingly apt nickname: Little Siberia. Located in Dannemora, a small, depressed village 20 miles from the Canadian border, the maximum-security prison is notorious for its frigid temperatures, institutional racism, rampant violence and high suicide rate. Mired in problems, it’s no surprise that Clinton was the site of the most epic prison break in recent memory when, in June 2015, Richard Matt and David Sweat tunneled their way out of the facility.But, as its title suggests, Showtime’s Escape From Dannemora isn’t just about busting out of prison—and the inmates at Clinton are not its only desperate characters. The real protagonist of director Ben Stiller’s seven-part miniseries based on the incident, which debuts Nov. 18, is Sweat (Paul Dano) and Matt’s (Benicio Del Toro) tailor shop supervisor, Joyce “Tilly” Mitchell, who provided them with the contraband tools they used to carve a path out. She would have been an easy figure to caricature; the revelation that she’d had sex with both men fueled nasty tabloid headlines at the time. As played by a riveting, unrecognizable Patricia Arquette, however, Tilly isn’t the NY Post’s trashy “Shaw-skank” so much as a North Country Emma Bovary: a clever, astoundingly selfish woman desperate to escape her boring town and stultifying marriage.She finds her outlet in Sweat, a taciturn lifer many years her junior who manages to dazzle her with his dexterity both behind the sewing machine and in the semi-private back room. When their trysts become too obvious, he is moved to a new job and, though Tilly remains devoted to him, Sweat’s friend Matt steps in to fill the void. A slick O.G. who trades his skillful paintings for favors from the guards, he has discovered a hidden catwalk and enlisted the industrious Sweat to help him turn it into an escape route. But Matt realizes that they won’t be able to make their getaway without assistance from someone on the outside. That’s where Tilly comes in. Sensing her restlessness, he crafts a fantasy in which she will ferry the two fugitives to Mexico—where, he says, people “worship” blondes like her—and they’ll all settle down in a vaguely defined ménage à trois.This exotic, sun-drenched fiction is the diametric opposite of Tilly’s reality. Dannemora opens in the depths of an icy winter, when there’s nothing to do on weekends but accompany her dim-bulb husband Lyle (Eric Lange) to the nearby War of 1812 Museum. Breathtaking panoramas that show what looks to be a quaint town nestled in the snow-covered Adirondack mountains give way to shots of deserted streets and crumbling buildings. The prison at the center of it all, surrounded by modest homes, completes the metaphor: this is a place that traps you, a rare employment hub in a region where thousands of skilled jobs have been replaced by a few gigs supervising inmates who do the same work for a fraction of minimum wage.As Matt’s plan takes shape, Tilly disappears into a sad little Mexico of the mind, buying herself colorful sundresses and ordering margaritas at happy hour—a $5.50 extravagance to her underpaid co-workers who economize with Bud Light. The ultra-romantic Top 40 hits she loves to blast, like Kelly Clarkson’s “Heartbeat Song,” further distance her from her neighbors, who prefer the backward-looking sounds of classic rock and country. (Poor Lyle describes himself as “a news and weather guy.”) She is as powerless to access the glamorous life she craves as Matt and Sweat are to leave Clinton. Arquette surrenders all vanity to play this worn-down woman whose lifelong frustration has metastasized into something dangerous.It’s just unfortunate that Stiller and Dannemora’s creators, Brett Johnson and Michael Tolkin, dilute Tilly’s story by spending too much time—in seven episodes that could easily have been shaved down to five—with Matt and Sweat. Though the real convicts dominated headlines in 2015, as characters, their motives are too transparent and their daily routines too monotonous to demand so much attention. Sweat hacks through walls. Matt manipulates Tilly. Stiller gets beautiful performances out of every actor, but when he flexes with arty, dimly lit montages of the men banging on walls and long takes that follow them through their precious tunnel, those action sequences actually slow the show’s momentum. It turns out that the process of escaping from prison is pretty dull to watch.The blighted rural America that greets Sweat and Matt when they climb out of their manhole is far richer thematic terrain, and it’s handled here with uncommon subtlety and grace. Donald Trump’s political ascendance, the opioid crisis and the trendy-to-notice anger of the white working class hover mostly out of sight because, in truth, they’re just the culmination of generations of lives like Tilly Mitchell’s. (When she remarks to a few haughty “summer people” that her people have resided in the area for 300 years, she’s certainly not bragging.) At its best, Escape From Dannemora isn’t the story of two men running for their lives; it’s the story of a far larger prison whose invisibility makes it that much tougher to escape.Contact us at editors@time.com."}