{"id": "Trump Keeps Using Fear. But Is It Helping Republicans?", "paragraph": "Throughout his political career, from his own run for president in 2016 to stumping for down-ballot Republican candidates in 2018, Donald Trump has often used fear to motivate his supporters. In Montana on Saturday, he offered a glimpse into why.“I can only go for four or five minutes with that stuff,” Trump told a crowd at the Bozeman Yellowstone International Airport of the strong economy and jobs numbers. “When you’re fixing the problem, there’s no reason to go on about it for 45 minutes.”Later, in Pensacola, Florida, at his second rally of the day, Trump echoed the sentiment. “I’m looking to solve problems,” he said, “not to talk to the fact that we have done a great job.”At his midterm rallies, Trump does tout Republican successes. He read the same basic script at four rallies in four different states on Nov. 2 and 3, which included mention of tax cuts, designating Jerusalem as the capital of Israel and confirming record numbers of conservative judges to federal courts, with particular mention of new Supreme Court Justice Brett Kavanaugh.But he spent most of his time at the rallies, each of which lasted roughly an hour, describing the hypothetical horrors of Democratic rule to the audiences. He told the crowds in West Virginia, Indiana, Montana and Florida that Democrats would enact a “socialist takeover of the American healthcare system,” making the United States function more like Venezuela.He put the upcoming election in these terms at his appearance in Florida: “A Republican Congress means more jobs and less crime. A Democrat Congress means more crime and less jobs.” Trump paused, pleased with the slogan. “It’s pretty simple,” he said. “That’s cute.”As it has been since the day he announced his candidacy for president in 2015, Trump’s favorite issue to return to on this theme is immigration. For whatever Republican candidate he’s campaigning for, he tells the crowd that the Democratic opponent wants open borders and will let undocumented immigrants and criminals pour into the country. Talking about Andrew Gillum, the Democratic nominee for governor of Florida, Trump said, “He wants to flood your cities with criminal aliens, because that’s what’s going to happen. … So when you have people camping out on your front lawn, remember Gillum.”He even suggested without evidence that Democrats had organized the migrant caravan making its way towards the United States. “They want to invite caravan after caravan, and it is a little suspicious how those caravans are started,” he said. But he noted explicitly that he thinks using the caravan as a political issue will help Republicans: “I think it’s a good thing, maybe, that they did it. Did they energize our base or what?”But Trump’s dark warnings about border crossings and undocumented immigrants are an uneasy match for Florida Governor Rick Scott, who appeared with Trump in Pensacola Saturday evening and hopes to unseat the Democratic Senator Bill Nelson. Hispanic voters make up 25% of Florida’s population and 17% of its registered voters, and Scott has been working hard to win them over. “Practicing Spanish every day is important,” Scott told TIME in a recent interview. “Twenty percent of those voting in this state speak Spanish.” Hillary Clinton carried 62% of Latinos in Florida as the Democratic nominee for President in 2016, but local polls show Scott could be making gains.Read More: Inside the Republican Plan to Win Hispanic Voters—And Battleground States“Democrats are openly encouraging millions of illegal aliens to break our laws, violate our sovereignty, overrun our borders and destroy our nation in so many ways,” Trump said in Florida. “We can’t let it happen.” The assembled crowd in the airport hangar cheered.When Scott took the stage, he didn’t mention immigration at all.Many in Trump’s base remain enthusiastic about the president, as evidenced by the crowds at his rallies throughout the country during his final, aggressive campaign swing ahead of Election Day. But for Republican candidates like Scott who are trying to broaden their support to counter the swelling activation on the left, Tuesday’s results could reveal whether Trump bringing his message of looming problems and a militarized border to their states helped, or whether the president perhaps should have spent more than “four or five minutes,” as he said, flaunting the economy and Republican accomplishments.It wasn’t all doom and gloom at Trump’s weekend events. He praised his supporters for being “the greatest political movement in the history of our country” and promised to deliver more tax cuts, more conservative judges and to build his signature border wall.“I’m a happy person,” Trump assured the crowd in Montana. “I’m a much happier person than you would believe.”But he believes talking about the problems, not the solutions, is the winning strategy.Write to Tessa Berenson at tessa.berenson@timeinc.com."}