{"id": "Bill Maher Targets Stan Lee's Legacy in Controversial New Blog Post", "paragraph": "Comedian Bill Maher has come under fire for a blog post where he suggests comic book readers are immature and targets Stan Lee, just days after his death.Maher’s thoughts on comic book culture were posted on his Real Time with Bill Maher blog on Saturday. He seems to equate comics with arrested development in American culture and bemoans adults who love “kid stuff.” The post “Adulting” comes less than a week after Stan Lee died at age 95. Lee was a comic-book writer behind some of Marvel Comics’ most iconic superheroes.“The guy who created Spider-Man and the Hulk has died, and America is in mourning. Deep, deep mourning for a man who inspired millions to, I don’t know, watch a movie, I guess,” Maher wrote. “The assumption everyone had back [when I was a kid], both the adults and the kids, was that comics were for kids, and when you grew up you moved on to big-boy books without the pictures.”Maher writes that some time in the last 20 years “adults decided they didn’t have to give up kid stuff” and “pretended comic books were actually sophisticated literature.”Maher capped off this blog post by claiming that comic books haven’t made people any “stupider” but that we’re now “using our smarts on stupid stuff.”“I don’t think it’s a huge stretch to suggest that Donald Trump could only get elected in a country that thinks comic books are important.” he wrote.Maher’s comments about Lee and comic book fans, just days after the legend’s passing, did not sit well with many.SBill Maher dismissed an entire storytelling medium?Wow. He's so highbrow.His brow is so high, there's probably less room for a mind.— Tom Taylor (@TomTaylorMade) November 17, 2018It's crazy to me that Bill Maher is using Stan Lee's death to insult the maturity of comic book fans. It's crazily out of character for him to try to assert his intellectual superiority over the ignorant masses in a shrill, strident, obnoxious and attention-seeking way.— Nathan Rabin (@nathanrabin) November 17, 2018The fact that the only way Bill Maher can score heat anymore is saying Stan Lee is responsible for Donald Trump should inspire some introspection in that dude about how pathetic he is now. But if that was possible, he wouldn't be Bill Maher— Nathan Bernhardt (@jonbernhardt) November 17, 2018Bill Maher use to be my idol. To draw in Stan Lee on a point that he made was sick. One who decides to diss one's stance on make believe that enforces the greater want to achieve a better world is like the bully who says Santa is fake. We all know but let one hope. Hope is rare.— Jessica 👊🤘 (@reneejess0205) November 17, 2018 Write to Gina Martinez at gina.martinez@timeinc.com."}