{"id": "An Anonymous Group Spent $330,000 on Facebook Ads Urging Brits to Reject Brexit Deal", "paragraph": "A group with no publicly available information about its owners has spent up to $330,000 urging Brits to reject Theresa May’s Brexit deal, according to evidence submitted to a British government inquiry on fake news.The website, called the Mainstream Network, is the latest group to have been linked to “dark ads” – advertisements targeted at specific users that doesn’t reveal who is paying for them.“Here we have an example of a clearly sophisticated organization spending lots of money on a political campaign, and we have absolutely no idea who is behind it,” said Damian Collins, a lawmaker who chairs the British government’s fake news inquiry.There is no guarantee that the group is British, even though its ads directly target U.K. lawmakers. “They could be a foreign state, they could be foreign individuals,” Mike Harris, CEO of 89up, the group that compiled the evidence, tells TIME.“The issue is, this is a website that has absolutely no contact details on it, and it has been set up in a way that they deliberately try to disguise who’s behind it,” Harris said.89up, the communications agency who carried out the research, have previously worked for Best for Britain, a campaign to keep the U.K. in the E.U.Collins said Facebook knows who is behind the ad buy, but hasn’t released details.The news comes the same week as Facebook pledged to crack down on “dark ads.” It will force advertisers to register and verify their identity by Nov. 7.The goal of the ads, 89up said, was to convince these lawmakers to reject the prime minister’s Brexit deal in favor of a more complete break with the European Union.Many Facebook posts paid to be shared by Mainstream Network included the words, “We voted to leave the E.U, to take back control of our money and borders. The Chequers proposal [Theresa May’s proposed deal] does not deliver this.”As many as 10.9 million users may have been reached, 89up estimated.The “Chequers proposal” refers to a British government plan to maintain significant economic and trade ties to the E.U. after Brexit. It is named after the prime minister’s country estate, where the deal emerged. The proposal has proved controversial among Brits who advocate a “hard Bexit” that would free the U.K. from all E.U. laws and requirements.The evidence provided to the government committee says the Mainstream Network appeared to be set up to target voters in the constituencies of key lawmakers who Theresa May would depend upon to get parliamentary support for her deal.89up also said the anonymous group appeared to be in breach of GDPR, an E.U. data protection law.Write to Billy Perrigo at billy.perrigo@time.com."}