{"id": "State Department Says It Has Not Yet Reached a Final Conclusion About Khashoggi's Murder", "paragraph": "The U.S. is still seeking “all relevant facts” in the killing of Jamal Khashoggi, the State Department said Saturday, following a report that the CIA had concluded that Saudi Crown Prince Mohammed bin Salman ordered the assassination of the U.S.-based columnist.“Recent reports indicating that the U.S. government has made a final conclusion are inaccurate,” said Department spokeswoman Heather Nauert. “There remain numerous unanswered questions with respect to the murder of Mr. Khashoggi. The State Department will continue to seek all relevant facts,” she said in a statement.Nauert’s statement referred to the lack of an official conclusion by the government without disputing what the CIA, the key intelligence agency, may have concluded.President Donald Trump earlier spoke with Secretary of State Mike Pompeo and CIA chief Gina Haspel via telephone from Air Force One as he traveled to California to meet with people affected by deadly wildfires, said White House Press Secretary Sarah Huckabee Sanders. Asked by reporters if the president had confidence in the CIA’s conclusion, Sanders said: “He has confidence in CIA.”Several news organizations including the Washington Post and New York Times reported the CIA has concluded the crown prince ordered Khashoggi’s assassination in Istanbul last month, contradicting the Saudi government’s claim he wasn’t involved in the murder. CIA officials have high confidence in their conclusion, which is based on multiple sources of intelligence, the Washington Post reported.“As of this moment, we were told that he did not play a role, we’re going to have to find out what they say,” Trump told reporters earlier before departing the White House.The president, who has been wary of alienating Saudi leaders amid the uproar over the killing, continued to stress the kingdom’s importance to the U.S. in his comments.“They are a spectacular ally in terms of jobs and economic development,” Trump said.Some U.S. lawmakers have demanded for tougher action against Saudi Arabia for the murder. The Trump administration on Thursday announced sanctions against 17 Saudi officials implicated in the killing, though not the crown prince. Critics in Congress immediately branded the sanctions as insufficient.“We will continue to consult Congress, and work with other nations to hold accountable those involved in the killing of Jamal Khashoggi” Nauert said.Contact us at editors@time.com."}