{"id": "How Authorities Will Investigate the Bombs Sent to Clinton, Obama, CNN and More", "paragraph": "A number of suspicious packages sent to Hillary Clinton, former President Barack Obama, CNN and other public figures and organizations were found to contain explosive devices this week, setting off a nationwide search for the person or people responsible.The first package was found Tuesday to the mailbox of billionaire and major Democratic funder George Soros. The same evening, the Secret Service discovered an explosive device addressed to Clinton’s home in Chappaqua, New York. The agency found another device addressed to Obama on Wednesday. CNN evacuated its New York offices after what’s believed to have been a pipe bomb was found in its mailroom, officials told TIME. The Florida office of former DNC Chair Rep. Debbie Wasserman Schultz was evacuated Wednesday after a suspicious package was intercepted. The San Diego field office of Sen. Kamala Harris was also evacuated after a suspicious package was found near the building; her communications director later said the package was not addressed to Harris.As law enforcement officials work to find the source of the bombs, experts say they will try to determine the source of the materials used in making them, question mail carriers who may have been involved in delivering them, and look for video footage of the deliveries themselves. No person or group has taken responsibility for the attempted attacks thus far, and no motive has been established.Most mail addressed to high-profile recipients goes through a screening process involving X-ray scans and a search for anything suspicious, says Evy Poumpouras, a national security journalist who served in the Secret Service for 13 years. That can include inspecting items for wires or mechanical devices, oil leaking from boxes, strange smells, and powdery substances.Once an item is flagged as suspicious, the first step is to isolate and secure the packages to avoid any casualties or damage, she says.“Leave the device as it is, leave it undisturbed and back away from the area,” says Poumpouras. “You’re going to call in the expert who deal with this. They’re going to want to make sure they can shut it down, take it out of the area and then start an investigation.”A local bomb squad will typically take over such investigations. Bomb experts, equipped with the appropriate gear to deactivate explosives, can determine whether the suspicious item is indeed a bomb, a fake device or a faulty explosive.In cases when suspicious devices are confirmed to be bombs, experts will first render the device safe, then begin a forensic investigation of the device or devices.Poumpouras says authorities will attempt to determine how a bomb was made, isolate the source of its parts, and examine whether there’s any DNA on the device that may be analyzed. Meanwhile, federal investigators will likely join state police, the postal service and private security companies to reverse-engineer the steps leading up to the attack.“You just work backwards. If you find that a company sells certain components, you can ask them where they sell them,” Poumpouras says. “Then figure out when and where they were purchased. Is there a paper trail? Or did they come in a different way?”Scott Alswang, executive vice president of SOS Security and a 20-year Secret Service agent, says authorities will also be looking at security camera footage for clues. People with Secret Service protection like Clinton and Obama typically have high-quality cameras on their premises, meaning there’s a good chance of finding revelatory footage, he says.“If they get real lucky, they can do some facial recognition and grab a suspect pretty quick,” says Alswang.Write to Mahita Gajanan at mahita.gajanan@time.com."}