{"id": "Freddie Mercury Biopic Wins Weekend Box Office Despite Mixed Reviews", "paragraph": "(Bloomberg) — A biopic about rock ’n’ roll front man Freddie Mercury and the band Queen led the North American box office this weekend, scoring a rare win over a new Walt Disney Co. fairy tale that would normally be expected to dominate the competition.The weekend’s major new releases made a clean sweep in the top three spots. “Bohemian Rhapsody,” from 20th Century Fox, collected $50 million from U.S. and Canadian theaters in its debut, Comscore Inc. estimated in an email Sunday. Disney’s “The Nutcracker and the Four Realms” garnered $20 million to land in second place, while the comedy “Nobody’s Fool,” from Viacom Inc.’s Paramount Pictures, was a step behind that with $14 million.Critics were mixed on the Fox tribute to the British band, with some praising Rami Malek’s portrayal of Mercury, despite a distracting set of false teeth. That makes its win especially unique. Disney has successfully turned animated classics like “Cinderella” and “Beauty and the Beast” into live-action megahits. But its record with less-known titles isn’t so stellar. “A Wrinkle in Time” and “Christopher Robin” both struggled to attract fans this year.“Bohemian Rhapsody” was forecast by analysts at Box Office Pro to open with sales of $40.7 million. The movie places Malek, who won an Emmy for his role in the TV series “Mr. Robot,” at the center of the band’s story. It traces Queen’s meteoric rise and the creation of its biggest hits like “Bohemian Rhapsody.” Director Bryan Singer was replaced during production, though he retains his credit.The film cost $52 million to make, before marketing costs, according to Box Office Mojo, suggesting a profitable run for the picture. According to RottenTomatoes.com, 61 percent of critics recommended the movie.The better-than-expected opening “speaks to the universal appeal of Queen and their music,” said Chris Aronson, president of domestic distribution at Twentieth Century Fox. The audience was evenly split by gender and 43 percent of the audience was in the 18-34 age range, highlighting how the film appealed to people who weren’t Queen contemporaries. The movie also exceeded expectations for international sales, collecting $122.5 million globally.Successes for the film division of 21st Century Fox Inc. will ultimately become wins for Disney. The Burbank, California-based entertainment giant is buying most of Fox’s entertainment assets in a $71 billion deal expected to close next year.The metrics for Disney’s “Nutcracker” movie aren’t so favorable and it may face a slog to break even during its theatrical run. Reportedly made for more than $100 million, the film was expected to open with sales of about $19.5 million, according to Box Office Pro. Just a third of critics recommended the movie, according to RottenTomatoes.Based on the classic E.T.A. Hoffmann tale, “The Nutcracker” features a star-studded cast including Morgan Freeman, Helen Mirren and Keira Knightley. In the film, a young girl is transported to a magical world of gingerbread soldiers and an army of mice. They search for a special key that will unlock a priceless gift, traveling to the ominous fourth realm.“We were looking for a stronger start, but it is a great family-friendly option for moviegoers as we head into the holidays,” said Cathleen Taff, president of theatrical distribution at Disney.With “Nobody’s Fool,” Paramount Pictures tapped into the rising popularity of comedian Tiffany Haddish in a feature written and directed by Tyler Perry.Haddish plays Tanya, an ex-con looking to get back on her feet with the help of her successful sister Danica, played by Tika Sumpter. She finds out Danica has been tricked into an online relationship and they go out to unmask her secret boyfriend. The $19 million movie was forecast to open fourth with sales of $14.4 million, according to Box Office Mojo. Just 20 percent of critics recommended the picture.Correction, Nov. 9.The original version of this story misstated the name of a show in which Rami Malek won an Emmy for his role. It was Mr. Robot, not Bad Robot.Contact us at editors@time.com."}