{"id": "Three Girl Scouts and 1 Adult Killed in Wisconsin Hit-and-Run Crash", "paragraph": "LAKE HALLIE, Wis. — A western Wisconsin community on Sunday was grieving the deaths of three Girl Scouts and an adult who were collecting trash along a rural highway when police say a pickup truck veered off the road and hit them before speeding away.Authorities have not released the names of the girls or the woman who were struck by the truck on Saturday in Lake Hallie, including the name of a fourth girl who survived but was in critical condition at a hospital in Rochester, Minnesota. The girls were members of Troop 3055 and were fourth-grade students at Halmstad Elementary School in adjoining Chippewa Falls, which is about 90 miles (145 kilometers) east of Minneapolis.“Our hearts are broken for the girls and families of the Girl Scouts of the Northwestern Great Lakes,” CEO Sylvia Acevedo of Girl Scouts of the USA said in a statement Sunday. “The Girl Scout Movement everywhere stands with our sister Girl Scouts in Wisconsin to grieve and comfort one another in the wake of this terrible tragedy.”Lake Hallie police Sgt. Daniel Sokup said the pickup, a black Ford F-150, crossed a lane and veered into a roadside ditch, striking the victims. Other members of the troop were pickup up trash from the opposite shoulder.The 21-year-old driver, Colton Treu of Chippewa Falls, sped off but later surrendered and will be charged with four counts of homicide, Sokup said. It was unclear Sunday if Treu had an attorney who could speak for him.Sokup said it was not immediately known if there were other factors that might have led the driver to leave the road. The Minneapolis Star Tribune reported that the crash happened before a hill and there were no blind spots, Sokup said it was “not an unsafe area.”But Cecily Spallees, a personal care attendant at a group home near the crash site, told the newspaper that drivers regularly speed on that stretch of road, which quickly changes from a 55-mph to a 35-mph zone.“I’m always telling one of my residents that he shouldn’t walk this strip at night,” Spallees said. “It’s not safe.”Troop 3055’s regional council, the Girl Scouts of the Northwestern Great Lakes, expressed its condolences on Facebook and said a vigil will be held Sunday evening at the girls’ school.Contact us at editors@time.com."}