{"id": "Elizabeth Warren's DNA Test and the Difficult History of Looking for Answers in Blood", "paragraph": "If Massachusetts Senator Elizabeth Warren hoped that releasing the results of a DNA test would settle the issue of her claim to Cherokee heritage, she was quickly proved wrong. In a video highlighting her family heritage, which she released on Monday, Stanford University geneticist Carlos Bustamante states on camera that “the facts suggest that you absolutely have a Native American ancestor in your pedigree”; in later tweets, Warren explained that she released the test results as a response to the “racism” of President Donald Trump’s repeated mockery of that part of her background.In the days that followed, the release reignited debate regarding not only the reliability of commercial DNA tests, but also the very meaning of DNA when it comes to questions of race and heritage.In Warren’s case, the Cherokee Nation quickly responded that “a DNA test is useless to determine tribal citizenship” and that using such a test to claim a connection “is inappropriate and wrong.” (Warren herself acknowledged that the results said nothing about tribal citizenship). But the problem with trying to use a DNA test to claim any racial identity goes far beyond this one example. In fact, the uproar over Warren’s case is part of a long American history of trying, and failing, to use science or pseudoscience to categorize people.At the heart of the debate is the matter of science as a social institution informed by societal norms—not a separate, apolitical enterprise based on objective observation.Geneticist R. C. Lewontin, in his classic book Biology as Ideology: The Doctrine of DNA traces the connection between the history of DNA and the rise of Western secularism in the 19th century. Lewontin argues that science is a social institution that—despite its claims of objectivity—”reflects and reinforces the dominant values and views of society at each historical epoch.” During the Middle Ages and the Renaissance, the science of the period held a holistic view of nature that mirrored religious notions of the way the world worked. Later, science shifted to reflect a new idea that to understand the whole required analyzing individual bits and pieces (such as atoms, molecules, cells, and genes). “Our genes and the DNA molecules that make them up are the modern form of grace,” Lewontin writes.In this new thinking, which Lewontin calls the “ideology of biological determinism,” those biological components tell people who they are and where they fit in society.The mid-19th century, as I describe in my book That the Blood Stay Pure, saw the rise of the American School of anthropology, which used theories of scientific racism to support pro-slavery ideology and the doctrine of Manifest Destiny — with its destruction of Native American communities — on the basis of what W.E.B. Du Bois later called “the grosser physical difference of hair, skin, and bone.” Scientific findings validated societal notions of human difference in which Europeans occupied a higher rung on the hierarchy of humanity, with Indians below them and Africans near the bottom.But among the many problems with the idea was one of racial categorization based on science. If you believed that some races were better than others, it mattered a lot who fell into which category. The followers of this theory, whose findings appeared to be scientific, were in fact using ideas appropriated from old European notions of blood and purity based on religion to answer their questions about who was white, who was black and who was Native American.Get your history fix in one place: sign up for the weekly TIME History newsletterBy the late 19th century the ideology of biological determinism had made its way into American law, where the politics of blood reigned. People of African descent were defined by the law of hypodescent, meaning that one drop of black “blood” made one black, despite any other ancestry. Meanwhile, a competing concept called blood quantum, requiring much more than one drop, defined American Indian identity. The discrepancy of racial definitions was captured by author Karen Blu in her book The Lumbee Problem: The Making of An American Indian People. “It may only take one drop of black blood to make a person a Negro, but it takes a lot of Indian blood to make a person a ‘real’ Indian,” she stated.Society’s definitions of race — and the attendant social ramifications of those categories — didn’t map directly with biology. Even so, such ideas were on the rise.In 1904, Francis Galton, a cousin of Charles Darwin, delivered a lecture before the Sociological Society in London on the science of eugenics, a theory he began to develop in the 1880s that, in his words, “deals with all influences that improve the inborn qualities of a race.” Galton’s ideas were instrumental in spreading what would become one of the most insidious pseudoscientific falsities of the 20th century: the idea that some races are biologically better than others, and that human beings can be bred for improvement. He thus set the stage for a pernicious racial campaign that contributed to everything from stricter anti-miscegenation laws and the rise of involuntary sterilization to the philosophy of Hitler and the Third Reich.But thinkers on the other side were already countering these ideas. In 1942, as Americans crossed the Atlantic to fight in WWII, anthropologist Ashley Montagu—a student of Franz Boas who opposed eugenics and the scientific racism of the previous century – published his influential book Man’s Most Dangerous Myth: The Fallacy of Race which opposed biological determinism on the premise that the concept of race had no genetic basis. Individual physical appearance, individual intelligence and “the ability of the group to which the individual belongs to achieve a high civilization” could not be scientifically determined.His work was the side that stood the test of time. In 1998, the American Anthropological Association released a Statement on Race that debunked the ideology of biological determinism and the concept of race as scientific fact. In other words, race is politics not biology. Still, old myths die hard. Even today, many people rely on racial definitions of who is black and who is Indian that can easily be traced back to the old ideas of the one-drop rule and blood quantum.Meanwhile, with the question of race as a social construct considered settled by a large swath of the scientific community, genetic science pressed full speed ahead.In the late 20th century, as James Shreeve details in his 2006 National Geographic article “Reading Secrets of the Blood,” two separate genomic projects were launched. The most popular was the Human Genome Project, an international scientific collaboration that aimed to provide an entire blueprint of a human being by sequencing the estimated 25,000 genes in the nucleus of the human cell known as DNA. In summer 2000, when scientists Francis Collins and Craig Venter stood with President Bill Clinton at an international press conference to present the first draft of the mapping and sequencing of human DNA, one aspect of the presentation that drew particular media attention was the unequivocal assertion that racial classifications made no biological sense.Advances in genetic science have also allowed home DNA tests to grow as a business, offering people a chance to see what their blood could tell them. But with that possibility came the danger of sliding back into a history that many hoped had been left behind. For example, the 2006 PBS special African American Lives, hosted by Harvard scholar Henry Louis Gates, used DNA tests to trace the supposed lineage of the eight guests to their African countries of origin as well as to calculate their percentage of American Indian heritage. Gates was taken to task for the weight he placed on DNA results, but the gates were already open: many Americans were convinced that DNA tests could provide perfect and complete proof of ancestral lineage.But in fact, as the scholar Kim TallBear, author of Native American DNA: Tribal Belonging and the False Promise of Genetic Science, has stated on numerous occasions, “People think there is a DNA test to prove you’re Native American. There isn’t.”Reliance on DNA reinforces old notions of separate biological races and lends credence to archaic ideas of racial purity, which are now being appropriated by white supremacists. That Sen. Warren would look to DNA as a way to prove her point is not surprising; for more than a century, Americans and others have accepted the notion that race is blood in the search for those answers. But what people have found instead, time and again, are more questions.Today science is as sacred as religion. Its claimed authoritative validity has mostly gone unquestioned. But just as the age of science resulted in what Lewontin called “a reasonable skepticism” of the overarching claims of the institution of the Church, we must also question the sweeping claims of the doctrine of science if we intend to truly know who we are.Historians explain how the past informs the presentArica L. Coleman is a scholar of U.S. history and the author of That the Blood Stay Pure: African Americans, Native Americans and the Predicament of Race and Identity in Virginia and a former chair of the Committee on the Status of African American, Latino/a, Asian American, and Native American (ALANA) Historians and ALANA Histories at the Organization of American Historians.Contact us at editors@time.com."}