{"id": "The French President Wants to Defy Nationalism by Creating a Europe-Wide Army. That's One Battle He's Likely to Lose", "paragraph": "Over the past rainy weekend in Paris, dozens of world leaders gathered in the French capital and seemed wholly focused on marking the devastation of World War I, which ended 100 years ago and claimed the lives of some 16 million people.But beyond the ceremonial proceedings, a war of words was unfolding: The fierce nationalism of U.S. President Donald Trump on one side, and the passionate globalism of his host, French President Emmanuel Macron, on the other.Trump blasted Macron just as Air Force One touched down in Paris on Friday night. He tweeted that Macron “has just suggested that Europe build its own military in order to protect itself from the U.S., China and Russia. Very insulting, but perhaps Europe should first pay its fair share of NATO, which the U.S. subsidizes greatly!” The jab followed Macron’s comments to Europe 1 radio earlier that week, when the French president mentioned “attempted attacks in cyberspace and interference in our democratic lives” and concluded Europe needed to protect itself “with respect to China, Russia and even the United States of America.” To Trump, it did not matter that Macron was referring to attacks on the Internet rather than live battlefields. And so when the two men met on Saturday morning at the Elysée Palace, they wore frozen smiles—a sharp contrast with the effusive welcome Trump received on his last visit to France for Bastille Day celebrations in July 2017.“We have become very good friends,” Trump told reporters on Saturday. But all weekend, Trump cut a solitary figure. He canceled his visit to the U.S. war cemetery in Belleau Wood northeast of Parison Saturday afternoon, apparently because rain had grounded the Marine One helicopter. Meanwhile, Macron and German Chancellor Angela Merkel hugged each other in Compiègne, the site where the Armistice peace treaty was signed in 1918. Macron posted the photo on Twitter with just one word: “Unis.” (United.)On Sunday morning, Trump again went his own way: He ducked into the Elysée Palace through the side entrance of the building, for a breakfast with all the leaders, rather than joining Macron’s receiving line at the front door. And after breakfast, almost all 70 leaders walked down the Avenue du Champs-Elysée, in the rain, to the Arc de Triomphe—a symbolic echo of victorious French troops marching down the avenue after Paris was liberated from the Nazis (with critical U.S. help) in 1944. Meanwhile, a U.S. motorcade escorted Trump alone to the ceremony.There, standing under the arch, at the official ceremony to mark the end of the war, with leaders from across the world seated before him, Macron issued his sharpest rebuke yet to Trump, albeit without once mentioning his name. “Nationalism is a betrayal of patriotism,” the French leader said. With Trump, Russian President Vladimir Putin and Merkel all seated in the front row, he said nationalism and patriotism were exact opposites. By putting our interests first, he warned, “ we erase what a nation holds dearest, what gives it life, what makes it great and what is essential: its moral values.” And yet despite that impassioned plea, there is one fact Macron cannot escape: he, and indeed all of Europe, badly needs the United States.For months, Macron has called for Europe to ramp up its military forces, and to try to create what he calls a “European Army,” in which the European Union’s 28 member nations (27 after Britain leaves in March) would jointly train forces and deploy them in battle. Without a crack fighting force, Europeans will remain dependent on outside help— as it did during both world wars, when the U.S. military stepped in.On a continent that has suffered centuries of wars, military independence is a tempting prospect. But in reality, Macron’s idea is widely regarded as unworkable.“You cannot have an Army without having an executive branch,” says François Heisbourg, special adviser to the Foundation for Strategic Research in Paris. “The E.U. is not a country, it is not a state,” he says. And so, he says, “you will notice the resounding silence from Macron’s E.U. partners.” In part because of Macron’s push—and perhaps also because of pressure from Trump—several E.U. countries increased military spending last year, according to Heisbourg. But Europe remains heavily dependent on the U.S. for its security. “They could not manage without the U.S. in a big crisis,” says Michael Shurkin, senior political scientist in Washington for the RAND Corporation, who studies E.U. militaries. While France and Britain regularly deploy forces in shooting wars, few other European countries do. “By and large, all of them have militaries designed to work as a coalition run by the U.S,” he says.In recent wars in Libya and Mali, French forces depended on the U.S. military for aerial refueling, early warning systems, and other key operations that the Europeans were simply incapable of doing. In addition, says Shurkin, E.U. governments have for years cut military budgets, “knowing full well that the U.S. would protect them.”For many Europeans, the history of catastrophic battle still looms large. There are monuments and plaques to those killed in World War I in almost every French village, town, and even in schoolyards. At least 3 million French and German soldiers died, as well as about 116,000 American soldiers. “It is the most important element of France’s collective memory since the French Revolution” in 1789, says Heisbourg. “Every family surrendered their boys to the war.”And among the E.U. members that border Russia, like Latvia, Lithuanian and Estonia, the possibility of another major war seems quite feasible.“We are doing everything together to strengthen our security in the region,” Latvian President Raimonds Vējonis told TIME in Paris on Sunday. He cited Russia’s annexation of Crimea in 2014 as an example of the rising threat from Moscow. Yet like others, Vējonis says he does not support Macron’s idea of a European Army—even if it was feasible. That is because the Baltics, like others, depends heavily on U.S. and Canadian military cooperation and intelligence, which could take a lesser role if a European Army existed. “That is why it is very important we are part of NATO,” he said.For Macron, the challenge now is to inject a sense of urgency, at a time when Europe is not at war. At a dinner at the D’Orsay Museum in Paris on Saturday night, he told the leaders that they risked taking peacetime for granted—an unwise proposition, he said, on a continent that has known repeated wars.And on Sunday night when Macron opened his inaugural Paris Peace Forum, a gathering of presidents, prime ministers, politicians and executives, he marveled at how leaders of countries that were bitter enemies a century ago, were now close friends, seated in the audience. “Will it be a snapshot of the final moment of unity, before the world descends into disorder?” he asked. “The answer is down to us.”Contact us at editors@time.com."}