{"id": "Pussy Riot Joins With Democracy Activists to Call for Greater Freedoms in Hong Kong", "paragraph": "Russian punk activist band Pussy Riot organized a protest with Hong Kong democracy activists on Sunday night following the cancellation of a Chinese dissident artist’s exhibition.Donning the band’s signature balaclavas, two members of Pussy Riot—Olga Kurachyova, 31, and Veronika Nikulshina, 21—assembled with others in Hong Kong’s SoHo district, to call for greater freedoms in the semi-autonomous Chinese territory and denounce the scrapping of an exhibition by Badiucao, the pseudonym of a well-known political cartoonist and critic of the Chinese government. The cancellation is seen as the latest in a string of threats to free speech in Hong Kong. Kurachyova and Nikulshina will be familiar to soccer fans as two of the four members of Pussy Riot who invaded the pitch at the Croatia vs. France final of the World Cup to protest humans rights abuses in Russia. They were joined in Hong Kong Sunday by 22-year-old local democracy leader Joshua Wong.“Freedom of expression, no matter in Beijing or in Hong Kong, is just tightening under the Chinese and Hong Kong Government,” Wong told a crowd of reporters and passers-by.Read more: Pussy Riot Members on Protests, Poisonings and PoliticsThe members of Pussy Riot were in Hong Kong for an LGBTQ forum, but joined Wong in organizing the protest after news broke that the organizers of the Badiucao exhibition were calling off the show following unspecified threats from China. Badiucao had called Hong Kong “the city of resistance and hope.”“I just had a feeling of flashbacks,” Kurachyova told TIME after learning about the increasing pressure on freedom of expression in Hong Kong. “Because we watched the same in Russia [in] previous years, so I’m really very sorry to know all these things…I’m afraid it’s going to be worse.”Hong Kong, a former British colony, was returned to China in 1997 under a 50-year framework called ‘One Country, Two Systems,’ a formula that enshrined political and social freedoms enjoyed under colonial rule that are otherwise anathema to the Chinese government. But those liberties, including free media and speech, have come under intensifying pressure.Last month, Financial Times Asia editor Victor Mallet became the first journalist to be expelled from the territory since the resumption of Chinese sovereignty. The authorities have refused to give an explanation, but Mallet’s visa rejection is widely understood to be retribution for his chairing of a talk by independence activist Andy Chan at the city’s Foreign Correspondents’ Club, where Mallet was also vice president. Chan’s political party, the Hong Kong National Party, is now banned.“It’s a problem to discuss power. People are afraid to have free speech, so we are here,” said Pussy Riot member Nikulshina. “It’s not the same [as in Russia], but going that way.”Write to Casey Quackenbush at casey.quackenbush@timeinc.com."}