{"id": "Can Beto O'Rourke Win? Texas Democrats Hold Their Breath", "paragraph": "Jason Kile is the kind of voter who makes Democrats optimistic that they can win the Senate seat here. The 45-year-old business analyst took an almost-eight-hour road trip to pick up his two children attending Texas A&M and his third at the University of Texas-Austin so that the family could vote together for Democratic nominee Beto O’Rourke.“I feel like I’m setting an example for my kids,” said Kile as he stood in line here near Dallas to get a picture with O’Rourke, a three-term House member who has come close to becoming the first Democrat to win a statewide race in Texas since 1994 — a record dry-spell in the nation.There is definitely something sizzling in Texas. O’Rourke is an impressive candidate who is hustling for every vote. He has campaigned in every one of Texas’ 254 counties, is raising cash quicker than he can spend it and is drawing so many newcomers into politics that pollsters from both parties concede that their models could be scrambled by folks who typically didn’t consume political news, let alone make it.Yet, in conversations with more than 40 Texans over three days in and around Dallas, it’s not clear anyone actually thinks O’Rourke can win. The typical response to the question “Can Beto win?” is crossed fingers or a Catholic sign of the cross.“I would like to think so,” 61-year-old retired teacher Emily Barmer said as she stood outside an early voting location in DeSoto. “I thought he had a chance, but I keep seeing the polls. Down 6, down 8 points.”That’s the rub. O’Rourke is drawing huge crowds and comparisons to other Democratic stars. “He’s Kennedyesque,” said 73-year-old Dan Keough, who saw both John and Bobby Kennedy campaign in the 1960s. Separately, 38-year-old Demethius Jackson made a more recent analogy: “I haven’t seen this much momentum since the Obama election.”But there has yet to be a poll showing him ahead of Cruz. Headwinds are aplenty in Texas for Democrats, despite hundreds of grassroots events that spring up across the state to organize voters in support of O’Rourke. “We don’t know what’s going to happen, but we’re trying to make something happen,” said Rep. Eddie Bernice Johnson. “Beto has out-raised anybody we’ve ever run. We’re pleased about that and we hope it will help him pass. … Even if he doesn’t win, we’ve made real progress if we can get these young people interested in voting.”Some O’Rourke fans and critics alike claim — despite the candidate’s consistent insistence otherwise — that he will be seeking the presidency in 2020, win or lose. “I won’t be surprised if he doesn’t” win, said Jonnie England, whose car sports two “Beto” stickers and another urging her neighbors to “RESIST.” The O’Rourke campaign is the first she’s volunteered for in 40 years and she spends much of her time promoting the candidate as a straight-shooter who can most the country past politics. “I’ll be deeply saddened [if O’Rourke loses], but there’s 2020 right around the corner. He says he doesn’t want to run, but minds can be changed.”The ding on O’Rourke, of course, is that he is the most over-hyped candidate of the cycle. He is drawing enthusiastic and genuine crowds. He has raised a record $38 million in the third quarter of this year. And his speeches, often delivered at the expense of his vocal cords, border on Obama-caliber aspirations. “He is the great hope of Texas,” says Candice Quarles, a city councilwoman in DeSoto.Still, O’Rourke is running in Texas, a state that has tempted Democrats in the past to think they have a chance, only to see devastating losses. “It appears to me to be this term’s iteration of Democrats’ great hope. Four years ago, it was Wendy Davis and she was going to be the start of a blue wave and she wasn’t. This time, it appears to be Congressman O’Rourke’s turn to be this term’s Wendy Davis,” says James Dickey, the chairman of the Republican Party of Texas. “There’s no reason for Texas voters to vote against Republican elected officials.”Davis, in 2014, drew similar optimism about her odds, but still captured just 38% in her bid for Governor. And despite being a rather matte candidate, Cruz fits the bill for many Texans, especially when it comes to immigration and communities of faith. His role in confirming Justice Brett Kavanaugh to the Supreme Court is a selling point for self-described Christian conservatives and evangelicals, and Trump’s decision to hold a rally in support of Cruz helped, too. At the same time, Trump has a net negative approval rating in Texas.Yet, there are signs that maybe, if the stars align, O’Rourke could pull this off. “Everyone I know is on Team Beto,” says Machelle Allums, a 59-year-old who works in insurance. “If the elections are fair, he’s got this.” Voters under the age of 30 have been showing up at early voting centers at rates five-fold over where they were in 2014, the last non-presidential campaign year. Republican enclaves in the state are seeing “Beto” signs in neighbors’ yards — and in neighborhoods outside of Texas, too.“Beto has so much support. He’s changing politics for the better,” said Linda Unger, a 63-year-old Dallas woman. “That support might not be all in Texas, though.” Write to Philip Elliott at philip.elliott@time.com."}