{"id": "Prayer, Food and Defiance: How Pittsburgh's Jewish Community Is Coping 1 Week After Anti-Semitic Attack", "paragraph": "Aviva Lubowsky does not usually attend weekly Shabbat services at her local synagogue in Pittsburgh.But one week after 11 people were killed at the Tree of Life temple, the mother to two young children felt she had to seek community and show her son and daughter that they can still pray without fear.“There’s no way I wouldn’t be here,” says Lubowsky, a lifelong resident of Squirrel Hill, the Pittsburgh neighborhood where the shooting occurred. It is home to at least half the city’s Jewish population. “We live in a country where we have the freedom to go to shul, to pray, to be who we are. Sadly, there was a man who hated us for this. But despite him, we still have this right.”Lubowsky, who went with her family to services at the Beth Shalom Congregation on Saturday, was one of hundreds around Pittsburgh who attended the first Shabbat services offered over the weekend since the shooting one week ago. Eleven people died and six were injured after Robert Bowers, fueled by hateful anti-Semitic conspiracy theories, allegedly opened fire at Tree of Life. He has been indicted on 44 counts, including hate crimes.This week, with Tree of Life still cordoned off by police, Beth Shalom hosted congregation members affected in shooting, and offered them a chance to participate in Saturday’s services. Beth Shalom saw more worshippers than the temple would typically see on a regular Saturday, including those from the Tree of Life congregation and people of all different faiths.To Gary Friedman, a Beth Shalom congregant and Squirrel Hill resident, the sight of a full synagogue on Saturday gives him hope that more people will continue to show up in the coming weeks. He says that as the older Jewish population dies or relocates to warmer climates, the temples tend to stay empty; younger people, he says, don’t rely on the synagogue as much for a sense of community. Still, he’s heartened by seeing the high Shabbat turnout.“It was important for us to heal,” Friedman says. “I wonder how long the momentum will go so that people will feel compelled to come to services.”Seats were also full Friday night at Rodef Shalom Congregation where the entire community, Jewish or not, was invited to reflect following a week of mourning in the city. Local officials, including Pittsburgh Mayor Bill Peduto, were present. So was the leader of the Islamic Center of Pittsburgh, Wasi Mohamed, who received a standing ovation before he even addressed the congregation – after he helped raise more than $200,000 in the wake of the shooting.Joanne Rogers, the widow of beloved children’s television icon Fred Rogers, who made his home in Squirrel Hill, attended the Friday night service and spoke at Rodef Shalom.“I have had trouble dealing with the fact that this happened, but I don’t want to give credit to the fact that it happened,” she said, adding: “The most important thing is the love and the care that came out of that from the people here.”The desire to extend interfaith support to the Jewish community brought Margaret Campbell, a Squirrel Hill resident who attends the Catholic St. John Fisher Church, to the temple on Saturday.“The community will be stronger as a result of this atrocity,” says Campbell, sharing that her church choir last week sang “Shalom,” which means peace, as a show of unity.It’s that community strength that Pittsburgh residents will rely on in the coming weeks as the city moves forward and tries to heal from the tragedy. Politicians in the area plan to stay involved with their constituents and help them recover, according to Erika Strassburger, a council member for Pittsburgh’s 8th district, where Tree of Life is located. Strassburger says she plans to attend Shabbat services and potluck dinners throughout the Jewish community in the coming days and work with local groups and businesses to mobilize against hate crimes and hate speech.“It’s going to be months, possibly years, of recovery mentally if not physically,” Strassburger says. “My focus is on those who are most directly affected, which includes rabbis and the congregants who knew these people really well as pillars of the community.”Local organizations have also come up with events to help the city move forward in the shooting’s aftermath. The Pittsburgh chapter of the Democratic Socialists of America organized a workshop Saturday to inform people about the causes of white nationalism and teach them how to fight against it. Organizers with the progressive Jewish movement Bend the Arc, which this week protested President Donald Trump visiting Pittsburgh, will continue to collaborate with other organizations in the city to mobilize against white supremacists as well, says Josh Friedman, one of Bend the Arc’s leaders.Before the attack, Bend the Arc frequently led protests in the city against matters such as children being separated from their parents at U.S.-Mexico border, trained people to intervene when they witness harassment and fought for rights for immigrants and refugees. Following the attack, members’ resolve has only strengthened.“Why would we stop?” Friedman asks. “These are our people.”Others are banding together over food. Michal Schachter, who lost a friend in the shooting and lives in Squirrel Hill, says she plans to distribute challah bread to the families of the victims. A kindergarten teacher at the local Community Day School, Schachter says she will also facilitate memorial services so the children understand the impact of incident.“We’re going to bake challah and we’re going to spread them between the shiva houses,” Schachter says. “This is one thing. It’s so fresh, but slowly, slowly we are going to start to do things.”CB Chernomorets, a graduate student at the University of Pittsburgh who lives in a Jewish communal home in Squirrel Hill called Moishe House, said people have been coming in and out all week just to seek friends or a bite to eat.“I’ve flipped more grilled cheeses and made more pots of soup in the last three days than ever before,” Chernomorets says. “We’ve been feeding everyone. That’s what Jews do best in times of trauma.” Correction, Nov. 5The original version of this story misstated the last name of Aviva Lubowsky. It is Lubowsky, not Lubowski. The original version of this story also misstated the gender of one of her children. She has a daughter and a son, not two daughters. Write to Mahita Gajanan at mahita.gajanan@time.com."}