{"id": "President Trump Arrives in Pittsburgh to Mixed Feelings as City Mourns After Synagogue Massacre", "paragraph": "(PITTSBURGH) — President Donald Trump came to pay tribute Tuesday to those touched by the worst instance of anti-Semitic violence in American history, traveling to a city where he faced an uneasy welcome from those grieving.Trump stepped into the role of national consoler, a title he wears uncomfortably, as he arrived in Pennsylvania to visit Squirrel Hill, the Pittsburgh neighborhood that is home to the Tree of Life synagogue, where 11 people were gunned down during Sabbath services on Saturday.When Air Force One touched down at the airport outside Pittsburgh, Trump and first lady Melania Trump were not greeted by the usual phalanx of local officials that typically welcomes a visiting president, a reflection of controversy surrounding the visit.The White House said Trump was coming to “express the support of the American people and to grieve with the Pittsburgh community.” But local and religious leaders were divided on whether Trump should be there.Pittsburgh Mayor Bill Peduto, a Democrat, told reporters before the visit was announced that the White House ought to consult with the families of the victims about their preferences and asked that the president not come during a funeral. Neither he nor Democratic Gov. Tom Wolf planned to appear with Trump.Trump’s itinerary remained under wraps even as he stepped off the plane, trailed by his daughter Ivanka Trump and son-in-law, Jared Kushner, who are Jewish, and members of the first lady’s staff carrying white flowers. The White House invited the top four congressional leaders to join Trump in Pittsburgh, but none accompanied him.A spokesman for Republican Senate Majority Leader Mitch McConnell said he already had events in his home state, pushing back on the suggestion that he declined. Republican House Speaker Paul Ryan’s office said he could not attend on short notice. Democratic Senate Minority Leader Chuck Schumer and Democratic House Minority Leader Nancy Pelosi also opted not to participate.Questions have long swirled about the president’s credibility as a unifier. Since his 2016 campaign for the White House, Trump has at times been slow to denounce white nationalists, neo-Nazis and other hate-filled individuals and groups that found common cause with his nationalistic political rhetoric.Trump traveled to the historic hub of the city’s Jewish community as the first funerals were scheduled to be held for the victims, who range in age from 54 to 97. He is expected to meet with first responders and community leaders. The death toll includes a set of brothers, a husband and wife, professors, dentists and a physician. It was not immediately clear whether Trump would meet with any family members.Those who live in the tight-knit community were uncertain about whether they wanted the presidential visit. To Marianne Novy, Trump wasn’t wanted “unless he really changes his ways.” For David Dvir, politics should take a pause for grief: “It’s our president, and we need to welcome him.”Barry Werber, 76, who said he survived the massacre by hiding in a dark storage closet as the gunman rampaged through the building, said he hoped Trump wouldn’t visit, noting that the president has embraced the politically fraught label of “nationalist.” Werber said the Nazis were nationalists.“It’s part of his program to instigate his base,” Werber said, and “bigots are coming out of the woodwork.”Novy, 73, a retired college English professor, said she signed an open letter asking Trump not to come to Pittsburgh. “His language has encouraged hatred and fear of immigrants, which is part of the reason why these people were killed,” she said.Just minutes before the synagogue attack, the shooter apparently used social media to rage against HIAS, a Jewish organization that resettles refugees under contract with the U.S. government.Dvir, 52, the owner of Murray Avenue Locksmith in Squirrel Hill, said of Trump: “I think he made some mistakes, but he is a great president.” He added that it would be “a shame” if the community protested the president’s visit.Asked Monday if Trump had done enough to condemn white nationalism, White House press secretary Sarah Huckabee Sanders said the president “has denounced racism, hatred and bigotry in all forms on a number of occasions.”She added: “Some individuals — they’re grieving, they’re hurting. The president wants to be there to show the support of this administration for the Jewish community. The rabbi said that he is welcome as well.”Beth Melena, campaign spokeswoman for Wolf, said the governor did not plan to return to Pittsburgh as part of Trump’s visit on Tuesday. She said he based his decision on input from the victims’ families, who told him they did not want the president to be there on the day their loved ones were being buried.“Community leaders expressed to the governor that they did not feel it was appropriate for Trump to come, so the governor made a decision not to join him on his visit out of respect for the families and the community,” Melena said.But Rabbi Jeffrey Myers, who was conducting Sabbath services at the Tree of Life synagogue when the shooter opened fire, made clear the president would be welcome, telling CNN: “The president of the United States is always welcome. I am a citizen. He is my president. He is certainly welcome.”Shulamit Bastacky, 77, a Holocaust survivor and neighbor of victim Melvin Wax, expressed hope that fraught political issues and protests would not overshadow the remembrances.“This is not the place to do it,” she said. “You can do the political part everywhere else. Not at this time. This would be like desecrating those people who were killed. They were murdered because they were Jews.”“You can protest later on,” she added. “To me, it’s sacred what happened here.”___Lemire reported from New York. Associated Press writer Catherine Lucey contributed from Washington.Contact us at editors@time.com."}