{"id": "Review: Google's New Pixel 3 Has One of the Best Cameras You Can Get Right Now", "paragraph": "Leak after nearly unbelievable leak gave the world a good look at Google’s newest pair of smartphones, the $799 Pixel 3 and larger, $899 Pixel 3 XL, well before the company’s official October 9 announcement. Still, the company that introduced Android to the masses knows how to make a smartphone, and the Pixel 3 is an impressive device. It’s fast, takes great photos, and uses Google’s treasure trove of AI expertise to make time spent using it time well spent. But even with all the upgrades, does the Pixel 3 do enough to stand out in a world where many high-end smartphones are pretty much identical?At first glance, the Pixel 3 isn’t all that different from the Pixel 2 before it, which doesn’t help its case. Sure, there are some minor cosmetic changes, like the new “Not Pink” color scheme and wireless charging-compatible glass back, but that’s about it. If you didn’t know any better, you’d probably think they were the same device. The Pixel 3 XL has made a slightly more controversial change, adopting the notch made famous by Apple’s iPhone X and sticking a second front-facing camera there. The soft corners and lack of chrome or stainless steel finishes make it feel like a phone that isn’t trying to impress you with its aesthetic. The end result is a design too milquetoast for 2018. In a world where smartphone displays kiss the metal edges of their housing, and fingerprint readers lurk beneath high-resolution displays, the Pixel 3, on the outside, feels uninspired. And if you’re concerned about smartphone size, don’t worry: these phones are, like the competition, almost uncomfortably large. The XL further ups the ante with an even more unwieldy 6.3-inch screen.The Pixel 3 includes USB-C headphones, still a rarity and a glaring omission from last year’s Pixel 2. Clearly inspired by the company’s wireless Pixel Buds, the Pixel USB-C earbuds feature an adjustable loop for securing them in your ear, though it’s made of the same rubbery material as the rest of the cable, making it harder to accidentally adjust the sizing. Still, like most gratis earbuds, they feel cheap and don’t sound great.On the inside, the Pixel 3 sports some expected upgrades. The new Snapdragon processor brings improved 4K video recording, better support for graphically-demanding games and faster download speeds. Still, it’s lacking in the storage department, and you’ll only get 64GB of storage unless you pay an extra $100 to upgrade to the 128GB model, something to consider since there’s no microSD slot for adding storage yourself. Worried about running out of space while you’re snapping photos? Google is offering unlimited, full-resolution storage for photos and videos until 2022 through Google Photos, so you won’t have to delete those family vacation snaps. Last year’s Pixel 2 already had an impressive camera, one that rivaled the iPhone X. Google’s Pixel 3 is no different, and only improves on the formula that made the Pixel 2 great. I say formula because the majority of the changes here are software-based. Don’t let the lack of extra lenses fool you, either: The Pixel 3’s camera is its best asset, and its single-lens design takes amazing photographs. Its 12-megapixel camera uses Google’s expertise in AI to enhance photos and admirably simulate features like Portrait Mode. When it works, it works pretty well, and lets you adjust the depth of field after-the-fact so you can set the amount of background blur to your preference.The Pixel 3’s most enticing photography features are seamlessly integrated into the camera app itself, which is a plus. Top Shot automatically picks the best images from a photo burst. Super Res Zoom simulates a telephoto lens, using the subtle movements from your caffeine-addled hands to gather more data and produce a less blurry zoom photo. Photo Booth recognizes when you’re smiling or making weird faces and snaps photos without your needing to hit the shutter button (it’s pretty hit or miss, requiring a bit of facial gymnastics to trigger it). Motion Auto Focus automatically tracks moving subjects, and Playground lets you take photos with characters — like a cheeseburger, or Iron Man — using augmented reality. It’s a fun gimmick, though I haven’t used it since I took a few selfies with the second-richest Avenger. Google Lens uses your camera to identify whatever it’s pointed at. You can copy text, identify a plant species, or buy the same sneakers you just saw on your co-worker’s feet. There are two front-facing cameras on the Pixel 3 and 3 XL (the latter sticks them in the ugly notch). That second camera uses a wide-angle lens to capture more of the scene and your friends; transitioning between the two is seamless. That means you can finally ditch your selfie stick, though you might notice a slight fisheye look around the edges of your images. Don’t get excited, though — Google’s Pixel 3 doesn’t feature the same face-scanning features found in Apple’s latest iPhones. All these software-based tweaks and features make the Pixel 3 one of the greatest smartphone cameras you can get for your money. Is it the best smartphone camera? At this point, that depends on your personal preference for feature sets and how each phone renders images — but it’s getting hard to pick a loser when it comes to high-end smartphone photography. Android 9 Pie, Google’s latest version of its smartphone operating system, takes advantage of the vertical integration between Google’s hardware and software to deliver the most polished Android experience yet on the Pixel 3. If you care about being on the forefront when it comes to software updates, new features and bug fixes, using a smartphone straight from the source is your best bet. One of Android 9’s most anticipated features is the new Digital Wellbeing service, which lets you get a grip on your smartphone addiction before you wonder where the last three hours went. Being able to view my screen time on a daily chart, for example, helped me kick my late-night habit of browsing for funny tweets by letting me enable time limits for particular apps. The Wind Down feature, meanwhile, is designed to help you get to bed without exposing you to the bright blue light that smartphones typically emit. After choosing when you want to hit the sack and wake up from your slumber, the Pixel 3 will turn its colorful display grayscale and enable a “do not disturb” mode to prevent disruptions while you sleep. Similar app-tracking options are available in Apple’s iOS 12, but Google’s implementation, combined with the black-and-white screen that discourages interaction, feels like a more considered commitment to keeping you off your smartphone. The improved Google Assistant on the Pixel 3 does more than answer queries about the weather, it adds some interesting features exclusive to Google’s own Android devices. Take unexpected phone calls, for example. The Pixel 3 (and soon all Pixel devices) can screen your calls using Google Assistant, showing you a live transcription of the conversation between your Pixel 3 and the unknown individual (or robocaller) on the other end. From there, you can decide to answer yourself, hang up, or report the offender as spam. And instead of hoping your phone hears you when you say “Hey, Google,” the Pixel 3’s Active Edge feature lets you bring up Google Assistant by squeezing the device’s sides. It’s a neat gimmick, coming in handy if you want to keep quiet while you send Google Assistant your written queries. When combined with Google’s new Pixel Stand wireless charger, the Pixel 3 turns into something similar to a temporary Google Home device. When on the stand, which can charge any smartphone supporting wireless charging, it’ll mimic a sunrise while playing your alarm, provide you with your daily schedule, and display a slideshow of your favorite images stored in Google Photos. If you’ve got smart home products like a Nest Hello doorbell camera, you can even view and control them from your Pixel 3. While the Pixel 3 might be the Pixel 2’s successor, there isn’t much separating them aside from software and a few internal hardware updates. But that software is absolutely key to its success. Today’s smartphones are already incredibly powerful, capable of taking incredibly sharp photos, helping us manage our hectic schedules and turning off our lights and locking our door, but they’re not good at telling us what’s important. That’s up to you. But Google’s trying to help you figure it all out by taking care of what it can. Screening calls, enhancing photographs, automatically sorting your best shots and restricting time-wasting apps are all additions that add up to a smartphone that’s doing more than what you’d expect at a price that still beats the competition by a few hundred bucks. The Pixel 3 might not be a real looker, but it’s what’s inside that counts.Write to Patrick Lucas Austin at patrick.austin@time.com."}