{"id": "Two Middle School Girls Arrested for Plotting to Kill Classmates and Drink Their Blood", "paragraph": "BARTOW, Fla. — Two middle school girls in central Florida brought knives to school in a foiled plot to kill classmates, cut them up and drink their blood before killing themselves, police officials said Wednesday.The two girls, ages 11 and 12, were armed with knives Tuesday at Bartow Middle School before they were caught, according to arrest affidavits released by the Bartow Police Department. No one was hurt.The girls face charges of conspiracy to commit first-degree murder and possession of a weapon at school, among other charges. It will be up to prosecutors to decide whether the girls will be charged formally as juveniles or adults, Deputy Police Chief Bryan Dorman said in an email.After their arrest, the girls were sent to a juvenile detention facility.Bartow is located in the heart of Florida’s citrus belt.The girls planned to stake out a school bathroom and wait for smaller students to enter, according to the police affidavit. They planned to cut their victims’ throats, cut up their bodies, eat the flesh and drink their victims’ blood, authorities said.The students then planned to fatally stab themselves.“The plan was to kill at least 1 student but were hoping to kill anywhere from 15-25 students,” the affidavit said. “Killing all of these students was in hopes it would make them worse sinners ensuring that after they committed suicide … (they) would go to hell so they could be with satan.”Detectives said the girls devised the plot while watching “scary” movies at one of their houses over the weekend.The alleged plot was foiled when administrators searched for them after they didn’t show up for class Tuesday. The administrators found them in a bathroom stall and brought them back to their offices where they found the girls in possession of four knives, a pizza cutter and a knife sharpener, police said.Officials with Polk County Schools said that extra police officers and guidance counselors would be at the school this week.“School staff quickly responded to a report of suspicious behavior; the students were taken into custody, and no one was harmed,” school officials said in a tweet.Contact us at editors@time.com."}