{"id": "Caravan Shrinks as Migrants Attempt to Make Their Way Across the Mexico-Guatemala Border", "paragraph": "(TECUN UMAN, Guatemala) — A U.S.-bound caravan that once totaled more than 3,000 Central American migrants looked to be about a third that size Saturday morning, when its remaining members woke up on a bridge that divides the borders of Guatemala and Mexico and waited to get past a crossing guarded by hundreds of Mexican federal police.Hundreds of migrants have already crossed, some legally, some not. Others left their spots on the bridge to go to a nearby Guatemalan town for food. It’s unclear whether any have simply turned back.The group had burst through a Guatemalan border fence Friday and rushed onto the bridge over the Suchiate River, defying officials’ entreaties for an orderly crossing and U.S. President Donald Trump’s threats of retaliation. They were met by a wall of police with riot shields, and only about 50 migrants managed to push their way through before officers unleashed pepper spray. The rest retreated, joining the sea of people in limbo between both countries.At an event in Scottsdale, Arizona on Friday, the U.S. president made it clear to Mexico that he is monitoring its response.“So as of this moment, I thank Mexico. I hope they continue. But as of this moment, I thank Mexico,” he said. “If that doesn’t work out, we’re calling up the military — not the Guard.”He also warned the migrants that they should turn back.“They’re not coming into this country,” he said.On Friday, Mexican police and immigration agents began letting small groups of 10, 20 or 30 people through the gates at a time if they wanted to apply for refugee status. Once they filed a claim, they were given the option to go to a shelter to spend the night.Other migrants, tired of waiting, jumped off the bridge into the river. Some organized a rope brigade to ford its muddy waters or floated across on rafts operated by local residents who usually charge a dollar or two to make the crossing.Carlos Rodriguez, 20, crossed the Suchiate River in a raft and reached the Mexican side. “I’m proud,” he said, after landing on Mexican soil.Hundreds of others awoke amid garbage that had already piled up on the bridge. Without bathrooms, a foul odor wafted through the air.Jose Yanez slept with no blanket, but vowed to continue.“From here, we’re going on. From here, there’s no turning back,” said the 25-year-old farmer, adding that he makes 150 lempiras a day in Honduras, or about $6, and has no work benefits.Organizers of the caravan appeared intent on avoiding a repeat of the rush on the border with Guatemala.Some women and children made their way toward the front of the caravan Saturday, while men were at the back.They have also moved about 30 feet (9 meters) back from the gate that separates them from Mexican police to establish a buffer zone.Late Friday night, Mexican President Enrique Pena Nieto said that “Mexico does not permit and will not permit entry into its territory in an irregular fashion, much less in a violent fashion.”Honduran President Juan Orlando Hernandez tweeted late Friday that he spoke with his Guatemalan counterpart, Jimmy Morales, and asked permission to send Honduran civil protection personnel to the bridge to help the migrants.“I also asked authorization to hire ground transportation for anyone who wants to return and an air bridge for special cases of women, children, the elderly and the sick,” Hernandez tweeted.Hernandez and Morales are expected to meet in Guatemala on Saturday to discuss the situation.Acner Adolfo Rodriguez, 30, one of the last migrants through the breached Guatemala border fence, said he hoped to find work and a better life far from the widespread poverty and gang violence in Honduras, one of the world’s deadliest countries.“May Trump’s heart be touched so he lets us through,” Rodriguez said.Mexican officials said those with passports and valid visas — only a tiny minority of those trying to cross — would be let in immediately.Migrants who want to apply for refuge in Mexico were welcome to do so, they said, but any who decide to cross illegally and are caught will be detained and deported.U.S. Secretary of State Mike Pompeo met Friday with Pena Nieto and Foreign Relations Secretary Luis Videgaray in Mexico City, with the caravan high on the agenda.At a news conference with Videgaray, Pompeo called illegal migration a “crisis” and emphasized “the importance of stopping this flow before it reaches the U.S. border,” while also acknowledging Mexico’s right to handle the crisis in a sovereign fashion.“Mexico will make its decision,” Pompeo said. “Its leaders and its people will decide the best way to achieve what I believe are our shared objectives.”At Mexico City’s airport before leaving, Pompeo said four Mexican federal police officers had been injured in the border standoff and expressed his sympathy.Migrants have banded together to travel en masse regularly in recent years, but this caravan was unusual for its huge size, said Victor Clark Alfaro, a Latin American studies professor at San Diego State University. By comparison, a caravan in April that also attracted Trump’s ire numbered about 1,000.“It grabs one’s attention that the number of people in these kinds of caravans is on the rise,” Clark Alfaro said. “It is migration of a different dimension.”Elizabeth Oglesby, a professor at the University of Arizona’s Center for Latin American Studies, said people join caravans like this because it’s a way to make the journey in a relatively safe manner and avoid having to pay thousands of dollars to smugglers. She disputed Pompeo’s assertion that that there is a “crisis” of migration.“The border is not in crisis. This is not a migration crisis. … Yes, we are seeing some spikes in Central Americans crossing the border, but overall migration is at a 40-year low,” Oglesby said.Speaking on the Televisa network, Videgaray did not seem concerned about Trump’s threat to close the U.S.-Mexico border, saying it had to be viewed in light of the hotly contested U.S. midterm elections, in which Trump has made border security a major campaign issue.Videgaray noted that 1 million people transit the border legally every day, and about $1 million in commerce crosses every minute.“Before taking decisions of that kind,” Videgaray said, “there would be many people in the United States … who would consider the consequences.”___Associated Press writers Peter Orsi, Christopher Sherman and Maria Verza in Mexico City contributed to this report.Contact us at editors@time.com."}