{"id": "Stressed-Out People May Have Smaller Brains, Study Says", "paragraph": "You already know that stress is bad for your health, but according to a new study published in Neurology, it may also be bad for your brain.The new study found that middle-aged adults with the highest levels of cortisol had lower brain volume and cognitive functioning than people with lower levels of the hormone, suggesting that stress may be to blame. The hormone cortisol is involved in a range of normal bodily processes, including metabolism, immunity and memory formation. But extra cortisol is also released in response to stress, leading to higher levels overall.Though the study did not follow people to see if anyone went on to develop dementia, these effects could be a precursor to cognitive decline later in life, says study co-author Dr. Sudha Seshadri, a professor of neurology at UT Health San Antonio. “We have previously shown that changes of this magnitude do predict level of mental dementia, even vascular brain injury, two or three decades later,” Seshadri says.The study involved more than 2,200 adults participating in the Framingham Heart Study, with an average age of 48. Each person went through a psychological exam, which tested memory and thinking skills, at the beginning of the study, and again about eight years later. They also gave blood samples, which the researchers used to measure cortisol levels, and the majority had MRI scans to measure brain volume.After analyzing the results of those assessments, and accounting for demographic and health information, the researchers found a connection between elevated cortisol levels and lower total brain volume and lower scores on memory and cognition tests — even though none of the participants in the study showed symptoms of dementia.The research has a few limitations. For one, the study was observational, meaning it looked only at relationships and cannot prove cause and effect. And researchers only measured blood cortisol levels once during the study period, so they could not assess changes over time, or even each participant’s average cortisol levels. Plus, the majority of study participants were white and lived in the same general area, so they are not representative of the total U.S. population.Still, Seshadri says, the association suggests that stress may be behind worrisome brain changes. And cortisol levels that were considered high in the study were consistent with those that adults could expect to see in day-to-day life, she says.“The fact that in this range, having a higher cortisol level was associated with the changes in brain function this early in life was both alarming and an opportunity,” Seshadri says. “There’s one more strand that one can work on to reduce the public health impact of dementia. I cannot tell you for sure that lowering cortisol is going to necessarily result in benefits, but it’s a first step.”Seshadri recommends relaxing however possible, since lowering perceived stress may also lower cortisol levels. Activities that have been shown to reduce stress include meditation, exercise, yoga, getting adequate sleep and maintaining a robust social life.“These are things that we know lower cortisol,” Seshadri says. “We are expanding our understanding of the link between these lifestyle interventions and their effect on cognitive decline and dementia.” Write to Jamie Ducharme at jamie.ducharme@time.com."}