{"id": "TIME Appoints Sue Suh as Chief People Officer", "paragraph": "TIME Editor in Chief and CEO Edward Felsenthal sent the following note to staff Monday:All,At our Town Hall last week, I said that one of our highest priorities in our first days as a new company is to add to TIME’s extraordinary talented team—expanding our newsroom, our sales and marketing operation, and our senior leadership to position us for growth in the months and years ahead.So I’m delighted to announce that our first hire will be Sue Suh, an outstanding leader who as TIME’s new Chief People Officer will oversee recruiting and human resources.Sue has spent most of the past decade at one of the world’s largest private philanthropies, the Rockefeller Foundation, whose mission is to bring people around the globe to try and solve the world’s most challenging problems. Her roles at Rockefeller include four years as Chief Talent Officer, leading recruitment and talent development at Rockefeller’s offices around the globe. She has also served as a Managing Director of its Bellagio Center programming in Italy, which brings together thought leaders, scholars, artists and policy makers; director of employee services and facilities; interim director of the Asia office; and director of the president’s office under former Rockefeller president Judith Rodin.Prior to Rockefeller, Sue spent five years in a variety of roles at the U.S. Departments of State and Defense in Washington, New York, and Tripoli, Libya, including a two-year stint at the U.S. Mission to the UN. She is a graduate of Princeton and has a Master’s in political science from Columbia.A champion for diversity and inclusion, Sue is on the board of the Coca-Cola Scholars Foundation, the Classical Theatre of Harlem and Special Olympics Asia-Pacific. She was a Fulbright Scholar in South Korea and a Presidential Management Fellow.Sue’s energy, optimism and breadth of experience will be great assets as we build our culture, our staff and our future. Sue officially starts Dec. 3, but will be in the office on occasion ahead of that and welcomes outreach.Please join me in welcoming Sue to TIME!EdwardContact us at editors@time.com."}