{"id": "Georgia's Brian Kemp Opens 'Cyber Crimes' Investigation Into State Democrats, 2 Days Before Election", "paragraph": "Georgia Secretary of State and Republican gubernatorial candidate Brian Kemp opened an investigation into the state’s Democratic Party Sunday, alleging a failed attempt to hack the Georgia voter registration system.“While we cannot comment on the specifics of an ongoing investigation, I can confirm that the Democratic Party of Georgia is under investigation for possible cyber crimes,” Press Secretary of the Georgia Secretary of State Candice Broce said in a statement. “We can also confirm that no personal data was breached and our system remains secure.”The Secretary of State’s office opened the investigation on Saturday night and alerted the Department of Homeland Security and the FBI.Two days before election day, Kemp is locked in a fiercely-contested race with Democratic candidate, Stacey Abrams. If elected, Abrams will be the first-ever American black female governor.In a statement to TIME, the Abrams campaign called the investigation, “a political stunt.”“This is yet another example of abuse of power by an unethical Secretary of State,” Democratic Party of Georgia Executive Director Rebecca DeHart said. “To be very clear, Brian Kemp’s scurrilous claims are 100% false, and this so-called investigation was unknown to the Democratic Party of Georgia until a campaign operative in Kemp’s official office released a statement this morning.”Abrams called the investigation “desperate” and characterized it as politically motivated in an appearance on CNN’s “State of the Union” on Sunday morning.The Georgia Secretary of State’s office has not released any evidence of a cyberattack or the assertion that the state Democratic Party is behind it. The Secretary of State office has not responded to TIME’s request for comment.David Cross, a D.C. lawyer and partner at Morrison Foerster who is representing a group of Georgia voters in a separate lawsuit, says the Secretary of State’s announcement came shortly after he alerted Georgia authorities to a vulnerability in the state’s voter registration page.Cross says he was made aware of the vulnerability after a Georgia citizen made contact with his team and claimed it spurred Kemp to this investigation.“We learned of what sounds to be a very serious vulnerability with the myvoter page. We alerted the authorities, we expected the Secretary of State would take that seriously,” Cross told TIME. “We were surprised to see that the apparent response to that was accusing the [Democrats] of hacking.” DeHart cast the investigation as an attempt by Kemp to “deflect blame for his failures” in a statement to TIME. She accused Kemp of abandoning his responsibility to protect the security of Georgia’s election systems, citing his 2016 refusal to accept election security assistance from the Department of Homeland Security and his office’s alleged leak of 6 million Georgians’ personal information in 2017. “Georgians of all political stripes are very concerned about election security and the security of Georgians’ personal information,” DeHart wrote. “The Democratic Party of Georgia shares that concern, but we did not create, discover or attempt to take advantage of the deeply vulnerable system used by the Secretary of State’s office.”Kemp and the Georgia Secretary of State’s office have recently come under fire for what DeHart has called “voter suppression efforts,” referring to Kemp’s enforcement of the state’s “exact match” voter law.A federal judge issued an injunction against Kemp’s office on Friday, ordering the Secretary of State to allow 3,141 people previously marked as ineligible to vote to cast their ballots on Tuesday’s midterm elections if they present proof of citizenship to country election officials.“These individuals will suffer irreparable harm if they lose the right to vote, this harm outweighs any harm to the Defendant, and granting an injunction is in the public’s interest,” read the ruling issued by U.S. District Judge Eleanor Ross.In 2016, Kemp accused the Department of Homeland Security under the Obama administration of cyber attacks against Georgia’s Secretary of State office. Inspector General John Roth determined last year that there was no abnormal activity from Homeland Security against Georgia.Correction, Nov. 5:The original version of this article misstated the source of a quote that said Kemp’s investigation is “another example of abuse of power by an unethical Secretary of State.” The person quoted is Democratic Party of Georgia Executive Director Rebecca DeHart, not Stacey Abrams campaign Press Secretary Caitlin Highland.Contact us at editors@time.com."}