{"id": "Stan Lee, Creator of Spider-Man, X-Men and Hulk, Dead at 95", "paragraph": "(LOS ANGELES) — Stan Lee, the creative dynamo who revolutionized the comic book and helped make billions for Hollywood by introducing human frailties in superheroes such as Spider-Man, the Fantastic Four and the Incredible Hulk, died Monday. He was 95.Lee was declared dead at Cedars-Sinai Medical Center in Los Angeles, according to Kirk Schenck, an attorney for Lee’s daughter, J.C. Lee.As the top writer at Marvel Comics and later as its publisher, Lee was widely considered the architect of the contemporary comic book. He revived the industry in the 1960s by offering the costumes and action craved by younger readers while insisting on sophisticated plots, college-level dialogue, satire, science fiction, even philosophy.Millions responded to the unlikely mix of realistic fantasy, and many of his characters, including Spider-Man, the Hulk and X-Men went on to become stars of blockbuster films. Recent projects he helped make possible range from the films “Avengers: Infinity War,” ”Black Panther” and “Guardians of the Galaxy” to such TV series as “Agents of S.H.I.E.L.D” and “Daredevil.” Lee was recognizable to his fans — he had cameos in Marvel films and TV projects — his hair gray and his glasses slightly tinted.“I think everybody loves things that are bigger than life. … I think of them as fairy tales for grown-ups,” he told The Associated Press in a 2006 interview. “We all grew up with giants and ogres and witches. Well, you get a little bit older and you’re too old to read fairy tales. But I don’t think you ever outgrow your love for those kind of things, things that are bigger than life and magical and very imaginative.”Lee considered the comic-book medium an art form and he was prolific: By some accounts, he came up with a new comic book every day for 10 years.“I wrote so many I don’t even know. I wrote either hundreds or thousands of them,” he told the AP in 2006.He hit his stride in the 1960s when he brought the Fantastic Four, the Hulk, Spider-Man, Iron Man and numerous others to life.“It was like there was something in the air. I couldn’t do anything wrong,” he recalled.His heroes, meanwhile, were a far cry from virtuous do-gooders such as rival DC Comics’ Superman.The Fantastic Four fought with each other. Spider-Man was goaded into superhero work by his alter ego, Peter Parker, who suffered from unrequited crushes, money problems and dandruff. The Silver Surfer, an alien doomed to wander Earth’s atmosphere, waxed about the woeful nature of man. The Hulk was marked by self-loathing. Daredevil was blind and Iron Man had a weak heart.“The beauty of Stan Lee’s characters is that they were characters first and superheroes next,” Jeff Kline, executive producer of the “Men in Black” animated television series, told The Blade of Toledo, Ohio, in 1998.Some of Lee’s creations became symbols of social change — the inner turmoil of Spider-Man represented ’60s America, for example, while The Black Panther and The Savage She-Hulk mirrored the travails of minorities and women.Lee scripted most of Marvel’s superhero comics himself during the ’60s, including the Avengers and the X-Men, two of the most enduring. In 1972, he became Marvel’s publisher and editorial director; four years later, 72 million copies of Spider-Man were sold.“He’s become our Mickey Mouse,” he once said of the masked, web-crawling crusader.Lee also published several books, including “The Superhero Women” in 1977 and “How to Draw Comics the Marvel Way” the following year, when he was named publisher of the year by the Periodical and Book Association of America.CBS turned the Hulk into a successful TV series, with Bill Bixby and Lou Ferrigno portraying the doomed scientist from 1978-82. A Spider-Man series ran briefly in 1978. Both characters were featured in animated TV series as well.The first big-budget movie based on Lee’s characters, “X-Men,” was a smash in 2000, earning more than $130 million at North American theaters. “Spider-Man” did even better, taking in more than $400 million in 2002. A Marvel movie empire would emerge after that, one of the most lucrative mega-franchises in cinema history, with the recent “Avengers: Infinity War” grossing more than $2 billion worldwide. In 10 years, the Marvel Cinematic Universe film shave netted over $17.6 billion in worldwide grosses.Stanley Martin Lieber was born Dec. 28, 1922, in New York. He grew up a fan of “Hardy Boys” adventure books and Errol Flynn movies, and got a job at Timely Comics after graduating from high school.Within a few months, the editor and art director quit, leaving the 17-year-old Lee with creative control over the company, which grew and was renamed Atlas Comics and, finally, Marvel. Lieber changed his name, thinking Lee would be used for “silly little comics” and his real name would be reserved for novels.His early work largely reflected popular movies — westerns, crime dramas, romance, whatever was the rage at the time. He worked for about 50 cents per page.After a stint in the Army during World War II, writing for training films, he was back at Marvel to begin a long and admittedly boring run of assembly line comic book production.Comics in the 1950s were the subject of Senate hearings pushed by the Comics Code Authority, which frowned on gore and characters that questioned authority. Major comic book companies adopted the code as a form of self-regulation to avoid sanctions.Lee said he was also working for a publisher who considered comics as fare only for children.“One day I said, ‘This is insane,'” Lee told the Guardian in 1979. “I’m just doing the same type of stories as everybody else. I wasn’t taking pride in my work and I wanted to quit. But my wife said, ‘Look, why don’t you do the kind of comics you want for a change?'”The result was the first issue of “The Fantastic Four,” in 1960, with the characters, plot and text from Lee and the illustrations by famed Marvel artist Jack Kirby.The characters were normal people changed into reluctant superheroes through no fault of their own.Writing in “Origins of Marvel Comics,” Lee described the quartet this way: “The characters would be the kind of characters I could personally relate to; they’d be flesh and blood, they’d have their faults and foibles, they’d be fallible and feisty and — most important of all — inside their colorful, costumed booties they’d still have feet of clay.”“The Amazing Spider-Man” followed in 1962 and before long, Marvel Comics was an industry behemoth.Lee knew his work was different, proudly noting that stories were drawn out over several issues not to make money but to better develop characters, situations and themes. He didn’t neglect his villains, either. One, the Moleman, went bad when he was ostracized because of his appearance, Lee wrote, adding it was “almost unheard of in a comic book” to explain why a character was what he was.Lee’s direct influence faded in the 1970s as he gave up some of his editorial duties at Marvel. But with his trademark white mustache and tinted sunglasses, he was the industry’s most recognizable figure. He lectured widely on popular culture.Lee moved to Los Angeles in 1981 to head Marvel Productions, an animation studio that was later purchased, along with Marvel Comics, for $50 million by New World Entertainment.As sales of comics declined, Marvel was forced into bankruptcy proceedings that meant it had to void a lifetime contract prohibiting Lee from working for anyone else. Lee later sued Marvel for $10 million, saying the company cheated him out of millions in profits from movies based on his characters.In 2000, Lee agreed to write stories for DC Comics, reinventing Superman, Batman, Wonder Woman and other signature characters for Marvel’s one-time rival. DC Vice President and Publisher Paul Levitz had nothing but praise when the agreement was made.“With his artistic collaborators at Marvel, Stan co-created the richest imaginary universe a single comics writer has ever built,” he said.The dapper, friendly comic book genius continued to work into his 90s on numerous projects, including comics, films and DVDs.In the late 1990s, he looked to capitalize on the Internet craze, offering animated “Webisodes” of comic-like action. Stan Lee Media also sought to reach out to Web-savvy youth through deals with pop artists the Backstreet Boys and Mary J. Blige.The company went bankrupt, and three men were indicted for allegedly defrauding the business in a check kiting scam. Lee wasn’t implicated.After that initial failure, Lee formed the successful Pow! Entertainment company to launch animated Internet-based projects.Lee’s wife and partner in nearly everything, Joan Lee, died on July 6, 2017, leaving a void that made her husband, by then in mental and physical decline, vulnerable to hangers-on who began to surround him. Lawsuits, court fights and an elder abuse investigation all emerged in the fight over who spoke for the elderly Lee.Lee is survived by his daughter, Joanie, and a younger brother who also worked in comics, Larry Lieber.Contact us at editors@time.com."}