{"id": "Bloody Deer Carcasses Dumped on Cars of Somali-Americans in Minnesota", "paragraph": "(MINNEAPOLIS) — Somali and Muslim leaders expressed deep concern Saturday after a white man and his teenage son dumped bloody deer carcasses on the hoods of two cars owned by Somali-American men in the central Minnesota city of St. Cloud, and they don’t believe the explanation the suspects gave to police.The victims discovered the carcasses after leaving the YMCA on Wednesday night. In a news release Friday, assistant police chief Jeff Oxton said investigators used surveillance video to track down the pair who dumped the carcasses — a 62-year-old local and his 14-year-old son. The video showed the teenager put the skinned carcasses on the cars while the father, “knowing what was happening,” sat in their pickup truck, said Oxton.“In a taped statement the suspects indicated that they needed to get rid of the carcasses and dumped them at that location in that manner,” Oxton said. “It is not believed that the suspects knew either of the victims.”Oxton said there was nothing visible on or in the victims’ vehicles that would have identified the race of the owners. He didn’t identify the father and son or say whether they had hunted the deer themselves or where they had obtained the carcasses.Oxton said police would forward the case to the city attorney for possible charges. In Minnesota, city attorneys generally prosecute misdemeanors or gross misdemeanors, but not felonies.One of the victims and two community leaders scoffed at the suspects’ claims that they merely needed to get rid of the carcasses, pointing out that they had plenty of options for disposing of them properly or could have just dumped them in the woods.“Putting it on the hood is a statement,” said Jaylani Hussein, executive director of the Minnesota chapter of the Council on American-Islamic Relations. “I don’t care what kind of statement they were trying to make and whether it was about Muslims or not. But it’s making a statement.”Haji Yussuf, a local Somali community organizer, said he spoke with one of the victims, Ali Abdullahi, shortly after the incident.“He was very hurt by it, but also scared,” Yussuf said, adding that Abdullahi compared it to displays of swastikas and cross-burnings. He said local Somalis are concerned because it follows last month’s synagogue massacre in Pittsburgh and other recent mass shootings, and that if the perpetrators are hunters, they probably have guns.“Do we just let it go, or do we take it seriously before it goes to the next step?” Yussuf asked.Abdullahi didn’t immediately return a phone call Saturday from The Associated Press. But he told Minnesota Public Radio that he was shocked to find the carcass on the hood of his car. “My jaw dropped. I stood there transfixed, not moving,” he said. He said he believes he and the other victim were intentionally targeted because they are Somali-American and that it was intended to send the message that, “You’re not welcome. We don’t like you.”Abdullahi also said he was afraid to return to the YMCA to work out the next night.“I was thinking that someone was just there to get me, especially that this was a deer hunter, and they have a rifle,” he said. “And all the shootings that I have been seeing and watching — I’m terrified. I’m just thinking that somebody is just watching me and trying to kill me.”Oxton did not immediately return a call Saturday, and a dispatcher said nobody would be available to provide further information before Monday.Minnesota has the nation’s largest Somali population at an estimated 57,000. As many as 10,000 of them settled in and around St. Cloud, a city of about 65,000 people about 65 miles (104 kilometers) northwest of Minneapolis, and they have complained of mistreatment over the years. Relations were especially tense two years ago after a young Somali man who may have been radicalized stabbed and wounded 10 people at a local shopping mall before an off-duty police officer shot and killed him.Contact us at editors@time.com."}