{"id": "Idaho Superintendent Apologizes for Teachers Dressing Up as 'Mexicans' and the Border Wall for Halloween", "paragraph": "Officials at Middleton Heights Elementary School in Middleton, Idaho, have apologized for staff wearing offensive Halloween costumes, saying there was no malicious intent behind the costumes.Teachers and staff members there dressed up as “Mexicans” and President Trump’s proposed border wall, complete with a “Make America Great Again” message. The teachers were photographed wearing stereotypical Mexican costumes, which featured sombreros, fake mustaches and ponchos. Others were dressed as brick walls.According to the Idaho Statesman, photos of the teachers were posted to the Middleton School District’s Facebook page with the caption “It was a great day to be a Heights Hawk! We celebrated our RESPECT character winners, single and double marathon runners.”The school came under fire when photos of the costumes, which were quickly shared online and sparked outrage, went viral last week. Many claimed the costumes were offensive.The Idaho Statesman reports that 12 Idaho-based advocacy groups and nonprofits, including the ACLU of Idaho and Immigrant Justice Idaho, sent a letter to the district’s superintendent on Friday expressing concerns over the costumes.“The intent or misjudgments of the individuals involved does not undo the trauma experienced by students, families and communities,” the letter said. “The impact on these students does not stay only with them but has lasting effects beyond the school or classroom. We believe the school and classrooms have now become hostile environments that are not conducive to the education of the students.”In a Facebook video, Superintendent Josh Middleton of the Middleton School District, issued an apology on Friday, saying he was “deeply troubled” by his staff’s “insensitive and inappropriate” costume choices.“Do I think there was a malicious intent in this poor decision? No, I don’t,” Middleton said. “Was there a poor judgment involved? Absolutely.”“We are better than this, we embrace all students,” he said. “We have a responsibility to teach and reach all students — period.”Staff dressed up as “Mexicans” and others as a “wall” on which it said “Make America Great Again” at an ELEMENTARY SCHOOL in Idaho.Superintendent said there was not “malicious intent.”h/t @aurabogado https://t.co/gDhfOecu7K pic.twitter.com/SyGQ2a9Lfg— Leah McElrath (@leahmcelrath) November 2, 2018 Write to Gina Martinez at gina.martinez@timeinc.com."}