{"id": "President Trump Calls Out Sen. John Tester Over Failed Cabinet Nominee at Montana Rally", "paragraph": "(BELGRADE, Mont.) — President Donald Trump made clear Saturday during a campaign stop in Montana that he wants to defeat Democratic Sen. Jon Tester over a personal grudge as much as political ambition.Trump blames Tester for the defeat of his nominee to run the Department of Veterans Affairs. The president told hundreds of cheering supporters at an airport rally in the Montana chill that Tester “tried to destroy” Ronny Jackson, an admiral and White House doctor.“That’s why I’m here,” he said. “I’ve never forgotten it and it’s honestly one of the reasons I’m here so much,” said Trump, who last campaigned in Montana in mid-October. “It’s a disgrace, what he did to that man.”Trump was in Montana to boost GOP Senate candidate Matt Rosendale, who is challenging Tester in Tuesday’s election. The rallies are part of Trump’s multistate blitz in the final days before Tuesday’s elections, when control of the House and Senate — and perhaps the future of Trump’s agenda — are at stakeTrump said having Rosendale in the Senate will be “phenomenal.”The president blames Tester for the backlash against Jackson, who eventually withdrew his nomination after facing anonymous ethics allegations, including claims of on-the-job drunkenness and wrecking a government vehicle.Jackson denied the allegations.Tester, the top Democrat on the Senate committee that oversees veterans’ issues, had released a list of the allegations against Jackson that was compiled by the committee’s Democratic staff.Trump, however, doesn’t mention that the allegations weren’t the only factor that contributed Jackson withdrawing from consideration. Lawmakers questioned Jackson’s limited managerial experience and his fitness to run a department as sprawling as the VA.Montana was the first of two campaign stops for Trump on Saturday. He was due in Pensacola, Florida, on Saturday night, joining Vice President Mike Pence to campaign for Republicans Rick Scott, the governor who is running for the Senate, and Ron DeSantis, a former congressman who is vying to succeed Scott.Trump sought in Montana to rally the crowd, which was bundled up against the November chill, by talking up the economy and tax cuts, new Supreme Court Justice Brett Kavanaugh, border security and several caravans of Central American migrants who are slowly advancing toward the U.S.-Mexico border.He mentioned plans for a new military branch called the Space Force, and complained anew about the news media.Trump defended his decision to focus almost exclusively on the migrants and immigration in the final days before the election. He recently announced that he intends to change asylum procedures, end the constitutional guarantee of birthright citizenship and build numerous “tent cities” to hold migrants caught crossing the border illegally.“You can only say so many times that we created 250,000 jobs last month,” Trump said, in defense of his focus on immigration that some of the president’s critics say amounts to fear-mongering. Trump has denied trying to instill fear as a reason to vote Republican on Election Day.“When we’re fixing a problem or fixed a problem there’s no reason to go on about it for 45 minutes,” Trump said.Trump also called up Rep. Greg Gianforte to speak from the podium but did not repeat his praise of the congressman, who was convicted of body slamming a journalist just before winning a 2017 special election. Trump had said during last month’s Montana stop that anyone who can do a body slam “is my kind of guy.”The president subsequently was criticized for seeming to glorify violence against journalists.Contact us at editors@time.com."}