{"id": "President Trump's Birthright Citizenship Idea Is Part of His All-Out Midterm Strategy", "paragraph": "In the days leading up to the 2016 election, Donald Trump toned it down. He gave his staff control of his Twitter account, avoided starting or inflaming any personal feuds and let his running mate tour the country, inviting Republicans to come home.That is decidedly not his strategy in 2018.With the midterm elections just one week away, Trump has been barnstorming the country — holding rallies in North Dakota, Montana and Indiana, with others planned in Florida, Missouri, West Virginia and Montana.He’s also been on a virtual barnstorm, using Twitter, cable TV and even a rare White House press briefing to turn the conversation away from the meat-and-potatoes issues campaigns have been discussing into a 24/7 episode of the Trump Show.The former New York tabloid and reality TV impresario has used every trick he knows to change the subject.Create an imminent threat: Trump has used tweets and interviews to raise concerns about a caravan of migrants from Central America planning to legally seek asylum in the United States, making baseless claims that they include “criminals and unknown Middle Easterners,” and falsely suggesting that Democrats had funded it.Propose unilateral solutions: In response to the caravan, Trump has threatened to cut off foreign aid to Guatemala, Honduras and El Salvador, and sent 5,000 troops and a slew of military equipment to the U.S. border — even though the migrants are still some 900 miles away and several weeks from arriving.Float controversial ideas: Trump has also taken to floating controversial ideas that would be hard to execute if he followed through, such as an executive order that would remove the automatic right to citizenship for babies born in the United States to non-citizens — an extreme position that would face serious constitutional challenges.Make vague promises: Trump has also thrown out some bold but vague promises on issues where he’s weak, promising to protect people with pre-existing conditions and pass a middle-class tax cut, even though the policies he’s enacted and pursued during the past two years were on the other side.Go on the attack: Trump has also kept up attacks on his favorite targets — despite a recent spate of mail bombs aimed at some of them — hitting Hillary Clinton, liberal megadonor Tom Steyer, Florida gubernatorial candidate Andrew Gillum and the news media, which he recently called “the true Enemy of the People.”There is great anger in our Country caused in part by inaccurate, and even fraudulent, reporting of the news. The Fake News Media, the true Enemy of the People, must stop the open & obvious hostility & report the news accurately & fairly. That will do much to put out the flame…— Donald J. Trump (@realDonaldTrump) October 29, 2018The first midterm elections are often seen as a referendum on the performance of the president, but Trump has amped that dynamic up considerably through this approach.“I’m not on the ticket, but I am on the ticket, because this is also a referendum about me,” he told a rally in Mississippi earlier in the month. “I want you to vote. Pretend I’m on the ballot.”But while Trump is focused on exciting his base voters, there’s a risk that he’ll also inflame the Democratic base as well. And while his 2016 strategy kept Republicans who had doubts about him in the GOP column, it remains to be seen if his current approach will backfire with them.Recent polls have shown health care, immigration and education among the issues motivating voters to turn out, while in interviews at rallies and early voting stations show voters are bringing up those issues — and not the hot topics on cable news of the moment.Trump may be winning the cable news battle for now, but it remains to be seen if that will help his party win the midterm elections war. Contact us at editors@time.com."}