{"id": "World War I's 100th Anniversary to Be Commemorated in London and Paris — But Not Berlin", "paragraph": "(BERLIN) — German Chancellor Angela Merkel will mark the 100th anniversary of the end of World War I on French soil, and German President Frank-Walter Steinmeier will be in London for a ceremony in Westminster Abbey with Queen Elizabeth II.But while Germany’s leaders visit the capitals of its wartime enemies, at home there are no national commemorations planned for the centenary of the Nov. 11 armistice that ended the four-year war that left 17 million dead, including more than 2 million German troops.Next week, the German parliament is holding a combined commemoration of the 100th anniversary of the declaration of the first German republic, the 80th anniversary of the brutal Nazi-era pogrom against Jews known as Kristallnacht (Night of Broken Glass), and the 29th anniversary of the fall of the Berlin Wall. Almost as an afterthought, parliament notes there’s also art exhibition in the lobby called “1914/1918 – Not Then, Not Now, Not Ever.”More than just being on the losing side of World War I, it’s what came next that is really behind Germany’s lack of commemorative events.For Germany, the Nov. 11 armistice did not mean peace like it did in France and Britain. The war’s end gave rise to revolution and street fighting between far-left and far-right factions. It also brought an end to the monarchy, years of hyperinflation, widespread poverty and hunger, and helped create the conditions that brought the Nazis to power in 1933.The horrific legacy of the Holocaust and the mass destruction of World War II simply overshadows everything else in Germany, said Daniel Schoenpflug, a historian at Berlin’s Free University’s Friedrich-Meinecke-Institute. His new book, “A World on Edge,” explores the immediate aftermath of the war through individual perspectives.“One can’t reduce it to the simple fact that one country won the war and the other lost,” Schoenpflug said. “Germany is a country that draws practically its entire national narrative out of the defeat of 1945” — and not the defeat of 1918.By contrast in Turkey, which was also on the losing side in World War I, the war’s end produced a similar collapse of the Ottoman empire and a war of independence, but also gave rise to Mustafa Kemal Ataturk, who founded the modern Turkish republic.In Germany, even though the end of World War I is now viewed through the prism of Hitler and the Holocaust, in the immediate postwar period there actually was a time of utopianism, with movements promoting idealistic visions of peace and democracy, Schoenpflug said.Yet on the other side of the political spectrum, utopianism on the right also gave birth to fascism, he said.And as initial euphoria over the end of World War I faded, hopes for the future quickly gave way to feelings of resentment at the reparations and conditions imposed on Germany by the victorious powers. The Nazis and right-wing nationalists were able to garner support by pushing the “stab-in-the-back” myth, which held that Germany’s civilian leaders sold out the army by agreeing to the Nov. 11 surrender.“There was a war of dreams, a clash of utopias” between the right and the left, Schoenpflug said.Although there aren’t any national commemorations in Germany marking the war’s end, individual events are planned, including an exhibition at the German Historical Museum in Berlin. A special World War I religious service is also being organized by the German Bishops Conference at the Berliner Dom cathedral.And in addition to German officials taking part in events in London and Paris, the Foreign Ministry said they and their British counterparts have worked together to coordinate the ringing of church and secular bells around the world on Nov. 11 to mark the war’s centenary.“The bells will ring at midday to commemorate the more than 17 million victims of World War I and as a call for understanding and reconciliation across borders,” the ministry said.Contact us at editors@time.com."}