{"id": "Storm-Related Flooding Kills at Least 12 People in Sicily, Authorities Say", "paragraph": "(ROME) — Storm-related floods killed at least 12 people in Sicily, Italian authorities said Sunday, including nine members of two families who were spending a long weekend together when water and mud from a swollen river overran their rented villa.After surveying the stricken Mediterranean island by helicopter, Italian Premier Giuseppe Conte identified two more of the victims as a German couple whose car was swept away by flood waters near Agrigento, a tourist town known for its ancient Greek temples.Italian news reports said a 1-year-old, a 3-year-old and a teenager were among the flood victims from the family get-together in Casteldaccia. A survivor, Giuseppe Giordano, lost his wife, two of his children, his parents and a brother, Italian news agency ANSA said.State broadcaster RaiNews24 said Giordano was stepping outside on Saturday night when the torrent rushed in and described him as the sole person to made it out alive.When he opened the door, “there was a river of water, I was knocked down and grabbed hold of a tree,” Giordano told reporters between sobs. “I was yelling, ‘Help, help.'”“My son Federico tried to save his little sister, but both died,” Giordano said, telling reporters he heard his son call out “I handle” about the girl’s rescue.Then “I saw the windows go dark, the light go out, a layer of mud was moving across the floor,” Giordano said, Then, he said he was swept away from the house by the force of the water.The two families had gathered in the villa during Italy’s long weekend centering on the Nov. 1 All Saint’s Day national holiday.Although Italian news reports originally described him of the house’s owner, Giordano said he was renting the villa.Casteldaccia Mayor Giovanni Di Giacinto told Sky TG24 that the flood water reached 2 meters (move than 6 feet) high inside the home.Rescuers retrieved the bodies from the home. A Sicilian prosecutor opened an investigation to determine if neglect, such as possible inadequate drainage of the river, played a role in the deaths or if the home was built illegally close to the river.The latter might be the case. Pino Virga, the mayor of the neighboring town of Altavilla Milicia, told SkyTG24 TV that other local authorities told him the house was slated for demolition because it stood too near the river.Separately, Di Giacinto told reporters the homeowner had blocked the demolition by challenging it in a local tribunal.A nursing home up the road was spared any damage, ANSA reported.Only days earlier, other storms battered much of northern Italy, killing at least 15 people, uprooting millions of trees near Alpine valleys and leaving several Italian villages without electricity or road access for days.Conte said a special Cabinet meeting could be in the coming days to deliberate aid for storm-ravaged communities, as well as to approve 1 billion euros ($1.15 billion) to ensure safe hydrogeological conditions in Italy, including proper cleaning of riverbeds.The other known casualty in Sicily was a man whose body was also found on a guardrail along a Palermo-area road after floodwaters swept away his car, Italian news reports said.Across the island, in the town of Cammarata, near Agrigento, the fire department said its divers worked to recover the bodies of the couple whose car was caught up in the flooding waters of the Saraceno River.Also in Agrigento province, firefighters rescued 14 people from a hotel in the town of Montevago, which was threatened by floodwaters from the Belice River.Elsewhere in Sicily, at least two other people were missing Sunday after floodwaters swept away their cars, including a doctor heading to the hospital in the hill town of Corleone.In Casteldaccia, Maria Concetta Alfano said she, her husband and their adult disabled daughter fled after barking dogs drew their attention to the rising waters in the Milicia River. ANSA quoted the husband, Andrea Cardenale, as saying he drove away as “water was up to the hood of the car.”Contact us at editors@time.com."}