{"id": "Justice Sotomayor on Kavanaugh Coming to the Supreme Court: 'The Nine of Us Are Now a Family'", "paragraph": "Supreme Court Justice Sonia Sotomayor says that newly appointed Justice Brett Kavanaugh is already like “family.”Sotomayor recently sat down with David Axelrod, for an episode of CNN’s “Axe Files” that will air Saturday, and spoke about welcoming in the new justice. Kavanaugh was confirmed after a highly publicized Senate Judiciary Committee hearing in September. He was accused by Professor Christine Blasey Ford of sexual assault in the 1980s when they were both teenagers. Kavanaugh vehemently denied the accusation and was eventually confirmed with a 50-48 vote in the Senate.Sotomayor said among Supreme Court justices, typically a lifetime appointment, there is no choice but to create a relationship.“When you’re charged with working together for most of the remainder of your life, you have to create a relationship,” Sotomayor said. “The nine of us are now a family and we’re a family with each of us our own burdens and our own obligations to others, but this is our work family, and it’s just as important as our personal family.”She said Justice Clarence Thomas, who also went through a similar hearing in the 1990s after being accused of sexual harassment, told her when he first came to the court a justice approached him and told him “I judge you by what you do here. Welcome.”She told Axelrod she repeated that story to Kavanaugh when she first greeted him.Sotomayor said she does expect to dissent more but only sees conservatism and liberalism as political terms.Kavanaugh is known to have a conservative record. During his impassioned opening statement during the Senate Judiciary Committee hearings, he said that the accusations were a “calculated and orchestrated political hit” by the left on behalf of the Clintons. Kavanaugh is the second justice appointed by President Trump after Neil Gorsuch.Sotomayor said she is not letting personal politics get in the way of working together.“We’ve agreed in quite a few cases, we’ve disagreed in a bunch, But you know, let’s see.” she said.Sotomayor also commented on the current divided political climate. She said people forget the most important thing is shared “human values.”“We all have families we love, we all care about others, we care about our country, and we care when people are injured,” she said. “And unfortunately, the current conversation often forgets that. It forgets our commonalities and focuses on superficial differences whether those are language or how people look or the same God they pray to but in different ways.”Write to Gina Martinez at gina.martinez@timeinc.com."}