{"id": "Florida Is Suing CVS and Walgreens Over Their Role in the Opioid Crisis", "paragraph": "(FORT LAUDERDALE, Fla.) — Florida is suing the nation’s two largest drugstore chains, Walgreens and CVS, alleging they added to the state and national opioid crisis by overselling painkillers and not taking precautions to stop illegal sales.Attorney General Pam Bondi announced late Friday that she has added the companies to a state-court lawsuit filed last spring against Purdue Pharma, the maker of OxyContin, and several opioid distributors.Bondi said in a press release that CVS and Walgreens “played a role in creating the opioid crisis.” She said the companies failed to stop “suspicious orders of opioids” and “dispensed unreasonable quantities of opioids from their pharmacies.” On average, about 45 people die nationally each day because of opioid overdoses, according to the Centers for Disease Control and Prevention.“We will continue to pursue those companies that played a role in creating the opioid crisis,” said Bondi, who has been mentioned as a possible replacement by President Donald Trump for recently ousted U.S. Attorney General Jeff Sessions. “Thousands of Floridians have suffered as a result of the actions of the defendants.”CVS did not immediately respond Saturday to emails seeking comment. Walgreens did not immediately respond to a phone message and emails. Both companies on their websites say they are committed to fighting opioid abuse.Until a law enforcement crackdown at the beginning of the decade, Florida was known for its so-called pain mills. Drug dealers from throughout the country would send associates to store-front clinics where unscrupulous doctors would write opioid prescriptions for bogus injuries and illnesses. At one point, 90 of the nation’s top 100 opioid prescribers were Florida doctors, according to federal officials.After receiving the prescriptions, the phony patients would buy the pills from Florida pharmacies — state law says pharmacists must refuse to fill prescriptions they suspect are not for a valid purpose. Most of the opioids would then be taken out of state to be resold illegally at huge markups, creating a drug crisis in many communities throughout the Eastern United States.According to the lawsuit, Walgreens has dispensed billions of opioid dosages from its Florida pharmacies since 2006. The Illinois-based chain is the nation’s largest drugstore chain and has more than 13,200 stores globally.The company distributed 2.2 million opioid tablets from its store in Hudson, a Tampa-area town of 12,000, and in one unidentified town of 3,000, sold 285,000 pills in a month, the lawsuit says. In some stores, its opioid sales jumped six-fold in two years. The company paid $80 million five years ago to resolve a federal investigation that centered on inadequate record keeping of its Florida opioid sales that allowed the pills to reach the black market.Florida’s accusations against CVS were more general, saying it sold 700 million opioid dosages between 2006 and 2014, including outsized sales in Hudson and two other nearby towns. The Rhode Island-based chain has more than 9,800 stores.Contact us at editors@time.com."}