{"id": "The Scientific Reason Why You Can't Stop Eating Halloween Candy", "paragraph": "A bowl of Halloween candy is enough to frighten any healthy eater. After just one piece, it can feel impossible to stop—until you get a stomachache.You might assume that sugar is the sole reason that Halloween candy is so hard to resist. After all, it can activate reward circuits in the brain that also light up in response to drugs like cocaine, and it is possible to build up a tolerance to and dependence on sugar.But Halloween candy’s hold on you goes beyond sugar alone. “You can just keep unwrapping and popping those little suckers,” says Rachele Pojednic, an assistant professor of nutrition at Simmons University. “But that wouldn’t happen if you walked into an office and there was a bowl of white sugar on the table.”It’s the convergence of sugar, fat and salt—the trifecta of many candies, Halloween and otherwise—that “really revs up the hedonic eating system,” Pojednic says, referring to the well-documented phenomenon of eating for pleasure rather than physical need. Studies have shown that sweet or fatty foods can activate pathways in the brain associated with pleasure and reward, kicking off processes that can compete with or override signals that regulate normal hunger and satiety, sometimes causing people to overeat out of pleasure, not hunger. And while salt, sugar and fat are all tasty on their own, food scientists—and food companies, as noted in a 2013 book aptly titled Salt Sugar Fat: How the Food Giants Hooked Us—have long known they become irresistible when they come together.The hedonic effect may even transcend a candy bar’s ingredients, Pojednic says. “We have these really complex neurologic systems where learning and memory and pleasure all come together,” she explains. “That’s why when you walk into the office and you see that Reese’s Peanut Butter Cup, your mouth literally starts watering. You will automatically start salivating, because you have this memory of pleasure, so that cycle sort of continues.”Any palatable food can spur this effect, but something like Halloween candy, which is often linked to nostalgia and positive memories, is likely to trigger an even more intense reaction. “We’ve all had experiences with food where there’s this really wonderful memory around it, and we have this pleasure memory that goes along with it,” Pojednic says. “It’s not just pleasure from the taste or the smell of it, but also the situation that goes along with it.”It can be difficult to outsmart these bodily mechanisms, though some research suggests that consistently choosing healthful foods can eventually rewire your brain to prefer them. Until that happens, Pojednic says mindful eating is the best way to avoid an accidental candy binge. Next time you’re faced with a mountain of bite-sized chocolate bars, slow down and take a minute to ask yourself, “‘Do I actually want and need this?'” Pojednic suggests. “Partly it’s recognizing that cue, which is so hard-wired.”But don’t beat yourself up if you do give in to temptation, Pojednic says. “There are moments and times when giving yourself a treat is a really fun and awesome idea, and there are other times when you have to have a little more mindfulness around why you’re feeling the way you’re feeling,” Pojednic says. “You’re not going to be able to suppress those feelings. There’s absolutely room for it in day-to-day life.”Write to Jamie Ducharme at jamie.ducharme@time.com."}