{"id": "More Than Marvel. Stan Lee 's Guest Appearances on The Simpsons Prove He Was King of the Cameos", "paragraph": "Stan Lee‘s legacy as the writer, publisher and editor-in-chief of Marvel Comics, as well as a producer and actor has helped to make him a larger-than-life hero to many. Lee, who passed away on Monday at the age of 95, is perhaps best known for creating or co-creating many beloved comic books superheroes, such as Spider-Man, Black Panther, Iron Man, and the Incredible Hulk.However, among his many accomplishments, Lee also had a special claim to fame: he loved making an appearance. According to The Hollywood Reporter, Lee made a cameo in nearly every Marvel film from 1989 to 2018; he also made cameos in Marvel animated series, and outside of the Marvel Universe, perhaps most notably on The Simpsons, where he appeared in multiple episodes as himself.In his first appearance on the show in Season 13, Stan Lee arrives in Springfield to pay a visit to Comic Book Guy and Bart at The Android’s Dungeon and Baseball Card Shop, where he not only critiques Bart’s comic of “Angry Dad” (a spoof of the Incredible Hulk) but also riffs on his longtime rivalry with DC comics, seen most presciently when he tries to fit Thing from the Fantastic Four action figure into a too-small Batmobile toy car.Another notable episode involves Stan helping the Comic Book Guy find love with a fellow nerd, eventually marrying them in the end.Lee was mourned on social media by many of The Simpsons staff, including producer Al Jean, who noted that his cameos on the show was “one of the very greatest thrills.”.@TheSimpsons One of the very greatest thrills @TheSimpsons. Stan Lee all a Marvel fan could wish & much much more. pic.twitter.com/Y3TefPPkS4— Al Jean (@AlJean) November 12, 2018Writer Stephanie Gills also paid her respects to Lee, writing on Twitter that “he inspired many of us @TheSimpsons to become writers.”#StanLee was a visionary and a great man. He inspired many of us @TheSimpsons to become writers. Whenever u ran into him, he had time to talk.  It always made me smile to c him driving his top down convertible w his “Stan” license plate. As if there was another. Or will ever be. pic.twitter.com/xNprGJSOAA— Stephanie Gillis (@stevie_gillis) November 12, 2018Write to Cady Lang at cady.lang@timemagazine.com."}