{"id": "The FDA Approved a New Flu Treatment, Just In Time for Flu Season", "paragraph": "The Food and Drug Administration (FDA) has approved a new antiviral influenza treatment.The agency on Wednesday approved Genentech’s drug Xofluza, which can be taken via a single oral dose to help patients recover more quickly from the flu. It’s the “first new antiviral flu treatment with a novel mechanism of action approved by the FDA in nearly 20 years,” FDA Commissioner Dr. Scott Gottlieb said in a statement.The main factor differentiating Xofluza from other antiviral flu treatments on the market, such as Tamiflu and Relenza, is the way it’s taken. Xofluza is the only antiviral that can be taken as a single oral dose. Tamiflu, for example, must be taken orally twice daily for five days, while Relenza is an inhaled powder.In clinical trials, patients who took Xofluza got over their flu symptoms faster than those who took a placebo pill, though the drug did not alleviate symptoms significantly faster than other flu treatments. A representative from Genentech told TIME that the drug, which was approved for people older than 12 who have showed symptoms of uncomplicated influenza for 48 hours or less, will be available across the U.S. “in the coming weeks.” Its wholesale cost will be $150, though insured patients who use a coupon may purchase it for as little as $30, the company said.While antivirals offer valuable benefits to those who have already contracted influenza, Gottlieb stressed in the statement that the medications are not a replacement for flu vaccines, which can prevent illness in the first place. “Flu season is already well underway, and the U.S. Centers for Disease Control and Prevention recommends getting vaccinated by the end of October, as seasonal flu vaccine is one of the most effective and safest ways to protect yourself, your family and your community from the flu and serious flu-related complications, which can result in hospitalizations,” Gottlieb said. “Yearly vaccination is the primary means of preventing and controlling flu outbreaks.”The FDA’s approval follows one of the deadliest and most widespread flu seasons in recent history. More than 80,000 people died from the flu during the 2017-2018 season.Write to Jamie Ducharme at jamie.ducharme@time.com."}