{"id": "Every U.S. Public Library and YMCA Will Soon Get Narcan for Free", "paragraph": "Every public library and YMCA in the U.S. may soon be equipped with Narcan, in an effort to combat drug-related deaths by expanding access to the opioid-overdose-reversing naloxone nasal spray.Emergent BioSolutions, which this month completed its acquisition of Narcan maker Adapt Pharma, will provide a free kit including two doses of the nasal spray, as well as educational materials, to each of the 16,568 public libraries and 2,700 YMCAs in the U.S., according to an announcement released Wednesday. The initiative builds on the Narcan in Schools program, through which the company offers four free doses of Narcan to each U.S. high school, and up to eight doses to degree-granting two- or four-year institutions.“These two programs reflect our commitment to educating the public about the potential risks of opioids and the critical role of naloxone during an opioid overdose emergency and reinforce our mission – to protect and enhance life,” Emergent Senior Vice President Doug White, head of the company’s devices business unit, said in a statement.The announcement coincides with President Donald Trump signing the SUPPORT for Patients and Communities Act, a wide-ranging piece of legislation meant to help curb the nation’s opioid epidemic. Among other things, the act includes provisions designed to expand access to and reduce costs of naloxone, which can cost from $20 to $40 for a generic dose; the list price for a Narcan kit is $125, though it’s often discounted for first responders, government agencies and nonprofits. The legislation also aims to make substance abuse treatment reimbursable under Medicaid, free up resources for fighting addiction and lift restrictions on who can prescribe medications for treating opioid use disorder.Use of Narcan, and naloxone in general, has become far more widespread in recent years. It’s now carried by many first responders — another initiative that will be expanded under the new opioid act — and is available at major retailers such as Walgreens and CVS, often without a prescription. In April, Surgeon General Dr. Jerome Adams called for even more Americans to carry naloxone, emphasizing that “keeping it within reach can save a life.”Preliminary federal data suggests that drug overdose deaths may be slowing, but far more Americans are still dying drug-related deaths than in decades past. Opioid overdoses, in particular, have risen exponentially in recent years, killing an estimated 115 Americans every day.Write to Jamie Ducharme at jamie.ducharme@time.com."}