{"id": "Inside Scott Walker's Wisconsin Survival Plan", "paragraph": "Scott Walker stood behind a fast-food counter recently, wearing two layers of latex gloves so as not to burn his fingers on the hot hamburger patties. The governor of Wisconsin picked them up, one by one, and set them on the waiting buns, reminiscing as he did so about the time in his youth when he worked the grill at McDonald’s. The worst, he recalled, was when a busload of kids would show up 10 minutes before closing. “You definitely learn how to respond under pressure,” he said.These days, Walker is under pressure of a different sort as he seeks a third term in office. His opponent on the ballot is Democrat Tony Evers, the three-term state superintendent of education, a nonpartisan elected office. But Walker knows his real opponent is the political environment—a climate more hostile to Republicans than any he’s faced before. Polls show a close race, with Evers holding a slim lead in polling averages. “The wind was at our back in 2010 and 2014; now it’s in our face,” a Walker adviser tells TIME. “If you put Daffy Duck on the ballot, Democrats would have a lead going into the fall.”Walker is determined not to be outworked. At the restaurant, a local chain called George Webb that was giving away burgers to celebrate the Milwaukee Brewers’ playoff success, Walker stayed on the burger line in his blue T-shirt for more than an hour. He popped outside to take a picture with a group of fifth graders, then dove back in, even though the local media had already gotten all the photos and B-roll they could possibly need.Walker won three hard-fought elections in five years, and even his opponents credit him with a finely tuned political radar. It started pinging long before many other Republicans recognized the danger they were in. Back in January, a Democrat won a shocking landslide in a special election for a Wisconsin state Senate district that President Trump had carried by 17 percentage points. Walker sounded the alarm: “A wake up call for Republicans in Wisconsin,” he proclaimed. The trend continued in April, when the Democrats’ favored candidate easily won a state Supreme Court election, and in June, when another Republican-held Senate seat flipped. At a time when other Republicans were complacent, Walker saw what was coming. “We are at risk of a #BlueWave in Wisconsin,” he warned. The question was whether he could do anything to stop it.Walker is one of many endangered Republican governors in this election cycle, and their fate stands to have an enormous impact on the direction of policies that affect people’s lives, from education to health care to roads. The GOP piled up huge state-level gains in recent wave elections and now controls 33 governorships. But of the 36 gubernatorial contests on the ballot this year, 26 are for Republican-held seats. Democrats are either favored or an even bet to flip half of those, according to the nonpartisan Cook Political Report’s projections. Congressional gridlock will only worsen if Democrats take the House or Senate, but states could see a huge and consequential change of direction as a result of the midterms, including control over redistricting after the 2020 Census.No victory for Democrats would be quite as sweet as defeating Walker. After taking office in 2011, he quickly pushed through a slate of collective-bargaining reforms that gutted public-sector unions’ power, prompting months of raucous protests and a union-backed special recall election. Walker won the recall and won his reelection in 2014, cementing his reputation as a canny politician, a national conservative celebrity and a favorite of big national donors.Buoyed by that success, Walker ran for the GOP presidential nomination in 2016. Despite being an early favorite, he failed to catch fire, and his mild persona was no match for the Trump Show. (Walker eats a ham sandwich for lunch every day, buys his clothes at Kohl’s, and recently told a group of farmers, “The only skeleton in my closet is that my mom’s a Cubs fan.”) He dropped out months before the primaries began and limped back to a state that seemed none too impressed. His approval rating bottomed out in the 30s, and the Republican-led legislature increasingly defied him.Walker’s numbers have ticked up since then, but he’s struggled at times to come up with an argument for why he deserves a third term. It’s a bit of a double bind: If he boasts about all he’s accomplished, he looks out of touch with voters’ dissatisfactions; if he talks about problems he wants to solve, voters wonder why he didn’t get around to them in the last eight years. Four former Walker cabinet secretaries have recently endorsed his opponent, who says the state has tired of the governor’s divisive style.Walker’s challenge, he says, is “to frame the arc,” convincing the electorate that one more sequel will round out the narrative. “In the third term, I’m asking voters to give me the chance to finish the job,” he said. His campaign has tacked toward the center, promising to expand health care and increase education funding.But after years of creating an unassailable brand as a fiscal conservative—slashing government spending, lowering taxes and blasting away at Obamacare—it’s a tough pivot. Walker insists he’ll never allow insurance companies to reject customers with preexisting conditions. But he signed onto a multi-state lawsuit challenging the Affordable Care Act’s provision requiring that they do so, and rejected the law’s optional expansion of Medicaid. “Walker is really moderating: all of a sudden he’s for things he’s literally suing the federal government over,” says Mike Wagner, a political scientist at the University of Wisconsin. “It’s a smart campaign move given the way public opinion in Wisconsin has shifted. But it’s a tough argument for him to make.”Walker’s allies grumble that he’s a victim of his own success. His aggressive economic policies, they argue, helped turn the state around, bringing unemployment down to just 3% after it spiked during the Great Recession. Now that jobs aren’t an issue, voters want more government services. Evers is proposing major expansions of health care and education, an agenda Walker warns will require raising taxes, but polls show voters prefer funding government to keeping taxes down. Evers also promises to tackle the state’s crumbling roads, whose cavernous ruts an independent group has dubbed “Scott-Holes” in billboards around the state.But Walker’s biggest challenge is the local and national backlash to President Donald Trump, who pulled off a narrow surprise win in Wisconsin in 2016 but is now 5 points underwater in the state, with a majority of voters disapproving of his performance. Walker shared the stage with Trump when he campaigned in the rural central part of the state in late October, but he generally avoids talking about Trump, a former rival who once boasted that he’d “sent [Walker] packing like a little boy” in the presidential primary.“It’s just history,” Walker said when I asked him whether Trump was dragging him down. “Anytime you have an incumbent President in their first term, any of the members of that President’s party are going to have a challenge.” Rather than criticize Trump’s tariffs, which are unpopular in the state, Walker praised Trump for holding out for a provision the state’s struggling dairy industry sought in recent U.S.-Canada trade talks. Walker said he brought the issue to the President’s attention, a benefit of their relationship. “If we don’t have President Trump in office, our dairy farmers would continue to get nailed,” he said.Democrats in Wisconsin are energized, with canvassers combing African-American neighborhoods in Milwaukee and grassroots anti-Trump groups rallying suburbanites to the polls. But they’re also wary of the Walker machine, the top-flight GOP operation that helped him prevail in past contests despite high Democratic enthusiasm. The billionaire Koch brothers, early Walker fans, briefly cooled on him over a pricey 2015 stadium deal he backed, but their political organization, Americans for Prosperity, recently announced it would spend $1.8 million on ads for him in the final stretch.Still, there are signs Walker’s support network isn’t what it once was. After the governor finished serving hamburgers at the restaurant here, I noticed a sign for another tenant of the same strip mall: Americans for Prosperity, with its torch-shaped logo. But when I reached the storefront, it was empty. A “For Lease” sign hung in the window. The door was locked.Write to Molly Ball at molly.ball@time.com."}