{"id": "6 Common Open Enrollment Mistakes and How to Avoid Them", "paragraph": "It’s that time of year again: open enrollment. This annual rite of passage is when employees — or anyone in a state health insurance exchange or individual marketplace — can sign up for or make changes to their health insurance and other benefits.Employees often greet open enrollment with a collective groan, seeing it as just one more thing to add to their ever-expanding to-do list. If you’re among them, try looking at it another way: Health insurance is probably a big chunk of your total compensation, so why squander it by making poor choices?The average cost of healthcare, including premiums and out-of-pocket expenses, is expected to be more than $14,000 per employee in 2019, according to the National Business Group on Health. Employers will cover roughly 70% of that. Meanwhile, the consequences of choosing the wrong plan — or missing open enrollment entirely — could be financially devastating.Here are six common mistakes to avoid during open enrollment.For employer plans, the enrollment window may vary. But it typically begins in early November and lasts two to four weeks. If you are in or are planning to join an Affordable Care Act exchange, open enrollment begins on November 1 and ends on December 15 in most states.Employer plans and state exchanges typically allow for mid-year adjustments related to major life events, such as marriage, divorce, a job loss or a new child. Barring those special circumstances, however, you’ll likely need to wait until next year to enroll in or change a plan after the open enrollment period.If you are in an employer healthcare plan and miss open enrollment, your employer may automatically re-enroll you into the equivalent of what you had last year. That’s better than the alternative — no insurance at all — but inaction can still sting, since plan pricing and details often change from year to year, says Joe Ellis, senior vice president at benefits consulting firm CBIZ Employee Benefits.Before you keep the status quo, take a look at a recent paystub and an explanation of benefits so you can compare your costs and benefits now with those for the upcoming year. Pay particular attention to your share of the premium, deductibles, co-payments, co-insurance, out-of-pocket maximum and prescription drug benefits.Most larger employers offer a few different options, and it’s worth revisiting your choices every year. The typical menu includes a basic high-deductible plan, which generally has the lowest monthly premium but requires you to spend more before full coverage kicks in. There are usually one or two moderately-priced options, plus a more comprehensive but expensive “Cadillac” plan.“We hear from young people who say they called their mom or dad for advice and their parents said ‘get the absolute best plan you can,’” Ellis says. “A healthy 27-year-old probably doesn’t need that much coverage.” On the other hand, some people mistakenly go for the cheapest premium, he says, but ultimately pay more out of pocket.Again, start with a quick assessment of your healthcare spending over the last couple of years; many employers offer interactive tools that crunch the numbers for you. If you tend to undershoot your deductible, you might be better off moving to a high-deductible plan. If you usually hit your deductible before the snow melts, you could come out ahead by paying a higher premium for a heartier plan.Of course, the past is only helpful to a point. If you’re planning to get married, start a family, send a kid to a far-flung college or finally have your tonsils taken out, it might be time to switch things up.If you’re contemplating a high-deductible plan, don’t overlook the added benefit: You may be eligible to contribute to a Health Savings Account (HSA) and save up to $3,500 a year in 2019 with pre-tax dollars ($7,000 for families plus a $1,000 catch-up if you’re 55 and older).You can spend down that account as you need it, or let it accumulate, in which case earnings and qualified withdrawals are also tax-free. “It’s pretty much the most tax-advantaged savings you can get when used for medical expenses,” says Keith Fenstad, a certified financial planner and director of wealth planning at Tanglewood Total Wealth Management, based in Houston.There are some caveats to note during enrollment season. First, to qualify for an HSA, your plan needs a deductible of $1,350 for individuals and $2,700 for families. Secondly — and this one is easy to overlook because it’s counterintuitive — your plan’s out-of-pocket maximum cannot exceed $6,750 for individuals and $13,50 for families in 2019.If your plan does not qualify for an HSA and your employer offers a Flexible Spending Account (FSA), that is probably your next best option. Just keep in mind that, unlike HSAs, FSAs carry the “use it or lose it” rule, requiring you to spend your entire balance each year.The decision matrix gets a little more complicated if you and your spouse both have access to employer healthcare. “In this case it’s often more effective to divide up the coverage across most plans,” says Fenstad.Indeed, most companies are less generous about footing the bill for the entire family. In 2018, the average premium for a family plan was $19,600, according to the Kaiser Family Foundation, and employers were on the hook for more than $14,000 of that. On the flip side, many employers will offer additional compensation to employees who opt to go on a spouse’s plan.Again, premiums are just one part of the equation, so compare the costs and coverage of all your options to see what offers the most benefits for your buck. It may require a little more work on your part, but look on the bright side: at least you have options. According the Kaiser Family Foundation’s latest tally, 47% of working Americans are not covered by employer-sponsored health insurance.While healthcare is the primary focus during open enrollment, large employers also give staffers access to ancillary benefits, such as dental coverage, disability insurance, life insurance, and even pet insurance.You shouldn’t necessarily check the box on all of these — in some cases you will do better shopping as an individual. Even so, these voluntary benefits are always worth a closer look, says Ellis, if only because they can be an inexpensive and convenient way to pick up smaller policies that could come in handy as the year unfolds.Contact us at editors@time.com."}