{"id": "The Catholic Church Has a Version of Pokémon Go Just for Catching Saints", "paragraph": "Get out there and get evangelizing! At least, that’s the latest word from the Catholic church after an associated organization launched a new app — called “Follow JC Go” (JC, presumably, stands for “Jesus Christ”) — to get the faithful involved in religious activity on their smartphones.Taking its cues from the popular augmented reality Pokémon Go game, in which players try to “catch” creatures like Pikachu through the GPS-enabled interface, Follow JC Go helps users discover biblical figures and icons — literally, saints, represented in stylized cartoon form — as they wander around cities. They’ll interact with the virtual holy characters and add them to an “evangelization team,” as long as they answer certain questions right that refer to biblical history. Gameifying religion: just the next offering put-upon Catholic church. A promotional video suggests that players can win points and compete against friends, gather “e-teams” of believers and even find nearby churches and “make the journey more fun” by playing.The app was developed and launched by the Foundation Ramon Pane, with the intention of getting younger people involved in evangelizing. And they even got the blessing of the Pope himself with the project.“You know, Francis is not a very technological person, but he was in awe, he understood the idea, what we were trying to do: combine technology with evangelization,” said Ricardo Grzona, the executive director of the foundation, to religious news outlet Crux Now. “Never has the Church had a project like this. This is the Catholic app with the most advanced technology there is.” First launched in Spanish, they have plans to expand the language options to include English, Italian and Portuguese in the coming weeks. It’s free and available for both iOS and Android — because the church apparently welcomes players of any operating system. While it has a 3.8 star rating so far on the App Store, reviews so far are inconclusive.Write to Raisa Bruner at raisa.bruner@time.com."}