{"id": "At a Peculiar Summit in Papua New Guinea, America Is Still the Odd One Out", "paragraph": "The “America First” policy of U.S. President Donald Trump was savaged by every world leader taking the stage at the Asia-Pacific Economic Cooperation (APEC) summit in Papua New Guinea (PNG) on Saturday, who together launched a stern defense of free trade and condemnation of the escalating trade war between Beijing and Washington.Trump’s name was never mentioned, but it was no secret who was being addressed by representatives of the 21 Asia-Pacific economies. First, Malaysia’s 93-year-old Prime Minister Mahathir Mohamad condemned “trade wars between major economies,” before Australian Prime Minister Scott Morrison warned against “throwing up protectionist barriers.”“More than a billion people have been lifted out of extreme poverty since 1991 in large part because of the jobs and access to affordable consumer goods that free trade has enabled,” Morrison told navy suits gathered in the small theater aboard the P&O Pacific Explorer.The Trump administration has placed tariffs on $200 billion worth of Chinese goods in response to what it claims are unfair trade practices that have contributed to a $375 billion trade deficit. China has responded with $60 billion worth of its own tariffs, with the spat upsetting global supply chains and imperiling economies around the world.Russia’s diminutive Prime Minister Dimitri Medevev, looking like he’d walked off a Bugsy Malone set in double-breasted grey suit, then swiped at the “highly unpredictable situation in the global economy” and that “economic sanctions have become an instrument of political pressure.”It was then time for Chinese President Xi Jinping to take the stage. “A cold war, hot war or trade war will produce no winners,” he told the crowd to hearty applause.“Nobody should stop people in developing countries from pursuing a better life,” he added, before insisting that his signature Belt and Road Initiative (BRI), a transnational trade and infrastructure network, “was not a trap as some people have labeled it.”In the absence of Trump, who did not travel to PNG to defend “America First,” that job fell to Vice-President Mike Pence. “’America First’ is not America alone,” he insisted, before launching into a stinging attack on China, mocking the BRI as a “Constricting Belt or One-Way Road,” and warning gathered leaders “do not accept foreign debt that could compromise your sovereignty.”The drawing of lines illustrates how the South Pacific is becoming another battleground in the strategic tussle between China and the U.S. — but one complicated by the trade-reliant region’s aversion to Trump’s protectionism. Trump’s decision to withdraw from the Trans-Pacific Partnership free trade pact also hurt many APEC economies.China has pledged some $5.9 billion on more than 200 projects in the region since 2011, according to Australian think tank the Lowy Institute, and the sight of the chief of China Construction Bank — one of the world’s largest lending institutions — far back in the Pacific Explorer theater’s fifth row illustrates the big guns that Xi had brought along to Port Moresby, which is already awash with building sites daubed with Chinese characters.Pence, for his part, promised that a “historic initiative to transform” PNG’s future would be announced soon. He added an end to the trade war might be found when Xi and Trump meet at the G20 in Argentina later this month.“Governments that deny rights to their own people too often violate the rights of their neighbors,” he warned the audience, citing Beijing’s territorial ambitions in the South China Sea. “Just like America, always put your country first.”Write to Charlie Campbell at charlie.campbell@time.com."}