{"id": "Let's Talk About the Ending of Widows", "paragraph": "Warning: This post contains major spoilers for Widows.Perhaps we should have known that Widows wouldn’t be simple. Author Gillian Flynn is the master of the mid-plot pivot, like her famous Gone Girl reveal. Now, she’s managed to insert a gasp-worthy moment into her latest film.But the big twist in Widows, out Nov. 16, is not actually a Flynn invention. Flynn and director Steve McQueen adapted the screenplay from a 1980s British television miniseries by Lynda La Plante. The series was something of a phenomenon in England and also became a bestselling book. McQueen and Flynn updated the story to the modern era and changed the setting to Chicago, but kept much of the plot, including an important revelation: Veronica’s husband is still alive.The surprise comes halfway through the film. Veronica has already recruited two of the other women left widowed after their husbands were killed in a shootout with police—Linda (Michelle Rodriguez) and Alice (Elizabeth Debicki)—to help her pull off the last heist planned by her husband, Harry (Liam Neeson). They plan to use Bash (Garret Dillahunt) as their getaway driver until the gangster Jatemme (Daniel Kaluuya) kills him as a way of sending a threatening message to Veronica. She then heads to the apartment of the last widow, Amanda (Carrie Coon), to ask if her husband knew of any other getaway drivers.Amanda cautions Veronica against the heist, presumably because she’s concerned about Veronica’s safety. While Amanda is attending to her crying baby in another room, Veronica’s dog sniffs at a doorway and begins to bark. Veronica walks over to him and sees a flask that belonged to Harry (and that the audience saw at the beginning of the film) on the table. She then realizes the dog is likely barking at the smell of Harry. She grabs the dog and runs out of the apartment.Sure enough, Amanda emerges from her baby’s bedroom and opens the door. There sits Harry. It turns out that politician Jack Mulligan (Colin Farrell) hired Harry to steal money from his opponent Jamal Manning (Brian Tyree Henry) in the alderman race. Harry betrayed the men in his crew and escaped with the money they stole from Jamal.In a recent interview with TIME, Flynn said that she usually keeps a notebook to keep track of the clues in her mysteries to make sure that if readers go back in search of clues, they’re all in the text. “I don’t remember doing that with this,” she says. “It was truly meant to be a surprise.” But she and McQueen still did drop several hints that Harry might still alive throughout the movie. Here’s a list:After a robbery goes wrong, Harry’s crew races away in a van with the police in pursuit. Harry pulls the van into a garage so that they can switch cars and get away. But as they open the garage door, police cars are waiting outside. They begin to shoot, and the van explodes and flips over, killing everyone inside—or so we think.Than van exploding in such a dramatic fashion is our first clue that something is amiss. As we see in later in a flashback, Harry placed a gas tank behind the van to ensure that the vehicle would blow up and the men inside would be killed.After she’s threatened by Jamal and realizes she has to come up with the money her husband owes, Veronica asks all the widows to meet her at a spa. When she arrives only two of them, Alice and Linda, are there. Veronica mentions that she invited a third woman, Amanda. When Alice and Linda ask who Amanda is, Veronica replies, “Let’s hope it doesn’t matter.”Considering that their crew needs a fourth member, it would be strange for Veronica not to care that one of the women didn’t show up. After all, she is threatening to blackmail the other two into pulling off the heist. Does Veronica perhaps already suspect that her husband Harry was having an affair with Amanda? Even if Veronica doesn’t yet know her husband is alive, she still may not want to come face to face with his lover.Alternatively, Bash could have reported to Veronica that Amanda had a baby, so Veronica didn’t want Amanda to become involved.Amanda finally does call Veronica and ask to meet up—likely at Harry’s behest. The timing of this phone call is an important narrative clue. Right before, Veronica is asleep dreaming about her relationship with Harry—both the good times and the bad. Audiences find out for the first time in this scene that the two lost a child.Harry says to Veronica, “Don’t make having a child with you my only regret.” Veronica shoots back, “Maybe you should have had a child with someone else. Then he’d still be alive,” nodding to the fact that their son died because of racist assumptions by the policemen who shot him during a routine traffic stop. Veronica wakes up to the phone call from Amanda, who we later find out does have a child with Harry.The call interrupting those memories connects Veronica’s greatest heartache—the loss of her son—to Harry’s affair. The death drove a wedge between them. Later, when Veronica has pieced the puzzle together and confronts her still-alive husband, she accuses him of wanting to go restart his life with his “new, white family.”When Veronica and Amanda finally do meet in a diner, there’s a palpable tension between the two. Veronica begins to talk about Harry, saying that he “never made a mistake before.” His meticulous notebook supports the idea that he’s a perfectionist. Perhaps Veronica has already begun to suspect that he did not make a mistake the night he “died” but rather faked his death.Amanda says, “I guess, he was human after all.” The comment suggests a familiarity with Harry and a hostility toward his wife, who stood in the way of their relationship. It also hints at his true “mistake”—not his death, but his affair.Amanda also says that she hopes Harry left Veronica enough money to move somewhere else and start over: Did Harry tell Amanda that she should encourage Veronica to leave so that she won’t expose him?After Jatemme beats up Bobby (Kevin J. O’Connor), Harry’s contact at the bowling alley, Bobby calls Veronica. He asks her if she has traded the notebook yet. Veronica lies and says yes. “That’s good,” says Bobby, as he looks over to a mysterious figure we can’t see.Likely, this mystery man is Harry trying to protect Veronica by convincing her to hand over his plans to rob the Mulligan family to Jamal and Jatemme.Veronica shows up at Amanda’s house unannounced to ask whether her husband knew anyone who might be willing to act as getaway driver for the upcoming heist. While Amanda is calming her crying baby in another room, Veronica’s dog runs to a closed door and begins barking and scratching at it.Recall that the dog did the same thing in Harry’s hideout when he smelled Harry’s jacket. The dog recognizes the scent of Harry and is trying to reach him. Veronica figures out what’s going on and flees the house. Amanda opens the door to reveal Harry. “We should have left sooner,” she tells him.Now Veronica knows her husband is alive. She goes home and looks at her son’s old room and recalls when her marriage began to fall apart after their child’s death. She is tracing the steps that led to his affair.She can also guess that he overheard her conversation with Amanda and knows that she is pulling another job. When he confronts her at the end of the movie, she seems prepared for him mentally—and physically, as she is the one to shoot him.At the beginning of the movie, we see Veronica interrupt Harry’s shower to toast him with a shot from his flask. Presumably, the flask is a gift or some sort of good luck charm. When Veronica’s dog begins scratching at the door in Amanda’s home, Amanda spots Harry’s flask on the coffee table in the hallway and begins to piece the puzzle together.At the end of the film, some viewers—like myself—may have expected yet another twist: Amanda and Harry were in on it together. Given how lovingly they treated each other in the opening scenes of the movie, it’s hard to imagine that Harry would betray Amanda. But looks can be deceiving. Viewers discover over the course of the film that the couple lost a child, and Harry struggled to cope with both the death and the racism at play in the killing. The loss tore them apart.“I do believe that love can live in the same space as betrayal,” Viola Davis said in an interview with TIME about the end of the film. “I had to make a strong choice of saying that I love this man. We creatively bonded. We sexually bonded. It’s one of those romances that just clicks from the very beginning. When the betrayal happens, it makes it all the more devastating. And I believe that most crimes of passion are born out of love. I think that’s where a lot of relationships live and that’s why there is pain. If there were no love, there could be no devastation. Realistically what it means to dedicate yourself to a man who is not perfect, that’s where the nuance lives.”But there’s still one surprise left: Amanda forms an unlikely friendship with Alice—who took a bullet to save Amanda’s life—by the end of the film.Write to Eliana Dockterman at eliana.dockterman@time.com."}