{"id": "Suspect Shot Victims Multiple Times in Kroger Grocery Store Rampage, Police Say", "paragraph": "(JEFFERSONTOWN, Ky.) — A gunman fatally shot a man in the back of the head inside a Kroger and then killed a woman in the grocery store’s parking lot before exchanging gunfire with a bystander, police said. Officers then captured the suspect as he tried to flee.Gregory Alan Bush, 51, was booked early Thursday on two counts of murder and 10 counts of felony wanton endangerment, according to Louisville Metro Department of Corrections records.His arrest report says Bush walked to the back of the Kroger store, pulled a gun from his waist and shot the first victim in the back of the head, then kept shooting him multiple times “as he was down on the floor.”Jeffersontown Police Chief Sam Rogers said in an initial news conference at the scene that “we have no idea” what motivated the shootings. The FBI later announced that it “is evaluating the evidence to determine if there were any violations of federal law.”Rogers said the suspect then shot a woman multiple times out in the parking lot at about 3 p.m. on Wednesday. Both victims died at the scene. A citizen armed with a gun engaged the suspect, trading gunfire in the parking lot, but no one was hit, Rogers said.Bystander video shows a white man in a distinctive neon-yellow shirt trying to get away. He’s recorded driving out of the lot while an officer chases after him on foot. Other videos show police making the arrest.Eric Deacon, who identified himself as an emergency medical technician, told The Associated Press that he was in the store’s self-checkout lane when he heard the first shot, in the pharmacy area.He said a man came around the corner and “the look on his face, he looked like he just didn’t care.”Deacon said he saw another man in the store with a gun who appeared to be shooting at the suspect. Deacon went outside and saw a woman in her mid-50s or early 60s who had been hit, and tried to resuscitate her.“She was gone, there’s nothing I could do,” Deacon said. “I think she just got caught in the crossfire.”As police officers swarmed the scene and blocked off the area with yellow crime tape, a man identified by the Louisville Courier Journal as Tim King stood in the parking lot waiting for his wife to come out. He said he drove to the store after she called him, sobbing to tell him what had happened.“I said, ‘What’s wrong?'” King said in a video posted on the newspaper’s website. “And she said, ‘There’s someone shooting up here.'”King said his wife said she heard popping noises, then someone ran around a corner and said, “Oh my God, he’s killed her.”Customers were moved to the back of the store, she said.“It’s just a very, very scary situation,” King said.The Kroger Co. issued a statement saying that company officials were “shocked and saddened by the shooting.”“Thanks to the quick response of the local police department, the suspect was apprehended, and our store is secure.”The store was closed and will not reopen until the investigation is complete, the release said.Contact us at editors@time.com."}