{"id": "Wisconsin School Investigating Photo of Boys Making Apparent Nazi Salute", "paragraph": "(BARABOO, Wis.) — A Wisconsin school district is investigating a photo of a group of high school boys giving what appears to be a Nazi salute, drawing a strong rebuke on social media.Baraboo Superintendent Lori Mueller said she became aware of the photo Monday after it was posted on social media. The photo of more than 60 male students dressed in suits, some wearing boutonnieres, shows many with their right arm extended upward while posed on the steps of the Sauk County Courthouse. Mueller did not say what occasion may have brought the students together, but said the photo appears to have been taken last spring and wasn’t taken on school grounds or at a school-sponsored event.It is so hard to find words… This is why every single day we work hard to educate. We need to explain what is the danger of hateful ideology rising. Auschwitz with its gas chambers was at the very end of the long process of normalizing and accommodating hatred. https://t.co/13AzZaMGJR— Auschwitz Memorial (@AuschwitzMuseum) November 12, 2018“The school district is investigating this situation and is working with parents, staff and local authorities. If the gesture is what it appears to be, the district will pursue any and all available and appropriate actions, including legal, to address the issue,” Mueller said in a letter to parents and guardians.“The Baraboo School District is a hate-free environment where all people, regardless of race, color, religion, creed, sex, sexual orientation, gender identity, national origin or ancestry, are respected and celebrated,” Mueller’s letter continued.The photo spread quickly on Twitter Sunday night and Monday morning with the hashtag #barabooproud, which is often used by the district to promote its activities and athletic programs.The Baraboo Police Department said it was assisting with the district’s investigation.The photo drew widespread condemnation, including from the Auschwitz-Birkenau Memorial and Museum in Poland and a state senator who represents Baraboo, a town of about 12,000 residents that’s about 115 miles (185 kilometers) northwest of Milwaukee.“This is why every single day we work hard to educate. We need to explain what is the danger of hateful ideology rising. Auschwitz with its gas chambers was at the very end of the long process of normalizing and accommodating hatred,” the Auschwitz Memorial tweeted.Democratic Sen. Jon Erpenbach suggested teenagers are taking their cues from President Donald Trump.“There’s no room in the world for anything like that at all. From what they’re seeing out of the White House, that it’s OK to be intolerant and racist. Never is. Never was. Never will be,” Erpenbach said.The White House did not immediately respond to an email for comment seeking a response to Erpenbach.It’s not the first time Baraboo High School students have been accused of using racially controversial symbols. In 2012, a group of students drove trucks around displaying Confederate battle flags to commemorate a friend who was killed in a car crash. The students removed the flags at the request of school officials. Many associate the flag with slavery, segregation and white supremacy.A week before last week’s midterm elections, area residents received white nationalist propaganda in their mailboxes. The single-page fliers with the headline “White Lives Matter” linked to websites promoting nationalist and anti-Semitic views.Contact us at editors@time.com."}