{"id": "Judge Tells Florida Candidates to 'Ramp Down the Rhetoric' After President Trump Claims Illegal Activity in Recount", "paragraph": "(FORT LAUDERDALE, Fla.) — A judge on Monday told lawyers representing the warring sides in the Florida recount that they need to “ramp down the rhetoric” after Republicans, including President Donald Trump, alleged illegal activity, because the unsubstantiated accusations are eroding confidence in the election for Senate and governor.The state’s law enforcement arm and elections monitors have found no evidence of wrongdoing, but lawyers for the Republican party and the GOP candidates joined with Trump in alleging that irregularities, unethical behavior and fraud have taken place since the polls closed last week.“An honest vote count is no longer possible” in Florida, Trump declared Monday, without elaborating. He demanded that the election night results — which showed the Republicans leading based upon incomplete ballot counts— be used to determine the winner.The recount that is underway is mandated by state law.Trump went on to allege that “new ballots showed up out of nowhere, and many ballots are missing or forged” and that “ballots (are) massively infected.” It was unclear what he was referring to.The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!— Donald J. Trump (@realDonaldTrump) November 12, 2018Much of the Republicans’ ire was centered on Broward County and its Supervisor of Elections Brenda Snipes, a Democrat who was appointed in 2003 by then-Republican governor Jeb Bush. She has been re-elected four times. Critics have suggested the slow pace of ballot-counting in Broward reflects wrongdoing.Broward elections officials have said this year’s count was encumbered by the unexpectedly high turnout for a midterm election and the unusual length of this year’s ballots, which contained 12 state constitutional amendment proposals, partly as a result of a constitutional revision commission that meets once every 20 years.Bush said Monday on Twitter that Snipes should be removed from office, saying there was “no question” that she “failed to comply with Florida law on multiple counts, undermining Floridians’ confidence in our electoral process.”Trump’s comments came just hours before Broward Chief Circuit Chief Judge Jack Tuter held an emergency hearing on a request by lawyers for Republican Gov. Rick Scott, whose lead in the Senate race over incumbent Democrat Bill Nelson has narrowed with the counting of provisional and other ballots. They asked for additional sheriff’s deputies to be sent to Snipes’ office to monitor ballots and voting machines. The lawyers requested that the deputies be present when the ballots and voting machines are not being used and until the recount is over.State law requires a machine recount in races where the margin is less than 0.5 percentage points. In the Senate race, Scott’s lead over Nelson was 0.14 percentage points. In the governor’s contest, unofficial results showed Republican former Rep. Ron DeSantis ahead of Democratic Tallahassee Mayor Andrew Gillum by 0.41 percentage points.Once the recount is complete, if the differences in any of the races are 0.25 percentage points or less, a hand recount will be ordered. All 67 counties are facing a state-ordered deadline of Thursday to finish their recounts, and two-thirds have already begun.In their request, Scott’s lawyers alleged that Snipes was engaging in “suspect and unlawful vote counting practices” that violate state law and that she might “destroy evidence of any errors, accidents or unlawful conduct.” The motion was supported by lawyers representing the state Republican Party and opposed by Snipes’ office, Nelson’s campaign and the state Democratic Party.“I am urging because of the highly public nature of this case to ramp down the rhetoric,” Tuter said.“If someone in this lawsuit or someone in this county has evidence of voter fraud or irregularities at the supervisor’s office, they should report it to their local law enforcement officer,” Tuter said. “If the lawyers are aware of it, they should swear out an affidavit, but everything the lawyers are saying out there in front of the elections office is being beamed all over the country. We need to be careful of what we say. Words mean things these days.”After Tuter told all sides to meet to discuss a compromise, they agreed to add three deputies to the elections office in Broward.During the hearing, Scott lawyer Jason Zimmerman argued that Snipes has a long history of election errors and irregularities. He said the only goal of the request was to “protect the integrity of the vote.”“This is not about voter suppression. This is not about stopping this vote. This is not about, as Sen. Nelson’s campaign said, about intimidation,” Zimmerman said.Snipes’ lawyer, Eugene Pettis, said that Zimmerman’s goal in filing the motion was to “undermine” the public faith’s in the election in case Nelson overcomes his deficit and wins the recount.He said Snipes’ office already has deputies, security guards and cameras guarding the ballots, and the recount process is conducted in view of four representatives each from the Republicans and Democrats.Bipartisan experts agree that voter fraud is a rare phenomenon across the nation.To be sure, Broward County has experienced glitches with tabulation machines and mistakenly counted 22 absentee ballots that had been rejected. Still, officials said there was nothing illegal happening.That didn’t stop protests outside Snipes’ office, where a mostly Republican crowd gathered, holding signs, listening to country music and occasionally chanting “lock her up,” referring to Snipes. A massive Trump 2020 flag flew over the parking lot.In Palm Beach County, Elections Supervisor Susan Bucher said Monday that it would “almost impossible” for her county to meet the Thursday deadline because of outdated laws and outdated equipment certified by the state.The recount in other major population centers, including Miami-Dade, Pinellas and Hillsborough counties in the Tampa Bay area, continued without incident.Contact us at editors@time.com."}