{"id": "Alaska's Independent Governor Bill Walker Suspends His Re-election Bid 3 Days After Lieutenant's Resignation", "paragraph": "(JUNEAU, Alaska) — Alaska Gov. Bill Walker suspended his re-election bid Friday, three days after the sudden resignation of his lieutenant governor over what Walker described as an inappropriate overture toward a woman.Walker’s announcement, made during the Alaska Federation of Natives conference in Anchorage, was met with gasps.Walker, the only independent governor in the country, took swipes at Republican rival Mike Dunleavy and did not explicitly endorse Democrat Mark Begich. But he said Begich’s stand on important issues more closely aligned with Walker’s priorities.Walker’s campaign was rocked Tuesday by the resignation of Lt. Gov. Byron Mallott, a Democrat who was replaced by former state health commissioner Valerie Davidson.Throughout the campaign, some Democrats and independents worried that Walker and Begich would split the vote, giving the election to Dunleavy. Walker was elected in 2014 with Democratic support.Walker campaign manager John-Henry Heckendorn earlier this week said Walker and Begich had been in talks about a “path forward for Alaska” but would not elaborate. On Thursday, Begich and Walker had sought to downplay any suggestions of a potential deal between them ahead of the Nov. 6 election.Mallott, in a resignation letter, apologized for “inappropriate comments I made that placed a person whom I respect and revere in a position of vulnerability.”Walker spokesman Austin Baird said the incident that led to Mallott’s resignation happened Sunday. Walker said he learned of it Monday. Few details have been released because Walker said he is honoring the wishes of the woman involved.The partnership of Walker and Mallott — and blurring of partisan lines — was a central theme of their administration and of their campaign. Walker said he considers Mallott his closest friend and “soul mate.”In 2014, Walker and Mallott were each running for governor, trying to unseat Republican Gov. Sean Parnell. Walker was a Republican mounting an outsider bid. Mallott was the Democratic candidate and an Alaska Native leader.With the support of the Democratic party, the two men, who had developed a friendship, combined their campaigns and defeated Parnell. Walker changed his affiliation from Republican to undeclared, and Mallott remained a Democrat but became Walker’s running mate.In the succeeding four years, the two men became as close as brothers.This year, their desire to run together helped seal what some had already seen as an uphill battle for Walker because of the three-way fight between him, Begich and Dunleavy. Though Democrats now allow independents to run in their primaries, Walker opted against that when it appeared Begich would run. He instead gathered signatures to appear on the general election ballot, which ensured he and Mallott could run together.Walker, 67, is no stranger to the underdog role and embraced it through much of the campaign. He often speaks of the emotional and financial toll of rebuilding his hometown of Valdez after the devastating 1964 Good Friday earthquake. As a kid, he worked odd jobs to help make ends meet and helped his father with his construction business. He said the quake changed him — teaching him lessons about faith, perseverance and working together.As governor, he faced criticism for halving the size of the check Alaskans received from the state’s oil-wealth fund in 2016. He has defended his decision as proper; it came amid a massive budget deficit and legislative gridlock over how to address it. But critics labeled him a thief.“I ran for the job to do the job, not to keep the job,” he said in a recent interview, describing that and other difficult decisions.Contact us at editors@time.com."}