{"id": "A New Type of Treatment Shows Promise Against Aggressive Breast Cancer", "paragraph": "In many cases, breast cancer is considered a treatable disease — as long as it’s diagnosed early and treated with the proper combination of surgery, chemotherapy, radiation or targeted drugs. But triple-negative breast cancer has long been an exception.The reason it’s so deadly is that these cancer cells lack the docking points for three proteins — the hormones estrogen and progesterone, and human epidermal growth factor receptor 2 (called HER2) — that effective drugs can latch on to in order to destroy tumors. Women diagnosed with triple-negative breast cancer, who make up 15% to 20% of breast cancer patients, often try chemotherapy after chemotherapy, working through each drug until their cancer starts growing again, at which point they move on to the next drug.But in a presentation at the European Society for Medial Oncology in Munich, scientists reported that combining chemotherapy with an immunotherapy drug helped lower risk of their disease progressing, and of death, by 20% compared to women treated with chemotherapy alone. The research was conducted in 900 women with metastatic triple-negative breast cancer who were randomly assigned to receive the combination therapy or just chemotherapy.“It’s very exciting, because now immunotherapy is actually coming to the triple-negative breast cancer population,” says Dr. Sylvia Adams, director of clinical breast cancer research at NYU’s Perlmutter Cancer Center and a co-author on the study. “We see women with durable responses without any evidence of cancer on their scans years later. That’s truly a victory.”The results are especially encouraging since they apply to women who are treated with the immune and chemotherapy combination as their first treatment, before they are put through the standard therapy of cycling through chemotherapy drugs.So far, using immunotherapy agents alone in treating breast cancer of any kind has not been successful. “There’s always been a question of whether there was even a role for immunotherapy in breast cancer,” says Dr. Jennifer Litton, from MD Anderson Cancer Center, who was not involved in the study but does research of other chemo and immunotherapy combinations. Researchers believe that’s because breast cancer cells tend not to have many mutations, and cancers with a greater number of mutations, such as lung cancers and skin cancers, are better at attracting immune cells to attack them.But in 2014, Adams found that even in women with triple-negative breast cancer, there was evidence that some immune cells were trying to attack the cancer very early in the disease, and women who showed more of these immune responses early on tended to survive longer than those who did not. “That gave us the idea that if you can harness that immune response that’s already shown to affect survival, you can actually make big progress against this cancer,” she says. The problem was that the immune response waned over time.More studies showed that the right chemotherapy — not necessarily in the same doses usually used to treat breast cancer, but in different forms of delivery where it was just enough to stimulate the immune system without destroying immune cells — could help to activate the immune system. And researchers like Adams began looking at combining specialized forms of chemo with immunotherapy drugs. “The combination can be harnessed to improve on the efficacy of both drugs,” she says. Timing the combination is critical, since the cocktail needs to take advantage of the short window early on in the disease when the immune system is at its most robust in targeting the cancer. The chemotherapy activates the immune cells, and the immunotherapy drugs enhance that immune activity against the tumors, leading to a powerful caner-fighting strategy.“These results are a massive step forward,” said Dr. Peter Schmid, professor OF? cancer medicine at Queen Mary University of London and clinical director of the breast cancer center at St Bartholomew’s Hospital and the study’s lead author, in a statement. “We are changing how triple-negative breast cancer is treated in proving for the first time that immune therapy has a substantial survival benefit.”Schmid and Adams found that some women in the study had an even greater response to the combination therapy. Those women had cancer cells that carried a protein, known as PDL1, that is specifically targeted by the immunotherapy drug.“This study is proof of principle that we should keep going,” Litton says. She is investigating whether there is a way for people who have already started chemotherapy to learn whether they will respond to the standard cycle of chemotherapy drugs, or should be switched to immunotherapy combinations for better results.Adams is also hopeful that other immunotherapy drugs may be developed that are more effective in activating the immune system against breast cancer cells specifically. “I expect these results will really invigorate the field and bring new research to help patients,” she says.Contact us at editors@time.com."}