{"id": "Indiana Woman Arrested for Allegedly Leaving Racist Note on New Neighbors' Door", "paragraph": "An Indiana woman was arrested after allegedly leaving a racist note on her new neighbors’ front door after they moved in with their bi-racial child.Howard County sheriff’s deputies arrested 63-year-old Deborah Cantwell on Thursday and charged her with misdemeanor intimidation and criminal mischief.Police also issued a protection order stating that Cantwell is not allowed to contact the family.According to police, on Oct. 13 the family found their new Greentown, Ind. home covered in toilet paper and a note on the door that said their bi-racial son was not welcome in the neighborhood.The mother of the child, Amy Pundt, started a GoFundMe “Raising money to fight a hate crime” to help pay for security and an attorney. Pundt posted a photo of the typed note she said Cantwell wrote.“No N—ERS wanted in this neighborhood – THIS IS A WHITE NEIGHBORHOOD – some people find N—ERS Stressful due to 33 years of NEGATIVE experience and it causes serious health issues,” Cantwell’s note said. “YOUR N—ER KID IS NOT WELCOME.”“YOU CAN SELL YOUR HOME AND MAKE MONEY ON IT RIGHT NOW,” the note added. “BY THE WAY HOPE YOU HAVE DEEP POCKETS.”Pundt said he was “crushed” by hatred and racism.“My bi-racial son. My CHILD was facing bigotry and hatred at a level I can’t even fathom,” Pundt posted on her GoFundMe. “JUST FOR THE COLOR OF HIS SKIN!! This destroyed his innocence. This destroyed a childhood. This even effected my other 4 kids!”“How do I tell my child that this was done? What words do I say to let him know it is not ok and this doesn’t represent this town, where everyone that meets him likes him?” Pundt’s post continued.According to a probable cause affidavit obtained by the Kokomo Tribune, Cantwell admitted to posting the letter when she was interviewed by police on Oct. 18.“I mean, the blacks get away with it every time,” she told police.“I was just trying to let them know that they weren’t really … welcome as far as us. … I just needed to let off some steam and it was the – I’m not a violent person so I didn’t think it was any big deal,” Cantwell added.Write to Gina Martinez at gina.martinez@timeinc.com."}