{"id": "Flooding Fears Prompt Continued Evacuations in Mexico Even as Hurricane Willa Dissipates", "paragraph": "MAZATLAN, Mexico (AP) — Emergency workers struggled to reach beach towns left incommunicado by a blow from Hurricane Willa on Wednesday, and the storm continued to force evacuations due to fear of flooding even as it dissipated over northern Mexico.There were no immediate reports of deaths or missing people, but the storm’s 120 mph (195 kph) winds damaged a hospital, knocked out power, toppled wood-shack homes and ripped metal roofing off other houses in the Sinaloa state municipality of Escuinapa.The state civil defense office said the hospital’s ceiling and some other areas were damaged in the city.The worst damage was expected to be in the handful of coastal communities that were cut off by road and without communications.Workers were trying to remove toppled power poles and trees blocking the road.In neighboring Nayarit state, Gov. Antonio Echevarria asked the federal government to send a helicopter, boats, rescue equipment, and said the state is trying to evacuate people in communities at risk of flooding.Before hitting the mainland near Isla del Bosque in Sinaloa Tuesday evening, Willa swept over an offshore penal colony about 60 miles (100 kilometers) out in the Pacific. Authorities declined to comment on precautions that were taken at the prison, citing security concerns, but said the safety of inmates was a priority.The U.S. National Hurricane Center said storm rapidly lost force and dissipated over northern Mexico Wednesday morning.It peaked as a Category 5 storm with winds of 55 mph (250 kph) over the Pacific on Monday.Still, concern about the rains led Durango state to say it was evacuating 200 people threatened by possible spills from the Santa Elena dam. In Nayarit, the fire department asked residents in villages around the Acaponeta river to “evacuate immediately” as the river rose to dangerous levels.Willa came ashore about 50 miles (80 kilometers) southeast of Mazatlan, a resort city that is home to high-rise hotels and about 500,000 people, including many U.S. and Canadian expatriates.Torrential rains began in the afternoon, and emergency officials said they had evacuated more than 4,250 people in coastal towns and set up 58 shelters ahead of the storm. Schools were ordered closed.As Willa neared, the beach in Mazatlan almost disappeared, with waves slamming against the coastal boulevard under looming black clouds. A few surfers enjoyed the big waves while the streets onshore were nearly deserted except for workers boarding up windows at hotels, shops and homes.___Associated Press writer Isabella Cota in Mexico City contributed to this report.Contact us at editors@time.com."}