{"id": "Socialism Was Once America's Political Taboo. Now, Democratic Socialism Is a Viable Platform. Here's What to Know", "paragraph": "As the 2018 midterm elections approach, the campaign season has come with its fair share of surprises. Among them is the phenomenon of primary-election success for members of the Democratic Socialists of America (DSA) — a situation that would have been extremely unlikely relatively recently, as socialism has long been considered a “dirty word” in American politics. In the post-World War II era, for example, only 15% of Americans wanted to see the country “go more in the direction of socialism,” according to a 1949 Gallup poll.But that phenomenon is a lot less surprising now than it was just a few months ago, thanks to political newcomers with DSA ties. The DSA has endorsed 62 candidates for local, state and federal office, most famously Alexandria Ocasio-Cortez, a 29-year-old who defeated a 10-term incumbent in the Democratic primary to represent the Bronx and Queens, and Julia Salazar, 27, who won a New York State Senate Democratic primary. And even though Sex and the City actor and activist Cynthia Nixon lost the Democratic primary for Governor of New York to Andrew Cuomo, she too succeeded in raising awareness for democratic socialism. If candidates like Ocasio-Cortez and Salazar prove victorious in November, that trend is likely to continue.But what exactly is democratic socialism?Here’s what to know about the DSA and how it got that way, as explained by two experts on its history: Maurice Isserman is a professor of History at Hamilton College and author of The Other American: The Life Of Michael Harrington, a biography of the founder of the Democratic Socialists of America; Michael Kazin is a professor of History at Georgetown University and editor of Dissent magazine as well as a former member of Students for a Democratic Society (SDS), a group associated with democratic socialism during the 1960s.While the idea of equalizing the distribution of wealth is an old one, the way of doing so dubbed “socialism” dates to the 19th century. The term generally refers to collectively-owned businesses and forms of government, in which workers and government entities have more control over the means of production and distribution of goods, versus the private ownership and free market that drives capitalism.American politicians today who are associated with democratic socialism generally favor New Deal-style programs, believing that government is a force for good in people’s lives and that a large European-style welfare state can exist in a capitalist society. They generally support ideas such as labor reform and pro-union policies, tuition-free public universities and trade schools, universal healthcare, federal jobs programs, fair taxation that closes loopholes that the wealthiest citizens have found, and using taxes on the rich and corporations to pay for social welfare programs. (Of course the Democratic Socialists of America website has a whole page on this very question, as do the campaign websites for Ocasio-Cortez and Salazar, as well as that of Senator Bernie Sanders, another prominent democratic socialist.)“What democratic socialists want is closer to what exists in Scandinavia or Iceland, expanding what Europeans talk about — a large welfare state in a capitalist society,” says Kazin. (That said, there’s some debate about whether those Nordic nations can really be considered social democracies anymore or whether they are more market-driven than most people think.)“[What they want] is not a violent overthrow of capitalism, but working within the system through legal and peaceful means [such as] electoral and social movements,” says Isserman.The DSA is the latest incarnation of a long-running socialist movement in America that dates back to the turn of the 20th century. The Socialist Party of America was established in 1901. Its best-known leader was Eugene Debs, the five-time presidential candidate and workers’ rights leader made famous by the Pullman strikes that helped inspire the creation of Labor Day.The party elected more than 1,000 candidates at the state, local and federal level before World War I. Its candidates ran against both Democrats and Republicans, but its life as a third party essentially fell apart when the group succumbed to internal divisions in the early 1970s. Ironically, some experts trace the problem to the popularity and visibility of the left that arrived with the 1960s and ’70s counterculture movements. Some organizations just weren’t able to handle the influx of interest and get everyone on the same page. Isserman explains how it stymied groups like SDS: “In 1965, SDS had 15,000 members. In 1968 it had 100,000 members, and it wasn’t entirely a good thing. All these people pour in bringing in new energy and ideas, [but it was] hard to say what [those ideas were]. By 1969, it had splintered into small and internally embattled factions.”When the DSA was founded in 1982 by Michael Harrington, who dropped out of Yale Law School to join the Catholic Worker Movement, it had lofty goals: it appeared to be an attempt to bring socialists together again after that earlier split, while incorporating the interests of the women’s movement, civil rights movement, gay rights movements and other social movements born in the ’60s, all while also acknowledging that socialism’s moment as a political party in America had passed. Its organizers believed it could be more useful as what some have called basically a lobbying group to the Democratic Party, pushing the mainstream liberal party further left. Harrington described his group’s stance as “the left wing of the possible” and he knew from first-hand experience that such influence could be powerful: the Great Society programs of Lyndon Johnson’s presidency were partly inspired by Harrington’s book The Other America: Poverty in the United States.His biographer Isserman, who is a member of the group, describes Harrington as a charismatic mainstream media pundit who came to be a go-to source on the subject: “Mr. Poverty as well as Mr. Socialism, the guy you went to to learn about poverty.” His death in 1989 marked the beginning of a long period of relative quiet for the DSA.The simple answer is that democratic socialists believe in a democracy, while communist forms of government are not democracies.“Democratic socialists believe in elections, the First Amendment — [they] want ordinary people to have more power in a more democratic system,” Kazin says. “In communist countries, the state controls everything and a small group of people control the state, a tyrannical system.”Confusion is understandable, however, because the USSR did stand for Union of Soviet Socialist Republics. But for context, here’s how Kazin explains when the distinction started to be made between socialism and communism: “All communists call themselves socialists because they want it on the way to pure communism.” But, he explains, the Bolshevik revolution in Russia in 1917 caused a split between those who identified primarily as communist and those who identified as socialist. In 1919, the Bolsheviks formed the Comintern (Communist International), an international organization of communist parties and groups. Those who wanted to follow in Russia’s footsteps joined, essentially declaring themselves communist, while others decided to stick with socialism.Get your history fix in one place: sign up for the weekly TIME History newsletterHarrington became one of King’s informal advisors after they met on a picket line protesting the 1960 Democratic National Convention in Los Angeles, and he helped the civil-rights leader write the manifesto for the Poor People’s Campaign.But King didn’t publicly identify as a member of an American socialist party.“You could certainly say King was privately [a socialist],” says Isserman. “Those beliefs stretch back to undergrad days at Morehouse, but for obvious reasons, [those beliefs weren’t public because] he didn’t want to add to the problems he faced in pushing through a civil rights agenda.” Many people think he became a socialist towards the end of his life, when he was pursuing the Poor People’s Campaign and focused on economic justice, but those ideas have been in some of his most famous speeches all along. “The March on Washington slogan was ‘jobs and freedom,’ in that order,” Isserman points out.Republicans have objected to many parts of DSA candidates’ platforms, especially, in recent years, the idea of “Medicare for all.” They argue that such a system of government-controlled national healthcare would be too expensive and would lead to rationing and less consumer choice.They point also to countries such as Zimbabwe, Nicaragua, and Venezuela as case studies for how socialism can go wrong, citing governments run by dictators and the seizure of private property. “Critics say the U.S. would be a poorer, less efficient society,” as Kazin puts it.These days, the Democratic Socialists of America boasts more than 50,000 members. That’s thanks in part to the presidential campaign of Sen. Sanders, who lost to Hillary Clinton in the 2016 Democratic primary. Kazin argues that Sanders’ decision to run as a Democrat who identifies as a democratic socialist (like Ocasio-Cortez and Salazar), rather than running on a third-party ticket, was key for exposure.“Bernie says ‘I’m a democratic socialist,’ people who have never heard of it Google it, and the DSA website comes up,” says Isserman. (Though Sanders identifies as a socialist he is not a DSA member.)But, he adds, one factor was more important than Sanders: time.By now, enough time has passed that, at least for younger generations, the “Cold War bogeyman,” as Isserman puts it, is gone. To many, the Soviet Union is no longer the evil empire, and socialism is no longer taboo. That means that, as younger people have looked for alternatives to politics as usual, the option of socialism has seemed viable. Isserman traces that impulse to the recession after the 2008 financial crisis, which opened a window for the DSA to appeal to millennials graduating with insurmountable college debt into an economy in which full-time jobs with benefits have been hard to land. And the Occupy Wall Street protesters, who camped out near the New York Stock Exchange in the financial district in Manhattan, made a key democratic socialist tenet — closing the wage gap — part of the national conversation by framing the problem as one of the 1% versus the 99%.Surveys show that, while not every socialism-linked candidate fared well in 2018’s primaries, feelings about socialism in the United States have become downright warm: A University Chicago survey of 18-to-34-year-olds, from this May, found that 61% of millennial Democrats “express favorable views toward Socialism.” One Gallup poll from a few months later reported that more Democrats hold “positive views” of socialism than of capitalism, at 57% versus 47%.But DSA members aren’t resting on their laurels yet.“This is the moment of DSA’s greatest opportunity, and it’s also the moment of DSA’s greatest peril,” says Isserman. “In the history of the American left, periods of great expansion led to collapse.”Write to Olivia B. Waxman at olivia.waxman@time.com."}