{"id": "Jewish Nurse Who Treated Suspected Pittsburgh Synagogue Shooter: 'I Chose to Show Him Empathy'", "paragraph": "(PITTSBURGH) — A Jewish nurse who treated the Pittsburgh synagogue shooting suspect says that he saw confusion but not evil in the man’s eyes, and that his own actions stemmed from love.“I’m sure he had no idea I was Jewish,” registered nurse Ari Mahler wrote in a Facebook post Saturday about suspect Robert Bowers, who was taken to Allegheny General Hospital after the Oct. 27 rampage at the Tree of Life synagogue in Pittsburgh’s Squirrel Hill neighborhood that left 11 people dead.Mahler described his role as “The Jewish Nurse” who treated the suspect, saying that he felt nervous about sharing his account but that “I just know I feel alone right now, and the irony of the world talking about me doesn’t seem fair without the chance to speak for myself.”“I didn’t say a word to him about my religion,” Mahler said in the post . “I chose not to say anything to him the entire time. I wanted him to feel compassion. I chose to show him empathy. I felt that the best way to honor his victims was for a Jew to prove him wrong.”An Allegheny General Network representative confirmed the authenticity of the post.Bowers, 46, pleaded not guilty Thursday to a 44-count grand jury indictment charging him with murder, hate crimes, obstructing the practice of religion and other crimes, for which he could face the death penalty. Authorities say Bowers raged against Jews during and after the massacre. He remains jailed without bail.Mahler, whose Facebook page noted that he started his job in the hospital’s emergency department March 1, said he didn’t see evil in Bowers’ eyes but “a clear lack of depth, intelligence, and palpable amounts of confusion.” He said he couldn’t go into detail about their interaction due to medical privacy requirements, but Bowers thanked him “for saving him, for showing him kindness, and for treating him the same way I treat every other patient.”He noted that this came from the same person accused of mass murder who “instilled panic in my heart worrying my parents were two of his 11 victims less than an hour before his arrival.”Mahler, who said that his father was a rabbi and that he experienced anti-Semitism “a lot” as a kid, said he acted out of love.“Love. That’s why I did it,” he said. “Love as an action is more powerful than words, and love in the face of evil gives others hope. It demonstrates humanity. It reaffirms why we’re all here. … I could care less what Robert Bowers thinks, but you, the person reading this, love is the only message I wish instill in you. If my actions mean anything, love means everything.”Contact us at editors@time.com."}