{"id": "Over 600,000 People March in London for a Second Brexit Referendum", "paragraph": "(Bloomberg)—People from across the U.K. gathered on a sunny Saturday afternoon in London to take part in what may be the biggest public protest over Brexit since the referendum in 2016.The march, which organizers said drew more than 600,000 to west London’s Park Lane, was called by People’s Vote, a group that’s campaigning for the the public to have a say on any final Brexit deal to prevent the ruling Conservative government from forcing it through Parliament.A summit of European Union leaders in Brussels this week, which had been slated to be the meeting at which an exit agreement would be struck, instead ended with major hurdles still to be overcome. As the March 29, 2019 deadline when Britain officially leaves the EU draws ever closer, the twists and turns in negotiations have the general public divided, investors and businesses anxious and the volatile pound weaker.“Some of the promises made two years ago, clearly have not materialized,” London Mayor Sadiq Khan said in comments posted on the group’s website before the rally. “Nobody was talking about a bad Brexit deal, nobody was talking about no deal whatsoever. The British public should have a say on whether they accept the outcome of those negotiations, with the option of staying in the EU.”Khan and Liberal Democrat leader Vince Cable were among those due to speak at a rally across the street from the Houses of Parliament as the march wound its way through the capital.The U.K. and EU have missed several deadlines to forge a divorce agreement, reinforcing the stance of so-called hard Brexiteers who argue that crashing out of the EU without a deal is preferable to yielding to the bloc’s demands. Pro-EU campaigners argue that the British public has been misled with false promises, and that a hard Brexit will leave everyone worse off.The negotiations so far have been “full of incompetence by the British government,” said one protester, Julie Sirvent, 35, a French national who works in oil and gas project management and has lived in the U.K. since 2014. “It’s been appalling how badly it’s being handled. I think I am at the point that anything I can do, so that the people have the final say, I will do it.”Prime Minister May is now said to be ready to drop one of her key Brexit demands on the contentious issue of the Irish border to clear the path to a deal, according to people familiar with the matter.London’s Fight to Remain a Financial Hub After Brexit: QuickTakeUntil now, May has insisted that a legal guarantee to ensure no new border emerges on the island of Ireland should be strictly limited in time, to avoid delaying the U.K.’s departure and to ensure the country is free from EU customs rules to strike its own trade deals.But the EU has rejected her stance and talks have been stuck for months, and now May and her team of Brexit advisers accept the EU’s point that it must be open-ended, for an “enduring” solution, one of the people said. The proposal is for the whole U.K. to stay tied to EU customs rules as a so-called backstop — or guarantee clause.While the proposal may be welcomed by the EU and businesses, May’s compromise may mean that Britain would end up bound indefinitely to the EU’s customs rules, which could spark a revolt within May’s own cabinet and throw her political future into doubt.Contact us at editors@time.com."}