{"id": "Former Vice President Joe Biden Says President Donald Trump Is 'Shredding' American Values", "paragraph": "(ELKO, Nev.) — The values that built America “are being shredded by a president who’s all about himself,” former Vice President Joe Biden said Saturday as the potential 2020 White House candidate and President Donald Trump held dueling rallies in Nevada weeks before Election Day.As early voting in the pivotal state got underway, Trump appeared in rural Elko, wrapping up a swing of Western states where he campaigned for Republican candidates, while Biden was several hundred miles south in Las Vegas at a union local.Biden, whose appearance ended shortly before Trump’s began, said the United States was founded “on an idea, the American idea, basic fundamental decency, and it’s being shredded.” He said values long admired by other countries helped the United States build “the great alliances in literally the history of the world” over the past 70 years.“But my God, think of what’s going on now,” Biden said, bemoaning that those values “are being shredded by a president who’s all about himself. It’s all about Donald.”Biden also called out congressional Republicans, saying that “because of gerrymandering and unlimited spending … are in fact choosing party over their country.”Trump was lending support for Dean Heller, considered the most vulnerable GOP senator on the Nov. 6 ballot as Republicans hope to retain their Senate majority.In a further sign of the state’s importance in the midterms, former President Barack Obama scheduled a stop Monday in Las Vegas.He won Nevada in his 2008 and 2012 campaigns, and Democrat Hillary Clinton carried the state by 2 percentage points over Trump in 2016. But during the last midterm elections in 2014, many Democrats stayed home and Republicans won key races across the state, which has a 29 percent Latino population.Trump has used his recent appearances in Montana and Arizona to try to frame the choices for voters in the upcoming election, contending Democrats are “too extreme and too dangerous” to take control of Congress. He has sought to focus on immigration as one of the defining election issues and has falsely accused Democrats of wanting “open borders” and encouraging illegal immigration.“Anybody who votes for a Democrat now is crazy,” Trump said.The country’s immigration system has long vexed politicians from both parties, and Republicans themselves have torpedoed near-compromises in recent years. Yet Trump tweeted Saturday that “we could write up and agree to new immigration laws in less than one hour” if Democrats “would stop being obstructionists and come together.”“Call me,” he told the Democratic leaders in Congress, Sen. Chuck Schumer of New York and Rep. Nancy Pelosi of California. It seemed reminiscent of the time last year when Trump cracked open the door of bipartisanship with those leaders, who emerged from a White House meeting to say Trump had agreed to work toward a deal on protection young immigrants. But no agreement came to pass.Trump’s Nevada visit was aimed at boosting Heller, whose opponent is Rep. Jacky Rosen as Democrats push to regain control of the Senate. Republicans hold a 51-49 edge now.In a tweet before leaving Arizona, Trump called Heller “a man who has become a good friend” and said he needed the senator’s “Help and Talent in Washington.”But Heller once had rocky relations with Trump and had returned a campaign donation from then-candidate Trump over Trump’s immigration rhetoric. Last year, Trump threatened Heller’s re-election chances when the senator held up GOP efforts to repeal the Obama-era health law. But Heller has since become an ally of the president, who has made two fundraising stops for him in Nevada this year already.Heller and Rosen held their first and only debate of the campaign on Friday. Heller accused her of making a visit to see separated families at the U.S.-Mexico border in order to stage a “photo-op,” while she described Heller a “rubber-stamp” for Trump, whose tax plan she said benefits the wealthy at the expense of the middle class.The Biden-Trump circling of one another in the same state happened recently in Kentucky, where Biden campaigned for a Democratic congressional candidate on a Friday night and Trump held a rally the next evening.Biden said in his appearance that “basic American values are under assault” and that the upcoming election was “bigger than politics.”Trump used his Kentucky visit to praise Senate Majority Leader Mitch McConnell for shepherding the Supreme Court nomination of Brett Kavanaugh through the Senate.___Associated Press writer Michelle L. Price in Las Vegas contributed to this report.___This story has been corrected to reflect that the GOP’s Senate edge is 51-49.Contact us at editors@time.com."}