{"id": "'This Is Surveillance.' Apple CEO Tim Cook Slams Tech Rivals Over Data Collection", "paragraph": "(Bloomberg)—Apple Inc. Chief Executive Officer Tim Cook lashed into Silicon Valley competitors that collect user data, equating their services to “surveillance,” provoking defenses by Facebook Inc. and Google of their advertising-based business models.The comments, given at an EU privacy conference in Brussels on Wednesday, come months after the bloc implemented strict new data protection rules and as Apple begins to mend a difficult relationship with the EU following a clash over 13 billion euros in allegedly unpaid taxes.In some of his harshest rebukes of his competitors yet, Cook sought to distinguish the iPhone maker from tech firms that collect large swathes of data, like Alphabet Inc.’s Google and Facebook, both under scrutiny for recent user data breaches.“We shouldn’t sugarcoat the consequences,” he said. “This is surveillance and these stockpiles of data serve only to make rich the companies that collect them. This should make us uncomfortable.”Cook has previously criticized the companies for basing their business models on harvesting personal information for advertising, while highlighting that Apple tries to collect as little of it as possible.“We at Apple believe that privacy is a fundamental human right but also recognize that not everyone sees it that way,” Cook said, referring to his competitors. “The desire to put profits over privacy is nothing new.”In a video message later streamed to the same conference, Facebook CEO Mark Zuckerberg defended the company’s advertising-based business model, saying it allowed its services to “be affordable for everyone.”“Instead of charging people, we charge advertisers to show ads,” Zuckerberg said. “People consistently tell us that they want a free service.”Speaking in person before the audience, Facebook’s Chief Privacy Officer Erin Egan said the company acknowledges that because its business model is based on processing people’s information, “that means we have more to do from a privacy protection standpoint.”Google’s Senior Vice President for Global Affairs and Chief Legal Officer, Kent Walker, echoed Facebook’s comments in a speech at the same conference, saying ads help deliver search to people of all income levels all around the world for free. He said the company believes its products can be made widely available and still be built with strong privacy protections.Cook also reiterated calls for federal privacy laws in the U.S., similar to those unveiled in Europe, called the General Data Protection Regulation.In the wake of those new rules, regulators and lawmakers in Europe and the U.S. have trained their eyes on Facebook and Google, particularly following revelations of potential user privacy violations.Facebook in September reported a cyber-attack that affected 30 million people, with hackers stealing intimate user information, including search results, recent locations and hometowns, in many cases. And after keeping quiet for months, Google in October said it found a “software glitch” in its Google+ social network in March that could have exposed the personal data of as many as half a million users.Despite criticizing their companies, Apple indirectly benefits from their business. Google will pay Apple as much as $9 billion this year for its search engine to be the default on many parts of the iPhone and other Apple devices, Goldman Sachs Group Inc. estimates.Apple has been in the headlines recently for security issues of its own following a Bloomberg report that Chinese spies used a microchip to infiltrate the computer networks of almost 30 U.S. companies, including Apple and Amazon.com Inc.Apple has vehemently disputed the report and said its servers weren’t compromised. In an interview with Buzzfeed News published last week, Cook called on Bloomberg to retract the story. Bloomberg in response said it stands by the story and is confident in the reporting and sources.Contact us at editors@time.com."}