{"id": "'Excelsior.' Celebrities Pay Tribute to Comic Book Legend Stan Lee Who Has Died at 95", "paragraph": "On Monday, the world learned of the passing of Stan Lee, the 95-year-old co-creator of many of Marvel Comics‘s most beloved franchises, including Spider-Man, the X-Men and the Incredible Hulk.Lee was remembered by a chorus of fans online, who thanked him for his legacy — of humanizing superheroes, creating indelible characters and, in the words of comedian Seth Rogen, “making people who feel different realize they are special.” Ryan Reynolds, Mark Hamill, Robert Downey Jr., Jamie Lee Curtis, Elon Musk and more paid tribute to Lee and his contributions to pop culture.One common phrase popping up in tributes to Lee is the term “Excelsior.” Even CNN’s Jake Tapper used the word “excelsior” in his Tweet honoring the late creative, while  Iron Man‘s Robert Downey Jr. hashtagged it in his post.“Excelsior” was Lee’s catchphrase, which he used to close out his comic book columns. He once explained to an interviewer that it was “one expression that they’re not going to know what it means, and they won’t know how to spell it,” since he didn’t want it to get copied by his competition. “And that’s where excelsior came from, and they never did take up on it, thank goodness,” he added.Of course, it is being taken up now as a way to remember the late, great icon.Besides his work as a writer and publisher for Marvel, Lee was also known for his memorable cameos in Marvel movies, where he would pop up to play a side character, becoming a cult favorite in front of the camera as well. “They say you should never meet a childhood idol. They are wrong,” Star Wars‘s Hamill wrote, calling Lee “revolutionary.”Damn… RIP Stan. Thanks for everything. pic.twitter.com/TMAaDJSOhh— Ryan Reynolds (@VancityReynolds) November 12, 2018Thank you Stan Lee for making people who feel different realize they are special.— Seth Rogen (@Sethrogen) November 12, 2018Rest in peace, Stan Lee. The many worlds of imagination & delight you created for humanity will last forever.— Elon Musk (@elonmusk) November 12, 2018Thank you Stan Lee. For your service in protecting our freedom and for your creativity and imagination! You were and will always be a SUPER HERO! pic.twitter.com/d1qpuImyzQ— Jamie Lee Curtis (@jamieleecurtis) November 12, 2018His contribution to Pop Culture was revolutionary & cannot be overstated. He was everything you hoped he would be & MORE. I loved this man & will never stop missing him. They say you should never meet a childhood idol. They are wrong. #RIPStanTheMan pic.twitter.com/6OKH07ahJg— Mark Hamill (@HamillHimself) November 12, 2018RIP, Stan Lee pic.twitter.com/HmMo3g2wmN— Jake Tapper (@jaketapper) November 12, 2018Stan The Man. #RipStanLee https://t.co/tDf7v2eexu— Questlove (In E flat) (@questlove) November 12, 2018stan lee created an entire universe for us before leaving this one. rip to a legend— MAJOR LAZER (@MAJORLAZER) November 12, 2018wow… super upset to hear the news about Stan Lee😞He was a huge inspiration of mine… He may not be with us anymore but his content and creativity will live forever.. RIP❤️— Jake Paul (@jakepaul) November 12, 2018And Stan Lee makes his cameo in the afterlife.Thank You Sir. May God have mercy on your soul. 🙏🏾— “DROGAS WAVE” NOW PLAYING (@LupeFiasco) November 12, 2018Write to Raisa Bruner at raisa.bruner@time.com."}