{"id": "A Crucial Senate Race in Tennessee Is Coming Down to the Wire", "paragraph": "Two years ago, Debbi Ross didn’t decide who to vote for in the presidential election until she was inside the polling booth. At that point, she prayed to God to help her decide whether Hillary Clinton or Donald Trump would be a better leader for the country.“I said, ‘Help me with this because I’m so torn,'” the Smyrna, Tennessee, resident recalled. “[Trump] was so rough … it was really hard to vote for him. But I did it.”Ross doesn’t regret her decision. She thinks President Trump has has made the country stronger. But this year, the grandmother of 12 made up her mind before Election Day. She’ll vote for Bill Lee, the Republican gubernatorial candidate. And she’s firmly behind Democrat Phil Bredesen in the state’s crucial Senate contest.“I really don’t like Marsha at all,” Ross told TIME Saturday of the Republican candidate, Rep. Marsha Blackburn. “I will not be voting for her.”This is the paradox at the heart of the tightest Senate race Tennessee has seen in more than a decade. Bredesen, a former two-term governor, has made the contest in this conservative state much closer than Republicans would like. If he wins, it will be because of people like Ross: moderate or conservative white women who live in suburban areas and still support the President.The battle between Bredesen and Blackburn has reportedly become the most expensive in the state’s history, with super PACs from both sides funneling millions of dollars into advertisements and voter outreach and mobilization. While Blackburn has an advantage, according to polling averages, a survey released on Friday from East Tennessee State University found that they were tied. Trump remains popular in this state, which voted for him by 26 points; A CNN poll released Nov. 1 found his approval rating at 53 percent there. But Blackburn is less so; according to that CNN poll, 53 percent of voters have a favorable opinion of Bredesen, and 48 percent for Blackburn.“Statewide, [Blackburn] has never carved a very popular figure,” said John Geer, Dean of the College of Arts and Science at Vanderbilt University and political science professor. “She’s not well-liked, even within Republican circles.” Geer noted Tennessee Republicans have for years gravitated towards more centrist Republicans, like Sens. Bob Corker and Lamar Alexander (and Howard Baker before them), as well as Gov. Bill Haslam, who demonstrated an ability to work across the aisle — something he says Blackburn lacks.Blackburn has hitched herself to Trump, who has held two rallies in the state this cycle and is returning for a third on Sunday. But the tightness of the race may have as much, if not more, to do with Bredesen’s own popularity than dissatisfaction with Blackburn or the President. Bredesen was Tennessee’s Governor from 2003 to 2011, and swept every county in the state when he was reelected to the post 12 years ago. He’s a moderate who supported Supreme Court Justice Brett Kavanaugh during his contentious confirmation hearings.“Bredesen is absolutely the best candidate they could have gotten,” said Tori Venable, the state director for Americans for Prosperity, the campaign arm of the billionaire Koch brothers’ political network. TIME spent the day door-knocking with Americans for Prosperity, which has poured more than $5 million into supporting Blackburn, in the Nashville suburb of Smyrna, as part of its get-out-the-vote effort. Smyrna is located in Rutherford County, which voted for Trump by 30 points in 2016. AFP isn’t the only outside group backing Blackburn: the Senate Leadership Fund, the super PAC aligned with Senate Majority Leader Mitch McConnell, has spent over $12 million here since Labor Day. (On the Democratic side, super PACs Senate Majority PAC and Majority Forward have collectively spent over $15 million.) There will undoubtedly be voters who are dissatisfied with Trump, and like Bredesen enough to vote for him. But whether that is what will determine the race is unclear. Some voters in Smyrna did express displeasure with Trump. But that dissatisfaction didn’t seem to be enough of a deterrent to vote against Blackburn. Those who were undecided seemed to be on the fence largely because of their respect for Bredesen.“I’m a conservative, so I lean to a more conservative record,” said Jerri Simmonds, who identified herself as a housewife when she opened the door of her red-brick home in Smyrna. But, she added, “I don’t mind crossing the party line if I think the person will do a better job.”Simmonds lamented the contentiousness of the race and the sniping between the candidates. But she was adamant when asked if that rhetoric could be traced to the President.“Anyone that thinks Trump’s brought it on is fooling themselves,” she said. “I don’t know that I’ve ever seen a climate where people are allowed to attack a sitting President so much. [President] Obama did get it bad, but nothing compared to what Trump has gotten.” Write to Alana Abramson at Alana.Abramson@time.com."}