{"id": "Secretary Pompeo Defends Sanction Waivers for Iranian Oil Purchases", "paragraph": "(Bloomberg) — Secretary of State Michael Pompeo defended the temporary waivers granted to eight countries to continue buying Iranian crude oil for now against Congressional critics and others who say the U.S. is being too lenient on the Islamic Republic.The comments on “Fox News Sunday” come a day before U.S. sanctions on Iran’s energy and shipping are due to snap back following President Donald Trump’s decision to withdraw from the 2015 multilateral nuclear agreement.“The president’s policy of maximum pressure will be fully in place come tomorrow,” Pompeo said during the interview. “Watch the Iranians. That’s who really understand the importance and the impact of the effort that we’re undertaking.”Pompeo said the U.S. moves have “had an enormous impact already.” Iranian crude oil exports have already been reduced by over 1 million barrels a day and will continue to fall, he added.Pompeo wouldn’t say if India and China are receiving waivers, or if they’d delivered commitments to stop their buying. Bloomberg reported on Nov. 2 that India, Japan and South Korea are among those approved, and that China is in discussions on terms but is among the eight, according to two people familiar with the discussions.The waivers are aimed at countries that “need a little bit more time” to get their purchases down to zero, Pompeo said, a comment consistent one made on Friday, when he said waivers were being given to importers who’ve made “important moves” toward shunning Iranian oil.The pressure group United Against Nuclear Iran, led in part by former Senator Joe Lieberman, lashed about the waivers, tweeting on Friday that the administration had “caved.”Widespread waivers granted under Iran sanctions. Whatever happened to maximum pressure? They caved. Big time. https://t.co/7AwO0hLH8W— UANI (@UANI) November 2, 2018Republican Senators Ted Cruz of Texas and Marco Rubio of Florida also took issue with the waivers.“Sanctions waivers being given to key purchasers of Iranian oil, most alarmingly China, give Iran a financial reprieve, and should be eliminated as soon as possible,” Rubio said in a press release on Friday. Cruz said it was important that “final policy imposes maximum pressure” on Tehran.Pompeo rejected the criticism.“No one’s going to argue that Secretary Pompeo is not tough on Iran,” Pompeo said on Fox, pushing back against those who want further sanctions on Iranian banking by saying that “the Iranian banks that engage in sanction able behavior will be sanctioned by the Department of Treasury.”In a separate interview on Sunday on CBS’s “Face the Nation,” Pompeo said hundreds of businesses have left Iran since Trump withdrew from the nuclear deal, and any European companies doing business there won’t do business with the U.S.“The whole world understands that these sanctions are real,” Pompeo said.On Friday, Trump said in a statement that the U.S. remains open to reaching a “new, more comprehensive deal” with Iran that blocks its nuclear-weapons program, saying Tehran faces a choice between “its destructive behavior” or “economic disaster.”The administration’s strategy is to punish Iran so severely that it’s compelled to negotiate a permanent end to its nuclear ambitions, as well as what the U.S. calls its “malign behavior” in the Middle East. In granting waivers, Washington is trying to ensure that global oil prices don’t spike, especially in the middle of the U.S. election season.Asked on CBS whether Iran could restart its nuclear program, Pompeo said, “We’re confident that the Iranians will not make that decision.”Pompeo also said economic sanctions on North Korea won’t be lifted until the country completely ends its nuclear program in a verifiable fashion.Contact us at editors@time.com."}