{"id": "New York State Sues Exxon Mobil for Misleading Investors Regarding Climate Change", "paragraph": "(Bloomberg) — A few months ago lawyers for Exxon Mobil Corp. stood before a judge and told New York’s attorney general to “put up or shut up” after investigating the company’s public disclosures about climate change, saying it should sue the company or move on. Today, New York chose the former.The state’s Attorney General Barbara Underwood sued the energy giant in state court in Manhattan, accusing it of misleading investors about how future regulations could impact the company’s finances. The suit culminated an almost three-year-long investigation that reached the highest levels of Exxon’s leadership.“Exxon built a facade to deceive investors into believing that the company was managing the risks of climate change regulation to its business when, in fact, it was intentionally and systematically underestimating or ignoring them, contrary to its public representations,” Underwood said in a statement.Exxon spokesman Scott Silvestri didn’t immediately respond to a message seeking comment.The Irving, Texas-based company in March lost a lawsuit in which it sought to have the investigation stopped. Exxon has long argued the case was politically motivated, having been coordinated behind the scenes with other Democratic-led states and environmental groups hostile to oil producer.The state in June accused Exxon of failing to comply with subpoenas for cash-flow projections reflecting how it used so-called proxy costs to calculate the financial impact on its assets from future regulations.New York said it wants to know exactly how the proxy cost for greenhouse gas emissions has been used in making investment decisions, corporate planning reviews, reserves estimates and evaluations for more than two dozen assets and projects.In August, at a hearing about the state’s subpoenas, Exxon’s lawyer Theodore Wells complained that the state’s investigation had dragged on for too long.“They should put up or shut up,” he told Justice Barry Ostrager. The judge agreed, saying the case “cannot go on interminably.”Manisha Sheth, a lawyer in Underwood’s office, responded at the time that the state’s investigators had “smoking gun” evidence.Contact us at editors@time.com."}