{"id": "Inmates Fighting California Wildfires Are More Likely to Get Hurt, Records Show", "paragraph": "Of the 9,400 firefighters battling the 240,000-acre California wildfires that have already killed more than 65 people and incinerated more than 12,000 structures, one group is at particular risk.It’s not the location of their deployment that makes them vulnerable, nor their levels of physical fitness.Roughly 1,500 prison inmates have stepped up in the last 24 hours to combat the fires as part of the California Department of Corrections and Rehabilitation’s (CDCR) volunteer firefighting program, called the Conservation Camp Program. For them, the dangers can prove disastrous—even deadly.More than 1,000 inmate firefighters required hospital care between June 2013 and August 2018, according to data obtained by TIME through FOIA requests. They are more than four times as likely, per capita, to incur object-induced injuries, such as cuts, bruises, dislocations and fractures, compared with professional firefighters working on the same fires. Inmates were also more than eight times as likely to be injured after inhaling smoke and particulates compared with other firefighters.Civilian firefighters had their own predominant risks, the data obtained by TIME shows. They were about nine times as likely to experience burns and about twice as likely to experience heat-related illnesses like dehydration. That is not surprising, given that they are the ones extinguishing the flames, while inmates reduce the likelihood that the fires will spread by clearing the thick brush nearby.No data is available to compare overall injury rates between inmate and professional firefighters.Some of the inmates’ injuries have been fatal.Three inmate firefighters have died as a result of injuries sustained in the Conservation Camp Program in the last two years. Between February 2016 and July 2017, a boulder crushed one inmate, a 120-foot tall tree crushed another and a third sustained a severe cut to his femoral artery.“The safety and security of all of our inmates is our top priority, and we provide top health care to the inmates in our custody,” Vicky Waters, a CDCR press secretary, told TIME. “Due to the nature of the work, and exposure to the elements, there are inherent injuries.”While the rate at which inmate firefighters experience certain injuries is higher, their pay is lower, compared to the full-time firefighters they work alongside. Inmates make only $2 per day taking part in the Conservation Camp Program. During an active fire, which has them working 24-hour shifts, they make an additional $1 an hour. California’s civilian firefighters make an average of $73,860 per year plus benefits while working the same shifts, according to the Bureau of Labor Statistics.That leaves inmates deciding whether to participate in the volunteer program with a tough calculation: will they benefit from doing something good that could help them get a job when they’ve paid their debt to society? Or will they end up with injuries that make it even harder to get back on their feet upon completing their sentence?Mathew Trattner, a 22-year-old who spent 17 months of his five-and-a-half year juvenile prison sentence working in the fire camps of the Conservation Camp Program in California, says he wasn’t surprised by the number of injuries among adult inmate firefighters. “Because we’re at a prison camp, they don’t necessarily pay attention to our physical needs as much as they do actual firefighters,” he says.When not fighting fires, inmates who take part in the Conservation Camp Program also work on community and conservation projects around the state.Trattner injured his shoulder lugging a 50-pound backpack and a 15-plus-pound saw while hiking up to 13 miles at a time. “I’d sit there at 2 o’clock in the morning and wake up and almost start crying because my shoulder was just in excruciating pain,” he says. Trattner’s treatment consisted of only of a few ibuprofen, he says. While inmate firefighters experienced 60 broken bones versus the nine incurred by staff firefighters from 2013 to 2018, Trattner says his shoulder was never X-rayed.Not all injuries are impact-related. At least 10 inmates contracted Valley fever while serving on a 198-member Fresno County fire work crew between July 2-5, 2017, a California Department of Public Health memo obtained by TIME shows. The illness, caused by inhaling fungal spores prevalent in some of the state’s soil can develop into serious diseases like pneumonia or chronic pulmonary infection. Four of the 10 inmates contracted pneumonia from the fever, one had the illness spread from their lungs to their bones, joints, brain or skin, and another had respiratory failure, which required “invasive mechanical ventilation.” Two of the 10 were hospitalized for up to three weeks, the memo says.And while the Department of Public Health’s investigation into Valley fever focused on inmate firefighters, it was only able to confirm two cases of Valley fever among staff firefighters in the same time span.Jim Liptrap, the acting superintendent of CDCR’s Pine Grove conservation fire camp, says that while officials take extreme precautions to prevent injuries such as the ones mentioned above, they aren’t necessarily indicative of higher danger levels among inmate firefighters. Instead, it is an issue of reporting, he says.“A full-time permanent paid firefighter on the CAL FIRE side isn’t going to [seek medical assistance] for a runny nose or a sore throat. He’s simply going to take a cough drop or a Tylenol or a Robitussin,” Liptrap says. Inmates don’t have that option. They must ask non-inmate staff for help with any medical issues that are impacting their work, and to receive over-the-counter medicine.Injuries are not the only occupational hazard, however. Environmental hazards, though usually not life-threatening, were common among the inmates. Nearly 80 of the 1,038 inmates who required hospital care had animal bites or allergic reactions to substances like poison oak and poison ivy. CAL FIRE did not provide the number of staff firefighters who needed hospital care for environmental reactions, but CDCR suggested civilian firefighters might be able to treat those injuries at home.Ramon Leija, 27, said he got a painful rash while working at a juvenile fire camp in Ventura, Calif., about eight years ago. “There were so many instances when we got poison oak and poison sumac allergic reactions and they would just give us some cream,” he tells TIME. “I got a really bad allergic reaction on my neck, and all they did was give me cream and told me to wait it out. I mean it eventually did [heal], but it was pretty excruciating pain given that your neck is where you turn and the scabs that were scabbing up would pull apart.”CDCR asserts that the safety of all firefighters is their top priority.“We want them to be safe,” says Tracy Snyder, a correctional captain with CDCR. “Inmate or free, it doesn’t matter. They are firefighters.”Notwithstanding the conditions, both Trattner and Leija say the always-challenging and often-dangerous work was still better than the alternative—sitting in prison cells waiting out their sentences. “[Some are] comparing it to modern-day slavery, and I do see that,” Leija said. “But at the moment, it’s the best place to be.”California’s conservation fire camp program was founded as a means of providing able-bodied inmates to support its firefighting crews during World War II. It’s supposed to be a reformative program, one that teaches incarcerated people skills that can help them succeed post-incarceration.“Our young men tend to have limited real-world job experience, so a benefit that they get here is learning the job skills that are necessary to work for an employer in the real world when they are released,” says Liptrap.The program was pitched to Trattner and Leija not only as a way to keep themselves busy, but, they say, also as something to tack on their resumes in hopes of gaining employment after prison. In reality, they found that getting jobs as firefighters—something they were already considered to be by the state of California—was close to impossible.Despite exiting the program with a minimum of one week’s worth of classroom training, one week’s worth of field training and four hours per week of advanced training, formerly-incarcerated crew members can have a hard time obtaining Emergency Medical Technician licenses, which are required by most of California’s 900-plus fire departments.Leija, who served his time for a robbery conviction, knows this struggle all to well. He’s been trying to get hired by a California county fire department since he finished his sentence.Regarding working in the camps, he says, “You’re not in a cell, you’re not in handcuffs or shackles or anything. You’re essentially free. That is the lucky part, but once you start analyzing the work that you’re doing and the treatment that you’re getting, and you try to transfer that out and get into an actual fire department—that is not necessarily happening.”In the years since, he says he’s passed introductory fire technology courses at a community college and sat through an EMT training course twice. Next, he transferred to a four-year college where he’s in his last year of a political science and education double major. While he says he was finally able to receive the national EMT certification and passed an exam on his first try, local counties still won’t honor it.In California, individuals convicted of felonies cannot obtain EMT licenses until they have been out of prison for 10 years, according to the California EMS Authority.But despite local fire departments refusing to hire him, Leija says they do let him contribute as a volunteer firefighter completing the same tasks.“It’s interesting that I’m able to do everything alongside the paid firefighters right now, from treating patients on the scene and also putting out fires and extricating patients from vehicles,” he says. “But when it comes to applying, I’m not offered the positions.”Katherine Katcher, the executive director of Root & Rebound, a nonprofit dedicated to helping inmates adjust to life outside prison, told TIME the system is flawed.“If you’re good enough to fight fires while you’re inside, you should be good enough to fight fires when you’re outside,” she says. “They’re doing the life-saving work, they’re earning the skills, and when they get out, they can’t do those jobs.”Working at the fire camps does have benefits. Trattner and Leija both say they appreciated that fighting fires got them outside and into productive roles. Additionally, working on fire lines can also reduce inmates’ sentences. CDCR said inmates can have their sentences reduced by two days for every day they participate.Trattner, who served his time for a murder conviction, says the tasks helped him develop a strong work ethic. He said you needed one to work at the camps. “Any job out here just seems so little compared to what I did at that fire camp. If I can go home after eight hours, and sleep, that’s a blessing,” he says. “Being on the fire lines for 48 hours, you didn’t get that.”Inmates benefit the state of California, too. Publicly available documents published by CAL FIRE indicate the crews perform more than 3 million hours of emergency response work each year. They also conduct “labor-intensive” project work such as clearing debris from streams, picking up litter along state highways and constructing hiking trails.California officials estimate the inmates save the state more than $90 million per year.Leija says that despite all the hardships, he was glad to do the work. Fighting fires while in California’s juvenile detention system helped him find purpose in life after making a mistake as a teenager nearly a decade ago.“At 17, you don’t really know where you want to go in life, but after given some time of isolation and reflection, when I transitioned out of the fire camp, my whole goal was to give back to my community,” he says.Now he just wishes California’s county fire departments would let him make a career out of doing it.Write to Abby Vesoulis at abby.vesoulis@time.com."}