{"id": "Matthew Whitaker's Appointment Is the First Big Test for House Democrats", "paragraph": "Democratic lawmakers won’t be sworn in until Jan. 3, but they’re already facing the first test of their new House majority: the future of oversight of special counsel Robert Mueller’s probe.After President Donald Trump announced he was appointing Matthew Whitaker as acting attorney general, key Democratic lawmakers swung into action, sending letters to Administration officials demanding answers and requesting that documents be preserved related to the decision.It was the sort of thing they’d done a lot while in the minority, but now those letters come with the veiled threat that they may force officials to testify publicly or subpoena documents that aren’t provided voluntarily when the new session of Congress starts Jan. 3.Those questions include why Trump fired former Attorney General Jeff Sessions, how Trump chose Whitaker and whether ethics officers advised Whitaker to recuse himself from overseeing Mueller’s probe due to negative comments he’s made in the past and ties to a key witness.Already, Senate Majority Leader Mitch McConnell has warned Democrats that aggressive oversight could amount to “presidential harassment,” a phrase Trump picked up on Monday to blame them for a stock drop that was actually caused by traders’ concerns of an imminent economic slowdown amid rising trade tensions.The prospect of Presidential Harassment by the Dems is causing the Stock Market big headaches!— Donald J. Trump (@realDonaldTrump) November 12, 2018In an interview Sunday, House Minority Leader Nancy Pelosi reiterated that Democratic use of subpoena power would be “responsible” and “strategic” and not “scatter-shot.”Within minutes of Trump’s tweet that he had chosen Whitaker, Rep. Jerrold Nadler, who is poised to lead the House Judiciary Committee, tweeted that Democrats would hold the president accountable for the decision. That night,Nadler, along with Reps. Elijah Cumming and Adam Schiff — the likely heads of the oversight and intelligence committees — and long-serving Democratic Sen. Dianne Feinstein sent a letter to top administration officials demanding that they preserve all documents related to Special Counsel Robert Mueller’s probe and the firing of Attorney General Jeff Sessions.When Pelosi convened all members of the Democratic caucus, both current and incoming, on a conference call last Thursday to discuss Sessions’ termination, Nadler emphasized that Democrats are prepared to hit the ground running and get to the bottom of what had happened; those letters, he told Democrats, were to designed to put the administration on notice.On Sunday, top Democrats sent another letter to Assistant Attorney General Lee Lofthus, the Justice Department’s ethics officer, asking if he or other ethics officials had advised Whitaker to recuse himself from overseeing the Mueller investigation.Before Whitaker joined the Justice Department as Sessions’ chief of staff, he had argued that Mueller was close to overstepping his boundaries, and tweeted that an article referring to the probe as a lynch mob was “worth a read.” Whitaker also chaired Sam Clovis’ campaign for Iowa state treasurer in 2014; Clovis, who was the Trump campaign’s national co-chairman during the 2016 campaign, has publicly confirmed he was questioned by Mueller.His attorney has also said he was the unnamed “campaign supervisor” mentioned in court documents for George Papadapoulos, who pleaded guilty last fall to making false statements to the FBI.The next step will start in January after the new Democrat majority takes office. If Nadler or other committee chairs want to question Whitaker about why he won’t recuse himself from the Russia probe, they can summon him to testify. If he doesn’t comply, they can subpoena him. They may not be able to force a recusal from the Russia probe or handpick Sessions’ permanent replacement, but they can hold Whitaker’s feet to the fire and make sure the public knows about it — changing the power dynamic in Washington, where Trump has been able to dominate cable news with his tweets and actions.Appearing on the Sunday talk shows for their first victory lap since their victory in the midterms, leading Democrats appeared ready to seize on this dynamic.“If [Whitaker] doesn’t recuse himself, if he has any involvement whatsoever in this Russia probe we are going to find out whether he made commitments to the president about the probe, whether he is serving as a back channel to the president or his lawyers about the probe, whether he’s doing anything to interfere with the probe,” Schiff told NBC News’ Chuck Todd on “Meet the Press” Sunday.“Mr. Whitaker needs to understand that he will be called to answer. And any role that he plays will be exposed to the public.”Write to Alana Abramson at Alana.Abramson@time.com."}