{"id": "One Absentee Vote Decided a Kentucky State House Race", "paragraph": "(FRANKFORT, Ky.) — Mary Beverly Goetz is 76, uses a walker and recently had surgery to remove a cancerous tumor. Worried her health issues would prevent her from voting for Democrat Jim Glenn in her western Kentucky state House district, she requested an absentee ballot by mail and sent it in weeks ahead of the election to make sure her vote was counted.Glenn won by one vote.“It made me feel good,” Goetz said. “It made you feel like your vote really counted.”As the nation watches election officials in Florida and Georgia painstakingly review results in high-profile Senate and governor’s races, many less prominent races across the country were decided by agonizingly close margins.Glenn’s victory in Owensboro, Kentucky, was one of six state House races decided by just a handful of votes. In District 27, Democrat Jeff Greer lost to Republican Nancy Tate by six votes. In District 96, Republican Jill York lost to Democrat Kathy Hinkle by five votes. In District 91, Republican Toby Herald lost to Democrat Cluster Howard by seven votes.And in Buckhorn, a coin flip allowed alcohol to be sold at a state park after an election there ended in a tie. It was at least the third time this year a coin flip had to decide a tied Kentucky election.All of the House races were upheld on Thursday by county boards of elections, when a review of results from voting machines did not change the outcomes.“I’ve had 25 people tell me they are the one person that voted for me,” said Glenn, who spent five terms in the legislature before he narrowly lost in 2016. “Whether it was one vote or one thousand, it’s a win. A win’s a win no matter how you count it.”The Kentucky State Board of Elections will meet next week to certify the results. But Republican Rep. DJ Johnson, who lost to Glenn, said he intends to ask for a recount. State law would require the majority-Republican House of Representatives to oversee that process by appointing a commission of between five and nine members.The legislature is not scheduled to reconvene until January. The GOP would have a 61-seat super majority if the results stand. Democrats would have 39 seats. Republicans won a super majority in 2016 for the first time in nearly 100 years, making the Kentucky House the last legislative chamber in the south to flip to GOP control.In the days since the election, Johnson says he has not investigated to find out if any of his friends and family members did not vote.“If someone came up and said that to me, I certainly wouldn’t hold them guilty,” he said. “I have fought that urge to second guess. I know I ran the best campaign I could.”Despite the lopsided results for Republicans, Goetz said she’s glad she voted for a Democrat.“I trust him. I’ve spoken to him myself. He seems to be an honorable person,” she said. “For a long time it’s been Republicans winning everything. I’m glad that he won.”Contact us at editors@time.com."}