{"id": "North Korea Is Operating at Least 13 Secret Missile Sites, Satellite Images Show", "paragraph": "(WASHINGTON) — U.S. analysts said Monday they have located more than half of an estimated 20 secret North Korean missile development sites, highlighting the challenge the Trump administration faces in ensuring that North Korea complies with any eventual agreement to end its nuclear and missile programs.The findings, which were released amid signs the administration’s negotiations with the North have stalled, draw on commercial satellite imagery and identify 13 secret facilities used to produce missiles and related technology. They suggest that Pyongyang is continuing its missile work, even though it has halted test launches in what President Donald Trump and his administration have claimed as a success since his historic June meeting with North Korean leader Kim Jong Un in Singapore.Although the sites are not launch facilities and in some cases are rudimentary, the authors of the report from the Center for Strategic and International Studies say they are hidden and illustrate the scope of the North’s weapons program and the country’s determination to conceal its military might.“The dispersed deployment of these bases and distinctive tactics employed by ballistic missile units are combined with decades of extensive camouflage, concealment and deception practices to maximize the survival of its missile units from pre-emptive strikes and during wartime operations,” they said.The authors say that the sites, which can be used for all classes of ballistic missile, therefore should be declared by North Korea and inspected in any credible, verifiable deal that addresses Pyongyang’s most significant threats to the United States and its allies.North Korea analysts not involved in the report said the findings were not surprising given Pyongyang’s past activities but were still cause for concern. They noted that Kim had not agreed to halt either nuclear weapons or missile development in negotiations with Trump or Secretary of State Mike Pompeo.“The fact that North Korea has continued to build nuclear weapons and ballistic missiles in the midst of high-level diplomacy with China, South Korea, and the U.S. should not come as a surprise,” said Abraham Denmark, the Asia program director at The Wilson Center. “Despite all the summitry, North Korea is just as dangerous today as it was a year ago.”“Improving relations with Pyongyang may be a laudable goal, but any claim that the North Korean nuclear and missile threats have been solved is either wishful thinking or purposefully deceptive,” he said.“Interesting but unsurprising report,” said Kelsey Davenport, director for nonproliferation policy at the Arms Control Association. “Kim Jong Un only committed voluntarily to halt long-range missile tests.”The report was released less than a week after North Korea abruptly called off a new round of negotiations with Pompeo that had been set for Thursday in New York. The cancellation, which the U.S. ascribed to scheduling issues, followed threats from North Korean officials to resume nuclear and missile testing unless U.S. sanctions are lifted.The administration has said repeatedly that sanctions will not be lifted until a denuclearization agreement is fully implemented.Contact us at editors@time.com."}