{"id": "Apple Made a Great New MacBook. But That's Not What It Wants You to Buy", "paragraph": "On October 30, at the Brooklyn Academy of Music, Apple CEO Tim Cook announced long-awaited updates to the company’s aging Mac mini and MacBook Air, along with a redesigned iPad Pro line. While the Mac mini received a primarily internal update, the MacBook Air received a pretty substantial refresh, with a high-resolution display, smaller footprint, and pair of Thunderbolt 3 ports replacing the older model’s input options. It’s sleek, sharp and comes in three colors. Mac fans might be glad one of the thinnest notebooks around is back, but it seems like Apple would much rather you pick something else – that something being an iPad Pro. The MacBook Air is certainly a capable machine, at least based on the spec sheet – along with the few minutes I spent with it. That 2560-by-1600 Retina display trounces the older model’s 1440-by-900 screen, and puts the thin and light notebook on par with the competition from companies like Microsoft and Lenovo. The large Force Touch trackpad feels great, the improved stereo speakers are incredibly loud, and the integrated Touch ID button makes staying secure and authenticating purchases pretty easy. It’s also thinner and smaller than the previous MacBook Air, and comes in space grey, silver, and gold. At the same time, the new MacBook Air is still lacking in a few departments that would make it a better competitor in the notebook industry. For one, the eighth-generation Intel Core i5 processor is your only option, an oddity compared to similar laptops that offer more powerful Intel Core i7 processors as an optional upgrade. There’s also the issue of it being a USB-C only device, eschewing both the popular MagSafe connector along with the convenient SD card slot. Apple killed other ports in favor of USB-C when it updated the MacBook Pro in 2016, so it’s to be expected. That knowledge doesn’t make dealing with dongles any easier. Consider this: Apple would much rather you purchase one of its new iPad Pro tablets, complete with the redesigned Apple Pencil, if you’re really committed to the future of computing. Compared to the new MacBook Air, the iPad Pro is already a few years ahead in terms of features. There’s no more Touch ID on the new iPad Pro, as it’s been replaced with a TrueDepth camera in the notch-free bezel for Face ID authentication. The brand new MacBook Air, on the other hand, integrates the Touch ID sensor found on the existing MacBook devices. What’s more, the MacBook Air’s 720p built-in webcam is abysmal in quality compared to the 1080p cameras found on similarly priced notebooks. Apple’s latest and most appealing features — like Face ID, Apple Pencil, even integrated cellular connectivity — are all on the iPad Pro. Its latest processor innovations, used to handle tasks like machine learning and augmented reality, are all exclusive to its iOS line of products. That vertical integration is appealing for a company that prioritizes control, and lets Apple potentially sidestep delays from partners like Intel, who have been reportedly struggling to produce its next-generation of processors. If it wasn’t clear as to where Apple was spending its time, it is now. Apple cemented this stance during the presentation, when it discussed the rise in iPad sales during 2018, announcing it outsold every PC manufacturer’s notebook sales. “This makes iPad not only the most popular tablet, but the most popular computer in the world!” Tim Cook exclaimed, an odd statement considering the timing. At an event that led with two updates to its Mac line — one of them being the company’s best-selling laptop — Apple comparing a tablet to the entire PC notebook industry telegraphs how Apple views, and has always viewed, its iPad: It’s a PC replacement. And if that’s the case, why buy a PC from them?Write to Patrick Lucas Austin at patrick.austin@time.com."}