{"id": "President Trump Visits Devastated Areas Impacted by Northern California Wildfire", "paragraph": "(PARADISE, Calif.) — President Donald Trump arrived in Northern California on Saturday to see firsthand the grief and devastation from the deadliest U.S. wildfire in a century amid confusion over how many people remain unaccounted for.Authorities confirmed a new death toll of 71 and say they are trying to locate 1,011 people , even as they stressed that not all are believed missing.California’s outgoing and incoming governors, both Democrats and vocal critics of Trump, greeted him when he landed at Beale Air Force Base just north of Sacramento and got onto a helicopter. Gov. Jerry Brown and Gov.-elect Gavin Newsom welcomed Trump’s visit, declaring it’s time “to pull together for the people of California.”The blaze that started Nov. 8 largely destroyed the town of Paradise, population 27,000, and heavily damaged the nearby communities of Magalia and Concow. It destroyed more than 9,800 homes and at its height displaced 52,000 people.Trump also was expected to stop in Southern California, where a wildfire recently killed three people and a gunman shot a dozen people to death at a country music bar in Thousand Oaks on Nov. 7 before killing himself.The fire zone in Northern California is to some extent Trump country. He beat Hillary Clinton by 4 percentage points in Butte County in 2016.But Trump has stirred resentment among survivors for blaming the fire on poor forest management in California, making the comments two days after the disaster on Twitter and reiterating them the day of his visit.“If you insult people, then you go visit them, how do you think you’re going to be accepted? You’re not going to have a parade,” Maggie Crowder of Magalia said this week outside an informal shelter at a Walmart store in Chico.But Stacy Lazzarino, who voted for Trump, said it would be good for the president to see the devastation up close: “I think by maybe seeing it he’s going to be like ‘Oh, my goodness,’ and it might start opening people’s eyes.”Firefighters were reluctant to weigh in on Trump’s visit, but some shared their thoughts.Nick Shawkey, a state fire captain from rural Northern California, said Trump’s visit was the mark of a good leader. But to imply the state was to blame for mismanaging the forests was based on a misunderstanding because much of the forest land in California is controlled by the U.S. Forest Service, he said.“The thing he’s tweeting about is his property,” Shawkey said.Paul Briones, a firefighter from Bakersfield, predicted Trump’s visit would be a huge boost to the community, showing “that this on a national level is a priority.”More than 5,600 fire personnel were battling the blaze that covered 231 square miles (598 square kilometers) and was halfway contained, officials said.Firefighters were racing against time with winds up to 40 mph and low humidity expected Saturday night into Sunday. Rain was forecast for midweek, which could help firefighters but also complicate the challenging search for remains.“It’s a disheartening situation,” Butte County Sheriff Kory Honea told reporters Friday. “As much as I wish we could get through this before the rains come, I don’t know if that’s possible.”The number of people unaccounted for grew to more than 1,000 on Friday. But Honea acknowledged the list was “dynamic” and could easily contain duplicate names and unreliable spellings of names.The roster probably includes some who fled the blaze and do not realize they have been reported missing, he said.“We are still receiving calls. We’re still reviewing emails,” Honea said. “This is a massive undertaking. We have hundreds and hundreds of people working on this.”Families searching for loved ones have scoured shelters and social media and say they understand the chaos of the situation, but the wait for information is agonizing.For one family, good news arrived by telephone.Monica Whipple said Friday that she was boarding a plane back to North Carolina when she got a call two days ago that her mother, Donna Price, had been found alive at a shelter.“It was so crazy, I started crying in front of everybody,” Whipple said.For too many others, the wait has ended with bad news.Sol Bechtold searched for his 75-year-old mother, Caddy, and provided DNA samples to authorities. As he drove back to his home in Pleasanton, California, he got a call from an officer and was told his mother’s remains were found in her burned-down home in Magalia.“It’s hard to realize your mother is gone,” Bechtold said.Contact us at editors@time.com."}