{"id": "The Movie Green Book Is Named for a Real Guide to Travel in a Segregated World. Its Real History Offers a Key Lesson for Today", "paragraph": "The object that provides the title for the new movie Green Book is a Jim Crow-era travel guide with extensive listings of hotels, restaurants, gas stations, shops and tourist facilities that welcomed black patronage. The book doesn’t actually get much screen time, but one small moment in the film shines a light on an oft-forgotten truth about the history of segregation in the United States: this was not just a Southern problem.The film tells a loose version of the true story of an unlikely friendship between Dr. Don Walbridge Shirley (played by Mahershala Ali) — an African-American polyglot, pianist and PhD — and Frank Anthony Vallelonga, known as Tony Lip (played by Viggo Mortensen), a nightclub bouncer. In 1962, Vallelonga was hired by Shirley’s record label, Cadence Records, to serve as the musician’s chauffeur and bodyguard during a tour, which included gigs in the Deep South. Despite the 1954 Brown v. Board of Education Supreme Court decision, which dismantled de jure segregation in public education, de jure and de facto segregation remained the order of the day in public accommodations throughout the nation. Consequently, while Vallelonga and the white members of the Don Shirley Trio, bassist Ken Fricker and cellist Juri Taht, had access to white mainstream public accommodations, Shirley remained confined by the limits of Jim Crow.To assist him in navigating this racial landmine, Vallelonga was provided a copy of what was informally known as the Green Book. Vallelonga is primarily concerned with the logistics of travel in the segregated South, and that’s where the movie spends most of its time, but the Green Book was a valuable safety resource for black travelers in every region of the country. In fact, its initial focus was New York City, where Shirley and Vallelonga both resided. As Shirley tells his chauffeur, he doesn’t have to leave home in order to experience discrimination.In 1930, New Yorker and social critic George Schuyler admonished those blacks “who could afford to do so” to “purchase an automobile as soon as possible in order to be free of discomfort, discrimination, segregation and insult,” which was part and parcel of public transportation. For certain, private motorists were shielded from public assault, police encounters notwithstanding — but blacks in cars still had to navigate the public landmines of restrooms, lodgings and eateries.Hence, Victor H. Green, an African American New York City mail carrier, first published The Negro Motorist Green-Book in 1936 to assist black motorists in finding safe public accommodations during their travels. Green’s publication became the Bible of black travel guides and was published annually until 1966.In the introduction to the 1949 edition, Green provided a historical overview of the first decade of the publication, noting that his ideas for his own publication had come from researching earlier African America travel guides that were out-of-print, as well as from the Jewish press, which “provided information about places that are restricted,” and from “numerous publications that give the genteel whites all kinds of information.” Green’s intended purpose for his guide was “to give the Negro traveler information that will keep him from running into difficulties [and] embarrassments.” Green admonished the black motorist to “Keep this guide in your car for ready reference.”In a 2010 NPR interview, civil rights icon Julian Bond recalled the importance of the Green Book during trips with his family while growing up. “It didn’t matter where you went — Jim Crow was everywhere then,” he stated, “and black travelers needed this badly. My family had a ‘Green Book’ when I was young, and used it to travel in the South to find out where we could stop to eat, where we could spend the night in a hotel or somebody’s home.”It would be easy to assume that the Green Book was just a Southern travel guide. But Green made no assumption that black people would only need his help while traveling in the South. Not only did the book include information about international travel, it also contained listings about areas in the country where segregation was less visible but no less felt. Indeed, the 1936 edition of the book was a 15-page pamphlet that focused on locales in the New York metropolitan area — where a substantial part of the book’s audience would have lived.Despite its multicultural and liberal reputation, New York City has a sordid racial history, which dates back to the colonial era.As Brian Purnell and Jeanne Theoharis have described for the Washington Post, racial animus in the Big Apple began with the colonization of Native Americans and importing of enslaved Africans in the 17th century. Despite gradual emancipation, which ended slavery in the state by the 1830s, and a strong abolitionist movement to eradicate slavery in the South, racial equality continued to be withheld from blacks New Yorkers. With the New York economy “wedded to slavery,” the years leading up to the Civil War were dominated by pro-slavery sentiment that lead to racial violence in the city in 1863 when Lincoln called for a mandatory draft.After the Civil War, New York mirrored the South as “black people . . . suffered from written and unwritten rules against racial mixing in marriage, public accommodations and housing.” New York maintained its policy of segregation during the decades following WWII by constructing “housing, parks, playgrounds, highways and bridges,” Purnell and Theoharis write, which “adhered to ethnic composition rules for urban planning,” leaving segregated neighborhoods and subsequently schools intact. In 1964, the year President Johnson signed the Civil Rights Act, which ended segregation in public accommodations and banned employment discrimination based on race, color, sex, religion or national origin, a New York Times poll showed that most white people in New York City believed that “the Civil Rights Movement had gone too far” in granting black demands for racial equality.Green made clear in the 1949 edition that he was optimistic about the future of the United States, if not the future of his book. “There will be a day sometime in the near future when this guide will not have to be published,” he wrote. “That is when we as a race will have equal opportunities and privileges in the United States. It will be a great day for us to suspend this publication for then we can go wherever we please.”The Green Book was discontinued shortly after its founder’s 1960 death, following a 1966-1967 Vacation Guide edition. That issue featured a statement assuring its patrons that the Civil Rights Act of 1964 was fact and not fiction. The struggle was finally over.But race still matters in the United States. As the incident at a Starbucks in Philadelphia — not in the South — demonstrated this year, the nation is still full of spaces like parks, swimming pools , golf courses, sidewalks, and parking lots that are not welcoming to black Americans. During that 2010 Julian Bond interview with NPR, a caller stated, “Well, I was thinking that this [The Green Book] might be a useful tool still today . . . because in some parts of the country, there are places where black people … dare not go.”Indeed, sixty years after The Green Book was discontinued, the search for black safety continues.Historians explain how the past informs the presentArica L. Coleman is a scholar of U.S. history and the author of That the Blood Stay Pure: African Americans, Native Americans and the Predicament of Race and Identity in Virginia and a former chair of the Committee on the Status of African American, Latino/a, Asian American, and Native American (ALANA) Historians and ALANA Histories at the Organization of American Historians.Contact us at editors@time.com."}