{"id": "France Fuel Taxes Protest Ends With 1 Dead and 47 Injured", "paragraph": "(PARIS) — One protester was killed and 47 others were injured during roadblocks set up around France to demonstrate against rising fuel taxes, a new challenge to embattled President Emmanuel Macron.The protester was killed when a driver caught in traffic accelerated in a panic at Pont-de-Beauvoisin, near Chambery, said Louis Laugier, the prefect, or top state official, in the eastern Savoie region. According to various French media reports, the protesters reportedly knocked on her car as she tried to take her daughter to a hospital. An investigation was opened.Police said that three of the 47 injured in separate incidents at the protests are in serious condition, according to the ministry. Officials said that 24 people have been detained and 17 held for questioning.The Interior Ministry said that around 125,000 protesters were involved in about 2,000 demonstrations around France.The Interior Ministry said security forces used tear gas in several places to unblock major routes, notably at the access road to the Mont Blanc tunnel where about 30 canisters were fired.Police at first held back protesters from advancing on Paris’ Champs-Elysees, with police vans blocking them from moving down the famed avenue. But up to 200 people were later seen walking down the street, apparently heading toward the Elysee presidential palace.Protesters, wearing yellow safety vests and dubbing themselves the “yellow jackets,” had pledged to target tollbooths, roundabouts and the bypass that rings Paris. The fluorescent yellow vests donned by the protesters must be kept in the vehicles of all French drivers in case of car troubles.The government sent in police to monitor tens of thousands of gathering points, some non-declared in advance and therefore illegal.The taxes are part of Macron’s strategy of weaning France off fossil fuels. Many drivers see them as emblematic of a presidency they view as disconnected from day-to-day economic difficulties and serving the rich. However, protesters and their supporters have voiced anger about other issues, too, including diminishing buying power.Robert Tichit, 67, a retiree, referred to the president as “King Macron.”“We’ve had enough of it. There are too many taxes in this country,” he told The Associated Press.Contact us at editors@time.com."}