{"id": "College Student Wins Halloween With Scary Bodysuit Costume Prank", "paragraph": "Sometimes, the creativity of one woman is enough to shock even the most Twitter-savvy. And Halloween is that time.Makayla Rose Martinez, a freshman at York College of Nebraska, has set the stakes pretty high with her scary bodysuit costume prank. “Best $40 I ever spent,” she captioned the compilation video, which showed Martinez scaring various students. Be warned: the costume is certainly not for the faint of heart.best $40 i ever spent 💀 pic.twitter.com/DFr7T31Lgs— makayla 🥀 (@makaylarose___) October 25, 2018Martinez is seen scaring different students while wearing the skeletal bodysuit — mostly by doing nothing but appearing in the costume, but other times by fully playing the character of this spooky skeleton, moving with an often-hysterical gait.The college student tells TIME she ordered the costume after she saw another viral video of it online. “Once [I ordered the costume] I wasn’t even planning on making a video, but the footage my friend captured was too funny to not post,” Martinez says.Her video of the prank soon became an internet sensation, naturally, garnering more than 175,000 likes and over 60,000 retweets.Martinez tweeted that she purchased the bodysuit online from The Spirit Store. So, if you, too, want to scare your peers this Halloween season, you’re in luck.Here are some of the best responses to Martinez’s prank from Halloween lovers far and wide.im dead OMG HAHAH you got into character so well 😂 https://t.co/zHa1L9U3rl— Judy (@judy_ngoc) October 27, 2018Make a part 2 please this killed me— Queen T👑 (@TaylorFraser_) October 27, 2018I'm at how you managed to climb over that pool table and all of that other stuff effortlessly— Ari is going to Japan 💜 (@YeontaNthusiast) October 27, 2018😂the fingers got me weak https://t.co/CAl5n2hHPL— Aleisha quinn🌸🌺 (@QuinnAleisha) October 27, 2018No lie.. I laughed so hard my laughs became gasping silence 😂 https://t.co/y38WAz1Qqu— Brittney Johnson (@baj12a) October 27, 20180:22 he was about to cluck her with the book 💀 https://t.co/d1cSWqls7f— 𝐇𝐞𝐧𝐧𝐞𝐬𝐬𝐲🥃🤸🏾‍♀️ (@playgirldom) October 27, 2018😂🤣😂🤣she wins Halloween https://t.co/wHfYM4zeTC— 🇭🇹milani🌻🖤 (@__milani) October 27, 2018 Write to Rachel E. Greenspan at rachel.greenspan@time.com."}