{"id": "Simone Biles Now Tied for Most Decorated Female Gymnast Ever After Winning a Fourth Gold at Worlds", "paragraph": "(DOHA, Qatar) — Simone Biles returned to training last November wondering if she could ever return to the form that made her an Olympic champion.She doesn’t wonder anymore. Neither does anyone else.The American star capped a remarkable 2018 world gymnastics championships by claiming gold on floor exercise and bronze on balance beam during event finals Saturday, giving her six medals for the meet and 20 overall in the world championships, tied with Russia’s Svetlana Khorkina for the most by a female gymnast.“I think there’s a lot to be proud, but I’m most proud of that I’m here, I made all the event finals, medaled in all of the events and I survived,” Biles said.Something that wasn’t a guarantee when the meet began. Biles spent the night before qualifying in the hospital dealing with pain from a kidney stone. The stone was too big to pass and she couldn’t take prescription pain medication because of doping regulations, forcing her to simply deal with it.Biles did more than deal with it. She dominated. Just like always.The 21-year-old will head home to Houston with gold medals from the team final, the all-around final, floor and vault as well as silver on uneven bars and bronze on beam. She became the first woman to earn a medal on all four events since Yelena Shushunova did it for the Soviet Union in 1987.Biles believes it’s just the beginning. She’ll visit with doctors to treat the kidney stone, go on a short vacation and then point toward 2019.“Hopefully I feel more confident next year going into all of the events,” she said. “We’ll see about upgrades. I’m not sure. We’ll see.”Biles finished a busy 10 days by drilling her floor routine, which includes intricate tumbling runs that are as difficult as anything done by the men these days. Though she stepped out of bounds on her third pass, her score of 14.933 was a full point better than that of teammate Morgan Hurd, who earned her third medal of the meet by finishing with silver. Japan’s Mai Murakami took third.Biles wasn’t quite as crisp on beam, an event that she’s struggled with recently. She wobbled during qualifying and fell off during the all-around finals. Though she managed to stay on during event finals, she found herself off balance on multiple occasions. Her score of 13.6 held up for bronze behind China’s Liu Tingting and Canada’s Ana Padurariu.While allowing it wasn’t her best, Biles took to Twitter in between beam and floor exercise to chastise those who criticized her for not winning gold. It’s a move she felt was necessary.“I think it’s upsetting to me whenever I see all the tweets after I do performances of how disappointed they are in me,” Biles said. “It’s not fair because they can’t set expectations on me. I have to set them for myself.”And no one’s expectations are higher. Biles took herself to task after the all-around, unhappy with a series of uncharacteristic mistakes. She vowed to redeem herself in the event finals and responded by reaching the podium on each event.“I’m really happy to be done,” Biles said. “Proud of my performances here. I wish some of them would have been better but I’m really proud of the outcome.”So was Hurd, who won a team gold, bronze in the all-around and silver on floor, validating her breakthrough performance at the 2017 world championships when she became an unlikely champion.“Oh, I wanted it so badly,” Hurd said. “Now I’ve got a full set.”Five-time U.S. champion and two-time Olympian Sam Mikulak picked up the first world championship medal of his career when he finished third in the high bar final behind Epke Zonderland of the Netherlands and Japan’s Kohei Uchimura, who boosted his career medal at worlds to 21.Mikulak will settle with having just one for now.“I made a statement to the world that Sam isn’t some washed-out gymnast that’s holding on,” the 26-year-old Mikulak said. “He’s here to play and he’s here to get medals.”North Korea’s Ri Se Gwang picked up his third world title on vault. Men’s all-around champion Artur Dalaloyan earned silver, with Japan’s Kenzo Shirai taking bronze. China’s Zou Jingyuan captured gold on parallel bars with a score of 16.433 — the highest on any apparatus by a man during the meet — while Oleg Verniaiev took silver and Dalaloyan bronze.Contact us at editors@time.com."}