{"id": "People Have Really Strong Opinions About Whether Candy Corn Is Gross or Not", "paragraph": "It’s only fitting that the day before Halloween would be National Candy Corn Day.Despite its controversial reputation, candy corn has become known as the de facto candy of the Halloween season. But that doesn’t mean people have stopped debating whether or not the multi-colored sugar kernels actually taste good.In honor of this year’s National Candy Corn Day, both fans and critics alike took to Twitter on Tuesday to share their opinions on the candy that continues to divide the country. “It’s #NationalCandyCornDay?” wrote a supporter of the October 31 staple. “I don’t care what anyone says. Candy Corn is DELICIOUS.”However, others had a strikingly different take on the matter. “I’d rather take a bite out of a scented candle than eat candy corn,” one vehement detractor tweeted.It's #NationalCandyCornDay? I don't care what anyone says. Candy Corn is DELICIOUS pic.twitter.com/UoTF4CiXEW— Emily Lippiello (@emilylippiello) October 30, 2018I’d rather take a bite out of a scented candle than eat candy corn. #NationalCandyCornDay #CandyCON pic.twitter.com/cvemUukSW7— Kevin Jeanes WXYZ (@KevinJeanes) October 30, 2018See some more responses below.Happy #NationalCandyCornDay .I like Candy Corn….the normal and the pumpkin kinds.If this a twitter follow deal breaker…goodbye.— Hollie (@FueledbyLOLZ) October 30, 2018Candy Corn is 🗑 always been 🗑 always will be 🗑#NationalCandyCornDay pic.twitter.com/j0OM5rE8JG— Reese Waters (@reesewaters) October 30, 2018The only way to eat candy corn #NationalCandyCornDay pic.twitter.com/7JVhMPAnWL— Ricky Smith (@Rickonia) October 30, 2018I’ll be off Twitter today. #NationalCandyCornDay— Tony Posnanski (@tonyposnanski) October 30, 2018So it is apparently #NationalCandyCornDay, can we all just agree that this \"candy\" needs to go away forever? Right @jimdonovancbs3? pic.twitter.com/WrievHvJFi— Matt Peterson (@MPetersonWx) October 30, 2018y’all out here celebrating Candy Corn?!? pic.twitter.com/HJB53n5YqF— lawrence. (@OutMiiMynd) October 30, 2018It's #NationalCandyCornDay this is where they all belong along with the people that like them 🤢🤮 pic.twitter.com/qm0RPZMxWX— 🖤🎶🎧 RK 🎡♥️🇺🇸 (@HeartEyes4Brady) October 30, 2018Candy corn is the best candy during spooky szn dont @ me— janina✨ (@janinuhh_) October 30, 2018Write to Megan McCluskey at megan.mccluskey@timeinc.com."}