{"id": "Why Politicians Are Texting You So Much — And It’s Only the Beginning", "paragraph": "Eleni Kounalakis, a Democrat running for lieutenant governor in California, is sitting on a couch in San Francisco, introducing herself to about one voter per second. Stylus in hand, she’s hosting a “text bank” with volunteers and using an app called Hustle to rapid-fire her platform — along with appeals for support — straight to voters’ cellphones. “You get my vote just for reaching out,” one texts back. “Yes it’s time for more women in power!” writes another. A third is less receptive: “Piss off you corporatist Clintonite establishment neoliberal bootlicker.” Kounalakis shrugs. “Opt out,” she says, tapping a button that takes the person off the campaign’s contact list.This is a scene playing out across America this election season, as text messages become a new favorite form of outreach for campaigns. In an era when the majority of U.S. households no longer have a landline, millions of people have cut the cord on cable TV and direct mailers are quickly recycled, texts can “cut through the clutter,” as one politico explains. Some voters prefer it. Others feel it’s an intrusion into one of the few sacred, ad-free spaces they have left. Campaigns are used to getting some texts back that are NSFW.Like it or not, this is the future, as businesses and nonprofits start embracing texts too. “I don’t want to say it’s inevitable,” says Daniel Souweine, CEO of a text-focused startup called Relay, “but text messaging is how people communicate.” Hustle, a trailblazer in the field, worked with about 100 campaigns in 2016. This year the number “will be in the thousands” by Nov. 6, says CEO Roddy Lindsay, who once worked as a data scientist at Facebook. By 2020, other insiders predict, texting may be one of the main ways campaigns reach out to voters.The databases are already being built. Among Hustle’s clients are most Democratic state parties. As is the Democratic National Committee, which earlier this year purchased the cellphone numbers of 94 million registered voters. “Campaigns are going to use whatever tools they have to reach people,” says Souweine, whose startup is one of many that help clients send thousands of texts per hour without running afoul of anti-spam laws.The left has been particularly aggressive in adopting it, having seen texts used to great effect by Bernie Sanders’ 2016 machine. “Peer-to-peer texting,” says Caitlin Mitchell, the DNC’s chief mobilization officer, “is a consideration of every campaign this cycle.”The appeal of the political text is multi-fold. Campaigns can start a conversation with voters without interrupting dinner. Sending a “cold text” is less awkward for volunteers. And while many door knocks don’t get answered, texts are a fast, low-effort way to deliver a message to voters in far-flung places. At Kounalakis’ text bank, about a dozen volunteers sent 10,000 texts to voters across California in less than an hour, swapping emojis with supporters as they encouraged people to vote early.But the main reason strategists think texts are so effective is the same reason many voters are upset to be receiving them: while we’ve come to accept a barrage of noise in our email inboxes and social-media feeds, the text message has largely remained a medium for personal, invited communication. That’s why an estimated 90% are read within three minutes of being received, according to marketing firm Mobilesquared.“With a text message, you know you’re firing it right into somebody’s pocket,” says David Grant, a 24-year-old libertarian in Maine who has gotten several unsolicited political texts this year and is not happy about it. “I will fight to the end of the earth,” he says, “to make sure my text messages don’t become my email.”Those who see the text appeal point out that some people will be annoyed no matter what form political advertising takes, whether they’re complaining that phone calls are insufferable or that door-hangers waste paper. “People would rather be communicated to in a text channel than bombarded other places,” says Gerrit Lansing, cofounder of Opn Sesame, a firm helping many Republicans with their texting campaigns this year. His platform uses a list of 17 words and phrases that automatically opt people out when they respond negatively. “You can’t really talk to the TV and tell [the ads] to turn off,” Lansing says.The FCC has helped ensure that someone is on the other end. In order not to violate anti-spam rules, a human being must press “send” on every unsolicited text. By auto-filling numbers, names and messages that are scripted by campaigns, tech firms have made quick work of the rest. (And an advocacy group called the P2P Alliance is angling to get assurance from the FCC that the status quo will remain.)Susan Morgan, a resident in California’s Marin County who started a chapter of the progressive group Indivisible, has been hosting text banks at her house to support a candidate halfway across the country. Beto O’Rourke, a Democrat running against Senator Ted Cruz in Texas, is working with Relay to operate one of the most ambitious texting efforts this season (which is why it’s easy to find kvetching about it online). There has been pushback as they’ve pinged voters on his behalf. “I one time got called something I had to Google,” Morgan says. But they also get lots of positive responses and questions. Overall Morgan estimates that 10% of texts start a back-and-forth.The social norms around text messages are shifting in an institution-friendly direction. A 2017 survey found that 55% of teens said they’d like college admissions officers to contact them via text, up from just 9% two years earlier. Even some who are initially turned off by political texts come around in the end. After Democrats used Hustle to turn out voters in Alabama’s recent special election, a woman named Katonya expressed weary gratitude to volunteers who had been contacting her: “Thank you all for harassing me because without it I probably wouldn’t have voted!!!”There is, however, a difference between a text that seeks to inform versus persuade. Debra Cleaver, founder of the nonpartisan Vote.org, has relied on texts to prod young people to register, remind voters where their polling places are and fight voter suppression by countering inaccurate information on the fly. But she says she’s seen the volume of political texts go up this year and the quality go down. While some organizations carefully target their texts to people who might be interested, others use a firehose approach.As she’s in the midst of expressing these concerns, her phone buzzes. It’s a text that says it’s from former House Speaker Newt Gingrich, asking for money for unnamed “conservative candidates” and offering an anonymized link. “As an organization that has actively pursued this,” Cleaver says, “you wonder how much longer it will be viable.”Venture-capital firms have poured tens of millions into platforms like Hustle. While that’s a strong vote of confidence, insiders also acknowledge that consumer outcry or a change in how the FCC interprets the law could upend the golden era of political texting just as it’s getting started.Back at the text bank, one of several she’ll hold between early October and Election Day, Kounalakis thanks voters for the kind words she’s received and doesn’t seem to sweat the others. In between texts, she says she herself has wondered how much people will put up with if text solicitation truly goes mainstream: “What happens when people just scream ‘Uncle’ because everyone is texting them?”For now, she believes it’s the most effective way to inform the most voters about her promises to fight tuition hikes and pursue equal treatment for women in the workplace. “Obviously it would be better if we could go door-to-door,” she says. “Our feeling is that this is the next best thing.”Write to Katy Steinmetz at katy.steinmetz@time.com."}