{"id": "Charleston Sewage Company Gets a Graphic Reminder of Why You Shouldn't Flush Wet Wipes", "paragraph": "(CHARLESTON, S.C.) — Divers spent two days deep inside a South Carolina sewer, pulling out huge balls of oily, black used wet wipes and baby wipes that had clogged intake pumps.The Charleston Water System posted pictures of the masses of wipes on its Twitter account. It reminded people that only human waste and toilet tissue should be flushed. The cloth wipes, which have rapidly become popular, need to be thrown away because they are woven and don’t break down in water.https://twitter.com/ChasWaterSystem/status/1051913118962597888“We made this pic low-res for your benefit,” the system said on Twitter.The system had to send in the divers nearly 100 feet (30 meters) into a sewer well after the wipes, congealed by grease and other items sent into the pipes, clogged the suction intake pumps to the Plum Island Wastewater Treatment Center on James Island.The divers couldn’t smell in their suits or see in the inky darkness. But as soon as they came back up, they got a bleach bath still in their suits.It just wasn’t wipes. The divers found pieces of metal, a baseball and less unusual items like tampons, string, hair, makeup pads and assorted paper, authorities said.A push to remind people that flushable wipes often aren’t flushable has helped some in the past few years, Charleston Water System Chief Operating Officer Andy Fairey told The Post and Courier of Charleston .But mostly, employees have found better ways to keep the balls of used wipes from clogging pipes and pumps, Fairey said.The problem with the pumps earlier this month actually happened because the system was trying to be proactive, reducing the water flow in sewage pipes to prepare for possible heavy rain as Hurricane Michael approached, Fairey said.But those rains never came, and the pumps pulled in clots of wipes that were lining the bottom of the pipes, Fairey said.Contact us at editors@time.com."}