{"id": "A Paradise Resident on Her Narrow Escape From California's Deadly Camp Fire – and Why Many Waited Too Long to Leave", "paragraph": "Wildfires are a normal part of life in the tight-knit mountain town of Paradise, Calif. Lisa Vasquez, 56, has lived in the town since she was 11, and says that although the town experiences a wildfire nearby about once a year, the fires had never threatened her home.Vasquez realized almost too late that the Camp Fire was different. By Monday, the Camp Fire had killed at least 29 people; incinerated 6,453 homes, including Vasquez’s; and left the entire town of 26,000 scorched. Vasquez says many of her family members are lucky to be alive because they waited until the last minute to make their escape.Some of Vasquez’s neighbors were not as fortunate. Authorities said many of the dead were found burned in their cars – caught by the raging fire as they tried to escape. Vasquez says many of her neighbors in the rural mountain town are elderly, have disabilities or do not own cars. She is afraid they did not make it out in time.Vasquez does not know how many of her friends died in the fire, but she fears the death toll will end up much higher than 29. About 225 people were missing as of Sunday night.“The death is so much higher than that,” Vasquez says. “I’m so sorry for my community. It’s going to be a ghost town, we’ve lost so many people.”When Camp Fire started about 6:30 a.m. Thursday, it was more than nine miles from Vasquez’s home. Strong winds and dry forests caused it to spread rapidly.By 9:30 a.m., Vasquez was still inside her house when she heard someone banging on her door. It was her ex-husband, Greg Woodcox.“He said, ‘There’s a fire, it’s coming so close. You have to get out,’” Vasquez says.Taking only her two dogs, she immediately got into her Jeep and drove to the end of her street on the edge of Paradise, Vasquez says. As she looked out, she could see the entire canyon on fire – and the flames were headed toward town.“I’ve lived through so many fires up there,” Vasquez says. “Damn this is a bad one.”She took off down the mountain in her Jeep and only stopped once she reached a utility truck near the base of the mountain. Above her, she watched as the slope and the town above her burned, she says.Vasquez credits Woodcox, her ex-husband, with saving her life – and the lives of some of her neighbors.But, she says, “there’s a lot of people on that road who are still missing.”She says Woodcox drove throughout the neighborhood, honking on his horn, screaming at people to leave and banging on doors. He later told her that he had stayed behind for such a long time that as the fire approached, he was forced to jump out of his car with his two tiny dogs in his arms.Woodcox escaped by following a fox through the trees and down into a ravine. He laid in the water as the fire passed above him, Vasquez says he told her.Woodcox’s nephew later posted a video on social media that his uncle had recorded during the fire. The full video shows the charred bodies of his neighbors inside cars after they died apparently trying to escape.Since her harrowing escape from Paradise, Vasquez has slowly been trying to piece together what happened to her friends and family. Cellphone service is spotty on the mountain, and the family has had to rely on Facebook messages and notices from the sheriff’s office to keep track of each other.A firefighter friend told Vasquez this weekend that her home was burned to the ground, Vasquez says. Many of her family members, including two of her brothers, also lost their homes in the fire.Her ex’s brother, Terry Woodcox, an Iraq war veteran who Vasquez calls her best friend, was forced to stay behind because his severely autistic son, Damion, refused to leave their home. Terry spent the last few days chopping down brush in an effort to help contain the fire.Vasquez is now staying at her niece’s home in the town of Grass Valley – along with her daughter and granddaughter, who were also displaced in the fire. She doesn’t plan to stay for long because she is desperate to return to her community.She plans to convene with her family in the city of Cisco, which stands at the base of the mountain, on Tuesday. She is planning to bring food and share resources with her family members.She hopes to return to Paradise soon to “assess the damage.”“I want to go back and see my community,” Vasquez says.Write to Tara Law at tara.law@timeinc.om."}