{"id": "'Fear is the Coward’s Way of Leadership.’ Michelle Obama Tells Oprah Why She’s Hopeful About America", "paragraph": "After two terms serving alongside her husband Barack Obama in the White House, Michelle Obama found herself with a little free time on her hands. The former First Lady isn’t one for idle hands, apparently, and used her new free time to write a memoir, Becoming. In advance of her highly-anticipated book hitting store shelves on November 13, she sat down with none other than Oprah Winfrey for an interview.The duo had a wide-ranging conversation for Elle magazine where they covered everything from Obama conquering her fears of making her private life public in the book, her over-achieving childhood, what she and Barack learned in couples counseling, and the simple pleasure of making cheese toast on your own.She also discussed the so-called birther conspiracy, stoked by Donald Trump, that her husband was not born in the U.S.A. and was thus ineligible to be president, for which she says she will “never forgive him.” Obama told Winfrey, “It was reckless, it put my family in danger, and it wasn’t true. And he knew it wasn’t true.”Perhaps most striking in these divisive times, though, is Obama’s ongoing optimism about the state of the nation. She is still hopeful in the future of America. “We have to feel that optimism. For the kids. We’re setting the table for them, and we can’t hand them crap. We have to hand them hope,” Obama says in the interview. “Progress isn’t made through fear. We’re experiencing that right now. Fear is the coward’s way of leadership. But kids are born into this world with a sense of hope and optimism. No matter where they’re from. Or how tough their stories are. They think they can be anything because we tell them that. So we have a responsibility to be optimistic. And to operate in the world in that way.” Contact us at editors@time.com."}