{"id": "Democrats Embraced #MeToo. But This Candidate Isn’t Running on It", "paragraph": "On a brisk Monday afternoon in Des Moines, a couple dozen volunteers gathered in Cindy Axne’s small Des Moines campaign office to kick off an afternoon canvass. They’re mostly older, mostly white, the type of people who have time to spare on a weekday in late October. Axne riled up the crowd by arguing that her opponent, Republican Congressman David Young, tries to pretend that the House GOP supports people with pre-existing conditions. “Not true!” the crowd shouted.Axne, a 53-year old small business owner who has worked for various state agencies, is the Democrat challenging Young in Iowa’s 3rd district. She’s one of a record number of first-time women candidates running for Congress to help Democrats take back the House in a year when issues surrounding gender and sexual violence have dominated national narratives. But like many female Democratic candidates in competitive or conservative-leaning districts, Axne is ignoring those hot-button debates and staying focused on the issues affecting the voters she’s trying to reach. Here in suburban Des Moines, that means she’s talking about health care coverage, affordable higher education, and rural jobs.This approach isn’t just a stark contrast to the national conversation among Democratic activists. It’s also a different approach than the one female Democratic candidates are taking in more liberal districts. Some of those women candidates have used their own #MeToo experiences to fuel their campaigns. Mary Barzee Flores, who’s running for Congress in South Florida, ran an ad last year about dealing with harassment and “handsy customers.” Ayana Pressley, who knocked off a 10-term Democratic incumbent in a House primary for her Boston-area district, puts “violence and trauma” near the top of her platform on her campaign website, highlighting her own experience as a survivor of sexual violence. In Michigan, gubernatorial candidate Gretchen Whitmer has talked repeatedly about her experience as a survivor of sexual assault.Axne could do the same if she wanted. Roughly 30 years ago, shortly after she graduated from the University of Iowa, she says she fought off a would-be rapist as she walked home from a night out in Chicago.“I noticed there was a guy behind me, and the next thing I knew I was shoved into an alley, and he was on top of me with a ski mask and a knife,” she recalls in an interview. “He said, ‘Don’t say anything or I’m really going to hurt you.'”Axne says she kicked and screamed and punched him with the keys she held between her fingers, and the assailant fled when people who lived in the apartment above the alley began to open their windows. “Had I not been 6 feet tall, had I not been carrying my keys between my fingers, had I not had that help from so many people who woke up and made sure that I was safe,” she says, “it could have been a different outcome.” She’ll talk about the attack when asked about it, and she’s done a few local TV interviews on the subject. But Axne hasn’t made her experience into a campaign issue, even though she’s running amid the #MeToo movement and less than a month after the controversy surrounding the confirmation of Supreme Court Justice Brett Kavanaugh. She hasn’t mentioned her assault in any of her advertisements or even alluded to it on Twitter. Instead, she’s focused on kitchen-table issues: protecting pre-existing conditions, making education affordable, and tax relief for the middle class.That may be a sound strategic decision. In interviews with more than a dozen Iowa voters outside an early voting location in suburban Urbandale, not a single voter or volunteer mentioned #MeToo as a motivating factor in this election. It’s yet another example of the chasm between national political narratives and the reality on the ground in key swing districts.“I had completely forgotten about it until you just mentioned it,” says Grant Woodard, a Des Moines lawyer and Democratic strategist, of Axne’s assault. “I think it just shows that all campaigns need to run on what they see as their local issues.” He added that President Donald Trump is not as toxic in Iowa as he is in some other parts of the country, so Democrats need to tread carefully to avoid antagonizing voters who support him. Axne is neck-and-neck with Young in the polls. Strategists say her success hinges on whether she can collect enough votes in Polk County, which contains Des Moines, to make up for the conservative-leaning rural counties in the rest of the district. A Democrat needs to win Polk County with a margin of about 25,000 votes to make up for the Republican-leaning votes coming from the rural areas, says Woodard. The most recent challengers to Young, who was elected in 2014, won the county by only a few thousand votes.It’s not clear whether drilling down on health care and jobs will be enough for Axne in a district that Young won in 2016 by roughly 14 points. Trump won Iowa by more than 10 points in 2016, and none of the voters interviewed outside an early voting location Oct. 29 who cast ballots for him then said they had since soured on the President. Still, Axne and Young are polling within the margin of error.“The question everyone in the Democratic party is asking themselves is whether what happened in 2016 in Iowa was a fundamental switch or whether it was an anomaly,” says Woodard. “The question that this election is really gonna show for Iowa is whether we’re purple or whether we’re red.” Write to Charlotte Alter at charlotte.alter@time.com."}