{"id": "Amid Skepticism, President Trump Praises Saudi Response on Jamal Khashoggi's Death", "paragraph": "President Donald Trump called Saudi Arabia’s removal of two top officials and more than a dozen arrests a “good first step” in response to the death of Saudi journalist Jamal Khashoggi, even as U.S. lawmakers from both parties expressed deep skepticism.Trump made the remarks Friday during a meeting with defense industry executives in Arizona, where he boasted about the deals he’s forged with the Saudis and reiterated his opposition to canceling what he says is a $110 billion deal for U.S. weaponry the Saudis intend to buy.“I think we’re getting close to solving a very big problem,” Trump said, adding that he found the Saudi explanation credible that Khashoggi died after an altercation. “I think it’s a good first step.”Saudi Arabia’s King Salman removed a key royal adviser and a senior intelligence official after the kingdom’s public prosecutor said an initial probe showed that Khashoggi was killed at the Saudi consulate in Istanbul. Eighteen Saudis have been detained in connection with the inquiry. The prosecutor said Khashoggi died after “discussions” at the consulate “developed into an argument.” A person with knowledge of the matter said Khashoggi died after he was placed in a chokehold after the dispute became physical.Turkish officials say the journalist was ambushed by Saudi agents, murdered and his body dismembered, when he went to the consulate on Oct. 2 to obtain documents for his marriage. The Saudis had previously said that Khashoggi had left the consulate unharmed.Saudi Arabia Says Khashoggi Killed as King Removes Top OfficialsAsked if he felt that Saudi officials had lied to him or top officials in his administration, Trump said he didn’t believe so.Republican and Democratic lawmakers, however, rejected Saudi Arabia’s account on Friday evening.“Saudi ‘explanation’ leaves most questions unanswered. Raises more questions. Makes no sense. Can’t be believed,” Republican Representative Peter King of New York, a member of the House Intelligence Committee, said Friday on Twitter.“You don’t bring 15 men and a bone saw to a fist fight with a 60-year-old,” Senator Jack Reed, the top Democrat on the Armed Services Committee, said in a statement. “And if he was accidentally killed in a fist fight, then where is the body?”Representative Mike Coffman, a Colorado Republican, said in a statement he posted on Twitter that “as a sitting member of the House Armed Services Committee and a Marine Corps combat veteran, our country must stand up for our values and demand our ‘allies’ respect human rights — I did not fight to have us look the other way.”Senator Rand Paul, a Kentucky Republican, agreed with Coffman in his own Twitter post, and renewed his call for a halt to U.S. arms sales to Saudi Arabia.And Senate Foreign Relations Chairman Bob Corker of Tennessee noted that the Senate has demanded an investigation by the U.S. government. He said in a statement that the Saudis “can undergo their own investigation, but the U.S. administration must make its own independent, credible determination of responsibility for Khashoggi’s murder.”Saudi Arabia enjoys far greater respect in the Oval Office than in the Capitol. Many lawmakers harbor a distrust of the kingdom dating to its connection to the Sept. 11 attacks. Its bloody involvement in Yemen’s civil war and interference in Lebanese politics have cost it further American support.Saudi Arabia’s leaders had promised the U.S. to reveal within days what happened to Khashoggi, who lived in the U.S. and wrote for the Washington Post, after he entered the Saudi consulate in Istanbul on Oct. 2 to retrieve a document for his wedding. He hadn’t been seen since.Trump has repeatedly pointed out that Khashoggi wasn’t a U.S. citizen and on Monday floated the notion that “rogue killers” may have been involved. The president admitted in an interview with the Associated Press on Tuesday that the idea had been suggested to him by King Salman.“It’s not the simplest situation to be in,” he said, and praised the speed of the Saudi investigation.Earlier Friday, Trump appeared to shift responsibility to Congress for the eventual American response. After praising lawmakers — including Republican Senator Lindsey Graham of South Carolina, who has sharply criticized Crown Prince Mohammed bin Salman over the episode — Trump said he is “going to have very much Congress involved” in determining the U.S. response.The president added that there were “other things” the U.S. could do that wouldn’t involve jeopardizing economic deals with Saudi Arabia. He said he hoped lawmakers would “see their way clear” to preserving the agreements.At the meeting with defense executives Friday, Trump addressed Boeing Co. Chief Executive Officer Dennis Muilenburg, referencing the arms sales to Saudi Arabia: “I assume you would like to keep those orders probably? But if you don’t, Boeing, Dennis, you can let me know.”Contact us at editors@time.com."}