{"id": "\n                Strong and Smart, Service Monkeys Give a Helping Hand to People With Quadriplegia\n              ", "paragraph": "It’s not easy to make friends with a capuchin monkey. They’re willful, mischievous and, if they take it into their heads, can break any breakable you’ve got in the house—no small feat for an animal that’s only about two feet tall and weighs just seven pounds.But if you do click with a capuchin, something deep and sweet can happen. That’s especially so with the monkeys of Helping Hands, in Boston, that spend much of their lives working with people with paraplegia and quadriplegia who need the daily assistance of a full-time aide to fetch objects, turn switches, open bottles and more, and will do the job for love, care and and the occasional lick of peanut butter—or hummus if that is more to their liking.Photographer Robin Schwartz recently visited one such well-matched team: Siggy, a 30 year old monkey; and Travis Amick, a 31-year old man with quadriplegia with some use of his arms, living in California, to observe their collaboration at work.Helping Hands, which works to raise, train and place capuchin monkeys with human partners got its start in 1979 as a graduate project at Tufts University in Massachusetts. In the decades since, the group—a nonprofit which relies on private donations—has grown and thrived, and currently has 120 monkeys in the program, all of which come from a closed breeding facility so that none are taken from the wild. Many of the monkeys currently in the program are already paired with humans; others are in foster homes where they’re initially raised and grow accustomed to being around humans. When they reach the right age, usually about ten years old, they are brought back to the Helping Hands monkey college—yes, that’s a thing—where they learn the work they will ultimately do.“Their education is all based on positive reinforcement,” says Helping Hands spokeswoman Angela Lett. “Trainers will ring a bell and say ‘good job’ when a monkey gets a skill right.” That’s also when the peanut butter or hummus are used.Matching up the right monkey with the right human is, Lett says, “similar to online dating.” One of the key variables is the extent of the human’s disability. The gross motor control Travis has retained in his arms allows him to care for himself in many ways that a person with complete quadriplegia couldn’t; just as significantly, he can handle Siggy and thus demonstrate his dominance clearly and physically. A person with complete quadriplegia requires the assistance of at least one other human in the home, and that means that the monkey has to accept two alphas and be content taking the third spot in the household hierarchy.“If we have, say, a quadriplegic woman whose husband is taking care of her, we want a very submissive monkey,” says Lett.Once capuchins do integrate into a human home, one of the things that makes them such effective helpmates is that in terms of muscle power, they punch above their weight. “Capuchins have a very high strength-to- weight ratio,” says Lett. “This allows them to do things like open drawers and doors.” They can also reposition a heavy human limb that has slipped from the footrest or arm of a wheelchair.What’s more, they have the smarts to make the best use of their strength and dexterity. Capuchins can learn not only to unscrew the top from bottles, but to insert a straw; they can also operate CDs and DVDs, and stand by patiently as a human reads a book and turn the pages when asked. They are also often adept at figuring out how to do things they have not been trained to do.“Shortly after Travis had Siggy, his wheelchair got stuck in a awkward reclining position and when he tried to call his sister for help, his cell phone dropped on the ground and the battery popped out,” says Lett. “Siggy collected both pieces of the phone and put the battery back in.”No monkey-human pair can last forever. Illnesses and complications from paralysis often claim people young—Christopher Reeve died of sepsis when he was only 52, just nine years after his injury. And even if the humans remain strong and healthy, the monkeys age out of the work. When they retire or a recipient dies, they return to live at the monkey college. Lett does not know if they experience grief or a sense of loss, but if they do, it’s eased some by coming home to so familiar a place.“Because they’re so hierarchical, they remember individuals,” says Lett. “They can determine, ‘Here are my favorite monkey friends from last time, here are the trainers I know, here are the new ones.'”Like many humans, a monkey that has worked hard gets the chance to retire well. Like humans too, they deserve it.Robin Schwartz’s photography often focuses on “animals and the people that are devoted to animals”. Her work has been published in books, multiple publications, and museums around the world. Follow her on Instagram.Helping Hands Monkey Helpers is a non-profit organization that helps adults with spinal cord injuries and other mobility impairments live more independent and engaged lives with the help of highly trained capuchin monkeys.Write to Jeffrey Kluger at jeffrey_kluger@timemagazine.com."}