{"id": "Angela Merkel and Other European Leaders Press for Facts About Jamal Khashoggi's Death", "paragraph": "German Chancellor Angela Merkel led a chorus of European leaders pressing Saudi Arabia to come clean about how and why government critic Jamal Khashoggi was killed.While U.S. President Donald Trump called the Saudi response and admission that Khashoggi was killed at its consulate in Istanbul a “good first step,” Merkel portrayed the “horrific events” surrounding his killing as a warning that democratic freedoms are under assault across the globe.“They still haven’t been cleared up and of course we demand that they be cleared up,” Merkel told a regional convention of her Christian Democratic Union party in eastern Germany on Saturday.Her stance was echoed across the region. The European Union demanded the investigation be carried out with more transparency, Danish Prime Minister Lars Lokke Rasmussen said he was unconvinced by Saudi Arabia’s account that Khashoggi died during “an argument” in the consulate, while France called the incident out as a murder and condemned it with “the utmost firmness.”“The fact that the Saudis last night confirmed that he died, after previously insisting he left the consulate alive, shows that we haven’t been told the full truth, and we must insist on getting that,” Rasmussen said in Copenhagen after talks with his Dutch counterpart Mark Rutte.Rutte and Rasmussen said they would back an investigation into the journalist’s death by the United Nations and other Western powers.In Washington, Senate Foreign Relations Chairman Bob Corker of Tennessee noted that the Senate has demanded a probe by the U.S. government. He said in a statement that the Saudis “can undergo their own investigation, but the U.S. administration must make its own independent, credible determination of responsibility for Khashoggi’s murder.”Former FBI Director James Comey weighed in on Twitter and blasted both the president and the Republican Party.The United States should be a shining light for the world, modeling a democracy that values truth, respects free press, protects human rights, and stands against murderers, oppression, and bigotry.  Trump and the Republican Party are dimming that light.— James Comey (@Comey) October 20, 2018Merkel, who grew up under communism in what was then East Germany, mentioned Khashoggi’s killing after evoking the legacy of the East German pro-democracy uprising that toppled the Berlin Wall in 1989.“Yet globally, these freedoms are anything but self-evident,” she said.With the EU under attack from populists, Merkel told her party’s delegates in the state of Thuringia that the CDU’s task is to stand up to nationalist forces that want to break up or weaken the European Union, including in next year’s European Parliament elections.“We see how others are trying to breach taboos, say things openly, throw everything into question,” she said. “We must never allow that. Thoughts turn to words, words turn into action and that leads to violence.”Contact us at editors@time.com."}