{"id": "Democrat Ohio Sen. Sherrod Brown Seriously Considering 2020 Presidential Run", "paragraph": "(CINCINNATI) — U.S. Sen. Sherrod Brown, one of the winningest Democrats in Ohio history, said Monday he is considering a 2020 presidential run.Brown had previously played down interest in joining what’s expected to be a crowded Democratic field. But he acknowledged in multiple interviews Monday he is listening to calls for him to run from national Democratic Party figures as well as other politicians and labor leaders.“I was hearing that a little bit (during) the campaign but not really paying much attention,” Brown said in an interview. “Now we’re … seriously looking at it.”Brown, who just turned 66, led all Ohio vote-getters Nov. 6 to win re-election to a third Senate term even as Republicans swept other key statewide offices.Brown said his election shows “a strong progressive” can win, calling his campaign “a blueprint for our nation in 2020.”Brown’s theme has been “the dignity of work,” and he said his message has resonated with voters, particularly in Ohio and other Midwest states Donald Trump carried in the 2016 presidential race.Brown has also been one of the top beneficiaries among all members of Congress of campaign contributions from lobbyists. He has long enjoyed support from labor unions.In an Oct. 12 rally in Ohio, Trump urged support for GOP Senate nominee and fourth-term U.S. Rep. Jim Renacci, who got White House encouragement to challenge Brown. Trump took note of Brown’s support of him on tougher trade deals.“In fact, I just want to think, ‘Is he a Republican?'” Trump said to the crowd. But Trump added, “He didn’t vote for tax cuts. He doesn’t vote for us, folks. It might be nice for him to say he agrees with my economic policy when he’s never going to vote for it.”Brown has been sharply critical of Trump on other issues including immigration and his divisive style.The Cleveland native won his first Ohio election in 1974 and has won 16 of 17.Brown says he will discuss 2020 with his wife and other family members before deciding “in the next couple months.”Contact us at editors@time.com."}