{"id": "Michelle Obama's 'Becoming' Is a Book America Needs, From a Woman It Does Not Yet Deserve", "paragraph": "When I first learned that Michelle Obama was writing a memoir, one word emerged from the depths of my gut: No!That reaction came from a protectiveness conceived on Nov. 4, 2008, in my childhood home in Jackson, Miss. The election results had confirmed the impossible — America was getting its first black president. My mom paced the house, shouting her thanks to God. My 90-year-old grandmother shed tears. Gunshots sounded in my neighborhood, which wasn’t unusual — but this time, they were followed by shouts of joy. I sat in front of the television in pure disbelief as I watched the four Obamas appear on stage, our incoming First Family and even more than that, our first black First Family.It was the kind of dream that I was sure I’d awaken from, or worse, the kind that would be stolen. I grew up knowing that America had a tendency to vilify those who represented me. America had a tendency of literally taking their lives. For eight years, as I feared the dream would come to a devastating end, I watched as everything from the First Lady’s facial expressions to her physique were used to either make her an “angry black woman” or insinuate that she wasn’t a woman at all. Racist caricatures of her were created for laughs, and racism veiled as political discourse tried to prove that the Obamas were “un-American.”But Becoming, Obama’s memoir, proves that her story is far more American than any of her detractors may ever realize. It is the perfect blend of the American dream and the American reality. As Obama herself has done, her book is breaking through. For weeks now, the memoir has been a news event. On its first day alone, it sold over 700,000 copies. And now that the book is out, it feels like a nation-wide celebration of a woman who was once ridiculed simply for existing. My reactionary no when I heard Obama was writing about her life really meant, please, don’t give them any more of yourself. They don’t deserve you. But one thing that Becoming quickly shows you is this: Michelle Obama does not let others define her, nor does she let them determine her actions.Becoming is inspirational without trying to be. From the first words, the very warmth that permeates its author emanates from the pages. Politics play more of a background role, fitting since Obama makes it clear that the antics of D.C played a huge role in her life, but were not and are not her life. Instead, the book is conversational and welcoming. At times, reading it feels like spending an afternoon in a sunroom with a friend who is sharing her life story. She ties memories from her youth to the events that come later, so that while the reader knows how her story will unfold, she still makes every new development satisfying. At times, her stories overlap so it’s hard to grasp the timeline, but her style makes those moments feel like natural asides. Most of all, even with this coziness, Becoming never shies away from the uncomfortable realities of what it means to be a black woman in America, and more specifically what it means to be the first black First Lady of America. Obama describes fond memories of her childhood in Chicago in such great detail that you feel as if you’re an honorary member of the Robinson family. But in the midst of those memories, she also discusses how white flight shaped her southside neighborhood and, in some ways, her childhood, creating an awareness that is forced on so many children of color at an early age; an awareness that would stay with her from South Euclid Avenue to Pennsylvania Avenue. Becoming shows how a black girl from a working-class family went on to thrive at Princeton, while still acknowledging the responsibility that many minority students feel to represent their entire race while attending such a prestigious institution. Even something as seemingly minor as speaking up in class carried the pressure of proving that she belonged. In this same vein, Becoming details the luxuries of living in the White House; the opulence and opportunities that very few are privileged to experience, yet Obama recognizes that for her family, the lens was zoomed in closer than on most. This balance is the heart of the book. This balance is the America I know and that so many marginalized people know. At times, inequality seems as American as apple pie. Yet even while addressing some of the ugly truths, Becoming is never grave. The book’s power is in its ability to instill hope and optimism while maintaining honesty. It is “When they go low, we go high,” in literary form. Becoming manages to be a coming-of-age tale, a love story and a family saga all in one. More importantly, this book is a reminder that America is still a work-in-progress, and that hope can be an action word if we allow it to be. Becoming is a balm that America needs, from a woman America does not yet deserve.Contact us at editors@time.com."}