{"id": "‘They Were the Yin and Yang of Each Other.’ Pittsburgh Says Goodbye to ‘Inseparable’ Brothers Gunned Down at Tree of Life", "paragraph": "Ronna Wedner’s voice broke as she recalled Cecil Rosenthal’s daily visits to her flower shop in the Squirrel Hill neighborhood of Pittsburgh.“Every day, it was, ‘Good afternoon, ladies.’ He would tell you how beautiful you were. Everyone was beautiful to him,” Wedner, whose family has owned the Squirrel Hill Flower Shop for about 70 years, tells TIME. “He was the happiest guy I knew.”Cecil Rosenthal, 59, and his brother David Rosenthal, 56, were among the 11 people killed when a gunman opened fire during a service at the Tree of Life synagogue on Saturday. Hundreds of mourners poured into the Rodef Shalom synagogue in Pittsburgh to pay their respects to the intellectually disabled men, who were adored in the community. Cecil, the more outgoing of the two brothers, was known for being a regular at the Tree of Life synagogue. Wedner says Cecil passed by her flower shop each day on his way to the temple.“I’d come to work in the morning and he would be there waving, and when I left at night he was standing there again, ready to go in for the evening service,” she says, going quiet. “It’s just, it’s sad. It’s sad how he was taken.”Wedner and her daughter, Katy Levin and nephew, Andrew Exler, waited in a long line of people that snaked around the block of Rodef Shalom as hundreds from the Pittsburgh area, and around the country, waited to honor the brothers. Despite the heavy emotion apparent, people reflected on the brothers’ lighthearted nature.Levin, who also works in the flower shop, says she was accustomed to seeing Cecil and David every day. She and Cecil had a playful relationship, with him often jokingly asking her for money.“They used to greet us. Cecil used to come in and ask me for a dollar,” Levin says. “I’d be like, ‘Cecil what are you doing?'”Numerous attendees at the funeral dubbed Cecil the “unofficial mayor of Squirrel Hill,” unafraid to go after what he wanted. He became a part of a Best Buddies chapter in 2005 when the organization shared a space with the disability services group Achieva, which helped and housed the Rosenthal brothers. “He said, ‘I’m going to be a part of this.’ He didn’t really ask,” says Bill Bailey, a volunteer DJ for Best Buddies who met Cecil more than a decade ago. “I think he just decided he was going to be a part of it. He was older than everybody else there.”A much quieter man than his brother, David Rosenthal was “fanatical about keeping things clean,” says Michael Hirt, Cecil and David’s brother-in-law, during the service. He was never one to leave a dish sitting unattended. Also a fan of law enforcement, David was particularly attached to his police scanner and very upset when it, at one point, broke. “David loved anything relating to the police or fire department,” Hirt says, noting that his brother-in-law started phone conversations by saying, ‘Michael, the police are looking for you.’”Despite his more introverted nature, David was remembered for having a keen sense of humor and being inseparable from his brother. “They were the yin and yang of each other,” Bailey says.Inside the synagogue, people gathered around the aisles, chatting quietly and comforting each other through tears. As seats in the sanctuary filled up, people lined up against the side walls and stood together in the back as services began. Diane Rosenthal, one of Cecil and David’s two sisters, delivered a eulogy while surrounded by some family, speaking to the nature of innocence both possessed. “Our brothers, Cecil and David were men. But as most people in the audience knows, we referred to them as ‘the boys,’” she said through tears. “Maybe this was because they were in a sense like boys, not hardened like men oftentimes become with age and experience.”Friends and family bid goodbye to Cecil and David on Tuesday, as less than two miles down the road at the Jewish Community Center, a service for Jerry Rabinowitz, a doctor who also who died in the shooting, was underway. Funerals for other victims have been scheduled through the rest of the week. The start of the funerals for the victims in the synagogue shooting comes as President Donald Trump visits Pittsburgh, a trip that has caused controversy within the community. While Tree of Life Rabbi Jeffrey Myers said on Monday that Trump is “certainly welcome” to visit, others have disagreed. By Tuesday afternoon, protestors mobilized near the synagogue in Squirrel Hill to speak out against Trump’s appearance. Jewish leaders with the Pittsburgh affiliate of the progressive group Bend the Arc said in an open letter that Trump is not welcome in Pittsburgh and that his “words and policies have emboldened a growing white nationalist movement.” Pittsburgh Mayor Bill Peduto, who asked that Trump postpone any visits until after the victims were buried so as not to use up security resources, will not be meeting with the president during his trip to the city. Allegheny County, where Squirrel Hill is located, supported Hillary Clinton in the 2016 presidential election, with 56% of voters. Houses throughout the area bear signs in support of Democratic Gov. Tom Wolf and others in the party running in the upcoming midterm elections. Bailey, who said he is quite politically active and previously served as the head of a local NAACP chapter, was not for Trump coming to town. “It’s about headlines,” said Bailey, who lives in Squirrel Hill. “This is not Trump country.”Write to Mahita Gajanan at mahita.gajanan@time.com."}