{"id": "As Election Day Nears, Concern Grows Over Absentee and Mailed Ballot Counting", "paragraph": "ATLANTA (AP) — Drawing on her years of military experience, Maureen Heard was careful to follow all the rules when she filled out an absentee ballot for the 2016 election.She read the instructions thoroughly, signed where she was supposed to, put the ballot in its envelope and dropped it off at her county elections office in New Hampshire. She then left town to return to a temporary federal work assignment in Washington, D.C.“I have learned over the years, many years in the military of filling out forms, how to fill out forms — and I was very intimidated by the process,” said Heard, who served in the Air Force and as a lieutenant in the U.S. Coast Guard. “I was like, ‘Oh my gosh, I have to make sure I get it absolutely right.’ And then it didn’t count.”Heard, 57, discovered last year that she was among roughly 319,000 voters across the country whose absentee ballots were rejected during the last presidential election. The reasons varied, ranging from missing deadlines to failing to sign their ballot.Heard’s ballot was tossed out because the signature did not match the one on file at her local election office.More people than ever are returning their ballots by mail or dropping them off at a local election location rather than voting in a booth on Election Day. Those developments make it easier to cast ballots and are designed to boost turnout.The trend also is raising concerns about whether voters can be assured their ballots will count or be notified in time if there is a problem. Voting rights activists want to ensure that voters are given a reasonable chance to fix any problems.Earlier this month, the ACLU and other groups filed lawsuits in Georgia after an Atlanta-area county reported a comparatively high rate of rejected absentee ballots during the start of early voting. Those actions followed similar lawsuits in New Hampshire and California.“It’s hard to see what is missing,” said Kim Alexander, president of the California Voter Foundation, which advocated for changes to California law. “People are all focused on what is the vote count. They are not focused on what ballots weren’t counted.”Nearly one of every four ballots cast in 2016 came through the mail or was handed in at a drop-off location, according to the U.S. Election Assistance Commission. The commission’s data show that 99 percent of completed absentee and mailed ballots are eventually counted.Election officials use signature matching to verify a person’s identity, but advocates say many election offices lack training and standards. Matching signatures is particularly fraught because a person’s handwriting can change over time and be affected by age or disability.In August, a federal judge ruled that New Hampshire’s signature-matching process was “fundamentally flawed” because voters are not given notice if it’s the reason a ballot was rejected. She also said the election office workers inspecting the signatures did not receive training in handwriting analysis or signature comparisons.“For the most part, signature variations are of little consequence in a person’s life,” U.S. District Judge Landya McCafferty wrote. “But in the context of absentee voting, these variations become profoundly consequential.”A judge in California sided with the ACLU in a similar lawsuit in March.Last month, California Gov. Jerry Brown signed into law the “Every Vote Counts Act,” which requires local election officials to notify voters of mismatched signatures at least eight days before election results become certified. Voters then have several days to resolve the issue.In Georgia, the ballot rejections in Gwinnett County were running well ahead of the other large counties ringing Atlanta. Gwinnett County had rejected 9.6 percent of all absentee mail ballots as of Oct. 12, while DeKalb County had rejected 1.9 percent and Fulton County had rejected none, according to court filings.Candice Broce, spokeswoman for the secretary of state’s office, said state officials were aware of the concerns and opened an investigation.Georgia law requires voters to be told “promptly” of a problem, but does not specify a time period. In Gwinnett County, this means sending a voter notice in the mail within three days, according to county officials.Voters who are notified of a problem can request a new ballot or vote in person, but the law does not provide time after the election to resolve the problems. That potentially affects voters who drop off their ballots on or near Election Day.A federal judge ruled last week that Georgia election officials cannot reject ballots for a signature mismatch without providing voters an opportunity to verify their identity; they would have almost a week to do so under the ruling. The state plans to appeal.“We’re not attacking signature-matching as a way to do something, as a tool for confirming identity,” said Sophia Lakin, a staff attorney with the ACLU. “We are concerned about making sure that it’s not something that prevents someone from voting. It all depends on how it’s being implemented.”Three states — Colorado, Oregon and Washington — send ballots in the mail to all registered voters.Oregon allows voters 14 days after an election to resolve a signature mismatch and provides training to local election officials about how to verify signatures.Part of the training includes an acknowledgement that signatures can change over time, said Nancy Blankenship, clerk of Deschutes County in Bend, Oregon. Any time voters correspond with her office, their signatures are added to their file so election workers have a history of signatures to use for comparison.___Associated Press writer Kathy McCormack in Concord, New Hampshire, contributed to this report.Contact us at editors@time.com."}