{"id": "House Republicans Are Facing a Brain Drain of Legislative Leaders", "paragraph": "For all of the firsts coming to Washington when the Democratic House members-elect arrive here this week for orientation, there may be an equally significant seismic shift among Republicans’ lasts.Fifty Republican House members decided to call it quits this year, opting to pursue other political gigs or just retire rather than face a potentially bruising re-election. On top of that, at least 25 incumbent House Republicans who ran appear to have come up short. That’s led to something of a GOP brain drain atop committees; through retirements or losses, at least 39 current GOP chairs of committees or subcommittees won’t be in Congress next year.Think it doesn’t matter that the Republican who led the House Education and Workforce’s Subcommittee on Early Childhood, Elementary and Secondary Education is gone? Consider that laws that begin in that committee give the authority for almost every federal regulation in K-12 schools in the country. Rep. Todd Rokita stepped down to run for Senate unsuccessfully in his home state of Indiana.Republicans lost their majority in the House but now seem to be watching some of their sharpest legislators head to the exits. It’s obvious throughout the Capitol.Of the 25 major committees, all but seven lost at least a chairman or subcommittee chairman, roles that in the minority become ranking members tasked with keeping the new Democratic majority in check. Few Americans knew that Kansas Rep. Kevin Yoder was the chair of the Appropriations Committee’s Subcommittee on Homeland Security — or even cared the role existed. Still, it fell to Yoder to shepherd this year’s 54-page, $47.7 billion spending proposal, and the $5.3 billion increase it included, into law. Yoder, however, was defeated by Sharice Davids, a former mixed martial arts fighter who will be one of the first Native American women elected to Congress.Some lawmakers faced term limits with gavels, like Appropriations Committee Chairman Rodney Frelinghuysen of New Jersey and Financial Services Chairman Jeb Hensarling of Texas. (Internal Republican rules limit members to three consecutive terms as chairman or ranking member, although exemptions can be — and have been — made. Democrats do not follow such a revolving door philosophy to guarantee newer members have a chance to lead.) Others, like Rules Committee Chairman Pete Sessions, were caught off-balance by their Democratic challengers. Rep. Mike Coffman of Colorado was in one of the toughest re-election bids in the country, and his experience chairing the Armed Services Committee’s panel on Military Personnel won’t be coming back.All of this means the new GOP minority will be heading into 2017 looking even more than usual at the party leadership, which is picking its first round of sherpas on Wednesday. Current House Speaker Paul Ryan decided to be among the 50 lawmakers not seeking re-election, clearing the way for his deputy, Kevin McCarthy of California, to take his place atop the GOP pecking order.McCarthy, an affable lawmaker who has a warm relationship with the White House, told reporters last week that he has the votes to become minority leader.McCarthy, however, faces a challenge from Rep. Jim Jordan, a rabble-rousing Ohioan who also counts President Donald Trump an ally and who helps guide the far-right Freedom Caucus. Trump made clear earlier this year that he was supporting McCarthy, but Trump also feels burned by a $1.3 trillion spending bill Congressional Republicans sent him this summer that drew the ire of fiscal conservatives. Trump, facing a government-funding deadline, signed it but seethed at the likes of Ryan and McCarthy.McCarthy is expected to win his caucus’ nod to lead it, but his few detractors note he’s been up for the post before and come up short. But with so many fewer Republicans in the mix, the potential for shenanigans may be lower, especially among lawmakers who see many available gavels that can be doled out by a Steering Committee that is still in formation.Rep. Steve Scalise, a Louisianan currently serving as Majority Whip, is expected to slot easily into the minority whip role in counting votes for the party. And Rep. Liz Cheney of Wyoming, a senior official in the George W. Bush-era State Department and daughter to former Vice President Dick Cheney, is in line to take over party messaging and media operations as the Republican Conference Chair. Both are unopposed at the moment.For those members who do remain, many will be drafted into service as ranking members on committees or subcommittees. After all, if the current administrative structure of the House remains the same (and it likely won’t, to be honest), there will be 127 roles in the GOP minority that need filled to administer day-to-day management of the legislative branch. As of Monday afternoon, a projected 198 Republicans would form the GOP caucus next year.With a caucus this small, there’s little room for deadwood.Write to Philip Elliott at philip.elliott@time.com."}