{"id": "Raiders News: TE Lee Smith Calls Derek Carr Criticism a 'Joke' and 'Laughable'Related", "paragraph": "Amid recent criticism of Derek Carr and reports suggesting he has lost the locker room, Oakland Raiders tight end Lee Smith has come to his quarterback's defense (h/t ESPN's Paul Gutierrez).Raiders TE Lee Smith comes to Derek Carr’s defense: “Attacking him as the leader on this football team is a joke.”\n\n(via @Bookerc94)\nhttps://t.co/OGmSTzOvBl\"Attacking him as a leader on this football team is a joke. I hope everyone hears me loud and clear what a joke it is. It's frustrating, it's annoying and it's laughable and not fair to him when it is obviously not coming from inside this locker room. \"Anybody can say whatever they want. Coach (Jon) Gruden and Derek are going to take all the bullets. We are 1-5, not playing the football we want to play. Coach Gruden had a lot of expectations coming, we had a lot of expectations coming in. I understand those two guys take most of the bullets. Those two can definitely handle it. If anybody can handle it, it's Derek Carr, based off the person he is and the character he has.\"This comes just two days after The Athletic's Marcus Thompson II reported Carr has a \"fractured relationship\" with his teammates and \"confidence in him has waned.\" Per Thompson, the fifth-year passer came under fire when film \"showed what looked like him crying after being sacked and injuring his arm.\"Despite Carr being signed through the 2022 campaign as the result of a five-year, $125 million contract, Thompson reported there are \"whispers\" within the Raiders organization that the 27-year-old signal-caller is not the future in Oakland (or Las Vegas).Carr took to Twitter on Tuesday to respond to the report of turmoil in the locker room:I’m a Raider. It’s not a “popular” thing to be a Raider right now, but I am and I love it. I love the struggle of trying to fight back for our city when not a lot of people believe in us. People can try all they want to tear us apart, but it’s not happening to the real ones. 💀There has been no shortage of drama in the Bay Area this season. Former first-round picks Khalil Mack and Amari Cooper have both been traded away in Jon Gruden's first year back on the job, with the former holding out during the offseason as he attempted to secure a long-term deal. Ultimately, though, the team opted to deal him rather than pay up.Just two years after winning 12 games and snapping a long postseason drought, the Raiders have lost five of their first six games this season, including each the last two. Their lone win came in the form of a 45-42 overtime victory over the Cleveland Browns.Winning cures everything in sports, so if Carr can right the ship, the noise will likely quiet down. Carr even acknowledged as much to Gutierrez: \"Don't worry about this bullcrap. When you're losing, crap happens.\"Even with reports targeting him, Carr doesn't appear to have to worry about job security. Gruden told reporters this week, per Gutierrez, that he doesn't envision trading the quarterback, although he acknowledged that he'd \"never say never.\""}