{"id": "AC Milan Reportedly Demand Cut-Price Deal to Sign Tiemoue Bakayoko from ChelseaRelated", "paragraph": "AC Milan are reportedly not prepared to shell out the €40 million (£35.6 million) fee they previously agreed with Chelsea to sign Tiemoue Bakayoko on a permanent deal.According to Tuttosport (h/t Football Italia), the Rossoneri do not feel his performances during his loan spell in Italy have warranted such a fee. They are said to only be prepared to pay €25 million (£22.2 million) for the midfielder. Bakayoko, 24, moved to Milan on a season-long loan spell in August after struggling in his debut campaign at Stamford Bridge.He did not start well at the San Siro but has begun to show more consistency of late, per Squawka:25. Tiemoue Bakayoko\n\nClub: AC Milan\nAge: 24\nLeague appearances: 8\n\n\"He endured a slow start at AC Milan, with his past three appearances not being too bad. However the midfielder is still some way off his Monaco form of two seasons ago.\" https://t.co/WTczgR9lM8Milan are seemingly still open to the prospect of making his move permanent, but their demands for a discount could scupper a deal.Per Football Italia's report, Milan paid a €5 million (£4.4 million) loan fee in the summer, so they would need to pay a further €35 million (£31.1 million) to meet the terms of the original deal.In that scenario, Chelsea would nearly recoup the £40 million fee they paid to sign the Frenchman from Monaco in 2017.If they acquiesce to Milan's demands for a discount, though, they would make a significant loss on Bakayoko.There does not look to be a place for him in the Chelsea squad with summer signing Jorginho already an indispensable asset, while Ross Barkley's emergence has added further competition.It seems unlikely Bakayoko has a future at Stamford Bridge, but the prospects of an extended stay at the San Siro could now rely on whether Chelsea are happy to take a cut-price fee."}