{"id": "Lions' A'Shawn Robinson to Reporter After Vikings Loss: 'Get Out of My Face'Related", "paragraph": "Detroit Lions defensive tackle A'Shawn Robinson wasn't feeling particularly chatty after his team's 24-9 loss to the Minnesota Vikings on Sunday afternoon.\"Does it look like I talk to y'all?\" he answered when asked about Dalvin Cook's 70-yard run during the first half (h/t Dave Birkett of the Detroit Free Press). \"No. ... Get out of my face.\"Robinson also said \"you know I don't like y'all\" while referring to the reporters in the room during the exchange, per Michael Rothstein of ESPN.com. The 23-year-old defensive tackle has had an eventful week. After Friday's practice, he \"stormed into the locker room, visibly angry, cursing and looking for an unidentified teammate,\" according to Justin Rogers of the Detroit News.Per that report, he then \"marched over to his corner of the locker room, then to the bathroom, where he was followed by a number of teammates looking to diffuse the situation. Robinson was briefly approached by a reporter, asking if it was something the media had done that had set him off. He sternly but politely asked her to get away from him.\"He did leave the locker room without any escalation beyond that point, however. According to Rogers, multiple Lions said they didn't know the details of Robinson's outburst and only witnessed it from a distance.On the field, Robinson has largely been a positive force for the Lions, registering 29 tackles. Pro Football Focus has given him a grade of 90 for the season, seventh among interior defensive linemen. Robinson and Detroit's defensive line struggled to slow down the Vikings on Sunday, however, giving up 128 rushing yards and registering just one sack.The Lions have struggled against the run this season in general, coming into Week 9 ranked 32nd in the NFL in rushing defense (144.6 YPG). Robinson may not like reporters, but Detroit's struggles in the run game are deserving of scrutiny. "}