{"id": "Barcelona Transfer News: Cengiz Under Reportedly Scouted, €27M Value RumoursRelated", "paragraph": "Barcelona sporting director Ariedo Braida reportedly attended AS Roma's 1-1 draw at Fiorentina on Saturday and was in Florence to assess the talents of young attacker Cengiz Under.Sport cited a report from Sky Sports and said the Turkey winger was the focus of Braida's attention, adding the Giallorossi starlet is said to be worth €27 million (£23.7 million).Under has scored three goals and recorded four assists for Roma in 12 appearances this season. Meanwhile, Barca's right-sided summer signing Malcom, who was initially set for a move to Rome, has failed to hit expectations at the Camp Nou.However, Under's alleged audition in front of Barcelona's representative didn't go to plan. It was his poorly executed back-pass that gifted Fiorentina the penalty to go ahead, and it was only thanks to a late Alessandro Florenzi equaliser that they got a point—12 minutes after he was taken off, via Serie A:The wide man also failed to register a shot on goal in his 73-minute outing and completed 73 percent of his passes—Edin Dzeko (67) and Stephan El Shaarawy (70) were the only Roma players with worse records.His goal contribution record in Serie A hasn't been that remarkable, with one goal and three assists in nine league outings (all starts). Under has one goal in two assists in only three UEFA Champions League games and netted a smart half-volley in the recent 3-0 rout of CSKA Moscow:🎯 from @cengizunder! ⭐️🐺🇹🇷\n  https://t.co/ejVGGkH1kpBarca's hopes of doing business with Roma are likely to have been impacted by their desperate move to sign Malcom, who had already agreed to join the Wolves before changing his mind at the last minute.The Brazilian has played 25 minutes of La Liga football and doesn't appear to feature in the plans of manager Ernesto Valverde.That's without mentioning the fact he has French whiz Ousmane Dembele for competition, as recently noted by sports writer Ben Hayward, who isn't holding out hope for his first-team chances in Catalonia:@Jhenfuli Thanks, Casey. Yes I don't think Malcom has much chance, having hardly featured so far and given that he's behind Dembélé as well...Under already has competition at the Stadio Olimpico in the forms of fellow youngsters Justin Kluivert, 19, and Patrik Schick, 22, whom he's likely to fancy his chances against more so than Barca's stars.El Shaarawy recently spoke to the official website of the Gran Gala di Calcio, an event organised by the Italian Footballers' Association (h/t Football Italia) and highlighted Under as the Roma youngster who has impressed him most:\"It was a historic match where we pulled off an incredible comeback. The Roma player who has most impressed me? Under.\"I’m keeping an eye on his growth. He started with some difficulty adapting, but after that he stepped up and gave us a big hand in qualifying for the Champions League and reaching the semi-finals.\"Corriere dello Sport (h/t Richard Fay of the Manchester Evening News) reported Manchester United and Arsenal were also on Under's trail, as Emre Sarigul of Turkish-Football provided more context:LATEST - The Corriere Dello Sport report Man United, Arsenal, Man City &amp; Barcelona want Roma star Cengiz Under. They're 'ready to invest' £44m [€50m] in Jan. #MUFC want him to replace Sanchez\n\nIt is worth pointing out his representatives are negotiating an improved wage packet https://t.co/Q9Y5vNHfWgThe bright lights of Barcelona have a way of tempting the top young talent in the world, but Under's current progress and Roma's likely reluctance to deal with the Catalans could obstruct any move."}