{"id": "Julio Jones Scores 1st Touchdown in 343 Days with 35-Yard Catch-and-RunRelated", "paragraph": "Fantasy football owners can finally rejoice, as Atlanta Falcons star Julio Jones scored his first touchdown of the 2018 season on a 35-yard catch-and-run against the Washington Redskins on Sunday:Happy 26th Birthday to OBJ 🎉Mahomes Is 'Showtime' Off the Field TooThielen's Ride from Underdog to Record-Breaking WRShanahan and His Son Carter Are Hyped for Carter VBrowns Winning Off the Field with Community ServiceConner's Journey from Beating Cancer to Starting RBDoes Donovan McNabb Deserve Your 2019 Pro Football Hall of Fame Vote? B/R Fantasy Expert Matt Camp Gives His Picks for Keep or Release After Week 2Does Hines Ward Deserve Your 2019 Pro Football Hall of Fame Vote?Shaquem Griffin Starting for Seahawks in Week 1 Luck Recommends His Favorite Reads in Virtual Book ClubThe Best Moments from NFL Training CampsCelebrate Your Favorite SB Snack on National Chicken Wing DayWho Had the Best Camp Entrance This Year? 🚁From Working Odd Jobs to the NFLKamara Is Taking on All Comers in PaintballThere's No Offseason for NFL Workout WarriorsNorman Goes on Shopping Spree for Detained FamiliesHue Jackson 'Cleansed' Cleveland with Lake Erie Plunge'Last Chance U 'Star Getting His NFL ShotAs Fox Sports noted, that was Jones' first regular-season trip to the end zone in 343 days.Jones was already in the midst of an outstanding season. He entered the week with 812 receiving yards, which ranked second in the NFL behind only Adam Thielen of the Minnesota Vikings. He followed it up with 121 receiving yards Sunday in the Falcons' 38-14 blowout win.Jones' lack of touchdowns has been a talking point all season, especially after he scored only three times last year. Rookie Calvin Ridley scoring his seventh touchdown of the year Sunday didn't help the situation.Jones put those doubts to rest for the next week after coming through with a touchdown in Week 9.  "}