{"id": "Barcelona Claim 4-2 Win Against Sevilla; Lionel Messi Injured in La LigaRelated", "paragraph": "Barcelona reclaimed top spot in La Liga on Saturday, as they defeated Sevilla 4-2 at the Camp Nou.Lionel Messi departed the pitch with an arm injury after 26 minutes, but the forward was involved in Philippe Coutinho's opener after just two minutes.Messi doubled the lead 10 minutes later, and Sevilla's hopes appeared extinguished.Sevilla goalkeeper Tomas Vaclik brought down Luis Suarez in the box shortly after the hour mark. The Uruguay international then fired home from the penalty spot.Pablo Sarabia pulled one back for Sevilla after 79 minutes, but Ivan Rakitic's pinpoint volley completed the victory. Luis Muriel added a second for the visitors in stoppage time.Barca leapfrog Alaves at the top of the division and lead the way by a point.                             Dembele Needs to Lead Barca If Messi Misses TimeMessi was in top form in the first half, but the Argentina icon was injured and replaced.The forward assisted Coutinho for the opener straight after the kick-off and added his name to the scoresheet minutes later.Messi was in full flow, combining well with Suarez, but his night ended early after he suffered the arm injury.Dembele stepped into the world-class attacker's spot desperate to impress. The Frenchman arrived from Borussia Dortmund for a £135.5 million fee in 2017 but has failed to justify the outlay.Injury curtailed his season last term, but the former BVB starlet has much to prove.The severity of Messi's injury is unknown, but if the superstar is out for an extended period, it could be the most important spell of Dembele's short career. The France international is 21, but he must prove to the Blaugrana he can lead the attack in a similar fashion to Messi.Despite the differences in their skill sets, Dembele has the perfect platform to develop his predatory senses. Still, failure could open the door for Malcom.The Brazilian has only two substitute appearances in La Liga, and he's been unlucky to earn so few minutes after a good pre-season.Dembele plays alongside the perfect striker for his game, as Suarez offers dynamism and work rate.However, if he can't produce the form expected, Malcom will get the chance to shine in Spanish football.                                     Barca Must Find Gerard Pique's SuccessorPique will go down as a Barca legend when his career at the Camp Nou ends, but the 31-year-old is showing signs of his age.Sevilla failed to threaten the home goal with consistency, but Pique's quality in the tackle was lacking for a player of his experience.The centre-back has never been blessed with exceptional pace, but as the modern game favours quicker attackers, Pique appears to be a relic. He remains a steady member of the squad, but recent errors should make coach Ernesto Valverde consider his options.The hosts were comfortable winners, but the visitors still found the net twice when Barca were in total control.Valverde must think about rebuilding his defence in the next 12 months as Pique gives way to youth and speed."}