{"id": "Ronald Acuna Wins 2018 NL Rookie of Year Award over Juan Soto, Walker BuehlerRelated", "paragraph": "An outstanding first season in the majors for Atlanta Braves left fielder Ronald Acuna Jr. has ended with the 2018 National League Rookie of the Year award.Ronnie ROY.\n\nYour 2018 NL Rookie of the Year: @ronaldacunajr24. https://t.co/7b6UX7EIR9The 20-year-old earned the honor over a deep list of contenders, including Washington Nationals phenom Juan Soto. Los Angeles Dodgers pitcher Walker Buehler was the other finalist, although Harrison Bader, Brian Anderson, Christian Villanueva and Dereck Rodriguez were also in the running after outstanding seasons.Despite the competitive field, Acuna got the nod thanks to his incredible all-around performance that helped the Braves win the NL East for the first time in five years.The Venezuelan star posted a .293/.366/.552 slash line while also leading all NL rookies with 26 home runs and 16 stolen bases in 111 games.Acuna entered the year with loads of hype, considered the No. 1 prospect in the minors by Baseball America before the start of the season. He more than lived up to expectations once he reached the majors in late April, producing six multi-hit games in his first 11 starts.The impressive performances continued throughout the year, showing his skills as a true five-tool player who can help at the plate, on the basepaths and in the field:Ronald Acuña Jr.\n\n20-years-old, hits lots of home runs, and also makes crazy catches like this.\n\n(via @FOXSportsBraves) https://t.co/zpABz8yZrNWhile it doesn't count for the award, he also showcased his ability during the playoffs by becoming the youngest player ever to hit a postseason grand slam, per ESPN Stats & Info.Even as a rookie, Acuna was arguably the best player on a playoff team and showed why he will be an elite performer for years to come.Soto had a strong season and would likely win in other years, but Acuna was the best rookie in the NL this season."}