{"id": "Is Dana White Messing Up by Trading Demetrious Johnson, the UFC's Best Fighter?Related", "paragraph": "UFC fans got a surprising and somewhat strange bit of news on Wednesday morning.According to ESPN's Ariel Helwani, the UFC is close to finalizing a trade of sorts that would send former flyweight champion Demetrious \"Mighty Mouse\" Johnson to Singapore-based MMA promotion One Championship in exchange for current One welterweight champion Ben Askren.The report was met with a number of different reactions, mostly negative, but the most common was \"what is the UFC even thinking?\"Breaking: UFC, ONE Championship close to trade involving Demetrious Johnson and Ben Askren. Potential history in the making for MMA -- https://t.co/HllP7dY0ofWhile he had the misfortune of being attached to some of the lowest-drawing events in UFC history, Mighty Mouse was unanimously regarded as one of the greatest pound-for-pound fighters in the sport, with many going a step further and holding him up among the greatest of all time. That didn't change with his dubious split-decision loss to Henry Cejudo in August, and while his record-breaking reign as champion may have ended, he still had plenty of fight left in him.So why is the UFC trading him? And how did things get to this point? Bleacher Report's dynamic duo of Steven Rondina and Nathan McCarter are here to discuss the topic.Steven: Let's play a game really quickly, Nathan.You're UFC President Dana White. You have the best fighter in the world, Demetrious \"Mighty Mouse\" Johnson, in your stable and he also just so happens to run a relatively popular video-game stream on Twitch. Coincidentally, your bosses (WME-IMG) happen to own half of one of the biggest esports tournament organizers in the world.You get an email asking you to send some folks to sit in the stands for the finals of their first big Counter-Strike event. A typical \"smile and wave for the camera\" thing, but something that would get some fresh eyeballs on whoever gets the spot.Who do you send?.@DanaWhite catches up with @paszaBiceps of @teamvirtuspro in Atlanta ahead of the @EL finals at 4pm today on TBS https://t.co/jsMHiSxkd3If you chose at-the-time fringe Top 15 welterweight Kelvin Gastelum and your damn self, you were right! Because that's exactly what happened back in 2016 at the ELEAGUE CS:GO Season 1 championship.This wasn't exactly the make-or-break moment for DJ in the UFC, but this is one of the many examples of the promotion not being able to put two and two together when it comes to its greatest talent. So now, with Helwani reporting that the promotion is looking to hand Johnson over to the Singapore-based promotion One Championship, I can't help but look back on those moments and think \"boy, the UFC did him dirty.\"Am I missing something?Nathan: I am a big advocate of Mighty Mouse and consider him to be the GOAT, but what you are missing is that he just was not a draw.Sure, there will be plenty of people who point to instances like you laid out to illustrate that he wasn't given all the promotional opportunities. That is not really the case. He was champion since 2012; the fact that in 2016 he wasn't being sent to events to represent the UFC shows that they knew his ceiling had been hit after using numerous advertising avenues on Johnson already. Even in 2018, he is still in Metro PCS commercials.I love Johnson. He is just not a viable draw. He isn't the first athlete to not resonate in spite of his brilliance at his craft and he won't be the last. It isn't about being a lighter weight class or any other rudimentary argument. He just never clicked with a larger audience in spite of being given chances.Don't think the UFC tried? He was opposite Dominick Cruz in one of their early, highly promoted events on Fuel TV. He was put in four separate headlining bouts on \"big\" Fox, including three in a row. He headlined four PPV [pay-per-view] events where the largest buyrate was just over 205,000 (h/t MMA Blue Book).He simply did not resonate. He was given promotional opportunities and bouts in front of big audiences. It never worked.That is why it was a great move by the UFC to orchestrate this trade.Steven: I know I'm not the first person to plead this case and I know that some of my like-minded constituents have grossly overestimated DJ's promotional ceiling in the past. I'm not going say that Johnson was a few media appearances away from being Conor McGregor, but I don't think I'm being especially bold when I say that his ceiling was higher than \"worst pay-per-view draw in UFC history.\"And of course, if we're putting the \"drawing power\" filter on this ugly snapshot of the UFC's priorities, are you really going to make the case that this is an upgrade for the UFC? Are you really going to tell me that the UFC is better off with Ben Askren, somebody that was such a drag at the box office that Bellator let him leave for One FC as welterweight champion back in their pure sport days?This reads more like a \"wet the bed, hide the sheets\" moment for the UFC to me than a deft business maneuver.Because of that, I'm kind of struggling with the idea that everybody will be better off with this trade. Sell me on it.Nathan: Is Askren a big draw himself? No. Certainly not. The context of why he's more valuable has to do with his personality and the division in which he will compete. Johnson was leading the flyweight division pretty much by himself. Who was a good foil for him both in the cage and promotionally? Almost nobody. At welterweight, there are plenty of enticing options for Askren.I do not want to go down the political route, but Askren is outspoken in that arena and we've seen how that has benefitted Colby Covington in this very division. And Askren has a history of calling out GSP [Georges St-Pierre] too. So, in this regard, the UFC is getting a promotional upgrade from Johnson.Johnson also wins. One is going to fit him better, and he'll be able to get more sponsorships since he won't have to abide by the Reebok deal. Perhaps Microsoft will return or more esports brands. He'll also be competing in a region that will be more apt to align themselves with his fighting style and personality.The only thing Johnson and fans are being robbed of is his rematch against Cejudo. Johnson discussed in the UFC 227 post-fight press conference that being the champion was never his dream. He has always been concerned with the business aspect, and going to One is a better business move in the long term (h/t Forbes.com's Trent Reinsmith).UFC wins by having a new face and personality in a premier division. Askren wins by finally making it to \"the show.\" One wins with having the GOAT join their ranks. And Johnson wins by getting out on his own in a much more favorable organization for what he does best.Steven: Obviously, as a person, I'm just hoping everyone ends up better off if this deal goes through. Askren getting a shot in the Octagon is long overdue, as is Johnson having a promoter that actually appreciates him.As a fight fan, though, this just sucks, and there's no question about that.Cejudo vs. Johnson 3 is on my short list of \"most intriguing MMA fights that could be made right now,\" and not getting it is a shame. Much worse, however, is that Johnson joins a rapidly growing list of elite-level talents that have left the Octagon. We're seeing more greats leaving the UFC than entering it right now, and that isn't a sustainable trend for the promotion.There are some silver linings to the clouds here, but the day that the UFC loses Johnson is undeniably a sad one."}