{"id": "Nothing but Misery, Confusion in Maryland's Decision to Retain DJ DurkinRelated", "paragraph": "Dismay, anger and frustration.That's the simple version of reactions to the University System of Maryland Board of Regents' recommendation the university reinstate DJ Durkin as head football coach. Athletic director Damon Evans is also returning to his position.How? How is this happening when Jordan McNair can't do the same?Despite the investigations into his death, the football team, the coaching staff and the university as a whole—despite the university's taking responsibility for what happened to him—everyone who oversaw the tragedy is safe. Not only that, but they also will be given the responsibility of fixing things.How? Why?\"We will forever—forever—be guided by the memory of Jordan McNair,\" said James Brady, chair of the board of regents, during Tuesday's press conference.\"There will be no third chance for any of those involved to get this right.\"Apparently, however, the memory of McNair is not enough for Maryland to ensure those in charge at the moment McNair died are no longer employed at the university.Not having another athlete die as a direct result of sport-related activities is a disturbingly low bar for a second chance.The press conference left a bitter feeling. Brady acknowledged Durkin, Evans and university president Wallace Loh all bear responsibility for what transpired.Yet they're sticking around. For now, at least. Loh announced he plans to retire at the end of the academic year.According to a report by ESPN's Heather Dinich and Adam Rittenberg, the board of regents strong-armed Loh into keeping Durkin. While the board does not hold the power to retain Durkin, it controls Loh's job security.Loh reportedly preferred to relieve the coach of his duties, and at the press conference, he did not specifically mention Durkin in prepared remarks and deferred to Evans on whether the head coach will be on the sideline for Maryland's next game.It is irresponsible to suggest those details are not connected. It seems evident Loh was not in favor of the decision.That, however, does not absolve Loh of wrongdoing. The president protected the brief future of his position rather than do what should've been done—in other words, his job.Why, after all this evidence, did he sidestep the hard decision?According to the Washington Post, a 192-page report from an external commission stated the athletic department \"lacked a culture of accountability.\" The Maryland board accepted that finding, yet the power structure remains unchanged.Sure, the report stopped short of calling Maryland a \"toxic\" environment. Brady, however, noted the report stated, \"Problems festered because too many players feared speaking out.\"For God's sake, let's quit parsing words and playing semantics with \"toxic.\" Call it whatever you want, the culture was horrible inside Maryland football per multiple investigations, reports and the parents of Jordan McNair and their lawyer.The report also mentioned Maryland's athletic department \"did not provide adequate oversight of the football program and failed to provide Durkin with the tools, resources and guidance necessary to support and educate a first-time head coach in a major football conference.\"Hold up.Why does a new head coach need additional training to keep players safe? First-time bosses are hired every offseason because they're deemed capable of overseeing programs.Durkin failed.He was present during the workout that led to McNair's death. Even while he did not and should not advise in medical situations, this is the staff he helped build.\"Rick Court, our strength coach, is our most important hire I made,\" Durkin said in 2016, four months after he took over, per Sports Illustrated. \"That guy is unbelievable. When you're changing a culture, that's where it starts. And so we've flipped the world upside down on these guys.\"Durkin either helped create the culture—again, one the board of regents acknowledged was a problem—or he allowed the devolution. That is his responsibility.Court either worked under the blessing of Durkin or the head coach was blind to massive issues within his program. There are no other options.USM board chair James Brady reiterates that the board accepts recommendations from the commission looking into #Maryland football, including that both DJ Durkin and the athletic department had responsibility for strength coach Rick Court.Not even the announcement of the decisions did anything to suggest there aren't indefensible problems in College Park.Brady came across as out of touch, making a joke about gin in his water bottle and saying after his prepared remarks that he \"can't imagine\" there are any questions. \"My guess is we will talk again,\" Brady said as the press conference ended.Did the Maryland board of regents chair refer to his water as his gin while making this announcement? https://t.co/Miv72Ejkf6Those are the actions of a person Maryland wants to represent the school? How is that possible?Additionally, per Nicole Auerbach of The Athletic, three Maryland players walked out of Tuesday's team meeting with Durkin. It would be ignorant to believe only three players feel that way. Hundreds of high school athletes, their parents and coaches are undoubtedly coming to a similar conclusion.McNair's family certainly is upset.Jordan McNair's father on today's news conference from Maryland's Board of Regents: \"I feel like I've been punched in the stomach and someone spit in my face.\"\"When I think of DJ Durkin, all I remember is him sitting at our kitchen table and assuring me that he would take care of my son, and he did anything other than that,\" Marty McNair previously told Dinich.\"... My child died there. That's something we'll never get back. That's a wound that will never heal.\"Maryland, however, decided it will allow Durkin to promise dozens, maybe hundreds, more families the same thing. Let's hope—a million times over—this tragedy doesn't happen again.But that trust cannot be fully rebuilt, and no one should have afforded him a second chance.Jordan McNair doesn't have one, but Durkin does. Evans is back. Court received a $315,000 settlement.How? Why?"}