{"id": "Jim Harbaugh Silencing Michigan Haters with Second Straight Crucial Big Ten WinRelated", "paragraph": "The only thing that Jim Harbaugh and the No. 6 Michigan Wolverines couldn't control in a 21-7 statement win at No. 24 Michigan State was the weather. However, nearby lightning strikes merely delayed the inevitable for 80 minutes, as the Maize and Blue cruised to a second consecutive beatdown of a ranked conference foe.The final margin on the scoreboard doesn't scream \"blowout,\" but it never seemed like the Spartans had a realistic shot at upsetting their in-state rivals. They didn't take a single snap in Michigan territory in the entire first half. Were it not for a Chris Evans fumble at his own 7 early in the second half, Michigan State never would have sniffed the end zone.Poor Brian Lewerke only completed five of 25 passes, and the Spartans finished the afternoon with 94 yards of total offense. The last time they were held below 175 yards was in a blowout loss to Alabama in the 2011 Capital One Bowl. Per Sports-Reference, this was the first time they were held below 170 yards—let alone 100—since at least 1999.Suffice it to say, this wasn't your typical 14-point win. And coupled with last week's destruction of Wisconsin, it's about time for the Harbaugh haters to put a sock in it.From the moment he was hired as head coach of the Wolverines, Harbaugh was lauded as the savior of the program. After all, he took a 1-11 Stanford team and turned the Cardinal into a title contender within four years. He was even quicker to revitalize the San Francisco 49ers, ending an eight-year postseason drought with trips to the NFC Championship Game in each of his first three seasons.Surely he could turn around a Michigan program that had averaged 6.6 wins in the seven seasons prior to his arrival, right?Well, yes and no.Michigan is undeniably better under Harbaugh. He is now 35-12 with the Wolverines and has led them into the AP Top 7 in three consecutive years—a plateau they did not reach once from 2008-15.Two years ago, they missed the College Football Playoff by fourth-down inches in a double-overtime loss at Ohio State. Thus far this year, the Wolverines are firmly in the conversation for one of the four coveted spots in the national semifinals.Yet, Harbaugh can't seem to shake the \"overrated\" and \"can't win the big one\" labels.It started with the loss to Utah in his debut in 2015, and the skeptics have increased in volume and vitriol with each loss in his 1-7 record against AP Top 10 teams. Lackluster recruiting class rankings in 2015 and 2018 further fanned the flames of discontent.No doubt, those folks will be quick to argue that Wisconsin and Michigan State aren't actually that good and that none of this matters unless the Wolverines are able to win that colossal road game against Ohio State on the Saturday after Thanksgiving.It's a valid (albeit tired) argument, but let's counter that opinion with some cold, hard facts:Say what you will about the past, but this team is presently elite and is winning games it had consistently lost since long before Harbaugh took over.As a result, the Wolverines—despite the season-opening loss at Notre Dame—are undefeated in Big Ten play (5-0) and are on the short list of teams who control their own CFP destiny.After a bye week, Shea Patterson and Co. will host a Penn State team in the midst of a three-game gauntlet (vs. Iowa, at Michigan, vs. Wisconsin). Win that one (as they should), and they'll be able to sleepwalk through two games against Rutgers and Indiana before the big trip to the Horseshoe.Michigan will certainly be the underdog for what is shaping up to be the biggest game of the entire college football season once again. But with this impenetrable pass defense and with the Buckeyes oddly struggling to run the ball this year, anything's possible.Not to get too far ahead of ourselves, but it's worth noting that Michigan is arguably the nation's best hope of stopping Alabama. No, the Wolverines haven't faced anything close to a Tua Tagovailoa. But if there's any secondary capable of keeping him in check, it's got to be the one that has limited three straight opponents to seven completions apiece.It might take that much for the haters to finally accept Harbaugh is one of the greatest coaches in the game today, but it's clear he has a squad capable of winning it all.                             Kerry Miller covers college football and men's college basketball for Bleacher Report. You can follow him on Twitter, @kerrancejames."}