{"id": "NFL Scores Week 9: Top Fantasy Stars, Results and Latest Team StatsRelated", "paragraph": "We're officially in the second half of the 2018 NFL season. And that means plenty of teams, real and fantasy, are starting to separate themselves from the crowd. The same can be said of players.In Week 9, several of the game's biggest fantasy stars went off. From Christian McCaffrey, to Matt Ryan, to basically anyone on the Kansas City Chiefs, there were plenty of big performances around the league.The biggest star in each game can be found in the table below, followed by more details from the biggest performances this week.          Kareem Hunt (34 points)A few different Chiefs could've warranted an explanation here, but it was Kareem Hunt who wound up with the most individual fantasy points in Kansas City's 37-21 win over the Cleveland Browns.Hunt ran for 91 yards and two touchdowns while adding another 50 yards and a score as a receiver.The NFL posted video of one of his scores:Another one for @Kareemhunt7!\n\n📺: CBS #ChiefsKingdom #SaluteToService https://t.co/jCXTlp5pBIWith all the weapons on this Chiefs offense, it's hard to predict which one will go off in a given week. But Hunt and quarterback Patrick Mahomes are generally good bets. Take out a disappointing Week 1 for Hunt and he's averaging a whopping 21.8 fantasy points per game this season.                        Matt Ryan (30 points)Speaking of consistency, the 2016 NFL MVP is somewhat quietly putting together one of the best seasons of his career. And that continued Sunday.Ryan went 26-of-38 for 350 yards, four touchdowns and one interception.The league posted video of one of the scoring strikes to Julio Jones on its Twitter account:JULIO JONES TOUCHDOWN!!!!\n\n📺: FOX #InBrotherhood #SaluteToService https://t.co/ulnWNczKOyThe big game brings Ryan's passer rating up to 115.1, just shy of the career-high 117.1 he posted in 2016. This is the fifth time he's topped 25 fantasy points this season.                  Christian McCaffrey (26 points)It's been a steady season for McCaffrey, but he hadn't quite had a monster performance. That was, until Sunday.McCaffrey had 157 yards from scrimmage and two rushing touchdowns in the Carolina Panthers' 42-28 win over the Tampa Bay Buccaneers.The NFL shared one of his more dynamic runs of the day:Hurdle 'em, @run__cmc!\n\n📺: FOX #KeepPounding https://t.co/oO6Q6E7mdlPrior to this one, McCaffrey was averaging 12.6 fantasy points (18.9 in point-per-reception formats). Sunday's breakout ups that number to 14.3 (20.4 PPR).                 Bears Defense/Special Teams (28 points)The Chicago Bears added to the woes of Nathan Peterman and the Buffalo Bills with a 41-9 drubbing that included four sacks, three interceptions, two touchdowns and a fumble recovery.The league posted video of one of the defensive scores:.@EJackson_4 will take that loose football alllllll the way to the HOUSE!\n\n📺: FOX #DaBears https://t.co/cGsVR4N0HIThe Bears came into Week 9 trailing only the Los Angeles Rams in fantasy defense, averaging 9.1 points per game. After putting up a whopping 28, the Chicago defense's average of 11.5 fantasy points per game is comfortably first in the NFL.     Alvin Kamara (29 points)After going for 29 PPR points on Sunday, New Orleans Saints running back Alvin Kamara now has 535 through his first 24 career games. Edgerrin James and Odell Beckham Jr. are the only non-quarterbacks in NFL history who had more in their first 24 games.The way Kamara got those points on Sunday was similar to the first 23 games, in that it really wasn't just one way. He went for 82 yards and two scores on the ground while adding another 34 yards and a touchdown as a receiver.And one of his most impressive runs on the day, as seen on the NFL's Twitter timeline, wasn't even one of the touchdowns:.@A_kamara6 already has a bunch of TDs... \nAnd now he's jumping over people! 🆙\n\n📺: FOX #GoSaints #SaluteToService https://t.co/7SO3d1KYDvKamara saw a dip in his production after Mark Ingram came back, but it looks like he's back to being the unquestioned featured back.Going forward, he should continue to be one of the best fantasy options out there. He trails only Todd Gurley in PPR points this season.     Michael Thomas (29 points)Kamara wasn't the only big-time performer from the shootout between the Los Angeles Rams and the Saints. In fact, there were four players who eclipsed the quarter-century mark in standard scoring leagues.Saints receiver Michael Thomas sealed his place in this section with the catch that also sealed the 45-35 win for New Orleans, a 72-yard touchdown with under four minutes to go in the game.The league shared video of the score:YOU CAN'T GUARD MIKE!!\n\n📺: FOX #GOSAINTS @cantguardmike https://t.co/ire43pp5TDBefore Sunday's game, Thomas was averaging a solid 12.4 standard fantasy points per game. After this explosion, he's at 14.5.Like Kansas City, New Orleans has a bunch of guys who can go off at any minute. But you can pretty much count on Thomas getting to around 10 on a weekly basis.     Drew Brees (32 points) and Jared Goff (30 points)The Rams and Saints gave us the game of the day, and quarterbacks Jared Goff and Drew Brees did plenty to assure that.Goff went 28-of-40 for 391 yards, three touchdowns and one interception. He added one more fantasy point with 17 rushing yards for good measure.Then, there was Brees, the highest scorer in a game packed with fantasy production. He went 25-of-36 for 346 yards, four touchdowns and no interceptions. He had 16 rushing yards of his own.Brees now has 2,336 yards, 18 touchdowns and one interception on 213-of-279 passing on the season. His passer rating is an absurd 120.6.Most of the MVP love has understandably gone to Gurley this season. But it might be time to start talking more about Brees.           Unless otherwise noted, stats courtesy of Pro Football Reference or ESPN.com."}