{"id": "Report: Vontaze Burfict Fined $112K for Antonio Brown Hit, More vs. SteelersRelated", "paragraph": "Cincinnati Bengals linebacker Vontaze Burfict has been fined $112,000 for unnecessary roughness on multiple plays during a clash against the Pittsburgh Steelers in Week 6, according to NFL Network's Ian Rapoport.The plays in question involved hits on receiver Antonio Brown and running back James Conner.Burfict, of course, has a long track record of questionable actions on the football field. He has been fined and suspended on multiple occasions throughout his seven-year career, as NFL Network's Marc Sessler pointed out earlier this year:Along with multiple suspensions, Burfict has been forced to pay thousands out of pocket for a flurry of hits on defenseless players, flipping the middle finger to fans, ankle twisting, spearing &amp; striking a player in groin. A real gem! https://t.co/xmdH4rOFgmPro Football Talk's Charean Williams noted the troubled linebacker has lost more than $4 million in his career as a result.Last week's game against Pittsburgh was just Burfict's second appearance of the season. He was suspended for the first four games of the regular season for violating the league's policy on performance-enhancing substances.Cincinnati and Pittsburgh have been involved in a physical rivalry through the years, with Burfict typically right in the middle of things. Week 6 marked the first time the two teams met on the field since Steelers receiver JuJu Smith-Schuster concussed Burfict with a crackback block last year. Smith-Schuster received a one-game suspension.It was a fairly tame game, by their standards at least. However, Burfict once again found himself at the center of controversy following some questionable hits.Smith-Schuster told reporters after the Steelers' 28-21 victory that the Bengals defense made \"major threats\" in his direction, per DKPittsburghSports.com's Dejan Kovacevic:Priceless JuJu on how the Bengals treated him on the field: #DKPS #Steelers https://t.co/T02zxQc9XPPittsburgh quarterback Ben Roethlisberger also accused Burfict of threatening Smith-Schuster.\"He hits AB, then, literally, as I am under center for the next play, he points at JuJu and says, 'You're next,'\" Roethlisberger said, according to the Pittsburgh Post-Gazette's Ron Cook. \"How do you allow that stuff?\"NFL Network's Mike Garafolo posted video footage of the alleged incident, but it's unclear what the Bengals linebacker was saying, as there is no audio.Despite a number of plays being subject to review by the NFL, Burfict managed to escape a suspension but will see his bank account take a hit. He will be available to play in Sunday night's showdown against the 5-1 Kansas City Chiefs.The Bengals and Steelers don't meet again until the regular-season finale on Dec. 30 at Heinz Field in Pittsburgh. If the game holds playoff implications, the league will likely once again be on high alert."}