{"id": "Alexa Bliss Injury Update, Luke Harper and More in WWE News Roundup for Nov. 12Related", "paragraph": "Bleacher Report catches you up on the latest news from the WWE Universe.            Alexa Bliss Suffered 'Multiple Concussions' and Has Yet to Receive Clearance for ReturnAlexa Bliss hasn't wrestled since losing to Ronda Rousey at Hell in a Cell on Sept. 16. According to the Wrestling Observer Radio's Dave Meltzer (h/t Wrestling Inc's Akhilesh Gannavarapu), she is recovering from \"multiple concussions in a short period of time,\" which has kept her out of the ring.It's unclear when Bliss will be healthy enough to wrestle again. Acting Raw general manager Baron Corbin named her the captain for Raw's women's team at Survivor Series, with The Goddess selecting her squad rather than representing WWE's flagship show against SmackDown Live.       Luke Harper Photographed with Cast on Left HandLike Bliss, Luke Harper has been on the shelf for the last few months. His last appearance on WWE programming was in a defeat to The New Day on the Aug. 21 edition of SmackDown Live. It would appear a hand or wrist injury is preventing him from wrestling for the time being.Comedian Brad Williams shared a photo of Harper, in which a cast is visible on his left hand:When @SalVulcano and @LukeHarperWWE stop by your show, every fetish is covered. https://t.co/6DglTj0LMIWWE has yet to specify the nature of Harper's injury.       WWE Reportedly Drops Survivor Series StorylineMonday's edition of Raw is the last one before Survivor Series on Sunday. According to WrestleVotes (h/t Ringside News' Felix Upton), WWE was considering an angle in which a member of the SmackDown Live roster tipped off Raw about an attack by the blue brand Monday night. The creative team ultimately decided against going with the storyline.      WWE's Match of the Day on YouTube: Dean Ambrose vs. Roman ReignsDean Ambrose and Roman Reigns may have been brothers in The Shield, but they put that aside at Survivor Series 2014. The two men battled in the final of WWE's tournament for the World Heavyweight Championship."}