{"id": "Wilfried Zaha Responds to Death Threats, Racism After Arsenal Penalty IncidentRelated", "paragraph": "Crystal Palace forward Wilfried Zaha has taken to social media to address death threats to his family and racist abuse following the penalty incident in the 2-2 draw against Arsenal.As reported by the Evening Standard, the former Manchester United man took the high road in a statement he released via Instagram: \"For all the people taking it one step further and being racist and wishing death on my family I wish you and your families the best too x p.s my life is still very good despite your hate.\"Zaha went to ground after a duel with Granit Xhaka late in the match, earning his team a penalty. Luka Milivojevic converted to end the Gunners' win streak. Some Arsenal fans were convinced it was a dive, even though Xhaka himself admitted the penalty decision was correct, per the report.As shared by TeamFA, Xhaka even said it was a \"clear penalty\":Wilfried Zaha has revealed that he has been subjected to racial abuse and death threats over the penalty decision against Arsenal on Sunday, despite the fact that Xhaka himself described it as a \"clear penalty\".\n\nNo player should be treated like that by so called 'fans'. https://t.co/wVOAgWb3mKSome football fans disagreed, however:Wilfried Zaha’s heatmap. https://t.co/eqXctPSebsArsenal had won 11 straight matches across all competitions before traveling to south London and chased down a one-goal deficit after giving away an earlier penalty. Xhaka himself had tied things up.Pierre-Emerick Aubameyang's go-ahead goal came with plenty of controversy after Alexandre Lacazette appeared to handle the ball inside the box, but it was the second penalty decision that soaked up most of the headlines afterwards.The 25-year-old has gained a reputation for going to the ground easily over the years, evidenced by the many penalties he has won his team:11 - Since the start of 2014-15, only Jamie Vardy (13) has won more penalties in the Premier League than Wilfried Zaha (11 - level with Raheem Sterling). Tripped. #CRYARS https://t.co/mIx26YZ7PhHis dribbling ability plays a part in that as well, however, as he ranks among the most fouled players in the league. After he complained about the rough treatment he receives earlier this season, BBC Sport's Alex Bysouth took a look at the numbers, which revealed him only behind Chelsea's Eden Hazard since 2013.The Ivorian leads Crystal Palace with three Premier League goals this season. The Eagles haven't won a match since September and are 14th in the table."}