{"id": "Report: Manchester United 'Favourites' to Capture Jadon Sancho from DortmundRelated", "paragraph": "Manchester United have reportedly emerged as \"favourites\" to sign Borussia Dortmund starlet Jadon Sancho if the player returns to England.According to the Mirror (h/t Ryan Taylor of the Daily Express), the Red Devils lead the pack to bring the winger to the Premier League.Sancho departed Manchester City's youth team to join BVB in the Bundesliga in 2017, and the attacker's form has since been astounding as he takes German football by storm.The Guardian (h/t Taylor) reported United are ready to provide manager Jose Mourinho with significant funds, with defensive and attacking targets being considered. Mourinho will be allowed to spend £100 million in the January transfer window, with Sancho on the coach's radar.In the current market, the England international could be worth more than £100 million, but City have a buy-back option in place if they want to activate a deal, per Taylor.United have struggled to find the net this term, and Mourinho recently dropped Romelu Lukaku as he attempted to revitalise his forward line and shuffle the pack against Everton in the Premier League.The Red Devils lack a creative talent resembling Sancho's likeness, and he would immediately fit alongside Anthony Martial and Marcus Rashford in a youthful trio.Lukaku is likely to win back the No. 9 role in due course, but Mourinho has been desperate to add a winger to his selection for two years.United previously chased Inter Milan winger Ivan Perisic in the hope of adding width, with Mourinho's team far too narrow and predictable.However, despite the reported interest, BVB are confident Sancho will not be heading to Old Trafford in the near future.According to Bild (h/t FourFourTwo), Dortmund sporting director Michael Zorc has said he believes Sancho will stay in Germany for now.Zorc said: \"I'm pretty sure Jadon will be playing with us for some time.\"The player recently revealed his joy after signing a fresh deal to stay at the Signal Iduna Park until 2022.Per FourFourTwo, Sancho said: \"You can see that right now, I play a lot here. This is important for young players to develop. You never know what will happen in the future, but I'm really happy right now.\"Sancho is likely to become the subject of further speculation as the transfer window approaches, and the biggest clubs in the world will be watching his progress with serious interest.United would have to break the bank to sign the winger in January, and a centre-back should be the club's priority as they attempt to rescue their season."}