{"id": "5-Star Center Oscar Tshiebwe Commits to West Virginia over KentuckyRelated", "paragraph": "West Virginia added a big piece to its 2019 recruiting class after center Oscar Tshiebwe announced his commitment to the Mountaineers Saturday. I have been humbled by all the coaches recruiting me and people wondering where I would attend school. Thank you for everything. Time to go to work, KC Pride and Mountaineer Nation going for Championships. Country roads take me home💯❤️️ https://t.co/pNBEZ3r9gxTshiebwe announced a final four of Kentucky, West Virginia, Baylor and Illinois for his services on Twitter in August. The standout from Kennedy Catholic High School in Pennsylvania is a 5-star prospect ranked as the No. 8 center and No. 22 overall player in the 2019 recruiting class by 247Sports. Leading up to his senior year in high school, Brian Snow of 247Sports broke down some of the traits that make the Hermitage, Pennsylvania, native such a special prospect:\"Tshiebwe's combination of athleticism, toughness, motor, and strength make him one of the toughest one-on-one matchups in the class. In fact, when going up against the best of the best in the 2019 class, Tshiebwe seemed to always come out on top, and really excelled during June and July.\"Brown also noted the big man improved his ability to score \"when running, catching and finishing while on the move.\" Traditional back-to-the-basket centers can still play a valuable role, but it's not a good way to maximize value when long-distance shooting is crucial to success. West Virginia head coach Bob Huggins has built a reputation in recent years for adapting his style to best suit the players on his roster. It's a strategy that has paid off, as the Mountaineers have made it to the second weekend of the NCAA tournament three times in the last four years. They have also won at least 25 games in each of those four seasons. If Tshiebwe is able to turn his newfound shooting skill into production at the college level, West Virginia will put itself among the nation's elite programs during the 2019-20 campaign. "}