{"id": "Shohei Ohtani Wins 2018 AL Rookie of Year Award over Torres and AndujarRelated", "paragraph": "Los Angeles Angels star Shohei Ohtani won the 2018 American League Rookie of the Year Award, MLB announced Monday.The hype was real.\n   \nYour 2018 American League Rookie of the Year: Shohei Ohtani. https://t.co/GBvlRVUzFDWith 25 first-place votes, Ohtani finished ahead of New York Yankees third baseman Miguel Andujar. The Athletic's Lindsey Adler shared the results:Shohei Ohtani is the AL Rookie of the Year. Miguel Andújar finished in second place, followed by Gleyber Torres in third. Here is the breakdown of votes: https://t.co/G4LGfmIVemExpectations couldn't have been much higher for the 24-year-old Ohtani as he was making the move from Japan. In five seasons with the Hokkaido Nippon-Ham Fighters, he had a .286/.358/.500 slash line to go along with 48 home runs and 166 RBI. He also went 42-15 with a 2.52 ERA in 85 appearances on the mound.MLB fans got even more excited when Ohtani expressed a willingness to pull double duty in the majors. He ended up becoming the first player since Babe Ruth in 1919 to hit at least 15 home runs and pitch 50 innings in the same season.The Angels started Ohtani 82 times at designated hitter. He posted a .390 weighted on-base average while hitting 22 home runs and 61 RBI. His 2.8 WAR was fourth-highest among Angels position players.He threw 51.2 innings over 10 starts and averaged 10.97 strikeouts to 3.83 walks while posting a 3.31 ERA and 3.57 FIP.He would have been the runaway favorite for Rookie of the Year had injuries not interrupted his debut campaign. After the month of May, Ohtani only pitched twice, and he subsequently underwent Tommy John surgery on Oct. 1, after the regular season was over.Voters had to decide whether 104 total appearances was sufficient for Ohtani to collect the award.Andujar and Yankees second baseman Gleyber Torres were the only serious challengers.Torres hit 24 homers, drove in 77 RBI and owned a .271/.340/.480 slash line. Andujar, meanwhile, had a .297/.328/.527 slash line, 27 home runs and 92 RBI in 149 games.However, Ohtani posted more offensive WAR than Torres (1.9) and Andujar (2.7) before factoring in his value as a pitcher. Sports Illustrated's Emma Baccellieri argued only one outcome made sense:\"Ohtani has been one of the best rookie hitters in recent memory, and the numbers say that he's undeniably been the best this year in the American League. If you were to evaluate him just at the plate—judging him as a designated hitter, taking the limited playing time into account—he would still have a remarkably solid case for Rookie of the Year. Think about that, and then throw in the fact that he's also been a legitimate top-of-the-rotation arm, with a 128 ERA+ and the highest strikeout rate of any rookie starting pitcher in the American League.\"Considering both his age and early success in MLB, Ohtani's potential is nearly limitless. By having Tommy John surgery, he won't pitch in 2019 but can still contribute to Los Angeles' lineup, likely as a designated hitter.As long as he can stay relatively healthy—elbow injury notwithstanding—an All-Star appearance should be within reach for Ohtani in year two.              Stats are courtesy of FanGraphs unless otherwise noted."}