{"id": "Ian Book, Notre Dame Stay Undefeated with Crucial 36-3 Win over SyracuseRelated", "paragraph": "The No. 3 Notre Dame Fighting Irish remained undefeated and in position for a College Football Playoff berth with a 36-3 win over the No. 12 Syracuse Orange at Yankee Stadium in New York City on Saturday.Notre Dame is now 11-0, and a road win over the USC Trojans next week will likely give it a spot in the CFP.The Irish shut down one of college football's most explosive offenses, as they held the Orange to 234 total yards and forced three turnovers. Notre Dame also became the first team to hold Syracuse to fewer than 23 points in a game this season.Part of the reason for Cuse's offensive struggles was the absence of quarterback Eric Dungey, who left with an upper-body injury in the first quarter and did not return.Freshman signal-caller Tommy DeVito played most of the contest in Dungey's place but couldn't find a rhythm, as Notre Dame limited him to 105 yards with no touchdowns and two interceptions on 14-of-31 passing.Offensively, junior quarterback Ian Book led the Fighting Irish. He turned in another strong performance with 292 yards, two touchdowns and one pick.Book bounced back effectively after he missed last week's win over the Florida State Seminoles with a rib injury.Notre Dame did leave points on the table in several red-zone trips Saturday, as kicker Justin Yoon converted three field goals of fewer than 30 yards.The Irish took control with a nine-yard touchdown pass from Book to running back Dexter Williams less than six minutes into the game, though, and they led by 13 points after the first quarter, which proved to be a big enough cushion.                         Book, Strong Defense Make Irish National Title ThreatAfter dominating a good Syracuse team in all areas, Notre Dame looks like it can do damage in the CFP.As the Irish's normally great running game sputtered, Book put the offense on his shoulders and moved the chains with consistency.He spread the ball around to all of his top targets, including Chase Claypool, Miles Boykin and Alize Mack, and he got the Irish into the end zone on a few occasions, including this 10-yard scoring strike to Claypool in the third quarter:The victory Chase continues. \n\n@ChaseClaypool hauls in a 10-yard TD from @ian_book23 and our lead grows larger. \n\n#3 ND 29 - #12 SU 0 [3:30 3Q] https://t.co/K0bgUicKfFBook showed that he is accurate from the pocket but also athletic enough to make plays with his legs and throw on the run.Considering how well Book has played since he became Notre Dame's starter Sept. 22, Brian Hamilton of The Athletic posed a question worth pondering:Ian Book won’t win the Heisman. But I wonder if you can make an argument that he’s the most valuable player in college football this fall.While the Irish started the year 3-0, they were struggling mightily on offense with Brandon Wimbush under center. Book has given that side of the ball a much-needed jolt and made the attack capable of hanging with anyone.Given Book's emergence, Notre Dame's dominant defense arguably hasn't received as much recognition as it deserves.The Irish haven't allowed more than 27 points in a game this season, and they were all over a Syracuse offense that ranked No. 6 in the nation in scoring entering the contest, as Sal Maiorana of the Democrat & Chronicle noted:Notre Dame defense is just manhandling Syracuse.Even before Dungey exited, the Notre Dame defense swarmed him and managed to pick him off:WE'LL TAKE THAT \n\n@Jae_Uno_ snags the errant SU pass, setting up a @jkicker19 FG to extend the lead.\n\n#3 ND 10 - SU 0  [7:44 Q1]\n\n#GoIrish☘️ #SUvsND https://t.co/ivMGadSvylThe Irish then made life miserable for DeVito and his pass-catchers, as the secondary's physicality was directly responsible for another interception:DOUBLE PLAY BY @ALOHIGILMAN\n\nHis second INT of the day sets up @jafararmstrong3's 9-yard waltz into the end zone one play later. \n\n#3 ND 20 - SU 0 [4:15 2Q]\n\n#GoIrish☘️ #SUvsND https://t.co/bKvKRK2HYzAll of the teams in line for a spot in the CFP are great defensively, and Notre Dame has shown throughout the season that it belongs in that mix.Coupling that with Book's play gives the Irish a combination that will be difficult for any team to beat in the College Football Playoff, including the No. 1 Alabama Crimson Tide.                    Orange Need Healthy Dungey to Finish Season StrongDespite Saturday's one-sided loss, the Orange have a chance to finish with their best record since they went 10-3 in 2001 if they can win next week at Boston College and prevail in their bowl game.If Dungey can't play in one or both of those contests, however, winning either of them may be a tall order.Dungey seemed to clutch his lower back before crumbling to the ground after getting tackled on a first-quarter scramble.Pete Sampson of The Athletic noted he looked to be in considerable pain:Unclear what the injury to Syracuse quarterback Eric Dungey actually was, but he appears in rough shape. Helped by trainers off the field. Headed to the locker room, very slowly.The Athletic's Nicole Auerbach added that Dungey has a lengthy injury history, which creates concern whenever he gets hurt:Syracuse QB Eric Dungey is being helped off the field. We're not sure what the injury was. \n\nThis is the latest into the season Dungey has played over the course of his college career. He's had such awful injury luck.DeVito is a promising freshman who is likely to take the starting reins when Dungey graduates after this season.In relief of Dungey against North Carolina last month, DeVito threw for 181 yards, three touchdowns and one interception, as the Orange won 40-37 in double overtime.He looked overmatched against Notre Dame, though, and failed to keep his team in the game.Dungey is one of the best dual-threat quarterbacks in college football, and it's safe to assume he would have at least given the Orange a fighting chance with his legs had he stayed healthy, since he entered the game with 690 yards and 12 touchdowns on the ground.Opposing defenses must always be aware of the senior's running ability, but if he isn't available for the rest of the season, Syracuse's high-octane offense will be a shell of its usual self, just like it was Saturday.                               What's Next?Notre Dame will face rival USC on the road next week in its final game of the season before it learns if it will be part of the four-team College Football Playoff.Syracuse will look to bounce back from Saturday's loss when it takes on the No. 20 Boston College Eagles away from home in its last regular-season game."}