{"id": "Report: Manchester United Demanded Juventus' Miralem Pjanic in Paul Pogba SwapRelated", "paragraph": "Juventus reportedly made a last-minute attempt to re-sign former midfield talisman Paul Pogba from Manchester United in the summer, but the Red Devils were only willing to do a deal involving Miralem Pjanic.The Mirror's Andrew Gilpin cited Sky Sports Italia journalist Gianluca Di Marzio, who said United told the Bianconeri they wanted the Bosnia and Herzegovina international if they were to sell Pogba, but negotiations went quit.Pogba has struggled to reach his top form under Jose Mourinho this season, and Gilpin provided quotes from Juve chief Massimiliano Allegri, who was quizzed on speculation linking Pogba with a return to Turin: \"Talking about Pogba is useless.\"Like all players who are not part of Juventus, I can not and I do not want to talk about players from other teams.\"Pogba is young and still has room for improvement, now he is a player of Manchester and unfortunately on Wednesday we have to meet him. If he does not come it would be better.\"It's fair to say Pogba's Old Trafford homecoming hasn't been the success he hoped it would be in the two seasons since he left the Allianz Stadium to join the Red Devils for a second time.Allegri was asked for his take ahead of Wednesday's UEFA Champions League rematch in Turin, with United having lost the first clash 1-0 a fortnight ago in Turin. The Times highlighted how Pjanic, 28, was one of those who shone in comparison with United's midfield:“In the other side was huge quality, people like Cristiano, Dybala, Pjanic\"\n\nMourinho says it is hard for Manchester United to compete against the best \"with what we have\"\n\nhttps://t.co/lRLiedZpO0 https://t.co/gutlcvAP2uIt was a little less than a fortnight after the Premier League summer window closed that Juventus announced Pjanic had signed a new contract, however, which will keep him in Turin until 2023.However, there is a question of how much more money deserves to be spent on United's core, which has already had Nemanja Matic and Fred added to it in the past two summers.Samuel Luckhurst of the Manchester Evening News recently referenced that duo when underlining a lack of proper investment at the club (albeit applying for inflation in the market):Mourinho's quote had shades of Moyes' 'aspire to be like City' one in 2014. The summer was a shambles thanks to the Glazers, but he has spent £358.7m in just over two years. Fred cost more than Pjanic and Matuidi combined. #mufcPjanic played the full 90 minutes of Juve's 1-0 win at Old Trafford in October, and despite the result, he was quick to praise the quality of the English side's squad, per Sky Sport Italia (h/t FourFourTwo):\"[Pogba is] a great footballer, just like [Nemanja] Matic or [Juan] Mata or Fred.\"United is a team of great quality, there are players who can make the difference, so we will have to face them like we did in the first leg.\"I think that we had a very good game at Old Trafford, we could have scored a few more goals. We hope that in Turin we will manage to score more, but we must not forget that Manchester is a great team with a great coach.\"Pogba, 25, moved back to United for £89 million in 2016, and although he's arguably no longer worth that fee, it seems unlikely the Premier League powerhouses would settle for less.Pjanic could be the key to unlocking that deal, although Juventus blogger Arjun Pradeeprecently argued it would be a bad deal on the Bianconeri's part:Good we kept Pjanić &amp; not included him in a deal for Pogba. \n\nI love Pogba &amp; for me he's always been a world-class player, a talent that appears once every 20-30 yrs.\n\nI'm not really in favor of bringing back those who decided to leave but if the club opts to bring him back.... https://t.co/LeMxix13d6Unless circumstances change and United become desperate to offload Pogba, Juventusnow know the price it would take to recapture Pogba, and Pjanic's signature will likely be deemed too high a cost. "}