{"id": "Fantasy Football Week 7 Rankings: Updated Positional Breakdown for Flex and PPRRelated", "paragraph": "NFL fans have the option to sit on the couch and watch football largely uninterrupted for 14 hours or so on Sunday as the Tennessee Titans and Los Angeles Chargers kick off at Wembley Stadium in London, England, at 9:30 a.m. ET.The usual dose of games starting between 1 p.m. and 4:25 p.m. will take place, with the Cincinnati Bengals and Kansas City Chiefs playing in the nightcap at 8:20 p.m.Here's a look ahead at some Week 7 fantasy football rankings for the three eligible flex positions (running back, wide receiver and tight end). The projections are based on point-per-reception scoring.              Top 15 Running Backs1. Los Angeles Rams RB Todd Gurley (at San Francisco 49ers): 6 Rec, 170 Total Yds, 2 TD (35 Pts)2. New York Giants RB Saquon Barkley (at Atlanta Falcons): 6 Rec, 150 Total Yds, 2 TD (33 Pts)3. Carolina Panthers RB Christian McCaffrey (at Philadelphia Eagles): 7 Rec, 100 Total Yds, 1 TD (23 Pts)4. Los Angeles Chargers RB Melvin Gordon (vs. Tennessee Titans in London): 6 Rec, 100 Total Yds, 1 TD (22 Pts)5. Dallas Cowboys RB Ezekiel Elliott (at Washington Redskins): 4 Rec, 100 Total Yds, 1 TD (20 Pts)6. Chicago Bears RB Tarik Cohen (vs. New England Patriots): 7 Rec, 70 Total Yds, 1 TD (20 Pts)7. New Orleans Saints RB Alvin Kamara (at Baltimore Ravens): 5 Rec, 80 Total Yds, 1 TD (19 Pts)8. Cincinnati Bengals RB Joe Mixon (at Kansas City Chiefs): 4 Rec, 80 Total Yds, 1 TD (18 Pts)9. Kansas City Chiefs RB Kareem Hunt (vs. Cincinnati Bengals): 3 Rec, 80 Total Yds, 1 TD (17 Pts)10. Cleveland Browns RB Duke Johnson (at Tampa Bay Buccaneers): 5 Rec, 60 Total Yds, 1 TD (17 Pts)11. New England Patriots RB James White (at Chicago Bears): 8 Rec, 70 Total Yds (15 Pts)12. Jacksonville Jaguars RB T.J. Yeldon (vs. Houston Texans): 3 Rec, 60 Total Yds, 1 TD (15 Pts)13. Detroit Lions RB Kerryon Johnson (at Miami Dolphins): 2 Rec, 70 Total Yds, 1 TD (15 Pts)14. New Orleans Saints RB Mark Ingram (at Baltimore Ravens): 2 Rec, 60 Total Yds, 1 TD (14 Pts)15. Atlanta Falcons RB Tevin Coleman (vs. New York Giants): 2 Rec, 60 Total Yds, 1 TD (14 Pts)                Cleveland Browns RB Duke JohnsonCleveland Browns running back Carlos Hyde was traded to the Jacksonville Jaguars in exchange for a fifth-round 2019 draft pick on Friday. That turns the Browns backfield into a two-man partnership between Nick Chubb and Duke Johnson Jr.Presumably, Chubb will be the man on early downs, while Johnson should be the primary back for third downs and/or passing situations. However, the Dawgs By Nature blog posits that Johnson could get the most work Sunday:If I were a betting man, I would wager that Duke gets the majority of the work on Sunday. Especially with the possibility of a pass heavy game.Johnson may blow up against the Tampa Bay Buccaneers defense, and a few facts point to that happening.First, the Bucs rank last in passing yards allowed per attempt. Ex-Miami star Johnson is an adept pass-catcher who led Cleveland with 74 receptions last year.Second, this game could develop into a shootout: Per OddsShark, the current over/under total is 51.5 points, which is the fourth-highest mark on the Week 7 slate.Third, only two NFL teams have allowed more receiving yards to running backs than the Tampa Bay Buccaneers this year, per Football Outsiders.Finally, Johnson has been receiving increased snaps of late, to the point where he was on the field more than the workhorse Hyde last Sunday (47 percent of snaps to 43 percent). Now Hyde is in Jacksonville, opening up more opportunities for Johnson.All of these facts could lead to a productive outing for Johnson, especially in point-per-reception leagues.          Top 25 Wide Receivers1. Atlanta Falcons WR Julio Jones (vs. New York Giants): 11 Rec, 160 Yds, 1 TD (33 Pts)2. Minnesota Vikings WR Adam Thielen (at New York Jets): 9 Rec, 110 Yds, 1 TD (26 Pts)3. Tampa Bay Buccaneers WR Mike Evans (vs. Cleveland Browns): 8 Rec, 100 Yds 1 TD (24 Pts)4. Kansas City Chiefs WR Sammy Watkins (vs. Cincinnati Bengals): 8 Rec, 100 Yds, 1 TD (24 Pts)5. Cincinnati Bengals WR A.J. Green (at Kansas City Chiefs): 7 Rec, 110 Yds, 1 TD (24 Pts)6. Los Angeles Chargers WR Keenan Allen (vs. Tennessee Titans in London): 8 Rec, 100 Yds, 1 TD (24 Pts)7. New Orleans Saints WR Michael Thomas (at Baltimore Ravens): 8 Rec, 90 Yds, 1 TD (23 Pts)8. Detroit Lions WR Golden Tate (at Miami Dolphins): 7 Rec, 90 yards, 1 TD (22 Pts)9. Los Angeles Rams WR Brandin Cooks (at San Francisco 49ers): 6 Rec, 100 Yds, 1 TD (22 Pts)10. Los Angeles Rams WR Robert Woods (at San Francisco 49ers): 7 Rec, 80 Yds, 1 TD (21 Pts)11. Houston Texans WR DeAndre Hopkins (at Jacksonville Jaguars): 7 Rec, 80 Yds, 1 TD (21 Pts)12. Baltimore Ravens WR John Brown (vs. New Orleans Saints): 5 Rec, 100 Yds, 1 TD (21 Pts)13. Philadelphia Eagles WR Alshon Jeffery (vs. Carolina Panthers): 6 Rec, 80 Yds, 1 TD (20 Pts)14. Jacksonville Jaguars WR Dede Westbrook (vs. Houston Texans): 6 Rec, 70 Yds, 1 TD (19 Pts)15. Detroit Lions WR Kenny Golladay (at Miami Dolphins): 5 Rec, 70 Yds, 1 TD (18 Pts)16. Cleveland Browns WR Jarvis Landry (at Tampa Bay Buccaneers): 9 Rec, 90 Yds (18 Pts)17. Cincinnati Bengals WR Tyler Boyd (at Kansas City Chiefs): 5 Rec, 60 Yds, 1 TD (17 Pts)18. New York Giants WR Odell Beckham Jr. (at Atlanta Falcons): 5 Rec, 60 Yds, 1 TD (17 Pts)19. Atlanta Falcons WR Mohamed Sanu (vs. New York Giants): 5 Rec, 50 Yds, 1 TD (16 Pts)20. Chicago Bears WR Allen Robinson (vs. New England Patriots): 4 Rec, 60 Yds, 1 TD (16 Pts)21. New England Patriots WR Josh Gordon (at Chicago Bears): 3 Rec, 60 Yds, 1 TD (15 Pts)22. Tampa Bay Buccaneers WR Chris Godwin (vs. Cleveland Browns): 4 Rec, 50 Yds, 1 TD (15 Pts)23. Los Angeles Chargers WR Mike Williams (vs. Tennessee Titans in London): 4 Rec, 40 Yds, 1 TD (14 Pts)24. New England Patriots WR Julian Edelman (at Chicago Bears): 6 Rec, 60 Yds (12 Pts)25. Kansas City Chiefs WR Tyreek Hill (vs. Cincinnati Bengals): 5 Rec, 70 Yds (12 Pts)           Houston Texans WR DeAndre Hopkins (at Jacksonville Jaguars)Houston Texans wide receiver DeAndre Hopkins just had his worst fantasy performance of the season in Week 6, and he still caught five passes for 63 yards and a touchdown versus the Buffalo Bills.Hopkins has been phenomenal this year, catching 44 passes for 657 yards and three touchdowns in six games. His catch rate of 69.8 percent is also a career-best mark (Hopkins had never topped 60 percent before this year).The ex-Clemson star is simply matchup-proof. He just faced a defense that has allowed only 50 points through its past four-and-a-half games and still came away with five receptions and a touchdown.Now he goes against a Jacksonville Jaguars defense that was excellent last season (No. 1 in points allowed per game) but has showed some cracks this year. The Jags have been outscored 70-21 in their past two games and most recently lost 40-7 to the Dallas Cowboys.Hopkins may have problems with the outside corner tandem of A.J. Bouye and Jalen Ramsey, but they're both going to have issues guarding him. He posted 11 receptions for 135 yards and one touchdown in two games against the Texans last year, and current starting quarterback Deshaun Watson was on the field for only two of those eight quarters.Watson is good to go for Sunday, so look for the connection between him and Hopkins to be productive.                     Top 10 Tight Ends1. Kansas City Chiefs TE Travis Kelce (vs. Cincinnati Bengals): 8 Rec, 100 Yds, 2 TD (30 Pts)2. New England Patriots TE Rob Gronkowski (at Chicago Bears): 8 Rec, 110 Yds, 1 TD (25 Pts)3. Philadelphia Eagles TE Zach Ertz (vs. Carolina Panthers): 8 Rec, 90 Yds, 1 TD (23 Pts)4. Washington Redskins TE Jordan Reed (vs. Dallas Cowboys): 6 Rec, 70 Yds, 1 TD (19 Pts)5. Indianapolis Colts TE Eric Ebron (vs. Buffalo Bills): 6 Rec, 60 Yds, 1 TD (18 Pts)6. Carolina Panthers TE Greg Olsen (at Philadelphia Eagles): 5 Rec, 50 Yds, 1 TD (16 Pts)7. Cleveland Browns TE David Njoku (at Tampa Bay Buccaneers): 5 Rec, 50 Yds, 1 TD (16 Pts)8. Atlanta Falcons TE Austin Hooper (vs. New York Giants): 4 Rec, 40 Yds, 1 TD (14 Pts)9. Miami Dolphins TE Nick O'Leary (vs. Detroit Lions): 3 Rec, 30 Yds, 1 TD (12 Pts)10. Cincinnati Bengals TE C.J. Uzomah (at Kansas City Chiefs): 5 Rec, 50 Yds (10 Pts)               Philadelphia Eagles TE Zach Ertz (vs. Carolina Panthers)Philadelphia Eagles tight end Zach Ertz has seen 67 targets through six games. Not only does that make Ertz the leading tight end in targets league-wide, but he's also No. 6 in targets overall.Of note, Ertz's production has been consistent all year. It's not as if he had 20-plus targets in one game, as he's seen between nine and 14 passes thrown his way for all six of his matchups. A five-catch, 48-yard effort in Week 1 was his worst outing: Since then, he's caught a touchdown pass or amassed 73 or more receiving yards in each game. Ertz also has a 71.6 percent catch rate, which is his second-best career mark.Ertz is also matchup-agnostic: In a game against the Tennessee Titans, the ex-Stanford star caught 10 passes for 112 yards on 14 targets. The Titans are ranked third in fewest points allowed per game and are ranked ninth in yards per game allowed to tight ends, per Football Outsiders.Ertz has a tougher matchup against a Carolina Panthers defense that features a few stars (namely linebacker Luke Kuechly, who Ertz could see in coverage). However, the volume of targets Ertz will see negates matchup concerns, and he should have another solid afternoon."}