{"id": "Jim Harbaugh: Michigan State Acted 'Bush League' During Pregame AltercationRelated", "paragraph": "Michigan head coach Jim Harbaugh wasn't thrilled with Michigan State after the Big Ten foes were involved in a heated pregame altercation prior to the Wolverines' 21-7 win over the Spartans on Saturday afternoon.\"Total bush league ... apparently Coach Dantonio was 5 yards behind it all smiling,\" Harbaugh said, according to The Athletic's Cody Stavenhagen.Harbaugh was referring to an incident that unfolded hours before kickoff. The Wolverines boss said he was told Michigan State players \"clotheslined\" defensive tackle Lawrence Marshall and ripped the headphones off cornerback Lavert Hill.Harbaugh says Dantonio was “5 yards behind smiling” during pregame issue   Called it “bush league” https://t.co/mL1QZ2cUMIMichigan State head coach Mark Dantonio responded once he was informed of Harbaugh's remarks:Dantonio on Harbaugh comments about MSU coach being behind pregame situation: \"That's BS.\" Says, \"You guys get your cameras out. I'm not gonna go to that. Go ahead, next question.\"\n\nA few seconds later, Dantonio says unprompted: \"Bush league? Mmmhmm.\"Harbaugh, however, did not comment on the actions of Michigan linebacker Devin Bush—who tried to deface the Spartans logo at midfield by stomping on it:Players getting into it and the Spartan logo getting defaced?\n\nYup, it's time for @UMichFootball vs. @MSU_Football. https://t.co/iquUXIBRf8Harbaugh and Dantonio have had an acrimonious relationship for years, and things started to boil over last December when the Wolverines head coach took a shot at his in-state counterpart.\"Saw Coach D comments on continuing to 'focus' on how 'he' can beat Michigan,\" Harbaugh tweeted. \"Congrats on turning around a 3-9 team, plagued with off field issues. Good for BIG to have him back.\"Dantonio quickly responded, but did not reference Harbaugh in his message: \"For all Spartans, 'it's not over, it'll never be over, it's just getting started.'\"Michigan has won two of the last three meetings against Michigan State after the Spartans ripped off three straight from 2013 to 2015."}