{"id": "Arsenal Transfer News: Gunners Reportedly Keen on Nicolas TagliaficoRelated", "paragraph": "Nicolas Tagliafico is reportedly catching the eye of Arsenal, as head coach Unai Emery considers his options at left-back. Concerns over Nacho Monreal and Sead Kolasinac have encouraged the Gunners to run the rule over Ajax defender Tagliafico, according to Calciomercato (h/t Alex Richards of the Daily Mirror). Monreal and Kolasinac are nursing injuries, forcing Emery to deploy right-back Stephan Lichtsteiner on the left for Arsenal's 3-1 home win over Leicester City in the Premier League on Monday.Age at the full-back position is likely a worry for Emery since Monreal is 32 and Lichtsteiner is 34. Injuries have also thinned his choices, with Kolasinac nursing a long-term knee problem.Carl Jenkinson has returned to the first-team squad for the first time since November 2016, per James Benge of the London Evening Standard. Injuries and various loan spells have derailed Jenkinson's Arsenal career, yet like Lichtsteiner, the former Charlton Athletic man is better suited on the right.It means Emery faces a similar problem of finding cover at left-back as the one faced by predecessor Arsene Wenger. The latter used academy graduate and converted midfielder Ainsley Maitland-Niles in the position at times last season.Snapping up a gifted player like Tagliafico would boost the position for the future. Still just 26, Tagliafico is an Argentina international whose contract with Ajax runs out in 2022.Playing for Ajax means Tagliafico is comfortable in the stylish brand of football practiced at the Eredivisie club. Arsenal still play a similarly free-flowing game on Emery's watch.One trait common in the Gunners' performances since Emery took over has been how high up the pitch his full-backs have played. Both Monreal and right-back Hector Bellerin have regularly pushed forward to provide width and help Arsenal press from the front.Tagliafico is athletic enough to make this ploy work. He has the pace and energy, as well as the technique to deliver accurate passes and crosses in the final third.The South American has proved his worth in attacking areas by chipping in with two goals for Ajax in the UEFA Champions League already this season.Tagliafico is a player who fits the bill for what Emery wants at full-back. He would represent a smart signing as the Spaniard continues to tweak his squad."}