{"id": "Heisman Favorite Tua Tagovailoa Totals 4 TDs in Alabama's 50-17 Win vs. CitadelRelated", "paragraph": "The top-ranked Alabama Crimson Tide rolled to a 50-17 victory over The Citadel Bulldogs on Saturday afternoon at Bryant-Denny Stadium in Tuscaloosa, Alabama. Heisman Trophy front-runner Tua Tagovailoa, who was removed from the blowout early in the fourth quarter, put up 340 passing yards, 37 rushing yards and four total touchdowns as he edges closer to college football's top individual honor. It's unlikely his play against an FCS opponent will have any impact on the final vote.The Tide previously clinched a berth in next month's SEC Championship Game for winning the West Division and are now one win away from a perfect 12-0 regular season.                   Tagovailoa Already an All-Time Tide Great with Record-Breaking YearAlabama football is one of the most storied programs in college sports. The team has captured 17 national championships and racked up 26 SEC titles.Along with being led by two of the greatest coaches in college football history, Paul \"Bear\" Bryant and Nick Saban, the Crimson Tide also featured a long line of superstars. It's a group led by quarterback Joe Namath, offensive lineman John Hannah and linebacker Derrick Thomas.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sTagovailoa has proved he deserves a spot alongside those legends.A lot has been made about his dominant performance this season, including another highly efficient outing Saturday, and rightfully so. It would take a disastrous finish for him to lose out on the Heisman Trophy despite a terrific year by Oklahoma Sooners quarterback Kyler Murray.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sTagovailoa added to his growing group of accomplishments against The Citadel by setting the program record for touchdown passes in a season:RECORD! With that 68-yard Tagovailoa to Irv Smith Jr. TD, Tua now holds the single-season passing TD record with 31!\n\n#OutworkYesterday \n#RollTide https://t.co/oFtXiEl697But his legacy is built on the foundation he created in last year's national title game, wherein he replaced Jalen Hurts and led the Tide to a 26-23 comeback victory over the Georgia Bulldogs in overtime.That game laid the groundwork for everything fans have witnessed this season. Tagovailoa has exceeded the hype and has Alabama on track to earn another national title.He will eventually exit Tuscaloosa for the NFL, but he'll leave a lasting mark on the program.                  'Bama Run Defense Must Bounce Back Against AuburnAlabama was fortunate it didn't face a more complete offense Saturday because The Citadel, which features far less size and talent, found success on the ground despite not attempting a single pass until it was down 50-17 late in the fourth quarter.The Bulldogs finished the contest with 60 carries for 275 yards and two touchdowns.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sWhile the Crimson Tide front seven allowed the team to pull away after a competitive first 30 minutes, The Citadel consistently carved out four or five yards at a time before halftime to dominate the possession battle.Dante Smith had two touchdown runs of over 40 years in the contest to further highlight the Tide's defensive woes.That can't happen next week against the Auburn Tiger, or at any other point down the stretch, if Alabama wants to win its second straight national championship.Run defense isn't typically a concern for the Tide. They entered the week seventh in the country in that category with just 96.3 rushing yards allowed per game. So there's a strong chance Saturday was an aberration and everything will return to normal next week.If not, however, Alabama could be on upset alert against JaTarvious Whitlow and Co.                          CFP Committee Should Penalize Weak Late-Season SchedulingThe College Football Playoff selection committee has a chance to make a statement next week if it wants to show power programs that scheduling low-level FBS or FCS opponents late in the year is frowned upon.Give full credit to The Citadel. The Bulldogs played extremely well and fought Alabama to a draw in the first half. But there was never a sense they would pull off the upset. The Tide were always going to win easily.That shouldn't happen in November. If elite teams prefer to schedule a few cupcakes early in the season while they iron out issues and get their new players up to speed, that's fine. It's not fair to expect 'Bama to play top-tier non-conference opponents every week with an SEC schedule looming.The Crimson Tide shouldn't get a near automatic win this late in the regular season, though.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sCFP selection committee chair Rob Mullens frequently discusses strength of schedule, and the surrounding debate has often featured the undefeated UCF Knights the past two years.\"There was a lengthy discussion, obviously, given the strength of schedule issue, but you balance that against what you see when you watch the games,\" Mullens said last month about why UCF was 12th in the first rankings of the season, per Matt Murschel of the Orlando Sentinel.If the committee is going to punish UCF and other programs from smaller conferences for their schedules, that must also be considered when Alabama spends Week 12 beating up on an FCS opponent.It's not a major deal—the Tide are a Top Four team and likely playoff lock barring losses in each of their next two games—but a drop to No. 2 would send a message that even winning these types of games late in the year won't be rewarded.                      What's Next?Alabama will attempt to remain undefeated next Saturday when it takes on rival Auburn in the Iron Bowl.The Citadel is off until Nov. 29, when it closes out the regular season against the Charleston Southern Buccaneers."}