{"id": "Big Ten Announces Discipline for Michigan vs. Michigan St. Pregame AltercationRelated", "paragraph": "The Big Ten fined Michigan State University $10,000 following a pregame altercation between the Michigan Spartans and Michigan Wolverines on Saturday, College Football Talk's Bryan Fischer reported Wednesday.The conference also issued reprimands to head coaches Mark Dantonio and Jim Harbaugh, Wolverines linebacker Devin Bush and the Spartans football team. \"We are fortunate the series of events that occurred prior to the Michigan-Michigan State game did not escalate into a much more serious affair,\" Big Ten Commissioner Jim Delany said in the conference's press release.Michigan players were warming up before the game when Michigan State players walked onto the field with their arms interlocked. Members of both teams exchanged words without going much beyond that.In response to the Spartans' tactic, Bush repeatedly dragged his foot across Michigan State's logo at midfield.Players getting into it and the Spartan logo getting defaced?\n\nYup, it's time for @UMichFootball vs. @MSU_Football. https://t.co/iquUXIBRf8Speaking to reporters on Monday, Harbaugh likened the scene to something out of Star Wars and criticized Dantonio for—in Harbaugh's eyes—doing nothing to stop the incident from happening, per the Detroit News' Angelique S. Chengelis:\"I see where they're using the word juvenile. I think that's trying to brush it under the carpet because their strength coaches were out there leading it. Their assistant coaches were out there. Coach Dantonio was right behind it. That had all the ear-markings and evidence of an orchestrated stormtrooper march.\"Dantonio told reporters Tuesday he wasn't going to provide further comment regarding the situation and was looking ahead to Michigan State's game against the Purdue Boilermakers on Saturday.The Wolverines defeated their in-state rivals 21-7, a score that didn't tell the full story of the game. Michigan held Michigan State to 94 yards of total offense, the Spartans' fewest since 1947."}