{"id": "Report: Manchester United Want Toby Alderweireld for Reduced Price in JanuaryRelated", "paragraph": "Manchester United reportedly could make a cut-price offer for Tottenham Hotspur defender Toby Alderweireld in January.James Robson of the London Evening Standard reported on Saturday that United manager Jose Mourinho watched the centre-back feature for Belgium in their 2-0 victory against Iceland in the UEFA Nations League on Thursday, and the Red Devils could rekindle their interest in the player after failing to agree a price for him last summer.Spurs reportedly wanted approximately £60 million for the Belgian, and the price tag scared off United executive vice-chairman Ed Woodward.According to Robson, United understand the player will be available for £25.4 million at the end of the season due to a clause in his contract, opening the door for a potential deal in the January transfer window. Robson also reported that Mourinho remains interested in recent target Harry Maguire, but the Leicester City defender is locked into a new deal at the King Power Stadium.Alderweireld's current contract expires at the end of the campaign, but Spurs can trigger an additional 12 months to retain the defender. However, this would also allow the centre-back to leave if a release clause is met in the final two weeks of the summer transfer window. If United cannot negotiate a fee in January, they can simply wait six months to get their target, although more clubs could show interest in the defender once his price drops.Calciomercato reported on Friday that Spurs are interested in Sampdoria centre-back Joachim Andersen, with the 22-year-old also on Arsenal's radar. The Denmark international could potentially be a long-term replacement for Alderweireld.United remain in a state of flux since their transfer failings in the summer, and Woodward will now need to back Mourinho if he wants to give Mourinho a fair chance at improving results.The Portuguese's future remains in doubt with the Red Devils only eighth in the Premier League, but aggressive recruitment in January could salvage the club's season.Alderweireld is far from being over the hill at 29, but he's an ageing centre-back playing in the toughest league in the world.The physical nature of English football often takes its toll on players the wrong side of 30.United's centre-backs are poor, and Mourinho must find a leader who can inspire those around him in the back four. Alderweireld would be an excellent addition for a reduced price, and Woodward must now find the cash to strengthen his ailing club."}