{"id": "Didier Deschamps Says Ousmane Dembele Has a 'Habit' of Being LateRelated", "paragraph": "France manager Didier Deschamps has said Barcelona's Ousmane Dembele has a \"habit\" of being late and has called on the player to improve his attitude. Dembele was left out of the Barcelona squad on Sunday for the La Liga showdown with Real Betis amid reports surrounding the player's conduct. According to RAC1 (h/t Sport), the France international didn't report for training on Thursday and the club spent 90 minutes trying to contact him.Speaking on Monday ahead of France's games against the Netherlands and said he's aware of issues regarding the 21-year-old's conduct, per Marca:\"Ousmane has a bit of a habit of being late. Whether for his club or in the French national team, he should be a little more attentive to the things that are part of the day-to-day life of an elite-level footballer.\"He is a young player and I do not lose hope that he will realise all these aspects. They are situations he keeps repeating, but the sooner he avoid them, the better it will be for everyone.\"Deschamps also said he was aware of the \"excuses\" Dembele uses when he does turn up late. \"In his defence he will say: 'I am not the only one,'\" the manager said.La Liga journalist Andrew Gaffney had his say on the comments from the France boss:I don’t believe there’s any anger towards Dembele from people at Barça but rather great disappointment and frustration. He’s an extremely talented player but quite naive. Plus sometimes being so laid back can be misinterpreted as being lazy. It’s up to him to show he wants this.Dembele's absence was another theme in what was a difficult day for Barcelona on Sunday, as the Blaugrana were defeated 4-3 by Betis at the Camp Nou.Having signed from Borussia Dortmund last summer, Blaugrana supporters would've been expecting Dembele to have made more progression in his career at the club. So far this term he's flickered in and out of numerous games.In La Liga, the 21-year-old has chipped in with four goals and an assist, including important ones away at Real Valladolid and Rayo Vallecano. However, in general play, Dembele can frustrate, as he loses possession cheaply and makes errant runs out of possession.Per AS English, the forward's timekeeping appears to be a persistent problem too, as he appeared to turn up late for the second half on Sunday too:ICYMI: Ousmane Dembélé is under the spotlight at Barça again after missing the start of the second half of the Betis defeat, having been left out of the squad for missing training: https://t.co/tXd2ffVj7j https://t.co/lQEJ8RVT5sBarcelona icon Gerard Pique has said the players will rally around Dembele at what is becoming a testing spell:Pique on Dembele: \"He has a lot of talent and a lot of room to improve. We're here to help him. We've all been young like him; we've all made mistakes like him. Football's 24 hours -- you have to live it from the first minute until the last.\"Dembele was part of the France squad that enjoyed success at the FIFA World Cup in the summer, although he only started two matches at the tournament. There have been times when he's dazzled for the national team and it's clear Deschamps is an admirer of the speed, skill and inventiveness the Barca man can provide at his best.Still, it's clear there are issues ongoing with Dembele off the field and for him to make good on his potential that things need to change in regards to his application. If he can do, there's nothing stopping the winger going to the very top of the game."}