{"id": "Angel Di Maria's Stunning Goal Salvages 2-2 Draw for PSG vs. NapoliRelated", "paragraph": "Napoli earned a crucial result in Group C Champions League play on Wednesday, drawing PSG in Paris, 2-2.Napoli's Lorenzo Insigne opened the scoring with a brilliant chip over PSG goalkeeper Alphonse Areola in the 29th minute after a gorgeous through ball from Jose Callejon split the defense.  PSG leveled the proceedings in the 60th minute, however, when Thomas Meunier's attempted cross was deflected into the net by a sliding Mario Rui. It was an unlucky moment for the Italian side, though it followed a clever bit of build-up play from PSG to break down Napoli's midfield and find Meunier with room to roam down the right.Another haggard bit of defending led to Napoli's go-ahead goal in the 77th minute, as Fabian Ruiz's shot hit off the back side of Marquinhos and fell to Dries Mertens, who stabbed at the ball and beat Areola. But PSG were saved in stoppage time by Angel Di Maria, whose curling strike from the edge of the box was a touch of pure class and preserved a draw for PSG.With the draw, Napoli remained in second place on the Group C table with five points, while PSG stayed in third on four points.             PSG Are Too Sloppy to Win Champions LeaguePSG have the raw talent to beat any club in the world, on any given day. But at present, they also lack the discipline to mount a Champions League title run. What happens if PSG don't get out of this group?Some of their defensive deficiencies were on display against Liverpool, as the Reds hit them for three goals in a 3-2 loss for the Parisiens. Those same concerns came to light against Napoli. PSG appeared to be caught napping on the first goal when Callejon absolutely split the midfield open with a perfect pass to Insigne. PSG's defenders were late to recover and the Napoli man made them pay with a deft chip. GOAL!!! Napoli 1-0. Insigne with a beautiful chip over the top against PSG. Napoli the better side so far, maybe a bit of a shock for PSG to play a good team finally after months of pounding vanilla Ligue 1 teams to oblivion.On the second goal, perhaps a bit of bad luck struck the Parisiens, as Ruiz's shot took a less-than fortuitous bounce off of Marquinhos. No matter. Mertens took his chance—and made up for hitting the crossbar earlier in the game when presented a golden scoring opportunity—leaving PSG's UCL hopes on life support.Whereas Insigne and Mertens came up big in the decisive moments, it is perhaps telling of PSG's current form that they created numerous scoring chances and mostly failed to convert, only to find the back of the net on a Napoli own-goal. In the early moments, Kylian Mbappe was a force of nature down the right side, testing Napoli's defense with every touch. No goal came of it. Edinson Cavani had several opportunities in front of goal to score. No goal. Neymar was uncharacteristically quiet for long stretches, but when he had his moments—including two consecutive free kicks late in the game—well, no goal.It is concerning that the trio of Mbappe, Neymar and Cavani has struggled with on-pitch chemistry. They are dynamic individually, but as a unit, they appear to still be sanding off the rough edges, and it was apparent against Napoli. Yes, Di Maria saved the day—and perhaps PSG's UCL hopes in the process—with a magnificent strike. Angel Di Maria May have just saved PSG season . GO LAH ZO. #PSGNapoliBut Napoli will surely live with a 2-2 draw away from home, in which PSG needed a lucky deflection and a golazo to pull even.PSG have been severely tested thus far in the UCL, and the results aren't great. Against Liverpool, the free-flowing style favored the Reds. Against Napoli, PSG were subject to quick-hitting counters. Wasteful in the front, sloppy in the back. That simply isn't a recipe for success, no matter how much talent has been compiled on the pitch. PSG need to clean up their play if they hope to make a UCL run, let alone escape a tricky Group C.              Insigne Makes Napoli a UCL Dark HorseInsigne has been a force of nature for Napoli early in the season, with two goals in UCL play and six goals in eight Serie A matches (seven starts). Napoli came into Group C play as perhaps an afterthought behind Liverpool and PSG, but behind Insigne, they look like a serious threat. 5 - Lorenzo Insigne has scored five goals in his last seven Champions League games - two more than in his first 15 in the competition. Unchained. #PSGNAP https://t.co/oJGpxfFH3eThus far they've played solid football led by a class manager in Carlo Ancelotti, a strong attacking trio and a sturdy group behind them. Certainly, Napoli expect to make a UCL run, as Insigne said after the match (h/t Football Italia):\"We have regrets, as after this performance, we are a little sad. We have to look forward and try to find the positives. The important thing is that we didn't lose, we face them on our home turf and we'll do everything we can to get the three points.\"We prepare every game as if it's a Final and that is positive. The coach has so much experience and he makes us feel calm. It's a pity about the equaliser, but we are improving. The fact we came here and were denied by a 93rd-minute equaliser means we are a great team and are on the right track.\"It isn't so wild to imagine Napoli making a run, especially if Insigne continues his torrid run of form. Liverpool shocked much of the footballing world when it stormed to the UCL final a year ago, led by the irrepressible Mohamed Salah, who tallied 10 goals and four assists in 13 UCL appearances.Thus far, Insigne has been that level of terror for his UCL opponents. Insigne off is a relief for PSG. #UCLIt might take that level of play from Insigne for Napoli to make a run, but it isn't out of turn to suggest the Naples side could be this year's dark horse. After all, they finished as runners-up in Serie A last year and their 91 points would have won the league in seven of the past 10 campaigns.Yes, they lost manager Maurizio Sarri to Chelsea. Yes, they lost midfield maestro Jorginho, also to the Blues. But Ancelotti has brought a more flexible system with him, which should serve Napoli well in the Champions League.Getting out of Group C remains a tough task, no doubt. But if Insigne remains potent, Napoli are more than capable of shaking up Europe.                                What's Next?PSG travel to Marseille in Ligue 1 play on Sunday, while Napoli host Roma the same day in Serie A action. The two clubs will face off in a rematch on Nov. 6 at 3 p.m. ET "}