{"id": "Yadier Molina Wins MLB's 2018 Roberto Clemente AwardRelated", "paragraph": "St. Louis Cardinals catcher Yadier Molina was named this year's winner of the Roberto Clemente Award:.@Yadimolina04 wins the 2018 Roberto Clemente Award for excellence on and off the field. https://t.co/Sx1jQPHbgfWhile the veteran is always among the best at his position, this honor is mostly due to work off the field. According to ESPN, Molina has spent much of this year providing aid to his native Puerto Rico after the devastation from Hurricane Maria in 2017.\"I feel very honored, very proud to receive the Roberto Clemente Award,\" Molina told ESPN's Marly Rivera.Molina spent two weeks in Puerto Rico last October while delivering food and water, This makes the award especially meaningful considering both Molina and Clemente are from Puerto Rico, with the former Pittsburgh Pirates star also known for his humanitarian work. Molina discussed what Clemente meant to him this week, per Derrick Goold of the St. Louis Post-Dispatch:\"When I was growing up he was like a legend for us, like a hero, and he was everywhere. He was one of my heroes back in the day—still one of my heroes—and just to have this award means a lot to me and to my family. I’m happy for that. It’s great. For the people of Puerto Rico, we’ve been through many (challenges). We didn’t do it thinking of this award. But just to receive this award and makes us proud, makes us proud, after all we did down there in Puerto Rico. It’s just a good feeling to add this award.\"He is the fourth Puerto Rican native to win the award and the fifth Cardinals player, the most of any organization.Molina was also solid on the field once again in 2018, hitting 20 home runs this season, which was the second most of his career. He also posted a .261 batting average on his way to his ninth All-Star selection.The catcher has already accomplished quite a bit in the majors, but this honor might be his most meaningful."}