{"id": "Patrick Mahomes Outduels Baker Mayfield as Chiefs Cruise Past BrownsRelated", "paragraph": "The Kansas City Chiefs continued their winning ways with a 37-21 victory over the Cleveland Browns at FirstEnergy Stadium on Sunday.Since losing their first game of the season in Week 6 against the New England Patriots, the Chiefs have responded with three consecutive wins. Their 8-1 mark is the best in the AFC as they chase home-field advantage in the playoffs for the first time since 1997.Patrick Mahomes remained an unstoppable force, throwing for 375 yards and three touchdowns with one interception. Kareem Hunt recorded 141 total yards and three touchdowns.Baker Mayfield had one of his best showings in defeat. The rookie went 29-of-42 for 297 yards and two touchdowns with one interception in his first game under interim head coach Gregg Williams.   Chiefs Are 2018's Perfect NFL Team Under Andy ReidComing into 2018, most of the concerns for the Chiefs revolved around their defense. They traded cornerback Marcus Peters in the offseason and have not had Eric Berry for one game.Based on statistics, the Kansas City defense hasn't been impressive. The group allowed 388 yards to the Browns after entering Week 9 ranked 31st in yards allowed (432.4) per game.But the NFL has evolved, and the Chiefs are a perfect version of what successful teams look like.Coming into play this weekend, five of the six teams that would qualify for the AFC playoffs ranked 16th or worse in yards allowed per game, and seven of the 12 playoff teams overall were outside the top 10 in points allowed per game.Last year, the Buffalo Bills had the worst scoring defense (22.4 points per game, 18th overall) among playoff teams, and seven of the 12 playoff teams ranked in the top 10.In this version of the NFL, with more scoring than ever before, the Chiefs have become the standard for every team to model itself after.Gregg Williams is so aggressive as a coach/defensive play caller. No surprise Andy Reid put together a game plan that was heavy on screens with some reverses sprinkles in. @Jacobs71 told you it was coming on Friday’s #4thAnd1 preview podcast.The @Chiefs are an amazing screen team because Andy Reid personally takes the time to walk through every detail. It shows up on the field. Also calling a screen against pressure is moneyAndy Reid has coached the Chiefs' offense to near-perfection, routinely outsmarting people paid millions of dollars to do the same thing. Also he still doesn't know how time works.Even though no one will remember what coach Andy Reid and the Chiefs have accomplished this season if they lose in the playoffs, he has consistently adapted to the changing ways of the league.The 60-year-old Reid still oversees moments of time mismanagement, such as when Mahomes spiked the ball late in the second quarter on a play on which the clock was stopped after a penalty.But he traded a package of three draft picks, including two first-round choices, to select Mahomes last year despite already having a solid quarterback in Alex Smith. He dealt Smith to Washington in the offseason to give the offense over to Mahomes, who started a meaningless Week 17 game in 2017.Reid also landed Kareem Hunt in the 2017 draft to add to an offense that already had tight end Travis Kelce and wide receiver Tyreek Hill.Speed and pace are so important in the NFL today, and Reid understood where things were going and built a roster that seems ready to make a deep playoff run.   Mahomes' MVP Candidacy Being Undone by TurnoversAny criticism of Mahomes' performance this season is essentially nitpicking, but the MVP race could be decided by a small factor the voting body homes in on.How can anyone argue against Mahomes when he can throw a perfect touchdown strike to Kelce with a Cleveland defender draped all over the tight end?.@patrickmahomes5 + @tkelce... AGAIN!\n\n📺: CBS #ChiefsKingdom https://t.co/amWiK29PR1Mahomes also added another record to his historic season:After a 50-yard pass TD to Kareem Hunt in the 1st quarter, Patrick Mahomes has 27 career passing TD, passing Kurt Warner for the most through any players 1st 10 games in NFL history.\n\nIt was also Hunt's 8th straight game with a TD, 1st Chiefs player since Jamaal Charles in 2014. https://t.co/tiHcBC87VOOne negative trend that has developed for Mahomes, however, is turnovers. He's thrown seven interceptions in the past five games after throwing 14 touchdowns without a pick in the season's first four games.To be fair, Mahomes' interception against the Browns came on the final play of the second quarter when he threw the ball up for grabs.Per OddsShark.com's Stephen Campbell, Mahomes is the betting favorite to win NFL MVP, at +100 (bet $100 to win $100). Los Angeles Rams running back Todd Gurley (+200) is a close second.The Rams (8-0) entered Week 9 as the NFL's lone remaining undefeated team, and Gurley leads the league with 800 rushing yards, 1,151 yards from scrimmage and 15 touchdowns.Mahomes also tops leaderboards. He entered Week 9 leading the NFL with 2,526 passing yards and 26 touchdowns.Quarterbacks tend to receive the benefit of the doubt in MVP voting—they have won the award 14 times since 2001. Running backs have won it three times during that span—most recently Adrian Peterson in 2012.There's certainly a clear path for Mahomes to keep the MVP in his grasp, but Gurley's do-it-all role in the Rams offense has made him a threat to seize the award.   Mayfield's Strong Showing Validates Browns' Coaching ChangeAmong the likely reasons Cleveland fired head coach Hue Jackson and offensive coordinator Todd Haley on Monday was the performance of Mayfield.This year's No. 1 overall pick entered Week 9 ranked 30th in the league with a 35.9 quarterback rating, per ESPN.com. Only Sam Darnold, Ryan Tannehill and Josh Allen had been worse.Mayfield was trending in the wrong direction the previous three weeks with a 57.8 completion percentage and 5.5 yards per attempt. His 69.0 completion percentage against the Chiefs was his second-best mark of the season, and his 7.1 yards per attempt marked his best since Oct. 7 against the Baltimore Ravens.Taking on a Kansas City team that scores early and puts pressure on opposing quarterbacks, the 2017 Heisman Trophy winner responded with a solid showing that included some help from Duke Johnson Jr.:#DDDUUKKKKKKKKEEE\n\n#KCvsCLE https://t.co/VmfFf7s4dWPer NFL Network's Ian Rapoport, the Browns' list of coaching candidates will include Josh McDaniels, John DeFilippo, Lincoln Riley and Mike McCarthy.It's not an accident that each of them specializes in offense. If the Browns are going to become a playoff contender, Mayfield has to become the quarterback they thought they were drafting.The coaching duo of Jackson and Haley wasn't working, so the front office opted to move on and get an early start on its search for replacements.Mayfield will likely struggle as this season continues because the Browns still need a lot of help around him. But the flashes he showed in this rebound performance against the Chiefs support the notion that he has the ability to become a franchise quarterback.   What's Next?The Chiefs will head back home to take on the Arizona Cardinals at 1 p.m. ET Nov. 11, while the Browns will finish their two-game homestand against the Atlanta Falcons."}