{"id": "La Liga Results 2018 Week 11: Final Scores and Updated Table After SundayRelated", "paragraph": "Real Betis and Celta Vigo entertained in a six-goal thriller that ended 3-3 in Seville on Sunday, where Los Verdiblancos were ultimately glad to take a point, having lost their 2-0 lead to the guests late on.Loren Moron and Junior Firpo scored either side of the break to set Betis on a path to maximum spoils. Maxi Gomez's brace along with Brais Mendez's addition had Celta thinking the comeback was complete, but Sergio Canales' superb free-kick from outside the box saw Betis split the points.Sevilla moved up to second in La Liga after a 0-0 stalemate at Real Sociedad was enough to take them back above Atletico Madrid. That pair sit level on points with fourth-placed Alaves, who fell after a 2-1 loss at Eibar.The 10 men of Eibar jumped four places to 12th after they came back from a goal down to beat Alaves in a meeting that ended with only 20 on the pitch. Jony put the visitors ahead before Ruben Duarte saw red, but Joan Jordan and Pape Diop netted despite Pablo de Blasis being sent off for the hosts to clinch three points.Villarreal were held to a 1-1 draw by Levante at the Estadio de la Ceramica and are still yet to win in six home league games this season. Alfonso Pedraza came on and scored a 93rd-minute equaliser for the Yellow Submarine.Huesca were pained not to get their first win of the season after drawing 1-1 against Getafe, who equalised through Jorge Molina in the 91st minute. The hosts led for 40 minutes as Xabier Etxeita's header looked to have won the clash, but another missed opportunity sees Huesca four points adrift of safety in last place.       Sunday's ResultsEibar 2-1 AlavesVillarreal 1-1 LevanteHuesca 1-1 GetafeReal Sociedad 0-0 SevillaReal Betis 3-3 Celta Vigo       La Liga Standings (Points, Goal Difference)1. Barcelona: 24, +172. Sevilla: 20, +93. Atletico Madrid: 20, +74. Alaves: 20, +45. Espanyol: 18, +66. Real Madrid: 17, +27. Levante: 17, +18. Getafe: 16, +29. Real Valladolid: 16, 010. Girona: 16, -111. Celta Vigo: 14, +412. Eibar: 14, -613. Real Sociedad: 13, -114. Real Betis: 13, -415. Valencia: 11, -216. Villarreal: 10, -217. Athletic Bilbao: 10, -418. Leganes: 9, -719. Rayo Vallecano: 6, -1120. Huesca: 6, -14Via Sky Sports        RecapThere was drama from end to end at the Estadio Benito Villamarin, although Betis and Celta took time to get up and running; Moron's 33rd-minute breakthrough was the only goal of the six scored in the first half.Madness ensued in the second half, however, as the match exploded into life, and writer Roy Nemer summarised how this fixture stood out from the rest of La Liga:Real Betis vs. Celta Vigo has just turned into the match of the weekend. Betis went 2-0 up, Vigo took the lead 3-2 and minutes after that, Betis equalize with a free kick. Secomd after that, Vigo hit the crossbar through a free kick.Gomez had a particular hand in turning the tide after Firpo made it 2-0 to the hosts on 57 minutes, per Football Talent Scout:Maxi Gomez vs Betis\n\n61' comes on ➡️\n63' goal ⚽️\n84' goal ⚽️\n\nMAXIGOL! https://t.co/Pm8OBOCBVwIn the end, one could argue Betis weren't worthy of their point after wilting so poorly late on, although the quality of Canales' free-kick was a fitting way to end it, as Agence France-Presse's Tom Allnutt described a memorable meeting:Think this is the best game I've seen this season. What a goal Canales.The video assistant referee was heavily used in Eibar's win over Alaves and had a hand in several major moments. It first confirmed Jony's goal from a set piece and then led referee Ignacio Iglesias Villanueva to send off Alaves defender Duarte.La Liga writer Simon Harrison remarked on VAR's early activity as Eibar were themselves reduced to 10 men:A busy day for VAR in Eibar vs Alaves. A goal given, a red card dished out to Ruben Duarte and now Pablo De Blasis gets his marching orders after the referee checks on a nasty tackle.Nevertheless, numbers hardly played a factor in Jordan's powerful drive to level from the edge of Alaves' area, and Diop was well-placed to crush the guests' hope for a point with his head-in from a corner.The Spanish Football Podcast pointed out that wasn't the only last-gasp moment of magic in La Liga on Sunday, though, in what was a recurring theme:Today in @LaLigaEN:\n\n⚽ Added time winner for Eibar v Alavés\n⚽ Added time equaliser for Villarreal v Levante\n⚽ Added time equaliser for Getafe at Huesca\n\n(Let's pretend La Real-Sevilla never happened...)Villarreal goalkeeper Sergio Asenjo and Levante counterpart Oier Olazabal each made key saves in a tense fight at the Ceramica. It was only in the 77th minute Ramiro Funes Mori scored an own goal in a desperate slide attempt to prevent Borja Mayoral slotting home behind him.Substitute Pedraza whacked home an equaliser at Olazabal's near post three minutes into injury time to rescue a point for the hosts. Manager Javier Calleja's men have now won just two points in their last five games and have taken three of a possible 18 points at home this season.Although Villarreal have scored the joint-third-lowest amount of goals in La Liga this term, it isn't for lack of trying, per OptaJose:173 - Only Barcelona (195) &amp; Real Madrid (184) have made more shots (incl. blocks) than Villarreal (173) in #LaLiga this season. Resignation https://t.co/VTDXT9NrxKSevilla appeared to have an off day at the Estadio Anoeta, and their stalemate with Sociedad featured a total two shots on target from an attempted 19 between the two sides:FT Real Sociedad 0-0 Sevilla. La Real refurbished their Estadio Anoeta this summer. It cost €50million. It looks amazing. Only problem is they've not won there all season. Three draws, two defeats.Huesca were hit by heartbreak after dominating Getafe for most of their clash and posting seven shots on target to their opponent's two. Etxeita stooped low to head in a cross after 50 minutes, but Molina showed great strength and composure to craft a good individual equaliser in injury time.Getafe are somewhat fortunate to remain eighth in the standings, while Huesca will rue a chance to leave the bottom of the standings gone astray."}