{"id": "LeBron James, Mike D'Antoni Speak on Carmelo Anthony Coming off the BenchRelated", "paragraph": "Houston Rockets forward Carmelo Anthony's new role as a bench player has been a hot topic across the NBA during the early part of the season.Melo's close friend, Los Angeles Lakers superstar LeBron James, doesn't feel as though the change will have much of an impact on Anthony, according to Kyle Goon of the Orange County Register: \"I mean, listen, once he gets in the game—whenever that may be—it's going to be the same as always. Just that brotherhood, just knowing how far we've come in our career to still be at this point in our career. But it won't be strange.\"LeBron and the Lakers will host Melo and the Rockets on Saturday night.The Rockets lost their season opener 131-112 to the New Orleans Pelicans on Wednesday, and Anthony struggled, going 3-of-10 for nine points in 27 minutes.That marked the first time in Anthony's 16-year NBA career that he entered a game off the bench.In an interview with Sam Amick of The Athletic published Friday, Rockets head coach Mike D'Antoni expressed his belief that bringing Melo off the bench gives Houston its best chance to win: \"The only thing I can say is that you have to have a gut feeling, kind of, and you want to look at it. But my gut's not making the decision. The play, the stats, how we win, that's what will make the decision. And I think so far, everybody has said, 'Whatever it takes.' Then that's what we play.\"D'Antoni acknowledged that while it can be \"hard\" for a Hall of Fame-caliber player to accept a bench role, several have done it successfully over the years, including Bob McAdoo, Manu Ginobili and John Havlicek.To support his decision to utilize Anthony as a bench player, D'Antoni said starting power forward PJ Tucker \"is becoming one of the best players in the league.\" D'Antoni also called Tucker the \"perfect four in modern basketball\" and questioned a Sports Illustrated list that ranked him as the 85th-best player in the NBA.Per Amick, D'Antoni said he believes Tucker belongs in the same class as Golden State Warriors forward Draymond Green, who was 13th on the list.In the season-opening loss to New Orleans, Tucker finished with 19 points in 34 minutes, which tied him for second on the team in scoring behind only Eric Gordon's 21.Anthony is a 10-time All-Star and one of the best scorers of his era, but after averaging a career-low 16.2 points per game with the Oklahoma City Thunder last season, it is difficult to make an argument for him to start on one of the NBA's top teams.The Rockets fell one win short of reaching the NBA Finals last season, but if Melo finds a way to acclimate to the bench role, they may finally have enough firepower to nudge past the Golden State Warriors in the Western Conference."}