{"id": "Lionel Messi Exits vs. Sevilla After Arm Injury Diagnosed as Radial FractureRelated", "paragraph": "Lionel Messi was substituted following an injury during Barcelona's 4-2 win over Sevilla in La Liga at the Camp Nou on Saturday. The five-time Ballon d'Or winner suffered an elbow injury shortly after putting the Blaugrana 2-0 up.The injury was later revealed to be a fracture of the radial bone and will force Messi to miss extended time, including the first Clasico of the season against Real Madrid on October 28:❗ [INJURY NEWS] Tests carried out on the first team player Leo Messi have confirmed that he has a fracture of the radial bone in his right arm. He will be out for approximately three weeks. #FuerzaLeo https://t.co/kpNcspnfqoThe prolific No. 10 was later seen having his arm strapped up on the touchline before Ousmane Dembele entered the fray:Messi, arm heavily strapped up, heads off down the tunnel. https://t.co/B9YUcyZE7sMessi is set to miss pivotal matches, both domestically and in the UEFA Champions League:Lionel Messi is forced off with an apparent arm injury.\n\nNot what Barcelona fans want to see ahead of Wednesday's clash with Inter and the upcoming Clásico ... https://t.co/Xm9WUUN0VdManager Ernesto Valverde will hope Messi isn't out for too long. He remains the inspiration in attacking areas for a team struggling to hit the heights of last season, when they lost just one match on their way to the league title.Barca went top after beating Sevilla, but the champions have appeared vulnerable during this campaign. The Blaugrana have lost once and drawn three matches, even with Messi in the lineup.Dembele has the pace and vision to be an asset alongside Suarez in the final third, but Messi is the team's creative spark. His eye for a pass and ability to conjure goals from nothing give Barca the edge in most matches.Bitter rivals Real are struggling for form but will receive a massive confidence boost from Messi's absence. Meanwhile, Wednesday's visit from Inter Milan suddenly appears a daunting fixture without Barca's main man leading the line.Valverde will know his squad is not strong enough to maintain a credible challenge on all fronts without its best player."}