{"id": "College Football Playoff Rankings 2018: Official Committee Poll Ahead of Week 10Related", "paragraph": "The first College Football Playoff rankings were unveiled Tuesday evening without too many surprises atop the poll.Below, we'll take a look at those rankings and break down the key storylines from the announcement.             Rankings1. Alabama2. Clemson3. LSU4. Notre Dame5. Michigan6. Georgia7. Oklahoma8. Washington State9. Kentucky10. Ohio State11. Florida12. UCF13. West Virginia14. Penn State15. Utah16. Iowa17. Texas18. Mississippi State19. Syracuse20. Texas A&M21. NC State22. Boston College23. Fresno State 24. Iowa State 25. Virginia            StorylinesNot surprisingly, Alabama and Clemson sit atop the rankings, with the two major programs sitting undefeated. A spot atop the rankings is nothing new for them.Alabama is looking to defend its title, and boy, does it look more than capable. The Crimson Tide have won every game this season by 20 or more points, though dates with LSU, Mississippi State and Auburn still beckon. Still, with a loaded defense and a Heisman candidate in Tua Tagovailoa, who has yet to throw an interception this season while tossing 25 touchdown passes and completing 70.4 percent of his passes. Those are absurd numbers. Speaking of absurdity, the Clemson defense has kicked into high gear, giving up a total of 20 points in its past three games. That unit is third in the nation in yards allowed per game (263.9) and tied with Kentucky for the fewest points allowed per contest (13.0). While the defense has been dominant, quarterback Trevor Lawrence has lived up to the hype, energizing an already dangerous offense. Clemson seems primed for its fourth straight trip to the College Football Playoff.Then there's Notre Dame, with a resume that includes a win over Michigan. Stanford and Virginia Tech falling to the ranks of mediocrity this season hasn't helped the Fighting Irish's postseason chances, though an unblemished Notre Dame seems like a pretty good bet to reach the playoff. Nonetheless, the College Football Playoff Committee liked LSU's resume more than than of Notre Dame, a major storyline to follow going forward, especially if LSU knocks off Alabama.There's also the the long list of one-loss contenders, which includes LSU, Michigan, Georgia, Oklahoma, Washington State, Kentucky and Ohio State, among others. Some of those teams will be weeded out of the conversation in the coming weeks. LSU has to beat Alabama to remain in the playoff picture, for instance, while Michigan will face Ohio State on Nov. 24. And this upcoming weekend, Georgia will face Kentucky with the SEC East hanging in the balance, a game few folks would have expected to have such enormous repercussions coming into the season. Don't forget about No. 12 UCF, either. The Knights remain undefeated and will be hoping to convince the committee that they deserve a place in the playoff after missing out last year. They're probably a long shot—given their status outside of the Top 10 this week—but they will remain in the conversation, however peripherally, if they remain undefeated. The 2018 season has already had its fair share of shocking upsets, so a few contenders dropping games to unexpected opponents shouldn't be ruled out, either. Very little is certain at this juncture of the season, with the exception of perhaps Alabama and Clemson once again finding their way into the postseason.That seems to be an annual tradition at this point."}