{"id": "Isaiah Thomas Consulted 'Basketball Legend' Sue Bird Before Hip SurgeryRelated", "paragraph": "Denver Nuggets guard Isaiah Thomas is among those who are happy about the team hiring three-time WNBA champion Sue Bird to a front-office position.According to Katy Winge of Altitude TV, the Nuggets veteran called Bird a \"basketball legend\" and praised the decision to bring her in as a basketball operation associate during an interview Saturday:Talked with @isaiahthomas this morning about Sue Bird. I started the conversation by asking what comes to his mind when he hears that name. \n\n\"A legend. A basketball legend.\" \n\nHe also told me Bird was someone he turned to before deciding to get hip surgery. His full thoughts: https://t.co/795d5b0poDThomas also revealed that he spoke with Bird before deciding to undergo hip surgery in March: \"We've known each other for the last few years. We communicate throughout the season, both of our seasons. She's actually had a few hip surgeries as well, so that was one person that I communicated with before I decided to get hip surgery, so she's somebody that I really trust in her word on the court and off the court, and I'm glad she's here.\"The 29-year-old Thomas missed the start of last season due to a hip injury, and he was never able to find his rhythm during stints with the Cleveland Cavaliers and Los Angeles Lakers.Thomas signed with the Nuggets during the offseason, but he has yet to play in a game this season as he continues to recover from surgery.He will be hoping to get back to the form he displayed when he was an All-Star with the Boston Celtics in 2015-16 and 2016-17.The 38-year-old Bird is an 11-time WNBA All-Star, and she is widely considered one of the greatest players in the history of the league.She has spent her entire 16-year playing career with the Seattle Storm, and she ranks first in WNBA history in games played (508) and assists (2,831).Bird is also seventh on the all-time scoring list with 6,154 points.In Denver, Bird will look to lend her expertise to a team that is off to a 10-5 start this season and ranks second in the Western Conference."}