{"id": "NBA Rumors: Pelicans Not Interested in Carmelo Anthony If Released by RocketsRelated", "paragraph": "Don't expect to see Carmelo Anthony in a New Orleans Pelicans jersey later this season.Will Guillory of The Athletic cited multiple team sources and reported the Pelicans are not interested in adding Anthony if the Houston Rockets ultimately release him. Guillory pointed to New Orleans' depth at the power forward spot and noted Anthony's poor defense limits the ability to use him as a small forward in rotations.Anthony's future with the Rockets is very much in doubt after Marc Stein of the New York Times reported he was \"informed that his brief time with the team will soon be ending.\"While Jonathan Feigen of the Houston Chronicle noted general manager Daryl Morey said he thinks Anthony will return to the team when he is healthy, Tim MacMahon of ESPN cited sources who said players and coaches on the team think the Syracuse product will not lace it up again for the Rockets.New Orleans apparently won't be a destination with the combination of Nikola Mirotic, Julius Randle and Cheick Diallo at power forward alongside big man Anthony Davis. What's more, the Pelicans need to improve their defense to challenge the best teams in the Western Conference considering they are an ugly 25th in the league in defensive rating, per NBA.com.Anthony won't improve the defense with opponents shooting 3.7 percent better from the field and 10.5 percent better from inside six feet than their normal averages when he defends them this season, per NBA.com.Any team signing the 34-year-old version of Anthony in 2018 will not receive the future Hall of Famer who averaged a league-best 28.7 points per game in 2012-13 and was named to six All-NBA teams.Rather, Anthony is averaging 13.4 points and 0.5 assists per game for the Rockets after he posted a career-worst 16.2 points and 40.4 percent shooting clip from the field last season for the Oklahoma City Thunder."}