{"id": "Champions League Results 2018: Updated Tables After Wednesday Group-Stage ScoresRelated", "paragraph": "Borussia Dortmund, Liverpool and Barcelona all booked impressive wins during Wednesday's UEFA Champions League action, while Paris Saint-Germain grabbed a crucial late draw against Napoli to keep the gap to the Partenopei in Group C to a single point.Angel Di Maria came through in a big way for Les Parisiens, who were in real danger of falling four points behind the Italians ahead of the return match.PSV held Tottenham Hotspur to a draw, while AS Monaco couldn't get past Club Brugge in Belgium. Here are Wednesday's results:Club Brugge 1-1 MonacoBVB 4-0 Atletico MadridPSV 2-2 SpursBarcelona 2-0 InterLiverpool 4-0 Red StarPSG 2-2 NapoliGalatasaray 0-0 SchalkeLokomotiv Moscow 1-3 PortoHere's what those results mean for the standings (matches played, wins, goal difference and points):Group ADortmund, 3, 3, +8, 9Atletico, 3, 2, -1, 6Monaco, 3, 0, -4, 1Brugge, 3, 0, -3, 1Group BBarcelona, 3, 3, +8, 9Inter, 3, 2, 0, 6Spurs, 3, 0, -3, 1PSV, 3, 0, -5, 1Group CLiverpool, 3, 2, +4, 6Napoli, 3, 1, +1, 5PSG, 3, 1, +4, 4Red Star, 3, 0, -9, 1Group DPorto, 3, 2, +3, 7Schalke, 3, 1, +1, 5Galatasaray, 3, 1, +2, 4Lokomotiv, 3, 0, -6, 0Fans who tuned into the clash between PSG and Napoli got their money's worth as the French champions and Partenopei served up a showpiece that went down to the wire.The visitors twice took the lead through Lorenzo Insigne and Dries Mertens, but Mario Ruiz put the ball in his own net to tie things up just past the hour mark. Di Maria earned his side a late point.Per sports writer Jeremy Smith, Les Parisiens had no reason to complain after the contest:FT PSG 2-2 Napoli. Not an ideal result for PSG but could have been much worse. Frankly outplayed for most of the match, let off by poor Napoli finishing and a brilliant late di Maria goal. Mbappe non-existent. Neymar not much better. Cavani harshly substituted again.No team impressed more than Dortmund, who took no prisoners against La Liga giants Atletico on their way to a 4-0 win. Axel Witsel opened the scoring with a deflected effort, while Raphael Guerreiro bagged a brace and the impressive Jadon Sancho also scored.Per OptaJose, the loss was a historic one for Atletico under manager Diego Simeone:4 - Atletico de Madrid have suffered their biggest defeat with Diego Simeone as manager in all competitions (4-0 vs Borussia Dortmund). Shock. https://t.co/6tshWybRrFLiverpool were barely troubled by minnows Red Star, as Mohamed Salah bagged a brace and Roberto Firmino and Sadio Mane also got on the scoresheet. The latter made some negative headlines as well with a horrendous dive to win his side a penalty.Rafinha and Jordi Alba got the goals for Barcelona, who cruised without the injured Lionel Messi and took a three-point lead over Inter Milan in their group.The Nerrazzuri remain in a great position to advance thanks to Spurs' struggles in the Netherlands. PSV secured a late draw against the Premier League side, who mostly had themselves to blame, per sports writer Ben Pearce:#thfc Like against Inter Milan, Spurs have been punished for a failure to close the game out when leading and seemingly comfortable. On both occasions they allowed their hosts back into it. Lloris, the hero at West Ham, is the villain a few days later.Toby Alderweireld blundered away to hand Hirving Lozano the opener, and Hugo Lloris followed suit in the second half getting sent off for a foul on the Mexican. Lucas Moura and Harry Kane had given their team the lead by that point, but Luuk de Jong bagged a late equaliser."}