{"id": "Zlatan Ibrahimovic Beats Wayne Rooney to MLS Newcomer of the Year AwardRelated", "paragraph": "LA Galaxy forward Zlatan Ibrahimovic has narrowly beaten Wayne Rooney of DC United to the MLS Newcomer of the Year award. Steven Goff of the Washington Post shared the final results, showing the Swede got 36 percent of the vote, with Rooney coming in at 32 percent. He also broke the numbers down:Ibra edged Rooney on players’ ballots, Rooney won the clubs’ votes, Ibra won media voting easilyThe Galaxy confirmed the news via their official website. The 37-year-old Ibrahimovic scored a remarkable 22 MLS goals in just 27 appearances, almost guiding his team to the play-offs. He finished the season as the competition's second-leading scorer behind Atlanta United's Josef Martinez, who played in 36 matches.Rooney only featured in 21 contests but still managed to score 12 goals while adding six assists.Both former Manchester United men had some incredible moments in their debut campaigns:Zlatan Ibrahimović was named MLS Newcomer of the Year over Wayne Rooney.\n\nIt got us thinking ...  Whose moment of magic was best? https://t.co/8BkQXVcPPuThey also made the league's best XI:Now that’s a squad.\n\nZlatan and Rooney both named to #BestXI in their debut MLS season. https://t.co/vh3rqfA352Rooney and DC United did make it to the postseason, but Columbus Crew beat them in the first round. The 33-year-old can look back on an incredible season, however, as the transformed a struggling side into play-off contenders.The Guardian's Beau Dure wondered whether his great play will lead to new opportunities in Europe. Ibrahimovic has already been linked at length with a return to the Continent, and Tuttosport (h/t Football Italia) have reported a move to AC Milan is close.He hasn't shied away from fueling the speculation:The MLS play-offs will continue with the Conference Finals, with the first legs scheduled for November 25. Atlanta host New York Red Bulls while Sporting Kansas City visit Portland Timbers."}