{"id": "Pep Guardiola Criticises Gary Neville After Manchester City Foul ClaimRelated", "paragraph": "Pep Guardiola has hit back at Gary Neville after the Sky Sports pundit said Guardiola's Manchester City side foul teams to shut down counter-attacks against them.Per The Sun's Duncan Wright and Ian Whittell of The Independent, the Manchester United legend said City are \"clever\" and \"cynical\" for using fouls to give away free-kicks rather than allow teams to hit them on the break.According to Wright, Guardiola said in response:\"I do not agree with that at all. We are not a team that goes looking for these type of situations and I would never ask my players to deliberately foul an opponent. That never happened at Barcelona or Bayern Munich and it will never happen here.\"It is not a secret that when we lose the ball we like to win it back quickly and if you watch us play you can see that when the opponents have the ball we are going to push them and press then to try and regain possession.\"As Gary Neville knows very well, opponents are not going to stand still and let you do that, they are going to try to play too, so sometimes there will be contacts and sometimes you arrive late.\"I do not say we are perfect, we do commit fouls, and on a pitch like the one Spurs had at Wembley there might be more contact than normal but I don’t think anyone can say we are a team that commits a lot of fouls.\"Neville responded to Guardiola on Twitter:It was actually meant as a compliment but hey ho! https://t.co/0kKFxnE8t5Despite Guardiola's denial, there's evidence to back up Neville's opinion on the matter.Football statistician Thom Lawrence revealed in the summer the extent of City's fouling during transitions, while—contrary to Guardiola's insistence—tactical expert Michael Cox noted that fouling was also a strategy employed by his Barcelona side:@deepxg That's a great stat. Such a major ploy at Barca tooGoal's Sam Lee also disagreed with Guardiola's comments, though like Neville, he does not believe the instruction of tactical fouling to be out of the ordinary:And then there’s the new element of Guardiola saying he’s never told any of his teams to do it. I’m not sure that’s true. I’m pretty sure he’s coached a bit of the dark arts into City, and wouldn’t be surprised if tactical fouls are part of that. But again, so what? It’s normalIndeed, the Sky Blues are far from the only team that employ such strategies.For teams that press high up the pitch and like to dominate possession in their opponents' half, winning the ball back quickly—or failing that, fouling the opposition to prevent them from breaking—is often a key part of their defending.City have shipped just four goals in 11 matches this season, the best record in the Premier League.Neville was correct in his assessment that it's a cynical approach, though, one that's likely to continue to frustrate City's opponents for the foreseeable future."}