{"id": "College Football Playoff Projections: Week 10 Rankings and Bowl ForecastCollege Football Playoff Projections: Week 10 Rankings and Bowl Forecast'Group of Five' BowlsLower-Tier Power Five BowlsPower Five Bowls with PotentialTop Non-New Year's Six BowlsNon-CFP New Year's Six BowlsCollege Football PlayoffBowl Games by Conference", "paragraph": "The College Football Playoff selection committee has finally spoken, letting us know that Alabama, Clemson, LSU and Notre Dame would battle for the national championship if the season ended today.However, there are still four weeks left in the regular season—plus the all-important conference championship games to follow—during which these initial rankings will change considerably.Thus far in the CFP era, only 50 percent of teams that debuted in the Top Four also finished in the Top Four. Mississippi State was ranked No. 1 in the first-ever CFP Top 25, only to miss the playoff. And good luck to LSU after debuting at No. 3, because the team in that spot in the first ranking has missed the playoff all four years.On the flip side of that coin, Ohio State was No. 16 in the initial rankings four years ago, and the Buckeyes went on to win the national championship. The following year, Oklahoma started out at No. 15 and still found its way to the No. 4 seed.So, rather than telling us who will play for the title, this first batch of rankings paints a semi-clear picture of who won't get that shot.One team who may get more of a fair shake than it did last year is UCF. The Knights debut at No. 12, which is where they finished last season. They'll still need a ton of help in order to climb into the top four, but it's a significantly better start than last year (No. 18).Also worth noting on the initial rankings: Notre Dame debuts at No. 4 and doesn't have that much of an opportunity to prove more to the committee. The Fighting Irish only have one remaining game against a current top 25 team, and it's against No. 22 Syracuse. Meanwhile, No. 5 Michigan, No. 6 Georgia and No. 7 Oklahoma will all get multiple shots against ranked teams and could leapfrog Notre Dame, regardless of whether it suffers a loss.Read on for the full list of bowl projections heading into Week 10.Dec. 15R+L Carriers New Orleans Bowl: Arkansas State vs. Middle TennesseeNew Mexico Bowl: North Texas vs. NevadaAutoNation Cure Bowl: Akron* vs. Coastal CarolinaRaycom Media Camellia Bowl: Troy vs. Western Michigan                         Dec. 18Cheribundi Tart Cherry Boca Raton Bowl: Eastern Michigan vs. Louisiana-Lafayette*                   Dec. 19DXL Frisco Bowl: BYU* vs. Ohio                                                Dec. 21Makers Wanted Bahamas Bowl: Toledo vs. Florida InternationalFamous Idaho Potato Bowl: Boise State vs. Northern Illinois                              Dec. 22Hawaii Bowl: Hawaii vs. MarshallDollar General Bowl: Buffalo vs. Georgia Southern                                        Dec. 29NOVA Home Loans Arizona Bowl: Appalachian State vs. San Diego State*Teams taking spots that conferences are unable to fill        How about that Sun Belt action, eh?Troy began the week Tuesday by beating South Alabama soundly to secure bowl eligibility. Two days later, Georgia Southern ran all over Appalachian State to assume the driver's seat for the conference title. And Saturday, both Coastal Carolina and Louisiana-Lafayette orchestrated fourth-quarter comebacks to keep the dream alive for a bowl game.For a little while at the beginning of the month, it looked like the league might only be able to fill four of its five bowl spots. But now, there's a good chance that six teams from the Sun Belt get to six wins.Elsewhere in this tier, BYU—once ranked as high as No. 20 in the AP poll—is in danger of falling short of a bowl game following its 7-6 loss to Northern Illinois. The Cougars are now 4-4 with brutal road games remaining against Boise State and Utah. They ought to be able to finish 6-6 with wins over Massachusetts and New Mexico State, but it's hard to believe this is the same team that won a road game against Wisconsin earlier this season.Speaking of Northern Illinois, it will travel to Akron this week for an important bit of #MACtion that might not have a single touchdown. Akron (4-3) would be in great shape for a bowl game with a win, while Northern Illinois (5-3) is looking to improve to 5-0 in league play. But these are two of the lowest-scoring teams in the country, so it won't be pretty.Mitsubishi Motors Las Vegas Bowl (Dec. 15): California vs. Utah StateBad Boy Mowers Gasparilla Bowl (Dec. 20): Georgia Tech vs. MemphisLockheed Martin Armed Forces Bowl (Dec. 22): Houston vs. USC*Birmingham Bowl (Dec. 22): Colorado* vs. South FloridaSERVPRO First Responder Bowl (Dec. 26): Minnesota vs. UABMilitary Bowl (Dec. 31): Cincinnati vs. Virginia TechWalk-On's Independence Bowl (Dec. 27): Louisiana Tech vs. Temple*Teams taking spots that conferences are unable to fill             The Pac-12 is a disaster.The league only has two teams in this week's AP Top 25, and neither Utah nor Washington State is a serious threat to reach the playoff unless the final month of the season is a complete gong show for the rest of the country. Save for the 4-1 Cougars and 1-4 Oregon State, every Pac-12 team has at least two league wins and at least two league losses as everyone takes turns laying eggs.And yet, this train wreck is currently projected to send a higher percentage of its teams to bowl games than any other conference.Washington, Washington State and Utah already have six wins. California, Oregon and Stanford are each sitting at 5-3 with at least one more game on their schedules that they should win. Colorado is also 5-3 and could feasibly win any of its remaining games (at Arizona, vs. Washington State, vs. Utah, at California). USC is 4-4 and should win at least two of its next three against Oregon State, California and UCLA. And there's a good chance the season finale between Arizona and Arizona State will be a 5-6 showdown for bowl eligibility.That would put the 12-team league at nine bowl spots, hence Colorado and USC's taking a pair of spots in this tier.Just don't be fooled into thinking the conference is good if 75 percent of its teams get to six wins. After all, the Pac-12 also sent nine teams to bowl games last year, resulting in a 1-8 record.Dec. 26Cheez-It Bowl: Arizona State vs. Fresno StateQuick Lane Bowl: Duke vs. Maryland                                                                                      Dec. 27Academy Sports + Outdoors Texas Bowl: Texas A&M vs. Texas TechNew Era Pinstripe Bowl: Purdue vs. Syracuse                              Dec. 28Franklin American Mortgage Music City Bowl: Northwestern vs. South Carolina                         Dec. 29Belk Bowl: North Carolina State vs. Army*                       Dec. 31Hyundai Sun Bowl: Boston College vs. StanfordTaxSlayer Gator Bowl: Auburn vs. MiamiRedbox Bowl: Oregon vs. WisconsinAutoZone Liberty Bowl: Missouri vs. Oklahoma State       Oh, how the mighty have fallen.Miami and Auburn opened the season at No. 8 and No. 9, respectively in the AP poll. Not many (if any) experts had either team projected for the College Football Playoff, but that's because conference foes Alabama, Clemson and Georgia were expected to block their paths to the promised land. But they were popular picks to at least appear in a New Year's Six bowl. (I had Miami in the Peach Bowl against Penn State and Auburn in the Sugar Bowl against Oklahoma.)Two months later, each team is sitting at 5-3, nowhere near the AP Top 25 and projected for the Gator Bowl.Given the remaining schedules—Auburn still plays at Georgia and Alabama and hosts Texas A&M; Miami still plays at Georgia Tech and Virginia Tech and hosts Duke and Pittsburgh—odds are they'll both finish 7-5 and play in a bowl game that most fans couldn't pick out of a lineup.The Redbox Bowl is a similar story.Oregon wasn't much of a preseason contender at No. 24 in the AP poll. However, with a laughably weak nonconference schedule and games against both Washington and Stanford at home, it wasn't unreasonable to think the Ducks might win the Pac-12.The real letdown in this projected pairing is Wisconsin. The Badgers were No. 4 in the preseason poll and even received a first-place vote on one ballot. But after Saturday's loss to Northwestern, they're right there with Auburn and Miami, saddled with three losses and left with little hope of winning their division, let alone a national championship.At least it's not as bad as Florida State opening last season at No. 3 before needing to reschedule a game against Louisiana-Monroe just to become bowl-eligible. Still, no one saw these disappointing seasons coming.Dec. 28Valero Alamo Bowl: Texas vs. UtahCamping World Bowl: Iowa State vs. Virginia           Dec. 31San Diego County Credit Union Holiday Bowl: Michigan State vs. Washington                                                    Jan. 1Citrus Bowl: Mississippi State vs. Penn StateOutback Bowl: Florida vs. Iowa                                                               There are several matchups in this tier that could be even more compelling than some of the New Year's Six bowls. The projected Holiday Bowl is a battle between the teams who were the hipster picks to reach the playoff in the preseason. The Citrus Bowl would be a showdown between Joe Moorhead and his former team. And that Outback Bowl may well be the lowest-scoring bowl game ever.But rather than blather on about games that might not happen, let's use this space to show some love to the already-bowl-eligible team nobody saw coming: Virginia.When I say nobody, that's not an exaggeration. SB Nation's Bill Connelly had the Cavaliers pegged 14th out of 14 ACC teams. So did ESPN.com's Andrea Adelson and David M. Hale. And Athlon's Steven Lassan.Some thought Virginia would finish in 13th place ahead of Syracuse—which also already has six wins—but just about everyone was in agreement that the Wahoos would finish in last place in the Coastal Division. Six of the seven experts at CBS Sports thought so, and it was the clear consensus among the 148 media members at the ACC Kickoff in July.And why should we have expected anything else? The Cavaliers went 3-5 in conference play last year—each win by a one-possession margin against a team from the bottom half of the league—and lost quarterback Kurt Benkert, linebacker Micah Kiser and safety Quin Blanding. And for the third consecutive year, they had a recruiting class ranked roughly 60th in the nation, with nary a 5-star or 4-star recruit.Lo and behold, JUCO transfer quarterback Bryce Perkins has emerged as one of the most exciting players in the nation, and Virginia has defied the odds to find itself alone in first place in the ACC Coastal Division with a 4-1 league record.The Cavaliers host 3-1 Pittsburgh this coming week and finish the regular season at 3-1 Virginia Tech, so there's still plenty of work to be done before we pencil them into the ACC Championship Game against Clemson. But no matter how the final month plays out, this is a season that won't soon be forgotten in Charlottesville.Chick-fil-A Peach Bowl (Dec. 29): UCF vs. LSUBoth teams had an open date for Week 9, so nothing new to report here. It was a much-needed one for UCF, though, as it gave McKenzie Milton some extra time to recover from the ankle injury that kept him out of the previous game against East Carolina. As long as he's close to 100 percent, the Knights should have no problem running the table.Though they didn't play, LSU and UCF were the most intriguing teams heading into the unveiling of the first CFP Top 25. Even with a loss, the Tigers reasonably could have been the No. 1 team given the difficulty of their schedule. And after debuting at No. 18 before climbing to No. 12 last year, the Knights' starting spot in the eyes of the committee was an important one.                                                         Allstate Sugar Bowl (Jan. 1): Oklahoma vs. GeorgiaOklahoma and Georgia were excellent on defense in convincing wins this week. The Bulldogs forced three Florida turnovers and limited the Gators to 275 total yards. Meanwhile, Oklahoma held Kansas State to 245 yards. It was the Sooners' second consecutive game keeping an opponent below 300 yards—a massive improvement from allowing nearly 1,000 combined yards against Baylor and Texas.Both of these teams remain very much in the hunt for a spot in the playoff, but a rematch of last year's double-overtime classic in the Rose Bowl would be a fun consolation prize if these projections hold true.                                                      Rose Bowl (Jan. 1): Michigan vs. Washington StateMichigan had Saturday off, but Washington State picked up another key win over a ranked opponent, this time by a 41-38 margin at No. 24 Stanford. The Cougars are now 7-1 for the second straight season and are all but officially the Pac-12's only remaining hope for the playoff.Though they have a pulse, it's a faint one. This is clearly the weakest of the Power Five conferences, and Washington State played quite the unimpressive nonconference schedule (Wyoming, San Jose State and Eastern Washington). It would take serious chaos for the Cougs to play for a national championship. But it's looking more and more likely that they'll play in the Rose Bowl for the first time since the 2002 season.                                                                PlayStation Fiesta Bowl (Jan. 1): Kentucky vs. West VirginiaThis was projected to be Florida vs. Texas one week ago, but it's a brand new SEC-Big 12 clash following uninspiring losses by the Gators and Longhorns.West Virginia made one heck of an impression by blowing out Baylor on Thursday. The Mountaineers had lost (in ugly fashion) to Iowa State in their previous game and looked rather irritated that those of us in the national media spent the past two weeks talking as though Oklahoma and Texas are the only candidates to win the Big 12. With games remaining against Texas (this week), Oklahoma (regular-season finale) and a possible rematch with one of them in the Big 12 championship game, Will Grier and Co. could still sneak into the playoff picture.Kentucky's win over Missouri wasn't anywhere near as easy on the eyes, but it did keep the Wildcats in the hunt in advance of next week's humongous home game against Georgia. If they can pull off that upset, they'll win the SEC East and remain on the short list of viable candidates for the playoff. But even if they get smoked by the Bulldogs, the Wildcats should be able to win their last three games to finish 10-2. That ought to be enough for a NY6 bowl.Dec. 29Goodyear Cotton Bowl: No. 1 Alabama vs. No. 4 Ohio StateCapital One Orange Bowl: No. 2 Clemson vs. No. 3 Notre DameQuick reminder: These are projections for the end of the season. I am aware they are not the current rankings. But these are the four teams expected to win out and earn these spots.         Jan. 7National Championship: No. 1 Alabama over No. 2 Clemson                 No changes from one week ago, but it was mighty tempting to promote Georgia to No. 4 after its statement win over Florida. Clearing that hurdle makes the Bulldogs much more likely to win the SEC East and reach the conference championship game with an 11-1 record.However, the assumption is still that Georgia would lose to Alabama in said game, which would mean two losses and no conference championship. If other contenders also falter along the way, maybe that could be enough for a spot in the Top Four. But if Clemson and Notre Dame win out and either the Big Ten or Big 12 produces a one-loss champion—be it Michigan, Ohio State, Oklahoma or West Virginia—11-2 Georgia would be left on the outside looking in.It was also tempting to push Oklahoma up to No. 4 following its 51-14 beatdown of Kansas State, but the Sooners' case for a spot in the playoff got a bit worse when Texas lost to Oklahoma State. Not only did that outcome make Oklahoma's loss to the Longhorns look less impressive, but avenging that loss in the Big 12 Championship Game wouldn't be as noteworthy anymore either.Plus, did you know Oklahoma has not yet beaten a ranked team? Five of the Sooners' seven wins (Florida Atlantic, UCLA, Baylor, TCU and Kansas State) came against teams not currently projected to become bowl eligible. This offense passes the eye test, but the resume leaves a lot to be desired.Thus, we're sticking with the projected Big Ten champion at No. 4. Last week, ESPN's FPI projections gave Ohio State a 52.9 percent chance of defeating Michigan in the regular-season finale. Though neither team played this week, that number crept up to 54.1 percent for some reason.There should be some major shakeups next week, though. In addition to the gargantuan Alabama-LSU showdown, Notre Dame travels to Northwestern, Michigan hosts Penn State and Georgia will battle Kentucky for the SEC East title. Even if there aren't any upsets, both Georgia and Michigan would have stronger arguments for a spot in the projected Top Four with wins.The following teams are listed in alphabetical order within each conference.American (six teams): Cincinnati (Military Bowl), Houston (Armed Forces Bowl), Memphis (Gasparilla Bowl), South Florida (Birmingham Bowl), Temple (Independence Bowl), UCF (Peach Bowl)ACC (nine teams): Boston College (Sun Bowl), Clemson (Orange Bowl), Duke (Quick Lane Bowl), Georgia Tech (Gasparilla Bowl), Miami (Gator Bowl), North Carolina State (Belk Bowl), Syracuse (Pinstripe Bowl), Virginia (Camping World Bowl), Virginia Tech (Military Bowl)Big 12 (six teams): Iowa State (Camping World Bowl), Oklahoma (Sugar Bowl), Oklahoma State (Liberty Bowl), Texas (Alamo Bowl), Texas Tech (Texas Bowl), West Virginia (Fiesta Bowl)Big Ten (10 teams): Iowa (Outback Bowl), Maryland (Quick Lane Bowl), Michigan (Rose Bowl), Michigan State (Holiday Bowl), Minnesota (First Responder Bowl), Northwestern (Music City Bowl), Ohio State (Cotton Bowl), Penn State (Citrus Bowl), Purdue (Pinstripe Bowl), Wisconsin (Redbox Bowl)Conference USA (six teams): Florida International (Bahamas Bowl), Louisiana Tech (Independence Bowl), Marshall (Hawaii Bowl), Middle Tennessee (New Orleans Bowl), North Texas (New Mexico Bowl), UAB (First Responder Bowl)Independents (three teams): Army (Belk Bowl), BYU (Frisco Bowl), Notre Dame (Orange Bowl)Mid-American (seven teams): Akron (Cure Bowl), Buffalo (Dollar General Bowl), Eastern Michigan (Boca Raton Bowl), Northern Illinois (Famous Idaho Potato Bowl), Ohio (Frisco Bowl), Toledo (Bahamas Bowl), Western Michigan (Camellia Bowl)Mountain West (six teams): Boise State (Famous Idaho Potato Bowl), Fresno State (Cheez-It Bowl), Hawaii (Hawaii Bowl), Nevada (New Mexico Bowl), San Diego State (Arizona Bowl), Utah State (Las Vegas Bowl)Pac-12 (nine teams): Arizona State (Cheez-It Bowl), California (Las Vegas Bowl), Colorado (Birmingham Bowl), Oregon (Redbox Bowl), Stanford (Sun Bowl), USC (Armed Forces Bowl), Utah (Alamo Bowl), Washington (Holiday Bowl), Washington State (Rose Bowl)SEC (10 teams): Alabama (Cotton Bowl), Auburn (Gator Bowl), Florida (Outback Bowl), Georgia (Sugar Bowl), Kentucky (Fiesta Bowl), LSU (Peach Bowl), Mississippi State (Citrus Bowl), Missouri (Liberty Bowl), South Carolina (Music City Bowl), Texas A&M (Texas Bowl)Sun Belt (six teams): Appalachian State (Arizona Bowl), Arkansas State (New Orleans Bowl), Coastal Carolina (Cure Bowl), Georgia Southern (Dollar General Bowl), Louisiana-Lafayette (Boca Raton Bowl), Troy (Camellia Bowl)                                      Kerry Miller covers college football and men's college basketball for Bleacher Report. You can follow him on Twitter, @kerrancejames."}