{"id": "5-Star Forward Prospect Jeremiah Robinson-Earl Commits to VillanovaRelated", "paragraph": "Highly touted frontcourt star Jeremiah Robinson-Earl committed to the Villanova Wildcats, he announced Tuesday.\"It's a small community so everybody is real tight with each other and when I went on my visit I enjoyed how tight everybody is and how much they support the team,\" Robinson-Earl said in an interview with Rivals' Eric Bossi. \"Philadelphia is kind of a pro town but everybody there is down for Villanova and I thought that was cool.\"Robinson-Earl is the No. 4 power forward and No. 18 player overall in the 2019 recruiting class, per 247Sports' composite rankings.He's the second 5-star recruit to commit to Villanova, along with shooting guard Bryan Antoine. The Wildcats' 2019 class ranks second nationally, per 247Sports. Shooting guard Justin Moore and power forward Eric Dixon, both of whom are 4-star recruits, fill out the group.Gatorade recognized Robinson-Earl as the best player in the state of Kansas following his junior season in 2017-18. Not only was he pivotal in helping Bishop Miege High School win a state title, but he also averaged 21.5 points, 7.6 rebounds, 2.4 assists through the quarterfinals of the state tournament.Robinson-Earl is the son of Lester Earl, who was a 1996 McDonald's All-American and played collegiately for LSU and Kansas. \"It's exciting to have a father that was the No. 1 player in the country,\" Robinson-Earl said in an interview with Prep Hoops' Israel Potoczny. \"And looking at pictures and videos, my goal is to be even better than that, so it is a good bar to have—a father figure and to be better than your father.\"His father's experience on the recruitment trail will have provided invaluable insight for Robinson-Earl to ensure he made the best decision for his future.Robinson-Earl's numbers are collectively a testament to his skill set. He's a solid scorer and rebounder, and he can create scoring opportunities for his teammates. Kansas basketball reporter Matt Scott shared a highlight reel for Robinson-Earl:Jeremiah Robinson-Earl is on another level! Check out his Jayhawk Invitational Highlights! #KUBBALL @_JCRE_ https://t.co/G1WILOuS4lThe biggest question for Robinson-Earl isn't necessarily if he can become a star at the college level but whether he'll stick around long enough to make it happen. He doesn't profile as the kind of player who can immediately become Villanova's best player in his first season.Robinson-Earl more resembles Mikal Bridges rather than Deandre Ayton or Marvin Bagley III.Bridges spent three years at Villanova, improving with each season before entering the NBA after the 2017-18 campaign. Ayton and Bagley, on the other hand, were clearly at a different level as freshmen.Robinson-Earl will contribute right away for the Wildcats and should position himself for a starting role. His real value will come if he's willing to stay in Philadelphia beyond his freshman year. He has the potential to become a special talent, though it may take a couple of seasons to get there."}