{"id": "Oakland Raiders vs. San Francisco 49ers Odds, Analysis, NFL Betting PickRelated", "paragraph": "Not only are Oakland and San Francisco lousy teams at the moment, but they're also lousy bets, combining to go just 4-11 against the spread this season. Is either team worthy of a betting recommendation for this matchup scheduled for Thursday night in Santa Clara?   NFL point spread: The 49ers opened as 3.5-point favorites; the total was 47 early in the week, according to sportsbooks monitored by OddsShark. (Line updates and matchup report)NFL betting pick, via OddsShark computer: 32.2-17.4 49ers (NFL picks on every game)Check out the OddsShark podcast on iTunes or Spotify or at OddsShark.libsyn.com for more odds information, betting picks and a breakdown of this week’s top sports betting news.   Why the Raiders can cover the spreadThe Raiders are 0-3 both straight up and ATS their last three times out, so perhaps their best case can be made by pointing out how lousy the 49ers have been as of late.San Francisco lugs a six-game losing streak into this sordid affair, after falling at Arizona last week 18-15. The 49ers led that game 15-3 early in the fourth quarter, then gave up 15 unanswered points, the last eight on a Cardinals touchdown and two-point conversion with just 30 seconds left, to snatch defeat from the jaws of victory.On the afternoon, San Francisco was out-gained 321-267. The 49ers actually won the turnover battle 2-0 but could only turn that advantage into three points. They also only came away with three points from a first-and-goal from the Arizona 4-yard line early in the fourth quarter, when a touchdown would have given them a 19-3 lead.So the 49ers are now 0-5 SU and 2-3 ATS since losing quarterback Jimmy Garoppolo for the season to injury.  Why the 49ers can cover the spreadAfter beginning this season with high hopes, San Francisco is skidding through a lost campaign, losing its last six games in a row. So, just as before, maybe the best case for the 49ers can be made by pointing out how lousy Oakland has been.The Raiders tote a three-game losing streak into this week, after falling at home last week to Indianapolis 42-28. Oakland spotted the Colts the first 10 points of the game, rallied to lead 21-13 early in the third quarter but gave up touchdowns on four straight Indianapolis possessions to lose.On the day, the Raiders allowed 28 first downs, gave up 222 yards rushing and lost time of possession by a 37/23 tilt.Oakland has now been out-rushed by six of its seven opponents this season, including its last four. So far this NFL season teams that lose the ground battle are just 31-88 SU and 35-83 ATS.   Smart betting pickSometimes the best bets are the ones you don't make. For what it's worth home teams are 6-2 SU and 5-2-1 ATS on Thursday nights this season, but still, smart money here probably takes the night off.      NFL betting trendsThe total has gone under in three of the Raiders' last four games vs the 49ers. The Raiders are 1-3 SU and ATS in their last four games on the road vs the 49ers.The 49ers are 1-12 ATS in their last 13 games as favorite.     All NFL odds and betting trends according to Bleacher Report's official odds partner, OddsShark. Check out OddsShark on Twitter and Instagram or head to YouTube for more betting picks and analysis on this week's top games. You can also download the free odds tracker app."}