{"id": "Robin van Persie Reveals Plan to Retire at the End of the SeasonRelated", "paragraph": "Robin van Persie has said he will retire \"probably at the end of this season.\" The Feyenoord striker who also played for Arsenal, Manchester United and Fenerbahce told Dutch source AD (h/t Richard Fay of the Manchester Evening News): \"That was also the approach. I will be 36 years old and will have been a professional for 18 years.\"Van Persie scored 132 goals for the Gunners before winning the Premier League title with United following a controversial switch to the Red Devils in 2012.The striker admitted he is contented enough to consider the end of his career because of how much he's enjoyed returning to Feyenoord for a second spell: \"I had lost the fun. That's not how I wanted to end, without pleasure. The fun has returned at Feyenoord.\"If Van Persie does call time on his playing days when this campaign concludes, his career will be remembered for spectacular goals. He put together a catalogue of phenomenal volleys, most notably for Arsenal against Charlton Athletic in 2006, against Everton in 2011 with the Gunners and a memorable strike against Aston Villa during his time at United in 2013.Van Persie's production tailed off considerably following his first season with the Red Devils. Even so, he still managed to conjure an unforgettable diving header when the Netherlands beat holders Spain 5-1 in the group stage of the 2014 FIFA World Cup.Robin van Persie will officially retire from football at the end of the current season.\n\nWhat a goal-scorer this man was! 🎯 https://t.co/CafDEHBHcFThe memorable finish completed Van Persie's maturation from promising youngster to established striker at the highest levels of both club and international football.He arrived at Arsenal in 2004 as a troubled, 20-year-old winger from Feyenoord for just £2.75 million. Under the watchful eye of longtime Gunners manager Arsene Wenger, Van Persie developed into a prolific centre-forward.While many contend he left the Gunners for silverware, it's often forgotten Van Persie ended his first season in north London with a trophy. He helped Arsenal beat United on penalties to lift the 2005 FA Cup, scoring in the shootout in Cardiff.His time at Arsenal wasn't without trouble, though, as the club stuck by Van Persie through several lengthy injury layoffs. Faith was rewarded as he showed the capability to play as a lone striker and came of age in 2011/12, scoring 37 goals in all competitions and winning the Premier League Golden Boot in the process.Unfortunately for Arsenal, Van Persie chose that summer to announce he wouldn't sign a new contract. He made his intention clear in a statement on his website (h/t BBC Sport). It was the moment his relationship with many Gunners supporters turned sour.Nonetheless, Van Persie's impact at United was instant and considerable. He won another Golden Boot while helping a team who lost the title on goal difference the previous season capture the trophy by 11 points.Robin van Persie for Man Utd in the Premier League in 2012/13:\n\n• 38 games\n• 26 goals\n• 9 assists\n• 1 title\n\nThat only gets him in at No.8. 👀 https://t.co/yZ3pSsVkznSir Alex Ferguson's retirement in 2013 ushered in a period of transition at United, and RVP struggled with injury under first David Moyes and then Louis van Gaal. He moved to Fenerbahce in 2015 but voided his deal to return to Rotterdam back in January.Van Persie's return led to a KNVB Cup win for Feyenoord, with the striker reaching a landmark along the way:3️⃣0️⃣0️⃣ G o a l s !\n\n✨ @Persie_Official ✨\n\n#feywil https://t.co/0Q3n7mE9IgAt his best, Van Persie has been a dynamic forward who combined the appetite for goal of a classic No. 9 with the eye for a pass of a stylish No. 10. His technique, flair and power led to many moments sure to live long in fans' memories."}