{"id": "Lionel Messi Says La Liga 'More Competitive Than Ever' After Barca's Betis LossRelated", "paragraph": "Barcelona forward Lionel Messi has said La Liga is \"more competitive than ever\" following his side's shock loss to Real Betis at the Camp Nou on Sunday. The Spanish champions were humbled 4-3 in front of their own supporters and Betis played some spellbinding football at times. It was a result that meant Barcelona's lead at the top of the table was reduced to just one point, with Sevilla, Atletico Madrid and Alaves in pursuit.Speaking at Marca's awards on Monday, Messi said it's good for the division that there's a competitive title race, per Ivan San Antonio of Sport.\"It's good that the league is more competitive than ever,\" said the Blaugrana icon. \"There are no easy games. Anyone can beat anyone and that's good for the spectators. I hope it stays like this.\" While it's no surprise to see the likes of Barcelona and Atletico Madrid at the top end of the table, Sevilla have shocked plenty with the way they've started the season and Alaves have been a massive surprise package.In addition, Barcelona's local rivals Espanyol are in a lofty fifth position, while Real Madrid are languishing down in sixth spot despite a recent recovery under Santiago Solari.The performance of Betis, who are struggling down in 12th after their impressive fifth-place finish last season, was indicative of the depth of quality there is in the Spanish division at the moment.The Andalusians are a team that have shown they are capable of going to some of the biggest stadiums in the world and picking up wins; they recently beat AC Milan at the San Siro in the UEFA Europa League too:🔝 QUIQUE SETIEN 🔝\n\n✅ Santiago Bernabeu\n✅ Camp Nou \n\nSetien is the first visiting coach to win at both stadiums in 10 years! 👍 https://t.co/T9XYrF0LJNMessi returned to the Barcelona side on Sunday following a recent layoff due to a fractured arm and it's a testament to Betis that he was in brilliant form and they still managed to find a win.The Argentina international excelled as only he can, netting twice and doing his utmost to drag Barcelona back into the game. In the end, it wasn't enough to get a result, but the Blaugrana supporters will at least be glad to have their main man back with some big challenges to come.It was the first time ever that Messi has grabbed a brace in a match and they've been defeated:1 - Barcelona have lost a game in which Lionel Messi has scored two or more goals for the first time ever in all competitions. Kryptonite. https://t.co/bgjC1NtDMDWhile it's anticipated that the likes of Barca, Real and Atletico will eventually pull clear of the rest of the pack, this season in Spain the ground does appear ripe for surprises. After all, earlier in the term then-bottom club Leganes were able to earn a shock win over Barcelona too.If Sevilla, Alaves and Espanyol can continue to keep pace with some of these sides ahead of the winter break then a fascinating 2019 is in store in La Liga. However, with a player like Messi on their books, the Blaugrana are likely to have an edge over everyone once again this season."}