{"id": "Guillem Balague: Liverpool Will Not Make Barcelona an Offer for Ousmane DembeleRelated", "paragraph": "Liverpool will not pursue a deal to bring Ousmane Dembele from Barcelona to Anfield, according to Spanish football expert Guillem Balague.The journalist said the Reds are happy with their attacking options and do not want to purchase the former Borussia Dortmund starlet.Speaking on his YouTube channel (h/t James Walters of the Daily Express), Balague explained Dembele's representatives have met with Barca after the player's professionalism was called into question, but the Premier League giants have no interest in the Frenchman.Balague said:\"In terms of Liverpool, they have not made an offer. In fact, their attention is to keep with what they have and to improve what they have. The attack of Liverpool could get better but I got the impression that, regarding Dembele, he is a player who could make the balance that is perfect a bit unbalanced as he could bring in the same feeling at Barcelona‚—he can do whatever he wants with the ball.\"Balague added Dembele is \"shy,\" does not have many friends in the Barca squad and will have to fight for his place at the Camp Nou.A thigh injury severely hampered Dembele's first campaign at Barca. The France international started only 12 games in La Liga after his blockbuster switch from BVB in 2017.According to Mundo Deportivo (h/t Sport Witness' Naveen Ullal), Arsenal are monitoring the player in Catalonia. Gunners head of recruitment Sven Mislintat previously assisted Demeble to sign for Dortmund during his spell at the Bundesliga team.Liverpool do not need an attacker like Dembele, as Mohamed Salah and Sadio Mane flank Roberto Firmino as the No. 9.Reds boss Jurgen Klopp would be a fine influence on the 21-year-old, but the Premier League might be a difficult place for the attacker to continue his education.Dembele has reportedly found the adversity he's faced in Spain difficult to handle, and the combative arena of English football might cause him additional issues.Arsenal would be a suitable destination if Dembele chooses an adventure in the Premier League, as Unai Emery is rebuilding the Gunners around Mesut Ozil, Alexandre Lacazette and former BVB striker Pierre-Emerick Aubameyang.    Dembele will continue to gain opportunities at Barca, but if his performances do not quickly improve, the Spanish champions could begin to explore options of a swift sale to recoup their £135.5 million investment."}