{"id": "Fantasy Football Week 11 Rankings: Updated Positional Breakdown for Flex and PPRRelated", "paragraph": "Green Bay Packers running back Aaron Jones continued his torrid pace with 103 yards from scrimmage and two touchdowns in a 27-24 loss to the Seattle Seahawks on Thursday evening. The ex-UTEP star now has 487 yards from scrimmage and five touchdowns in his last five outings.A few other players have been on rolls of late, and you can check the top-40 flex rankings below to see if they're predicted to perform well in Week 11.You can also review projections (full point-per-reception scoring) alongside analysis on two players closer to the start/sit fringe.          Top-40 Flex Rankings (Full PPR Scoring)1. Los Angeles Rams WR Brandin Cooks (vs. Kansas City Chiefs): 10 REC, 180 YDS, 2 TD (40 points)2. New York Giants WR Odell Beckham Jr. (vs. Tampa Bay Buccaneers): 9 REC, 180 YDS, 2 TD (39 points)3. Arizona Cardinals RB David Johnson (vs. Oakland Raiders): 7 REC, 190 YDS, 2 TD (38 points)4. Kansas City Chiefs WR Tyreek Hill (at Los Angeles Rams): 8 REC, 170 YDS, 2 TD (37 points)5. Los Angeles Rams RB Todd Gurley (vs. Kansas City Chiefs): 4 REC, 140 YDS, 3 TD (36 points)6. Philadelphia Eagles TE Zach Ertz (at New Orleans Saints): 10 REC, 140 YDS, 2 TD (36 points)7. New Orleans Saints WR Michael Thomas (vs. Philadelphia Eagles): 9 REC, 120 YDS, 2 TD (33 points)8. New Orleans Saints RB Alvin Kamara (vs. Philadelphia Eagles): 5 REC, 140 YDS, 2 TD (31 points)9. Carolina Panthers RB Christian McCaffrey (at Detroit Lions): 5 REC, 140 YDS, 2 TD (31 points)10. Los Angeles Chargers RB Melvin Gordon (vs. Denver Broncos): 5 REC, 130 YDS, 2 TD (30 points)11. Minnesota Vikings WR Adam Thielen (at Chicago Bears): 11 REC, 130 YDS, 1 TD (30 points)12. Dallas Cowboys RB Ezekiel Elliott (at Atlanta Falcons): 3 REC, 140 YDS, 2 TD (29 points)13. Jacksonville Jaguars RB Leonard Fournette (vs. Pittsburgh Steelers): 3 REC, 140 YDS, 2 TD (29 points)14. Los Angeles Rams WR Robert Woods (vs. Kansas City Chiefs): 9 REC, 130 YDS, 1 TD (28 points)15. Kansas City Chiefs TE Travis Kelce (at Los Angeles Rams): 6 REC, 90 YDS, 2 TD (27 points)16. Atlanta Falcons WR Julio Jones (vs. Dallas Cowboys): 8 REC, 110 YDS, 1 TD (25 points)17. New York Giants RB Saquon Barkley (vs. Tampa Bay Buccaneers): 6 REC, 130 YDS, 1 TD (25 points)18. Houston Texans WR DeAndre Hopkins (at Washington Redskins): 8 REC, 100 YDS, 1 TD (24 points)19. Pittsburgh Steelers RB James Conner (at Jacksonville Jaguars): 5 REC, 130 YDS, 1 TD (24 points)20. Chicago Bears RB Tarik Cohen (vs. Minnesota Vikings): 6 REC, 120 YDS, 1 TD (24 points)21. Kansas City Chiefs RB Kareem Hunt (at Los Angeles Rams): 5 REC, 130 YDS, 1 TD (24 points)22. Tennessee Titans RB Dion Lewis (at Indianapolis Colts): 7 REC, 100 YDS, 1 TD (23 points)23. Baltimore Ravens WR John Brown (vs. Cincinnati Bengals): 5 REC, 120 YDS, 1 TD (23 points)24. Denver Broncos WR Emmanuel Sanders (at Los Angeles Chargers): 7 REC, 100 YDS, 1 TD (23 points)25. Los Angeles Chargers WR Keenan Allen (vs. Denver Broncos): 8 REC, 90 YDS, 1 TD (23 points)26. Philadelphia Eagles WR Golden Tate (at New Orleans Saints): 8 REC, 90 YDS, 1 TD (23 points)27. Tampa Bay Buccaneers WR DeSean Jackson (at New York Giants): 5 REC, 110 YDS, 1 TD (22 points)28. Dallas Cowboys WR Amari Cooper (at Atlanta Falcons): 7 REC, 90 YDS, 1 TD (22 points)29. Pittsburgh Steelers WR JuJu Smith-Schuster (at Jacksonville Jaguars): 7 REC, 90 YDS, 1 TD (22 points)30. Indianapolis Colts WR T.Y. Hilton (vs. Tennessee Titans): 6 REC, 100 YDS, 1 TD (22 points)31. Minnesota Vikings WR Stefon Diggs (at Chicago Bears): 8 REC, 80 YDS, 1 TD (22 points)32. Cincinnati Bengals WR Tyler Boyd (at Baltimore Ravens): 6 REC, 90 YDS, 1 TD (21 points)33. New York Giants WR Sterling Shepard (vs. Tampa Bay Buccaneers): 6 REC, 80 YDS, 1 TD (20 points)34. Cincinnati Bengals RB Joe Mixon (at Baltimore Ravens): 4 REC, 100 YDS, 1 TD (20 points)35. Indianapolis Colts RB Marlon Mack (vs. Tennessee Titans): 3 REC, 100 YDS, 1 TD (19 points) 36. Tampa Bay Buccaneers WR Mike Evans (at New York Giants): 6 REC, 70 YDS, 1 TD (19 points)37. Arizona Cardinals WR Larry Fitzgerald (vs. Oakland Raiders): 5 REC, 80 YDS, 1 TD (19 points)38. Philadelphia Eagles WR Alshon Jeffery (at New Orleans Saints): 6 REC, 70 YDS, 1 TD (19 points)39. Carolina Panthers TE Greg Olsen (at Detroit Lions): 6 REC, 70 YDS, 1 TD (19 points)40. Pittsburgh Steelers TE Vance McDonald (at Jacksonville Jaguars): 6 REC, 70 YDS, 1 TD (19 points)Yardage totals listed for running backs are from scrimmage (rushing and receiving combined).                       Indianapolis Colts RB Marlon Mack (vs. Tennessee Titans)Indianapolis Colts running back Marlon Mack has a tough challenge ahead against the Tennessee Titans, who have allowed the fewest points per game in the league.However, Mack's recent volume of touches still make him a must-start for Week 11. He's averaged 17.2 touches over his five games this season, with a high of 27 against the Oakland Raiders. Mack is also a key player after the Colts cross the opponent's 20-yard line, as he's averaged 3.2 red-zone rushes per game. Despite missing four games, Mack is also tied for 12th in the league with six red-zone rushes inside the five-yard line.The concern for Mack's Week 11 fantasy performance is whether the Titans jump out to a sizable lead, which could force the Colts to move more to the pass. If that's the case, then running back Nyheim Hines may take some of Mack's looks. Hines has 37 catches (average of 4.3 receptions per game) for 206 yards this year, while Mack averages just 1.6 receptions per contest.Still, the Colts are 1.5-point home favorites, per OddsShark, and winners of three straight games. Chances are Indianapolis won't play catch-up all game, which would increase Mack's odds of being the team's primary back for four quarters.Mack is also one of the more efficient ball-carriers in the league. In addition to his 5.3 yards per carry, the second-year pro is third in DVOA (defense-adjusted value over average) among all running backs with at least 50 carries, per Football Outsiders.That could prove beneficial against a Titans run defense that ranks in the bottom 10 in adjusted line yards, according to Football Outsiders.Mack may have just rushed for only 29 yards on 12 carries against the Jacksonville Jaguars on Sunday, but the pluses outweigh the minuses here. Start him in season-long leagues with confidence.                     Pittsburgh Steelers TE Vance McDonald (at Jacksonville Jaguars)One of the NFL's more efficient tight ends, Vance McDonald of the Pittsburgh Steelers has caught 30 of his 38 targets (78.9 percent) for 390 yards and two touchdowns. Not only does that place him fifth among all qualified tight ends, per Pro Football Reference, but McDonald is also eighth in his position group in yards per reception (13.0).While a matchup with the Jaguars (top 10 in points allowed per game as well as DVOA) may look tough at first glance, McDonald may have a matchup advantage.Evan Silva of Rotoworld wrote about the Jags' vulnerability to tight ends in his Week 11 matchups column:\"In Weeks 4-10, tight ends caught 26-of-38 targets (68%) for 362 yards (9.53 YPA) and six touchdowns against Jacksonville. Eric Ebron and Mo Alie-Cox dropped four TDs on them just last week. Targeted a career-high 16 times in January's playoff loss, McDonald is an upside TE1 play in this rematch. Jaguars SS Barry Church has stood out as an especially big liability in coverage.\"Those six touchdowns Silva mentioned have all come in the past two weeks. Whether that's a product of a serious schematic issue of late or just coincidence is up for debate, but the numbers are still alarming enough to think that McDonald can reap the benefits of facing a Jags defense with recent struggles versus his position.McDonald also caught 10 passes for 112 yards in the 2017 AFC Divisional Round versus the Jags. While those numbers will be tough to match on Sunday, McDonald could be the X-factor for a Pittsburgh victory. He's a clear must-start at tight end unless you have a better option, such as Zach Ertz of the Philadelphia Eagles."}