{"id": "LeBron James: 'I Almost Cracked' During Lakers' Early-Season StrugglesRelated", "paragraph": "Things haven't been easy for LeBron James since signing with the Los Angeles Lakers, and the 14-time All-Star admitted he had to step back and reflect on his current situation so as not to overreact.\"I haven't changed anything outwardly, but you know me. You know how I am,\" James said, per Yahoo Sports' Chris Haynes. \"I almost cracked [last week]. I had to sit back and remind myself, '[Expletive], you knew what you were getting yourself into.' This process has been good for me. I just have to continue being patient.\"For fans of the Cleveland Cavaliers, the Lakers' start looks somewhat familiar.The Cavs started 5-7 in 2014-15, James' first year back, and James told reporters he was intentionally letting some of the team's young players sink or swim on their own to break them out of bad habits they had developed.At that time, though, James probably wasn't feeling the kind of pressure to deliver that he is now in Los Angeles. Nobody reasonably expects the Lakers to contend for an NBA title, but finishing eighth in the Western Conference—where the team presently sits—would be a disappointment.The honeymoon period James experienced upon his return to Cleveland is nonexistent in Los Angeles.James also had to read a report from ESPN.com's Adrian Wojnarowski and Dave McMenamin that president of basketball operations Magic Johnson was pressing head coach Luke Walton to deliver results now. Questions about the head coach's job security is probably the last thing James wanted to see after a drama-filled Cavs tenure.Things appear to be turning around for the Lakers, though. They've won five of their last six games, and Tyson Chandler is already making an impact on his new team. Chandler is averaging 3.0 points, 8.3 rebounds and 1.3 blocks through three games, and he blocked Trae Young's layup attempt at the buzzer in Sunday's 107-106 win over the Atlanta Hawks.There were always going to be growing pains after James signed with the Lakers. The team won 35 games last season and had to account for a number of veteran additions alongside James.As LeBron noted, patience is important as he and the team work through their early issues."}