{"id": "College Football Playoff Notebook: LSU's Rank Trivial, Only Alabama Game MattersRelated", "paragraph": "Heading into the unveiling of the first College Football Playoff rankings Tuesday, LSU fans were either going to be thrilled with a top-four spot or fuming at getting snubbed.Either way, it never mattered.    The Tigers ultimately checked in at No. 3, a deserved recognition for their 7-1 start to the campaign. Ed Orgeron's club has outplayed preseason expectations with a trio of marquee wins against Miami, Auburn and Georgia.But the only opponent that matters is coming to Baton Rouge this weekend. A win against the No. 1 Alabama Crimson Tide would secure LSU's spot as a national championship contender. A loss would remove the Tigers from the CFP discussion.It's that simple.Last year, Auburn nearly became the first program to overcome a two-loss record because of its terrific wins. Had the Tigers edged the Georgia Bulldogs in the SEC title game, they likely would've secured a CFP spot thanks to three total victories over Georgia and Alabama. LSU would fall to 7-2 with a loss against Alabama, so would these be similar cases? Doubtful.As impressive as the Tigers' resume once seemed, it's looking slightly worse as of late.Miami and Auburn haven't lived up to their early-season hype, as they're entering Week 10 at 5-3 apiece. While both schools held Top 10 rankings at the time they faced LSU, only No. 6 Georgia remains ranked.The wins against Miami and Auburn aren't insignificant, but context matters.Ohio State, which is ranked 10th in the CFP poll, shouldn't be getting much credit for defeating TCU, a team that was ranked 15th in the AP poll at the time but now has five losses. Notre Dame's triumph over then-No. 14 Michigan looks a lot more impressive than its dismantling of then-No. 7 Stanford.LSU unequivocally deserves praise for beating Miami and Auburn, but those victories must be weighted properly.When compared to an eventual conference champion, the Tigers likely won't boast a clear edge in strength of victory. Since Alabama would clinch the SEC West with a win, LSU couldn't flaunt an SEC title, either. None of that matters if LSU dethrones the Tide, though.The Tigers enter the matchup as 14.5-point underdogs, per OddsShark, and will be without star linebacker Devin White for the first half due to a targeting suspension. There wouldn't be a more impressive win in college football this season.With Alabama being a 14-point favorite at LSU, In the last 40 years, only one other Top 4 team has been a double-digit dog on its home field - 2013 No. 4 Auburn +10.5 vs No. 1 Alabama. Also known as the “Kick Six” Game.If LSU does beat Alabama, it would need to navigate a remaining schedule of Arkansas, Rice and No. 20 Texas A&M to reach the SEC Championship Game against Georgia or Kentucky. The College Football Playoff would await with a win.LSU could still make the playoff even if it lost to Georgia in the SEC title game rematch if the perfect sequence of chaos happened elsewhere. But that scenario involves beating Alabama, too.In other words, LSU's playoff fate this season hinges on Saturday's result.         The Other SEC ShowdownSaturday is only the first weekend of November, but the SEC East champion will already be determined following No. 6 Georgia's trip to No. 9 Kentucky.Both programs hold a 5-1 conference record, and the SEC plays an eight-game league schedule. Since the winner will improve to 6-1 and the loser will fall to 5-2, the final result for either team will have no impact on the conference standings. Even if No. 11 Florida created a three-way tie at 6-2, Saturday's winner will be 2-0 against the tied teams.The remaining games will, however, affect each team's chances of making it to the playoff.Last season's national runner-up, Georgia, entered the 2018 campaign as a favorite to reach the CFP. While the Dawgs have dealt with some issues on both sides of the ball, they still remain in position to make a return trip. Auburn, UMass and Georgia Tech await UGA following the pivotal clash in Lexington.Kentucky wasn't expected to be here, but the Wildcats are a win away from making things interesting. Their remaining schedule includes Tennessee, Middle Tennessee and Louisville. It can't get much easier than that for a fringe contender.Saturday's winner will clinch the SEC East and stay alive in the CFP chase. The loser will be out of both.         Notre Dame's Tricky November BeginsWhat do the losses of LSU, Michigan, Georgia, Ohio State, Washington State, Kentucky and West Virginia all have in common? They were all road games. Throw in Oklahoma's neutral-site clash with Texas, and every one-loss Power Five team dropped that contest away from home.Although the fourth-ranked Irish will likely be favored in all four of their remaining games, only one of those contests is in South Bend.Notre Dame heads to Northwestern in Week 10, hosts Florida State in Week 11, takes on No. 19 Syracuse at Yankee Stadium in Week 12 and travels to USC for the regular-season finale.There's also that pesky November trend hovering over Brian Kelly.How will this November be different for #NotreDame? \n\n\"They have a process they know has gotten them here. They know the process works. They've got four weeks.\"From 2013 through 2017, Notre Dame posted a 29-10 record in pre-November games. But in the closing month, the Irish were 9-12, including a 1-8 mark on the road against power-conference opponents.Notre Dame might be able to survive one loss, although that would involve help elsewhere. Kelly's club isn't guaranteed a playoff spot unless it finishes the regular season 12-0.The upcoming slate is favorable, but the Irish must overcome a pair of ugly trends to stay perfect.        West Virginia Clinging to Slim HopesNovember will be similarly challenging for the No. 13 Mountaineers.While the letdown at Iowa State didn't eliminate West Virginia from playoff contention, the loss meant Dana Holgorsen's team cannot afford another one. And this month, the 'Eers will travel to both No. 17 Texas and Oklahoma State and finish at home against No. 7 Oklahoma.Yeesh.According to OddsShark, West Virginia is a two-point underdog for Saturday's clash with Texas, which saw its CFP aspirations vanish in a loss to Oklahoma State on Saturday. The Longhorns could now play spoiler and bounce the Mountaineers from the conversation.Should Will Grier and Co. successfully navigate the trip to Austin, a date with hapless TCU should send West Virginia to 8-1. Knocking off the Oklahoma programs is possible, but that's a daunting task.As if that's not enough, the Mountaineers would then have a rematch with Oklahoma or Texas in the Big 12 Championship Game to secure a place in the College Football Playoff.What a month.            Follow Bleacher Report writer David Kenyon on Twitter @Kenyon19_BR."}