{"id": "USA F1 Grand Prix 2018 Qualifying: Lewis Hamilton Takes Pole PositionRelated", "paragraph": "Lewis Hamilton claimed pole position for the 2018 USA Formula One Grand Prix after finishing fastest in qualifying on the Circuit of the Americas in Austin, Texas, on Saturday.Hamilton was quickest around the track in Q1 and Q3, while Ferrari's Kimi Raikkonen set the pace in Q2.It's the third pole for Hamilton in America, and he's never lost this race from the position. Hamilton can clinch a fifth world title if he wins on Sunday and nearest rival Ferrari's Sebastian Vettel finishes third or lower.Vettel will start fifth, despite being second-fastest in Q3, because of a grid-place penalty levied against him during practice sessions on Friday.Here are the final times from Q3:QUALIFYING CLASSIFICATION: Job done for Hamilton as he edges ever closer to a fifth world title #USGP 🇺🇸 #F1 https://t.co/lVwY6NUkNdEarlier, the day began with Vettel finishing fastest in FP3. He was quicker than Ferrari team-mate Raikkonen and Hamilton:FP3 CLASSIFICATION: So far, so fast for @ScuderiaFerrari 👏 #USGP 🇺🇸 #F1 https://t.co/hQlhBVueeLVettel had given himself some welcome momentum ahead of qualifying, even if he knew his best efforts later in the day would count for little. The three-place grid penalty incurred on Friday for \"not slowing sufficiently for a red flag,\" per BBC Sport's Andrew Benson, meant Vettel would only begin on fourth in the race proper if he took pole from qualifying.Vettel's chances of grabbing pole from qualifying looked good early on during Q1. The 31-year-old clocked his first lap at one minute and 34.569 seconds.As good as the lap was, Mercedes soon bettered it, with Valtteri Bottas notching 1:34.518, before Hamilton went even quicker at 1:34.130, about four-tenths of a second faster than Vettel.While Mercedes and Ferrari were enjoying Q1, it was a different story for Red Bull after disaster struck Max Verstappen:Here's the damage on @Max33Verstappen's car 🔎 sustained going over the sausage kerbs at Turn 15 #USGP 🇺🇸 #F1 https://t.co/12kFiCNMJ7There was also disappointment for Fernando Alonso, who was racing in his final USA GP before retirement. His last race in Austin ended with elimination:Out in #USGP Q1: Alonso, Sirotkin, Stroll, Ericsson, Vandoorne\n\nSky Go: https://t.co/2oGOX6KR8q \n\nLive blog: https://t.co/3ax3bFpuW2 https://t.co/LZWW8lqtLEPierre Gasly was seventh-fastest during the session, but the Honda driver had his time disallowed after exceeding track limits.Things ended with Hamilton fastest, as the 33-year-old appeared determined to gain pole before securing a fifth world title on Sunday:Q1 CLASSIFICATION: Mercedes, Ferrari, Red Bull #USGP 🇺🇸 #F1 https://t.co/2fZFU6VKwYQ2 brought a change for Ferrari, as Raikkonen switched to the ultrasoft tyres. He clocked a time of 1:32.884, while Hamilton, Bottas and Vettel went out on the supersofts.Hamilton was third-fastest with five minutes to go, and his position stayed the same despite another run and a faster lap. It meant the session belonged to Raikkonen:Q2 CLASSIFICATION: An 11th consecutive Q3 appearance for @RGrosjean 👏 \n#USGP 🇺🇸 #F1 https://t.co/JBysyoYegpHaas F1's Kevin Magnussen joined Verstappen and others who were officially eliminated after Q2:And out in #USGP Q2...\n\nSainz, Magnussen, Gasly, Hartley, Verstappen \n\nSky Go: https://t.co/2oGOX6KR8q  \nLive blog: https://t.co/3ax3bFpuW2 https://t.co/g72laggYrcQ3 belonged to Hamilton after he earned provisional pole by going quicker than team-mate Bottas' lap of 1:32.616. Hamilton went faster at record-setting speed, with Vettel less than a tenth of a second slower:🔥 NEW TRACK RECORD! 🔥\n\nLewis goes P1 with his first Q3 effort - it’s a 1:32.567 and provisional pole! \n\n😧 0.088s separates #LH44 and VET! \n\n#USGP 🇺🇸 #F1 https://t.co/9TJRC2PUtIThe second set of runs gave Raikkonen a chance to make up for a relatively sluggish first lap on a new set of tyres. Raikkonen temporarily took pole as Hamilton lost some time on the middle sector, but the latter soon regained pole.Vettel still had the chance for pole, but he could only manage to finish second-fastest, leaving him to start fifth thanks to the penalty on Sunday. He was disappointed to have missed out by such a slender margin:VETTEL: \"It was pretty close, it's always a shame when you miss out by that little bit of time, just six hundredths\" #USGP 🇺🇸 #F1 https://t.co/s5wVtRCMX3Ferrari will have Raikkonen next to Hamilton and on a faster tyre. If he can keep the pressure on Hamilton, Vettel may be able to eventually snatch second and keep the title battle going for at least one more race."}