{"id": "Mohamed Salah, Sadio Mane Lead Liverpool to UCL Win over Red Star BelgradeRelated", "paragraph": "Mohamed Salah, Sadio Mane and Roberto Firmino all scored as Liverpool won for the second time in three matches in Group C of the 2018 UEFA Champions League after beating Red Star Belgrade 4-0 at Anfield on Wednesday night.Firmino opened the scoring before Salah added a brace, with his second coming from the penalty spot six minutes after the restart. Mane won the spot-kick and later earned another he saw saved by Red Star goalkeeper Milan Borjan.Mane added a fourth to give Liverpool a commanding victory.   Xherdan Shaqiri Is Philippe Coutinho's Natural SuccessorSelling Philippe Coutinho to Barcelona in January didn't stop Liverpool from reaching last season's Champions League final. Yet despite the run, it's still fair to say the Reds have struggled to replace the creative influence Coutinho exerted.Until now, that is. Xherdan Shaqiri is Coutinho's natural successor in the No. 10 role at the tip of midfield. The diminutive Switzerland international who usually thrives on the flanks took to a central role brilliantly against Red Star.Shaqiri showed an impressive range of passing born from intelligence, technique and vision.CHANCE! Xherdan Shaqiri lifts a clever ball over the top for Mohamed Salah but Red Star keeper Milan Borjan does well to nick the ball off the Egyptian's toes. #LIVREDThose qualities came to the fore for Firmino's goal, a move started by Shaqiri, who executed a snappy one-two before sliding left-back Andrew Robertson in behind to tee up the goalscorer.Shaqiri was even better for Liverpool's second as he ghosted into a pocket of space between the midfield and forward lines to release Salah with a deft, first-time touch. The contribution underlined Shaqiri's growing importance as a provider:The assist providers for Liverpool's last four goals across all competitions:\n\n🅰️ Xherdan Shaqiri\n🅰️ Xherdan Shaqiri\n🅰️ Andy Robertson\n🅰️ Xherdan Shaqiri\n\nThe Reds' Swiss Army Knife cutting teams apart. https://t.co/s6bFE7gpwHCreating goals is arguably the principal job of a No. 10. Yet it's just as important to add artistry to possession with incisive flair.There was plenty of the latter in Shaqiri's performance:All about Shaqiri adding the creative spark this half as Salah makes it 2-0. Surely playing his way into a regular starting place. Perfectly weighs his passes.Injury problems for Alex Oxlade-Chamberlain and Adam Lallana have robbed Liverpool of the technique and craft their midfield has missed since Coutinho moved to the Camp Nou.It's an issue Shaqiri is unexpectedly solving by proving he's more than a tricky winger.   Fabinho an Obvious Upgrade over Jordan HendersonA positive change is also in the offing at the other end of Liverpool's midfield after Fabinho provided an answer for why the Reds paid £43.7 million for him this summer.The former AS Monaco man had barely featured before Wednesday, but he made the most of his first Champions League start for Liverpool. However, the answers Fabinho provided spell trouble for Jordan Henderson.Through a mix of tough tackling, smart positional sense and quality technique, Fabinho showed he's an obvious upgrade over England international Henderson. There's more steel, energy and culture to the Brazilian's game.Fabinho showed the latter with some deft work in the build-up to the opening goal. He also proved his chops as an enforcer by leaving more than one Red Star player in a heap.It took just one half for Fabinho to win plaudits:Fabinho very impressive in that opening forty-five, too. Quick in the tackle while showing the confidence to drive forward with the ball. Hope to see more of him in the coming games.Fabinho has had a brilliant half. Clearly a lot more in tune with the demands of Klopp's midfield now.His second-half showing was just as impressive as he showcased his skill in possession by lifting a gem of a pass over the top for Trent Alexander-Arnold. Henderson's battling qualities commend his place in the pressing game that manager Jurgen Klopp loves. However, Fabinho looks like the kind of astute holding player who can bring this Liverpool midfield to another level.What's Next?Liverpool host Cardiff City in the Premier League on Saturday, while Red Star face Macva Sabac. Both teams meet again in this tournament on Tuesday, November 6 in Belgrade."}