{"id": "Pac-12 ADs Endorse Replay Improvements After Controversial Targeting ReversalRelated", "paragraph": "An internal review of the instant replay system in place for Pac-12 football found there were not \"adequately clear and thorough procedures\" in place following a targeting controversy in a September game between USC and Washington State. Ralph D. Russo of the Associated Press shared a statement from the athletic directors of the conference reading, in part, \"The Athletic Directors of the Pac-12 Conference have today endorsed the findings and recommendations of an internal review that would strengthen the Conference's instant replay officiating procedures in football games.\"Pac-12 ADs endorse improvements for instant replay review. https://t.co/y3a43Z95RAThe review recommended the following three steps, as described by the conference's statement:\"A protocol that clearly states that the instant replay supervisor in the San Francisco centralized replay facility has final decision-making authority and that no administrator shall play any role in the deliberations.\"The development of a comprehensive manual governing all aspects of instant replay officiating, including detailed protocols and procedures.\"Disciplinary measures imposed on certain Pac-12 personnel responsible for inadequate procedures and involved in the inappropriate influencing of the replay official's decision in the USC vs. Washington State game.\"The play in question that initiated this came during USC's victory over Washington State on Sept. 21.Washington State linebacker Logan Tago was whistled for roughing the passer for a hit on USC quarterback JT Daniels. The play was reviewed for targeting, which would have resulted in Tago's ejection, but targeting was not called.Pete Thamel of Yahoo Sports cited an internal replay report and noted in-stadium replay officials and replay officials in the conference's San Francisco office deemed it targeting. However, the report revealed Woodie Dixon, the Pac-12 general counsel and senior vice president of business affairs, stepped in and said it wasn't targeting.Dixon isn't a trained official but overruled the in-stadium officials and the Pac-12 command center.John Canzano of the Oregonian said the Pac-12 had a \"trust problem\" in the aftermath of the controversy and said \"the perception already exists that the conference operates with a band of inferior officials.\"The athletic directors endorsed these three steps, though, in an effort to remedy the trust problem and avoid significant officiating controversy in the future."}