{"id": "Jordan McNair's Parents Respond to DJ Durkin's Reinstatement as Maryland CoachRelated", "paragraph": "The family of Jordan McNair is unsurprisingly not happy that DJ Durkin will return as head coach of the Maryland football team. \"I feel like I've been punched in the stomach and someone spit in my face,\" McNair's father said Tuesday, per Tom Schad of USA Today.\"I miss my son every day,\" his mother added, per Talia Richman of the Baltimore Sun. \"Today just didn't help at all.\"Following Tuesday's recommendation from the school's Board of Regents, Durkin will return to the sidelines after spending the entire season on administrative leave following McNair's death and an investigation into reports of a toxic environment within the program.The family's attorney, Hassan Murphy, had even harsher words following the day's events.\"How can a student-athlete be called a p---y as he is in the early stages of death, dying before their eyes, with no action taken, and yet no one be held accountable?\" Murphy asked, per Adam Rittenberg of ESPN. \"The university had an obligation to keep its students safe, and it failed.\"Murphy has been calling for Durkin to be fired since at least August for his role in creating an unsafe environment.Maryland offensive linemen Ellis McKennie and Tyran Hunt also voiced their displeasure with the board's decision: Every Saturday my teammates and I have to kneel before the memorial of our fallen teammate. Yet a group of people do not have the courage to hold anyone accountable for his death. If only they could have the courage that Jordan had. It’s never the wrong time to do what’s right. https://t.co/AaZVmLGTtSAt the end of the day, a YOUNG life was lost. My brother, teammate. And to boil it down to even horrific matters, a paycheck was chosen over that life. Through whatever and forever, I live for Jordan Martin McNair. https://t.co/YX18QH6Pl5There were multiple investigations following McNair's death at an offseason workout in June. One was on the direct response to the player's collapse, while the other examined the culture surrounding the football team. The Board of Regents found that the head coach was not completely responsible for either, determining he should remain with the team.\"We believe that coach Durkin has been unfairly blamed for the dysfunction in the athletic department,\" Board of Regents Chairman Jim Brady said Tuesday, per Nick Bromberg of Yahoo Sports. \"And while he shares some responsibility it is not fair to place all of it at his feet.\"There are only four games remaining in the 2018 season with the Terrapins currently holding a 5-3 record."}