{"id": "World Series 2018: Latest Expert Predictions on Potential MatchupRelated", "paragraph": "The Milwaukee Brewers beat the Los Angeles Dodgers, 7-2, on Friday to even the National League Championship Series at three games apiece. Milwaukee will now host L.A. on Saturday at 8:09 p.m. ET in a winner-take-all matchup for the NL pennant. The winner kicks off the World Series on Tuesday at 8:09 p.m. in a road tilt with the Boston Red Sox.Here's a look at some expert predictions in advance of Game 7, with some notable quotes and additional analysis.                   R.J. Anderson, CBSSports.comPick: DodgersNotable Quote: \"When in doubt, take the team with more talent. To us, that's the Dodgers. Both teams play hard, but L.A. pulls it out.\"The Dodgers have one significant advantage over the Brewers (and the rest of Major League Baseball): Their depth is greater than any other team in the league. Of note, L.A. has 10 players who hit 14 or more home runs this year. They have pop on both sides of the plate and numerous players with positional versatility. Of note, Cody Bellinger can play first base or outfield, Chris Taylor is a middle infielder and outfielder, and Kike Hernandez can basically do everything except pitch or catch.That's a huge plus in National League games sans the designated hitter, especially if the matchup goes into extra innings or the matchup becomes a battle of the bullpens. If you're judging the two rosters from their most valuable position player to their least, the Dodgers have the edge.          Dan Mullen, ESPN.comPick: Brewers 5, Dodgers 2Notable Quote: \"Saturday's winner-take-all matchup sets up very well for Milwaukee. Miller Park is going to be rocking. They've got a veteran on the mound in Chacin against a rookie (albeit an incredibly talented one). Hader will be available whenever Counsell chooses to unleash him.\"Brewers left-handed reliever Josh Hader has struck out 143 batters in 81.1 regular-season innings while posting a 2.43 ERA. However, he's been invincible during the playoffs, throwing seven shutout frames while allowing just four hits and striking out 12 batters. That doesn't even count his performance in the NL Central tiebreaker game against the Chicago Cubs when he threw two shutout innings and struck out three.Hader has been a workhorse out of the bullpen, so there has been concern about his workload. However, the 24-year-old is now well-rested: He is going on three full days rest and has thrown just 1.2 innings (28 pitches) in his last seven calendar days. Manager Craig Counsell could conceivably send him out for three innings, much like he did in Game 1 of the NLCS.Furthermore, Counsell can likely call on right-hander Jeremy Jeffress (8-1, 1.29 ERA, 89 strikeouts in 76.2 regular-season innings) for multiple frames. Jeffress has only thrown two innings since October 14 and tossed only 13 pitches on Friday. That's a huge edge for Milwaukee here.       OddsShark ComputerPick: Brewers and Under 7.5 RunsNotable Quote: N/AThe OddsShark computer views this game as a low-scoring affair, and that is a plausible possibility. The Brewers are sending out their best starter in right-hander Jhoulys Chacin, who went 15-8 with a 3.50 ERA and 156 strikeouts in 192.2 innings. The 30-year-old has been excellent in the 2018 playoffs, throwing 10.1 shutout innings and striking out nine batters in two Brewers victories.The Dodgers send out right-handed starter Walker Buehler, who hasn't done as well in the postseason (6.75 ERA in 12 innings in two losses). However, the 24-year-old shined during the regular season, going 8-5 with a 2.62 ERA and punching out 151 batters in 137.1 frames. If he returns to his regular-season form, this one could turn into a pitcher's duel akin to the Dodgers' 2-1, 13-inning Game 4 victory.           Gilles Gallant, OddsSharkPick: Brewers +1.5 and Over 7.5 RunsNotable Quote: \"Buehler has started games looking sharp but then has fallen apart in both of his postseason starts. The Brewers' pitching is such an edge to have in a close-out game and coupling that with playing in front of the home crowd, it's shaping up for the Brewers make the World Series for the first time since 1982.\"Gilles Gallant of OddsShark takes a different approach than the computer, however, as he thinks the game will go over the 7.5-run over/under total. If Buehler struggles again, then that could happen. More notably, the Brewers have a strong home-field advantage in this spot. Miller Park was raucous on Friday as Brewer fans vociferously booed shortstop Manny Machado because he kicked Milwaukee first baseman Jesus Aguilar in the leg in Game 4. Whether that had an effect on Machado is up for debate, although he did go 0-for-4 with two strikeouts in Game 6.Milwaukee has gone 4-1 at Miller Park during the postseason and finished with a National League-best 51-30 home record during the regular season. Brewers fans are hungry for their team's first World Series appearance (and just second overall) since 1982. Expect them to bring the heat again."}