{"id": "Maurizio Sarri Talks 'Fragile' Alvaro Morata After Crystal Palace BraceRelated", "paragraph": "Chelsea manager Maurizio Sarri has admitted Alvaro Morata is \"a little bit fragile\" mentally, but he hopes the striker can build on Sunday's brace against Crystal Palace.Morata twice fired the Blues in front either side of Andros Townsend's equaliser before Pedro sealed the three points.Per the Evening Standard's Vaishali Bhardwaj, Sarri was asked if the Spaniard could rival the goalscoring exploits of Harry Kane or Sergio Aguero and responded:\"I don't know. But for Alvaro, the goal has to be a consequence. He has to play for the team, with his mates, without thinking about goals. Goals are usually consequence of teamwork.\"He's a little bit fragile. From the mental point of view. But he's very young. I think he can improve, improve very fast.\"The Italian added:\"Alvaro improved the last month. Improved for the confidence, improved for the personality, improved also from the technical point of view.\"Now he's able to play more with the team, I think. But I think, also, that Alvaro has a very great physical and technical potential, so I think he can improve more.\"Sky Sports Premier League shared more of Sarri's comments:\"He improves in confidence, in personality, in playing with the team, so now I am very happy.\"\n\nMaurizio Sarri says Alvaro Morata has 'great potential' after Chelsea win: https://t.co/Lbodr6REi9 https://t.co/haenK06A09Morata opened the scoring after 32 minutes when he controlled a cross from Pedro and fired home. After Townsend pulled the Eagles level, Morata finished well from a tight angle after meeting Eden Hazard's free-kick at the back post.The 26-year-old now has six goals for the season overall and is on an impressive scoring run, per football writer Nick Miller:Five in the last six for the beleaguered Alvaro Morata.The striker had the chance to score his second Chelsea hat-trick when he found himself one-on-one with Wayne Hennessey, but he failed to beat him with a chip.Per ESPN FC's Liam Twomey, Morata's reaction to the miss perhaps shows Sarri is correct in his assessment:Morata cut a disconsolate figure at FT because of his late miss but this was the kind of performance Sarri wants &amp; needs from him. \n\nMy @ESPNFC ratings: https://t.co/V8PoVzE7i5 #cfcMorata should garner some confidence from the brace, and that in turn could lead to more goals in the coming weeks.However, if he's to match the feats achieved by the likes of Kane or Aguero, he needs to avoid dwelling on missed chances."}