{"id": "Hyun-Jin Ryu Reportedly Accepts Dodgers' Qualifying Offer Contract Worth $17.9MRelated", "paragraph": "Starting pitcher Hyun-Jin Ryu reportedly accepted the Los Angeles Dodgers' one-year qualifying offer Monday.Jon Heyman of Fancred and MLB Network reported the news, while Mark Feinsand of MLB.com noted Ryu had until Monday's 5 p.m. ET deadline to accept the $17.9 million offer.Ryu is a terrific rotation option when healthy. The 31-year-old South Korea native showcased that in 2018 as he posted a microscopic 1.97 ERA to go along with a 1.01 WHIP and 89 strikeouts in 82.1 innings across 15 starts for the Los Angeles Dodgers.Injuries have been a consistent part of his story since signing with L.A. in December 2012, though.After making 30 starts in his debut MLB season, he's failed to reach that threshold in any of the past five years. That includes missing the entire 2015 campaign and making just a single start in 2016 while dealing with back, shoulder and elbow problems.In May, after suffering a groin injury that ended up keeping him on the disabled list until mid-August, he expressed his exasperation with the latest in a series of setbacks.\"It doesn't feel good,\" Ryu told reporters through an interpreter. \"This seems to be worse than the ones in the past. Definitely very disappointed. I came into the season very healthy and had very good performances in the season. At this point, I'm very frustrated and very disappointed.\"While the 2008 Olympic gold medalist shined upon his return, posting a 1.88 ERA in nine starts during the stretch run of the regular season, he struggled during the playoffs. He compiled a 5.21 ERA in four postseason outings, including four earned runs in 4.2 innings in Game 2 of the 2018 World Series.His overall track record is strong, however, and the main concern is obviously the health woes, not his performance in last season's playoffs.Ryu's choice to return gives the Dodgers six starters with Clayton Kershaw, Walker Buehler, Rich Hill, Kenta Maeda and Alex Wood also in the rotation mix. It will be intriguing to see whether the team uses them all or jettisons one to the bullpen until an injury arises.An extra day off between starts could help the veteran left-hander in his quest to remain healthy."}