{"id": "AC Milan Reportedly to Offer Suso New Contract Amid Real Madrid, Chelsea RumoursRelated", "paragraph": "AC Milan are reportedly planning to offer Suso a new contract in the hopes of tying him down amid rumours linking him with Real Madrid, Chelsea and former club Liverpool.According to Corriere della Sera (h/t Calciomercato.com), Milan want to extend his deal—which currently runs until 2022—by another year and increase his €38 million (£33.2 million) release clause.Calciomercato list Real and Liverpool among the teams interested in him, while Andrea Losapio of Tutto Mercato Web (h/t The Sun's Nick Howson) reported Chelsea are hoping to sign the winger too.Suso has started the season in superb fashion, racking up four goals and eight assists in 12 Serie A matches.WhoScored.com provided further insight into the winger's impressive creativity:Suso: Has made more key passes (33) than any other player in Serie A this season\n\nFor more player stats -- https://t.co/LG1829rGiz https://t.co/qUHJTyhtJ8When he has not been setting up his team-mates, he has offered a goal threat of his own with some impressive efforts cutting inside onto his left foot:| FULL-TIME | \n\nA worthy match-winner for #ACMilan. 👏\n\nSuso's strike sealed all three points for the Rossoneri. 🔴⚫️\n\nAC Milan 3-2 Sampdoria https://t.co/Hu3S3rEcHDESPN's Matteo Bonetti is among the admirers he has won this season:What’s amazing about Suso’s technique is how much power he’s able to generate from a side footed shot.If he maintains this current form, it would not be too surprising if he did attract plenty of interest in January or next summer, so a new contract and higher release clause will put Milan in a stronger position.The 24-year-old failed to make the grade at Liverpool as a youngster, but it's clear he feels he has some unfinished business at Anfield.In May, he told the Guardian's Fabrizio Romano that while he is \"very happy\" in Milan, he hopes to return to Liverpool: \"I did not play that much but I got to know Steven Gerrard and be a team-mate of players such as Luis Suarez, Philippe Coutinho and Jamie Carragher. I’ll never forget my experience at Liverpool.\"Premier League football is different, I would call it special: I would like to play for Liverpool again some day. I grew up there and it is a big club.\"If the Reds come back in for him, he might be tempted to jump ship in order to realise that ambition.The Spaniard may well be similarly tempted by Real or Maurizio Sarri's Chelsea, though, so tying him down should be a priority for the Rossoneri."}