{"id": "Kevin Harvick Guarantees Championship Race Spot with NASCAR at Texas 2018 WinRelated", "paragraph": "The 2018 AAA Texas 500 had its share of drama down the stretch, with overtime required after Joey Gase spun out and a caution was required late in the race, but in the end it was Kevin Harvick who prevailed. Harvick, who also won both stages on the afternoon, guaranteed his place at the championship race at Homestead in two weeks with the victory, joining Joey Logano.SEE YOU IN MIAMI! \n\n@KevinHarvick advances to the #Championship4 with today's win at @TXMotorSpeedway! #NASCARPlayoffs #4TheCup https://t.co/pmvxe1wmkBA selfie this fan will never forget. \n\n#NASCARPlayoffs | #4TheCup https://t.co/CNw7SeI2GWRyan Blaney finished second on Sunday, with Logano, Erik Jones and Kyle Larson rounding out the top five. As for the other playoff contenders, Chase Elliott finished sixth, followed by Kurt Busch (seventh), Aric Almirola (eighth), Martin Truex Jr. (ninth), Kyle Busch (17th) and Clint Bowyer (26th). Those six racers will now be vying for the last two championship berths in next weekend's Can-Am 500. And Almirola was not pleased with Logano after the race: \"When @HomesteadMiami comes around, and I'm not in... he'll know it.\"\n\nAdd @Aric_Almirola to the list of drivers not happy with Joey Logano in the #NASCARPlayoffs. https://t.co/wWEeTIDw8pHe wasn't the only one with a complaint on Sunday.\"I don't know what genius decided to pave this place or take the banking out of one and two, but not a good move for the entertainment factor, in my opinion,\" he said of the difficulties he encountered trying to pass on the day, per racing writer Jeff Gluck. Things also got hairy late, as Gase, Daniel Suarez and AJ Allmendinger were involved in a crash that prompted an overtime finish. But it was all Harvick from there, as he easily put Blaney in his rearview mirror for the win.\"The side draft was really the key.\" \n\n@KevinHarvick analyzes how he was able to beat @Blaney on the final restart. #NASCARPlayoffs #4TheCup https://t.co/cHdFABYF79\"I got by him on one restart,\" Blaney said of Harvick, per NASCAR on Twitter. \"I just couldn't hold him off, he was just really good. I kinda missed one and two by an inch and he took advantage of it. I just needed to be mistake-free, and then some, and couldn't be.\"Harvick was dominant Sunday, leading for 177 laps of 337 laps. Logano (54) and Blaney (40) were nowhere near that total. Harvick has been dominant this year in general, with eight wins now on the season.Win 8 might be the sweetest. That sticker is a ticket to @HomesteadMiami! 🎟 https://t.co/RfIkqRp8UD\"Just really, really proud of everybody at Stewart-Haas Racing for these cars we've had, really for five years now,\" he said after the race, per Daniel McFadin of NBC Sports. \"The expectations are to win. It's like I told you guys before the race, we don't race for points, we race for wins. We don't come here to count our fingers and toes to figure out how to win. We want to earn it. Today we earned our way in.\"With two spots remaining in for the championship race at Homestead, Busch (+28) and Truex (+25) sit in third and fourth, respectively. A win for any of the playoff racers would get them an automatic berth to the final race, alongside the top remaining points holder.So a whole lot will be at stake next week in Avondale, Arizona."}