{"id": "Novak Djokovic Advances to ATP World Tour Final with Win over Kevin AndersonRelated", "paragraph": "Novak Djokovic put on a masterful display to beat Kevin Anderson 6-2, 6-2 on Saturday and book his spot in the ultimate round of the 2018 ATP World Tour Finals.The five-time champion was relentless at London's O2 Arena, as he didn't give Anderson an inch on his serve and piled on the pressure every time the South African had the ball in hand.Djokovic did not give up a break point during the 75-minute match, while he claimed four breaks of his own and made Anderson work for every point.The Serb will face Alexander Zverev in Sunday's final after the German won his semi-final against Roger Federer in straight sets.It was a torrid evening for Anderson, who made it through to the last four of the season-ending tournament thanks to victories over Kei Nishikori and Dominic Thiem.He was immediately under pressure on his serve and, after an eight-minute opening game, was broken before going 2-0 down following a rapid Djokovic hold.The 32-year-old was afforded no easy points despite his huge serve, and he conceded two more break points in the third game. Anderson saved them and held after he took advantage of a rare Djokovic mistake, but there was already an inevitability about where the match was going.Anderson was forced to go for the lines with every shot, and he eventually dropped another service game to go 5-2 behind.Djokovic made no mistake in serving out the set, and he got another early advantage in the second as he broke Anderson for 1-0. That effectively ended the game as a contest, as Djokovic's serving was so solid he never looked like he'd be broken.In the entire match, he lost only seven points on serve, while he won 74 per cent of points when Anderson missed his first serve.The world No. 6 has enjoyed an impressive year, and he showed admirable grit not to crumble after he went behind again in the second set. He also creditably made Djokovic serve out the set after he came under pressure again when 5-1 behind.In truth, though, the gulf in class was huge, and Zverev will need to hope Djokovic has an off day on Sunday if he is to have any chance of claiming the title. "}