{"id": "Rafinha, Jordi Alba Lead Barcelona Past Inter Milan in UEFA Champions LeagueRelated", "paragraph": "Barcelona took command of Group B of the UEFA Champions League on Wednesday by beating Inter Milan 2-0. Lionel Messi's replacement Rafinha and Jordi Alba got the goals.  The Brazilian struck just past the half-hour mark, rewarding the Catalans for their stellar play in the first half. Inter had a spell of dominance early in the second half but were mostly outplayed on the night, and both Clement Lenglet and Philippe Coutinho wasted chances to add to the lead.It was Alba who secured the win inside the final 10 minutes, meeting an excellent through-ball from Ivan Rakitic and beating goalkeeper Samir Handanovic.Barcelona now have a three-point lead at the top of the group and a perfect record after three matches. PSV and Tottenham Hotspur are in last place, eight points behind the leaders.   Dembele Deserves Clasico Place Despite Rafinha's GoalBarcelona manager Ernesto Valverde surprised everyone with his team selection on Wednesday, as he opted to replace the injured Messi with former Inter man Rafinha, rather than Ousmane Dembele.Some fans, including sportswriter Muhammad Butt, were disappointed:Rafinha and Roberto on the right-flank instead of Dembélé and Semedo. that is just depressing.Fears the 25-year-old would slow down the buildup were proven correct, as Rafinha had a rough first half that included several missed chances and some bad passing. Inter gladly ceded possession to the Blaugrana for large stretches of the half and pressured the forward whenever he got the ball, knowing that would be their best chance to kill attacks.He did score a goal but that came after a wonderful cross from Luis Suarez. The Uruguayan put the ball on a platter, and while Rafinha did do well to finish, the credit had to go to his team-mate.Sportswriter Sid Lowe noted he had disappointed until that point:Rafinha (who I must admit I wasn’t impressed with up to then), produces a lovely move with Suarez (superb pass from him) and a really nice finish too.Rafinha is a fine player but not the best creator in attack, and it's that spark Barcelona will need without Messi. Dembele may have struggled against Sevilla, but he's far more suited as a replacement thanks to his ability to break matches open with a moment of brilliance.The former Borussia Dortmund man has to return to the starting XI in favour of Rafinha for Sunday's all-important Clasico against Real Madrid. With his raw pace and technical ability he could be a huge weapon against a struggling Blancos defence, especially if Julen Lopetegui persists with makeshift full-back Lucas Vazquez.   What's Next?Barcelona face Real Madrid in El Clasico on Sunday, while Inter visit Lazio on Monday. The two teams will rematch at the San Siro on November 6."}