{"id": "Steve Kerr: DeMarcus Cousins Will Be Used in the 'David West Role' on WarriorsRelated", "paragraph": "While DeMarcus Cousins was never going to be a go-to player with the Golden State Warriors, his role might be smaller than anticipated when he returns from his Achilles injury.\"I think you'll see us use him in that David West role from the last couple years, when David anchored the second unit,\" head coach Steve Kerr said Tuesday on Tolbert & Lund, via Jake Montero of KNBR. \"I think you'll see us play through DeMarcus once he's back, and we'll put him on the low block and have guys cutting around him.\"David West was a useful part of the Warriors rotation the past two years before retiring, appearing in 141 games off the bench while averaging 5.8 points and 3.1 rebounds. He was one of the key players in the team's second unit that kept the team dangerous even when All-Stars Stephen Curry, Kevin Durant, Klay Thompson and Draymond Green were off the floor.The backups haven't been quite as effective so far in 2018-19, especially in the loss to the Denver Nuggets when Quinn Cook and Kevon Looney were minus-eight on the court.However, Cousins seems like too good of a player to be compared to West.The 28-year-old has been an All-Star in each of the last four years and was lighting up the stat sheet before his injury last season, averaging 25.2 points, 12.9 rebounds and 5.4 assists per game.He has also started all but three games he has played in since his second year in the league, while even starting 62 games as a rookie.Still, Kerr apparently sees value in running the second unit. The coach did praise the former Kings and Pelicans star for his production outside the paint.\"The other thing that we can do that we haven't really had a big capable of doing since I'vebeen here, is putting him in some high screens and popping him out to the three-point line,\" Kerr said of Cousins. \"He's a really good three-point shooter; he's got amazing soft hands, soft touch, and then he can pass from out there too.\"Regardless of his role, Cousins could be another dominant force in the Warriors' quest for a third straight title when he is back to 100 percent."}