{"id": "Jimmy Butler Out for Rest vs. Trail Blazers; Derrick Rose ProbableRelated", "paragraph": "Minnesota Timberwolves head coach Tom Thibodeau announced that Jimmy Butler would miss Sunday night's contest against the Portland Trail Blazers, per Sean Highkin of Bleacher Report.The Timberwolves announced that Butler was being given \"precautionary rest,\" while Derrick Rose was listed as probable.As for Butler's designation, Jon Krawczynski of The Athletic provided more context on Minnesota's recent and upcoming schedule:Tonight starts a stretch of 3 in 4 and 4 in 6 for the Wolves to finish this road trip. Will be interesting to see how the rest of this stretch plays out.Butler first sat out against the Utah Jazz this past week, reportedly in the \"next step in [a] six-week-long process aimed at getting the All-Star out of Minnesota,\" Shams Charania of The Athletic and Stadium reported on Oct. 31, which \"could lead to [an] extended absence for Butler.\"He denied that report, however, per Rachel Nichols of ESPN: https://t.co/CoMRp9d1gjThe All-Star forward also already hinted that he might skip both Sunday's game against Portland and Monday night's matchup against the Los Angeles Clippers.\"I let them know,\" he said Friday, per Nick Friedell of ESPN.com \"They don't know how my body feels. So if I'm nicked up, then you can count on that. I don't know. We'll see how it goes. I don't know what we plan on doing tomorrow. Obviously, I got to get some treatment along with a lot of other guys. But we'll see whenever Sunday and Monday gets here.\"While Butler didn't specify what sort of injury he might be dealing with, he did tell reporters he wasn't sitting because of his desire to be traded.\"I'm not worried about no deal,\" he said. \"Injury or not, I got to take care of myself. I realize they have a job to do as an organization; I have one to do as a player. But if I'm not in the right with my body to go out there and do it, I don't want to get hurt. I've been hurt almost every year now, so we're going to take things with caution.\"Butler, 29, publicly requested a trade before the season, with Timberwolves owner Glen Taylor reportedly assuring Butler in late October that he was seeking a deal for the disgruntled superstar, according to Malika Andrews of ESPN.com.No trade has come to fruition, though it feels inevitable at this point that Butler won't finish the season in Minnesota given the public nature of his trade demands. Whether his recent absences during games have anything to do with his desire to be traded remains murky territory, though it has added another layer to an already complicated back-and-forth between Butler and the Wolves."}