{"id": "Portugal Qualify for Nations League Finals After Scoreless Draw Against ItalyRelated", "paragraph": "Portugal qualified for the finals of the 2018-19 UEFA Nations League on Saturday with a scoreless draw against Italy at the San Siro stadium.The hosts dominated the first half but missed several chances to take the lead, with Ciro Immobile twice failing to beat Rui Patricio. Portugal improved after the break, but there would be no goals.The European champions came into Saturday's match needing just one point from either this contest or the fixture against Poland to win League A Group 3.                   Time for Mancini to Drop ImmobileThe Azzurri have undergone a transformation under manager Roberto Mancini, who has the team playing much better football and the fans believing in a bright future, even if the results haven't always gone their way.The former Manchester City boss has introduced several youngsters into the squad and given full confidence to players such as Lorenzo Insigne and Jorginho, who were too often overlooked in the past.The one area he hasn't been able to figure out yet has been the striker position, however. On paper, Ciro Immobile is Italy's best option because of his strong performances in Serie A, but that hasn't translated to the national team:Ciro Immobile has seven goals in 33 senior Italy caps, but fired blanks in his last eight appearances, last finding the net in a 1-0 World Cup qualifier against Israel in September 2017. \nLiveblog https://t.co/FDmj0iP0pl #ITAPOR #UNL #NationsLeague https://t.co/aKhAt8YzfeSportswriter Vince Van Genechten noted he once again struggled against the Portuguese and thought Italy might have been a World Cup team had he played up to his talent in the past:If Immobile had his Lazio form with Italy:\n\nAzzurri would have made the World Cup\nAzzurri would have been up 2-0 vs Portugal #ITAPORImmobile lacks the confidence to overturn his national team struggles at this point, and Mancini has to learn from his issues. With plenty of time until Euro 2020, it's time to give more opportunities to Mario Balotelli or Andrea Belotti or see whether Kevin Lasagna can continue his remarkable rise with some starring performances for the Azzurri.The future looks bright, with Moise Kean again impressing for the under-21 team in the loss against England. That performance saw him called up to the senior side for the friendly against the USA. The Juventus man is likely to go out on loan in January, per Tuttomercatoweb (h/t Football Italia), and he might take the leap in the near future with more regular minutes.Pietro Pellegri is another youngster with immense potential, and both he and Kean should get their chances in 2019 or 2020 if their playing time at club level increases.       What's Next?Portugal will face Poland on Tuesday in the last match of Group 3. Italy will play the United States in Belgium in a friendly on the same day."}