{"id": "Shea Patterson, Michigan Earn Hard-Fought Rivalry Win over Michigan StateRelated", "paragraph": "The sixth-ranked Michigan Wolverines scored a key 21-7 rivalry triumph over the No. 24 Michigan State Spartans on Saturday at Spartan Stadium in East Lansing, Michigan.It's the second straight statement win for Michigan, which steamrolled to a 38-13 victory over the Wisconsin Badgers in Week 7. The Wolverines also claimed the coveted Paul Bunyan Trophy for the second time in three years to bring their all-time record against MSU to 70-36-5.Meanwhile, the loss is an immediate setback for Michigan State following its 21-17 upset of the Penn State Nittany Lions last week, which had pushed the Spartans back into the Top 25.                             Michigan Defense Puts Team in Championship ContentionThe Wolverines entered Saturday's game ranked second in the country in total defense at 238 yards allowed per game. Michigan State finished the contest with just 94 yards.What makes Michigan so tough to game-plan against is its strength at every level. The front seven swarms against the run, and the secondary features a group of players capable of winning in one-on-one coverage, which allows the coaching staff to send pressure.The cornerback tandem of David Long and Lavert Hill was particularly strong Saturday. The MSU wide receivers weren't able to create any separation on the outside. Quarterback Brian Lewerke was throwing into air-tight coverage every time, which helps explain his five completions on 25 attempts.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sNotre Dame vs. USC: Behind the Historic RivalryBryce Love for Six Nick Chubb with the Super Hurdle Against Missouri When a defense can get pressure when only sending four rushers and the corners are capable of keeping their opposing wideouts in check without help, it creates a nightmare scenario for offenses. It leaves every conceivable play call on the table.Michigan continued a streak Saturday of not allowing more than 24 points in any game this season. Pair that with stretches where the unit is downright dominant, and there's reason to believe the Wolverines are the most dangerous one-loss team in the national title conversation.                          Shea Patterson Must Continue to Deliver in Marquee GamesBefore Saturday, Patterson's two worst passing performances of the season came in Michigan's two biggest games, a season-opening loss to the Notre Dame Fighting Irish and last week's win over Wisconsin.The junior quarterback finally delivered on the big stage against Michigan State. He completed 14 of his 25 attempts for 212 yards and two touchdowns, including a 79-yard connection with Donovan Peoples-Jones late in the third quarter to give the Wolverines the lead for good.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sNotre Dame vs. USC: Behind the Historic RivalryBryce Love for Six Nick Chubb with the Super Hurdle Against Missouri He must keep playing on that level down the stretch, especially in spotlight games against Penn State and the Ohio State Buckeyes. The defense has proved it'll be up to those challenges, but the offense has been a little more hit and miss when it matters most.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sNotre Dame vs. USC: Behind the Historic RivalryBryce Love for Six Nick Chubb with the Super Hurdle Against Missouri Patterson can also make plays with his legs, as he showcased during the win over the Badgers with nine carries for 90 yards and a score. That's an added bonus that can help keep opponents off balance, but his consistency from the pocket is far more important.Saturday's outing was a terrific sign as Michigan hangs around in the College Football Playoff race.                          Felton Davis III Injury Will Crush MSU Passing GameDavis was carted off the field in the first half with a leg injury. The Fox broadcast stated he suffered a torn Achilles tendon on the play, per NBC Sports' Kevin McGuire.The Michigan State aerial attack would be in serious trouble if the senior wide receiver does end up missing the rest of the 2018 season. He led the team in receptions (31), receiving yards (474) and touchdown catches (four) heading into Saturday's game.As mentioned, the Spartans struggled to get much going through the air all day as their receivers couldn't create any separation against the Michigan secondary. That problem will be amplified in the coming weeks without their top target available.Add in the continued absence of Cody White, who suffered a broken hand in late September, and it's hard to imagine much success for the Lewerke-led passing game during the remain portion of the Big Ten slate.                      What's Next?Michigan State remains home for a Big Ten clash with the Purdue Boilermakers next Saturday.Michigan has a bye in Week 9 before returning to the field Nov. 3 for another high-profile matchup, against Penn State at The Big House."}