{"id": "Liverpool, Napoli Reportedly Submit Offers to Sign Iker Muniain as a Free AgentRelated", "paragraph": "Liverpool and Napoli both reportedly want to capture Iker Muniain on a free transfer next summer, with the player's deal at Athletic Bilbao set to expire at the end of the season.Marca (h/t Metro) reported the Reds have already approached the 25-year-old about a potential switch to Anfield, but Napoli will provide the attacker with an alternative move to Serie A if he desires the challenge.Muniain was once considered as one of Spain's brightest young talents as he broke into the Bilbao team as a teenager, but he's failed to live up to the expectations that were laid on his young shoulders.However, a move to the Premier League could rejuvenate the winger, with Liverpool providing the talent with a huge stage to display his abilities.Muniain has remained a regular in the first-team squad at Athletic Club, consistently contributing goals from his wide berth.The player is happy on the left but is adept at featuring as a No. 10 in multiple systems.Liverpool's attacking fluidity would suit the Spaniard, with the pace of Sadio Mane and Mohamed Salah complimenting Muniain's technical ability.The forward was hugely successful at youth level for Spain, winning the European under-21 championship in 2011 and 2013, but the player has only featured once for his country at senior level.Muniain was previously compared to Lionel Messi, and the Pamplona-born player declared he was unaffected by the claims.Speaking to Radio Nervion (h/t Dejan Kalinic of Goal), Muniain admitted the comparison was unrealistic.\"It was excessive. People are swayed by euphoria,\" Muniain said. \"It has never affected me. I've always known who I am.\"Serie A could suit the player more than the Premier League, but Liverpool's rising status would be attractive to any free agent.Muniain would not be the name you'd expect Reds coach Jurgen Klopp to pursue, but with no transfer fee involved, he'd be a low-risk addition.The midfielder still has the best years ahead of him, and with Liverpool's squad expanding as they chase multiple trophies, he could be a useful talent to rotate in the first team.However, Xherdan Shaqiri has struggled for minutes this season for the Anfield giants, and Muniain might shy away from the move as a similar talent finds it difficult to penetrate Klopp's starting line-up."}