{"id": "Former 4th Overall Pick Dragan Bender's Contract Option Declined by SunsRelated", "paragraph": "The Phoenix Suns declined Dragan Bender's option for the 2019-20 NBA season, ESPN.com's Adrian Wojnarowski reported Tuesday.Wojnarowski shared Bender's thoughts on the move: \"Of course I wish they picked up the option, but I am not going to let this stop me from reaching my goals. I am 20 and I will keep working to make it in this league, whether it's in Phoenix or another team.\"The Suns selected Bender with the fourth overall pick of the 2016 draft and he has so far failed to justify Phoenix's investment.Through his first two years, he was averaging 5.4 points and 3.7 rebounds while shooting 37.8 percent from the field. This season, Bender has played a total of 11 minutes in three games, illustrating how far his stock has fallen.Financially, the Suns' decision not to exercise his team option will be blow for Bender. He would've been owed $5.8 million with the option, and he'll now likely struggle to get a contract that can match that.Getting out of Phoenix may be the best thing for Bender's career in the long term, though.The Suns are one of the worst franchises on which a raw, young prospect can land. They're on their third head coach since Bender arrived and they're less than a month removed from firing general manager Ryan McDonough, having let McDonough fill out the roster in the offseason.The Suns haven't had a winning record since 2013-14 and they've generally been devoid of a long-term direction.This is the same franchise that did everything to try and sign LaMarcus Aldridge in 2015 after a 39-win season and instead gave Tyson Chandler $52 million over four years when Aldridge signed with the San Antonio Spurs.The organizational dysfunction that starts at the top with owner Robert Sarver gave Bender little chance of succeeding in Phoenix. The same was true of fellow 2016 first-rounder, Marquese Chriss, who got shipped off as part of the Ryan Anderson trade.Still, as Bender himself said, he's only 20. It's too early to write him off as a potential role player for another team. He was a 36.6 percent three-point shooter in 2017-18, so he might be able to turn himself into a solid stretch 4 or 5 off the bench."}