{"id": "Report: Juventus Turn Down AC Milan's January Offer for Medhi BenatiaRelated", "paragraph": "Juventus have reportedly turned down an offer from AC Milan for defender Medhi Benatia, who has been linked with a move away from Turin in January since voicing his displeasure at a lack of playing time.According to Rai Sport (h/t Calciomercato.com) Milan offered the Bianconeri a loan deal in January with an obligation to buy the player for €15 million included. Juventus swiftly turned the approach down, however, expecting a better deal for the Morocco international.Per Dave Fraser at The Sun, Manchester United and Arsenal are also interested in Benatia, who opened up about his lack of playing time during a recent interview with La Stampa (h/t Football Italia):\"I'm struggling playing a game every now and then.\"Last year I did well because I had more consistency, unfortunately I don't have it this year. It's part of my job, and I work to always be ready, but it's not a pleasant situation.\"It's normal that I'm not enjoying it, I'm 31 and I want to play as much as possible.\"January? Let's see what happens, how I'm used, if Juve still need me, if [coach Max] Allegri wants me...\"Days after that interview came out, the 31-year-old was given the start against AC Milan, only to give away a penalty. The mediocre outing will not have helped his case for more minutes.As noted by Bleacher Report's Alex McGovern, Benatia was arguably Juventus' best defender last season, but Leonardo Bonucci's return has shaken up the Old Lady's pecking order:Another victim of the Bonucci deal — Benatia was arguably Juventus' best defender last season. Would be a steal for Milan, though they would have 3 CBs competing for one spot in Benatia, Caldara and Musacchio (+ Romagnoli surely guaranteed). https://t.co/CFn9Bq7oe8Bonucci and Giorgio Chiellini are Juventus' top starters, and Andrea Barzagli and Daniele Rugani provide excellent depth in addition to Benatia. That means opportunities are limited, even with the club active in three competitions.The Bianconeri have also been strongly linked with Ajax talent Matthijs de Ligt, who could further complicate matters, per sportswriter David Amoyal:Juventus hosted de Ligt for a visit last June including to their facilities, they now intend to meet with his agent Raiola soon bu face competition from Barca &amp; some PL clubs according to @FabrizioRomano (article in Italiano) https://t.co/aEXQu5I5shA transfer of Benatia could help finance that deal, and the former AS Roma and Bayern Munich player seems likely to leave Turin. A January transfer would be tricky, however, with the Bianconeri in win-now mode and eager to finally end their UEFA Champions League hoodoo.They'll look to avoid turnover in January and instead focus on selling in summer, when they can move for someone like De Ligt and give them time to get settled at the club."}