{"id": "ATP World Tour Finals 2018 Results: Saturday Tennis Scores and Updated ScheduleRelated", "paragraph": "Novak Djokovic will meet Alexander Zverev in Sunday's 2018 ATP World Tour Finals final after the German prodigy beat Roger Federer in straight sets on Saturday at the O2 Arena in London.The 21-year-old defeated the Swiss 7-5, 7-6 (5) and will face Djokovic after a 6-2, 6-2 masterclass from the Serb against Kevin Anderson in the semi-finals.Djokovic will be the clear favourite to land the title after Federer's exit, and the encounter will allow Zverev the chance to test himself against the world's top player.The young star fought a close battle in the opening set against Federer, but his timing was perfect as he broke the Swiss' serve to take the set 7-5.The two players were once again tough to separate in the second set, but Zverev overpowered the veteran in the tiebreak to book his place in the final.Zverev was booed by the crowd during the second-set tiebreak after stopping play when a ball boy dropped a ball at the back of the court. The German won the point after it was replayed, and the largely pro-Federer crowd made their feelings known.Per BBC Sport, Zverev explained his disappointment at the crowd's reaction:\"I was really upset afterwards in the locker room, I'm not going to lie. I had to take a few minutes for myself.\"But, you know, I hope the crowd and the people who were booing maybe look at what actually happened, maybe just realise that I've maybe not done anything wrong.\"Zverev now meets Djokovic, who was in dominant form in his last-four match with Anderson.The Serb appeared untouchable as he dealt with everything the South African could muster, and he will be full of confidence ahead of the final.Djokovic claimed the opening set at pace, breaking Anderson's serve in the opening game before a second break made it 5-2 to the world No. 1. He served out the set and continued to move through the gears in the second, with Anderson totally outclassed in a one-sided affair. The performance has Djokovic looking good for a sixth ATP World Tour Finals title.Journalist and tennis commentator, Jose Morgado, gave a simple assessment:Absurd level from Djokovic.The final is set to take place at 6 p.m. GMT/ 1 p.m. ET on Sunday. Djokovic defeated Zverev 6-4, 6-1 in the round-robin stage earlier in the tournament."}