{"id": "Manchester City Transfer News: Sky Blues Reportedly Join Sandro Tonali ChaseRelated", "paragraph": "Manchester City have reportedly joined the list of suitors for Brescia youngster Sandro Tonali, Italy's latest talent who is already drawing comparisons to Andrea Pirlo.According to Gazzetta dello Sport (h/t Calciomercato.com's Emanuele Giulianelli), Chelsea, Inter Milan, Juventus and AS Roma are all after the teenager, and City sent a scout to watch him in Sunday's win over Hellas Verona.Tonali starred in that match, providing an assist and scoring with a free-kick in the 4-2 triumph in Serie B.The 18-year-old has quickly become a hot name on the transfer market. He earned a call-up to the national team, thanks to his wonderful of play of late, and will be gunning for his first minutes with the Azzurri during the international break.Here's a look at his highlights, showing why he's a wanted man:The Pirlo comparisons go beyond the long hair and the Brescia connection. Like the Milan and Juventus legend, Tonali does most of his damage with his passing, showing a remarkable ability to hit the long ball. While his right is his dominant foot, he's almost as good with his left and shows no fear of using it.Tonali is still raw and prone to making mistakes, being caught out of position and over-dribbling. But so was Pirlo during his Brescia days and even at Inter. Like Tonali, he started his career as a forward before gradually mastering the \"regista\" role he's now famous for after improving with experience.The youngster showed his vast potential during the European Under-19 championship last year, playing a key role in Italy's run to the final. Things have moved quickly since, and it wouldn't be a surprise if a transfer follows as early as January.Out of the English clubs, Chelsea have been linked the most, with Il Mattino (h/t Sport Witness) even suggesting a transfer fee:Chelsea ‘especially’ on the case to sign Sandro Tonali – €35m plus a series of bonuses to complete deal. #cfc https://t.co/Dav8b3p2aj https://t.co/T6vJ1Y2PtVTonali is expected to stay in Italy for the foreseeable future, however. The best talents on the peninsula tend to be snapped up by local clubs like Juventus, Napoli and Inter, who often sign players and loan them back to their old club immediately.Such a scenario would be ideal for Tonali, who at 18 years old needs playing time first and foremost and could get lost in the shuffle at a big club. Brescia have done a fine job developing him, so keeping him with the Rondinelle for another year or two would be the smart move."}