{"id": "Jim Boeheim Says He Doesn't Think NCAA Should Ever Compensate PlayersRelated", "paragraph": "Syracuse Orange men’s basketball coach Jim Boeheim doesn't think college athletes should be paid.\"I don't think we should ever compensate players,\" he said, per Donna Ditota of Syracuse.com. \"... They get more meals now so they can keep their meal money. ... Everybody says, 'The coach makes this and the players (don't make anything).' The player is 17 years old. I've been working my whole life. There's a lot of 17-year-old kids that don't make money.\"Boeheim also engaged in a back-and-forth with Los Angeles Lakers superstar LeBron James, which Chris Cwik of Yahoo Sports summarized.NBA prospect Darius Bazley planned on playing for the Orange but ultimately elected to enter the G League instead. He then opted out of playing in the G League and signed with agent Rich Paul—who is also James' agent—and landed a $1 million shoe internship with New Balance.Boeheim said James \"did a nice job helping his client,\" which led to their exchange:OH THEY BIG MAD!!!!! 🤣🤣🤣 https://t.co/DP2bGAeWq8@KingJames Not me! I’m happy for him! I wish him the best.While the Syracuse coach clearly takes exception with the idea of college athletes being paid, it has been a hot-button issue for years given the hundreds of millions of dollars things such as the NCAA tournament, college bowl games, television contracts, sponsorships and gate revenue generate.The topic has been in the headlines this past offseason with the FBI's investigation into corruption in college basketball looming over the sport.Former Adidas employees James Gatto and Merl Code, as well as former sports agent runner Christian Dawkins, were found guilty on all of their counts of conspiracy to commit wire fraud on Wednesday, per Matt Norlander of CBS Sports.They were accused of providing benefits to top recruits in an effort to steer them toward Adidas-sponsored schools."}