{"id": "Alex Cora Says It's Possible Mookie Betts Could Play 2B in World SeriesRelated", "paragraph": "American League teams often have to do some significant lineup shuffling in World Series road games because National League rules don't include the designated hitter.As a result, Boston Red Sox manager Alex Cora could explore all of his options to try to field the best team in the upcoming championship round.\"I don't know, man,\" Cora said when asked if outfielder Mookie Betts would play second base during the Fall Classic to get J.D. Martinez, the team's DH, into the lineup, according to ESPN.com. \"He already played second in the regular season. There's always a chance, I guess.\"Betts made one appearance at second during the regular season as an injury replacement for Ian Kinsler.Before that August 3 game, Betts had not played anywhere other than the outfield since his rookie season in 2014. He appeared in 14 contests at second base that year.The two-time Gold Glove outfielder has a career .956 fielding percentage at second, having committed three errors in 15 games.It's a dilemma for Cora. Putting Betts at the keystone would weaken the team's defense and could make him a liability in the field. With a playoff series on the line, defensive miscues can be the difference. You don't need to tell Red Sox fans that.Then again, if Betts doesn't shift to the infield, Cora would either have to find a spot for Martinez or use him off the bench. Considering Martinez ranked first in the majors in RBI (130) and second in batting average (.330) and home runs (43), it would be tough to sit him.Boston is fortunate enough to have four outfielders worthy of starting in the World Series, but finding each of them at-bats will be a problem in the NL park. Neither Jackie Bradley Jr. nor Andrew Benintendi has played anywhere other than the outfield in the majors.The Red Sox skipper has time to ponder the situation, as the first two games of the best-of-seven series will take place at Fenway Park on Tuesday and Wednesday, respectively, against either the Milwaukee Brewers or Los Angeles Dodgers. The World Series will shift to the National League park Friday, Oct. 26, for three games. Cora's decision could be impacted by the opponent or how the first two contests play out. Regardless, it will be a storyline to keep an eye on."}