{"id": "Green Bay Packers vs. New England Patriots Odds, Analysis, NFL Betting PickRelated", "paragraph": "New England owns an 11-game home winning streak, going 9-2 against the spread in the process. Green Bay, on the other hand, owns a five-game road losing streak, going 1-4 ATS in the process. So the NFL betting trends certainly seem to favor the Patriots heading into their Sunday night matchup with the Packers.    NFL point spread: The Patriots opened as six-point favorites; the total was 57.5 early in the week, according to sportsbooks monitored by OddsShark. (Line updates and matchup report)NFL betting pick, via OddsShark computer: 34.4-16.8 Patriots (NFL picks on every game)Check out the OddsShark podcast on iTunes or Spotify or at OddsShark.libsyn.com for more odds information, betting picks and a breakdown of this week’s top sports betting news.    Why the Packers can cover the spreadGreen Bay is actually coming off one of its best overall efforts of this season, albeit in a tough 29-27 loss to the undefeated Rams in Los Angeles last week. The Packers pounced out to a 10-0 lead at the L.A. Coliseum, went down 23-13 but rallied to lead 27-26 midway through the fourth.Green Bay then allowed a Los Angeles field goal to fall behind with two minutes to go, but that's a ton of time for Aaron Rodgers, right? Unfortunately, Ty Montgomery fumbled away the kickoff return and the Pack couldn't get the ball back. On Tuesday, Green Bay traded Montgomery to Baltimore.The Packers got out-gained by the Rams, but only by 57 yards. Prior to last week, Green Bay had out-gained its previous three opponents by an average of 218 yards per game.   Why the Patriots can cover the spreadNew England ran its winning streak to five straight, including a 4-1 ATS run, by beating the Bills in Buffalo on Monday night 25-6. The Patriots scored the first nine points of the game, let the Bills get within 9-6 in the third quarter but immediately drove 85 yards to an insurance touchdown.New England then secured the cover as 13-point favorites with an 84-yard pick-six by Devin McCourty with five minutes left.On the night New England out-gained Buffalo 387-333, held a 22-16 edge in first downs and won the turnover battle 2-0, creating a plus-10 point differential. Heading into last week, the Patriots had scored at least 38 points each of their previous four games.    Smart betting pickGreen Bay just lost to one Super Bowl contender on one side of the country, and now takes on another contender on the other side of the country. Plus, the Packers are a bit of an emotional mess at the moment, with a whiff of dissension in the air.Meanwhile, New England seems to have recovered from that two-game losing streak back in September. Smart money here gives the points with the Patriots.    NFL betting trendsThe total has gone under in four of the Packers' last five games vs the Patriots.The Patriots are 11-0 SU and 9-2 ATS in their last 11 games at home. (Avg winning margin: 14.82)The Patriots are 7-0 SU and ATS in their last seven games at home vs teams with losing records.    All NFL odds and betting trends according to Bleacher Report's official odds partner, OddsShark. Check out OddsShark on Twitter and Instagram or head to YouTube for more betting picks and analysis on this week's top games. You can also download the free odds tracker app."}