{"id": "Biggest Winners and Losers for Every Major Trade of the 2018 NFL Trade DeadlineBiggest Winners and Losers for Every Major Trade of the 2018 NFL Trade DeadlineWinner: Houston TexansLoser: Detroit LionsWinner: Philadelphia EaglesLoser: Green Bay PackersWinner: Baltimore RavensLoser: Kansas City ChiefsWinner: Denver BroncosLoser: Pittsburgh SteelersWinner: Washington RedskinsLoser: Los Angeles Rams", "paragraph": "The 2018 NFL trade deadline came and went Tuesday without any blockbuster deals. Running back Le'Veon Bell remains a Pittsburgh Steeler, while Patrick Peterson, DeSean Jackson and LeSean McCoy stayed with their respective teams, too.However, a few teams did make notable additions for the stretch run, including the Philadelphia Eagles, Los Angeles Rams and Houston Texans.Below, take a look at the winners and losers for the major moves that did (and didn't) happen at the 2018 deadline.According to Ian Rapoport of NFL Network, the Denver Broncos traded wide receiver Demaryius Thomas to the Texans for a fourth-round pick. Per Rapoport, the teams are also swapping seventh-rounders.Thomas will replace No. 2 wide receiver Will Fuller V, who suffered a torn ACL on Thursday against the Miami Dolphins and is out for the season.Thomas enjoyed a decorated nine-year career in Denver, making the Pro Bowl four times and winning the Super Bowl once. His numbers have declined since Peyton Manning's retirement in 2015, but that the Broncos have started four different quarterbacks in two-plus seasons doesn't help.Thomas, who has 36 catches for 402 yards and three scores in 2018, is the second-best pass-catching option for the Texans. No. 1 wide receiver DeAndre Hopkins is still one of the NFL's best, but a mix of injuries and inexperience limits the depth behind him.Rookie Keke Coutee is currently dealing with a hamstring injury, while Bruce Ellington is on injured reserve. Beyond them, it's undrafted rookie Vyncint Smith (one career catch) and four-year veteran Sammie Coates (29 career receptions).Houston is 5-3 and is 1.5 games ahead in the AFC South, but all four teams are separated by only two games. The Texans couldn't afford to stand pat at the deadline given their wideout issues behind Hopkins, but this trade should help mitigate the loss of Fuller.According to Adam Schefter of ESPN, the Detroit Lions sent wide receiver Golden Tate to the Philadelphia Eagles in exchange for a third-round pick.The trade is somewhat curious for the Lions, who seemed to be gearing up for a playoff run after acquiring run-stopper Damon Harrison from the New York Giants for a fifth-round pick. Mike Tanier of Bleacher Report was likewise puzzled when he tweeted: \"So, are the #Lions rebuilding or contending? They're Conbuilding!\"Ian Rapoport of NFL Network provided a potential rationale during Tuesday's edition of Up to the Minute, noting that Tate is set to become a free agent this offseason. The Lions may have been concerned about their likelihood of re-signing the 30-year-old, so they acquired draft compensation before he left in free agency. However, this move doesn't seem to jibe with the Harrison trade, and it leaves them stuck in the mediocre haze they've found themselves in for years.The Lions are lucky enough to have strong wideout depth, as Kenny Golladay and Marvin Jones Jr. will now be their two primary receivers. However, Detroit will face an uphill battle for a playoff spot without its most productive offensive player, who led the team with 44 catches and 517 yards.The Tate acquisition is easy to understand for the Eagles.Zach Berman of the Philadelphia Inquirer explained that Tate \"upgrades the offense with a tough, productive wide receiver and shows that the Eagles are serious about trying to repeat.\"Philadelphia is off to a middling 4-4 start, as the team has dealt with inconsistency on both sides of the ball, in part due to injuries. One problem has been the passing game, which ranks 20th in yards per attempt.Tate will bolster the Eagles offense, especially with his ability to create after the catch. Per Pro Football Focus, he has ranked within the top 15 in yards after the catch every year since 2012. (He's 15th in 2018.)As Mike Garafolo of NFL Network noted, Eagles wideout Nelson Agholor, who had been used as a short-passing game specialist, may wind up running more deep routes as Tate takes over his role in the slot.The Eagles are adding Tate to a pass-catching crew that contains Agholor, wideout Alshon Jeffery and tight end Zach Ertz. That's one of the NFL's top receiving units.Per Schefter, the Green Bay Packers traded running back/wide receiver Ty Montgomery to the Baltimore Ravens for a seventh-round pick. They also traded safety Ha Ha Clinton-Dix to the Redskins for a fourth-round pick, according to Tom Pelissero of NFL Network.The Montgomery move seems neutral at best for the Packers. He went from averaging nearly 12 touches per game last season to fewer than six this year, so his trade value wasn't particularly high, especially after his late lost fumble ended the Packers' chances at an upset win over the undefeated Los Angeles Rams on Sunday.But the Clinton-Dix move is confusing, especially with the Packers sporting a middle-of-the-road defense. Why trade a productive starter for a Day 3 pick?Michael Cohen of The Athletic provided some potential reasoning: \"Ha Ha Clinton-Dix was polarizing. His availability was second to none: He played every snap in every game. But the inconsistency was troubling, and there were times when he made excuses or shifted blame elsewhere. His comments about free agency probably didn't help.\"The last note may be the kicker, as Clinton-Dix is set to become a free agent this offseason. He turns only 26 in December, so he could in line for a fat payday that the Packers weren't willing to match.Still, this is a big in-season loss for the Packers, who are already facing long odds to make the playoffs at 3-3-1 and third place in the NFC North.For Baltimore, adding Montgomery could be a big win at a minimal loss.Although the end of his Packers career was hardly ideal, Montgomery has been productive when given opportunities. He's averaged 4.8 yards per carry and caught 97 passes for 827 yards and three touchdowns in four seasons.He could be useful as a change-of-pace back behind starter Alex Collins or could serve as a fourth wideout behind John Brown, Michael Crabtree and Willie Snead IV.The Ravens offense ranks a dismal 27th in the NFL in yards per play (5.2) this season. Baltimore needed to make a move after losing its last two games, as it sits outside the playoff picture at 4-4.Adding another offensive weapon for only a seventh-round pick seems prudent.No team is averaging more points per game than the Kansas City Chiefs, but a defense that ranks 21st in points allowed per game needs help.Kansas City ranks last in rush-defense efficiency, per Football Outsiders, and the team is tied for 21st in passing yards allowed per attempt.A few players could have been good fits—Eric Eager of Pro Football Focus suggested Deone Bucannon and Haason Reddick of the Arizona Cardinals—but the Chiefs didn't make a move.That puts Kansas City in a tough spot moving forward.The Chiefs may be able to outscore everybody en route to a Super Bowl win, but they'll face some potent offenses that can go blow for blow. That's what happened in their 43-40 loss to the New England Patriots, a powerful offensive team that represents their biggest obstacle in the hunt for an AFC championship.One player could have made the difference, which puts a burden on a potent pass rush (24 sacks) to keep delivering through January. If it goes cold, the Chiefs could be in trouble.The Thomas move is a clear win for Denver as well.First, the team gets to see more of rookie Courtland Sutton, who will start opposite Emmanuel Sanders. Sutton was third on the team's depth chart and has been targeted only 37 times in eight games, but he has caught 17 passes and averaged a healthy 19.1 yards per reception.He has tremendous potential and could become the team's No. 1 wideout. Inserting him into the starting lineup only helps accelerate his development.Second, the Broncos are clearing cap space, per Schefter. Getting rid of Thomas \"sheds $4 million in cap space this season and $14 million next season.\"Third, Denver gets back a fourth-round pick for a player who wasn't part of the team's future plans. Rather than potentially cutting Thomas this offseason, the Broncos receive 2019 draft capital in return.The Thomas trade seems like a win for both teams and the player, who joins a Texans team making a significant playoff push.The Pittsburgh Steelers are trade-deadline losers, but not for the assumed reason.Running back Le'Veon Bell remains a Steeler, but as Schefter noted, he wasn't going anywhere without signing his franchise tender. Bell did not do so as he continues his holdout.Bell will presumably show up before Nov. 13, which is the last day he can report and still be eligible to play this season.Aside from the ongoing Bell drama, Pittsburgh's biggest problem has been its secondary, which has underperformed all year.The Steelers benched 2016 first-round pick Artie Burns coming out of their Week 7 bye. They're tied for 19th in total takeaways and are tied for 20th adjusted passing yards per attempt allowed.A stout pass rush helps the back end—T.J. Watt has seven of the team's 24 sacks—but Pittsburgh could have used reinforcements in the secondary.Oakland Raiders safety Karl Joseph or cornerback Gareon Conley could have been worthwhile fliers.A five-year starter and 2014 first-round pick for Green Bay, Clinton-Dix registered 27 tackles and three interceptions in seven games this year. The 2016 Pro Bowler should immediately help an already stout Washington defense that has allowed the fifth-fewest points in the NFL.ESPN.com's Mike Clay praised the move, noting that he is the third-ranked safety on Pro Football Focus. He'll now play alongside D.J. Swearinger, who is ranked No. 2 and has four interceptions.The Redskins may need that secondary reinforcement with Tate now an Eagle and Amari Cooper now a Dallas Cowboy. Washington will face Philadelphia twice and Dallas once more as it looks to ward off both for the NFC East crown. The 5-2 Redskins are currently 1.5 games ahead of Philadelphia and two in front of Dallas.It's odd to call the Los Angeles Rams a loser when they've done nothing but win all season, but sending a 2019 third-rounder and a 2020 fifth-rounder to the Jacksonville Jaguars for defensive end Dante Fowler Jr. (per Schefter) seems like a steep price.Fowler hasn't lived up to expectations since the Jaguars drafted him third overall in 2015. He suffered a torn ACL in minicamp that forced him to miss all of his rookie year, but he hasn't seen the field consistently since then. In 39 career contests (only one of which he started), he's accrued 61 tackles and 14.0 sacks.The Rams are taking a chance on the talent that got him drafted so high, which could work out well. However, Fowler was playing less and less as the 2018 season progressed, going from 48 percent in Week 4 to only 35 percent in Week 8. That's concerning for a fourth-year pro.L.A. is now without its second- and third-round picks in 2019. That may be water under the bridge if the Rams become a burgeoning dynasty, but giving up that much draft capital for Fowler is a big risk since he hasn't produced consistently."}