{"id": "Keylor Navas Linked with Juventus After Losing No. 1 Spot at Real MadridRelated", "paragraph": "Real Madrid goalkeeper Keylor Navas could reportedly follow Cristiano Ronaldo to Juventus after losing his No. 1 spot at the Santiago Bernabeu to Thibaut Courtois.According to Corriere di Torino (h/t Calciomercato.com), the Costa Rican, a stalwart of Real's three recent UEFA Champions League triumphs, has been offered to the Italian champions.Real signed Courtois from Chelsea in August, a move which always seemed likely to end Navas' tenure as Real No. 1.The Belgian was not immediately installed as Real's first-choice goalkeeper, but he has now started each of their last 10 league games.Navas, meanwhile, has been restricted to just one appearance against third-tier Melilla in the Copa del Rey since he turned out against Viktoria Plzen in the Champions League on October 23.Given his pedigree, it would be little surprise were Navas irked by having to spend his time warming the bench.A move to Juve would give him an opportunity to play as the No. 1 at another major European club while not diminishing his chances of winning another Champions League.Juve's current stopper is Wojciech Szczesny, who has taken the No. 1 mantle at the Old Lady after Gianluigi Buffon's summer exit.The Poland international is a fine player, but he did prove to be a weak link in Juve's recent defeat to Manchester United, per The Independent's Miguel Delaney:Juve: solve a problem at one end by signing a goalscorer like Ronaldo, only for a problem to immediately arise at the other because they have a goalkeeper like Szczesny. There's a \"missing piece\" again. And is it De Gea?Navas has proved his ability at the very highest level and has been key in Real's recent European successes.Juve are all but unstoppable in Serie A, and their main aim now is to win the Champions League, an endeavour Navas could well help them achieve.He is certainly not going to be happy with his extended run out of the side at Real, and a switch to the Italian giants is a move that makes a lot of sense."}