{"id": "Arsenal Transfer News: Gunners Reportedly Want Loan Deal for MalcomRelated", "paragraph": "Arsenal reportedly want to take struggling Barcelona winger Malcom on loan during the January transfer window.The Gunners are identified as the most interested in Malcom, who is also wanted by Serie A side Inter Milan and Arsenal's north London rivals Tottenham Hotspur, per Lluis Miguelsanz of Sport (h/t the Daily Star's Callum Vurley).Miguelsanz (h/t Duncan Wright of The Sun) has revealed how Spurs and the Gunners have already sounded out Barca about striking a temporary deal this winter.Landing Malcom would be a coup for Arsenal head coach Unai Emery, especially since the club has been linked with the 21-year-old Brazilian in the past. Back in January of this year, Malcom was touted as a potential replacement for Alexis Sanchez, after Tottenham withdrew interest in a player valued at £45 million by Bordeaux.Arsenal have asked info to Bordeaux for the Brazilian winger #Malcom, 1997. He can be a good opportunity for January or for next season. There are many clubs on him: not easy. 🇧🇷 #transfers #AFC #ArsenalSanchez eventually moved to Arsenal's Premier League rivals Manchester United, with Henrikh Mkhitaryan going the other way. Meanwhile, Malcom had to wait until the summer to swap Ligue 1 for the Camp Nou.Things haven't gone well since his £36.5 million move to Barca. Playing time has been hard to come by as Malcom has made just two appearances off the bench in La Liga, while he's also yet to make an appearance for his new club in the UEFA Champions League.The lack of minutes is wasting Malcom's core talents, namely pace, trickery and vision. Those qualities would easily find a home in an Arsenal squad lacking true width in attacking areas.Emery's team doesn't have a natural winger, a deficiency which has forced the manager to play centre-forward Pierre-Emerick Aubameyang out wide. Danny Welbeck can play on the flanks, but like Aubameyang, he is also best suited through the middle.Similarly, Mkhitaryan, Mesut Ozil and Alex Iwobi have all been deployed wide. Yet every member of this trio is more effective when playing centrally as a No. 10.Securing Malcom would lend Emery greater tactical flexibility for his preferred 4-2-3-1 formation.Arsenal's plans for January could be undone by an injury suffered by Lionel Messi during Barca's 4-2 win over Sevilla in La Liga on Saturday:Lionel Messi is forced off with an apparent arm injury.\n\nNot what Barcelona fans want to see ahead of Wednesday's clash with Inter and the upcoming Clásico ... https://t.co/Xm9WUUN0VdWhile the full extent of the problem is not yet known, Messi's absence will increase the need for attacking depth in Ernesto Valverde's squad. Malcom can provide it in support of Luis Suarez and Ousmane Dembele.However, if Malcom still finds himself overlooked while Messi is on the treatment table, it will only strengthen the resolve of interested clubs to push for a deal when the winter window opens."}