{"id": "ATP World Tour Finals 2018 Results: Novak Djokovic Beats John Isner, MoreRelated", "paragraph": "Novak Djokovic got his ATP World Tour Finals campaign off to a perfect start with a dominant two-set win over John Isner on Monday. The top seed and favourite in Group Guga Kuerten wasted little time on his own serve and did enough in the return game to neutralise the powerful Isner. In the other match in the group, Alexander Zverev continued his dominance over Marin Cilic.On Sunday, Kei Nishikori beat Roger Federer and Kevin Anderson beat Dominic Thiem in the opening matches of the Lleyton Hewitt Group.Here are the results from Monday's action:Novak Djokovic bt. John Isner: 6-4, 6-3Alexander Zverev bt. Marin Cilic: 7-6 (5), 7-6 (1)Djokovic entered his ATP Finals opener having won five straight against Isner and the clear favourite to win this contest. The Serb won the first point with a stunning return, setting the tone for a great showing in the opening set.The hard-serving Isner conserved all of his energy for his own serve games and was rocked by several great returns but held his ground initially. Djokovic's serve games tended to be much shorter, and in the fifth game, the top seed finally got the breakthrough he needed.Per tennis writer George Bellshaw, it had been coming:It's been coming... Djokovic breaks!\n\nHits the return of the night (and there have been a lot of good ones) to pass Isner and clip the baseline, breaking for a 3-2 lead. \n\nHasn't dropped a point on his own serve and looking scarily good.With the break under his belt, Djokovic pushed on, serving out the set to take the lead.As noted by tennis writer Jose Morgado, Isner played quite well on his own serve, but Djokovic was masterful:Djokovic plays a great set of tennis, takes it 6-4. Looked much easier and Isner actually served and played quite well tbh (10 aces, 64% first serves in).The second set started almost exactly the same way, with Isner giving it his all on his own serve and seemingly using Djoker's serve games to catch his breath. He didn't win a single point on Djokovic's serve in the first three games.This time Isner's resolve would hold until the seventh game when more superb return play gave Djokovic two break chances and his opponent netted the second.Isner would win his first two points on Djokovic's serve in the next game but no more, faltering again on his own serve to close out the contest.It's fair to say the Djoker impressed:Djokovic dispatches Isner 6-4, 6-3. The world No. 1 put on a clinic today.Monday's other contest between Zverev and Cilic was a close one, with the former needing two tie-breaks to get his first win of the tournament.The German has dominated this rivalry of late, per Omnisport:6⃣ wins in a row over Marin Cilic for Alexander Zverev!\n\nThe German starts his #ATPFinals campaign with a 7-6 (7-5) 7-6 (7-1) victory in London. https://t.co/Ix9jtEcUguHe had to dig deep on Monday however and should consider himself somewhat lucky not to see his win streak snapped. Cilic had the upper hand in most of the rallies, and silly errors at key times proved the difference.According to Bellshaw, he should have come out the victor:Another tiebreak between Zverev and Cilic. Incredibly tight match but in reality Cilic could have won this in straights.His wastefulness could cost him dearly, as Cilic will likely have to beat Djokovic and Isner to have any chance of making it to the next round. The Serb has been masterful since the U.S. Open and seems to have recovered just fine from the illness that ruined his chances in Paris, ending his 22-match win streak."}