{"id": "Dwayne Haskins, Ohio State Survive Anthony McFarland, Maryland 52-51 in OTRelated", "paragraph": "The Ohio State Buckeyes survived another sluggish start to pass their final road test of the year by pulling out a 52-51 overtime victory over the Maryland Terrapins in College Park on Saturday. Dwayne Haskins led the way for Ohio State by throwing for 405 yards and was responsible for six total touchdowns, with running back J.K. Dobbins (career-high 203 yards and one touchdown) also contributing to the victory.Maryland running back Anthony McFarland ran for 298 yards and two touchdowns.                              Dwayne Haskins Can Carry Ohio State to Big Ten TitleOhio State has struggled both on the ground and on defense, but it has still managed to stay in College Football Playoff contention—and it's all thanks to Haskins.The bad news for the rest of the college football world is that the sophomore star proved on Saturday that he can be more than just a one-dimensional passer.Entering the game, Haskins had just 41 carries through the first 10 games of the season, good for just 34 yards. Only once did he have more than 10 rushing yards in a game, a 24-yard performance against Oregon State in the season opener.  The 6'3\", 220-pound quarterback had a different approach against Maryland, pulling the ball down and taking off when the opportunity presented itself. He finished with season highs in carries (15), yards (59) and rushing touchdowns (three).Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sNotre Dame vs. USC: Behind the Historic RivalryBryce Love for Six Nick Chubb with the Super Hurdle Against Missouri Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sNotre Dame vs. USC: Behind the Historic RivalryBryce Love for Six Nick Chubb with the Super Hurdle Against Missouri Meanwhile, he also completed 28 of 38 passes while leading his team to a come-from-behind victory.Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sNotre Dame vs. USC: Behind the Historic RivalryBryce Love for Six Nick Chubb with the Super Hurdle Against Missouri Haskins was far from perfect; he lost a fumble and also threw a brutal pick-six at the beginning of the second half. But keeping defenses honest with his legs completely changes Ohio State's offense—and the results showed in the team's 283 total rushing yards Saturday.Some fans had been looking for dual-threat quarterback Tate Martell to take on a bigger role in the offense, especially in the red zone. But if Haskins is able to make plays with his legs as well as his arm, some of the Buckeyes' issues could become irrelevant.Ohio State isn't earning any style points with the College Football Playoff committee, but it's doing enough to stay in the mix. If the Buckeyes wind up winning a conference title this season, there's no question Haskins will have been the MVP.                         Freshman RB Anthony McFarland Deserves Bigger Role In Maryland OffenseOn Senior Day at Maryland, it was a freshman who shined brightest for the Terps.Listed as a 4-star recruit by 247Sports, McFarland started his career with two 100-yard games in his first four appearances. However, he hit a midseason lull, failing to hit 100 rushing yards in a game before getting back on track last week with a then-career-high 210 yards against Indiana.That was a sign of things to come against the Buckeyes, a defense that entered the game ranked 43rd in the nation against the run.McFarland helped Maryland jump out to a 14-3 lead with touchdown runs of 81 yards and 75 yards...all within his first three carries of the day. Purdue Football's No. 1 Fan Is Inspiring the TeamCFB's Creative Entrances Put WWE to ShameCFB's Walk-on Scholarship Season Has ReturnedTua Continues to Take Hawaiian Football to Another LevelCFB Players Teaming Up to Tackle Hunger in Miami4'2\" WR Will Walk on at Baylor UniversityFelder's Film Room: Ferocious Front 7's Will Decide National ChampionshipUAB Is Making CFB Even More Fun and Having Its Best Season at the Same TimeHeisman Hopefuls: B/R Highlights Finalists Prior to Trophy CeremonyWho Should Be the 2017 Heisman Finalists?Miami vs. Clemson: Which Elite Defense Will Prevail in ACC Championship GameCollege Football Top 25 Upset Alert for Week 11College Football Top 25 Upset Alert for Week 10Which CFB Stars Need More Heisman Hype?College Football Top 25 Upset Alert for Week 9Barkley Is Freakiest RB Prospect Since Bo JacksonFrom 7th-Grade QB Prodigy to One of CFB's Top WR'sNotre Dame vs. USC: Behind the Historic RivalryBryce Love for Six Nick Chubb with the Super Hurdle Against Missouri He has now piled up 508 rushing yards over the last two games and is averaging 8.2 yards per carry on the season. Not bad for a freshman.McFarland entered Saturday having only three games this season with double-digit carries. That's hard to fathom considering how explosive he has been when given the opportunity.  Maryland may have lost each of its past two games, but it's clear feeding McFarland gives the team the best chance at moving the football and putting points on the board.                        Urban Meyer Must Address Porous Defense Before \"The Game\"Allowing big plays has been an issue all season for the Ohio State defense.Well, the Buckeyes once again had a hard time keeping the opposing offense in front of them on Saturday—and it proved costly. Ohio State fell behind 17-3 in the first quarter because of three huge gains: an 81-yard touchdown run, a 75-yard touchdown run and a 56-yard pass completion (which led to a field goal). The Buckeyes apparently didn't learn from that disastrous opening period either, because McFarland added a 52-yard run early in the second quarter as well.Those struggles continued in the second half as well, even with the game on the line. From the eight-minute mark of the fourth quarter through the end of overtime, Maryland produced a 27-yard touchdown, a 60-yard completion to the goal line, a 30-yard pass and a 24-yard run.Upon further review ... What. A. TD catch. \n\n@TerpsFootball leads late. https://t.co/UXNatKTqpsThe Buckeyes were torched for eight plays of 20-plus yards. In a single game. By a Terrapins squad that has yet to gain bowl eligibility.In September, Ohio State defensive coordinator Greg Schiano said his team's tendency to give up the big play was \"unacceptable,\" per the Toldeo Blade's Kyle Rowland. With one game remaining in the regular season, the defense has yet to figure things out.One would've thought the Purdue loss would have got the players' attention...but it hasn't.Losing Nick Bosa to injury in Week 3 has had an impact on the defense as a whole. However, there is still plenty of talent on that side of the football for the Buckeyes, but head coach Urban Meyer can't be pleased with what he's seeing lately.Michigan's strength is undoubtedly its defense, but its offense has come on strong as of late under the leadership of quarterback Shea Patterson. The Wolverines rank 22nd in scoring offense, putting up 38-plus points in four of their last five games.In other words, Schiano and Co. could be in for a long day if adjustments aren't made over the next seven days.  What's NextOhio State (10-1) returns to Columbus for The Game against archrival Michigan, with the winner earning a trip to Indianapolis to take on Northwestern in the Big Ten Championship Game. Meanwhile, Maryland (5-6) will look to earn bowl eligibility in its regular-season finale against Penn State in Happy Valley."}