{"id": "Jordan McNair's parents react to Maryland's decision to retain DJ Durkin", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutDJ Durkin has been retained as Maryland head football coach, and for Jordan McNair's parents, that decision made a difficult situation even worse.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsJordan McNair was hospitalized on May 29 after a team workout and died June 13.(Photo: AP)BALTIMORE — Jordan McNair's parents said Tuesday that the University of Maryland Board of Regents' recommendation to retain football coach DJ Durkin has made an already difficult situation even worse.\"I feel like I've been punched in the stomach, and somebody spit in my face,\" McNair's father, Martin, said.\"I miss my son every day,\" his mother, Tonya Wilson, added. \"And today, it just didn't help.\"Jordan McNair, who was an offensive lineman for the Terrapins, suffered heat illness during a workout on May 29 and died June 13. His death prompted an investigation from the university, as well as media reports that the culture within the program was \"toxic.\"McNair's parents spoke roughly two hours after the board held a news conference Tuesday about the findings of an independent commission's investigation related to that \"toxic\" characterization. The investigation determined that the culture within the program was not \"toxic\" but found that there had been several troubling incidents and signs of dysfunction in the athletic department.MARYLAND FOOTBALL: Durkin to be reinstated after Jordan McNair investigationWOLKEN: It makes no sense for Maryland to keep DurkinHassan Murphy, an attorney for the McNair family, slammed the board's actions as \"callous\" and \"indefensible.\"\"Today, the board ratified and validated the heartbreaking actions by Coach Durkin and his staff toward Jordan in May by continuing the employment of the man who failed in his primary responsibility to Jordan,\" said Murphy, the managing partner of Murphy, Falcon & Murphy. \"How can a student-athlete be called a p---y as he is in the early stages of death, dying before their eyes, with no action taken, and yet no one be held accountable?\"In addition to recommending that Durkin be reinstated as head coach, the board also indicated that it believes athletic director Damon Evans should remain in his role. University president Wallace Loh, meanwhile, announced that he will retire in June.Contact Tom Schad at tschad@usatoday.com or on Twitter @Tom_Schad.A link has been posted to your Facebook feed.   "}