{"id": "If NASCAR's champ isn't Kevin Harvick or Kyle Busch, the season's end will be a letdownIf NASCAR's champ isn't Kevin Harvick or Kyle Busch, the season's end will be a letdownIf NASCAR's champ isn't Kevin Harvick or Kyle Busch, the season's end will be a letdown", "paragraph": "Sign up for the For The Win daily email newsletter for the top stories every day.\n\t\t\t\tPlease re-enter your email address.\t\t\t\n\t\t\tYou'll now receive the top For The Win stories each day directly in your inbox.\t\t\n\n\tBy Michelle R. Martinelli\nNovember 17, 2018 5:58 pm\n\n\n\t\t\t\t\tFollow\t\t\t\t\t@MMartinelli4\t\t\t\t\n!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');\n\n\n\t\tBy: Michelle R. Martinelli\t\t| November 17, 2018 5:58 pm\t\t\n\n\n\t\tFollow @MMartinelli4\t\n!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');\n\n\nHOMESTEAD, Fla. — Four races into the 2018 NASCAR Cup Series schedule, it was clear Kevin Harvick was going to have a career season. A few weeks later, the same became true for Kyle Busch.A quarter of the way into a 36-race season, Harvick and Busch had each recorded three-race win streaks. Fast forward to the Cup Series finale — Sunday’s Ford EcoBoost 400 at Homestead-Miami Speedway — and they’re tied for the most wins in the series this season with eight apiece, matching a career-high for Busch and setting a personal best for Harvick.So it’s far from surprising that the No. 4 Ford and No. 18 Toyota are two of the final four teams racing for a championship. It’d actually be a disappointment if they weren’t, and if neither of them win their second Cup Series title Sunday, that, too, would be a disappointingly anticlimactic end to two exceptionally dominant seasons.That’s not a knock against defending Cup Series champion Martin Truex Jr. and Joey Logano, the other two drivers competing for the title. They’re both skilled racers who deserve to be among the Championship 4, with Truex having four checkered flags and Logano with two as he and his team found their rhythm through the first nine playoff races. Their teams are certainly worthy of winning a title.As we so often see in sports, sometimes, the best team doesn’t win the championship. But with the Big Three — the season-long nickname dealt to Harvick, Busch and Truex — among the championship contenders, the best NASCAR teams are actually fighting for the trophy, which is great for the struggling sport.(Chris Graythen/Getty Images)“It’s certainly been a successful year, but I don’t think it would be truly successful without being able to bring home that championship,” Busch said Thursday.“It depends on who you lose it to. Obviously, Harvick’s done a phenomenal job. Those guys and that group have been so good all season long, even in the late stages of last year. You lose it to him, and it’s like, yeah OK, I can see why they got it.”Although Truex is among the dominant three, Harvick and Busch — who were the Cup Series champions in 2014 and 2015, respectively — are in their own zip code and have been for the majority of the season. Along with their eight wins each, Harvick and Busch have led almost 34 percent of the 9,983 laps this year combined — and the No. 4 team is at nearly 20 percent on its own.Even when they don’t win a race, they’re often still in it by the end. Harvick has 22 top-5 finishes, and Busch has 21. And when they’ve occasionally started races toward the back of the field, they’ve flexed their speed and caught up to the front. Friday, Busch qualified second, while Harvick will start from the 12th spot.Their teams haven’t had to be perfect to win — though they might have to be Sunday as they race each other, first and foremost — but, as Logano previously told For The Win, everyone else has to be perfect to beat them.(Matt Sullivan/Getty Images)“I know how hard this is, and I know that there are so many things that can go wrong,” Harvick said while explaining why he won’t call it a disappointing season if he doesn’t win.“Sometimes you’re going to win, sometimes you’re going to lose. I think we’re in a better position to win this year than we were last year. I know that for sure because of the speed of the cars. I look at this year from a speed of the car standpoint, and it’s just as good as the year we won the championship.”His fans — and, separately, Busch’s — might feel differently if their driver isn’t hoisting a trophy.Harvick’s and Busch’s cars have earned the right to be called the fastest of the 2018 season — no matter what happens at Homestead — and if one of them wins Sunday, it will be easy to declare him the best of the best this season. If Truex or Logano win, we’ll talk about their impressive performance or clever strategy in this particular event and the playoffs overall. We’ll repeatedly break down how they beat the other three championship contenders.But the prowess of Harvick and Busch will still remain the major takeaway this season.Everyone loves crazy upsets and wild finishes, and that would certainly make for an entertaining end to the season. Logano could win his first championship, while Truex could be the first driver to defend his title in eight years and do it in his team’s final race before closing up shop.But it just seems like Harvick and Busch have already earned the right to be NASCAR’s champion. Their last 10 months have been aggressively building up to this moment. Now, one of them just has to take it.Joey Logano, Kevin Harvick, Kyle Busch, Martin Truex Jr, NASCAR, NASCAR playoffs, NASCAR, Racing\n\t\tMichelle is a writer at FTW, covering NASCAR and other sports. She once ran a 10k just because the finish line was home plate at Comerica Park.\t\n\n\t\t\t\tCharles Barkley on the real reason the Warriors suspended Draymond Green\t\t\t\n\n\n\t\t\t\tHarvard loses TD after player flips off opponent while running into the end zone\t\t\t\n\n\n\t\t\t\tReport: Here's the Draymond Green insult of Kevin Durant that got him suspended\t\t\t\n\nNovember 17, 2018 8:25 pm \n·\n\nMichelle R. Martinelli \nThe Cowboys pulled off a stunning upset at home.   \nNovember 17, 2018 5:14 pm \n·\n\nNick Schwartz \nCollege football games and snowball fights aren’t a great combination.   \nNovember 17, 2018 4:03 pm \n·\n\nMichelle R. Martinelli \nAt no point is this a good idea mid-game.   \nNovember 17, 2018 3:29 pm \n·\n\nNick Schwartz \nTwitter roasts Notre Dame over their Yankees-inspired uniforms.   \nNovember 17, 2018 2:53 pm \n·\n\nNick Schwartz \nDoes your college football team have the best NFL pros?  Vote in #FanIndex!   \nNovember 17, 2018 2:17 pm \n·\n\nNick Schwartz \nAnthony McFarland torched the Buckeyes in the first half on Saturday.   \nNovember 17, 2018 1:26 pm \n·\n\nNick Schwartz \nDraymond Green and Kevin Durant won’t be sharing the floor this weekend.   \nNovember 17, 2018 12:33 pm \n·\n\nMichelle R. Martinelli \n“WE BEAT BAMA.”   \nNovember 17, 2018 12:21 pm \n·\n\nNick Schwartz \nLee Corso took his headgear pick to a new level on Saturday.   \nNovember 17, 2018 12:05 pm \n·\n\nMichelle R. Martinelli \nLee Corso is all about UCF and its fans.   \n\t\t\t\t\tThanks for signing up.\n\t\t\t\t\tPlease check your email for a confirmation.\t\t\t\t\n\t\t\t\t\tSomething went wrong.\n\t\t\t\tIf NASCAR's champ isn't Kevin Harvick or Kyle Busch, the season's end will be a letdownLet NASCAR's 4 championship drivers convince you why they'll win at HomesteadDale Earnhardt Jr. floats Gillette 'old guns' ad idea after Jimmie Johnson shaved trademark beard\n\n\n\n\n\t\t\tPowered by WordPress.com VIP \n\n\t\t\tShow More Information\t\t\n\n\n\t\t\tPlease enter an email address.\t\tThanks for signing up.Please check your email for a confirmation.\n\t\t\tSomething went wrong.\t\tHarvick and Busch have had exceptionally dominant seasons and are the two best in 2018 no matter who the champion is.   "}