{"id": "No. 10 LSU, Orgeron, eye Tigers' best season since 2012", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutLSU heads into practice this week knowing it is two victories away from a regular season that will have exceeded expectations by a wide marginA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsLSU coach Ed Orgeron celebrates with his team after beating Arkansas 24-17 during an NCAA college football game, Saturday, Nov. 10, 2018, in Fayetteville, Ark. (AP Photo/Michael Woods)(Photo: The Associated Press)BATON ROUGE, La. (AP) — Although LSU cannot win the Southeastern Conference championship, victories in its next two games will result in a regular season that exceeded expectations by a wide margin.The 10th-ranked Tigers need to beat Rice this Saturday and Texas A&M in College Station the following week for their first 10-win regular season since 2012. That probably also would put LSU in a New Year's Six Bowl.So while coach Ed Orgeron hoped the Tigers could contend for a championship, he doesn't want to downplay the improvement he's seen in the program, which was ranked 25th in the preseason poll and climbed as high as fourth before sliding back on the heels of a loss to No. 1 Alabama.\"This team wanted to win a national championship,\" Orgeron said. \"But, we never set that as a goal for this team. This is LSU. I know the expectations. We are getting the most out of this football team. We still have two tough games to go. Going to a New Year's Day bowl would be a good step.\"The Tigers did enough to defeat Arkansas 24-17 last Saturday. LSU squandered much of a 21-point advantage in the fourth quarter before running out the clock to preserve its eighth victory of the year.\"We have to finish the game,\" Orgeron said. \"I was disappointed that we did not finish the game strong.\"For the first time since the Ole Miss game in late September, quarterback Joe Burrow threw a touchdown pass — a 40-yarder to Justin Jefferson. However, for the fifth consecutive game, Burrow failed to throw for more than 200 yards.Moreover, the Tigers have had just one back rush for more than 100 yards in that five-game span. Clyde Edwards-Helaire ran for 145 yards in LSU's 36-16 victory against Georgia.\"We have lost our identity on offense,\" Oregeron said. \"We have been trying some new things. Maybe we have put too much in. We may need to simplify.\"Orgeron said he told offensive coordinator Steve Ensminger, \"Let's look at what we did vs. Georgia. Are we covering up for some of our weaknesses? Is it that we can't have enough receivers out in routes because of (pass) protection?\"This season was expected to be a rebuilding year, largely because LSU's offense entered the season with only three returning starters: tight end Foster Moreau, left tackle Saahdiq Charles and left guard Garrett Brumfield. LSU lost a fourth returning starter when right guard Ed Ingram was suspended indefinitely before the start of practice.Charles and Brumfield have missed a combined eight games. Those two players have been together on the starting offensive line just four times.\"The offensive line has played good, but we have not been consistent,\" starting center Lloyd Cushenberry said. \"It's a little mixture of everything. Sometimes things happen in football. Coming into the season, people thought we were going get demolished in every game. We have done well.\"Getting to a New Year's Six bowl game would be huge for this team,\" Cushenberry added. \"People outside the team didn't think we were going to be good this year. They thought we would win just six games. We have a chance to prove ourselves right and that they were wrong.\"LSU is a 40-plus point favorite over a one-win Rice team. The Tigers will have a greater challenge when they close the regular season at Texas A&M.\"Our target this week is Rice and nothing else,\" Orgeron said. \"Our focus is to be 9-2 at the end of the week. Getting to a New Year's bowl is really important for the players. We have talked about finishing strong. We have to play well this week and play well next week.\"___More AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}