{"id": "Bethune-Cookman scores twice in 4th, beats Florida A&M 33-19", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutTydarius Peters had two fourth-quarter interceptions, including a pick-6 with 17 seconds remaining, to help Bethune-Cookman hold off Florida A&M for a 33-19 victory in the Florida ClassicA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsORLANDO, Fla. (AP) — Tydarius Peters had two fourth-quarter interceptions, including a pick-6 with 17 seconds remaining, to help Bethune-Cookman hold off Florida A&M for a 33-19 victory on Saturday in the Florida Classic.Florida A&M (6-5, 5-2 Mid-Eastern Athletic Conference) has lost three straight games, and with North Carolina A&T's win over North Carolina Central, is knocked out of the conference title.  Bethune-Cookman (7-5, 5-2) has won its last three.Ryan Stanley's 9-yard touchdown pass to George Webb gave the Rattlers a 19-17 lead, but Vernon Walker III blocked the ensuing PAT and ran it back to the other end zone to tie the game at 19 with 37 seconds left in the third quarter.Jabari Dunham's 5-yard touchdown run gave Bethune-Cookman a 26-19 lead midway through the fourth quarter. Peters picked off a Stanley pass on the Rattlers next possession, but Florida A&M forced a three-and-out. Stanley led a 10-play drive to the BCU 11 before throwing his second pick of the game to Peters, who scored to seal it for the Wildcats.Tupac Isme ran for 107 yards and just five carries, including a 99-yard score, for the Wildcats.Stanley was 27-of-45 passing for 305 yards and threw two touchdowns but three interceptions for the Rattlers.Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}