{"id": "Flags, injuries, bad 'D' hurt Skins in 38-14 loss to Falcons", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutFlags, injuries, bad running defense hurt the Washington Redskins in 38-14 loss to the Atlanta FalconsA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsWashington Redskins wide receiver Josh Doctson (18) pulls in a touchdown pass as Atlanta Falcons free safety Isaiah Oliver (20) watches during the first half of an NFL football game Sunday, Nov. 4, 2018, in Landover, Md. (AP Photo/Susan Walsh)(Photo: The Associated Press)LANDOVER, Md. (AP) — As harbingers go, this was quite a start for the Washington Redskins.After a 4-yard run on the opening play of the game, the hosts' initial possession featured a holding penalty, a sack for a loss of 9 yards, an injured left knee for left guard Shawn Lauvao — who was taken to the locker room in a wheelchair — and a three-and-out punt.Washington's following drive also ended in a punt, but not before Alex Smith threw a ball that hit a Falcons defender's helmet, receiver Josh Doctson dropped a pair of passes, and right tackle Morgan Moses limped off with an injured right knee, although he later returned.Nothing really went right for the mistake-prone Redskins on Sunday in a 38-14 loss to Matt Ryan, Julio Jones and the Atlanta Falcons that ended the three-game winning streak that put Washington atop the NFC East.\"It was a bad game, but it was one game,\" Redskins linebacker Ryan Kerrigan said. \"We can't let that happen again.\"A Skins defense that came in ranked No. 2 in the NFL against the run and No. 4 overall turned in a real clunker.Atlanta gained 154 yards on the ground, averaging 6.4 per carry. Worth noting: The Falcons last ran for more than 100 in Week 2.\"Caught us with our pants down and hit us in the mouth,\" Washington cornerback Josh Norman said.There were several other issues for the Redskins.At one point in the second quarter, Atlanta was outgaining Washington 229-41.The Falcons were 8 for 8 on third-down conversions before halftime.Washington finished with 10 penalties for 147 yards, and some players thought the officiating was to blame.\"Might as well just give them the ball,\" coach Jay Gruden said, \"and give them the game.\"Atlanta (4-4) began the third quarter with an eight-play drive that finished with Ryan's third of four TD passes for the afternoon — a 10-yarder to running back Tevin Coleman — that boosted its advantage to 28-7.Washington then punted after its possession was derailed by penalties: one for taunting on Doctson, another for unsporstmanlike conduct on Moses, and a holding call on Pro Bowl right guard Brandon Scherff (who soon exited with a hurt left shoulder, joining starters Lauvao and left tackle Trent Williams, who had thumb surgery last week, on the sideline).Atlanta put together touchdown drives that covered 86, 81 and 75 yards in the first half, then another 75-yarder to begin the second. A Redskins secondary that added starting safety Ha Ha Clinton-Dix in a trade-deadline deal Tuesday — there was quite a bit of hand-gesturing by safety D.J. Swearinger before snaps — gave up first-half TD passes by Ryan of 39 yards to Coleman and 40 yards to Calvin Ridley.The capper was a 35-yarder in the fourth quarter to Jones, who dragged Clinton-Dix a bit at the end of the play for his first scoring catch in nearly a year.The Redskins have thrived on offense with 33-year-old running back Adrian Peterson carrying the load. But he only ran nine times for a measly 17 yards through the opening two quarters, when Washington's best gain was 22 on a scramble by quarterback Alex Smith.Nearly sacked, Smith spun out of a defender's arms and turned it into a run up the sideline ending with a pop from Atlanta's Brian Poole that was so big it drew an \"Ohhhhh!\" from spectators. It helped extend an 11-play, 80-yard drive that finished with Smith's 2-yard fade pass to Doctson for a TD that cut Washington's deficit to 14-7 late in the opening half.That was just about it in terms of highlights for the Redskins.\"Got to be better,\" Swearinger said. \"Got to be disciplined.\"___Follow Howard Fendrich on Twitter at http://twitter.com/HowardFendrich___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}