{"id": "For just $1, students get movie rights to one of Stephen King's short stories", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutFor student filmmakers at the Blaenau Gwent Film Academy in Wales, $1 was enough to buy the film rights Stephen King's \"Stationary Bike.\"A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    Clowns are about to become scary again as Stephen King's 'It' hits the big screen for the first time. \r\nVideo provided by Reuters\n    NewslookWe can't name all of the author's works that have been adapted, but we can name a few...(Photo: Francois Mori/AP)PORTLAND, Maine – Who says a dollar doesn't go far anymore?For student filmmakers at the Blaenau Gwent Film Academy in Wales, $1 was enough to buy the rights to a Stephen King work. The horror writer sold the U.K. students movie rights to \"Stationary Bike,\" a story about a man who uses a stationary bike to improve his health. As he begins to imagine a more interesting landscape for his rides, things start to get weird. (It's Stephen King, remember?)Kevin Phillips, a tutor at the school, tells The Boston Globe the $1 deal is \"great for our students who are fans of his writing and a great scoop for the academy.\"A link has been posted to your Facebook feed. You won't be seeing the kids' efforts in your local multiplex. Aside from the fact they're, well, in Wales, the purchase was made through King's \"Dollar Babies\" program, meaning they gave permission to make a noncommercial film.King’s website currently lists 30 stories that are not under contract for movies, meaning they are \"available for film students who want to try their hands at a Stephen King story.” Anyone can apply.Phillips said his students, who range in age from 7 to 18 years old, plan to start filming their project in around three months.More: Stephen King's 'The Outsider': Thriller is a witchy brew of crime, horrorMore: 'Haunting of Hill House' gets the ultimate horror praise: A glowing tweet from Stephen KingContributing: The Associated PressA link has been posted to your Facebook feed.  "}