{"id": "A feverish hunt for more suspicious packages in biggest mail-based terror plot since 2001", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutLong week? Short list. Domestic terrorism is back in the news as several suspicious packages with explosive devices were apprehended. But wait, there's more: Stocks plunge, midterms loom and Megyn Kelly apologizes.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsPolice stand guard outside of the Time Warner Center after an explosive device was found there on October 24, 2018 in New York City.(Photo: Spencer Platt, Getty Images)Domestic terrorism reared its ugly head Wednesday as a series of potentially dangerous packages focused the nation’s attention on security threats.  The story dominating the headlines today: Suspicious packages sent to CNN NY offices, Clintons, Obamas.We will take a look at other stories you might have missed –  an intensifying stock market sell-off, the midterm elections and the Kavanaugh effect and Megyn Kelly’s apology – but nothing drew more attention than the mail-based terror plot.Law enforcement officials were on a feverish hunt for more suspicious packages following the discovery of deliveries containing explosive devices that were sent to high-profile critics of President Trump. The targets: Hillary Rodham Clinton, Barack Obama, George Soros, Debbie Wasserman Schultz and CNN’s Manhattan offices. The packages were identified during routine mail screening procedures and taken to the FBI lab for examination. It appeared to be the biggest threat of a mail-based terror plot since the 2001 Anthrax attacks that killed five people in the weeks after 9/11. Trump slammed  \"this egregious conduct,\" calling it \"abhorrent to everything we hold dear and sacred as Americans.\" He promised to \"get to the bottom of this\" and punish the perpetrators. Here's what we know now: • Suspicious packages sent to CNN NY offices, Clintons, Obamas \n• Trump vows to 'get to the bottom' of threats\n• CNN evacuates while live on air \n• Dangerous deliveries prompt nationwide security response \n• Clinton, Trump family members join politicians in praising Secret Service \n    A bomb mailed to the offices of CNN prompted the evacuation of the Time Warner Center in Manhattan on Wednesday, left many workers shocked and frazzled. Officials confirmed the package contained a crude pipe bomb. (Oct. 24)\n    APThe stock market sell-off on Wall Street intensified Wednesday, knocking the Dow down more than 600 points and wiping out the gains for the year for the blue-chip average and the broad Standard & Poor's 500 index. The latest swoon signaled to many Wall Street pros that the decline was entering a new, more dangerous phase. What's going on? Traders are concerned about future growth amid rising inflation, interest rates and uncertainty over trade. Worried? Advisors say don't panic and avoid making these investment mistakes when stocks are volatile.  A USA TODAY/Suffolk University Poll found six in 10 likely voters said the Supreme Court confirmation of Brett Kavanaugh — who testified before Congress on allegations of sexual assault — influenced which party they would choose this election. Of the likely voters, 35 percent said the confirmation made them more likely to vote Democrat, while 27 percent said it made them more likely to vote Republican. Another 37 percent said it wouldn't change their vote.“I want to begin with two words: I'm sorry,” said the NBC host at the top of her Wednesday morning show following remarks the day before defending blackface. On Tuesday, Kelly said the use of blackface was OK so long as it was for Halloween and it was respectful. One day later, Kelly said her comments were wrong. “The country feels so divided and I have no wish to add to that pain and offense,” said Kelly. “I believe this is a time for more understanding, more love, more sensitivity and honor, and I want to be part of that.”\n    Megyn Kelly apologized to colleagues after making controversial comments about blackface on live television.\n    USA TODAYThe Hubble space telescope was knocked into safe mode earlier this month because a gyroscope used to help locate and pinpoint targets stopped working. So, what’s the fix? Just like you might do with a buggy computer or router, NASA quickly flipped off a backup gyroscope then turned it back on. The move helped regulate rotation speeds on the gyroscope, and NASA said Hubble is close to working back to normal. The Short List is a compilation of stories from across the USA TODAY Network. It was brought to you by editors Cara Richardson, Brett Molina and David Carrig. \n "}