{"id": "7 fantasy football waiver wire pick-ups who could help you win in the playoffs7 fantasy football waiver wire pick-ups who could help you win in the playoffs7 fantasy football waiver wire pick-ups who could help you win in the playoffs", "paragraph": "Sign up for the For The Win daily email newsletter for the top stories every day.\n\t\t\t\tPlease re-enter your email address.\t\t\t\n\t\t\tYou'll now receive the top For The Win stories each day directly in your inbox.\t\t\n\n\tBy Charles Curtis\nNovember 6, 2018 2:07 pm\n\n\n\t\t\t\t\tFollow\t\t\t\t\t@bycharlescurtis\t\t\t\t\n!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');\n\n\n\t\tBy: Charles Curtis\t\t| November 6, 2018 2:07 pm\t\t\n\n\n\t\tFollow @bycharlescurtis\t\n!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');\n\n\nWe’re entering the home stretch of sorts in fantasy football: If you’re in a league with playoffs starting in Week 14, the postseason is looming.For those of you with contending teams, you’ve got to think ahead — yes, there are still bye weeks to consider. But if you have a deep bench, you can free up a spot to speculate on a player who might help you in the fantasy playoffs and get to a name long before other teams do.Let’s run through a few players to speculatively grab now:This is particularly for contending Todd Gurley owners: He’s your insurance policy if Gurley sits with an injury or if the Rams end up sitting their prized star a bit later in the season if they clinch the top seed in the NFC. Plus, for dynasty leaguers, he’s talented! Look at this crazy touchdown he scored last week:If you own Kareem Hunt, of course. But even if you’re not contending, now’s the time to grab handcuffs like this one.Aaron Doster-USA TODAY SportsIt’s possible he’s on your waiver wire after getting benched and replaced by Ryan Fitzpatrick. But we’ve seen the coaching staff in Tampa change its mind before, and if the Bucs aren’t contending by December, maybe they give Winston a chance again to prove he’s not a bust. His future matchups include games against the 49ers, Panthers and Saints. If you have room on your bench and you’re streaming quarterbacks this year, he might help.ESPN reported his return from a torn ACL is a “longshot.” But you know the tight end position is terrible this year, so why not take a chance and stash a player who caught eight touchdowns two years ago?I’ve been touting him all season as a stash, and I’ll still do it now — despite two back-to-back big games for Lamar Miller, he just put up a dud against the Broncos. What if Foreman returns from injury and shows explosiveness out of the backfield? It’s worth a shot.The rookie could be Antonio Brown insurance.Kim Klement-USA TODAY SportsHe was starting to work his way into the offense before a hamstring injury sidelined him. Maybe if Peyton Barber continues to disappoint, the second-rounder is given more of a role when he returns to full health. Fantasy, Fantasy Football, NFL, Fantasy, NFL\n\t\tCharles is a writer for For The Win. He once dropped an easy foul ball at Shea Stadium and was booed by 35,000 angry Mets fans (and hasn't recovered from it).\t\n\n\t\t\t\tCharles Barkley on the real reason the Warriors suspended Draymond Green\t\t\t\n\n\n\t\t\t\tHarvard loses TD after player flips off opponent while running into the end zone\t\t\t\n\n\n\t\t\t\tReport: Here's the Draymond Green insult of Kevin Durant that got him suspended\t\t\t\n\nNovember 17, 2018 8:25 pm \n·\n\nMichelle R. Martinelli \nThe Cowboys pulled off a stunning upset at home.   \nNovember 17, 2018 5:58 pm \n·\n\nMichelle R. Martinelli \nHarvick and Busch have had exceptionally dominant seasons and are the two best in 2018 no matter who the champion is.   \nNovember 17, 2018 5:14 pm \n·\n\nNick Schwartz \nCollege football games and snowball fights aren’t a great combination.   \nNovember 17, 2018 4:03 pm \n·\n\nMichelle R. Martinelli \nAt no point is this a good idea mid-game.   \nNovember 17, 2018 3:29 pm \n·\n\nNick Schwartz \nTwitter roasts Notre Dame over their Yankees-inspired uniforms.   \nNovember 17, 2018 2:53 pm \n·\n\nNick Schwartz \nDoes your college football team have the best NFL pros?  Vote in #FanIndex!   \nNovember 17, 2018 2:17 pm \n·\n\nNick Schwartz \nAnthony McFarland torched the Buckeyes in the first half on Saturday.   \nNovember 17, 2018 1:26 pm \n·\n\nNick Schwartz \nDraymond Green and Kevin Durant won’t be sharing the floor this weekend.   \nNovember 17, 2018 12:33 pm \n·\n\nMichelle R. Martinelli \n“WE BEAT BAMA.”   \nNovember 17, 2018 12:21 pm \n·\n\nNick Schwartz \nLee Corso took his headgear pick to a new level on Saturday.   \n\t\t\t\t\tThanks for signing up.\n\t\t\t\t\tPlease check your email for a confirmation.\t\t\t\t\n\t\t\t\t\tSomething went wrong.\n\t\t\t\tThe #PatMahomesChallenge is here and it's unspeakably disgustingA Charlotte meteorologist is embracing Cam Newton's famous fashion sense and dressing like himMatt Patricia used 891 words to defend making the Lions practice in the snow\n\n\n\n\n\t\t\tPowered by WordPress.com VIP \n\n\t\t\tShow More Information\t\t\n\n\n\t\t\tPlease enter an email address.\t\tThanks for signing up.Please check your email for a confirmation.\n\t\t\tSomething went wrong.\t\tLet’s dive deep in the hopes these guys will help you in the postseason.   "}