{"id": "Anger, controversy follow Trump on visit to grieving Pittsburgh", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutAs Trump touched down in a city still reeling from the most deadly anti-Semitic attack in American history, he was greeted by hundreds of protesters.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    President Donald Trump has been greeted by some protests as he visits Pittsburgh to pay respects to the 11 people killed by a gunman Saturday during services at a local synagogue. (Oct. 30)\n    APPresident Trump walks with Melania, Ivanka and son-in-law Jared Kushner, alongside Tree of Life Synagogue rabbi Jeffrey Myers, near the memorial site to the 11 victims in Pittsburgh. (Photo: Mykal McEldowney, Indianapolis Star via USA TODAY Network)WASHINGTON – Tragedies like the massacre that took place in a Pittsburgh synagogue over the weekend usually move people to put politics aside. But as President Donald Trump touched down Tuesday in a city still reeling from the most deadly anti-Semitic attack in American history, he was greeted by hundreds of protesters singing softly in Hebrew or holding signs – underscoring how controversy tends to follow Trump even on the most solemn of occasions.Days after a gunman burst into Tree of Life Synagogue killing 11, Trump was once against thrust into the uneasy role of consoling a deeply divided nation even as he has relied on increasingly sharp rhetoric to define Democrats ahead of the midterm election.Joined by first lady Melania Trump, the president honored a Jewish custom by placing stones on memorials outside the synagogue. Inside, the first couple lit candles in honor of each of the slain worshipers, the White House said.  A difficult task for any president, the job of uniting a grieving nation has proven especially daunting at times for Trump, a combative former businessman who relishes  sharp-elbowed rhetoric often aimed at defining his opponents as \"evil.\"A link has been posted to your Facebook feed. \"As he himself has said, he’s effective at driving people into a rage,\" said Republican strategist Liz Mair. Trump's not good \"at sympathizing and commiserating and making people feel better, except in the purely cathartic vent-and-spleen sense.\"Less than two years into his first term, Trump has had to step into the role that some have described as consoler-in-chief many times, occasionally drawing criticism for a response that brought new controversy to the crisis. Critics pointed to his comments following last year's deadly racial violence in Charlottesville, Virginia, where he laid blame on \"both sides.\"Others blasted his handling of Hurricane Maria in Puerto Rico, from the decision to lob rolls of paper towels, basketball-style, at victims while touring the island last year to his more recent dismissal of higher storm-death estimates as a politically motivated attack.Over a thousand protesters march through the Squirrel Hill Neighborhood of Pittsburgh on Tuesday. (Photo: CARA OWSLEY/USA TODAY NETWORK)In this case, the events in Pittsburgh took place days from a pivotal midterm election that will decide control of Congress. The raised stakes have put Trump on the campaign trail more than at any time since before his own election, providing a stage where he often amps up his rhetoric to tweak opponents or draw distinctions with Democrats. The president has embraced the word \"nationalist\" in recent weeks to describe his foreign policy, a term critics read as a dog whistle to \"white nationalism\" but that Trump says he means as a counter to \"globalist.\" He has described Democrats as \"evil\" and as a \"mob,\" bent on open borders and increased crime.More: 'I am a nationalist': Trump's embrace of controversial label sparks uproarEven before he landed in Pittsburgh there were signs of tension. A group of Jewish leaders penned an open letter, signed by tens of thousands, indicating the president was not welcome in the city unless he firmly denounced white nationalists. Others, including Tree of Life Rabbi Jeffrey Myers, welcomed the president's visit. As his motorcade wound through the city, most bystanders barely took notice. Some gave him a thumbs down, or stuck up their middle finger.“We didn’t invite you here,” a man holding a baby shouted at the president.  Some cried “Leave Pittsburgh, leave Pennsylvania.” Others sang softly, or held signs that read \"Stop Hate.\"\n    President Donald Trump, first lady Melania, Ivanka and Jared Kushner were met with protestors on their visit to the Tree of Life synagogue in Pittsburgh, Pennsylvania.\n    USA TODAYA year ago, many praised Trump for his visit to Las Vegas after the Oct. 1, 2017, massacre at the Mandalay Bay resort in which dozens of concertgoers were killed. In understated remarks, Trump contemplated the sudden loss of a family member at the hands of a gunman.He also has been lauded for his speeches recognizing the anniversaries of the 9/11 terrorist attacks.Since taking office, a pattern has emerged in Trump’s handling of national tragedies and disasters. The president's moving and emphatic statements of grief and consolation are often followed with a tweet or offhand remark that undercuts his message. After several prominent Democrats began receiving bombs in the mail last week, Trump called for unity and denounced the politics of division at a rally in Wisconsin. Hours later he blamed the story for eroding Republican momentum in the midterm election and said unfair media coverage is the culprit of the nation's divisions.  \"He can fake sympathy for very short periods, but his true character always emerges,\" said John J. Pitney Jr., a government professor at Claremont McKenna College.Trump’s roughly three-hour visit to Pittsburgh was subdued, scripted and free of drama. The White House limited the number of reporters trailing the president to a small coterie, and several of his interactions took place out of view – keeping with a longstanding practice of shielding victims from the glare of cameras that accompany the president.Trump, followed by his daughter Ivanka Trump and son-in-law Jared Kushner, visited the UPMC Presbyterian hospital where several wounded are recovering. More: Pittsburgh gripped by sadness, shadowed by controversyMore: Ceremony to honor 9/11 victims puts Trump in rare role of consoler-in-chiefAides said Trump understands his role.\"Certainly, the president wants – in moments where our country is hurting, like we've seen in the last several days – to find ways to bring our country together, and we've seen him do exactly that,\" White House press secretary Sarah Sanders said.Trump, she said, has found \"those moments to bring our country together, and certainly focus on some of the things that all of us can support, and all of us can condemn, as well.\"Frank Luntz, a longtime Republican consultant, said he didn't see the president's visit to Pittsburgh having any measurable impact on the midterms. Despite some fluctuations, Trump's approval rating has hovered in the low- to mid-40s for most of the year.  \"You need it for the soul of the country,\" Luntz said of Trump's visit to Pittsburgh. \"You don’t need it for the votes of the country.\" \n    President Donald Trump and First Lady Melania Trump paid tribute to the 11 people killed at a Pittsburgh synagogue by placing rocks and flowers on a makeshift memorial (Oct. 30)\n    APContributing: William Cummings. "}