{"id": "Angels' two-way star Shohei Ohtani wins AL Rookie of the Year award", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe Angels' Japanese phenom hit 22 home runs and made 10 starts with a 3.31 ERA in his first season in America.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsShohei Ohtani hit 22 home runs as a rookie in 2018.(Photo: Richard Mackson, USA TODAY Sports)Despite injuries that limited his time on the mound, two-way star Shohei Ohtani was named American League Rookie of the Year on Monday, receiving 25 of 30 first-place votes.The 24-year-old Japanese import made his impact felt immediately for the Los Angeles Angels, hitting three homers in the first four games of the season. He finished the year with a .285 average, .925 OPS, 22 home runs and 61 RBI in 326 at-bats across 104 games. Ohtani also made 10 starts, posting a 3.31 ERA.Ohtani became the first player since Babe Ruth in 1919 to pitch 50 innings and hit 15 homers in a single season.Ohtani looked to be in for a big season as a pitcher as well. He carried a perfect game into the seventh inning of his second career start, and finished the game with 12 strikeouts in seven scoreless innings. He made nine starts through June 6 with a 3.10 ERA, but was placed on the disabled list with a UCL sprain and wouldn’t pitch again until Sept. 2.2018 AL Jackie Robinson Rookie of the Year: Shohei Ohtani.Full voting details: https://t.co/vPO4iSTyF9Ohtani lasted 2 ⅓ innings in his return and the next day, it was recommended that he undergo Tommy John surgery. He continued hitting, but had the procedure at the end of the season, which will prevent him from pitching until 2020.Ohtani is the third Angel to be named the league’s top rookie, following Tim Salmon in 1993 and Mike Trout in 2012.The Baseball Writers' Association of America voting occurred at the end of the regular season.Yankees third baseman Miguel Andujar finished runner-up for the award, receiving five first-place votes. The 23-year-old hit .297 with 27 home runs and 92 RBI, breaking Joe DiMaggio’s club rookie record with 47 doubles.Andujar's teammate Gleyber Torres placed third in voting, hitting 24 homers with 71 RBI in 431 at-bats. He made the All-Star team at age 21.Follow Yomtov on Twitter @JesseYomtovA link has been posted to your Facebook feed.  "}