{"id": "‘Stop starving people as instrument of war.' One Republican’s blunt message to Saudis — and Trump", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutSen. Todd Young is an ex-Marine and staunch conservative not known for bucking President Donald Trump or the GOP party line. Except Yemen’s civil war.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsYemeni people attend the funeral of victims of a Saudi-led airstrike, in Saada, Yemen, in August. Sen. Todd Young, an Indiana Republican and freshman senator, has emerged as the Trump administration’s biggest irritant when it comes to its Yemen policy – persistently challenging America’s military role in a campaign that has killed or injured at least 17,000 civilians, including hundreds of children, according to the United Nations.(Photo: AP)WASHINGTON – Sen. Todd Young is an ex-Marine and staunch conservative not known for bucking President Donald Trump or the Republican party line. Except on one very controversial issue: Yemen’s horrific civil war.Or more precisely, America’s support for a deadly bombing campaign in the Arab nation that has created the world’s worst humanitarian disaster.An Indiana Republican and freshman senator, Young has emerged as the Trump administration’s biggest irritant when it comes to its Yemen policy – persistently challenging America’s military role in a campaign that has killed or injured at least 17,000 civilians, including hundreds of children, according to the United Nations.  What drew Young’s attention was not just the death toll from errant military strikes. It was the famine that truly alarmed him – a man-made catastrophe that has put more than 8 million Yemenis on the brink of starvation.“It offends my sensibilities – and I know it offends the sensibilities of all Americans – that there are countries in this day and age that are using food as a weapon of war,” Young told USA TODAY.“And itfurther offends my sensibilities … that the United States has partnered with these countries,” he said.Saudi Arabia is America’s main partner in Yemen. The Saudi regime, along with the United Arab Emirates, launched a military campaign in Yemen in 2015 after Houthi rebels seized one of Yemen’s largest cities and moved to replace then-President Abed Rabbo Mansour Hadi. The Houthis are backed by Iran, Saudi Arabia’s arch enemy in the region.The U.S. has supplied intelligence and weaponry to the Saudi-led coalition – siding with a key Middle East ally in a proxy war that could determine Iran's influence in the region. Trump administration officials resisted calls to reevaluate its role in August, after an errant coalition bomb hit a school bus and killed dozens of children in an incident that sparked outrage among human-rights groups. Senate Foreign Relations Committee member Sen. Todd Young (R-IN) questions witnesses during a committee hearing about Libya in the Dirksen Senate Office Building on Capitol Hill April 25, 2017 in Washington, DC. (Photo: Chip Somodevilla, Getty Images)Humanitarian groups have long criticized Saudi Arabia’s conduct in the war, saying the regime has turned a blind eye to civilian casualties and other human suffering – including what Young labeled a “starvation blockade” the Saudis erected last year to stop the flow of humanitarian assistance.The war in Yemen has gained fresh attention following Turkish authorities’ allegations against Saudi Arabia for its role in the killing of Jamal Khashoggi, a journalist who was critical of the regime. If there’s any good out of Khashoggi’s death, Young said, it’s put a spotlight on “the impulsiveness of many decisions that have been made by the current Saudi leadership.”Whether it will be enough to spark a change in U.S. policy in Yemen remains to be seen. A congressional showdown may come after next week’s midterm elections, when some lawmakers plan to try to cut off all funding for the U.S.’s military role in Yemen.Young would not rule out such a dramatic step, and he could be a pivotal vote in the closely divided Senate. “I’m considering all options,” he told USA TODAY.\n    Yemenis in an isolated pocket in the north have been reduced to eating boiled leaves from a local vine to stave off starvation, with no aid reaching many families who need it most. (Sept. 14)\n    APYoung is no bleeding-heart peacenik, nor is he a libertarian-leaning isolationist. He’s a methodical, clean-cut defense hawk who trained as a rifle platoon commander in the Navy after graduating from the U.S. Naval Academy. He sought a seat on the Foreign Relations Committee after winning his Senate race in 2016; he previously served in the House on the armed services and tax-writing panels.Ask him why he’s so interested in Yemen, and you’ll get more power-point presentation than passionate soliloquy.“This is a national security issue,” Young notes, explaining that the militant Islamic group known as Al-Qaeda in the Arabian Peninsula is headquartered in Yemen. “And starving people – denying them basic humanitarian assistance – leads to radicalization. We don’t want to create more terrorists.”Senate Democrats and humanitarian aid groups say Young has proven to be a surprising and effective ally in their efforts to mitigate the humanitarian disaster unfolding in Yemen.“He’s in a unique position to convince this administration to do things that I can’t,” said Sen. Chris Murphy, a liberal Democrat from Connecticut who has crusaded against U.S. support for the Saudi-led war. “He has very wisely used his leverage as an influential member of the (Republican) conference to get the administration and the Gulf States to change their disposition.”More: US lawmakers demand answers after scores of children killed in Yemen airstrikeMore: Yemen facing 'largest famine in decades' if blockade isn't lifted, U.N. aid chief saysMore: Can the U.S.-Saudi relationship survive journalist Jamal Khashoggi’s presumed killing?Take, for example, the Saudi government’s refusal last summer to allow four U.S.- funded cranes to be delivered to a key Yemeni port, where they were supposed to be used to help offload desperately needed food and medicine.Young fumed over the Saudi blockade, publicly and privately lobbying the Saudis and the Trump administration over the issue. In July 2017, he convened a Senate hearing to help spotlight the Saudis’ role, first in bombing the existing cranes, along with a warehouse full of food, and then in blocking ships that carried four new cranes, which he noted had cost American taxpayers $3.8 million.“I will want to ensure that the Saudis get all the public credit – or shame – they deserve” for impeding the cranes, he said at the July hearing.Five months later, amid growing international outrage, the Saudis relented and agreed to let the cranes through. It was hardly a panacea, but it saved tens of thousands of lives, Young said.If Democrats and human rights group are cheering Young’s attention to Yemen, the Trump administration is probably not.Young blocked the confirmation of a key State Department nominee until he got answers from the administration about the Saudis’ compliance with international law. He hand-delivered a missive to Trump’s first secretary of state, Rex Tillerson, demanding a “comprehensive diplomatic effort” to address the humanitarian crisis Yemen and several other countries. When that didn’t produce the desired results, he teamed up with a key Democrat, Sen. Jeanne Shaheen, of New Hampshire, to pass legislation requiring the State Department to certify Saudi Arabia and the UAE were working to reduce civilian casualties and not impeding the delivery of food and medicine.A State Department spokesperson did not respond to questions about Young’s role, offering instead a general statement reiterating the administration’s efforts to bring about a political settlement to end to the war. “They won’t say it on the record, but you talk to folks in the administration, and they say the single biggest force moving the conflict in a positive direction has been congressional pressure,” said Scott Paul, a top advocate for Oxfam America. “And Sen. Young has been at the heart of that.”Paul said Young has been effective in part because he’s not splashy in his confrontations.“It’s private, it's quiet, it requires diligence and sustained attention,” he said of Young's legislative work on the issue.At the same time, Paul and others lament that Young and other lawmakers have not been able to force a real reckoning over the war in Yemen. That could change with the Khashoggi killing, which has encouraged Murphy and other Democrats to ratchet up their pressure.Murphy has vowed to try to block any U.S. arms sales to the Saudis, and lawmakers in the House are planning to force a vote that would end American military involvement in the Yemen conflict.For now, Young is focused on getting Secretary of State Mike Pompeo to answer key questions about how responsible the Saudis are for a recent spike in civilian casualties. He and Shaheen could use such data to block the administration from refueling Saudi jets as they carry out the bombing campaign.Young declined to say if he's butted heads with Pompeo or other White House officials and insists he's giving the president \"leverage,\" not pushing the administration to be more accountable. But, he added, he will use whatever tools he has to force a more humanitarian policy.“I feel emboldened to provide this administration additional leverage … and help bring the worst humanitarian crisis since the ‘40s to an end,” Young said.More: Turkey says Jamal Khashoggi 'ferociously murdered' by Saudi Arabian hit squadMore: Trump on Saudi handling of Khashoggi death: ‘Worst cover-up ever’More: Who was Jamal Khashoggi? Royal court confidant and prominent Saudi journalist turned reluctant dissidentMore: Who is Saudi Arabia’s crown prince? A reformer and ruthless ruler "}