{"id": "Priyanka Chopra celebrates bachelorette party with future sister-in-law Sophie Turner", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutPriyanka Chopra celebrated her pending nuptials to Nick Jonas. Her bachelorette squad was in tow, including future sister-in-law Sophie Turner.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    Singer Nick Jonas and actress Priyanka Chopra are reportedly engaged after two months of dating.\n    USA TODAYNick Jonas must be \"Jealous\" of his future wife's bachelorette party (because we surely are).   Priyanka Chopra, 36, embarked on a boat ride in Amsterdam over the weekend in celebration of her pending nuptials to Jonas, 25. Her bachelorette squad was in tow, including her soon-to-be sister-in-law, Sophie Turner.Priyanka Chopra and Nick Jonas attend the Ralph Lauren fashion show during New York Fashion Week at Bethesda Terrace on September 7, 2018 in New York City. (Photo: Rob Kim, Getty Images)\"Setting sail,\" the former \"Quantico\" actress captioned an Instagram picture of herself smiling on a boat Saturday. She wore a fluffy sweaterdress, snake-skin boots and a long cream coat. Turner, who is engaged to Joe Jonas, wore a white turtleneck, a blue coat and cat-eye sunglasses.Related: Nick Jonas and Priyanka Chopra confirm engagement, have ceremony in Mumbai A post shared by Priyanka Chopra (@priyankachopra) on Nov 4, 2018 at 3:41am PST\"#BacheloretteVibes,\" Chopra captioned another picture showcasing her gorgeous engagement ring. Chopra's future mother-in-law, Denise Jonas, playfully reminded the actress to be on her best behavior, commenting \"Be Good\" with a red heart emoji. Related: Priyanka Chopra, fiance Nick Jonas go on double date with the Jonas 'fam' at the US OpenA post shared by Priyanka Chopra (@priyankachopra) on Nov 3, 2018 at 5:44am PDTChopra switched to a color-blocked sweater and plaid skirt Sunday for drinks with the girls. The Indian actress donned a traditional bachelorette sash and tiara for the festivities.  Related: Is Priyanka Chopra showing off a sparkling engagement ring from Nick Jonas?A post shared by Priyanka Chopra (@priyankachopra) on Nov 4, 2018 at 9:36am PSTHer bachelorette weekend was a perfect opportunity for Chopra and the \"Game of Thrones\" actress to bond.Chopra posted an Instagram Story of her giving Turner a piggyback ride through the Amsterdam streets in high heels. She added the hashtag #TheJSisters, referencing their future last name. Related: Joe Jonas looks boo-tiful as fiancee Sophie Turner's 'GoT' character for HalloweenA link has been posted to your Facebook feed. Chopra and Jonas confirmed their engagement in August after much speculation following a whirlwind romance that reportedly began in May.The couple broke the news on Instagram with a sweet picture together. \"Future Mrs. Jonas. My heart. My love,\" he captioned the shot. Chopra shared the same photo on her Instagram with an equally love-filled caption: \"Taken.. With all my heart and soul..\"Related: Is Priyanka Chopra Nick Jonas' new girlfriend? Here's what we knowA link has been posted to your Facebook feed.    "}