{"id": "Air Force's live falcon mascot improving after it was injured in prank", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutAurora, the 22-year-old gyrfalcon that serves as one of Air Force's live mascots, “was able to fly around in her pen” after it was injured in prank.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    Check out the top 10 teams in the country according to the Amway Coaches Poll following Week 10 of the college football season.\n    USA TODAY SportsIn this photo taken in 2004, Aurora, a rare white gyrfalcon and Air Force Academy mascot, visits Pinon Valley Elementary School in Colorado Springs, Colo.(Photo: Jerilee Bennett, AP)AIR FORCE ACADEMY, Colo. — An Air Force falcon injured at West Point during a prank Saturday before the annual rivalry football game between the service academies is back home and showing signs of improvement.The 22-year-old bird named Aurora “was able to fly around in her pen” on Sunday, said Air Force Academy spokesperson Lt. Col. Tracy A. Bunko.The development is “an extremely good sign,” Bunko said, adding that the academy is “grateful for the outpouring of support and optimistic for Aurora’s recovery.”The falcon will continue to be evaluated and will get antibiotics to prevent infection, Bunko said.Army officials at West Point apologized Sunday for the injuries to the falcon and promised a full investigation.“We are taking this situation very seriously, and this occurrence does not reflect the Army or USMA core values of dignity and respect,” the academy said in a statement.Sam Dollar, Air Force’s falconry team adviser, told The New York Times on Sunday that two West Point cadets took the birds, threw sweaters over them and stuffed them into dog crates. Dollar said the cadets turned over the birds Saturday morning, with Aurora’s wings bloodied – likely from thrashing inside the crate.“I think they had them for a couple hours and then they realized it was a bad mistake,” Dollar told the newspaper. “When Aurora started thrashing around in the crate, they decided that wasn’t a good thing.”More: Air Force falcon mascot seriously injured in prank before football game at ArmyMisery Index Week 10: Ed Orgeron throws players under bus, takes big risk after LSU lossAurora is the Air Force Academy’s official and oldest mascot. On the school’s falconry page, the bird is described as a white phase gyrfalcon, which is a “falcon species that is extremely rare in the wild and whose beauty will take your breath away.”“Unless you are federally licensed, you can’t even touch them,” Dollas said, adding the Air Force cadets who work with the birds spend two months in training and are tested before they can handle them.Three percent of all falcons are gyrfalcons, and 1 percent of those are white, according to the website. The school acquired Aurora 22 years ago as a gift from the association of graduates.A link has been posted to your Facebook feed.   "}