{"id": "Apple updates iOS12 with new emojis, group FaceTime video calls", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutApple's software update was initially released in September, but just got new additions. To get them, go to general settings, software update. The new tools are free for iPhones, iPads and the iPod Touch.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    Apple says the are adding about 70 new emojis for iphone, ipad, mac and apple watch users. Buzz60's Natasha Abellard has the story.\n    Buzz60Beyond the new iPad, MacBook Air and Mac Mini refresh, Apple also gave the world new emoji, the ability to do multi-person FaceTime video calling, and some cool photo tools in an update of iOS12, Apple's mobile operating system. These features are available on most recent iPhones, The update, a hefty 512 megabytes, adds two features touted back in June when Apple first previewed iOS12. The most eagerly awaited is Group FaceTime, which lets up to 32 people have a group conversation at one time. \"The tile of the person speaking gets larger automatically, so you’ll never lose track of the conversation,\" Apple says. \"You can start Group FaceTime right from a group thread in Messages or join an active one at any time.\"Additionally, Apple added 70 new emoji characters that can be used on the iPhone and iPad, in iMessages. New characters have red hair, gray hair and curly hair, a new emoji for bald people, more smiley faces and additional emoji representing animals, sports and food. Update your Apple Watch and Mac computers, and you can use the emoji on those devices as well.New emojis for iOS12 (Photo: Apple)More: Apple launches new iPads, Macs at October eventMore: A souped up new iPad Pro could cost you nearly $2,800 -- more than a MacBook AirAdditionally, a software feature for photographers lets you choose the level of background blur in a photo before you take the photo, not afterward. Apple calls this \"Depth Control,\" and it's part of the Portrait Mode feature. Beyond traditional back-camera photos, it's also available for selfies. Finally, dual SIM is a way to have two different phone numbers on your iPhone, by adding what's called an eSIM card, a digital accessory that allows you to add the second phone number. This feature is only available to owners of the iPhone XS, XS Max or XR phones.To update to iOS12.1, on the iPhone and iPad, go to Settings, General, and click on Software Update. You need to be in Wi-Fi to download the update.  "}