{"id": "Southwest, Delta and more airlines are offering travel waivers amid California wildfires", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutHere is how each airline is accommodating passengers with plans to travel in California.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    A family drove through a road turned inferno as sparks flew and heavy smoke billowed in the air.\n    USA TODAYA Delta Air LInes 757-200 pulls into a gate at New York's JFK Airport in October 2018.(Photo: Jeremy Dwyer-Lindgren, special to USA TODAY)As dangerously destructive wildfires sweep across Southern and Northern California, several airlines are issuing weather advisories and travel waivers to those affected. Dozens of people have been killed and more than 6,500 homes have been destroyed. More than 8,000 firefighters are battling the wind and flames.Here is how each airline is accommodating passengers with plans to travel in California. Ticketholders traveling to, through or from Burbank, Los Angeles, Oakland, Sacramento or San Francisco can redeem a waiver to reschedule original flights planned for Nov. 10-13 if they can travel by Nov. 18.The waiver does not apply to tickets booked in different cabins, flights with a different destination or origin city, or if the ticket was purchased after Nov.10.  American Airlines is also raising money for those affected by the flames, offering AAdvantage members 10 miles for every dollar on Red Cross donations of $25 or more until Dec.10.You can help those affected by the California wildfires — now through Dec. 10, you'll earn 10 miles for every dollar on @RedCross donations of $25 or more. https://t.co/yIkOtb2sqCpic.twitter.com/Epv2wyxzYATravelers flying with Delta to, through or from Burbank, Los Angeles, Oakland, Sacramento or San Francisco Nov. 12-13 can rebook their flight to travel no later than Nov. 18 without any fee, as long as the ticket was purchased before Nov. 12. Passengers who cannot travel can cancel their reservations and use that value toward another ticket in the next year. We’ve issued a travel waiver for November 12th - 13th for cities impacted by the California wildfires. See more details here: https://t.co/7uJcWXSCm6Those traveling with Southwest to and from Burbank, Los Angeles, Oakland, Sacramento, San Francisco and San Jose can make changes to their reservation for flights between Nov. 9-16. Travelers can either rebook or travel standby \"within 14 days of their original date of travel between the original city-pairs,\" the airlines said. Travelers originally scheduled to fly with United Airlines to Burbank, Los Angeles or San Francisco on Nov. 10-13 will have change fees and any difference in fare waived if passengers rebook a flight departing on or before Nov.18.The new flight must be between the same cities as originally booked and be in the same fare class. We have extended a travel waiver in the Los Angeles area due to the California wildfires. Please check your flight status on our mobile app or https://t.co/7fA7qoLIsb before going to the airport: https://t.co/IF60HgPIKrpic.twitter.com/8IspfkS0o2Related: Miley Cyrus, Neil Young, Gerard Butler and more lose homes in California wildfiresA link has been posted to your Facebook feed. "}