{"id": "DOJ: 10 Chinese intelligence officers and hackers indicted for stealing aviation trade secrets", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe Justice Department announced indictments Tuesday against 10 Chinese intelligence officers and hackers charged with stealing aviation trade secretsA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsThe Department of Justice headquarters building in Washington is shown May 14, 2013 in Washington, D.C.(Photo: J. David Ake, AP)WASHINGTON – Ten Chinese intelligence officers and hackers have been charged with stealing airline engine technology from French and U.S. companies, the Justice Department announced Tuesday.The alleged scheme ran from January 2010 to May 2015 and targeted a turbofan engine developed through a partnership between an unnamed French manufacturer and U.S. companies. The alleged crime coincided with a Chinese state-owned company working to develop a comparable engine, the department said.Participants in the conspiracy allegedly hacked the French manufacturer, which had an office in Suzhou, China. The hackers also intruded on unnamed U.S. companies that manufactured parts for the engine based in Arizona, Massachusetts and Oregon. The goal was to steal intellectual data and confidential business information about the engine, the department said.“This action is yet another example of criminal efforts by (China’s Ministry of State Security) to facilitate the theft of private data for China’s commercial gain,” U.S. Attorney Adam Braverman said. “The concerted effort to steal, rather than simply purchase, commercially available products should offend every company that invests talent, energy, and shareholder money into the development of products.”The Chinese embassy in Washington didn't immediately respond to a request for comment Tuesday.The intelligence officers who were charged, Zha Rong and Chai Meng, worked for the Jiangsu Province Ministry of State Security, which is headquartered in Nanjing and is a provincial arm of the government’s Ministry of State Security. Rong was a division director who supervised theft of intellectual property and Meng was a section chief, according to the 21-page indictment.Defendants in the case included alleged hackers: Zhang Zhang-Gui, Liu Chunliang, Gao Hong Kun, Zhuang Xiaowei, and Ma Zhiqi. Also charged were insiders at the French company: Gu Gen and Tian Xi.Zhang Zhang-Gui was also charged with Li Xiao, another computer hacker, in a separate conspiracy that alleged they intruded on a San Diego-based technology company.The charges followed the Oct. 10 announcement that a Chinese intelligence officer was extradited to Ohio on charges of attempting to steal trade secrets related to aircraft engines. And on Sept. 25, an Illinois grand jury indicted a U.S. Army recruit Ji Chaoqun who was accused of working as an agent for Chinese intelligence.“The threat posed by Chinese government-sponsored hacking activity is real and relentless,” said John Brown, FBI special agent in charge of the San Diego office. “We are working together to vigorously investigate and hold hackers accountable regardless of their attempts to hide their illicit activities and identities.”More: Army reservist accused of spying for China arrested in ChicagoMore: Justice Department announces indictments of 7 Russians in hacking plot tied to Olympics doping scandalThe hackers used a range of techniques, including spear phishing, sowing multiple different strains of malware into company computer systems, using the victim companies’ own websites to compromise visitors’ computers and hijacking domains by compromising of domain registrars, according to the department.The first alleged hack began by Jan. 8, 2010, with the infiltration of Capstone Turbine, a Los Angeles-based gas turbine manufacturer, in order to steal data and use the company’s website to compromise others, the department said.China’s intelligence service also sought repeatedly to hack into a San Diego-based technology company from August 2012 through January 2014 in order to similarly steal commercial information and use its website to compromise others.From November 2013 through February 2014, Chinese nationals working at the direction of the intelligence agency, Tian Xi and Gu Gen, worked at the French company and allegedly infected its computers with malware, the department said.The hacking attempts continued until at least May of 2015, when an Oregon-based company, which built parts for the turbofan engine, identified and removed the conspiracy’s malware from its computer systems, the department said. “This is just the beginning,” John Demers, assistant attorney general for national security, said of the charges. “Together with our federal partners, we will redouble our efforts to safeguard America’s ingenuity and investment.”"}