{"id": "Reward offered after dolphin shot in 'brutal, senseless act of aggression'", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe corpse of a common dolphin was discovered Nov. 8 in the surf at Manhattan Beach, California, with a bullet hole in its body. The discovery has prompted an investigation and a $10,000 reward.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    Get a peek at what goes into caring for four young bottlenose dolphins at the Texas State Aquarium — it's more than just swimming with them, it takes a lot of time and dedication.\n    Natalia Contreras/Caller-TimesThe corpse of a common dolphin that was shot and killed was found Nov. 8, 2018, on a Los Angeles-area beach.(Photo: Photo courtesy of Marine Animal Rescue)The corpse of a common dolphin recently washed up on a Los Angeles area beach with a bullet hole in its body, prompting an investigation and a $10,000 reward, according to a rescue group.The animal was discovered Nov. 8 in the surf at Manhattan Beach, California, the president and founder of Marine Animal Rescue told USA TODAY on Saturday. Peter Wallerstein said his organization completes animal rescues for Los Angeles County and went public with information about the incident this week.When Wallerstein responded to a call, he found a dolphin with an unusual hole in its skin. By the next day, an examination had revealed the animal had been shot.The killing was “brutal, senseless act of aggression\" likely carried out by a boater Wallerstein said. Based on his knowledge of dolphin behavior, Wallerstein did not believe the dolphin could have been acting aggressively or the shooter could have been acting in self-defense.  ► Nov. 17: Dog found 'protecting the only house left on the block' after wildfire► Nov. 13: Animals affected by California wildfires► Nov. 13: Child 'heartbroken' after stuffed animal snake confiscated at airportThe dolphin likely was shot off the coast because that's where the protected species is most common. Wallerstein theorized the shooter was far enough off shore to be isolated: “They knew they weren’t being watched.”The National Marine Fishery Service is investigating the incident, he said.Wallerstein's organization is offering a $10,000 reward for information leading to a conviction, he said Saturday. Previously, the group had advertised a $5,000 reward.Since 1972, the federal Marine Mammal Protection Act has covered dolphins and other ocean-going mammals including sea lions, manatees and whales. Killing one can be punishable by prison time and hefty fines.Follow Joel Shannon on Twitter: @JoelShannon91 "}