{"id": "How Washington (the state) can fight climate change", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutInitiative 1631 would show that carbon taxes don't have to translate into economic ruins in the struggle against climate change: Our viewA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsAt the Seattle Aquarium on Oct. 25, 2018.(Photo: Ted S. Warren/AP)Washington, D.C., remains hopelessly gridlocked on the existential threat posed by human-induced climate change. But in Washington state, there's an opportunity to do something about it on Election Day.There, for the first time in the United States, voters will choose whether to tax carbon emissions that trap heat in the atmosphere.While one state's success in reducing its carbon footprint will not save the planet, passage of Initiative 1631 on Tuesday would show that people who are rightly concerned about global warming are willing to act — and demonstrate that carbon taxes don't translate into economic ruination.About 20 percent of global emissions are already impacted by carbon pricing. Initiative 1631 would be the first greenhouse gas tax levied by ballot initiative. It employs real-world compromise, exempting the state's huge aerospace industry and Washington's largest polluter, a coal-fired plant in Centralia that is already slated to phase out coal by 2025.OPPOSING VIEW: Washingtonians, reject Initiative 1631Even with these exceptions, the ballot measure would target 80 percent of the state's greenhouse gas pollution. The fee ($15 per ton of carbon dioxide, starting in 2020) would rise for inflation and, for large emitters, by $2 per year through 2035.Seventy percent of the money raised would be invested in clean energy projects; 25 percent would go to protect water and forests. And the measure would provide tens of millions of dollars for communities and workers hurt by the tax. Unsurprisingly, opposition to 1631 is strongest from the oil and gas industry, which has ponied up most of $26 million that has been raised to fight the initiative. It remains unclear how much of the fee for major emitters will be passed along to consumers. Estimates are that costs will increase about 13 cents a gallon at the gas pump and 18 cents a gallon for home heating oil.That's not chump change, but the whole point of a carbon tax — and the reason why a recent landmark, United Nations climate report highlighted the centrality of the concept — is to prevent industries that burn coal, oil and natural gas from continuing to use the earth's atmosphere as a free waste dump.Taxing carbon pollution is a simple, market-based means of curbing the practice and making renewable energy sources more competitive.Other state ballots are populated with environmental ideas that simply mandate change, such as Arizona's Proposition 127 and Nevada's Question 6, which would require utilities to produce at least half of their electricity from renewable sources.Those are blunt-edged approaches. Far better is a market-based alternative such as a carbon tax that levels the playing field so green-energy sources can gain traction. It's why Republican elder statesmen such as James Baker, Henry Paulson and George Shultz last year endorsed a national carbon tax, the proceeds of which would be rebated to consumers.Washington's ballot measure could offer a worthwhile template for other states and — who knows? — maybe one day for lawmakers in Washington, D.C. To those who argue that we can't afford to do anything about climate disruption, the only answer is that we can't afford not to.USA TODAY's editorial opinions are decided by its Editorial Board, separate from the news staff. Most editorials are coupled with an opposing view — a unique USA TODAY feature.To read more editorials, go to the Opinion front page or sign up for the daily Opinion email newsletter. To respond to this editorial, submit a comment to letters@usatoday.com.If you can't see this reader poll, please refresh your page. "}