{"id": "Ex-NBA player Darius Miles opens up about mental health woes: 'I was gonna hurt somebody'", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutEx-NBA player Darius Miles opened up about his battle with depression, post-traumatic stress and paranoia in a \"The Players' Tribune\" essay.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsLos Angeles Clippers' Darius Miles (21) dunks over Denver Nuggets' Donnell Harvey, left, during the second half in Los Angeles, Sunday, April 7, 2002.(Photo: E.J. FLYNN, Associated Press)Former NBA player Darius Miles opened up about about his battle with severe depression, post traumatic stress and paranoia in a candid essay he penned for The Players' Tribune that was published on Wednesday. Miles, the No. 3 pick in the 2000 NBA draft out of high school (before the one-and-done era), gained instant fame during his first two seasons in the league with the Los Angeles Clippers.The now 37-year-old started his essay by writing about the life shock he experienced as an 18-year-old overnight celebrity who was suddenly making millions of dollars after growing up in a violent East St. Louis neighborhood. Miles talked about being held up at gunpoint as a teenager and then not long after signing with Jordan brand, riding in private jets and making cameos in Hollywood movies. MORE:Miles tells wild story of the time Shaq pulled him over on the freewayLakers coach fined $15K for criticizing officiatingEmbiid: 'I own real estate' in Drummond's headForced to retire in his late 20s with a career-ending knee injury, Miles said basketball had helped him escape and medicate from the trauma he endured in the streets growing up. He said that after his mother, Ethel, passed away from a rigorous battle with cancer in 2013, he grew deeply depressed and \"pretty much went insane.\"\"When she died, I ain’t gonna lie, it broke me,\" he wrote. \"I didn’t leave her house for an entire year. I never made it past the front yard, for real. I just didn’t have the will to do anything.\"I was stuck in my momma’s house in East St. Louis for like three years. I worked my whole life to get out of there, and I was back. Just … trapped. Carrying my gun with me everywhere. Couldn’t sleep. Couldn’t escape my own head. Couldn’t find any peace. ...I was paranoid. I had my concealed carry permit, so I had a gun on me at all times.\"Miles added that because he had lost so much of the money he earned throughout his NBA career on business deals gone bad or shoeing out money to different people in his circle — he filed for bankruptcy in 2016 — he found himself in a dark place where he contemplated turning to violence to exact revenge.\"The worst part was that I had people who owed me a lot of money, and I just got to a point where I was seeing red, for real,\" he wrote. \"I felt like I was gonna hurt somebody, or I was gonna wind up in jail.\" Miles said the help of his former teammate, Quentin Richardson, propelled him to get out of a deep depression and back on his feet. The two former players, who made a head-knocking gesture popular in their two seasons together during a youth-laden Clippers era, are now neighbors. Richardson helped edit Miles' essay for The Players' Tribune, which ultimately aimed to destigmatize mental illness. \"I know dudes like me aren’t supposed to talk about depression, but I’ll talk about it,\" Miles wrote. \"If a real mother (expletive) like me can struggle with it, then anybody can struggle with it.\" Follow USA TODAY Sports' Scott Gleeson on Twitter @ScottMGleeson.A link has been posted to your Facebook feed.  "}