{"id": "ACC coaches have more questions than worries about G League", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutAtlantic Coast Conference coaches say they have more questions than worries about the NBA G League option for elite prospectsA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsFlorida State head coach Leonard Hamilton speaks to the media during a news conference at the Atlantic Coast Conference NCAA college basketball media day in Charlotte, N.C., Wednesday, Oct. 24, 2018. (AP Photo/Chuck Burton)(Photo: The Associated Press)CHARLOTTE, N.C. (AP) — Atlantic Coast Conference coaches say they have more questions than worries about the NBA G League option for elite prospects.The G League will offer \"select contracts\" worth $125,000 next year to elite prospects who are not yet eligible for the NBA, a move that could slightly lessen the handful of one-and-done players at the college level.Questions the ACC coaches had at ACC's preseason media day on Wednesday were about how the process will work, how many players it might affect and whether it will really make much of a change to college basketball after a year of changes in the wake of a federal investigation into corruption within the sport.North Carolina's Roy Williams is taking a wait-and-see approach. Duke's Mike Krzyzewski said there will always be one-and-done college players regardless of NBA restrictions or G League contracts. Leonard Hamilton of Florida State said skipping college altogether to place an emphasis on turning pro is \"almost like fool's gold.\"Not surprisingly, the coaches in general believe playing at the top level of college basketball is still the best option for the elite recruits.\"If they think they're going to get the top player in the country to go play there, why would you do that?\" Syracuse coach Jim Boeheim said. \"You can go to college and you're going to be better than everybody else there. You're not better than everybody else in the G League, I can tell you that. I don't care who you are.\"The G League plan lacked details such as how players will be identified as potential targets. There would be no cap on the number of players who could sign a deal, though it would likely be limited to at most only a handful of players each year.\"I think there will be some that it appeals to, but I also think that a lot of the prospects ... grow up thinking about playing college basketball, playing in the NCAA Tournament, things like that,\" North Carolina senior guard Kenny Williams said. \"So I think the money's enticing, but I think that a lot of the kids will still grow up with that dream and want to fulfill that dream.\"The G League's plan comes after the Commission on College Basketball, chaired by former U.S. Secretary of State Condoleezza Rice, issued numerous recommended reforms for the sport in the spring after the corruption case that led to charges against 10 men for providing money and benefits to steer recruits to schools, agents or an apparel company. Three people were convicted in the case on Wednesday.The commission's proposals included for the NBA to do away with its 19-year-old age limit that has fueled the rise of one-and-done players who play in college for a season. The restriction is expected to change through an amendment to the collective bargaining agreement between the NBA and its players in time for the 2022 draft.The G League contract provides a more immediate option and though it is for $125,000, a player could get additional income from endorsement deals.Syracuse recruit Darius Bazley, who passed on playing for the Orange this season to work toward next year's NBA draft, had landed a job as an intern for apparel company New Balance, the New York Times reported this week. Agent Rich Paul said the deal is part of a multiyear shoe contract that could pay Bazley at least $1 million and up to $14 million in performance incentives.Georgia Tech coach Josh Pastner questions whether most players who might take the G League route would be able to land similar deals.\"For the guy who's maybe ranked in the top 10 or 5 in the recruiting classes, they can maybe do it,\" Pastner said. \"Maybe they do get a shoe deal or something like that. But if you don't have a lot of hype, I don't know who's going to take you or even get you under contract.\"But Joe Favorito, a sports and entertainment marketing consultant, believes the opportunities could be there. He pointed to the Ball family building its own Big Baller Brand apparel company despite the fact that LiAngelo and LaMelo Ball never had the recognition that comes with playing major college basketball.\"This is for a very limited number of people because you have to be able to sing and dance,\" said Favorito, a faculty member at Columbia. \"So you're going to have to be able to play at a very elite level, forgo college and have the maturity for the one year. And also have enough savvy or at least the right person around you to help engage and manage all the opportunities that come along that are nontraditional. . So yeah, I think there are opportunities.\"The G League plan offers at least another avenue for NBA prospects if they don't want to play in college or have trouble qualifying academically. It also frees them to receive a salary and endorsement deals unavailable in college due to NCAA rules.\"I don't know if it helps,\" ACC Commissioner John Swofford said in an interview with The Associated Press. \"It doesn't hurt in my mind.\"___More AP college basketball: http://www.twitter.com/AP_Top25___Follow Aaron Beard on Twitter at http://www.twitter.com/aaronbeardapCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}