{"id": "Actor Douglas Rain, the voice of HAL in '2001: A Space Odyssey,' dies at 90", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutDouglas Rain played some of Shakespeare's most intriguing characters but is perhaps best known for supplying the creepily calm voice of computer HAL.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsIn this June 7, 1979 photo provided by Stratford Festival, Actor Douglas Rain appears as King Henry IV in this scene from The Second Part of Henry IV at Stratford's Festival Theatre in Stratford, Ontario. Rain, who played some of Shakespeare's most intriguing characters onstage but perhaps is best known for supplying the creepily calm voice of the rogue computer HAL in Stanley Kubrick's \"2001: A Space Odyssey\" has died. Douglas Rain was 90. (Robert C Ragsdale/Stratford Festival via AP) ORG XMIT: CPT111(Photo: Robert C Ragsdale, AP)NEW YORK – Canadian actor Douglas Rain, who played some of Shakespeare's most intriguing characters onstage but is perhaps best known for supplying the creepily calm voice of the computer HAL in Stanley Kubrick's \"2001: A Space Odyssey\" has died at 90.The Stratford Festival said Rain died Sunday of natural causes at St. Marys Memorial Hospital, just outside of Stratford, Ontario. He was one of the festival's founding company members and spent 32 seasons performing there, until 1998.His roles at Stratford included playing Claudio in \"Measure for Measure\" in 1954, Malvolio in \"Twelfth Night\" in 1957, Edgar in \"King Lear\" in 1964 and Prince Hal in \"Henry IV, Part 1\" in 1958, a play and a role he would return to in 1965. He would eventually take on the title role in 1966.But it was the aloof voice of the artificially intelligent HAL 9000 – the forerunner of today's Amazon's Alexa or Google Home – where Rain entered the public's consciousness. Kubrick had heard Rain's voice in the 1960 documentary \"Universe,\" a film he watched multiple times, according to the actor. Rain was initially hired to narrate 1968's \"2001: A Space Odyssey,\" but the director chose to go a different direction.HAL is the onboard master computer on the spaceship Discovery 1 but goes rogue. When astronaut Dave Bowman asks HAL to open the ships' pod doors, HAL famously balks. \"I'm sorry, Dave. I'm afraid I can't do that,\" the machine blandly refuses. \"This mission is too important for me to allow you to jeopardize it.\"Actor Keir Dullea peers through his space helmet in Stanley Kubrick's 1968 film, \"2001: A Space Odyssey.\" (Photo: Associated Press)More: '2001: A Space Odyssey': Book celebrates 50th anniversary of sci-fi movie masterpieceMore: In 1968, '2001' tried to predict the future. Here's what it got right.When the astronauts try to disconnect HAL, he fights back. During his shutdown, HAL sings the nursey rhyme \"Daisy Bell\" and memorably utters: \"I'm afraid, Dave. Dave, my mind is going. I can feel it.\" The American Film Institute named HAL the 13th greatest movie villain of all time, joining a list that includes Hannibal Lecter and Darth Vader.Stratford Festival Artistic Director Antoni Cimolino called Rain one of Canada's greatest acting talents and a \"guiding light in its development.\" He said the actor's humanity shone through in HAL.\"Douglas shared many of the same qualities as Kubrick's iconic creation: precision, strength of steel, enigma and infinite intelligence, as well as a wicked sense of humor,\" Cimolino said. \"But those of us lucky enough to have worked with Douglas soon solved his riddle and discovered that at the center of his mystery lay warmth and humanity, evidenced in his care for the young members of our profession.\"Rain attended the University of Manitoba and studied in London at the Bristol Old Vic Theatre School. He started out performing radio plays. From 1974 to 1977, Rain was head of the English acting section of the National Theatre School of Canada.Rain performed at theaters and festivals all over Canada, including the Shaw Festival, where he played such roles as Caesar in \"Caesar and Cleopatra\" in 1983. He shared stages with such luminaries as Peter Ustinov, Maggie Smith and Colm Feore. He was nominated for a Tony Award in 1972 for his role as William Cecil in \"Vivat! Vivat! Regina!\" His other Broadway credits include \"The Golden Age\" in 1963 and \"The Broken Jug\" in 1958.Rain is survived by his two sons, David and Adam, daughter Emma, granddaughter, Salima, and a daughter-in-law, Asira.A link has been posted to your Facebook feed.  "}