{"id": "MLS Decision Day craziness will set playoff picture", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe annual Major League Soccer ritual of scheduling all the league's final regular-season games at the same time is probably going to be hardest on Real Salt LakeA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsAtlanta United fans fill Mercedes-Benz Stadium before an MLS soccer a match against the Chicago Fire, Sunday, Oct. 21, 2018, in Atlanta. (Curtis Compton/Atlanta Journal-Constitution via AP)(Photo: The Associated Press)Decision Day — the annual Major League Soccer ritual of scheduling the league's final regular-season games on the same day and at the same time — is probably going to be hardest on Real Salt Lake.And they're not even playing.RSL's season ended last week with a 3-0 loss to the Timbers in Portland. That means the team's playoff fate is totally out of its hands.Instead, RSL players will be watching the Dynamo's match against the LA Galaxy and hoping that Houston comes out with a win or a tie on the road.\"It's not a good place to be,\" RSL's Kyle Beckerman said. \"We're going to be the biggest Houston Dynamo fans there's ever been and we'll be rooting them on and hopefully they can help us out.\"RSL is the only Major League Soccer team that has to sit at home and watch decision day. For those that are playing, there are still two playoff spots up for grabs, one in the Eastern Conference and one in the West. And most importantly, seeding for the MLS Cup Playoffs will be determined.Some of the things to watch Sunday:SUPPORTERS SHIELD: The award for the regular-season points total is going to come down to the final weekend for Atlanta United and the New York Red Bulls.Currently, United has a 1-point edge on the Red Bulls with 69 points. Atlanta visits Toronto FC on Sunday, while the Red Bulls host Orlando City.Toronto, which won both the Supporters Shield and the MLS Cup final last season, has already been eliminated. Orlando is out, too.The Red Bulls will need to win and get help from Toronto with a win or a draw to secure the Shield. Atlanta just needs to win.Both the Red Bulls and United broke the regular-season (post-shootout era) record for wins last weekend with 21 each.WEST'S FINAL SPOT: If the Galaxy beat the Dynamo, they'll snatch that last playoff spot in the Western Conference from Real Salt Lake.And that would mean Zlatan Ibrahimovic will play in the MLS postseason for the first time — which could make for some drama.If the Galaxy don't make the playoffs, it wouldn't be for lack of trying down the stretch. They've got three wins and a draw for their last four matches.\"I think our playoffs started five games ago because we needed to win to make it still possible to make the playoffs. If we lost any of them we were out. To play under pressure like that is not easy. The guys should have all the credit for that because we are playing under high pressure and we are handling it well,\" Ibrahimovic said.EAST'S FINAL SPOT: With a pair of consecutive losses, the Columbus Crew are hanging on to the sixth and final spot in the East, but only barely. Montreal is just two points back.The Crew host Minnesota United on Sunday, while the Impact — riding a two-game winning streak — visit the Revolution.The Impact will need a win, while also hoping for a Crew loss or draw.\"Earlier this week the scenarios weren't in our favor,\" Impact midfielder Samuel Piette told the Canadian Press. \"Our chances weren't great. Now the probability is even higher. The message is the same, we need to win our last game. But there's more hope now. We have to approach this last game as the biggest of our lives. It's do or die right now.\"THE VIEW FROM ABOVE: Just like the East's crown is a close race between Atlanta and the Red Bulls, the West's top spot is undetermined, too. It will come down to a final game coincidentally between the front runners, Sporting Kansas City and LAFC in Kansas City.Sporting sits atop the West with 59 points, while LAFC is two points back. If LAFC can pull out a win, it will become the first expansion team to finish atop its conference in its inaugural season.\"I think that we're a good team but we're looking for a little more consistency when it really counts to become a great team, and we get a chance to finish strong next week and when it's all said and done, see what that means for playoffs,\" LAFC coach Bob Bradley said.___This story has been corrected to show the location of Sunday's game between LAFC and Sporting Kansas City is in Kansas City, not Los Angeles.___More AP soccer: https://apnews.com/tag/apf-Soccer and https://twitter.com/AP_SportsCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}