{"id": "College Football Playoff rankings: Alabama, Clemson, LSU and Notre Dame are in the top four", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe first College Football Playoff rankings from the committee were released Tuesday. The top four teams  are Alabama, Notre Dame Clemson and LSU.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    SportsPulse: Dan Wolken and Paul Myerberg discuss the College Football Playoff first ranking and what the committee got right and what they blanked on.\n    USA TODAYAlabama running back Brian Robinson Jr. carries in a game at Neyland Stadium. Alabama defeated the Vols 58-21. Mandatory Credit: Bryan Lynn-USA TODAY Sports(Photo: Bryan Lynn, USA TODAY Sports)The College Football Playoff committee had one surprise when its initial ranking was released Tuesday evening.As the last remaining unbeatens among the Power Five, Alabama, Clemson and Notre Dame appeared set to be in the top three spots.The Crimson Tide and Tigers were in the first two places as expected. However, it was LSU ahead of the Fighting Irish in the third spot even though the Tigers have one loss. LSU does have some impressive wins that boosted its stock, including a defeat of Miami on a neutral field, a win at Auburn and an upset of Georgia at home. Notre Dame did beat No. 5 Michigan at home in its opener. But the rest of its resume is not as strong.While the news might be upsetting to Fighting Irish supporters, there is certain to be change by next week. Alabama and LSU will meet Saturday in Baton Rouge. The loser likely will fall out of the top four.Michigan, Georgia and Oklahoma were just off the pace in fifth through seventh, respectively, and could move up.Rounding out the top 10 are Washington State, Kentucky and Ohio State.PLAYOFF RANKINGS: What the selection committee got right and wrongANALYSIS: First rankings shows shifting subjectivity of playoff processSCENARIOS: College Football Playoff possibilities from likely to total chaosCentral Florida the lone unbeaten not in the Power Five was No. 12. Though the Knights have won their last 20 games, their prognosis for making the field seems dim. Committee chairman Rob Mullens noted UCF is the lone team not have been a team with a winning record through the first nine weeks.The top four teams in final rankings on Dec. 2 will play in the semifinals. Those two games will be at in the Orange Bowl and Cotton Bowl on Dec. 29.The championship game will be played on Jan. 7 in Santa Clara, Calif,, at Levi's Stadium.College Football Playoff committee Top 251. Alabama (8-0)\n2. Clemson (8-0)\n3. Louisiana State (7-1)\n4. Notre Dame (8-0)\n5. Michigan  (7-1)\n6. Georgia  (7-1)\n7. Oklahoma  (7-1)\n8. Washington State (7-1)\n9. Kentucky (7-1)\n10. Ohio State  (7-1) \n11. Florida (6-2)\n12. Central Florida (7-0)\n13. West Virginia (6-1) \n14. Penn State (6-2)\n15. Utah (6-2)\n16. Iowa (6-2\n17. Texas (6-2) \n18. Mississippi State (5-3)\n19. Syracuse (6-2)\n20. Texas A&M (5-3)\n21. North Carolina State (5-2)\n22. Boston College (6-2)\n23. Fresno State (7-1)\n24. Iowa State (4-3)\n25. Virginia (6-2)A link has been posted to your Facebook feed.  "}