{"id": "Cutcliffe has Duke bowl eligible again", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutDavid Cutcliffe has turned Duke into postseason regularA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsDuke tight end Daniel Helm, second from left celebrates with wide receiver Scott Bracey (11) after scoring a touchdown during the second half of an NCAA college football game against Miami, Saturday, Nov. 3, 2018, in Miami Gardens, Fla. Duke won 20-12. (AP Photo/Lynne Sladky)(Photo: The Associated Press)David Cutcliffe has turned Duke into postseason regular.The Blue Devils are bowl eligible for the sixth time in seven seasons after beating Miami on Saturday. This is Duke's 11th season under Cutcliffe. Before he arrived, Duke's last bowl appearance was during the 1994 season.Duke is one of 48 teams that have secured bowl eligibility this season. Also joining that group this past week were Ohio and Northern Illinois, a pair of Mid-American Conference programs that are also used to making the postseason. Ohio is bowl eligible for a 10th straight season under coach Frank Solich. Northern Illinois is bowl eligible for the 10th time in 11 seasons.The following teams are bowl eligible:AlabamaAlabama-BirminghamAppalachian StateArmyAuburnBoise StateBoston CollegeBuffaloCentral FloridaCincinnatiClemsonDukeFloridaFlorida InternationalFresno StateGeorgiaGeorgia SouthernHoustonIowaKentuckyLouisiana TechLSUMichiganMichigan StateMiddle TennesseeMississippi StateN.C. StateNorth TexasNorthern IllinoisNotre DameOhioOhio StateOklahomaOregonPenn StateSan Diego StateSouth FloridaSyracuseTexasTroyUtahUtah StateVirginiaWashingtonWashington StateWest VirginiaWestern MichiganWisconsin___More AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25___Follow Noah Trister at www.Twitter.com/noahtristerCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}