{"id": "Finding the heir to Marshawn Lynch in the 2019 NFL DraftFinding the heir to Marshawn Lynch in the 2019 NFL DraftFinding the heir to Marshawn Lynch in the 2019 NFL DraftDamien Harris — RB — AlabamaBenny Snell — RB — KentuckyMyles Gaskin — RB — Washington David Montgomery — RB — Iowa StateTravis Homer — RB — Miami ", "paragraph": "Sign up for the Raiders Wire daily email newsletter for the top stories every day.\n\t\t\t\tPlease re-enter your email address.\t\t\t\n\t\t\tYou'll now receive the top Raiders Wire stories each day directly in your inbox.\t\t\n\n\tBy Tommy Call III\n5 hours ago\n\n\t\tBy: Tommy Call III\t\t| 5 hours ago\t\t\n\nMarshawn Lynch’s return to the NFL as an Oakland Raider in 2017 was lauded like something out of a comic book. Now as mysteriously as Lynch joined the Raiders, there are many questions about his future with the team. With signs pointing towards the legendary back’s return to retirement, the Raiders are tasked with finding his replacement. With so many picks in 2018, it won’t be a surprise if the Raiders tap someone from the 2019 running back draft class as the heir to beast mode. Although the running back class is underwhelming at the top, there is some potential in the mid to late rounds. The Raiders are slated to have six picks late giving them the opportunity to take a chance on a running back that slides.Let’s take a look at some potential players that could replace Lynch in Oakland:Harris may not have the gaudy numbers you’d expect from a player coming out of the football machine known as Alabama, but that shouldn’t affect his draft stock. Harris is a do it all back— he can run up the middle, on the outside, and in the red zone. One of Harris’s more underrated skills is his pass catching ability.  He hasn’t been asked to catch the ball a ton at Alabama but does show some potential out of the backfield. Harris doesn’t have eye-popping burst or speed, but He has a knack for just finding the open space to get easy yardage using his vision. Harris will get some consideration as the top back in the 2019 class, along with Iowa State’s David Montgomery.Round Grade: 2-3Another SEC back who has jumped up draft boards with an impressive 2018 season. Kentucky is fighting its way into football relevancy on the back of Benny Snell. Snell is one of college football’s true bell cow types. He’s been the center of Kentucky’s offense since landing in Lexington as a freshman. Snell ran for over 1,000 yards and ten touchdowns in each season as a Wildcat. What makes Snell different in this 2019 class is his size at 5’10, 223 LBS which is big for this class. Snell fits in the NFL as a good combo, red zone back that fits in next to a slashing style back. Snell is one back in this class that could match Lynch’s physicality as a runner.Round Grade: 4-6Another workhorse back in the 2019 class is Washington’s, Myles Gaskin. Gaskin and Snell have had similar production at the college level, but are completely different as prospects. Gaskin is small, at 5’9, 190 lbs, but doesn’t have the tools you’d expect out of a smaller back. Gaskin isn’t overwhelmingly fast but makes it up in a bevy of ways. He’s a very unique back that uses patience to exploit holes in the defense. It’ll be interesting to see how different scouts evaluate Gaskin as he could be a great fit in the right offense, and a let down in others. Throughout the draft process, Gaskin will need to show he’s a better pass catcher than what he’s been at Washington over his career.Round Grade: 5-7Heading into the 2018 season Montgomery gave the 2019 draft class hope, but his season so far has been somewhat underwhelming. Montgomery has dealt with injuries and had a few good games, but hasn’t had the type of production you’d like to see in one of the most innovative offenses in the country. The Cyclones head coach Matt Campbell is being touted as one of the countries best play callers but hasn’t got the best out of Montgomery. Montgomery’s letdown 2018 shouldn’t have a massive effect on his draft stock as this is such a slim group at running back. As for Montgomery’s skill set, he has a bit of everything you want in a pro-style back. Balance, size, and versatility are all there, where he lacks in speed, he makes up for in yards after contact. Montgomery has a little beast mode to his game, as he’s been a menace to bring down for Big 12 defenses, something that should translate to the pro level. Round Grade: 2-4Travis Homer could be the steal of the running back class out of Miami. Even in a down year, Miami continues to the churn out NFL talent like Homer. Homer isn’t at the top of many draft boards but has a lot of skills you want in a modern day pro back. He has size at 5’11 195 to pair with his shifty running style. Although Homer doesn’t have a ton of catches this season, he projects to be an impressive receiving back. Homer’s lack of receptions might be a product of Miami’s offense. Homer also has had to run behind a Miami offensive line that hasn’t done him any favors. When Homer does get the ball in his hands he’s dangerous as an open field runner. Where guys like Snell, Gaskin and Montgomery lack in burst and athleticism Homer takes the cake in this category. If the Raiders decide to take a shot on Homer late it could quickly pay off.   Round Grade: 5-7Sign up for the Raiders Wire email newsletter to get our top stories in your inbox every morning\n\t\t\t\tPlease re-enter your email address.\t\t\t\n\t\t\tYou'll now receive the top Raiders Wire stories each day directly in your inbox.\t\tNFL, Oakland Raiders, Latest NFL News, Latest Raiders News, Raiders buzz\n\n\t\t\t\tRaiders 2019 NFL Draft Primer: Position groups, names to watch\t\t\t\n\n\n\t\t\t\tREPORT: Raiders RB Marshawn Lynch out for at least a month with groin injury\t\t\t\n\n\n\t\t\t\t2-round mock draft brings Oakland a star edge rusher, receiver\t\t\t\n\n\t\t\t\t\tThanks for signing up.\n\t\t\t\t\tPlease check your email for a confirmation.\t\t\t\t\n\t\t\t\t\tSomething went wrong.\n\t\t\t\tSign up for our newsletter and get every update delivered to your inbox!\n\t\t\t\tPlease re-enter your email address.\t\t\t\n\t\t\tYou'll now receive the top Raiders Wire stories each day directly in your inbox.\t\tDerek Carr still a good sport despite rocky 2018 season for RaidersNovember 14, 2018Raiders promote WR Saeed Blacknall to active rosterNovember 14, 2018WATCH: Raiders DT Maurice Hurst's best plays of 2018November 15, 2018How are opposing offenses attacking the Raiders' defense?November 15, 2018Raiders SS Karl Joseph played his best game of career vs. ChargersNovember 15, 2018Which Raider player deserves to make the Pro Bowl in 2018?November 15, 2018Raiders Thursday Injury Report: WR Nelson and Bryant miss practice againNovember 15, 20183 Raiders To Watch In Week 11 vs CardinalsNovember 16, 2018Raiders cancel practice due to air quality in OaklandNovember 16, 2018Raiders CB Gareon Conley flawless on 3rd down in 2018November 16, 2018\n\n\n\n\n\t\t\tThis site is neither endorsed, nor sponsored by, nor affiliated with Oakland Raiders or NFL Properties LLC. RAIDERS is a registered trademark of the Oakland Raiders LLC.\t\t\n\t\t\tPowered by WordPress.com VIP \n\n\t\t\tMore Information\t\t\n\n\n\t\t\tPlease enter an email address.\t\tThanks for signing up.Please check your email for a confirmation.\n\t\t\tSomething went wrong.\t\t"}