{"id": "Superhero Stan Lee fought for justice and diversity with relatable comic book characters", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutStan Lee created relatable, decent people to change the world for the better — fighting racism and bias. He stirred the imagination of generations.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    Marvel's Stan Lee dreamed up some of the most iconic superheroes of our time, so it may be surprising that he wasn't that into them.\n    WochitStan Lee in July, 2012.(Photo: Jefferson Graham/USA TODAY Network)I met Peter Parker in February 1963. It was a heady time for a 10-year-old boy. The Mercury Seven astronauts had made anything seem possible and now here was a red-and-black costumed human arachnid staring at me from the cover of “Amazing Spider-Man” #1 at my local drugstore comic book rack.“The Fantastic Four think I’m trapped! But they don’t suspect my real power,” the Spider-Man proclaimed, surrounded by four other colorful characters that were not as polished or familiar as Batman and Superman, my usual comic book fare.I was hooked. And I wasn’t alone. Marvel Comics, the publisher of Amazing Spider-Man, Fantastic Four and a new wave of strikingly different comic books, became the comics company of choice for an entire generation.Most of the credit for that goes to Stan Lee, for decades Marvel’s top writer and editor, who died this morning at age 95.Stan Lee’s approach was revolutionary. His super-heroes were real people with real problems who happened to be employed saving the universe. Peter Parker was an angst-filled teen-age science student when he was a bitten by a radioactive spider. After that, he could climb walls, but bullying and girl problems could not be solved with super-strength.So the Marvel Universe was born, populated with singular heroes with singular stories. The Hulk was a scientist transformed by radiation (a lot of that going on in the ‘60s.) Thor’s alter-ego was a doctor who came across a magical walking stick. The Fantastic Four were empowered by cosmic rays, but had to fend off bankruptcy and civil litigation.Most notable about Lee’s success was that he had already been in the comics business for almost a quarter-century. He reinvented the industry and himself at the same time.Jack Kirby (co-creator of the Hulk and Fantastic Four) and Steve Ditko (the co-creator of Spider-Man) were giants in the field, but Lee’s fingerprints were everywhere, generating plots, creating new characters and playing the role of P.T. Barnum for millions of kids who followed him and his Merry Marvel Marching Society wherever he led.More: We want a savior. Movies aren't the only place to find one.Leave dead people alone: technology threatens celebrities' image after they've moved onFlashback: It's time to create an Academy Award for best blockbusterThrough Marvel Comics, the kids of the ‘60s saw:► Characters dealing with extraordinary power and a sense of duty.  Peter Parker was reminded that “With great power comes great responsibility.”► We saw a noble African character who fought for justice and defied all stereotypes as “The Black Panther.”► We saw a ‘60s society with some emerging diversity. African-American Robbie Robertson emerged as a wise figure in the pages of Spider-Man. People with disabilities became heroes (Thor, Dr. Strange and Iron Man), though in thoroughly improbable  ways.► We saw racial bias filtered through science-fiction, with the coming of the X-Men and mutants, and society’s backlash. That theme has been developed by Marvel to even greater effect in the past decade.But most of all, we read about decent people trying to change the world for the better. Of course, that’s the theme of most heroic fiction, but somehow in Stan Lee’s hands, it was that much more relatable.It was gratifying to see Lee show up at comic book conventions in recent years and be treated as the creative giant he truly was. Of course, it didn’t hurt that he had cameo appearances in the mega-successful Marvel films of the 21st Century.In each issue of Marvel’s monthly comics, Lee would write a hyperbole-packed letter to readers touting the month’s publications and closing with a handful of alternating well-worn phrases. No hyperbole is needed to note Lee’s passing. He stirred the imagination of generations. “Nuff said.”Ken Paulson is the dean of the College of Media and Entertainment at Middle Tennessee State University, president of the Newseum Institute’s First Amendment Center and a member of the USA TODAY Board of Contributors. Follow him on Twitter: @kenpaulson1You can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com. "}