{"id": "Patriots have short turnaround with Rodgers, Packers next", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutPatriots must tackle short turnaround with Aaron Rodgers, Packers up nextA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsNew England Patriots quarterback Tom Brady looks to pass against the Buffalo Bills during the first half of an NFL football game, Monday, Oct. 29, 2018, in Orchard Park, N.Y. (AP Photo/Adrian Kraus)(Photo: The Associated Press)FOXBOROUGH, Mass. (AP) — The Patriots are accustomed to making adjustments.That was certainly their philosophy during their matchup with the Bills on Monday night.Down to just two healthy running backs on the roster with leading rusher and rookie Sony Michel inactive with a knee injury, New England started receiver Cordarrelle Patterson in the backfield in a move done more out of necessity than by design.While unusual, it didn't provide a lot of traction during a 25-6 victory in which Tom Brady was held without a passing touchdown and the offense was paced by Stephen Gostkowski's four field goals.But it might have been a glimpse at how creative the Patriots (6-2) are willing to be to keep alive a win streak that has grown to five games with a visit from Aaron Rodgers and the Green Bay Packers on Sunday night.This will be just the second meeting between Brady and Aaron Rodgers, with Rodgers winning the first matchup 26-21 in Green Bay in 2014.The two future Hall of Famers enter the rematch as the only active players with multiple Most Valuable Player awards (Brady three, Rodgers two).Green Bay is coming off a 29-27 loss to the unbeaten Rams and is just 3-3-1 on the season. But Brady said he is expecting to get the best from a player he considers to be \"one of the best to ever play.\"\"It's a big game for us,\" Brady said. \"I mean, they're in it every year. ... So it'll be exciting and we're going to have to play really well. It's a quick turnaround.\"If Michel can return this week it would decrease the stress on Brady and the passing game. Michel has the Patriots' only 100-yard rushing games in 2018.But even if he's not ready to go, offensive coordinator Josh McDaniels is confident they'll be able to adapt again if necessary.One of the reasons is the consistent production of James White. While primarily a receiving threat, he can break runs out of the backfield. He had New England's lone rushing touchdown against the Bills.\"James is a very dependable guy. Whatever it is we ask of him, we count on him to do a lot of things, and he usually does those things very well,\" McDaniels said.\"It's good to have a lot of guys in your offense that can be counted on. ... He's always been a big contributor to what we're doing, and he's got a lot of teammates that try to do the same thing.\"___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}