{"id": "Laird has 3 TDs runs in 49-7 Cal win over Oregon State", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutPatrick Laird ran for 193 yards and two touchdowns, and also caught a scoring pass, and California snapped a three-game losing streak with a 49-7 victory at Oregon State on SaturdayA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsCalifornia wide receiver Nikko Remigio fields a pass during the first half of an NCAA college football game against Oregon State in Corvallis, Ore., Saturday, Oct. 20, 2018. (AP Photo/Amanda Loman)(Photo: The Associated Press)CORVALLIS, Ore. (AP) — California held a players-only meeting on the eve of their game against Oregon State.The Golden Bears were still searching for their first conference win and had slumped with three straight losses.Seniors talked about how much the season meant to them, said defensive end Tevin Paul. The players took the talk to heart.Patrick Laird ran for 193 yards and two touchdowns, and also caught a scoring pass, and California snapped a three-game losing streak with a 49-7 victory at Oregon State on Saturday.\"I feel like it just really helped everyone out,\" Paul said, \"just trusting each other.\"The Golden Bears (4-3, 1-3) had not won a Pac-12 game on the road since a victory at Washington in 2015, a string of 14 games. But the victory was marred by two targeting calls against Cal players that resulted ejections.Chase Garbers threw for 234 yards and three touchdowns for the Golden Bears.The Beavers have lost five games overall as well and their last 13 conference games. Oregon State's lone win this season came against Southern Utah on Sept. 8.\"Honestly, we all hate losing, but at the end of the day you've got to keep fighting,\" Oregon State safety Jalen Moore said. \"That's life, you've got to keep fighting. Everything's not going to go your way, all you can do is keep fighting and stay positive.\"Oregon State was hurt late in the first half when starting quarterback Conor Blount left the game with a concussion after a helmet to helmet hit by Cal's Jaylinn Hawkins, who was ejected. Zeandae Johnson was ejected in the third quarter for a hit on third-string Beavers QB Jack Colletto.Garbers, who started at quarterback for Cal after Brandon McIlwain started the last two, found Malik McMorris with a 3-yard scoring pass on Cal's opening drive of the game. He hit Laird with a 29-yard TD in the second quarter as the Golden Bears went up 14-0.Laird added a 4-yard touchdown run late in the first half.Blount left the game late on Oregon State's final drive of the half after the helmet-to-helmet hit and Hawkins was called for targeting. Colletto took over. He was hit by Johnson in the third quarter.\"Totally unacceptable,\" said Cal coach Justin Wilcox. \"It's not what we stand for as a program. It will be the first thing we talk about on Monday.\"Wilcox added that players need to have more discipline and cannot lead with their heads.Backup QB Jake Luton was unavailable because of a high-ankle sprain that he sustained on Sept. 15 against Nevada.Cal's Christopher Brown Jr. scored on a 5-yard run to give the Golden Bears a 28-0 lead early in the second half, but Colletto scored on a 1-yard keeper before the quarter was over to get Oregon State on the scoreboard.Laird scored on a 30-yard run in the fourth quarter before Josh Drayden's 54-yard interception return with 20 seconds left closed out the scoring.Oregon State freshman Jermar Jefferson, who ranks fourth nationally with an average of 144.2 yards rushing per game, was in uniform and riding a bike on the sideline at the start. The team announced Jefferson had a mild hamstring strain and it was uncertain if he'd play, but he entered the game in the second quarter. He finished with 34 yards rushing.\"It's tough, it's real tough,\" Beavers receiver Isaiah Hodgins said. \"Because we know we've got players and we know we're a better team than last year. We know we've got good coaches and a great team. So it's just tough to not get the results we want. We're going to have to switch some things up, get some more energy, prepare better and finish the season strong.\"THE TAKEAWAY:California: Cal linebacker Jordan Kunaszyk had 10 tackles, including eight solo. Kunaszyk had a career-high 22 tackles, including 14 solo, in the Golden Bears' loss to UCLA last week. The last Cal player with as many tackles in a game was Jerrott Willard, who had 22 in a game against USC in 1992. ... Cal had a season-high seven sacks.Oregon State: The Beavers revived their old Benny Beaver mascot with special homecoming uniforms. Benny, who wore a jaunty orange OSU hat, was on the team's helmets back in 1973 and was part of the school's identity from 1951-98. ... Jalen Moore finished with a season-high 13 tackles.LAIRD'S DAY: It was his sixth career game with 100-plus yards rushing. His career high of 214 in a single game was set against Oregon State last season. He finished with 241 all-purpose yards.UP NEXT:Cal hosts Washington next Saturday.Oregon State visits Colorado next Saturday.___More AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}