{"id": "The late Stan Lee talked tech with USA TODAY", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe creator of Spiderman and so many other iconic characters sat down with USA TODAY in 2012 to talk tech, his love of the iPad and being a \"living legend.\" Lee died on November 12 at age 95.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    From 2012: the \"living legend\" and creator of so many great comic book characters talks tech with USA TODAY's Jefferson Graham.\n    Jefferson Graham, USA TODAY \"It's not every day you get to interview a living legend,\" I noted to Spiderman co-creator Stan Lee back in 2012.\"Well, hurry up while the legend is still living,\" he said.It turned out that Lee had another 6 years to go.The prolific comic book writer, who beyond Spiderman also created the Avengers, X-Men, Thor, Black Panther, Iron Man and so many other classic super heroes, was pitching a new YouTube project that back then was called \"Stan Lee's World of Heroes,\" which has since morphed into \"Marvelous TV.\"Stan Lee (Photo: Jefferson Graham/USA TODAY Network)\"If you're living in today's world, you've got to have your own digital channel, don't you?\" he asked at the time, when he was 89 years old. In our interview, Lee also talked of his love for AOL, the iPhone and iPad, with which he used to compete at chess against the computer. We also asked, in the bonus videos, about how he created Spiderman, and to reveal his take on longevity. Tune in to watch the living legend, and RIP Stan Lee, one of the all-time greats. \n    The late Stan Lee told USA TODAY about the super powers he would want in a 2012 interview.\n    Jefferson Graham, USA TODAY\n    In an interview with USA TODAY when he was 89 years old, Stan Lee talked about what he did on a daily basis to stay in decent shape.\n    USA TODAY \n    Spiderman creator Stan Lee spoke with USA TODAY in an interview about how he came up with Spiderman.\n    USA TODAY Stan Lee, in 2012. Jefferson Graham, USA TODAY (Photo: Jefferson Graham-USA TODAY) Follow USA TODAY's Jefferson Graham (@jeffersongraham) on Twitter, Instagram and YouTube. "}