{"id": "Missouri bounces back to throttle Memphis 65-33", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutDrew Lock threw for 350 yards and four touchdowns on 23-for-29 passing, and Missouri defeated Memphis 65-33 in its homecoming gameA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsMemphis quarterback Brady White throws a pass during the first half of an NCAA college football game against Missouri Saturday, Oct. 20, 2018, in Columbia, Mo. (AP Photo/L.G. Patterson)(Photo: The Associated Press)COLUMBIA, Mo. (AP) — Drew Lock threw for 350 yards and four touchdowns on 23-for-29 passing, and Missouri defeated Memphis 65-33 in its homecoming game on Saturday.After losing three straight Southeastern Conference contests, Missouri (4-3) responded with a much-needed victory. It jumped out to a 21-0 lead less than six minutes into the game, and never relinquished it.\"I thought the offensive staff leading up to today, they did a heck of a job of putting together a game plan, finding a way to get us some matchups,\" Missouri coach Barry Odom said. \"Some one-on-one matchups. And formationally, we were able to do some things that really gave us an advantage.\"Albert Okwuegbunam took advantage of one-on-one coverage multiple times throughout the contest. He caught six passes for 159 yards and three touchdowns and Jalen Knox had five catches for 104 yards and a score.All of Memphis' scoring came without star running back Darrell Henderson, who exited the game after four carries in the first quarter. He was seen riding on a stationary bike and left to the locker room in the second quarter.Henderson entered the game leading the nation with 1,133 rushing yards, 15 total touchdowns and 10.3 yards per carry. Tony Pollard and Patrick Taylor Jr. split carries the rest of the way, and Memphis' rushing attack was limited to 4.6 yards per carry.Missouri sprinted out of the gates by blocking a punt on Memphis' first drive and Christian Holmes intercepted Brady White's pass for a 42-yard touchdown return on Memphis' second drive.Memphis (4-4) climbed back with 17 straight points, but Missouri responded with 20 consecutive of its own. Missouri's defense slowed down the visiting Tigers in the second half, and the home Tigers cruised to their first victory since Sept. 15 against Purdue.THE TAKEAWAYMemphis: Contrary to its close game against No. 10 Central Florida last week, Memphis looked thoroughly outplayed against Missouri. Memphis fans will be closely watching the status of Henderson's injury.\"Not the showing we wanted to have,\" Memphis coach Mike Norvell said. \"Got off to a slow start, turned the ball over, had miscues in every phase and gave up too many explosive plays defensively and had some missed assignments that really cost us.\"Missouri: The Tigers broke out of their three-game losing streak in a big way. Lock and the Missouri offense found its form, and the Tigers look to carry momentum into the second half of SEC play.UP NEXTMemphis has a bye week before facing East Carolina on Nov. 3.Missouri returns to conference play with a home matchup next Saturday against No. 19 Kentucky.___For more AP college football coverage: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}