{"id": "Ohtani wins AL Rookie of the Year; Acuna takes NL honor", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutLos Angeles Angels two-way star Shohei Ohtani was an overwhelming pick for American League Rookie of the Year, and Atlanta Braves outfielder Ronald Acuna Jr. was a runaway selection for the National League honorA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsFILE - In this Sept. 5, 2018, file photo, Los Angeles Angels' Shohei Ohtani follows through on a two-run home run against the Texas Rangers during the eighth inning of a baseball game in Arlington, Texas. Ohtani is a finalist against two New York Yankees teammates for the AL Rookie of the Year award. The Baseball Writers' Association of America revealed the finalists for its major awards Monday, Nov. 5, 2018. (AP Photo/Ray Carlin, File)(Photo: The Associated Press)NEW YORK (AP) — Shohei Ohtani was rewarded for a Ruthian season at the plate — and on the mound.Baseball's best two-way player since the Babe at the dawn of the live-ball era a century ago, Ohtani was an overwhelming pick for American League Rookie of the Year on Monday despite an elbow injury that stymied his switch from Japan to the major leagues and likely will prevent him from pitching next year.\"I was just kind of disappointed I wasn't able to play a full season,\" he said through a translator. \"I feel like every player should be able to play a full year and help out the team. So that's something I need to work on, and that's going to be one of my goals, to stay healthy for a long full season and be able to the team win from day one.\"Atlanta Braves outfielder Ronald Acuna Jr. was a runaway choice for the NL honor over Washington outfielder Juan Soto in a contest between 20-year-olds.A singular sensation who earned a chorus of praise for his dual success, Ohtani became the first player since Ruth in 1919 with 10 homers and four pitching wins in the same season.He didn't play between June 4 and July 3 because of a sprained ulnar collateral ligament in his right elbow, an injury the Angels were aware of when they signed him for a $2,315,000 bonus last winter. The 24-year-old right-hander made just one more mound appearance, on Sept. 2, and three days later the team said a scan revealed additional damage and surgery was recommended.Ohtani appeared in 22 more games as a hitter, had Tommy John surgery on Oct. 1 and hopes to be able to help the Angels at the plate next season. He probably won't take the mound again until 2020.\"Everything's going well,\" he said. \"We're right on schedule, maybe even a little ahead.\"Ohtani, who left the Nippon Ham Fighters to play in the major leagues, received 25 first-place votes and four seconds for 137 points from the Baseball Writers' Association of America. New York Yankees third baseman Miguel Andujar was second with five firsts and 89 points, and Yankees second baseman Gleyber Torres was next with 25 points.Ohtani was 4-2 with a 3.31 ERA and 63 strikeouts over 51 2/3 innings in 10 starts. As a designated hitter, he batted .285 with 22 homers and 61 RBIs and a .925 OPS in 367 plate appearances.\"Of course, getting hurt is never a good thing,\" he said. \"I was able to fight through it.\"He is the first Japanese player to win a rookie honor since Seattle's Ichiro Suzuki in 2001 and the fourth overall, joining the Dodgers' Hideo Nomo in 1995 and Seattle's Kazuhiro Sasaki in 2000. Ohtani became the first player with 15 homers as a batter and 50 strikeouts as a pitcher in the same season.Acuna received 27 first-place votes and three seconds for 144 points. Soto got two firsts and 89 points, and Los Angeles Dodgers pitcher Walker Buehler was next with one first and 28 points.Acuna, in Japan with a major league All-Star team, declined to participate in a morning conference call about the vote, BBWAA secretary-treasurer Jack O'Connell said.Acuna started the season at Triple-A and made his debut on April 25, the youngest player in the majors then at 20 years, 128 days. The Venezuelan hit .293 with 26 homers, 64 RBIs and 16 steals with a .917 OPS. He set a Braves record with eight leadoff homers this season and tied a franchise mark by homering in five straight games from Aug. 11-14.Soto debuted on May 20 at 19 years, 207 days, although in a quirk the Dominican is credited with a home run from five days before his debut — he went deep on June 18 against the New York Yankees in the completion of the May 15 suspended game. Soto hit .292 with 22 homers, 70 RBIs and a .923 OPS. He was two shy of Tony Conigliaro's big league record for home runs by a teenager.The AL and NL Manager of the Year will be announced Tuesday. Boston's Alex Cora, Tampa Bay's Kevin Cash and Oakland's Bob Melvin are the finalists for the AL honor and Atlanta's Brian Snitker, Milwaukee's Craig Counsell and Colorado's Bud Black are the finalists for the NL award.___More AP MLB: https://apnews.com/tag/MLB and https://twitter.com/AP_SportsCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}