{"id": "Florida State pulls away to knock off Wake Forest", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutCam Akers had two touchdown runs, including a 58-yarder, and Deondre Francois threw for a season-high 353 yards as Florida State bounced back from a sloppy start and scored 38 straight points in a 38-17 win over Wake ForestA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsWake Forest's head coach Dave Clawson checks the scoreboard in the first quarter of an NCAA college football game with Florida State, Saturday, Oct. 20, 2018 in Tallahassee, Fla. Florida State won 38-17. (AP Photo/Steve Cannon)(Photo: The Associated Press)TALLAHASSEE, Fla. (AP) — Cam Akers had two touchdown runs, including a 58-yarder, and Deondre Francois threw for a season-high 353 yards as Florida State bounced back from a sloppy start and scored 38 straight points in a 38-17 win over Wake Forest on Saturday.Akers, who has struggled for much of his sophomore season, had 98 yards on 13 carries for Florida State (4-3, 2-3 Atlantic Coast Conference). The Seminoles set season highs for points scored and offensive yards (485).Francois completed 29 of 40 passes and had two touchdown passes, including a 33-yard scoring toss to Nyqwan Murray on fourth down. Francois had his eighth career 300-yard game in 21 starts, while Murray caught eight passes for 131 yards.Sam Hartman completed 22 of 46 passes for 227 yards for Wake Forest (3-4, 0-3), which ran 104 plays. Hartman hooked up with Jake Freudenthal on a 9-yard touchdown pass to put Wake Forest ahead 10-0, but the Demon Deacons didn't score on their next 11 drives until a touchdown drive in the game's final six minutes.Brian Burns and Joshua Kaindoh had two of Florida State's five sacks of Hartman. Burns has nine sacks on the season.Florida State, which has one of the nation's top rush defenses, held Wake Forest to 94 yards on 48 carries.THE TAKEAWAYWake Forest: A letdown after Wake had the Seminoles on the ropes 10-0 in the first quarter. It was another poor performance by the Demon Deacons' defense, which had allowed 36.8 points per game coming into Saturday.Florida State: The Seminoles keep their bowl hopes alive by knocking off Wake Forest for a seventh straight season. Florida State will face four ranked teams in its final five games — Clemson, Notre Dame, NC State and Florida.UP NEXTWake Forest: The Demon Deacons will play at Louisville on Saturday.Florida State: The Seminoles will play host to Clemson on Saturday.Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}