{"id": "Washington state voters should reject Initiative 1631", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutImposing a carbon fee would be a costly, unfair and ineffective tax, writes Bob Edwards, past president of the Association of Washington Cities.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsIn Seattle in August.(Photo: Elaine Thompson/AP)Voters in Washington state are asking themselves an important question: Should one of the cleanest, greenest states in the nation saddle itself with billions in new energy taxes for a badly written measure that will have no impact on climate change?Initiative 1631 is a deeply flawed, unfairly drafted energy tax that would force Washington families, small businesses, farmers and consumers to pay higher costs for gasoline, heating fuels, electricity and natural gas as well as for goods and services.It would impose a $15 fee per ton on certain carbon emissions beginning in 2020, increasing by $2 each year plus inflation, quadrupling within 15 years, with no limit on how high it could go.A state analysis shows that the initiative would increase energy taxes by $2.3 billion in the first five years alone.OUR VIEW: How Washington (the state) can fight climate changeThis tax would especially hurt low-income and fixed-income households, seniors and working families who can least afford to pay more. The fact that the measure includes language purporting to mitigate these impacts is further evidence of the regressive nature of the proposal. It would also damage our state’s economy.A study by National Economic Research Associates consulting firm found that the $30 billion in new taxes collected over 15 years would cost the equivalent of 21,300 jobs and reduce the gross state product by $5.3 billion. Gasoline prices would increase by 13 cents per gallon in the first year alone, increasing annually with no cap, adding up to 59 cents more per gallon within 15 years.All told, the firm estimates total costs per household at $440 in 2020, increasing to $990 by 2035.Finally, the initiative provides no specific spending plan, too little accountability and no requirements to reduce greenhouse gases. It gives an unelected board of political appointees a blank check to spend billions as they choose, without real legislative oversight or accountability to voters.The initiative is a costly, unfair and ineffective tax that would damage our state’s economy and would block the pathway to meaningful climate policy. On Tuesday, Washingtonians should reject 1631.Bob Edwards is past president of the Association of Washington Cities, the Port of Seattle Board of Commissioners and the Puget Sound Regional Council.If you can't see this reader poll, please refresh your page. "}