{"id": "Late eagle carries DeChambeau to victory in Las Vegas", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutBryson DeChambeau's late eagle carries him to victory in Las Vegas, his 4th in 12 starts on PGA TourA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsLucas Glover hits off the third tee during the final round of the Shriners Hospitals for Children Open golf tournament Sunday, Nov. 4, 2018, in Las Vegas. (AP Photo/John Locher)(Photo: The Associated Press)LAS VEGAS (AP) — Bryson DeChambeau saw signs of greatness last season on the PGA Tour when he won three times against the strongest fields this side of the majors.He started a new season headed down the same path.In his only fall start, DeChambeau never shot worse than 66 over four days in Las Vegas, holed an eagle putt from just inside 60 feet on the 16th hole and closed with smart play for pars to win the Shriners Hospitals for Children Open on Sunday by one shot over Patrick Cantlay.\"I was coming out here to try and kick rust off and was able to play some good golf,\" DeChambeau said. \"I'm happy to get it done.\"The eagle putt took him from a one-shot deficit to a two-shot lead when Cantlay made bogey from a deceptive lie in the bunker ahead of him on the 17th hole. DeChambeau won for the fourth time in his last 12 starts on the PGA Tour and moved to No. 5 in the world ranking.He had to survive a wild back nine at the TPC Summerlin in which four players had a share of the lead at some point.Cantlay, trying to become the first player to win back-to-back in Las Vegas in nearly 20 years, made a 15-foot birdie putt on the par-5 16th hole to take a one-shot lead. But from a bunker right of the green on the par-3 17th, Cantlay was fooled by the amount of sand under his ball and flubbed the shot.DeChambeau wasn't entirely sure where he stood. He could see Cantlay made the putt on the 16th hole and had to ask if it was for birdie or eagle. DeChambeau easily cleared the water, and his ball went just over the back of the green. He thought he hit it perfectly. Then, he thought he might have hit it too hard. It held its line at the end, and DeChambeau responded with a big uppercut.\"I haven't given a reaction like that in a while,\" he said.Cantlay birdied the 18th for a 65, but it wasn't enough when DeChambeau played the final two holes conservatively for pars to finish at 21-under 263.DeChambeau won for the third straight season, and fifth time overall on the PGA Tour.The 25-year-old American began his big run with a playoff victory at the Memorial, and then won consecutive FedEx Cup playoff events in New Jersey and Boston. He said he was playing Las Vegas to shake off a little rust, and it turned into another victory.\"I thought I had it in me, but I didn't know if I could do it,\" DeChambeau said. \"Last year I saw signs of something great. I didn't know where it would lead me. But I think it led me in the right direction.\"Not since Jim Furyk in 1998-99 had anyone successfully defended his title in Las Vegas, and Cantlay looked as if he might get it done when he drove the green on the par-4 15th for a two-putt birdie, and then rolled in another good birdie after having to lay up on the 16th. His tee shot into the 17th was a fraction away from catching a slope and feeding toward the hole. Instead, it tumbled into the bunker to set up what appeared to be a relatively simple shot.\"When I dug my left foot in, it didn't have a bunch of sand, and then obviously when I hit my shot there was more sand under the ball and didn't anticipate that,\" Cantlay said. \"It was a tricky one and I hit a poor shot.\"He wasn't the only player stung by the outcome.Former U.S. Open champion Lucas Glover had a 4-foot birdie putt on the 15th hole that would have given him a share of the lead with three holes to play. Glover missed the putt, and then missed a 30-inch par putt. One hole later, he was three shots behind.Glover finished with a triple bogey for a 71 and tied for seventh. He shot 61 on Saturday.Peter Uihlein, who shared the 54-hole lead with DeChambeau, didn't make a birdie until the 11th hole, finished bogey-bogey for a 75 and tied for 23rd.Sam Ryder was one shot behind when his second shot to the par-5 16th bounced off a knob and back into the water. He managed to save par and birdied the last hole with a 15-foot putt for a 62 to finish alone in third.Rickie Fowler (63), Abraham Ancer (66) and Robert Streb (68) were another shot behind.DeChambeau won for the fifth time in just his 68th start as a pro on the PGA Tour, dating to his victory in the John Deere Classic in 2017.Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}