{"id": "No. 23 LSU enters new season with high hopes, heavy hearts", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutSecond-year LSU coach Will Wade has recruited his way into the national rankingsA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsBATON ROUGE, La. (AP) — Second-year LSU coach Will Wade has recruited his way into the national rankings.Time will tell if a No. 23 Tigers team relying on a sophomore point guard, a senior transfer from Oregon and trio of highly touted freshmen can fulfill that promise — all while they cope with the recent fatal shooting of a teammate.The death of forward Wayde Sims, a Baton Rouge native whose father also played for LSU, will be forever intertwined with the Tigers' season.\"It's pretty glaring with him not there sometimes,\" Wade said. \"You walk in the locker room, his locker is the exact same. ... We took the team picture the other day, and we have his jersey in the middle — and that was what our guys wanted.\"The Tigers hope to honor Sims' memory by winning, and they appear to have the talent to do so.Guard Tremont Waters was among the Southeastern Conference's most exciting players as a freshman, when he averaged about 16 points. Now he's practically an elder statesman on a team expecting big things from freshmen Naz Reid, Emmitt Williams and Ja'vonte Smart.Reid, a 6-foot-10, 240-pound forward, and Williams, a 6-7, 215-pound forward, were both five-star recruits. Smart, a 6-4 guard, was a four-star recruit who was named Louisiana's best high school player the past three seasons.\"The fans are in for a nice little show this year — not just from me but from the entire team,\" Waters said.Here are some of the story lines surrounding LSU as the Tigers head into this season, starting with a home game against Southeastern Louisiana on Nov. 6:TOP PROSPECTReid, who is widely viewed as first-round prospect for next summer's NBA draft, said he sees himself as a modern, dynamic big-man, with ball-handling ability and perimeter shooting to complement his size and power in the post. He names Kevin Durant, DeMarcus Cousins, Joel Embiid and Anthony Davis as NBA players he studies in hopes of incorporating elements of their games into his.Reid that since he arrived at LSU, he has worked hardest on getting leaner  — losing about 25 pounds — and working on his outside shot.\"There's a lot of (future) pros in this conference,\" Reid said. \"So I feel like if you don't do pro-like things, then you won't be able to make it.\"Wade said Reid appears versatile enough to play on the wing and even bring the ball up the court.\"We like it when Naz gets rebounds. We let him push the ball. He's a play-maker,\" Wade said. \"We can play really big when we do that. We can maneuver him around just because of his unique skill set, and he's got a very, very bright future ahead of him in basketball.\"GETTING DEFENSIVEThe Tigers are relying on Oregon transfer and England native Kavell Bigby-Williams to anchor their defense. The 6-11 senior from London appeared in 37 games for Oregon's 2017 Final Four team.He began his American college basketball career at the junior college level in Gillette, Wyoming, where he blocked 211 shots and shot 59.2 percent for a team that went 35-2 in the 2015-16 season.\"I know what I bring to the table,\" Bigby-Williams said. \"I know I'm a defensive big, so I rebound, block shots, run the floor, bring energy to the team.\"SMART BETWade was gratified to learn that Smart, who averaged nearly 33 points as a high school senior, kept going to the gym to make 500 jump shots per day between the time his high school career ended and the time he arrived at LSU.Smart said it usually took him 45 minutes to an hour to make 500 shots. But his scoring isn't the only thing he brings to the Tigers. Waters said Smart's ball-handling is \"very special.\" That means Waters won't always have to run the offense and will have stints when he can focus more on scoring.PERFERRED WALK-ONWill Reese arrived at LSU as a pitcher on the baseball team and appeared in 10 games during two seasons before deciding to hang up his cleats. But baseball coach Paul Mainieri suggested Wade give Reese a look. The 6-4 Reese, a standout player on two title-winning high school basketball teams in Louisiana, is now expected to see action as a reserve guard this season.\"I have a trust with him. He's a sharp guy, knows how to play. Very, very good defender,\" Wade said. \"He's like the perfect walk-on.\"___More AP college basketball: https://apnews.com/tag/Collegebasketball and https://twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}