{"id": "For Jets on Sunday, trouble started with the snap", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutSnapping the ball was a challenge for the New York Jets at Miami, and things didn't get any better after that.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsNew York Jets head coach Todd Bowles watched the game, during the first half of an NFL football game against the Miami Dolphins, Sunday, Nov. 4, 2018, in Miami Gardens, Fla. The Dolphins defeated the Jets13-6. (AP Photo/Lynne Sladky)(Photo: The Associated Press)MIAMI GARDENS, Fla. (AP) — Snapping the ball was a challenge Sunday for the New York Jets, and things didn't get any better after that.Center Spencer Long reinjured a finger and had half-dozen off-target shotgun hikes, which compounded problems for quarterback Sam Darnold. He threw four interceptions — including a pick-six after he snared a high snap — and the Jets never reached the end zone in a 13-6 loss to the Miami Dolphins.\"We need to be more consistent, myself included especially,\" Long said. The injury on the middle finger of his right hand, which he dealt with earlier this season, finally forced him from the game.Darnold stayed in to take more rookie lumps for the Jets (3-6). His most costly mistake was a pass toward the sideline intended for tight end Eric Tomlinson. Linebacker Jerome Baker cut in front for his first career interception and scored the game's only touchdown untouched.\"I thought I'd be able to get it over him,\" Darnold said.As for the inconsistent snaps, he said: \"It disrupts timing, but there's no excuse for how I played out there.\"Baker's score put Miami ahead 13-3 with 11 minutes left. Darnold threw two more interceptions in the final 2½ minutes, both on fourth-and-long.Darnold finished 21 for 39 for 229 yards with four sacks and a passer rating of 31.8. That's the third time he has been below 40.\"I just have to be sharper,\" he said. \"Personally, I have to have a better plan when I get to the line of scrimmage. I've got to know exactly where to go with the ball. If No. 1 or 2 isn't there, I have to go to (No.) 3.\"Coach Todd Bowles said he's not thinking about replacing Darnold with veteran Josh McCown.\"Not right now, no,\" Bowles said.His critique of Darnold's performance: \"There are plays he would like to have back.\"Interceptions aren't a new problem — Darnold came into the game tied for the NFL lead with 10 . And lack of scoring is a familiar issue, too — the Jets have 33 points in the past three games, all losses.Safety Jamal Adams called the latest defeat a 53-man effort but added, \"It's the same, same, same stuff. It's frustrating. I'm not going to hold my tongue for anything anymore. Enough is enough. I'm not a loser.\"Despite a day of sputtering offense, the Jets had chances to pull the game out.Trailing 6-3, they reached the Miami 20 early in the fourth quarter, but a sack and delay of game penalty forced them back, and Jason Myers missed a 50-yard field goal try.\"We were in it until the end,\" Bowles said. \"We just didn't make enough plays to win it.\"___Follow Steven Wine on Twitter: http://twitter.com/Steve_Wine___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}