{"id": "James Woods blasts Clinton bomb threat as ‘obvious political stunt’", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe actor took to Twitter to say the former first family is not relevant enough to send a bomb. He then reversed position and blamed Democrats.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    The commissioner of the New York Police Department says their bomb squad found what appeared to be a live explosive device along with white powder that were intercepted at CNN's New York office. Mayor Bill DeBlasio and Gov. Andrew Cuomo address safety concerns going forward.\n    USA TODAYActor James Woods called the \"potential explosive devices\" that the Secret Service intercepted from Bill and Hillary Clinton's home an \"obvious political stunt.\"(Photo: Alberto E. Rodriguez) Actor James Woods called the \"potential explosive devices\" that the Secret Service intercepted from Bill and Hillary Clinton's home an \"obvious political stunt.\"In a now-deleted tweet, the actor, 71, took to Twitter to tell his 1.8 million followers that the former first family is not relevant enough to send a bomb. “Who gives a rat’s (expletive) about the #Clintons enough to do this? Obvious political stunt,” Woods tweeted Wednesday. His post referenced a tweet from the Associated Press that said an potential explosive device was found at Bill and Hillary Clinton's home in suburban New York. Woods appeared to walk back his \"political stunt\" claim with another tweet that remains on his Twitter account. \"The sending of bombs is a threat to the very foundation of our Republic,\" he wrote. \"That people would seriously suggest such an act could be a 'false flag' stunt is inappropriate.\"Related: Kanye West stumps for Chicago mayoral candidate, leaves after five minutesThe sending of bombs is a threat to the very foundation of our Republic. That people would seriously suggest such an act could be a “false flag” stunt is inappropriate. It is sad, however, that Democrat #mob behavior of late could prompt one to believe such a thing possible.He continued, pointing a finger at the left for his first response: \"It is sad, however, that Democrat #mob behavior of late could prompt one to believe such a thing possible.\"Potentially dangerous deliveries were sent to prominent Democrats across the country, including former President Barack Obama in Washington, Rep. Debbie Wasserman Schultz in South Florida and California Congresswoman Maxine Waters.Packages also were sent Monday night to liberal philanthropist George Soros' residence in Westchester County, New York, and on Wednesday to CNN offices in New York City, authorities said.Woods, who has more than 100 acting credits to his name and starred in several movies including “Salvador,” ″Ghosts of Mississippi” and “Casino,” is an outspoken supporter of President Donald Trump. He frequently uses his Twitter page to share his conservative political views, including tweets on Supreme Court nominee Brett Kavanaugh.Recently, he was locked out of the social media platform for violating Twitter's rules. Contributing: The Associated Press, Jessica EstepaRelated: Chelsea Handler mixes up Native American candidates in political endorsementMore: Ryan Reynolds had a voting party with Blake Lively for his birthday, trolling includedA link has been posted to your Facebook feed.    "}