{"id": "David Moore moves from 7th-rounder to Seahawks' No. 3 WR", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutIt's taken just a few weeks for David Moore to start getting attention beyond just his hometown or in SeattleA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsRENTON, Wash. (AP) — David Moore went home to Gainesville, Texas, during the Seattle Seahawks' bye week with the kind of attention no one could have expected when he became a seventh-round draft pick of the Seahawks in the spring of 2017.Rather than getting inundated back home in the town of less than 20,000 about 70 miles north of Dallas, Moore said most of his hometown is pretty respectful and relaxed about the local star that's quickly becoming a favored target of Russell Wilson.\"It gets a little hectic sometimes but for the most part my hometown is real chill,\" Moore said. \"They'll see me, say hey, ask me a couple of questions, but other than that it's just like going back home to peaceful, country-old Gainesville.\"It's taken just a few weeks for Moore to start getting attention beyond just his hometown or in Seattle. In the past three games, Moore has gone from being mostly a special teams contributor with only a handful of snaps on offense, to having caught three touchdown passes and supplanting Brandon Marshall as the No. 3 wide receiver in Seattle's offense.While Tyler Lockett and Doug Baldwin remain the top targets for Wilson in Seattle's pass game, Moore has quickly made his case for more passes headed his direction.\"He looks like he's going to really have a terrific season. He's really off to a great start,\" Seattle coach Pete Carroll said. \"There's a lot of things that we can still do with him, really just breaking him in.\"Moore was a complete project when Seattle drafted him with the first of two seventh-round picks in the 2017 draft. He played collegiately at Division II East Central in Oklahoma, where he dominated competition — as would be expected — but it was difficult to gage how that would transfer to the NFL. He spent most of last season on Seattle's practice squad, before being added to the active roster late in the season.But Moore made a major jump in his development in the offseason and was a standout during training camp and the preseason to where it was obvious he would make Seattle's final 53-man roster.What has been a surprise is how quickly he moved up the depth chart and has taken away snaps from Marshall. Moore had just one target in his career before Week 4 against Arizona when he had a pair of catches and played 43 offensive snaps. A week later against the Los Angeles Rams, Moore had three catches, two for touchdowns , in the 33-31 loss.And in Week 6 in London against the Raiders, Moore caught his third touchdown in two games when he got free on a broken play and caught a 19-yard TD from Wilson before crashing into the video boards beyond the end zone at Wembley Stadium.In the past three games, Moore has played 104 offensive snaps; Marshall has just 56.\"We love David's strength and the power that he played with. It's just the level of play was hard to determine, we didn't know how he would transition,\" Carroll said.Moore is part of a trio of key contributors the Seahawks have nabbed out of the state of Oklahoma in the past two drafts. Moore and starting running back Chris Carson (Oklahoma State) were both seventh-round picks in the 2017 draft, and Seattle grabbed starting cornerback Tre Flowers out of Oklahoma State in the fifth round of this year's draft.The three of them all were identified by Seattle-area scout Aaron Hineline, but it was a pre-draft workout that Moore had in Oklahoma City where he remembered answering some of the questions that followed him because of his collegiate competition.\"I showed them that honestly the speed that they thought wasn't there, was there. The potential to do a lot of the things they ask me to do, and just accepting all the challenges they asked me to do and doing it as hard as I did, I guess I showed them quite a bit,\" Moore said.NOTES: Carroll said the Seahawks expect LB K.J. Wright (knee) and TE Ed Dickson (upper leg) to play on Sunday against Detroit. Neither has played in the regular season because of injuries. ... Carroll said the team has not heard anything regarding suspended LB Mychal Kendricks after his meeting with the league on Monday. Kendricks has been indefinitely suspended after pleading guilty to insider trading charges.___More AP NFL: https://apnews.com/tag/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}