{"id": "Amari Cooper prefers show over tell for impact on Cowboys", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutAmari Cooper more interested in show than tell over his impact after Cowboys gave up first-round pick for new No. 1 receiverA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsDallas Cowboys receiver Amari Cooper (19) warms up with Cole Beasley (11) during football practice in Frisco, Texas, Wednesday, Oct. 24, 2018. (AP Photo/Michael Ainsworth)(Photo: The Associated Press)FRISCO, Texas (AP) — Amari Cooper is ready to show the Dallas Cowboys what they got in giving up a first-round draft pick for a new No. 1 receiver.The former Oakland pass-catcher just isn't too interested in talking about it beforehand.\"I will leave that for you guys to see,\" Cooper said Wednesday in his first meeting with reporters after his first practice with the Cowboys, who have extra time to get him ready for a new offense with their open week before returning Nov. 5 at home against Tennessee.Quarterback Dak Prescott said he will stay home during his weekend off to spend extra time with Cooper, acquired Monday for Dallas' top pick next year. They were Southeastern Conference rivals when Prescott was at Mississippi State and Cooper at Alabama.\"Just excited,\" Prescott told The Associated Press on Wednesday. \"A guy I played against in college and then I've seen him play in the NFL and be a two-time Pro Bowler. Just the things that he does and how explosive he is, he has a lot to offer this offense.\"While Cooper has connections to the Cowboys through previous offensive coordinators who worked under Dallas' Scott Linehan and a strong link to tight ends coach Doug Nussmeier from their time together with the Crimson Tide, he says the system he's walking into is quite different.Cooper also says it doesn't matter much.\"I've been playing football all my life,\" Cooper said. \"You just have to be a good learner, and I think I'm that. I'm already adjusting and picking up the system pretty well.\"Cooper said he saw the move as a fresh start, but added he hadn't really thought about whether he needed one . After two 1,000-yard seasons with trips to the Pro Bowl his first two years, Cooper's production dropped in his third season with the Raiders.This year, Cooper had two 100-yard games before being targeted just twice with one catch in his final two games with the Raiders. He left his final game with Oakland against Seattle early with a concussion, but says he has cleared the concussion protocol.\"When I found out I was going to be a Dallas Cowboy, I just knew I would have to adapt fast,\" said Cooper, who said he found out on the practice field with the Raiders on Monday. \"I knew everything would happen real fast. I didn't really have time to think about it, to be honest.\"While the Cowboys paid a premium to get Cooper, they essentially viewed him as a first-round pick in trying to upgrade a group that has struggled to replace retired tight end Jason Witten and franchise touchdown catch leader Dez Bryant, who was released in a cost-cutting move.Cooper, the fourth overall pick in the 2015 draft, has 3,183 yards and 19 touchdowns in 52 games. He's 24 — five years younger than Bryant — and due to make $13.9 million in the final year of his rookie contract next season. He's a bargain this year, though, with a salary of $700,000.\"We feel like he's the kind of guy that we've drafted in the first round over the last few years, these building-block players who we think are going to be here for a long time,\" coach Jason Garrett said. \"We feel like he fits into that mode and maybe in some ways is less risky because he has production at the NFL level.\"The Cowboys (3-4) have one 100-yard receiving game this season, by Cole Beasley, the dean of their revamped receiving group, in a blowout win over Jacksonville in Week 6. Dallas wide receivers don't even have 1,000 yards combined just one game shy of the halfway mark.But one of Dallas' defensive leaders isn't ready to say things are fixed coming off a 20-17 loss at Washington that dropped Dallas to 0-4 on the road.\"I don't like thinkin',\" pass rusher DeMarcus Lawrence said. \"I like proving to people. Just like he has to prove to y'all, he has to prove to us that he's in here to come to work each and every day just like the rest of us and get this thing rolling.\"That's not news to Cooper.\"I have to stack the days together,\" he said. \"Obviously learn the system, and just be ready to go out there when my name is called. All the other stuff will come.\"NOTES: DE Randy Gregory had arthroscopic surgery on a knee that's been bothering him most of the season, but he is expected to be ready to face the Titans. ... RG Zack Martin and TE Geoff Swaim both sustained sprained knees against the Redskins, but the Cowboys are optimistic both will be available against Tennessee.___More AP NFL: https://apnews.com/tag/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}