{"id": "Estelle's soulful favorite songs in a playlist, from Aretha to Lil Wayne", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutCelebrating her first reggae album \"Lovers Rock,\" the English singer-songwriter Estelle curates a playlist of favorites for USA TODAY.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsEstelle performs at the Six Degrees to Tennessee Roots Jam at New Daisy Theater on September 15, 2018 in Memphis, Tennessee.(Photo: Greg Campbell)Celebrating her first reggae album \"Lovers Rock\" -- and the 10-year anniversary of her breakthrough hit with Kanye West, \"American Boy\" -- English singer-songwriter Estelle curates a playlist of favorites for USA TODAY.“It's A Jam In The Street” - John Holt \nReggae classic -- this stays in ALL of my personal playlists -- John Holt is one of my Mount Rushmore, Hall of Fame favorite reggae artists. His tone so pure, clarity and confidence. You feel like you can sing along to all of his records until you try.“Pretty Little Fears” - 6lack featuring J. Cole\nOne of the most exciting new singer/songwriters and overall artists out right now. He is very vulnerable and truthful in his approach. It resonates. “Home” - Jaime Woods\nAn exciting young new singer/songwriter. She has a very pure voice. I love her intent and tone. “So Easy” - Estelle feat. Luke James \nIt’s one of my favorite songs that I’ve written to date. It kind of flew out of my spirit. I'm grateful for it.\n “The Rhythm Changes” - Kamasi Washington\nI found this record randomly recently and it just felt so warm and beautiful. The words feel very comforting. I play it on repeat.\n “Day Dreaming” - Aretha Franklin \nI was recently reminded of how amazing this record is. Queen Aretha's vocal approach is absolutely one of a kind on this record. The rises and dips feel really easy for her to do. It's why she is the Queen!\n “Don't Stop” - Jon Batiste\nJust lush and haunting. I'm a fan of Jon Batiste in general and this is very bluesy instead of plain contemporary jazz... I love his intention on this record. It lets us into his brain a little bit, it's a beautiful love song.\n “Percogesic” – Gallant\nHe's a beautiful vocalist, this is the perfect daytime working and vibes song.\n “Mona Lisa” - Lil Wayne feat. Kendrick Lamar\nStorytelling at its finest. Welcome back Mr. Carter!\n “A Rose In Harlem” - Teyana Taylor\nThis record resonates with a lot of creatives that are going through their path trying to make something great... sometimes you doubt yourself, sometimes it’s the people closest to you. Either way, you have to remember that you're pretty amazing to have even gotten as far as you have and to just get on with it."}