{"id": "Bowman back with 408 yards, 3 TDs in Texas Tech win over KU", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutAlan Bowman threw for 408 yards and three touchdowns while playing for the first time since suffering a partially collapsed lung as Texas Tech beat Kansas 48-16A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsTexas Tech's Antoine Wesley (4) catches the pass over Kansas' Elmore Hempstead Jr. (23) during the first half of an NCAA college football game Saturday, Oct. 20, 2018, in Lubbock, Texas. (Brad Tollefson/Lubbock Avalanche-Journal via AP)(Photo: The Associated Press)LUBBOCK, Texas (AP) — Alan Bowman threw for 408 yards and three touchdowns while playing for the first time since suffering a partially collapsed lung three weeks ago, and Texas Tech beat Kansas 48-16 on Saturday.\"Looked like he never even had an injury,\" receiver Antoine Wesley said.Bowman completed 36 of 47 passes while showing accuracy on short and deep passes, with only one interception. The true freshman was the nation's leading passer when he got crushed between two West Virginia defenders in Texas Tech's last home game Sept. 29, and was released from the hospital four days later.\"It's been a while. We just wanted to make sure practice went well. Didn't want any setbacks,\" coach Kliff Kingsbury said. \"We felt confident ... a few days after he got out of the hospital that he'd be ready for this date. We just wanted to make sure he held up, felt good. His breathing was fine.\"After coming out early in that loss to West Virginia, Bowman missed only one game. Jett Duffey started a 17-14 win at TCU. On his only drive in the fourth quarter Saturday, Duffey completed all three of his passes for 33 yards before DeMarcus Felton's 34-yard TD run for a 48-9 lead.Wesley, who entered the game third nationally with 117 yards receiving a game, had nine catches for 155 yards and a nifty one-handed grab for a 6-yard touchdown. T.J. Vasher and Seth Collins also had TD catches for the Red Raiders (5-2, 3-1 Big 12), who had 553 total yards despite three turnovers.Kansas (2-5, 0-4) lost its 43rd consecutive true Big 12 road game, dating back to a 35-33 win at Iowa State on Oct. 4, 2008.But the Jayhawks weren't surprised to see Bowman in the game, no matter how coy Kingsbury had been about who would be his starting quarterback.\"Our defensive game plan was all around Bowman,\" senior linebacker Joe Dineen Jr. said. \"Our coaches knew that he was going to be able to go this week, so we really prepared for him.\"The Jayhawks played their first game since offensive coordinator Doug Meacham was fired. Peyton Bender threw for 221 yards and two touchdowns while freshman Pooka Williams had 16 carries for 70 yards to finish 38 yards below his rushing average that was second-best in the Big 12.\"We're disappointed because we didn't do enough to help us win,\" coach David Beaty said of the overall offensive output. \"We had a firm understanding of what we were doing. I think everybody felt comfortable there. They were engaged the entire time.\"THE TAKEAWAYKansas: The Jayhawks have lost all four of their Big 12 games after finishing their nonconference schedule with consecutive victories games for the first time since 2009.Texas Tech: Coach Kliff Kingsbury is back to .500 as coach of his alma mater — at 35-35 overall in his sixth season. The former Red Raiders quarterback was 7-0 in his coaching debut in 2013, and is 28-35 since. Tech is one win shy of bowl eligibility, a mark it didn't reach until the regular-season finale last year.RED RAIDER DThe Red Raiders has held consecutive conference opponents under 20 points for the first time since 2013, and had three sacks against the Jayhawks. Senior linebacker Kolin Hill had his first two sacks of the season.\"Especially when I first got here, we weren't known for defense at all,\" Hill said. \"That's definitely something that we stress. Things have changed for us defensively.\"EXTRA POINTSEight different players caught passes from Bowman. ... Dineen had two tackles for loss, giving him 41 for his career and matching Willie Pless for the school record.UP NEXTKansas:  Home to play TCU next Saturday.Texas Tech: Plays Saturday at Iowa State.___More AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}