{"id": "Kevin Harvick dominates Texas playoff race to clinch berth in NASCAR final four", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutKevin Harvick’s repeat victory at the AAA Texas 500 came with the same reward: a chance to compete for the NASCAR Cup championship in two weeks.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsKevin Harvick celebrates after winning the AAA Texas 500, Sunday at Texas Motor Speedway.(Photo: Jerome Miron, USA TODAY Sports)FORT WORTH, Texas — Kevin Harvick’s repeat victory at the AAA Texas 500 came with the same reward: a chance to compete for the title in two weeks.Harvick secured a berth in the Championship 4 with Sunday’s overtime victory at Texas Motor Speedway, leaving only two spots left entering next weekend’s Can-Am 500 at ISM Raceway outside Phoenix.Harvick, who claimed the Monster Energy NASCAR Cup Series championship in 2014, won the first two stages and led half the race, reclaiming the lead from Ryan Blaney with less than 20 laps left and then holding off the Team Penske driver on two late restarts. “Really, that’s what you race for, to get yourself in position to be in the playoffs and then position yourself to have a chance to at Homestead,” Harvick said after his season-high eighth victory. “It’s not easy this time of year because everybody is throwing everything they have at it. To get victory lane, that’s our goal. That’s how you control your destiny the most, instead of counting fingers and toes what you need to do.”.@KevinHarvick is going #4TheCup.Harvick wins at @TXMotorSpeedway. He'll try to earn his second @NASCAR Cup Series championship in two weeks at @HomesteadMiami! #NASCARPlayoffspic.twitter.com/1lpnuTnfUxLast November’s victory was Harvick’s first at this track. He finished second here in April after an unscheduled pit stop ruined another dominant run. \"We've loved it here since they repaved it,\" said Harvick crew chief Rodney Childers. \"We had great race cars last year. The spring hurt us a little bit. We had such a great race car, and we were able to bring the same car back with some updates and do great again tonight. It's an awesome feeling.\"Joey Logano, who finished third, secured his chance to compete for the championship at the Nov. 18 season finale at Homestead-Miami Speedway with a victory at Martinsville Speedway one week ago. The driver he spun out to win that race, Martin Truex Jr., was among the Round of 8 drivers who struggled with penalties.A link has been posted to your Facebook feed. Truex rebounded early in the race on the 1.5-mile oval after he started in the back of the field because of an engine change. He was sent back again around the midpoint of the race after he was penalized for rolling through more than three pit stalls on a pit stop.  After another drive through the field and a timely caution, Truex rebounded again to finish ninth, good enough to drop just one spot in the playoff standings to third.“I’m telling you, God is testing us,\" Truex said. \"There’s no question. Just a tough day. Overall, a good day. Luckily we were able to get up front and get some stage points in the first two stages.Truex said the team is \"in decent shape going to Phoenix.\"\"We’ll go there and race hard again and see what we can do,\" Truex added. Kyle Busch, who entered the race atop the playoff standings, was hit with a speeding violation on pit road and had to make an unscheduled pit stop before the midpoint of the race. He spent much of the rest of the race trying to get back on the lead lap en route to finishing 17th.  Busch enters next Sunday's race second to only Harvick in the standings. Clint Bowyer’s chances of making the Championship 4 dimmed when his car, which started on the front row, rode up the track and clipped Denny Hamlin on the first turn of the first lap, a collision that sent both to the pits. That led to an unscheduled pit stop to address the damage that collision caused along with a penalty later in the race because one of his crew members was caught sitting on the wall — a violation of pit lane rules. Bowyer never recoverd and finished 26th. That sets up a must-win situation for the Stewart-Haas Racing driver, who has led only 22 laps in 26 starts in Phoenix. His average finish is 18.4 with only two top-5 finishes, the last coming a decade ago.Aric Almirola and Chase Elliott ­— two others drivers who made the Round of 8 — also almost certainly need a victory next Sunday to gain entry to the Championship 4.NASCAR announced three drivers, in addition to Truex, would start at the back of the field just before the start of the race: Almirola (unapproved body modifications), William Byron (failed inspection) and seven-time Cup champion Jimmie Johnson (failed inspection).But there was one issue –– Johnson was penalized by NASCAR by mistake. The rules for Texas stated cars could fail inspection three times, not the the more typical two times. Johnson only failed twice, a mistake that was not announced until more than 100 laps into the race.   Johnson, who spun out Hendrick Motorsports teammate Byron on Lap 98, rebounded to lead briefly twice as race as cars shuffled into the pits. He finished 15th, partly due to NASCAR issuing a pass-through penalty after officials caught a crew member hopping into the pit box too soon.Follow USA TODAY Sports' A.J. Perez on Twitter @byajperez.A link has been posted to your Facebook feed. Sunday at the 1.5-mile Texas Motor Speedway (starting position in parentheses):1. (3) Kevin Harvick, Ford, 337.2. (1) Ryan Blaney, Ford, 337.3. (8) Joey Logano, Ford, 337.4. (12) Erik Jones, Toyota, 337.5. (22) Kyle Larson, Chevrolet, 337.6. (16) Chase Elliott, Chevrolet, 337.7. (7) Kurt Busch, Ford, 337.8. (4) Aric Almirola, Ford, 337.9. (13) Martin Truex Jr., Toyota, 337.10. (26) Austin Dillon, Chevrolet, 337.11. (17) Ricky Stenhouse Jr., Ford, 337.12. (5) Brad Keselowski, Ford, 337.13. (11) Paul Menard, Ford, 337.14. (18) Alex Bowman, Chevrolet, 337.15. (23) Jimmie Johnson, Chevrolet, 337.16. (9) William Byron, Chevrolet, 337.17. (10) Kyle Busch, Toyota, 337.18. (14) Ryan Newman, Chevrolet, 335.19. (20) Jamie McMurray, Chevrolet, 335.20. (25) AJ Allmendinger, Chevrolet, 335.21. (15) Trevor Bayne, Ford, 335.22. (24) Ty Dillon, Chevrolet, 335.23. (21) Chris Buescher, Chevrolet, 335.24. (27) David Ragan, Ford, 335.25. (30) Bubba Wallace, Chevrolet, 335.26. (2) Clint Bowyer, Ford, 334.27. (28) Regan Smith, Chevrolet, 332.28. (19) Daniel Suarez, Toyota, 332.29. (29) Michael McDowell, Ford, 331.30. (6) Denny Hamlin, Toyota, 331.31. (34) Parker Kligerman, Toyota, 329.32. (33) Ross Chastain, Chevrolet, 326.33. (38) Reed Sorenson, Chevrolet, 326.34. (36) Kyle Weatherman, Chevrolet, 323.35. (32) Landon Cassill, Chevrolet, 321.36. (35) JJ Yeley, Toyota, 321.37. (39) Joey Gase, Ford, 317.38. (31) Matt DiBenedetto, Ford, Accident, 300.39. (40) David Starr, Toyota, 287.40. (37) Corey LaJoie, Chevrolet, 269.RACE STATISTICSAverage Speed of Race Winner: 150.558 mph.Time of Race: 3 hours, 21 minutes, 27 seconds.Margin of Victory: .447 Seconds.Caution Flags: 8 for 37 laps.Lead Changes: 16 among 7 drivers.Lap Leaders: R. Blaney 1-32;K. Harvick 33-131;J. Logano 132-152;A. Bowman 153-155;B. Wallace 156-157;J. Johnson 158-159;K. Harvick 160-172;J. Logano 173-176;B. Keselowski 177-226;R. Blaney 227;J. Logano 228-253;K. Harvick 254-280;J. Logano 281-283;J. Johnson 284-292;K. Harvick 293-310;R. Blaney 311-317;K. Harvick 318-337.Leaders Summary (Driver, Times Lead, Laps Led): Kevin Harvick 5 times for 177 laps; Joey Logano 4 times for 54 laps; Brad Keselowski 1 time for 50 laps; Ryan Blaney 3 times for 40 laps; Jimmie Johnson 2 times for 11 laps; Alex Bowman 1 time for 3 laps; Bubba Wallace 1 time for 2 laps."}