{"id": "King throws for 413 yards to lead Houston past Navy 49-36", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutD'Eriq King threw for 413 yards and three touchdowns, ran for a score and deftly directed a Houston attack that amassed 574 yards in a 49-36 victory over NavyA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsANNAPOLIS, Md. (AP) — For 30 minutes, Navy went touchdown for touchdown with high-powered Houston. Their confidence soaring, the Midshipmen went into the locker room at halftime poised to pull off a huge upset.Few teams, however, can keep up with D'Eriq King and the mighty Cougars offense. Certainly not Navy, which was buried under a barrage of big plays and TDs in Houston's 49-36 victory Saturday.King threw for 413 yards and three touchdowns, ran for a score and deftly directed a Houston attack that rallied from a 24-14 second-quarter deficit with 35 straight points.\"It's great to be a Cougar and see home-grown talent like D'Eriq continue to make play after play,\" Houston coach Major Applewhite said. \"We just need to get more guys like him.\"With King leading the way, Houston (6-1, 3-0 American Athletic Conference) reached the 40-point mark in a seventh straight game, matching the school mark set in 2011.\"They obviously have a ton of speed at every position,\" Navy coach Ken Niumatalolo said. \"You stop them on the inside they go to the edge, you stop them on the edge and they go inside. They have so many weapons.\"Marquez Stevenson caught eight passes for 141 yards and had a rushing TD. Keith Corbin and Courtney Lark also exceeded 100 yards receiving, and Austin Robinson was credited with 21 tackles, including two sacks.It all added up to Houston's fourth straight win, and Navy's fourth successive defeat.King went 25 for 38 without an interception. The 5-foot-11 junior has 23 touchdown passes and four 300-yard games this season.Malcolm Perry rushed for 97 yards for Navy (2-5, 1-3) despite sitting out most of the second half with a leg injury. The Midshipmen were outscored 28-0 in the second half before squeezing two touchdowns into the final two minutes.\"We started off greatly, and it's like someone unplugged us,\" Niumatalolo lamented.A 14-yard touchdown pass from King to tight end Romello Brooker in the third quarter put Houston up 28-24, and Stevenson scored on a 1-yard run to raise the margin to 11 points.King and Corbin collaborated on a 2-yard touchdown pass with 7:45 left, and Nick Watkins scored on a 50-yard interception return for a 49-24 lead.\"I'm proud of the way they responded,\" Applewhite said, \"because we didn't always play well in the first half.\"Houston rang up 337 yards in the first half but trailed 24-21 at the break.\"We talked about it as a staff at halftime with our players,\" Applewhite said. \"They played a great first half, and now we've got to play our great half.\"Navy took a 10-7 lead on a 32-yard touchdown run by Perry late in the first quarter. After Houston missed a field goal , an offside call against the Cougars on a fourth-and-4 play extended a Navy drive that ended with a touchdown run by Zach Abey .King responded with a 17-yard touchdown run, but 45 seconds later Navy's Tazh Maloy capped a two-play drive by running 32 yards for a score.Two plays after that, King connected with Lark for a 65-yard touchdown pass — the game's fourth TD in a span of 3 minutes, 13 seconds.THE TAKEAWAYHouston: The Cougars are an offensive machine that can score quickly and frequently. Houston has some work to do defensively, but until improvement occurs in that area King has the ability to win a shootout.Navy: The Midshipmen are having trouble backing up a good first half. Navy has been outscored 66-19 after halftime in its last three games against Air Force, Temple and Houston.\"I don't know what's going on, but for some reason we are not executing in the second half like we need to,\" quarterback Garrett Lewis said.GETTING HIS KICKSWith a field goal and three conversions, senior Bennett Moehring became Navy's career leader in points by a kicker (195). His 129 extra points are also a school record.UP NEXTHouston hosts No. 21 South Florida next Saturday. The Cougars have won three straight against the Bulls.Navy faces No. 4 Notre Dame in San Diego on Saturday night. The Irish (7-0) will be coming off a bye.___More AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}