{"id": "Man shoots buck with two heads. One had been dead for quite awhile.", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutOne buck died after fighting with the survivor, but he couldn't disentangle his rack from the dead deer and dragged him around until a head remained.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsWhen Bob Long of Marshall County, Kentucky, shot a buck in mid-November 2018 in Ballard County in far western Kentucky, he got more than he bargained for. The live deer was entangled with what had become a decaying head of another buck, an animal that had been dead for so long that its body had detached from the head.(Photo: Courtesy of Joe Mattingly and Kentucky Department of Fish and Wildlife Resources)The Kentucky Department of Fish and Wildlife Resources posted a photo earlier this week on Facebook of an unusual harvest: A buck with two heads.One head was attached to the recently shot buck. The other was decomposing and tangled in the other head's antlers. \"It's unclear exactly what circumstances led up to this buck's carrying around another set of antlers and part of a decomposing carcass. Regardless, it was truly a rare harvest,\" the Thursday post read.Hunter Bob Long of Marshall County, Kentucky, bagged the deer the previous weekend, the hunter told KFVS-TV, Cape Girardeau, Mo., .► Nov. 17: Reward offered after dolphin shot in 'brutal, senseless act of aggression'► Nov. 14: Airport security confiscates boy's stuffed animal snake► Sept. 24: Judge blocks planned fall hunting season for grizzly bearsSgt. Tony Dunker with Kentucky Fish and Wildlife told that he suspects the decaying head belonged to a deer who had been dead for weeks after locking antlers in a fight. Ballard County, where the deer was shot, is in far western Kentucky where Illinois and Missouri meet, about 30 miles southeast of Cape Girardeau.Dunker thinks that the bucks fought over territory or mates. After one died, its body decayed to the point where the head came loose, according to Dunker's account.\"He packed it around a little while until Mr. Long came along,\" Dunker said of the deer and the extra head. Residents in the area previously had spotted the buck alive with the decaying head in its antlers and taken pictures.Contributing: WHAS-TV, Louisville, Ky. Follow Joel Shannon on Twitter: @JoelShannon91 "}