{"id": "For this New York City Marathon rookie, race brings agony and a day to dream", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThere were a multitude of reasons why New York had to be the first marathon I tackled and most of them had to do with timing and sentiment.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    USA TODAY Sports' Paul Myerberg breaks down how Lelisa Desisa and Mary Keitany emerged victorious in the New York City Marathon.\n    USA TODAY SportsMartin Rogers crosses the finish line at the New York City Marathon on Nov. 4. It was his first 26.2-mile race.(Photo: Derik Hamilton, USA TODAY Sports)NEW YORK — The TCS New York Marathon is actually two races, the one for the elite professionals with their ludicrous split times and impossibly beautiful strides, and another for everyone else.Long, long after Mary Keitany and Lelisa Desisa clinched their respective victories on Sunday, a shambling wreck (me), staggered over the finish line in Central Park at a turtle’s pace.It was my first journey over the tortuous 26.2 miles, not just in New York but anywhere, and for the most part it was everything I dreamed it would be. That’s not to diminish it, on the contrary, it was the kind of feeling you get when your dreams come true.My time was horrible, more than half an hour later than my target after an inevitable encounter with the dreaded wall, but the experience was unforgettable.I’d fantasized about the extraordinary well-wishers across the five boroughs of this remarkable city, expected agonies both localized and mental that I’d never felt the like of, prepared for the emotion of seeing my parents and dear friends along the route and at the conclusion.Except one thing. My wife, the one person who I most wanted on hand for one of my life's unforgettable moments, was not there.There were a multitude of reasons why New York had to be the first marathon I tackled and most of them had to do with timing and sentiment. I turn 40 on Monday and the race always falls around my birthday, or sometimes on it. My wife and I decided where and when we’d get married on Nov. 5 six years ago. But, more than anything, it is a time that conjures the most conflicting of mixed emotions.On Nov. 6, 2013, our baby daughter Sophia was born after only 25 weeks pregnancy, and passed away the next day when her tiny lungs could not support her. This time of year is the toughest of all.I thought of her on the run, towards the humbling end, and I wish I could say it inspired me to a flurry of fresh energy. In reality, it simply got me to the finish line, when that outcome looked in doubt as I shuffled no quicker than a walk with a few miles remaining.I saw a couple of dear and cherished journalist friends along the way, and one more at the end, but the thing that truly moves you about this race is the pure humanity of complete strangers willing you on at virtually every turn. From the first steps off the Verrazzano Narrows bridge into Brooklyn, into Queens, across the treacherous Queensboro Bridge into the swarm of Manhattan crowds, amid the booming street parties of Harlem and finally down towards the most blessed rest ever.To be able to stop, or wobble to a stop, felt incredible. The only thing that could have made it better, was if my wife had been present.I wish she had been there, but I’m delighted she wasn’t. There was a good reason why, the best reason in the world, and the only one that would have kept her away. After five years of grieving and four years of trying, a strange thing happened over the summer. She was getting hungry more often, and began putting on weight. Fertility treatment hadn’t worked, but somehow, after we stopped IVF and when we least expected it, Carol is pregnant again. With a baby girl.When you lose a baby you don’t just lose a person, but it is the death of all the dreams you imagined and the memories that never happened except for in your mind’s eye.It feels OK to dream again now ... and during the 26.2 miles I did. I dreamed of what life with the baby will be like, and the thought that maybe, one day, we could run this infernal thing together.Oops, there it is, just hours after swearing to never run another one, New York has reeled me back in. What a magical race.Rogers finished his first New York City Marathon in 4:40:21. Follow him on Twitter @RogersJournoA link has been posted to your Facebook feed.  "}