{"id": "Gruden takes blame for Raiders' 4th down throwaway", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutOakland coach Jon Gruden said he should take the blame for Derek Carr's bewildering fourth-down throwaway that ended any slim chance of a Raiders comebackA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsOakland Raiders head coach Jon Gruden speaks at a news conference after an NFL football game against the Los Angeles Chargers in Oakland, Calif., Sunday, Nov. 11, 2018. (AP Photo/Ben Margot)(Photo: The Associated Press)ALAMEDA, Calif. (AP) — Oakland coach Jon Gruden said he should take the blame for Derek Carr's bewildering fourth-down throwaway that ended any slim chance of a Raiders comeback.Carr's decision to throw the ball at the feet of running back Jalen Richard when no one was open on a fourth-and-5 play in the fourth quarter of a 20-6 loss Sunday to the Los Angeles Chargers summed up Oakland's fifth straight loss.Carr rolled right on the play looking for Richard in the flat. But with Melvin Ingram chasing him, Carr just threw the ball away rather than give any of his receivers even a chance at making a play.\"It was a terrible call by me,\" Gruden said Monday. \"It was a design for Jalen Richard against man-to-man coverage. There wasn't a lot (Carr) could have done. He could have been Fran Tarkenton and done a 360 and reversed the field a few times. There wasn't much there. You got to credit the play caller with that outcome.\"The Raiders (1-8) were probably hurt more by another fourth-down call on the opening drive. Gruden decided to go for it from the 1 and used a play other teams had success running on the Chargers in the past.Receiver Dwayne Harris came across the formation to take a shovel pass from Carr, but was unable to get to the edge because of missed blocking assignments. Harris was stopped for no gain and the Raiders didn't get into the end zone.\"Once again, it was not a very good play call because it didn't work,\" Gruden said. \"A lot of people are running that play, as you know, in the tight red zone for obvious reasons. My first time using it wasn't a great experience.\"Very little has been great for the Raiders this season as they are off to the third-worst start in franchise history, trailing only the 0-10 mark in Carr's rookie season of 2014 and an 0-13 mark in 1962 — one year before Al Davis joined the franchise as coach and then owner.The stretch the Raiders are currently on is as bad as any they've had in 59 seasons as a professional team. They have lost five straight by at least 14 points for the first time ever and are one 14-point loss shy of tying the single-season record for the most by any team since the merger.Oakland has been outscored 75-9 in the past nine quarters and was held without a TD in consecutive games for the first time since 2012.\"I know it's dark right now,\" Gruden said. \"It's tough. It's tough on our fans. I thank our fans for showing up and being with us. We're going to bring this thing back. I've been a part of it before and we've got some great people to build around. We've got some resources to keep building. I'll leave it at that.\"The Raiders will go ahead with some key injuries at receiver with Martavis Bryant out with an injured PCL in his knee. Jordy Nelson also hurt his knee and his status for this week remains unknown. Oakland already traded away No. 1 receiver Amari Cooper, leaving Brandon LaFell and Seth Roberts as the team's top two options.Those injuries could lead to an opportunity for rookie Marcell Ateman, who was promoted from the practice squad last month but hasn't had a chance to play yet. Gruden also said he might bring in some receivers this week to try out.The Raiders won't be getting a boost from defensive tackle Eddie Vanderdoes, who was placed on season-ending injured reserve Monday when he was unable to come back from knee surgery. Vanderdoes tore his ACL in the final game of the 2017 season and began this year on the physically unable to perform list after a setback in training camp.He spent the past three weeks practicing but the team determined it was best to let him rest up for next year.\"We expected him to be ready in camp,\" Gruden said. \"I think right now it's not 100 percent. He hadn't had enough padded practices and been in the trenches enough to activate him, perhaps reinjuring that. I think it's the wise thing to do. We will try to move forward without him and get him healthy for next year.\"___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}