{"id": "The highest-paid TV actors in the world: 'Big Bang Theory' stars top list", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe four best-paid male stars on TV are on the top-rated comedy \"Big Bang Theory.\" \"Modern Family\" stars are other top earners, according to Forbes.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    These are the 10 most wanted actors right now.\n    USA TODAYThe actors on \"The Big Bang Theory\" top the Forbes list of best-paid TV stars.(Photo: AFP, Getty)It all started with a big bang and ended with a sizable paycheck.The stars of \"Big Bang Theory,\" a top-rated comedy with one season left, are the four best-paid men on the small screen, according to Forbes.Yes, they still are the best on the list despite the fact that their paychecks dropped a bit last year to boost their female co-stars' pay. They also negotiated a cut of the show's profits. More: Highest-paid actors in the world: George Clooney, Dwayne Johnson top 'Forbes' listThe Forbes ranking has changed slightly since last year. New to the list: Andrew Lincoln, the exiting lead of \"The Walking Dead.\" Off the list this year: Fired \"House of Cards\" actor Kevin Spacey, who is under investigation for sexual assault.Here's a look at the annual pay of top TV actors, with earnings estimated from June 1, 2017, through June 1, 2018:1. Jim Parsons\"Big Bang Theory\" star, 45, $26.5 million2. Johnny Galecki\"Big Bang Theory\" star, 43, $25 million3. Simon Helberg (tie)\"Big Bang Theory\" star, 37, $23.5 million3.  Kunal Nayyar (tie)\"Big Bang Theory\" star, 37, $23.5 million 5. Mark Harmon\"NCIS\" star, 67, $19 million6. Ed O'Neill\"Modern Family\" star, 72, $14 million7. Eric Stonestreet\"Modern Family\" star, 47, $13.5 million8. Jesse Tyler Ferguson\"Modern Family\" star, 43, $13 million9. Ty Burrell\"Modern Family\" star, 51, $12 million10. Andrew Lincoln\"Walking Dead\" star, 45, $11 millionMore: We did the math: The 10 most in-demand actors in Hollywood "}