{"id": "Puerto Rico proud: Cardinals star Molina wins Clemente Award", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutSt. Louis Cardinals catcher Yadier Molina has won the Roberto Clemente Award, a fitting honor for the star who grew up on Puerto Rico and idolized the island's late Hall of FamerA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsFILE - In this Tuesday, Sept. 4, 2018, file photo, St. Louis Cardinals' Yadier Molina, left, celebrates his grand slam with Yairo Munoz in the dugout during the ninth inning of a baseball game against the Washington Nationals, in Washington. Molina has won the Roberto Clemente Award, a fitting honor for the star who grew up on Puerto Rico and idolized the island's late Hall of Famer. It is given to the player who best represents Clemente's humanitarian efforts. Molina has worked hard to help Puerto Rico recover from the effects of Hurricane Maria last year. (AP Photo/Nick Wass, File)(Photo: The Associated Press)BOSTON (AP) — Many around Major League Baseball rallied to help Puerto Rico after it was ravaged by Hurricane Maria last year.The efforts of one native son were honored with an award named for the island's greatest player Wednesday.St. Louis Cardinals catcher Yadier Molina was named the recipient of the Roberto Clemente Award, a fitting recognition for the star who grew up on Puerto Rico and idolized the island's late Hall of Famer.Commissioner Rob Manfred and Clemente's widow, Vera Clemente, presented the award to members of Molina's family before Game 2 of the World Series. It is given annually to the player who best represents Clemente's humanitarian efforts.Molina wasn't on hand to receive the award himself because he is currently in Colombia, coaching Puerto Rico's under-23 national baseball team in the Baseball World Cup. Clemente also managed the national team while he was playing in the major leagues.Molina has worked tirelessly to help Puerto Rico recover from the effects of Maria last year.The 36-year-old Molina and his wife, Wanda, in 2010 created the Foundation4 (Fundacion4) to improve the lives of underprivileged children on the island who have been affected by poverty, abuse and cancer.\"What he represents for the whole country and for all of Latin America is the same spirit that dad had,\" Clemente's son, Luis, said of Molina. \"We're very proud to continue the Clemente legacy.\"Red Sox manager Alex Cora, who is from Caguas, Puerto Rico, greeted Molina's family during the award presentation and gave Vera Clemente flowers.Cora, who has also been a visual presence in the hurricane relief efforts back on his native island, said he is an admirer of the work Molina has done there in the aftermath of the storm.\"I call him the leader because he's the leader of our national team. He's the leader of the St. Louis Cardinals. And he's the leader on the field. But off the field, he became the leader last year,\" Cora said.\"Very proud of what he's done throughout his career. But I think last year was the highlight of his career.\"Molina is the third Puerto Rican-born player to win the award and fourth from the island. He joins Carlos Beltran (2013), Carlos Delgado (2006) and Edgar Martinez (2004).A nine-time All-Star, Molina is an eight-time Gold Glove Award winner and has spent all 15 of his big league seasons with the Cardinals.Clemente died on Dec. 31, 1972, when his airplane that was carrying supplies to earthquake victims in Nicaragua crashed after taking off from Puerto Rico.___More AP MLB: https://apnews.com/MLB and https://twitter.com/AP_SportsCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}