{"id": "Scuffling Baylor-Iowa St players to miss 1st half this week", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutIowa State running back David Montgomery and Baylor defensive end Greg Roberts will miss the first half of their teams' games this weekA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsIowa State running back David Montgomery, front left, runs the ball as he is tackled by Baylor linebacker Clay Johnston, right, during the first half of an NCAA college football game, Saturday, Nov. 10, 2018, in Ames. (AP Photo/Matthew Putney)(Photo: The Associated Press)Iowa State running back David Montgomery and Baylor defensive end Greg Roberts will miss the first half of their teams' games this week after the scuffle that led to their ejections in the second half of a testy game between the Cyclones and Bears.Cyclones coach Matt Campbell said Monday that his team wouldn't appeal the penalty against Montgomery, who retaliated with a swing after Roberts reached over an official to throw a punch at the running back in 18th-ranked Iowa State's 28-14 win Saturday.\"The reality is, it's an unfortunate situation,\" Campbell said. \"David is one of the great leaders of all time, and he responded to a negative situation. ... Nobody's more disappointed than David, but nobody has owned it as David.\"Montgomery, the second-leading rusher in the Big 12 at 96 yards per game, will miss the first half at No. 13 Texas in matchup of the two teams tied for third place in the Big 12, both a game behind co-leaders No. 6 Oklahoma and No. 7 West Virginia.Roberts will sit out the first half of Baylor's home finale Saturday against rival TCU.Baylor coach Matt Rhule said he had apologized to Campbell and Big 12 Commissioner Bob Bowlsby. Rhule described Roberts as \"extremely apologetic\" for what happened.\"The minute we decide to throw a punch it affects so many other people,\" Rhule said. \"That's what I told Greg.\"While the first-half suspensions for Montgomery and Roberts were automatic for fighting, Bears starting quarterback Charlie Brewer won't have to serve any further penalty after being ejected in the fourth quarter Saturday because of his unsportsmanlike conduct penalty.Brewer drew a flag when he said something to an official after being marked short of a first down at the end of a running play. His ejection was automatic because it was his second unsportsmanlike penalty — each player on both teams had been assessed one following the earlier melee.\"Charlie is a competitor and he is trying to get a first down and he has to watch the rest of the game from the locker room. That was tough enough for him,\" Rhule said. \"I think we have learned a lot of lessons from Saturday night and we will have to remember that going forward.\"The game Saturday took an ugly turn when Montgomery and Roberts briefly fought after things nearly came to blows when a previous play ended up spilling over onto Iowa State's bench. The teams nearly staged a full-on brawl during a wild incident that included Roberts slapping Montgomery on the helmet, and Montgomery responded with swings of his own.\"Certainly disappointed because that's not football,\" Campbell said. \"Who started it, who didn't start it, what the situation was, that's irrelevant at this point. ... There were some unfortunate times during that game where I think both teams, the cooler heads didn't prevail.\"___More AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}