{"id": "Raiders QB Derek Carr tries to ignore criticism", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutDerek Carr's No. 1 receiver has been traded just weeks after the Oakland Raiders dealt away another cornerstone player in Khalil MackA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsFILE - In this Oct. 14, 2018 file photo Oakland Raiders quarterback Derek Carr (4) listens during a news conference after an NFL football game against Seattle Seahawks at Wembley stadium in London. Carr's No. 1 receiver has been traded just weeks after the Raiders dealt away another cornerstone player in Khalil Mack. Carr has just one win, has struggled to adjust to coach Jon Gruden's offense and taken more of a physical beating than he has at any time during his five-year career. As if that wasn't enough, he also has had to deal with reports that unidentified teammates have lost faith in him and his toughness has been questioned. \"I don't pay that any mind,\" Carr said Wednesday, Oct. 24, 2018. (AP Photo/Matt Dunham, file)(Photo: The Associated Press)ALAMEDA, Calif. (AP) — Derek Carr's No. 1 receiver has been traded just weeks after the Oakland Raiders dealt away another cornerstone player in Khalil Mack. Carr has just one win, has struggled to adjust to coach Jon Gruden's offense and has taken more of a physical beating than he has at any time during his five-year career.As if that wasn't enough, he also has had to deal with reports that unidentified teammates have lost faith in him and his toughness has been questioned.\"I don't pay that any mind,\" Carr said Wednesday. \"Just go talk to those guys. If they don't want to put their name on it, I am going to leave it as what it is. It's nothing to me. If they want to come say it to my locker, I've had plenty of tough discussions standing right here with teammates. Those are some of the guys that texted me yesterday, saying, 'Don't worry about this bull.' That kind of stuff. I can't tell you how many texts I got from former teammates, teammates I have now and all of these things that when you're losing, (bad stuff) happens.\"Tight end Lee Smith gave a long statement defending Carr in what was otherwise a mostly empty locker room during the open media period. He called a recent report that the locker room is fractured over Carr \"comical and laughable\" and said Carr remains the leader of this team.Smith said it's a \"joke\" that Carr has to deal with this criticism, including that it looked like he was crying after injuring his left arm in a loss to Seattle in London on Oct. 14.\"He's a human being,\" Smith said. \"We're human beings. We're not robots. He has a 1-5 record as a starting quarterback for the Oakland Raiders. That's hard enough on him. Much less him worrying about his two sons happening to see an article that he's not tough. It's ridiculous. Of course it would bother him. He's human.\"Carr's play has also not lived up to expectations as he has been hurt by a banged-up offensive line that got him sacked six times in the loss to the Seahawks.Carr has thrown more interceptions (eight) than touchdown passes (seven) so far this season and was unable to get the ball downfield at all in the game against the Seahawks when he threw just one pass more than 10 yards downfield and gained 140 of his 142 yards after the catch.\"I think Carr is going to be fine,\" Gruden said. \"We have a lot of moving pieces now on offense. It's tough on a quarterback. In the first year of a system it's doubly tough. I'm going to keep supporting him. I know I believe in him. I know he's going to be a great player. You watch and see, he'll play just fine on Sunday.\"A season that began with optimism with the return of Gruden as coach has gone off the rails quickly. The team traded Mack to Chicago just over a week before the start of the season for a package of draft picks and then dealt Cooper to Dallas on Monday for another first-round pick.The trades give the Raiders three first-round picks in 2019 and two more the following year but none of that will help win games now for the players still here.The Raiders (1-5) have been outscored 53-13 in losing their past two games and have been accused of tanking the season because they traded Cooper and Mack.\"I feel like we've had to do this a couple of times in my early five years,\" Carr said. \"That part is hard. At the same time, it doesn't change my mindset, you guys know that. Good things, bad things, it doesn't change who I am and how I work. I still have a job to do. It's going to be harder without Coop, it's going to be harder without Khalil, we knew that. It's not going to make it easier, especially for us, for a quarterback and things like that. But that's no excuse. We need to go perform and we need to go win games and that's my mindset.\"NOTES: LG Kelechi Osemele has not returned to practice from a knee injury that has sidelined him the past two weeks and his status for this week remains in doubt. ... S Karl Joseph (hamstring), OL Jon Feliciano (ribs) and DL Frostee Rucker (neck) were all back on the practice field.___More AP NFL: https://apnews.com/tag/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}