{"id": "Warriors' Steph Curry on record pace again: Are 500 3s possible?", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutSteph Curry is on pace to shatter his record of 402 3-pointers, leaving observers to ponder a previously unthinkable number: Could he make 500 3s?A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs\n    The world famous Harlem Globetrotters dropped by Warriors practice to teach Steph Curry and Quinn Cook three-man weaves and 4-point shots.\n    USA TODAYSteph Curry is averaging 32.5 points and 5.9 3-pointers through 10 games.(Photo: Kyle Terada, USA TODAY Sports)With scoring numbers skyrocketing and 3s flying from everywhere on the court, perhaps no one is better equipped to take advantage of the NBA's new long-range era than the man who helped usher it in.Golden State Warriors star Steph Curry gave us a glimpse of where the league was headed in 2012-13 when he set a single-season record with 272 3-pointers. Three years later, he staked his claim as the greatest shooter ever when he made a stunning 402 3s.Curry has the record in sight again this season. Through 10 games, the two-time MVP has made 59 3s, putting him on pace for a staggering 484. Curry's eye-popping stats now have NBA observers pondering a number that was unthinkable as recently as a few years ago: Could he hit 500 3-pointers?MORE NBALAKERS: Maddening play continues in blowout loss vs. RaptorsPISTONS: Casey brought shooting offense, but Detroit can't shootTROLLING: Embiid mocks \"bum\" Drummond again after big game\"I've always said I want to continue to try to improve my shooting and get more efficient,\" Curry said last week after a win over the New Orleans Pelicans. \"Obviously a good start to that, but got to sustain it and stick to the program of what I've been doing.\"Curry has indeed improved his efficiency, and now in his 10th season, it's a major reason he's on record pace.Already a career 47.7% shooter overall and 43.6% from 3-point range coming into the season, Curry is hitting 53.9% overall and 50.9% from deep in 10 games. His effective shooting percentage, which accounts for 3s being worth more, is a career-high 68.2%. His true shooting percentage, a measure of efficiency that takes into account all shots, is a career-high 71.5%.Perhaps most impressive is that Curry's 3-point surge this season has not come at the expense of the Warriors' usual game plan. His usage rate is slightly higher than his career percentage but right in line with the past three seasons. Curry is attempting 11.6 3s per game and taking 56.3% of his shots overall from long range, but those numbers too are comparable to the last three years.So are 500 3-pointers really a possibility? It seems unlikely that even as great a shooter as Curry will continue to make over half his 3s, especially when he attempts such a high volume. However, it seems foolhardy to completely rule it out.The Warriors have admitted in recent years that they sometimes struggle to find motivation during the regular season. If Curry can bump up his 3-point rate to closer to 60% and continue shooting near 50% on those shots, the notion of 500 could start to look real. Then that could be the drive Curry needs to shoot for a nice, round, historic number.Follow Matt Eppers on Twitter @meppers_.A link has been posted to your Facebook feed.  "}