{"id": "Abey leads Navy past Tulsa 37-29", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutAbey leads Navy past Tulsa 37-29A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsTulsa quarterback Seth Boomer (12) pushes off Navy linebacker Nizaire Cromartie as he looks for a receiver in the first half of an NCAA college football game, Saturday, Nov. 17, 2018, in Annapolis, Md. (AP Photo/Patrick Semansky)(Photo: The Associated Press)ANNAPOLIS, Md. (AP) — Zach Abey ran for 128 yards with a pair of touchdowns and Navy snapped a seven-game losing streak with a 37-29 victory over Tulsa on Saturday.The teams entered the game tied for last in the West Division of the American Athletic Conference.The Midshipmen (3-8, 2-5 AAC) were able to distance themselves behind Abey, who was making his third straight start at quarterback and was effective running the triple-option attack.Navy amassed 389 yards on the ground and sent the Golden Hurricane (2-9, 1-6) to their ninth loss in 10 games.Navy slotback Malcolm Perry broke a 52-yard scamper early in third quarter that set up a short field goal by Bennett Moehring and increased its lead to 30-16. That run pushed Perry over 1,000 yards rushing for the second straight season.Navy fullback Mike Martin had a critical fumble that led to a 3-yard touchdown run by Tulsa running back Corey Taylor early in the fourth quarter. Midshipmen defensive end Jarvis Polu blocked the extra point to keep the deficit at eight points.Trey Walker answered on the ensuing possession when he took a pitch from Abey and ran 33 yards down the near sideline for a TD and a 37-22 lead.Tulsa showed some life on a Taylor's third touchdown of the game with 4:46 remaining. However, Navy picked up a couple of first downs to seal the win.Redshirt freshman quarterback Seth Boomer was 19 of 28 for 206 yards with an interception for Tulsa.Navy fullback Nelson Smith had a pair of first-half touchdowns that provided a 13-7 lead early in the second quarter.Navy linebacker Austin Talbert-Loving was penalized for targeting on a kickoff return early in the second quarter and was ejected.  Tulsa safety McKinley Winfield was called for the same infraction with just under 11 minutes left in the game.THE TAKEAWAYTulsa: The Golden Hurricane have played mostly tough this season, losing five games by nine points or less. Tulsa can continue to build around sophomore running backs Shamari Brooks and Taylor, both of whom have helped carry the offense this year.Navy: The Midshipmen have one more game to accrue added momentum before the regular-season finale against archrival Army on Dec. 8. Navy will face a stern challenge against the Black Knights, who are 9-2 and have won the past two meetings. A victory would help Navy salvage something from an overall disappointing season.UP NEXTTulsa: Closes out the regular season against SMU on Saturday.Navy: Travels to Tulane Saturday for the final conference game.___More AP college football: http://collegefootball.ap.org and http://www.twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}