{"id": "Huskers beat Minnesota 53-28 for 1st win under Scott Frost", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutNebraska survives nervous moments in 2nd half before beating Minnesota 53-28 for 1st win under FrostA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsNebraska quarterback Adrian Martinez (2) warms up before an NCAA college football game against Minnesota in Lincoln, Neb., Saturday, Oct. 20, 2018. (AP Photo/Nati Harnik)(Photo: The Associated Press)LINCOLN, Neb. (AP) — A bucket of sports drink having been just poured over his head, Scott Frost wrapped up a quick television interview near midfield and started sprinting off the field at Memorial Stadium.Moments after the clock hit zeroes on a 53-28 victory over Minnesota Saturday, it was time for him to soak it all in.As he ran through the end zone and entered the tunnel, Frost took off his cap and held it high to thank the fans who had waited seven games for the native son who won so many times as a player on this field to pick up his first win as coach.\"I just didn't expect it to be in October,\" Frost said. \"But we've got as good a fans as there are in the country. They're loyal. They're supportive. Our kids appreciate it them. They're fighting hard for them. Yeah, I almost teared up running off the field. That was a special moment.\"A week after squandering a late 10-point lead at Northwestern and losing in overtime, the Huskers (1-6, 1-4 Big Ten) scored on three of their first four possessions on their way to a 28-0 lead.Minnesota (3-4, 0-4) made things interesting, though, scoring on three possessions in a row spanning the halves, with backup quarterback Tanner Morgan replacing Zack Annexstad to open the third quarter and leading two straight touchdown drives to pull the Gophers to 28-22.\"That's how this whole year has been. We're going to have to play well for four quarters,\" Frost said. \"We're getting better every day. We're still not so good we can sleep on a lead or not play our best. So proud of this team. They could have quit a long time ago. They could have shut it down. This team every week does more of what we ask them, does it better, keeps getting better. That was a pretty good show out there today.\"Barrett Pickering kicked a field goal between Adrian Martinez's TD passes of 35 and 67 yards to Stanley Morgan Jr. to break things open again, and as the 365th home consecutive sellout crowd started sensing the end of the program-record 10-game losing streak, a chorus of \"Go Big Red\" chants began.Nebraska rushed for 383 yards and totaled 659. Devine Ozigbo ran for 152 yards, Martinez for 125 and Maurice Washington for 109.Martinez completed 25 of 29 passes adding up to 276 yards and three TDs. Stanley Morgan caught 10 balls for 163 yards, both career highs.Tanner Morgan was 11 of 16 for 214 yards and Annexstad 9 of 20 for 135. Gophers coach P.J. Fleck said Annextad had to leave the game because of an internal injury in his midsection. He was taken to a hospital for treatment.\"Congratulations to Coach Frost,\" Fleck said. \"It's a big deal, everybody remembers your first. This team should be 5-1 or 4-2.  We didn't stop them tonight at all. We didn't tackle well. We didn't set an edge.\"THE TAKEAWAYMinnesota: A quarterback controversy could be coming, if Annexstad is healthy enough to play next week. Tanner Morgan gave the Gophers a spark. The Minnesota defense had no answer for Martinez and Co., though.Nebraska: The defense's depth issue continues to show up in second halves. The Huskers seemed to tire for the second straight week. This team is much like Frost's teams at Central  Florida. It's all about the offense.HOLD OFF ON THE GATORADEFrost said his Gatorade shower was \"inappropriate,\" hinting that such high jinx should be reserved for championships.\"First of all, it was cold. I took it like a man,\" he said. \"I saw it coming, but I'm glad the guys are so excited. They deserve to be excited. There's going to be a day around here where we aren't celebrating one win, and we'll keep working toward it.\"CREATIVE PLAY CALLSFrost, who calls the offensive plays, dialed up two Statue of Liberty plays, with Washington gaining 17 yards on the first. He also had Washington throw a halfback pass, but the ball fell short of tight end Austin Allen.The Gophers used a flea-flicker on their second drive of the second half, with Tanner Morgan connecting with tight end Seth Green for 31 yards before Green took a snap out of the wildcat formation and ran in from 4 yards to cut it to 28-22.IBRAHIM HELD IN CHECKThe Gophers were without running back Shannon Brooks, who was arrested last weekend on suspicion of misdemeanor assault for an altercation with his male roommate. Brooks, who was medically cleared to play after rehabbing an offseason knee injury, didn't make the trip.Mohamed Ibrahim, who ran for 157 yards against Ohio State on Oct. 13, was limited to 49 yards on 18 carries.UP NEXTMinnesota hosts Indiana on Oct. 26.Nebraska hosts Bethune-Cookman on Oct. 27.___More AP college football: https://apnews.com/tag/Collegefootball and http://www.twitter.com/AP_Top25Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}