{"id": "Braves phenom Ronald Acuña Jr. named NL Rookie of the Year", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutThe Braves' Ronald Acuña Jr. was voted the NL Rookie of the Year, receiving more votes than the Nationals' Juan Soto and the Dodgers' Walker Buehler.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsRonald Acuna Jr. hit .293 with 26 home runs and a .917 on-base-plus-slugging percentage (OPS) during his rookie season.(Photo: Jason Getz, USA TODAY Sports)Believe the hype.Atlanta Braves phenom Ronald Acuña Jr., 20, was named the National League Rookie of the Year on Monday, receiving 27 of 30 first-place votes for 144 total points in voting conducted by the Baseball Writers' Association of America at the end of the regular season. In what was thought to be a close race with 19-year-old Juan Soto of the Washington Nationals, Acuña became the first Brave to win the honor since pitcher Craig Kimbrel in 2011.Soto tallied 89 points – and two first-place votes – followed by Los Angeles Dodgers pitcher Walker Buehler, who received 28 points and one first-place vote.“First of all, I would like to give thanks to God, my family, my parents and to all my teammates who’ve always supported me from the first day that I got the call to the big leagues,” Acuña said. “This award represents all our hard work as a team this season.”Expectations were high entering the 2018 season for Acuña, who led all rookies with 26 homers and hit .293 with a .917 on-base-plus-slugging percentage.Said Hall of Famer and Braves icon Chipper Jones of the outfielder at spring training: “He’s as good a prospect as I’ve seen.”Acuña debuted in the majors on April 25, but then missed a month of the season with a left knee injury he suffered on May 27. His season caught fire when Braves manager Brian Snitker – a candidate for NL Manager of the Year – moved him into the leadoff spot after the All-Star break. He hit .322 with a 1.028 OPS and 46 RBI from the top spot, and slugged eight leadoff home runs – including three consecutive – to set a franchise record. Acuña's second-half OPS (1.028) was third among players with at least 100 at-bats and is bested only by NL MVP candidate and Milwaukee Brewer Christian Yelich (1.219) and Los Angeles Dodger Justin Turner (1.066).Defensively, Acuña tied for 13th among outfielders in the NL in defensive runs saved (4). By comparison, Soto tied for 21st (-5), according to Fangraphs.Acuña's season was historic. He was the first rookie to lead a Braves team in home runs since 1943, when OF Chuck Workman hit 10 of the Boston Braves’ 39 home runs. He also became one of five players in major league history to reach 26 home runs in a season prior to his 21st birthday and is the 10th player in history to have 25 home runs and 15 steals in his rookie season and the first since Mike Trout in 2012.The Braves unexpected playoff run was sparked by his ascension to the leadoff spot. They faced a half-game deficit at the break and took over the NL East on Aug. 13, capturing their first division crown since 2013.2018 NL Jackie Robinson Rookie of the Year: Ronald Acuña Jr.Full voting details: https://t.co/01hgdeMZopSoto's rookie campaign was less on the radar. He led all NL rookies in on-base percentage (.406), OPS (.923) and walk rate (16 percent) despite starting the season with Class A Hagerstown (Md.). His 22 home runs tied Bryce Harper for the second-most ever by a teenager in the majors. Buehler may have been the Dodgers most consistent pitcher this season. He was 8-4 with a 2.31 ERA and 151 strikeouts over 23 starts.Follow Boeck on Twitter @scott_boeckA link has been posted to your Facebook feed.  "}