{"id": "Travelers have much to be thankful for this season", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutIn some ways, travel has never been safer, more affordable or more accessible. On the other hand, it's costly, fraught with hassles, and maddening.A link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsA link has been posted to your Facebook feed. Airport food continues to get better and healthier, with tasty options like The French Meadow Cafe and Bakery in Minneapolis - St. Paul International Airport.(Photo: NONE, GANNETT)Travelers have so much to be thankful for, right? Well, kind of. In some ways, travel has never been safer, more affordable or more accessible. But in other equally important ways, it's costly, fraught with hassles and maddening. And since it's that time of the year when people celebrate gratitude (Thanksgiving is Nov. 22,  but our neighbors in Canada already had theirs on Oct. 8), let's sort it all out.There's a lot to be grateful for, travelers say.Travel is safer, especially if you're flying. Last year was the safest on record for air travel. Many travelers told me they were thankful for that.Travel is also inexpensive. Complain all you want – and I know you will – but travel is dirt cheap. Even air travel, with its many fees, is relatively inexpensive (the average fare in 2017 was $340, down from $352 a decade before ). If you want to know what that means to you, check out the Bureau of Transportation Statistics site for the airport closest to you. And that's not all.\"I’m thankful for 20-cent beers in the Philippines, Myanmar, Vietnam, India, Nepal and Sri Lanka,\" world traveler and New York fireman Mike Biserta says. \"I’m thankful for samosas in India, spring rolls in Thailand, momos in Nepal, tajine in Morocco and hummus in Israel – all for under a dollar.\"Another reason to be grateful: You can go almost anywhere. With one or two notable exceptions, we have freedom of movement. For a list of countries you shouldn't visit, check the U.S. State Department website. Stay away from any country with a \"Level 4\" designation, the government's highest warning level. \"I'm grateful for U.S. citizenship, which allows me to travel to most countries without any visa issues,\" says Amber Bennett, a real estate agent from St. Petersburg, Florida.OK, call me a Grinch, but gratitude is not the only emotion travelers feel this holiday travel season. Anger is another. For example, I don't know anyone who is grateful to JetBlue Airways, which raised its baggage fees and expected its customers to be thankful. Why the increase? So the airline wouldn't have to raise fares amid higher fuel prices, according to CEO Robin Hayes. That makes some sense until you fast-forward to the next time fuel prices drop. Will JetBlue, and the other airlines that follow, lower their baggage fees? You can stop laughing now.It's also difficult to find anyone with a kind word to say about the Transportation Security Administration (TSA). The lines are long, and the complaints are many. Earlier this year, in an attempt to bring some sanity to the TSA lines, Congress passed the \"Pre-Check is Pre-Check Act\" that would ensure only travelers who have undergone background and security checks can use TSA’s Pre-Check lanes. Will that make security better? Don't hold your breath.\"I’m not grateful for unclear security checks,\" says Laura Torres, a blogger who is traveling around the world. Yeah, she and everyone else.For hotel guests, there's also the mandatory resort fee – sorry, make that the Daily Destination Fee. Overall, these extras have increased by almost 11 percent year over year, with the average resort fee now standing at around $21 a night, according to ResortFeeChecker.com, a site that tracks resort fees. No one liked these extras, which allegedly cover the cost of the exercise facility, use of the pool and \"free\" calls. But then a couple of hotels in New York got cute and decided to rename the resort fee a Daily Destination Fee. Consumer advocates say the fees, charged after you pay your room rate, are unfair, deceptive and should be illegal. Travelers would be grateful if hotels dropped these dreaded charges – or if the government required them to.This Thanksgiving, travelers have lot to be thankful for – and a lot not to be thankful for. But on balance, 2018 isn't such a bad year for us road warriors. Of course, the holiday travel season is just getting started. Ask me again in January.• Airport food: It's getting better. Sometimes, it's even worth the trip. \"I am especially grateful for prosciutto sandwiches in the Venice airport,\" says Ashley Rector, founder of Harness Magazine, a woman's magazine. \"They taste absolutely divine. Who would have thought airport food could be so good?\"• Sharing sites: What would we do without them? \"I'm grateful for Airbnb and Uber,\" says Tuanni Price, who writes a wine blog. \"They make it so easy. I can't imagine what people did before these companies.\" Well, they stayed in hotels and hailed taxis, but it was a lot more expensive and less interesting, that's for sure.• Wi-Fi on planes: It's practically on every flight – and now it also works. \"I'm grateful that now almost all planes have Wi-Fi,\" says McCall Renold, a business strategy consultant. \"It has gotten so much better than even a few years ago. Now airlines are letting you stream or message over Wi-Fi for free on your own devices, even without paying for the in-flight Wi-Fi.\"A link has been posted to your Facebook feed. Christopher Elliott is a consumer advocate. Contact him at chris@elliott.org or visit elliott.org."}