{"id": "With Cook back, Vikings ready to run as weather turns cold", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutWith Dalvin Cook back from injury, the Vikings are ready to run as the weather turns coldA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsFILE - At left, in an Oct. 7, 2018, file photo, Minnesota Vikings' Latavius Murray runs against the Philadelphia Eagles during an NFL football game, in Philadelphia. At right, in a Nov. 4, 2018, file photo, Minnesota Vikings running back Dalvin Cook (33) runs up field during a 70-yard run in the first half of an NFL football game against the Detroit Lions, in Minneapolis. Cook's 70-yard run in Minnesota's last game might have been the most important development of the season for the Vikings. Cook showed he's healthy. Murray helped keep Minnesota’s running game afloat when Cook was out with a hamstring injury, and the Vikings will be leaning on both of them down the stretch to make sure the ball is moving on the ground. (AP Photo/File)(Photo: The Associated Press)EAGAN, Minn. (AP) — Dalvin Cook's rush through the left side of the line for 70 yards last week was the longest gain of his professional career, an early game boost for the Minnesota Vikings in an important victory over Detroit before their bye.That was the type of big running play that has been missing in most of Minnesota's games this year, a 22.05 mph burst that was clocked by the NFL's Next Gen Stats as the fastest in the league in 2018.That also demonstrated what the Vikings will need more of down the stretch with a daunting schedule ahead.Cook's return from a hamstring injury that kept him out of five games was one of the most important developments of the season.\"When you go to the zoo and you want to see a white tiger and they say, 'He's not coming out today, you're disappointed and you're like, 'That's why I bought the ticket, to see the white tiger,\" quarterback Kirk Cousins said after the Vikings beat the Lions 24-9 on Nov. 4. \"That's Dalvin. When you get him, he's special.\"Though Latavius Murray has 439 total yards and five touchdowns over the past five games, Cook's return will be vital toward continuing the revival of a running game that ranks 28th in the league with an average of 91.7 yards per game.The Vikings (5-3-1) play at NFC North-leading Chicago (6-3) on Sunday night in a game for control of the division. That's one of three games over the next four for the Vikings that will be on the road and outdoors in northern cities.\"I do think with some of these games as it starts to get colder, it is going to be more of a factor,\" coach Mike Zimmer said. \"I think we're getting better at a lot of the areas in the running game. We have to continue searching for more ways to pound the ball.\"When Cook was healthy in the season opener against San Francisco, the Vikings had 116 rushing yards. They then went four straight games with fewer than 20 rushing attempts and 77 rushing yards or fewer, until Murray produced a 155-yard performance on 24 carries in a victory over Arizona on Oct. 14 .Cook and Murray combined for 120 rushing yards against the Lions. The Vikings have averaged 124 rushing yards over the past four games, up from 65.8 yards per game on the ground over the first five weeks.\"He has got a chance to hit home runs,\" Zimmer said of Cook. \"I think it was really good for him to get out there and get some game time action. When you haven't played in six weeks and you haven't practiced all that much, I think he will continue to get better.\"The Vikings also claimed running back Ameer Abdullah last week after he was waived by the Lions. Abdullah, a second-round draft pick in 2015, only appeared in three games this year and carried the ball once. He averaged 3.8 yards per attempt in three seasons as the primary ball carrier, when he wasn't injured, before being replaced by rookie Kerryon Johnson this season.\"I'm entering a backfield with a lot of talent, Dalvin, we have Latavius and all the guys who've been here,\" Abdullah said after practice on Monday. \"Just coming in today and seeing these guys welcome me the way they have has been amazing for me. It does a lot for my confidence. It does a lot for my focus.\"Abdullah will also be an option as a kickoff returner.\"I'm ready to work,\" he said. \"Anything the Vikings ask me to do, I'm willing to do just because I'm so appreciative of the opportunity.\"___More AP NFL coverage: https://apnews.com/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}