{"id": "Columbia consecutive winning years for 1st time since 1960s", "paragraph": "SettingsCancelSetHave an existing account?Already have a subscription?Don't have an account?Get the newsLet friends in your social network know what you are reading aboutFreshman Mike Roussos scored on an 87-yard kickoff return with 45 seconds left, giving Columbia a 24-41 win over Cornell on Saturday and consecutive winning seasons for the first time in 56 yearsA link has been sent to your friend's email address.A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQsNEW YORK (AP) — Freshman Mike Roussos scored on an 87-yard kickoff return with 45 seconds left, giving Columbia a 24-21 victory over Cornell on Saturday and consecutive winning seasons for the first time in 56 years.Columbia went 6-4 this year in its fourth season under coach Al Bagnoli after going 8-2 in 2017. The Lions were 6-3 in 1961, winning a share of their only Ivy League football title, and 5-4 the following year. Columbia's only seasons with winning records since have been 1971, 1994, 1996 and the last two seasons, and the Lions endured losing streaks of 44 games from 1983-88 and 24 games from 2012-15.Roussos also scored on a 91-yard punt return in the first quarter and Columbia rallied for a 24-21 victory over Cornell on Saturday. His second TD came just 13 seconds after Dalton Banks scored on a 2-yard run to give Cornell a 21-17 lead.The Lions (3-4 Ivy) took a 10-0 first-quarter lead on Chris Alleyne's 33-yard field goal and Roussos' long punt return. Harold Coles' 7-yard TD run late in the second quarter pulled the Big Red (3-7, 2-5) within 10-7 at halftime.Coles added a 31-yard TD run early in the fourth quarter to give Cornell a 14-10 lead. Ty Lenhart directed a 10-play, 75-yard drive — capped by Kyle Castner's scoring run from a yard out — to push Columbia back in front 17-14 with 6:46 remaining. After the Big Red forced a three-and-out, Dalton Banks hit Owen Peters for a 48-yard gain to the Lions' 29-yard line on first down and Banks capped the drive with his TD run for a 21-17 Cornell lead.Roussous' second special teams score of the day rescued the Lions.Banks completed 22 of 46 passes for 285 yards with an interception. Coles ran 21 times for 123 yards and two TDs and he caught seven passes for 86 yards.Columbia won despite gaining only 235 yards on offense to Cornell's 460.___More AP college football: https://apnews.com/CollegefootballCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}