{"id": "President Trump visits California wildfire zones", "paragraph": "Follow CNN politicsPresident Donald Trump has spent his Saturday in California, where he surveyed the destruction from the wildfires that have been raging across the state. Northern California's Camp Fire and the Woolsey Fire in the south have collectively burned more than 240,000 acres, killed at least 74 people, and more than 1,000 people are still missing. “Nobody thought this could happen,” Trump told reporters during one of his stops. He also said, after viewing the destruction, that his views on climate change had remained unchanged. Read more of CNN's coverage on California's fires here. From CNN's Jeremy DiamondPresident Donald Trump toured several devastated homes in Point Dume, Malibu, during his visit to California on Saturday. There, he spoke to reporters and addressed several topics, including the wildfires, the Thousand Oaks shooting nearby and the CIA assessment about Jamal Khashoggi’s death. From CNN's Jeremy Diamond and Teresita Galarce CrainAfter touring some of the fire damage in Northern California, President Donald Trump was asked whether seeing the devastation changed his opinion on climate change.Earlier at the center he was asked about the role of climate change in the recent California fires. He said, “Well I think we have a lot of factors. We have the management factor that I know Jerry has really been up on and very well and Gavin is going to -- were going to be looking at that together.”From CNN's Jeremy Diamond and Kevin BohnPresident Donald Trump toured some destroyed homes in Paradise, where the smell of smoke sat heavily in the air. The President toured the area with Paradise Mayor Jody Jones, California Gov. Jerry Brown, Lt. Gov. and Governor-elect Gavin Newsom and FEMA director Brock Long. The congressional delegation with the President also followed closely behind. The homes in the community the President toured are completely destroyed.Surrounded by fire damage, Trump told reporters it is “very sad to see it.”He said a lot of people are unaccounted for and “some areas are beyond this” in terms of damage.“Hopefully this is going to be the last one of these,” Trump said.Without explaining himself, the President said the floors of the forests need to be taken care of and again talked about time needed to be spent on raking and cleaning.From CNN's Jeremy DiamondPresident Donald Trump, who is in California to survey the fire recovery efforts, has arrived at a neighborhood in Paradise, California. The President is expected to walk around to see the damage caused by the Camp Fire, the deadliest wildfire in California history. As the motorcade neared arrival, destroyed homes became visible — some with the foundation still standing, others completely leveled. In areas where trees were still standing, there was a dark soot layering the ground. The President’s motorcade route was peppered with the usual sights of people on the side of the road, holding their phones up to catch a glimpse of the President, except for a key difference: Many of the onlookers were wearing air filtering masks because of the smoke clouding the air. Here's who is participating in Trump's visit, according to The White House: President Donald Trump has arrived in California, where Air Force One landed at Beale Air Force Base. From CNN's Jeremy DiamondWhite House press secretary Sarah Sanders confirmed that President Donald Trump spoke by phone aboard Air Force One on his way to California with Secretary of State Mike Pompeo and CIA Director Gina Haspel. Sanders declined to answer questions about whether the CIA assessed that the Saudi Crown Prince Mohammed bin Salman was responsible for the death of journalist Jamal Khashoggi, and referred the pool to the State Department. From CNN's Maegan VazquezInterior Secretary Ryan Zinke toured the Camp Fire burn area Wednesday and expressed solidarity with state officials.\"It's going to take working together from the community all the way up to federal government and making sure that we do active forest management, we prioritize infrastructure, public safety, the roads, evacuation, and work together as a team,\" Zinke said Thursday. A day earlier, at a briefing with California Gov. Jerry Brown, Zinke sidestepped questions about President Trump's earlier criticism of California's forest management and said the federal government and the state government are working together to fight the fires.In August, Trump caused confusion after he claimed that California's water, which could be used for firefighting, was instead \"being diverted into the Pacific Ocean.\" Following the tweet, Zinke wrote an op-ed calling for a more proactive approach to preventing wildfires. Zinke's spokeswoman, Heather Swift, said at the time that the department's practice is to not comment on Trump's tweets.From CNN's Amir VeraA week ago, President Donald Trump took to Twitter to blame \"gross mismanagement\" for the devastating California wildfires. The tweet sparked a backlash from top firefighters' associations, politicians and celebrities.Trump, in a series of tweets last Saturday, said the state's deadly wildfires are a result of poor forest management and threatened to cut federal aid. (He subsequently issued an emergency declaration and a major disaster declaration at the request of the state.)Why this matters: The tweet drew the ire of the leaders of firefighters' organizations, who accused the President of bringing politics into a devastating disaster.Brian K. Rice, president of the California Professional Firefighters, said the message is an attack on some of the people fighting the devastating fires.A number of celebrities also responded to Trump's tweet Saturday.\"This is an absolutely heartless response,\" singer Katy Perry tweeted. \"There aren't even politics involved. Just good American families losing their homes as you tweet, evacuating into shelters.\"Follow CNN politicsPlease enable JavaScript for a better experience."}