{"id": "How to Lock Down What Websites Can Access on Your ComputerHow to Lock Down What Websites Can Access on Your Computer", "paragraph": "As websites and web apps have grown in complexity, so have their demands: They want access to your webcam to make video calls, they want to know where in the world you are to serve up local information, and so on.In fact, websites now ask for almost as many permissions as the apps on your phone do, though you might not be as familiar with how to manage them. We'll show you how.We'll also explain how to restrict the cookies and other data websites can save locally on your laptop. It's up to you whether you let sites track your identity across the web to better personalize the ads you see, but you should know the options that are available.While access to your laptop's microphone or location is easy enough to understand, you might be less familiar with cookies, the name given to small bits of code that websites deposit on your computer.Essentially, cookies help sites recognize you when you visit again later, and remember your preferences. They can also be used to build up a profile of you and your online activity, which is why many people prefer to restrict their use, particularly when it comes to 'third-party' cookies—those that can track you across several websites, so advertisers know what you've been looking for on Google and on Amazon.You get to say whether cookies can be stored on your laptop, and it's really a question of privacy and convenience. You may not want an ad for that one parka you Googled to follow you everywhere, but you also may not want to set your location every time you open up your favorite weather site. Fortunately, most browsers give you pretty granular cookie controls, as detailed below.If Chrome is your browser of choice, click the icon to the left of the address bar on any website to see what it's allowed to do. The icon will usually be a padlock, indicating a secure site, but it might be a different icon, like an \"i\" symbol.Choose Site settings from the menu that appears, and you'll be greeted with a long list of access controls. These include location, camera, microphone, notifications, and sound, which dictates whether the site can start blaring out audio without your permission) To quickly put all these options back to their default state, click Reset permissions.Alternatively, you can adjust each option individually. Typically, you can allow or block access to a permission, or have the site ask for permission each time. Any changes you make are saved instantly, so you can close the tap and go back to browsing.You can edit individual cookie permissions by clicking Cookies on the same menu as Site settings. For easier control, choose Settings from the Chrome menu, then Advanced, then Cookies—you'll see separate options for blocking third-party cookies, and for stopping specific sites from leaving cookies.In Mozilla Firefox, site permissions are also accessed by clicking the icon to the left of the address bar—which again might be a padlock or a simple \"i\" symbol. If you see a permission you no longer want to grant, click the small cross next to it.For a more detailed look at the permissions you've given to sites, click the cog icon next to the Permissions heading. The next screen—also accessible through Options on the Firefox menu—lets you set access to the location, camera, microphone, and notifications. Click Settings to make any changes.From the dialog box that pops up—for location permissions, camera access, or whatever—you can remove websites one by one, or remove them all at once. It's also possible to block all future attempts to request a given permission using the tick box at the bottom. That means you can block all sites from accessing your laptop's webcam by default, rather than adjusting it on every single site you visit.Scroll up on the same Privacy & Security screen to accept or block cookies. You can either block only third-party cookies, or list exceptions—sites that can either always or never use cookies. Further down, you can enable Firefox's bespoke tracking protection tool to make it harder for companies to monitor your activities across multiple sites.Those of you who depend on Microsoft's Edge browser can check up on site permissions by clicking on the padlock or \"i\" symbol to the left of the address bar at the top—it's just the same as Chrome or Firefox. You can revoke any permissions that have already been granted can be by clicking the relevant toggle switch.For a more detailed review of a site's permissions, click Manage permissions from the drop-down menu. Choose a website from the list that appears, and you can toggle permissions like notifications, camera access, and access to the full screen mode on or off. To cancel all the permissions a site has, click Clear permissions.The same drop-down menu showing the Manage permissions option also has a Media autoplay settings link. Click it to control whether videos and audio can automatically start playing on this site, without any interaction from you.To control cookie use in Microsoft Edge, open the browser menu and choose Settings. Open the Privacy & security tab, and you can choose to block all cookies or only third-party cookies under the Cookies heading. There's an extra setting on the same screen for blocking pop-up advertisements.When it comes to Apple Safari on macOS, you can see the permissions a site currently has, and make changes to them, by opening the Safari menu and clicking Settings for This Website. You've got options for camera, location, and microphone access, for example, and a setting to block pop-up windows.To make changes, just hover over the relevant option to access the drop-down menu. For a more detailed look at these settings for all the websites you've visited in the past, choose Preferences from the Safari menu, then open the Websites tab. From here you can set global rules for websites, letting you block all sites from requesting access to your laptop's webcam, for instance.Switch to the Privacy tab of the Safari Preferences dialog, and you can take control over how sites can use cookies. The top option, Prevent cross-site tracking, blocks all third-party cookies, so your activities across different sites can't be tied together.Use the Block all cookies checkbox to stop all websites from saving all cookies, although this might prevent some sites from functioning correctly. More granular control is available via the Manage Website Data button: The subsequent dialog box lets you clear cookies from particular sites, or clear all the cookies that are saved on your laptop in one go.Thanks to an assist from Congress, your cable company has the legal right to sell your web-browsing data without your consent. This is how to protect your data from preying eyes.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}