{"id": "Regulatory Hackers Aren't Fixing Society. They're Getting RichRegulatory Hackers Aren't Fixing Society. They're Getting Rich", "paragraph": "Recently I was invited to join a panel to discuss Regulatory Hacking: A Playbook for Startups, a new book by venture capitalist Evan Burfield. The book is sort of a guide for new companies looking for a win-win—doing good by doing well—in highly regulated sectors like health and education. It argues that startups have the opportunity to make trillions of dollars solving global challenges that, in the past, would have been addressed by governments or nonprofits.Burfield sat at the center of our semicircle of five speakers, all female save for him. He's a large-framed, confidence-radiating man with a light English accent—an earlier generation might have called him \"clubbable.\" His message was one of intelligent cooperation by startups with government, He urged the small crowd of students to \"map power dynamics\" when they launch their businesses. The book's introduction says it \"provides a history of Elon Musk as the ultimate regulatory hacker,\" but Musk's name didn't come up—maybe because the Musk news of late hasn't been that adulatory.Susan Crawford (@scrawford) is an Ideas contributor for WIRED, a professor at Harvard Law School, and author of Captive Audience: The Telecom Industry and Monopoly Power in the New Gilded Age.The panel discussion took place on sunny afternoon, in a high-floor classroom that looked east over the towers of upper Manhattan. Burfield spoke easily and and length, and as he did I watched a large private helicopter loop lazily toward its landing pad by the East River.Once the event petered to a close, he ran off to catch a plane. He's a busy, successful person, a family man as well, with a daughter named Endeavour. (She makes an appearance in the first sentence of the book, asking Alexa to play a song for her.)Two other speakers on that panel were women with experience as New York City employees—one current, one former— who talked about weaving startups into the workings of government in various ways. They too were confident and competent, as was the woman entrepreneur who, with me, rounded out the panel. We were all appropriately deferential to Burfield; it was his book, after all. (The New York Times, in its review of Regulatory Hacking, called it \"chock-full of checklists, matrices, diagrams and jargon all of uneven usefulness.\")But the talk and the helicopter darkened my mood. It's tough to find moments of clarity in the calamitous, disorienting era we're in, but for me that afternoon stands out. Something was off.By temperament and by training, I am optimistic most of the time. In that room, though, I sensed the assumptions of our age operating in high, silent gear: Business is the most important agent of change in society; government exists to \"cooperate\" and is mostly incapable and toothless (while simultaneously, if ineptly, threatening); nothing is going to be done about the harrowing, multiple, structural unfairnesses of our time; women who want to survive and be invited to future panel discussions need to be appropriately deferential; and our destiny as a society is being charted by people who never use public transportation. Or fly commercial.I did speak up, politely, that afternoon. I said many things are profoundly wrong with the way we live in America, and that what we really need to do is make sure government has the capacity and resources to ensure—using technology as a tool, but mostly through sound policy—that everyone with a belly button can lead a thriving life. I urged the students in the audience to spend some time working in government themselves, so that they could see how many people at City Hall are doing their best against impossible odds. I smiled as I spoke; I don't like sounding like a crank. But it was both saddening and alarming.Luckily, someone seemingly at the very heart of the Aspen-Davos-Harvard win-win consensus has emerged with a terrific book that takes up many of these themes: Anand Giridharadas, with Winners Take All: The Elite Charade of Changing the World. Giridharadas' work gives me hope that we can start marking a cut in the continuous history we inhabit. We may be launching a new historical narrative.Giridharadas is an insider. He's been on the TED stage, at the Aspen Ideas Festival, at the Harvard Kennedy School. (Although I teach at Harvard, I've never met him.) And he, like me, is horrified by the blinkered, superficial, and self-serving rhetoric of the privileged class as it looks to avoid personal pain in a thoroughly unfair world.Giridharadas crisply categorizes the breathless rhetoric of individual startuppy idealism that rolls out from the stages of conferences on the social enterprise circuit. The language routinely used by startup leaders claiming to improve people’s lives—\"we will change the world!\"—masks a profound desire to avoid confrontation with the unfair and unequal status quo experienced by many Americans. The way things are, after all, is serving the interests of the well-born and well-connected.One jarring anecdote in Winners Take All has a budgeting startup called Even doing some user-centered-design-ish interviewing of a gig-economy worker, named Heather Jacobs. Jacobs is barely making it, panicked by a punishing commute, staggering student debt, and insecure work hours. The interviewer wants to make sure that Even will meet Jacob’s needs. Could a subscription app help smooth Heather's jagged paychecks, ensuring by automatic saving of excess incoming cash that she had enough money each month to cover her bills?\"If you asked the question, 'What is the best way to help Heather Jacobs?' the honest answer probably wouldn't be to charge her $260 a year to smooth her income,\" Giridharadas writes. He points out that you might, instead, try to fix the systems that are keeping Heather Jacobs poor—you would want to make sure that transit, affordable housing, and student loan assistance were part of the fabric of American life. But then you wouldn't have much of a startup.Giridharadas' message is that the world could be arranged in different ways. But no one in the well-connected world he documents is interested in that restructuring. The people Giridharadas writes about are looking to make a pile of money from doing good, assisted by thought leaders, most foundations, and a guileless, money-oriented public. They face little foundational, structural criticism; no one on the conference circuit wants to be a harsh critic or a genuine public intellectual. Who wants to attack the people who have flown you in to speak?Most of the time, we are ants crawling across a vast tablecloth, unaware of our context or our destiny. But right now things are off enough that we might want to raise our heads to look around. Hacking is not going to cut it.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}