{"id": "Space Photos of the Week: Ghost Nebula, Prepare to DieSpace Photos of the Week: Ghost Nebula, Prepare to Die", "paragraph": "There’s something haunting the Ghost Nebula, located just 1,500 light years from Earth. It’s being driven to extinction by a star called Gamma Cassiopeiae, several light years away. Ultraviolet radiation from that powerful star actually makes the Ghost Nebula emit hydrogen-alpha radiation, which appears in red. The result is that the nebula is being destroyed, and the nebula killer’s lust for dust isn’t done: Several other nebulas in the area are slowly being wiped out by Gamma Cassiopeiae.The European Space Agency's Mars Express orbiter photographed this region of the red planet called Greeley Crater, combining data collected over 16 Mars orbits. The tan flat surface seen here, scarred with so many craters of different sizes, indicates this Martian area has seen a lot of meteorite impacts.Galaxy NGC 5033, some 40 million light years away, seems similar to our own Milky Way in shape and size (about 100 million light years across), but differs in a few major ways. It has a very active galactic core, fueled by a supermassive black hole. This active nucleus means it’s classified as a Seyfert galaxy, and what we are seeing is the black hole devouring all the stars around it, causing the center to radiate in different wavelengths of the electromagnetic spectrum. Sadly, there’s nothing we can do for these stars; they’ve certainly been gobbled up by now, because their light took 40 million years to get to Hubble’s camera.Before we mosey from Mars, check out this false color mound captured by the ExoMars Trace Gas Orbiter’s Colour and Stereo Surface Imaging System, called CaSSIS. This mound is located in an area called Juventae Chasma—just north of Valles Marineris, also known as the Martian Grand Canyon. Scientists study mounds like these to learn how the sediment was laid down over time. If we can figure out the composition of the layers and how they are formed, then we’ll gain greater understanding about ancient activity in this region.Eat your heart out, Weather Channel: What we’re seeing is a cold front in space, in the galaxy cluster Perseus. This dance of galactic gas was caused by two galaxy clusters colliding with each other; the younger, colder region lies on the right, while the older gas departs the region on the left. When these astral bodies clash, their inner gas is shaken loose and expelled out into space. It is usually much colder than the rest of the galaxy, so the gas creates a cosmic cold front of galactic proportions. This incredible image was captured using three different x-ray observatories: NASA's Chandra, ESA's XMM-Newton, and the German Aerospace Centre-led ROSAT satellite.This swirling tempest was captured by NASA’s Juno spacecraftNASA some 32,000 miles above Jupiter’s clouds, and for astronomers, this type of clarity is like candy. No more hazy bands of atmosphere! Rich details like the anticyclone known as White Oval A5 are yet another testimonial to how Juno, now in its 15th science orbit of the gas giant, has revolutionized research on the gas giant.There’s something haunting the Ghost Nebula, located just 1,500 light years from Earth. It’s being driven to extinction by a star called Gamma Cassiopeiae, several light years away. Ultraviolet radiation from that powerful star actually makes the Ghost Nebula emit hydrogen-alpha radiation, which appears in red. The result is that the nebula is being destroyed, and the nebula killer’s lust for dust isn’t done: Several other nebulas in the area are slowly being wiped out by Gamma Cassiopeiae.The European Space Agency's Mars Express orbiter photographed this region of the red planet called Greeley Crater, combining data collected over 16 Mars orbits. The tan flat surface seen here, scarred with so many craters of different sizes, indicates this Martian area has seen a lot of meteorite impacts.Galaxy NGC 5033, some 40 million light years away, seems similar to our own Milky Way in shape and size (about 100 million light years across), but differs in a few major ways. It has a very active galactic core, fueled by a supermassive black hole. This active nucleus means it’s classified as a Seyfert galaxy, and what we are seeing is the black hole devouring all the stars around it, causing the center to radiate in different wavelengths of the electromagnetic spectrum. Sadly, there’s nothing we can do for these stars; they’ve certainly been gobbled up by now, because their light took 40 million years to get to Hubble’s camera.Before we mosey from Mars, check out this false color mound captured by the ExoMars Trace Gas Orbiter’s Colour and Stereo Surface Imaging System, called CaSSIS. This mound is located in an area called Juventae Chasma—just north of Valles Marineris, also known as the Martian Grand Canyon. Scientists study mounds like these to learn how the sediment was laid down over time. If we can figure out the composition of the layers and how they are formed, then we’ll gain greater understanding about ancient activity in this region.Eat your heart out, Weather Channel: What we’re seeing is a cold front in space, in the galaxy cluster Perseus. This dance of galactic gas was caused by two galaxy clusters colliding with each other; the younger, colder region lies on the right, while the older gas departs the region on the left. When these astral bodies clash, their inner gas is shaken loose and expelled out into space. It is usually much colder than the rest of the galaxy, so the gas creates a cosmic cold front of galactic proportions. This incredible image was captured using three different x-ray observatories: NASA's Chandra, ESA's XMM-Newton, and the German Aerospace Centre-led ROSAT satellite.This swirling tempest was captured by NASA’s Juno spacecraftNASA some 32,000 miles above Jupiter’s clouds, and for astronomers, this type of clarity is like candy. No more hazy bands of atmosphere! Rich details like the anticyclone known as White Oval A5 are yet another testimonial to how Juno, now in its 15th science orbit of the gas giant, has revolutionized research on the gas giant.Halloween has come and gone, but there’s no shortage of scary things—in space! The universe is enormous beyond comprehension, and airless and dark to boot.We’re going to look at its brighter side this week, starting with some scattered Martian craters and a strange mound of sediment located near the largest canyon on Mars, Valles Marineris. Next we’ll say hello to an anticyclone on Jupiter that the Juno spacecraft captured on its 15th pass around the planet.Then it’s fright night over at the Ghost Nebula. This behemoth of glowing gas and stars is minding its own business in space, but unfortunately a star six light years away is killing it with radiation. It may be the ultimate injustice that this cradle of baby stars is being snuffed out, but that’s life in cold outer space.After wishing the ghost a painless demise, check out a spiral galaxy called NGC 5033 that looks a lot like our own Milky Way. Except that something really spooky is happening at the center of this galaxy: A supermassive black hole is swallowing up all the stars.Do you find fulfillment in the emptiness of space? Check out Wired’s full photo collection here.The Insight Lander, developed by NASA's Jet Propulsion Laboratory, will probe deep beneath the surface of the Red Planet to measure temperatures and allow study of its seismic activity. Its name is short for Interior Exploration using Seismic Investigations, Geodesy and Heat Transport.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}