{"id": "How to Watch Apple's (Second!) Fall Hardware ShowHow to Watch Apple's (Second!) Fall Hardware Show", "paragraph": "Hungry for more Apple gear? You’re in luck. Following last month’s announcement of the new iPhones and Apple Watch, Apple is expected to unveil more hardware today at an event in New York City. Keep an eye out for new iPads, a new MacBook, and possibly a mention of AirPower, the wireless charging pad that Apple announced over a year ago. Here’s more of what you can expect at the event.Things kick off on Tuesday, October 30 at 10am ET (7am PT). The presentation will be streamed live from the Howard Gilman Opera House in Brooklyn, so you can catch the show without having to schlep yourself to the opera. You can also follow along with WIRED’s own Apple Event liveblog.You can watch the livestream straight from Apple’s website. You’ll need an iPhone, iPod, or iPod touch with Safari on iOS 9.0 or later. To watch on your desktop, make sure you’re using a Mac with Safari on OS X v10.11 or later, or a PC with Windows 7, 8, Or 10. For Windows 10, make sure you also have Microsoft Edge.You can also watch on your Apple TV. Just make sure that your Apple TV is 2nd generation or later, with the software 6.2 or later. You can also watch on your 4th generation or later Apple TV.We’ll also be blogging live from New York. Check out our liveblog, where we’ll spend the morning sharing updates, reflections, and witty zingers across both coasts.You can also follow along on Twitter, where we’ll be live-tweeting from @gadgetlab and @wired. Tune in to our Instagram account @wired, where our reporters will be sharing live updates in our Stories. Finally, our reporters will be offering live, hands-on analysis of any new devices that are announced. Watch the @wired Twitter feed to see those streams when they happen.Apple Chief Design Officer Jony Ive spoke with VOGUE Editor-in-Chief Anna Wintour as part of WIRED25, WIRED’s 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}