{"id": "Trump's Plan to Redefine Gender Makes No Scientific SenseTrump's Plan to Redefine Gender Makes No Scientific Sense", "paragraph": "What’s supposed to be simple is, you got a sperm and you got an egg—each one carrying roughly half the genes of the person who made it. They fuse. You get an embryo, and it’s destined to be male or female.So, not so simple.Sex (broadly, the biology of reproduction) and gender (broadly, one’s sense of self as masculine, feminine, neither, or both) fit neatly into precisely no strict definitions—unless, of course, you are making policy for the Trump Administration, which has for two years been trying to define gender identity out of civil rights protections. The binary distinction between two sexes that are also two genders has held throughout human history, goes this philosophy—a hard and fast (if that’s what you’re into) split.According to The New York Times this weekend, the US Department of Health and Human Services is planning on going even further. The agency is preparing a memo to be promulgated throughout the administration defining “sex” under Title IX, the civil rights law against gender discrimination in education, “on a biological basis that is clear, grounded in science, objective, and administratable.” Furthermore, the Times reported, that basis would be grounded in a person’s genitals at birth, with disputes resolved by genetic testing. “Sex means a person’s status as male or female based on immutable biological traits identifiable by or before birth,” the Times’ quote continued. “The sex listed on a person’s birth certificate, as originally issued, shall constitute definitive proof of a person’s sex unless rebutted by reliable genetic evidence.”It seems important to be clear at this juncture: That is not going to work. At all.Genes carried by a sperm and an egg are packaged into bundles called chromosomes, and depending on whether the sperm was ferrying one of a pair of chromosomes designated “X” or “Y,” the resulting embryo will develop with every cell carrying two Xs or an X and a Y. Generally—generally—XX means female, a woman, a vulva-and-ovaries-and-uterus haver. The XY means male, a penis-and-testes-and-prostate haver. It’s the circle of sex life.But a lot can happen on the road from embryogenesis to personhood. Sometimes the fusion of egg and sperm goes differently. People can be XXX, XXY, or XYY with no physiological indications. People can have some XX cells and some XY cells. Sometimes a person can be XX but have “male” physiognomy, or the other way ’round. Sometimes, to the tune of one in a hundred, a baby is born with genitalia that people in the room can’t agree on. In some cases physicians perform surgery on those children to assign a sex, and that sex doesn’t always align with how that person sees themself as an adult. The X chromosome has genes for making sperm! A gene called SRY triggers a complex developmental pathway that usually leads to a person being male, but not always! All sorts of nominal sex differences—size of various brain regions, hormone levels, socioemotional development, personality, affinities—work on average and fall apart upon closer statistical investigation. Basically no scientist who knows anything about this stuff subscribes to the idea of the strict “gender binary” anymore.Some adults—perhaps 2 million Americans, by one estimate—transition from one gender to another. Some adults feel altogether nonbinary, which is to say, they don’t identify as either fully masculine or feminine, completely apart from whatever their biology suggests.Are most people mostly one way? Sure. External genitals, internal genitals, sex chromosomes, ability to make a baby, levels of certain hormones—they’re all useful physiological markers of sex and gender, but they don’t say anything about social influences, and they ain’t the end of the story. “In a number of cases, these parameters are not going to be congruent with each other. They’re not going to be all male or all female,” says Eric Vilain, a pediatrician and geneticist at George Washington University who studies sex differentiation. “That’s the complexity of biology. There’s no one biological marker.” Sex and gender, am I right? We humans are blessed to live in a world of infinite variety.The Trump administration’s wish for scientific clarity is not going to come true. “What genetic test?” Vilain asks. “There is not one simple genetic test that says your sex is male or your sex is female.”Groups that represent trans people, nonbinary people, and intersex people immediately saw the problem. That new policy would expose them to even more harassment and discrimination than they already get, and essentially define them out of legal existence. It’s not the first attempt: The Trump administration withdrew an Obama-era guidance on the treatment of transgender students in school. The Department of Justice rescinded an earlier assessment that gender identity is covered under Title VII of the Civil Rights Act, which covers employment discrimination. Health and Human Services has indicated it wants to revise Section 1557, the civil rights piece of the Affordable Care Act. “What’s new about this memo is not only a reaffirmation of that position, but also the assertion that the government has the right to define what sex someone is based on narrow and constrained assessment that flies in the face of both the law and science about the nature of gender,” says Jocelyn Samuels, executive director of the Williams Institute at UCLA, which specializes in gender and the law. “It not only threatens transgender people but constitutes a real invasion of privacy for anyone.”A few states and cities have been trying to get out in front of this kind of redefinition. This year, New York City started allowing people to make a third choice other than “male” or “female” on their driver licenses, and adults or children with permission of their legal guardian can have their birth certificates revised to indicate the sex with which they identify rather than the one they were born with. “If someone has a birth certificate that has a gender marker not in harmony with how they’re presenting or how they identify, it outs them as trans to their employer, their health care provider,” says Ashe McGovern, director of the NYC Unity Project. Revising the birth certificate, they say, “gives trans and nonbinary people the autonomy and self-determination of when and how they come out to people who have significant control over their lives.”New York isn’t alone here. California, Maine, Oregon, Washington DC, and Washington State all have similar laws and protections against gender discrimination. Normally a change in federal policy wouldn’t preempt those laws—federal civil rights protections are typically considered to be a “floor” not a “ceiling” … unless the federal rules go totally in the other direction. Redefining gender identity as an unprotected category might constitute such a change. Nobody really knows yet. “Whether a court would say that a state law that allows people to change their birth certificates based on something other than their genitalia was more protective, I would argue that it was, but it might depend,” says Samuels, who used to run the US Department of Health and Human Services’ Office of Civil Rights.Similarly, nobody knows whether compelling a genetic test, arguably without consent, would be a violation of the US Constitution’s 4th amendment protections against illegal search and seizure. “That would take a hell of a lot more analysis and study, but it certainly raises serious red flags to think that the government would subject someone to a genetic test before they could assert their rights to be free from harassment in school,” Samuels says. “The notion that the government will dictate someone is what it says on their birth certificate unless they show genetic evidence to the contrary is unprecedented.”Samuels says that existing law and precedent all lean toward accepting that gender identity, including trans, nonbinary, and intersex, is a category that can be protected under laws against sex discrimination. One recent court case says otherwise—a 2017 ruling out of a federal court in Texas found that it was OK to discriminate against transgender people getting healthcare on religious grounds.In these kinds of situations, where it’s unclear how state and federal law should be reconciled, or whether a federal law is constitutional, recourse is generally the courts. That’s true, too, in all the other states that don’t have specific civil rights protections based on gender identity. And those courts are changing. President Trump has appointed more than 80 federal judges. At least one analysis suggests that newly seated Supreme Court Justice Brett Kavanaugh has little interest in expanding 4th Amendment protections.A spokesperson for the Department of Health and Human Services called the Times’ story “misleading” and emailed the following: “The Obama administration’s broad definition of ‘sex’ was enjoined by a federal court on a nationwide basis in December 2016 and the Obama administration did not appeal. That court found that the Obama administration regulation was overbroad and inconsistent with the text of the 1972 Title IX law prohibiting discrimination on the basis of sex. The court order remains in full force and effect today and HHS is bound by it as we continue to review the issue. Everyone deserves to be treated with respect and HHS’s Office for Civil Rights will continue to vigorously enforce all laws as written and passed by Congress, prohibiting discrimination in healthcare on the basis of race, color, religion, national origin, sex, age, and disability.”The unprecedented part of the change in policy that the Times covered and HHS denies, then, is how that memo talks about science. This administration seems awfully concerned with biology as it might apply to race and sex, and yet utterly unconcerned by how it applies to, for example, air and water pollution or how a warming planet affects living things.In fields as disparate as drug approvals, environmental regulations, or determinations of mining rights, various agencies have evinced a desire to use only rigorous science to set policy—but then largely ignored that science where it was available or insisted that the science was solid when it wasn’t. (A notable outlier here is climate change, where the administration denies good science is available even though it is.)Of course, I can think of one way to convince oneself that the gender binary is settled science: Categorize everyone outside those boundaries as having a disorder, either mental or physical. If only binary gender is normal, everything else is a disorder—something to be “fixed” with surgery or electroshock or, I don’t know, gene therapy. The Trump Administration’s efforts to make gender identity something totally cool to discriminate against are an attempt to use medical pseudoscience as a cudgel against autonomy. The postmodernists of the 1980s were wrong about a lot, but when they said “the political is personal,” this is what they meant: policy as literal bloodsport.And it’s fundamentally weird, isn’t it? All of us build multiple identities on the internet free of physical limitation. We get told (lie or not) that nothing bounds our personal potential except psychological freight. Except, no no no, the particular conformations of our bodies are, in fact, destiny—and not even our whole bodies, just the shapes of the parts between our legs and maybe our upper chest. If those are your politics, reproduction, sex, and gender may well seem quite simple, after all.Maybe you've heard of Crispr, the gene editing tool that could forever change life. So what is it and how does it work? Let us explain.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}