{"id": "These Wind Patterns Explain Why California's Wildfires Are So BadThese Wind Patterns Explain Why California's Wildfires Are So Bad", "paragraph": "Editor’s note: This is a developing story about California’s Camp Fire, Hill Fire, and Woolsey Fire. We will update it as more information becomes available.In California three major fires—the Camp Fire in the north and Hill Fire and Woolsey Fire in the south—continue to rage on a scale the state has never seen before. The Camp Fire in particular is 40 percent contained, yet it is already the most destructive and deadly wildfire in California history by far: It has virtually obliterated the 27,000-person town of Paradise, destroying almost 12,000 structures and killing at least 71. Over 1,000 people are still missing. Three people have been found dead in the Woolsey Fire.The driving force has been extreme wind—gusts of up to 60 miles per hour, perhaps even 70 in the hills of Southern California—blowing through the state. Wind further desiccates already dry vegetation and pushes the fires along with incredible speed. Like a demonic analog of water, this air is flowing across the state, nourishing flames and parching plants.The fire-fanning winds originate in the jet stream, a band of strong winds in the upper reaches of the atmosphere. The jet stream strengthens at this time of year, amplifying its natural meandering nature and creating troughs that move south through California, which you can see in the tweet below. That’s why all these fires popped up on either end of the state nearly simultaneously: They share a common origin in the jet stream.https://twitter.com/RobElvington/status/1061385865857949696When the air masses hit the Sierra Nevada Mountains in eastern California, they behave like water flowing over a rock in a stream. In fluid dynamics it’s known as a hydraulic jump—the water picks up speed as it cascades down the rock.Or in this case, air. “You get an enhancement of the wind and the momentum as it compresses,” says Nick Nauslar, a fire weather forecaster at NOAA. “As it gets compressed it expands and warms, and so you get a warming, a drying, and an enhancing of the wind speed.” That warm air moves across the ground and sucks the moisture out of already parched vegetation, making it that much easier for a spark to turn to flame.But how did the winds form in the first place? This comes back to the jet stream and the inland high-pressure regions it generated. Air generally moves from high to low pressure, and in this case the low-pressure area off the California coast pulls winds to the west. “The stronger the pressure gradient, the stronger your winds will be at the surface,” says Nauslar.To get a sense of the physics at play, picture a plastic bottle of water. “If you have a water bottle and you squeeze one side, applying more pressure, you're increasing the gradient of pressure from the back end to the front end, and the water squirts out,” says Nauslar. “Essentially you're propelling the air, or in this case water, forward at a faster rate.” Change the pressure gradient, and you change wind speed, which is why we’ve seen fluctuations rippling south through California like waves.High winds make the fires more dangerous by speeding them up and further drying out vegetation. (The tweet below shows just how quickly the winds can crater humidity and spike temperatures.) But it also makes firefighters’ jobs harder.https://twitter.com/NWSBayArea/status/1061657541501960195Firefighters on the ground have to keep their distance if the conflagration is moving too fast, or it will overwhelm them. Particularly high winds will either ground aircraft or mess with their accuracy when doing aerial drops of water or fire retardant. “It's not as impactful because the retardant gets spread out too far or it misses its area,” says Nauslar.Crews will still try drops if winds aren’t too high to fly aircraft, especially if there are structures or lives at risk. Indeed, helicopters have been dipping into Malibu mansions’ pools, despite the winds. The drops just might not be as effective as they would be in calmer conditions.https://twitter.com/NWSSacramento/status/1061398428587036673/Heavy gusts also drive smoke into communities downwind. This is a particular problem with the Camp Fire, which is perfectly positioned for winds coming from the northeast to blow the smoke into the Bay Area, 150 miles away, where air quality is now considered “very unhealthy.” (Down in Southern California, the fires are closer to the coast, so the winds are blowing the smoke out to sea, relieving inland communities.) The stuff is very, very bad for humans, especially young ones. The EPA’s air quality website, AirNow.gov, has been so overloaded with traffic that they’ve created a special streamlined version for California residents.https://twitter.com/RobElvington/status/1061349274984755200Even if the wind were to die down significantly, as it sometimes does at night (though not in the case of these fires—gusts waned, but still a wind of some sort is probably blowing), smoke problems are likely to persist. “You'll get what is called an inversion that begins to settle,” says Nauslar, a condition where hot air parks itself above cooler air. “It traps smoke at lower levels, and that's where you can really get some communities that are smoked in with some very unhealthy air quality, especially in areas that are directly downstream or in the vicinity of the fires.”The sad and horrifying reality is that this is the new California. In just the last year, the state has seen seven of the 20 most destructive fires in its history. The warmer the planet gets, the thirstier California’s atmosphere gets, the drier the vegetation gets, and the worse fires rage.Though the planet has only warmed by one-degree Celsius since the Industrial Revolution, climate change's effect on earth has been anything but subtle. Here are some of the most astonishing developments over the past few years.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}