{"id": "Where Did the 'Freedom From Facebook' Campaign Really Come From?Where Did the 'Freedom From Facebook' Campaign Really Come From?", "paragraph": "In July, executives from YouTube, Facebook, and Twitter testified before Congress about their company’s content moderation practices. While Facebook’s head of global policy Monika Bickert spoke, protesters from a group called Freedom From Facebook, seated just behind her, held signs depicting Sheryl Sandberg and Mark Zuckerberg’s heads atop an octopus whose tentacles reached around the planet.Freedom From Facebook has garnered renewed attention this week, after The New York Times revealed that Facebook employed an opposition firm called Definers to fight the group. Definers reportedly urged journalists to find links between Freedom From Facebook and billionaire philanthropist George Soros, a frequent target of far-right, anti-semitic conspiracy theories. That direct connection didn't materialize. But where Freedom From Facebook did come from—and how Facebook countered it—does illustrate how seemingly grassroots movements in Washington aren't always what they first appear.The point here isn't to question Freedom From Facebook's intentions. Their efforts seem to stem from genuine concern over Facebook's outsized role in the world. But the labyrinthine relationships and shadowy catalysts of the efforts on all sides of that debate show just how little involvement actual Facebook users have in the fight over reining the company in.\"I do think the Soros angle was surprising.\"Sarah Miller, Open Markets InstituteSince the 2016 presidential election, Facebook has confronted an onslaught of scandals, many of which drew scrutiny from federal lawmakers. First, Russian propagandists exploited the social network, using duplicitously bought ads to sway US voters. This March, journalists revealed data firm Cambridge Analytica had siphoned off information belonging to tens of millions of users. In the wake of this second controversy, Freedom From Facebook was born.The initiative wasn’t formed by everyday Facebook users. It’s instead the product of progressive groups with established records of opposing tech companies, whose own relationships illustrate just how tangled these connections can be.Specifically, Freedom From Facebook is an offshoot of the Open Markets Institute, a think tank that operated under the auspices of the New America Foundation until OMI head Barry Lynn publicly applauded antitrust fines levied against Google in Europe. Google is a major New America donor; Lynn's entire team studying tech market dominance and monopolies got the ax, and spun out Open Markets as an independent body.Earlier this year, former hedge fund executive David Magerman approached Lynn's group with the idea to start to start a campaign in opposition to Facebook. Magerman poured over $400,000 into what became Freedom From Facebook, according to Axios. His involvement wasn't known until Thursday. The connected between Freedom From Facebook and OMI was also not entirely explicit.Freedom From Facebook has done more than stage protests on Capitol Hill. During Facebook’s annual shareholder meeting in May, the group chartered an airplane to fly overhead with a banner that read “YOU BROKE DEMOCRACY.” When Sandberg spoke at MIT in June, Freedom From Facebook took out a full-page advertisement in the student newspaper calling for the social network to be broken up. On Thursday, the group filed a complaint with the Federal Trade Commission asking the agency to investigate a Facebook breach disclosed in September that affected 30 million user accounts.Freedom From Facebook also formed a coalition with a diverse set of progressive organizations, like Jewish Voice For Peace, which promotes peace in Israel and Palestine, and the Communications Workers of America, a labor union that represents media workers. The coalition now comprises 12 groups, who “all organize around this fundamental principle that Facebook is too powerful,” says Sarah Miller, the deputy director of Open Markets Institute. Confusingly, according to Freedom From Facebook’s website, the coalition also includes Citizens Against Monopoly, a nonprofit Miller says was set up by Open Markets itself.Eddie Vale, a progressive public affairs consultant, also confirmed in an email that Open Markets hired him to work on the Freedom For Facebook Initiative. He led the protest in July featuring the octopus signs.Definers began lobbying journalists, including those from WIRED, to look into Freedom From Facebook’s financial ties this past summer. The effort was led by Tim Miller, a former spokesperson for Jeb Bush and an independent public affairs consultant, according to The New York Times. “It matters because people should know whether FFF is a grassroots group as they claimed or something being run by professional Facebook critics,” Miller wrote in a blog post published Friday. He added that he believes the push to connect the group to Soros does not amount to anti-semitism, especially if it contains a modicum of truth. Facebook itself asserted much the same in a statement it released Thursday.The extent of the Soros relationship seems to be that the billionaire philanthropist does provide funding to both Open Markets and some of the progressive groups who constitute the Freedom From Facebook coalition. There's no indication, though, that he has any direct involvement with the initiative. Open Markets' Miller says the think tank wasn’t aware Facebook was paying an opposition firm to ask journalists to look into its work. “I just think knowing Facebook as we do, I don’t know that I would say that we were surprised, but I do think the Soros angle was surprising,” she says.Seemingly grassroots movements in Washington aren't always what they first appear.After The Times published its report Wednesday evening, Facebook severed its ties with Definers. “This type of firm might be normal in Washington, but it’s not the sort of thing I want Facebook associated with,” CEO Mark Zuckerberg said on a call with reporters Thursday. Both Sheryl Sandberg and Mark Zuckerberg claim they didn’t know Facebook was working with Definers until the The Times published its story. This is not the first time Facebook has employed an opposition research firm. In 2011, the social network hired a public relations firm to plant unflattering stories about Google’s user privacy practices.By distancing itself from Definers, Zuckerberg and Sandberg are putting space between themselves and how the sausage gets made in Washington. As they have grown more powerful, tech organizations including Facebook, but also Google, Amazon, and others, have poured millions into lobbying on Capitol Hill. Those efforts include fighting back against well-funded and sometimes secretive campaigns, like Freedom From Facebook. Meanwhile, the social network's over two billion users mostly sit on the sidelines, watching the high-stakes battle unfold.The only way to be truly secure on Facebook is to delete your account. But that's crazy talk! Here's how to lock down your privacy and security and bonus, keep targeted ads at bay.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}