{"id": "Russian Trolls Are Still Playing Both Sides—Even With the Mueller ProbeRussian Trolls Are Still Playing Both Sides—Even With the Mueller Probe", "paragraph": "On Friday afternoon, the Justice Department announced that Russia and the world’s most interesting catering company continue to attack the United States online—and that Russian Twitter trolls had even defended the efforts of special counsel Robert Mueller earlier this year.Prosecutors unsealed a September criminal complaint against Elena Alekseevna Khusyaynova, a 44-year-old Russian woman from St. Petersburg. According to the charges, Khusyaynova is employed by the Internet Research Agency, the “troll farm” directed by a Russian oligarch known as “Putin’s Cook,” Yevgeniy Viktorovich Prigozhin, and two companies he controls, Concord Management and Consulting LLC, and Concord Catering. Those companies, in addition to handling school lunches for Russian children and overseeing the Internet Research Agency, also reportedly supply mercenaries to support Russia’s interests in the Syrian civil war.According to the US government, Khusyaynova served as the chief accountant of “Project Lakhta,” the information influence operation funded by Prigozhin. She was charged with conspiracy to defraud the United States.The timing—coming on a Friday afternoon barely three weeks before the congressional midterm elections—underscored what US officials have hinted at in recent weeks, namely that foreign nation states continue to target US politics with so-called “information influence operations” aimed at exploiting partisan discord.“This case serves as a stark reminder to all Americans: Our foreign adversaries continue their efforts to interfere in our democracy by creating social and political division, spreading distrust in our political system, and advocating for the support or defeat of particular political candidates,” FBI Director Christopher Wray said in announcing the charges Friday.In a separate statement, the Office of Director of National Intelligence said it was “concerned about ongoing campaigns by Russia, China, and other foreign actors, including Iran, to undermine confidence in democratic institutions and influence public sentiment and government policies. These activities also may seek to influence voter perceptions and decision making in the 2018 and 2020 U. elections.” It was quick to note, too, though, the US “[does] not have any evidence of a compromise or disruption of infrastructure that would enable adversaries to prevent voting, change vote counts, or disrupt our ability to tally votes in the midterm elections.”\"The approach is the same, which is: Identify and infiltrate audiences on both the left and the right, and try to pit them against each other.\"Clint Watts, FPRINevertheless, the criminal complaint contains page after page of various online posts and memes purported to stem from the team at Project Lakhta, all aimed at inflaming American political debates. “The conspiracy allegedly used social media and other internet platforms to address a wide variety of topics, including immigration, gun control and the Second Amendment, the Confederate flag, race relations, LGBT issues, the Women’s March, and the NFL national anthem debate,” the government wrote. Russian trolls allegedly aim at specific events as well, including mass shootings in Las Vegas and Charleston, last summer's white nationalist gathering in Charlottesville, and various personnel and policy decisions by the Trump administration.The charges, though, made clear that Project Lakhta operatives were equal opportunity political opportunists—weighing in on both sides of political divisions and even, earlier this year, tweeting about Mueller’s indictment of their 13 IRA colleagues, writing, in part, “Still think this Russia thing is a hoax and a witch hunt? Because a lot of witches just got indicted.”In other tweets, the alleged Project Lahkta accounts actually urged people to protect Mueller; on December 16, 2017, the indictment says, a fake Twitter account called @KaniJJackson posted, “If Trump fires Robert Mueller, we have to take to the streets in protest. Our democracy is at stake.” A day later, another account egged Mueller on, saying, “Keep the implosion coming Mueller.”In the wake of the Florida mass shooting at Parkland High School, one of the Russian accounts even urged voters to turn against the GOP: “Vote them out in 2018!” A month later, that same account called for Donald Trump to win a Nobel Peace Prize for his North Korea outreach.Many of the efforts, the government says, were funneled through “sock puppet” Facebook accounts, with fake names like “Bertha Malone” and “Helen Christopherson,” and Twitter accounts like @CovfefeNationUS, which would post divisive content and even in some cases contact US political organizers with tips and proposals on events.“The volume [of Russian activity] isn’t the same as it was in 2016, but the approach is the same, which is: Identify and infiltrate audiences on both the left and the right, and try to pit them against each other across race, socioeconomic status, religion, any social issues,” says Clint Watts, distinguished fellow at the Foreign Policy Research Institute.The indictment also gave new insights into how Russia framed stories for maximum impact. Operatives were instructed to not to post stories from right-wing news site Breitbart to liberal pages, for instance; likewise they were to avoid linking to The New York Times from conservative accounts. They also received specific direction on how to frame certain stories and issues.“Brand McCain as an old geezer who has lost it and who long ago belonged in a home for the elderly. Emphasize that John McCain's pathological hatred towards Donald Trump and towards all his initiatives crosses all reasonable borders and limits,” one manager directed. Paul Ryan, similarly, was to be branded as a “complete and absolute nobody.”Project Lakhta operatives were equal opportunity political opportunists.As has become standard in cases surrounding the 2016 election attacks, the press release contained why might be called the “Donald Trump Deflect and Dismiss Clause,” going out of its way to point out that “the criminal complaint does not include any allegation that Khusyaynova or the broader conspiracy had any effect on the outcome of an election. The complaint also does not allege that any American knowingly participated in the Project Lakhta operation.” That language has been key to the White House’s ongoing dismissals of such charges as irrelevant to Trump’s campaign itself.Indeed, the charges, while unrelated to special counsel Robert Mueller’s ongoing probe, clearly overlap with Mueller’s earlier February indictment against the Internet Research Agency. In part, they appear to draw significantly from some of the same evidence Mueller cited, including especially detailed expense reports and financial accounting of Project Lahkta’s efforts.Throughout the 38-page, highly detailed complaint—one page longer even than Mueller’s original February indictment, which levied charges against 13 individuals and three companies, including Concord Catering—the surprise revelations raised almost as many questions as they answered, especially given their narrow targeting against a single individual. It’s not immediately clear, for instance, why Khusyaynova was left off the February indictment and instead only charged this month, given the evidence of her ongoing involvement with the Internet Research Agency since 2014.According to the court documents, Project Lakhta’s proposed operating budget—which covered operations beyond merely those targeted at the U.S.—totaled more than $35 million during the period January 2016 and June 2018, a number more expansive than earlier reporting. The court document also potentially points to relatively recent intelligence, information that might have gone beyond what was available to Mueller in February: During the first six months of this year, from January to June, the government says that Project Lakhta’s proposed operating budget totaled more than $10 million.The Justice Department and US government’s increasingly aggressive strategy of charging—naming and shaming—foreign government operatives targeting US companies and the election landscape is aimed both at raising public awareness, and making clear that Russia can’t act with impunity.“It does raise the cost of operations. It was super cheap to do this kind of influence; now they have to change their approach. They can’t make accounts and influence in the way that they did two years ago. What the US government is saying is, ‘We know what you were doing, here’s how much we know,’” Watts says. “The social media operations which were once easy, cost efficient, and efficient, are no longer that way. The cost to do that has gone up, and public awareness in the US has gone up dramatically. Everyone suspects that they’re looking at a bot all the time.”Additional reporting by Brian Barrett.Garrett M. Graff (@vermontgmg) is a contributing editor for WIRED and the co-author of Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat. He can be reached at garrett.graff@gmail.com.In the aftermath of the US elections, documentary photographer Guy Martin travelled to Veles, Macedonia to find out why this small town became the heart of the fake news scandal. These are the photos he took.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}