{"id": "IBM’s Call for Code Prize Goes to a Team With ‘Clusterducks’IBM’s Call for Code Prize Goes to a Team With ‘Clusterducks’", "paragraph": "You know when you try to go online at a Starbucks or on an airplane, first you get a little popup that asks you to accept some terms before you can get to the internet? That popup window exists in a sort of netherworld between actual internet connection and being offline–you pick it up via Wi-Fi, but until you click a box, you’re not actually online. A team of five developers realized in that gray area was potentially a huge opportunity to save lives.It’s an intractable problem during natural disasters: telecommunications networks and power grids are often damaged or overwhelmed; without them, first responders struggle to help survivors, coordinate evacuations, and even count the dead. Project Owl proposes an elegant solution: an AI-powered disaster coordination platform paired with a robust communication network that can reach people even when other connections are down. The key to making it all work? Those popup windows, which the team can beam out to people in hard-to-reach areas via buoys equipped with a low-frequency Wi-Fi network.Now Project Owl has won IBM’s first ever Call for Code contest, which challenged developers across the world to build disaster relief technology using IBM and open-source software. More than 100,000 developers from 156 countries participated in the contest. A panel of judges including former President Bill Clinton selected Project Owl from a field of five finalists whose solutions ranged from using AI to speed up the rebuilding process after an earthquake to feeding firefighters live data during wildfires via sensors.The winners were announced at an awards ceremony in San Francisco Monday night. The grand prize includes $200,000 and IBM’s pledge to help the team make their project a reality.Project Owl makes the most of very low-frequency connectivity to provide a lifeline to those who would have otherwise been cut off.“The most important thing to me will be to deploy this for real,” says Angel Diaz, IBM’s Vice President of Developer Technology, Open Source & Advocacy, who was a leading force behind Call for Code. “Usually these hacks will be one and done, but no, we are going to make this real. We are going to deploy this.” In fact, the top 10 finalists will all have their projects officially sanctioned by the Linux Foundation.After announcing the challenge in May, IBM hosted more than 300 hackathons and events in 50 cities across the globe, and offered its technology for free to all participating teams. Developers were also encouraged to use whatever existing technology they could find; the only requirement was that their creations work. “It has to be real, it has to work, because we're going to take this into production. We're not running a fantasy,” Diaz says.Project Owl hopes to have their solution ready to help in hurricanes, floods, and fires by the end of the year.When the Project Owl teammates—developers Charlie Evans, Taraqur Rahman, Nick Feuer, Bryan Knouse, and Magus Pereira—accepted their prize on Monday night, many of them were seeing one another face to face for the first time. They live spread out around America, from North Carolina to Texas to New York. Most had only met on the Slack channel IBM set up for the contest.The idea for Project Owl's hardware originated with Pereira, a recent graduate from East Carolina University in Greenville, North Carolina. Pereira explained an idea he’d had—one which had previously won him a competition at his university.“Since I’m in the Carolinas, we get a ton of hurricanes. A few years ago we had a hackathon to come up with a solution to help the community,” Pereira says. “For some reason I was just thinking about communication and I had buoys in my mind.” He created the “clusterduck,” a buoy with internet-of-things-type low-frequency connectivity that could form an ad-hoc communication network in areas hit hard by natural disaster.Together Project Owl made the clusterducks real, and created a software platform around them to allow civilians to communicate with first responders in real time. The hardware/software solution works by harnessing low-power, long-range radio frequency called LoRa, the same technology that powers most internet of things devices. By combining LoRa units with Wi-Fi routers in waterproof buoys placed throughout a disaster area, Project Owl creates a network that can link back with any rescue operation running the Owl software. If you’re in an area with no internet or cellular service and you turn on your Wi-Fi, you’ll see Project Owl in the list of available networks. Click on it, and you’ll get that familiar Starbucks-like popup. But instead of asking you to agree to terms of service, it asks for crucial information like your name, location, how you are doing, what services you need, whether you need immediate assistance or for first responders to call family and friends to update them on your condition.The team built the custom Owl software in four months.  So far, they have tested it with EMS and government responders in simulated environments. It has not yet been used in an actual emergency. People in a disaster area with a Project Owl network will also need to pull up their Wi-Fi settings and select the correct network themselves; the popup won’t be available if people just try to connect to cellular service.Still, the combination of a Wi-Fi popup with LoRa connectivity is an innovative idea. It allows you to use whatever device you already own to get onto an ad-hoc emergency communication network, without even having to click on a link or download an app, both of which are often impossible without a robust internet connection. Project Owl makes the most of very low-frequency connectivity to provide a lifeline to those who would have otherwise been cut off.The clusterducks are also not very expensive to make—about $38 each, according to the developers. To cover a metropolitan area like San Juan, Puerto Rico, which is 77 square miles, Knouse says, would require a few hundred clusterducks, for a total cost of approximately $12,000. The idea would be to roll out clusterducks in hurricane- or flood-prone areas, so that they can be easily deployed when a disaster actually strikes. Relying on solar panels and battery packs, the clusterducks network could be turned on the moment they are needed and work off the grid. They could also be sent into a hard-hit area after the fact.The Owl software can be used with or without the clusterduck networks. “The software itself is an incident management system. One of the things that makes it so great and useful is that you just talk to it. It’s a conversational experience,” says Knouse, who calls it a souped-up chatbot that uses just about every single IBM Watson API, as well as a custom natural-language AI. Owl stands for \"Organization, Whereabouts, and Logistics.\" First responders can coordinate from the Owl application, setting up incident zones, accessing data from FEMA and the Red Cross, as well as crowdsourced user data. People can text or call the Owl management system, or type into it directly from a computer or phone.Technology, Silicon Valley denizens have often insisted, can save the world. But recent years have given rise to a growing realization that technology is not good by default, that it can break things as much as it can fix them. IBM’s facial recognition technology, for example, has come under increased scrutiny, and the company is currently facing a class-action lawsuit for age discrimination.Call for Code is not an explicit attempt at making amends for any past wrongs, at least not according to its organizers. But the contest, and the enthusiastic response from more than 100,000 developers, comes amidst a wider tech backlash, and at least some self-examination from major tech companies and the people they employ.When Alexander Gil Fuentes, the digital scholarship librarian at Columbia University, reached out to big tech companies like Microsoft and Google for partnerships after Hurricane Maria hit Puerto Rico, none of them were interested in helping with mapathons to help people on the ground have accurate maps.“We thought it would be an easy sell—tech workers taking two hours to work on helping the Red Cross would improve staff morale, we thought. Alas, none of the companies bought it, and only universities stepped up to the plate,” Gil says.That was a year ago. To Gil, Call for Code and similar hackathons for good, like the Mozilla Challenge, show the winds may be changing.On Monday, Google announced it will grant $25 million next year to projects that “use AI to help address some of the world’s greatest social, humanitarian and environmental problems.” The company has recently come under fire for its privacy practices and its plans for a censored search engine in China. Microsoft, which faced an internal revolt for its work with ICE this summer, announced a $40 million program called AI for Humanitarian Action last month. And so on.With IBM, meanwhile, the Project Owl team is busy preparing to get their solution to market and figuring out the how to turn the project into an actual business. They envision some kind of model, where Project Owl manufactures the clusterducks and sells them to an organization like FEMA, and then FEMA can rent them out to municipalities on an as-needed basis.“It started as a discussion between us and the United Nations and the Linux Foundation,” says IBM’s Diaz. “The hope is that at the end of the day, when we put the winning solution into market, into Africa, India, the US or wherever it’s applicable, when we save one life, ten lives, 100 lives, if we save one life then this entire effort is worth it.”Author Anand Giridharadas has penned sharp appraisals of Silicon Valley's benevolent titans and their technocratic solutionism. At WIRED25, he spoke with WIRED's Virginia Heffernan about the colliding forces that challenge a default optimism when it comes to technology. This event was part of WIRED's 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}