{"id": "When the Baby in Family Photos Is Actually Made of Silicone", "paragraph": "Photographer Lena Kunz's series Artificial Reality studies the culture and phenomenon of Reborns, lifelike dolls made out of silicone or vinyl.Kunz describes Artificial Reality as an “emotional futuristic series.” Her portraits, shot with a Hasselblad 500cm medium format camera, explore intimate moments of tenderness and joy, challenging societal perceptions of what motherhood should look like.Some Reborns come with special parts to make them more lifelike. Dolls can have a heartbeat module or contraption that makes them breathe when you touch them. Others coo or giggle. One model can wrap its fingers around different small objects.Many Reborn collectors--also known as Reborners--treat their dolls like children with regular feeding schedules, playtimes, stroller walks, and bedtime routines.Kunz considers Reborns to be empowering devices that encourages individual emotional expression. \"[Reborners] are open about their feelings, their needs, their wishes...They encounter a lot of rejection and discomfort from society. [Reborns] are really good for them.\"Many Reborners already have children. While there are a few men who are Reborners, the majority are female.Reborns either come pre-scented or with a bottle of perfume (for that newborn smell).Many Reborners are active on Reborn Facebook pages, private groups designated by region. Members use the group to sell dolls, meet other Reborners, and give advice.Reborns are also popular on YouTube. A quick search can reveal thousands of videos (with millions of views) of Reborners showing off their latest baby gear or taking viewers through daily routines with their dolls.Reborns typically have mohair, although some collectors will pay extra for human hair. The hair is rooted to the head strand by strand, a process that can take up to 30 hours.Reborns are sometimes used for therapeutic purposes, for example in the event of a death or to fill the void when a child leave the home. In this case, collectors will often provide the photograph of a live child to a Reborn artist in efforts to create a replica.Reborn artists often share their work on Instagram. Popular artist Romie Strydom usually sells her Reborns for well over $5,000.Careful to avoid any voyeuristic shots, Kunz was selective about the photos she selected for her project. “You could easily take ‘WTF' pictures with a flash,\" Kunz says, \"but I was careful. I picked shots where I think [the Reborners] look good. That’s really important to me because I don’t want to make a show.”When traveling, some Reborners are known to buy their Reborn its own seat on the plane as an alternative to putting the doll in their luggage.Lena Kunz takes pictures of women and their babies. Her latest series, ‘Artificial Reality,’ captures stroller walks, late-night feedings, and endless diaper changes. The really good stuff is in there too, from meeting the siblings to playtime to those adorable toothless smiles. There’s just one thing about the infants Kunz photographs: They’re made out of silicone.The Secret Tools Magicians Use to Fool YouThese Images Are Not a Horror Movie Gone WrongMeet the Badass, Costumed Motorbike Taxi Drivers of NairobiReborns–lifelike baby dolls–are an international phenomenon. They first popped up in the US, and then crossed the pond to the UK, Asia, and, more recently, rural Germany where Kunz, a Berlin-based photographer, focuses her series. The dolls’ silicone or vinyl bodies often begin as So Truly Real dolls, a collection by doll distributor Ashton Drake Galleries. They're later given an infant's likeness, or “reborn,” by an artist, sometimes using a live baby’s photo for creative reference. Reborn collectors (aka \"Reborners\") typically pay a few hundred dollars for high-end dolls, but it's not uncommon to see Reborns sold for well over a grand. In 2012, the Joelle doll by prominent Reborn artist Romie Strydom sold on eBay for $22,600.Reborns have options. Pick from hand-rooted mohair or human hair (for a premium), bluish veins, wrinkled fingers, and a speckled rosy newborn rash. The dolls can be toddler-sized–like Isabella, who can grasp your fingers with her wee hand–or teeny tiny like Sky, a premature baby with faint jaundice. Some dolls come pre-scented or with a bottle of baby perfume for that newborn smell. Reborns either arrive with a name or are named later upon “adoption.” But they’re always named.And Reborners themselves? Just like their dolls, they come in a diverse array. “I know one mother who bought her doll its own plane seat for a vacation to Mexico,” Kunz said. Some collectors purchase Reborns for therapeutic purposes, for example to hold after losing a child or to help cope with psychological issues. Others are more interested in the sport of collecting. And a handful just don’t feel...a spark. Kunz has seen posts on eBay or Facebook from women trying to sell their doll, saying “they aren’t getting along with their babies.\" But mostly, people buy Reborns because they make them feel good.On the web, they're everywhere. Reborn Facebook groups garner thousands of members who are all deeply immersed in the economy, care, and culture of realistic dolls. Collectors on YouTube show millions of subscribers their morning baby routine ideas, fastidious Reborn unboxing, and tips for how to pose dolls for the most realistic Instagram shot. The Reborn community also extends IRL through meet-up groups and events like the Rose Doll Show, the ultimate expo for all things Reborn.Kunz describes ‘Artificial Reality’ as an “emotional futuristic series.”  She first discovered Reborns through a friend's mother, a Reborner, who introduced her to other collectors. After spending time with the community, Kunz soon felt it was her obligation to help reduce the stigmatization of Reborners through her work. But she had to be careful not to photograph Reborners in a voyeuristic way. “You could easily take ‘WTF' pictures with a flash, but I was careful,\" says Kunz. \"I picked the shots where I think they look good. That’s really important to me because I don’t want to make a show.” Her portraits, shot with a Hasselblad 500cm medium format camera, explore intimate moments of tenderness and joy, challenging societal perceptions of what motherhood should look like. A little less conventional, a little more dystopian Madonna and Child.But that’s not to say everyone sees Reborns the same way. Like all things niche that dribble onto the internet and become a torrent, there’s plenty of pushback. Steve Patsy of The Patsy Family, a popular YouTube channel for Reborners, is careful to filter any insensitive or threatening language that’s posted on his family’s videos. In part, it’s to protect his ten-year-old daughter Madison, a Reborner celebrity in her own right. “There are people out there that think that Reborns are weird, that we’re up to some nefarious stuff with these dolls,” Patsy says, “[They] need to reevaluate. It’s a nurturing thing that people that want to do.”Reborners also just want to be honest. “They're are open about their feelings, their needs, their wishes,\" Kunz says. \"Owning a Reborn is an act of empowerment.\" And in a way, Reborns are just another device–like cryogenic egg freezing or advancements in birth control options–that’s allowing greater autonomy to parents. You can decide to have a baby now or later. You can pickup your Reborn today or not. Family planning no longer needs to be a Darwinian, biological clock-ruling decision. It just depends if you’re willing to play along.Artist Justin Guariglia uses a high-tech printer to create art that documents Earth's melting glaciers.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}