{"id": "Apple Will Keep Throttling iPhones With Old Batteries. Here's How to Stop ItApple Will Keep Throttling iPhones With Old Batteries. Here's How to Stop It", "paragraph": "Last year, controversy stirred as Apple acknowledged that it had, in fact, purposefully inhibited iPhone performance when the battery neared the end of its useful life. The good news: It wasn’t just in your head! The less-good news: Apple will continue the practice with the iPhone 8, 8 Plus, and X.While reports of the throttling first surfaced last December, Apple said it had started the practice in 2016 as a way to elongate the lives of iPhones. As a lithium-ion battery degrades over time, cold weather or high current demands can lead to a device shutting down altogether. Apple pushed a software update intended to keep iPhones from sporadically turning off, by limiting how much strain they could put on the battery in the first place.In doing so, though, Apple also forgot the important step of making it extremely clear to tens of millions of iPhone owners that an invisible boot would slam on the brakes as the battery aged. It further neglected to give those iPhone owners the option to turn that throttling off, in the event that they wanted the phone that they bought to work at the speeds they expected, regardless of the tradeoffs. And it apparently hadn’t considered that the solution to an old battery might just be a new one.After an uproar, Apple did eventually address those concerns. It instituted a battery replacement program; the price of a new battery for an iPhone 6 or later dropped from $79 to $29, even if you’re out of warranty. And in iOS 11.3, released in March, Apple included the option turn off what it calls “peak performance capability,” a delightful euphemism for throttling.At around the same time, as The Verge notes, Apple also indicated to Congress that the iPhone 8, 8 Plus, and X \"include hardware updates that allow a more advanced performance management system that more precisely allows iOS to anticipate and avoid an unexpected shutdown.” A company support page doubled down, suggesting a “different performance management system that more precisely allows iOS to anticipate and avoid an unexpected shutdown” for the recent iPhone models.None of which said definitively that the iPhone 8, 8 Plus, and X would avoid the throttling altogether. That same page made it clear this week that they have not. As of iOS 12.1, released Tuesday amid a flurry of new iPads and heralding an inclusive generation of emoji, last year’s iPhones will face 2016’s performance limits as they age.At least, though, you now have a say in whether yours gets that treatment. And in fairness, you may well want it to! Throttling is a dirty word, especially after years of association with mobile carriers slowing down connections. But if you don’t use your iPhone for especially intensive tasks and prefer that it not randomly shut down on occasion, you should at least give it a shot. Especially given that Apple has also said that \"performance management may be less noticeable\" in the newer models, thanks to various hardware and software tweaks.But if you find your aging iPhone 8 too slow to use, it’s easy enough to find out if the battery is the culprit. Just head to Settings > Battery > Battery Health. There you’ll see your battery’s maximum capacity, an indicator of how far it has degraded. And if your iPhone has had a battery-related shutdown—but not before—you'll see the option to disable the throttle and go full steam ahead.The other option: Get a new battery. Apple offers software support for iPhones for years; 2012’s iPhone 5 only became officially obsolete this month. And while plenty of other factors will make your device sluggish over time, giving it a new battery could help you squeeze extra months or even years out of it. Besides, spending $29 for an iPhone that feels new beats spending $750—or much, much more—on one that’s actually new.It’s not surprising that Apple will continue throttling iPhones. It’s not like it only did it in the first place as a prank; it actually does serve a purpose. But at least now you’re aware that it’s happening—and more importantly, have the ability to stop it.WIRED's Lauren Goode reviews the latest iPhone models -- the iPhone XS and iPhone XS Max -- and tests the battery life, camera and video capabilities.\nCORRECTION, Sept. 19, 5:05 PM EST: The video above misstated the water rating for the iPhone XS and XS Max. While the IP68 standard states that devices must be waterproof to more than 1 meter, Apple's new phones are waterproof up to 2 meters for up to 30 minutes.\"CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}