{"id": "Rockstar's Crunch Controversy and the Rest of the Week in GamesRockstar's Crunch Controversy and the Rest of the Week in Games", "paragraph": "This week in games, we've got more news on the industry's ongoing labor problems and the messy relationship between art and capital. Making things is hard—and making them with integrity and care for all the people involved, at least when money and bosses are involved, can be a lot harder. Let's take a look.The big news this week comes after Dan Houser, VP at Rockstar Games, claimed in a reported piece at Vulture that some members of the team developing Red Dead Redemption 2 had worked 100-hour weeks to ensure the game shipped on time and on target. While Houser framed this as a bit of a boast, the increasingly labor-conscious games press and community took it, rightly, as an admission of guilt. 100 hours is too much time for anyone to work, at just about any job.Since then, a number of Rockstar employees have claimed that it's not true, and Houser himself has modified his prior statement; still, it's not a good look. Whether or not Rockstar's version has evolved over time, crunch remains a big problem—and nothing to brag about.Moving from labor issue to labor issue, Kotaku reports that Skybound Games is working on a deal with the late Telltale Games to finish the final season of The Walking Dead—news that's either promising or troubling, depending on how you look at it. Swooping in to finish the work of people who got laid off is generally not considered a very pro-employee thing to do, and even if it's intended in the most innocent way by Skybound it still emphasizes the ugly messiness of the entire Telltale Games situation, and the need for better worker protections in the industry.But according to Kotaku, that may not be how this deal goes down, and that Skybound Games could actually re-hire former Telltale devs to finish their own work, which would be a pretty nice thing to see. It's not severance pay, but it's something.The newest entrant in the indie games marketplace is Loot Crate, which now offers \"Loot Play,\" a new curated \"box\" of five indie games a month. Loot Crate is one of the biggest purveyors of randomly assorted pop culture goodies around, and this turn is another sign of how heavily commercialized the indie games space has become (or, possibly, always was). Art is, really, just another commodity to sell in packages along with stickers and action figures and kitschy t-shirts. I can't begrudge anyone for selling out, people have to get paid, but it's still more than a little strange.Call of Duty: Black Ops 4 hit shelves last week, but if you're hankering for a solid fix of the franchise, I might actually recommend a trip back to 2012. Black Ops II is a strange, fascinating game, elevating its unusually ambitious singleplayer campaign with a surprising amount of player choice. The action stretches from the '80s, in full late-Cold War glory, to a speculative and disastrous future. The Black Ops series is Call of Duty at its most grim and its most over-the-top, but Black Ops II makes both of those looks work for it. (The multiplayer is really solid, too.)The National Museum of Play in Rochester, N.Y. recently acquired one of the largest collections of Japanese and European video games. From Mother to Zool to Doshin the Giant, Game|Life editor Chris Kohler gets the first look at the incredible rarities.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}