{"id": "What It's Like to Attend an Electronic Music Conference Where the Beat Never DropsWhat It's Like to Attend an Electronic Music Conference Where the Beat Never Drops", "paragraph": "Halfway into her 90-minute live set at Loop, Ableton's electronic music conference in Los Angeles, Juana Molina put down her Gibson SG guitar, stepped back from her synthesizer, and started dancing. The Argentine songwriter—who clothes herself in music woven from threads of looped percussion, finger-picked electric guitar, and airy vocals—cut loose with a hip-swinging shimmy that drew a delighted whoop from the audience.Yet, during the entire weekend I spent at the three-day conference, it was one of just a handful of times I saw anyone actually dancing.Some of that is because it's a challenge to really shake it in a seated venue like The Montalbán, the historic Hollywood theater where Molina was performing—but at Loop, the sounds are just as likely to get your head nodding as they are to get your feet shuffling. While club music and mainstream EDM make an appearance, event programming leans toward the headier, more offbeat flavors of electronic music. Wander past a DJ booth or into a live performance, and you're more likely to hear an atmospheric drum and bass track, a hazy dub plate, a skittering ambient soundscape, or twisted trip-hop beat than you are a four-on-the-floor techno banger.But the artists, producers, and enthusiasts who attend Loop don't congregate here solely to celebrate. They come to network, to attend workshops that help stoke their creativity, and to gather tips to get more out of the tools they use to create their art.Ableton is a technology company that makes hardware and software for music production. The company's premiere software product, Live, is a desktop application that lets an artist assemble and perform songs from samples, loops, and snippets of sound, often with the help of physical keyboards and controllers they plug in via USB; it's the de facto laptop rig for DJs and dance music producers. What Adobe Photoshop is to graphic design, Ableton Live is to electronic music.The Loop festival was first staged in 2015 in Berlin, where Ableton is headquartered. The festival relocated to Los Angeles this year. The reason for the move, according to David Reid, Ableton's head of marketing for North America, was to give the community of musicians and producers who can't travel to Europe a chance to connect face to face. \"Getting people together to meet and talk, that's Loop in a nutshell,\" Reid says.Plus, if you put hundreds of laptop-toting musicians in one place, sparks are bound to fly. When Loop opened at noon on Friday, Ableton released a 30-second audio sample to the public and asked them to build a song with it by midnight. Over 800 submissions had flooded in by the following morning (including several from Loop attendees), and a selection of a dozen completed songs were played on stage during a listening session hosted by musician and YouTube personality Andrew Huang.The last track played, one of the finest Huang debuted, was created by Loop attendees Sara Brown and Taetro. The two strangers met at a technical talk on Friday afternoon, and after chatting for a bit decided to collaborate on a submission. The duo holed up in Taetro's nearby hotel room and, over a few hours, worked the sample into a hip-hop beat with Brown supplying a vocal melody on top.Much of Loop's daytime programming consisted of technical demonstrations, languorous dives on the art of crafting digital songs. The deepest sessions, billed as \"track deconstructions,\" saw artists like New York's Photay and Ethiopian-American R&B producer Kelela each stepping through one of their songs. Their laptop screens were mirrored on a larger screen behind them as they exposed the tricks they use to create drums, melodies, and then effects used to enrich the production quality. At a conference where almost every attendee is an artist with a YouTube channel, a Bandcamp page, or a Soundcloud feed, these workshops were enthusiastically received.More intimate gatherings were held in the control room of a Sunset Boulevard recording studio, where attendees could quiz a musician about their gear or their creative approach. Jamaican reggae legend Scientist walked through how to create a dub remix using the mixing board. I attended one session where a dozen Loop attendees gathered in a circle around Juana Molina as she showed how she mixes physical instruments and pre-recorded sounds in her live performances. She also got philosophical, answering questions about songwriting, and speaking about the challenges faced by women in the male-dominated music industry.Talk of gender reemerged many times, most bluntly during an interview with three members of Los Angeles's FeM Synth Lab, who led a discussion about the sexism, gender disparity, and toxic masculinity inherent in the \"boys network\" of the electronic music community. (The attendee list for Ableton Loop, while quite diverse and inclusive compared to many other electronic music conferences, still skewed male.)One of the unexpected delights of Loop was the parade of artists playing on the small stage installed on the rooftop of the Montalbán. On Friday, cellist Clarice Jensen performed a twilight electro-acoustic set, mixing the natural sounds of her bowed instrument with loops, effects, and digital samples.On Saturday, the rooftop became the designated chill zone. Loopers zoned out in reclining lounge chairs and listened to an ambient set by Atlanta's Richard Devine as flakes of ash—windborne reminders of the fires in Malibu, 25 miles to the west—collected on their tote bags and windbreakers. (Conference organizers thoughtfully handed out free protective masks to attendees.)Devine's set was rich with slippery synth textures and echoing bass stabs; those in attendance rocking gently to and fro in their recliners. It wasn't dancing, exactly, but it was close.Check out WIRED's music issue featuring Ahmir 'Questlove' Thompson at: http://www.wired.com/listen\nMusic:\n\"Days Passed Me By\"\nPerformed by Kooley High\nWritten Napoleon Wright II, Charlie Smarts, Tab-OneCNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}