{"id": "Review: Cuisinart Extra-Large Rotisserie Fryer and SteamerReview: Cuisinart Extra-Large Rotisserie Fryer and Steamer", "paragraph": "This machine’s raison d’être: fryin’ up your holiday bird.This machine’s raison d’être: fryin’ up your holiday bird.Deep-fried turkey is an exciting Thanksgiving menu sub-genre, bringing new flavors—and risk!—to the traditional holiday feast. To fry a turkey in the now-classic way, you hook a propane tank to a large, stand-alone burner, heat a giant vat of oil on top of it, then rely on arm strength to lower your bird into the scalding oil and hope to not make a splash. It cooks remarkably quickly and some people swear by the crisp skin and juicy meat, but damn, there are some downsides, not the least of which is that they're dangerous enough to have spawned their own sub-genre of flaming-turkey-fryer disaster videos.So when Cuisinart put their name on what had been a Waring fryer after Waring dumped their consumer line in 2014, I was intrigued. Their Extra-Large Rotisserie Fryer and Steamer is essentially a large, electric countertop frying vessel where only the bottom third is filled with oil. You lower a bird on a spit into the box and a set of gears constantly rotates the spit, meaning only the lower third or so of the turkey is in the fry oil at any time. You can also remove the spit, switch over to a basket, and use the setup as a traditional deep fryer.If you do a bit of frying, especially turkey frying, you may already see how clever this all is. You'll immediately catch on to the safety angle. Instead of wishing you had a derrick to lower the turkey into the oil, here you enclose it in a basket on the spit, grab the spit with a handle and lower it into a \"labyrinth\"—a back-and-forth channel the ends go through to prevent dropping the bird and splashing hot oil on you and your loved ones. Speaking of splashing, once it's in there, you'll happily notice that since the oil is only in the bottom third of the \"cooking space\" (as they call it), splattering during cooking isn't a problem; I make more of a mess cooking up a stir fry.When I pulled it out of the box for a Saturday afternoon testing session, I realized how huge it is. At about five cubic feet, it easily became the largest countertop appliance in my kitchen, dwarfing my microwave. But hey, turkeys aren't tiny!Once it's in the oil, you don't need to do anything for the hour or hour and a half until it's done.Setup is pretty easy. I filled the bottom of the oil container up with about five liters of oil (about a third as much as in a good-sized traditional turkey fryer), plugged it in, and twisted the knob to set the temperature. While the oil heated, I prepped my turkey, primarily by making sure it was patted dry and had no residual frozen bits lurking in the cavity, either of which will cause a frothing storm of oil bubbles. Working over a sheet pan, I set the turkey on the spit, which has a built-on basket to keep the legs and wings from flopping around, and fed it through the labyrinth and into the oil. I cringed needlessly, then flipped the rotisserie switch and walked away.And that, right there, might be the Cuisinart fried turkey's greatest feat: Once it's in the oil, you don't need to do anything for the hour or hour and a half until it's done, at which point you just turn off the rotisserie for a moment and check the temperature at the breast and thigh. This is considerably easier than in a traditional fryer, where one member of a couple might lift the bird out of the oil and hold it in the air (often directly over the hot oil) while the other takes the temperature.The really good news: my turkey came out great. With a purpose-built machine like the Cuisinart, I'd be disappointed if it didn't, but this was a crowd-pleaser—a nice, juicy bird with crispy skin. It also cooked up in less than an hour and a half, easily twice as fast as oven-roasting.However, this is the part where we run into all sorts of freighted preconceptions and thoughts about deep-fried turkey's superiority and, you know, Thanksgiving. While deep frying makes a great bird—and again, mine was very good!—it is by no means the best turkey I've ever had. I'm a fan of a dry brine and wet roast methods, but any well-made oven bird can go toe-to-toe with a deep-fried turkey. My secret theory is that the biggest fans of the deep-fried method may never have had a great oven-roasted turkey.I tested that theory on Boston Globe food writer Devra First, who has written about deep-fried turkeys. While she didn't disagree, she also brought up a good point: \"Frying turkeys appeals more to the tinkerer/experimenter/hobbyist/special event cook,\" she says. And hey, if that gets more people cooking, then bravo! Tinker away!It's also going to transform the lovely smell of a roast bird into a generic fried-food smell, which will permeate your house long after your Thanksgiving guests leave. Two days after I fried my bird, my bath towel smelled like fry oil. What I realized in further testing is that due to its size and that smell, the electric Cuisinart fryer might be best stored and used in the garage. If, like me, you live in a smaller place, it might not be for you at all.It's not Cuisinart's fault, but frying at this scale is also noisy. When I made the turkey before my guests arrived, it made enough frying noise to drown out the radio. Finally, gravy making becomes a completely independent exercise as there are no drippings.This is too bad, because I had a lot of fun with it. For instance, while the turkey rested, I took advantage of the hot oil and fried chicken I'd already cooked sous vide. (A perfection-chasing method where all you're doing in the fryer is turning the batter into crispy, fried goodness.) The next day, I indulged my budding fascination with the Japanese pork cutlets known as tonkatsu.These two recipes alone made a compelling argument for having a deep fryer in my kitchen. Here's why: When I deep fry without a dedicated fryer, it involves my Dutch oven, a thermometer of some form poking out of it, a ton of oil, and a struggle to keep that oil at the temperature where I want it. Fry nights are special occasions, so there are usually family and friends and screaming children over while I have to give 100 percent of my attention to what I'm cooking.While traditional turkey fryers have you trying to manually manage the temperature of the oil, the Cuisinart allows you set it to the temperature you want it. I dropped the first round of fried chicken in the oil, cracked a brewski, and shot the breeze with my brother-in-law Ben until it was done. With 1800 watts of power, it brings the oil up to temperature quickly and holds it well. When food goes in and the temperature drops, the Cuisinart gooses the heat, making my tonkatsu a surprisingly quick lunchtime option. Ben, who has worked in restaurant kitchens in the past, took one look at it and immediately pronounced, \"That thing's legit!\"It's worth noting here that oven-top temperature control is slowly becoming a reality with top-notch products like Breville's Control Freak burner or Hestan's new built-in induction stove, helping to simplify frying.One fairly pleasing discovery with the Cuisinart fryer was cleanup. The \"cooking space\" and the heating element took a while to thoroughly clean. That said, there's a cleverly recessed spigot right on the bottom front of the machine, and a little hose that attaches to it, making pouring off the oil 100 times easier than with a classic turkey fryer or Dutch oven, where that process might be referred to as a turducken.The Cuisinart Extra-Large Rotisserie Fryer and Steamer is an excellent, purpose-built machine that is—in my mind—the smartest way to fry a whole bird. It makes a great turkey and, as long as you're cooking a bird that's 14 pounds or less, does it with much less risk than traditional turkey fryers. If you like having access to a near professional grade deep fryer and love fried turkey, this is the safest and smartest way to make it at home.When you buy something using the retail links in our product reviews, we earn a small affiliate commission. Read more about how this works.When you buy something using the retail links in our product reviews, we earn a small affiliate commission. Read more about how this works.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}