{"id": "FilmStruck Has 2 Weeks Left—Spend Them With These 10 MoviesFilmStruck Has 2 Weeks Left—Spend Them With These 10 Movies", "paragraph": "Unless a moviegoing-miracle occurs, you have just a few days left to become FilmStruck: On November 29, the movie-streaming service—which hosts everything from hard-to-find foreign films to vintage Warner Bros. musicals—will be shut down by Warner Media overlords AT&T. Though the provider’s subscriber base reportedly consisted of about 100,000 cinephiles, FilmStruck’s demise prompted an online petition that’s so far accrued more than 50,000 signatures, and earned tweets of support (as well as a few passionate letters from such filmmakers as Guillermo del Toro and Barbra Streisand. Some FilmStruck lovers are no doubt concerned about the startling number of classic films missing from streaming services; others probably want to ensure they had 7-day-a-week access to 8 ½. But because 2018 is the year in which literally nothing good has happened, their pleas are likely to be ignored.For those hoping to cram one last movie-blitz before the site departs, here are 10 invaluable classics that illustrate FilmStruck’s breadth, depth, and sheer art-house-in-your-house joy.The first entry in writer-director Wim Wenders’ famed mid-’70s “Road Movie” trilogy casts Rüdiger Vogler as an aimless, irritable writer who’s tasked with accompanying a rebellious young teenager (played by Yella Rottländer) from America to Germany. An unassuming, happily chatty travelogue that’s at once unsparingly funny and deeply empathetic.Robert Redford, at his peak early-’70s power, stars as a reluctant U.S. Senate candidate who’s plunged into the national spotlight—and finds that all he can do is stare back blankly. A cynical and absorbing American-politics tale, one as relevant now as it was more than 45 years ago.Not to be confused with the 1982 remake, this genuinely creepy big-city horror tale finds Simone Simon as a young woman afflicted with a long-running feline curse. Worth it alone for the film’s infamous pool scene, a remarkable feat of shadows and sound effects.Wong Kar-Wai’s mid-’90s hit—a propulsive tale of love, heartache and “California Dreamin’” in Hong Kong—has become inexplicably elusive in recent years: The Criterion Collection DVD is now a high-priced rarity, and FilmStruck appears to be the only streaming service hosting this gorgeous and essential romantic drama.A low-budget time-capsule mockumentary from writer-director Rusty Cundieff, Fear spoofs early-’90s hip-hop culture via the antics of N.W.H., a fictitious bad-boy rap outfit trying to be taken seriously. Fear’s jabs come off as more affectionate than acidic, and some jokes have aged better than others. But try watching it and not having [“My Peanuts”[(https://www.youtube.com/watch?v=6sH9lYCMf1w) in your head for a days afterward.Noir has been a staple of FilmStruck’s line-up, in no small part because of its access to the Warner Bros. archives. And rainy-day viewing doesn’t get much better than John Huston’s classic slow-burning tale of a virtuous World War II vet (Humphrey Bogart) who stares down a cackling kingpin (Edward G. Robinson) while stranded at a hurricane-hampered hotel. Contains perhaps the greatest mid-shave rants ever filmed.Granted, pretty much everyone has seen this towering monster-movie classic, but the FilmStruck edition features the informative (and hard-to-find) commentary track by historian Ronald Haver–widely considered the first of its kind.Director Elaine May’s filmography includes one irrefutably perfect film (The Heartbreak Kid), one unfairly beat-up semi-diversion (Ishtar), and one recently reclaimed lost ‘70s pearl: Mikey and Nicky, a tale of two scheming, skeevy L.A. mob-mooks (played by Peter Falk and John Cassavetes) who get in way over their heads ... and get deeper in conversation along the way.This genial, rollicking 22-minute short—which premiered at this year’s Sundance Film Festival—stars Philip Burgers as a mute, an on-the-run mystery man who stumbles into one unexpected set-up after the next. Produced by SuperDeluxe, the comedy outlet whose own existence was cut down by Warner Media this fall, The Passage is the sort of sweet-natured, experimental tale that fits right in among FilmStruck’s offerings.It’s not the most riveting documentary by the legendary Maysles Brothers (that would be Gimme Shelter, also on FilmStruck). Nor is it the most immediately quotable (that honor goes to Grey Gardens, which you can watch on—wait for it!—FilmStruck). But Salesman, which follows a crew of Boston-area bible-stumpers on their door-to-door sales calls, is an unforgettable (and sometimes uncomfortable) depiction of bright-eyed, go-get-’em mid-20th-century capitalism—and the quiet strain it imposes on its disciples.Hacker and security researcher Samy Kamkar takes a look at a variety of hacking scenes from popular media and examines their authenticity.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}