{"id": "The Best of Stan Lee’s Marvel Comic BooksThe Best of Stan Lee’s Marvel Comic Books", "paragraph": "To try and summarize the comic book career of Stan Lee is almost impossible. He was the primary—at times, sole—writer for Marvel in the 1960s when the company was becoming Marvel Comics. He was involved in the co-creation of almost all of the company’s most well-known characters, from Spider-Man to the X-Men, with Iron Man, Hulk, Thor and the Avengers in between, to name but a few. His work was at once funny, melodramatic, and effortlessly charming, all while he and his many collaborators redefined the entire superhero genre. Here are roughly 300 of Lee’s most important, and more importantly, most enjoyable, comic books to dive into if you’ve yet to sample his work.One of two of Lee’s signature series at Marvel, the first hundred issues of Fantastic Four are the building blocks of the Marvel Universe as fans know it now—they contain the first appearances of the Black Panther, of the Inhumans, of the Watcher and Adam Warlock (under the guise of Him, a wonderful name) and countless others. It also shows how Lee and co-creator Jack Kirby worked out what a Marvel comic should look and sound like. Taken as a whole, the hundred issues are a fascinating snapshot of the evolution of Marvel as a company and an aesthetic, and the superhero genre as a whole. An essential work.How to read it: Available digitally and in the Fantastic Four Epic Collection Vols. 1-3 print collections.The other essential Stan Lee work, Amazing Spider-Man, sees Stan Lee (and Steve Ditko and John Romita) perfect the Marvel formula when it comes to soap opera and melodrama; everything about the series’ first 100 issues manages to make the personal drama of one increasingly-less-nerdy teenager feel like the most important story of the world, in part because it sometimes is. The roots of all kinds of pop culture can be traced back to these comics, which remain as off-kilter, funny, and thrilling today as they did when they were created half a century ago.How to read it: Available digitally and in the Amazing Spider-Man Epic Collection Vols. 1-3 print collections.Not everything Stan touched in the earliest days of Marvel turned to gold. Indeed, the first Hulk series was cancelled after just six issues, and the character moved to anthology series Tales to Astonish while Marvel worked out the kinks. But what happens in these six issues is something worth studying, as Lee and Kirby consistently rework the formula and concept behind the character in order to make it work, taking it from something close to outright horror and playing with it each and every time they start a new issue.How to read it: Available digitally and in the Incredible Hulk Epic Collection Vol. 1 print collection.While Thor was much more the work of Jack Kirby than Stan Lee—Lee didn’t even script the initial year of publication, and in latter years, allowed Kirby to take greater and greater control of the plotting, resulting in some genuinely cosmic stories being told—it’s a series that allowed Lee the ability to fully indulge his hunger to work big, with both the faux-Shakespearean dialogue and the cosmic-level pretentious titles making it clear how much fun he was having bringing the struggles of ancient norse gods to life. Even after all these years, it’s a blast to read, with the sense that both Lee and Kirby were having almost as much fun making the stories.How to read it: Available digitally and in the Thor Epic Collection Vols. 1-4 print collections.The Silver Surfer—a supporting character introduced without warning by Jack Kirby in the Fantastic Four comic book—became a favorite of Lee’s, to the point where he forbade other writers from using him without express permission. This late ‘60s series was a somewhat failed attempt by Lee to make an important statement in the superhero genre, but the clear sincerity of Lee’s ambition (surprisingly, given how cynical he could be in other areas) remains more than a little winning to this day. (The bold art by John Buscema really doesn’t hurt, either.)How to read it: Available digitally.Senior Editor Adam Rogers takes a look at the action figure displays of both Marvel and DC and asks the question, who made the better battle display?CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}