{"id": "While You Were Offline: Trump Evoked Game of Thrones to Announce SanctionsWhile You Were Offline: Trump Evoked Game of Thrones to Announce Sanctions", "paragraph": "This week has been so long that it’s almost difficult to remember that it started with the horrific deaths of 11 people in a Pittsburgh synagogue, which prompted reports about the growth of anti-Semitism in the US, as well as the ways in which that anti-Semitism is mainstreamed for political purposes. It's weighty, depressing news, so it's no wonder that, by Wednesday, people were throwing themselves into Halloween, and the annual ritual of celebrities apologizing for costumes. Yet celebrity Halloween costumes seem like a small thing when compared to all the other events of the past week. Shall we step back and ruminate on them together? Yes, let's.What Happened: In the middle of an already fraught week, President Trump decided to order thousands of soldiers to southern US border.What Really Happened: It was Immigration Week at the White House last week, with President Trump trying to mobilize his base using overwrought rhetoric about the migrant caravan making its way to the US border from Honduras. Very little of what he said was true, but the midterms were a week away and it's not like baseless fear-mongering hurt him last time. But then, we’re in a different era, now. Maybe. Perhaps.https://twitter.com/daveweigel/status/1057254314488414208After weeks of talking about a the caravan that was coming to invade the US, President Trump started last week by announcing the deployment of 5,200 troops to the US-Mexico border, even though the caravan of migrants was still around 900 miles away, and unlikely to reach the US, anyway. It was pretty obviously a political stunt—made even more obvious by the mission's official name, \"Faithful Patriot.\" (No, we didn't make that up.)https://twitter.com/MeetThePress/status/1057025375795064833https://twitter.com/Joyce_Karam/status/1057011604741677057https://twitter.com/tonyschwartz/status/1057043661916200960https://twitter.com/PaulSonne/status/1057048605238968321It's certainly a big deal—https://twitter.com/bethreinhard/status/1057051520129294336—but is it a useful one? Maybe not.https://twitter.com/USATODAY/status/1057945307860951042So, they'll be there to … help law enforcement officials who are already there, but not there to do the thing that the president says they’re there for. I mean, sure, OK. After all, the troops are already arriving there and current estimates say the caravan, if it makes it, will likely arrive the last weekend in November, so it's not like the troops would have anything else to do. And it's only a few thousand troops. Surely there's no problem with that and it's all super cheap and above board, right?https://twitter.com/kylegriffin1/status/1057756629440049152Also, it's possible the troops could've been given something more productive to do.https://twitter.com/kenolin1/status/1058043330712354816https://twitter.com/CharlieChu/status/1057139220614008832It would be understandable for someone to look at the response to the deployment and think, Oh, maybe I should reconsider this whole thing. Apparently, that’s exactly what President Trump did, but he took things in a different direction than should have been expected.https://twitter.com/JenniferJJacobs/status/1057722736188051456Oh, man! That President Trump! He's playing four-dimensional chess again, isn't he?The Takeaway: Of course, there's also the matter of what happens if and when the migrants arrive at the border.https://twitter.com/NBCNews/status/1058101114531389441What Happened: President Trump vowed to end birthright citizenship for babies born to non-citizens and unauthorized immigrants.What Really Happened: Of course, it's possible that sending troops to a border that's not actually under siege might not be enough to stop an invasion into the United States that's not actually happening. Perhaps, the president realized, he needs to mobilize his base on the issue even more and take bolder measures. That's almost certainly how this happened early last week:https://twitter.com/axios/status/1057226389001256961You would need a constitutional amendment, actually, but we’ll get to that soon enough. For now, let's get back to Axios, which broke the story.https://twitter.com/axios/status/1057215710567583744Is this a big deal? Yes; this would be a very big deal indeed.https://twitter.com/shearm/status/1057212638193688576https://twitter.com/markknoller/status/1057244262323109890Don't worry; it also had a fair amount of false claims.https://twitter.com/ddale8/status/1057233824608854017https://twitter.com/mattyglesias/status/1057231625233276928Distraction or not, it was a massive story that reverberated across the internet. But was he correct that he could do it by executive order, considering it would mean reversing the Fourteenth Amendment to the United States Constitution?https://twitter.com/steve_vladeck/status/1057626006226378753https://twitter.com/JessBravin/status/1057629455211024384https://twitter.com/tribelaw/status/1057445336963338240https://twitter.com/elwasson/status/1057322588303773696That last one apparently got under the skin of the president, judging by this tweet the following day.https://twitter.com/realDonaldTrump/status/1057674390446448642Well, this whole thing is turning out well, isn't it?https://twitter.com/Acosta/status/1057693991523753987But, no, let's get back to what else President Trump had to say on Twitter while he was on the topic.https://twitter.com/realDonaldTrump/status/1057624553478897665https://twitter.com/realDonaldTrump/status/1057637708296794114https://twitter.com/realDonaldTrump/status/1057683481793302528Like a Twitter Beetlejuice, Former Senate Majority Leader Harry Reid couldn’t help but respond having been summoned.https://twitter.com/mkraju/status/1057682807043117057Others also pointed out that Reid has previously renounced his earlier comments, even as the Reid/Trump spat became a brief sideshow.https://twitter.com/mshew/status/1057687223041089537https://twitter.com/charliespiering/status/1057692284140032001The Takeaway: While the subject lumbers on like a racist zombie, let’s have our own little sideshow here by noting an unexpected moment in the entire discussion: This tweet from the Associated Press, which might be the shape of things to come in political coverage.https://twitter.com/AP_Politics/status/1057278090634805248What Happened: In case a show of military strength at the border and a threat to undo a constitutional amendment wasn't enough, there was a third show of anti-immigrant presidential power this week, and this one was caught on tape. Well, it was all on tape, actually.What Really Happened: In case you were thinking that things hadn't cratered deep enough when it comes to President Trump’s attempt to scaremonger around the subject of immigration, well … Let’s just look at what the president dropped on his Twitter account on Wednesday, shall we?https://twitter.com/realDonaldTrump/status/1057728445386539008To call this, as CNN did, a racist video is an understatement; one so racist, it seems that even other Republicans failed to get behind it. And, unsurprisingly, others noticed it too.https://twitter.com/mattdpearce/status/1057774190621745152https://twitter.com/stphnmaher/status/1057784928375660544https://twitter.com/maggieNYT/status/1057976565206786048https://twitter.com/RBReich/status/1057777801313566720https://twitter.com/KevinMKruse/status/1057990069091532805https://twitter.com/ryanlcooper/status/1058072270898450432https://twitter.com/pbump/status/1058002197185622016Oh, and guess what? The video isn't even accurate.https://twitter.com/tommatzzie/status/1057791175648780288Others also noted the lie, but facts! Who cares about facts these days? After all, it's not as if the issue of illegal immigration is even a growing trend, as the president claims—https://twitter.com/AnaCabrera/status/1058034911691587596—but that's missing the point. Outrage surrounding the video did dominate the online conversation in the immediate wake of its release, which meant that it was doing its job.https://twitter.com/Acosta/status/1058012222272737281In case you're wondering why Republicans would like to distract from healthcare, it's because that's not going well for them, because it turns out that people want to be covered for pre-existing conditions.The Takeaway: If you can look beyond the racism and lie about the Democrats letting Luis Brecamontes back into the country, there's one more thing of interest in Trump's video that he'd probably not like you to think about too much.https://twitter.com/kylegriffin1/status/1058090088201183233What Happened: Kanye West left politics.What Really Happened: Remember when Kanye West was in the White House and singing President Trump's praises? Man, that seems like it was years and years ago, instead of just three weeks. But however long ago it was, the point is, it's the past; Ye has now ditched politics altogether. Or so he told the world this week.https://twitter.com/kanyewest/status/1057382916760707072The response was … Well, sincere probably isn't the right word, considering.https://twitter.com/questlove/status/1057389288399298560https://twitter.com/jonfavs/status/1057384577629487104https://twitter.com/BradMossEsq/status/1057393100614746112https://twitter.com/DaveWeasel/status/1057389783821910016Here's the thing, though; this wasn't West renouncing Trump, as many believed. Instead, it was West falling out with commentator Candice Owens over Blexit, the new brand she's launched to mark \"the official Black Exit from the Democrat[ic] Party.\"https://twitter.com/RealCandaceO/status/1056634337439989760Owens unveiled Blexit shirts at conservative non-profit Turning Point USA's Young Black Leadership Summit last weekend, and announced that they were designed by West. \"Blexit is a renaissance and I am blessed to say that this logo, these colors, were created by my dear friend and fellow superhero Kanye West,\" she said at the time.Dropping West's name helped get publicity for the cause, but there was just one problem: According to West, she just used his name.https://twitter.com/kanyewest/status/1057382888520499201As it turned out, Owens must have known this was coming, because a day prior to West's tweets, she shared this herself in an attempt to save the relationship:https://twitter.com/RealCandaceO/status/1056921709708824577It didn't work, sadly, and as a result, West jumped ship, taking his credibility with him. (Well, such as it was, anyway.) Naturally, some folks are pretty upset.The Takeaway: Before anyone feels happy with how this all went down, let's stop for a second and remember that what caused the schism wasn't anything ideological at all, but the use of West's name to promote some apparel. There is no high ground here for anyone, let's be real.What Happened: President Trump evoked Game of Thrones' \"winter is coming...\" phrase to announce some sanctions. The makers of Game of Thrones, and much of the internet, was none too pleased with that.What Really Happened: The Trump administration has, since its start, treated Iran with no small level of suspicion, if not outright disdain. After months of complaining about the deal the Obama administration had made with Iran over its nuclear capabilities, Trump withdrew from the deal in May—something seen as risky by most, and a mistake by Obama, Iranian leader Ayatollah Ali Khameni, and, perhaps less obviously, Jimmy Carter.Last week, news started to leak that Trump was seeking to reimpose sanctions against Iran that were lifted as part of an Obama administration deal, despite concerns that it could cause a world recession and hand a political and strategic victory to Russia. On Friday, the Trump administration announced all sanctions would return November 5. How do you think Trump marked this decision on Twitter?https://twitter.com/realDonaldTrump/status/1058388700617498625…Yeah, like anyone really thought the answer was going to be Game of Thrones-inspired fan art.Twitter's response was … well, what you might expect.https://twitter.com/MEPFuller/status/1058390298584367104https://twitter.com/deray/status/1058391203392176129https://twitter.com/shearm/status/1058395089347796992https://twitter.com/sam_vinograd/status/1058397051799646208That last tweet proved at least somewhat prescient when, later on Friday, the official Twitter account for HBO, the network that airs Game of Thrones, tweeted the following.https://twitter.com/HBO/status/1058424663972478976The cable network followed that up with the following statement: \"We were not aware of this messaging and would prefer our trademark not be misappropriated for political purposes.\"Yes, we are now living in a world where the President of the United States makes policy statements on Twitter using Game of Thrones memes, and then the network that airs the show claps back on that same social media platform. Just think about that for a second.The Takeaway: We'll let Maisie Williams, who plays young assassin Arya Stark, handle the mic drop on this one.https://twitter.com/Maisie_Williams/status/1058411693775171585Daenerys Targaryen's dragons on HBO's Games of Thrones are fan favorites, and WIRED has an incredible, exclusive look at how they were brought to life with feature film quality by the visual effects artists at Pixmondo.  Virtual wind tunnels, water simulations and real world references all played a part in constructing their realistic behaviors.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}