{"id": "\n\t\t\t\t\t\tDoes Maniac Really Need So Many Dream Sequences?\t\t\t\t\tDoes Maniac Really Need So Many Dream Sequences?More Culture", "paragraph": "Sitting 4,400 miles above Jupiter, Nasa's Juno spacecraft took this stunning image of a large anticyclone known as… twitter.com/i/web/status/1…\n\nSlide:  1 / of  1.\nCaption: \nNetflix The new Netflix original series Maniac stars Emma Stone and Jonah Hill as two dysfunctional loners who take part in a dystopian pharmaceutical trial. Fantasy author Chandler Klang Smith felt the last episode was weak, but otherwise she loved the show.“The first nine episodes are my favorite TV drama of all time,” Smith says in Episode 335 of the Geek’s Guide to the Galaxy podcast. “And I would say that even including Episode 10, it’s definitely in my top five.”The show leans heavily on dream sequences, which range from a Kubrick-inspired first contact scenario to an ultra-violent gangster showdown. That variety of characters and settings strongly appealed to science fiction author Rajan Khanna. “I’m always a sucker for alternate realities, and so it kind of fits into that vein for me,” he says. “The weirder the show was, the more I appreciated it.”But Geek’s Guide to the Galaxy host David Barr Kirtley thought that some of the dream sequences felt out of place.“The show kind of lost me with Episode 4, where there’s this—it’s sort of like Fargo or something—this lemur kidnapping adventure with gangsters,” he says. “It felt very disconnected from the rest of the story up to that point, and I felt like it just wasn’t as interesting to me as the more science fictional, conspiracy stuff that had come before.”Science fiction author Matthew Kressel usually dislikes dream sequences, but found that Maniac ultimately won him over.“Not all of the dreams worked narratively for me, but I really liked that the show was not afraid to use that to tell a story,” he says. “As I was watching it I was sort of iffy on it, but in retrospect, thinking about it now, I really enjoyed it.”Listen to the complete interview with Chandler Klang Smith, Rajan Khanna, and Matthew Kressel in Episode 335 of the Geek’s Guide to the Galaxy podcast (above). And check out some highlights from the discussion below. Chandler Klang Smith on Patrick Somerville:“I was actually familiar with the writer, Patrick Somerville, who’s the creator of the show, because I reviewed his book The Universe in Miniature in Miniature for the KGB Bar lit mag, back probably the better part of a decade ago, and that book just made a real impression on me. In that book there’s the ‘Device for Understanding Other People,’ I think it’s called, which in some ways is similar to the technology that’s explored in this show—the idea of a machine or computer that can help you access another person’s consciousness. I just thought that that was a really elegant, moving, memorable work. … It’s definitely a book that’s worth checking out if you enjoyed Maniac.”Matthew Kressel on mental illness:“I was afraid that they were going to handle mental illness in a bad way. So for example, in Silver Linings Playbook—and I thought most of that film actually handled mental illness really well—but I thought that they destroyed their own setup by basically having the characters live happily ever after at the end. The message of the movie—at least that I took from it, maybe others didn’t—was that all you need is a companion who loves you, and that you love, and then everything will be fine. … And having people in my life who have suffered through mental illness, I know that’s not the case. You could love someone to death, and they just have bad brain chemistry. … So I was afraid that would be handled poorly, [and] I was pleasantly surprised.”Chandler Klang Smith on AdBuddy:“It seems like it’s modeled on the way that if you don’t have a subscription to certain websites, then they’ll show you ads, but you can also pay to have those ads removed. It’s that kind of idea carrying over into meatspace. Someone with a briefcase full of ads will follow you around and talk through ads at you. If you can’t pay for basically any product in a store, you can pay for it with an AdBuddy instead. … So there’s this idea that what we have in our world as an online surveillance and ad culture has been translated into external space, has been literalized, in this really interesting way. I thought that was such a smart idea, a way of commenting on something technological in our own culture but making it visible to us in a new way.”David Barr Kirtley on the Statue of Extra Liberty:“I don’t think I would have known this from watching the show, but apparently in this world there’s still the Statue of Liberty, and then looking in a different direction they’ve built another one, the Statue of Extra Liberty—because one Statue of Liberty isn’t enough. In interviews I read they didn’t really explain what the thinking was behind that. The way I read it was that this is such a consumerist world, and there’s so much rhetoric conflating personal freedom with a lack of regulations, that maybe part of the ethos of this world—part of the reason consumerism is so rampant—is because it’s been associated with personal liberty in this really overt way.”Sitting 4,400 miles above Jupiter, Nasa's Juno spacecraft took this stunning image of a large anticyclone known as… twitter.com/i/web/status/1…Sitting 4,400 miles above Jupiter, Nasa's Juno spacecraft took this stunning image of a large anticyclone known as… twitter.com/i/web/status/1…CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices.\n\t\t"}