{"id": "Space Photos of the Week: The 6 Splendid Tails of Comet McNaughtSpace Photos of the Week: The 6 Splendid Tails of Comet McNaught", "paragraph": "We’re all about marveling at the spectacle of space, so when a comet swings around our corner of the solar system at 60 miles per second, it’s time to grab popcorn. In early 2007, Comet McNaught—otherwise known as the Great Comet of 1744—shot across our atmospheric stage. Unlike your typical comet with a single defined tail, McNaught sported multiple tails that fanned out across the sky. Astronomers have been relying on observatories and spacecraft to study the comet’s interactions with solar wind and magnetic field to better understand what might make the tail fan out. Now, thanks to new image processing from University College London that combines all that data, we’re beginning to untangle the secrets of McNaught's striations and the Sun’s role in shaping comet dust.Holy space cloud! Look in the upper right of this image of the Serpens Nebula, located 1,200 light years from Earth, for the cone-like shadows that resemble the Bat Signal. Turns out that a debris ring of dust, rock, and ice surrounding a bright young star called HBC 672 is casting dark shadows on the surrounding gas—earning itself the nickname \"Bat Shadow.” Astronomers believe this region right now is a good analog to what our solar system was like when it was but 2 billion years old. They study shadows like these to detect particle size of dust and gas, and to learn whether the HBC 672 is in the early stages of eventually forming planets.It’s always bittersweet to hear about the end of a space mission, and last week NASA officially lost contact with its Dawn spacecraft after an 11-year run. Dawn was orbiting the dwarf planet Ceres—the largest body in the main asteroid belt between Mars and Jupiter—when its ion-propelled engines ran out of fuel and were no longer able to point the communications antenna back to Earth. One of the last images from the spacecraft, taken September 1, shows the mountain called Ahuna Mons peeking over the planetary horizon of Ceres.Sometimes the neighbors can get weird. Take this bizarre elongated cloud that is sweeping across the Martian equator, captured by the European Space Agency’s Mars Express orbiter in this near-global image. The curious feature is lingering near a large remnant of a volcano called Arsia Mons, but doesn’t stem from volcanic activity. It’s actually an 1,500-kilometer ice cloud on the leeward (or drier) slope of the volcano. Clouds like these are called orographic or lee clouds.Three’s company: The European Space Agency this week launched MetOp-C, the third in a series of polar orbiting weather satellites, from its spaceport in French Guiana. MetOp-A went up in 2006, and MetOp-B followed six years later. The three satellites will survey the temperature, humidity, ozone, wind speed, and trace gases over the oceans to better understand how Earth’s climate is behaving.There are plenty of pretty photos of Earth taken from the International Space Station, but this one by astronaut Alexander Gerst from September shows a rare phenomenon called “pilot’s glory,” or in this case “astronaut’s glory.” Note the circular rainbow at the center of the frame. This glory is usually spotted by pilots or people on the top of very tall mountains above the clouds. When the Sun is behind you, the atmosphere’s water droplets refract light back in the visible spectrum, and you can almost see the pot of gold.We’re all about marveling at the spectacle of space, so when a comet swings around our corner of the solar system at 60 miles per second, it’s time to grab popcorn. In early 2007, Comet McNaught—otherwise known as the Great Comet of 1744—shot across our atmospheric stage. Unlike your typical comet with a single defined tail, McNaught sported multiple tails that fanned out across the sky. Astronomers have been relying on observatories and spacecraft to study the comet’s interactions with solar wind and magnetic field to better understand what might make the tail fan out. Now, thanks to new image processing from University College London that combines all that data, we’re beginning to untangle the secrets of McNaught's striations and the Sun’s role in shaping comet dust.Holy space cloud! Look in the upper right of this image of the Serpens Nebula, located 1,200 light years from Earth, for the cone-like shadows that resemble the Bat Signal. Turns out that a debris ring of dust, rock, and ice surrounding a bright young star called HBC 672 is casting dark shadows on the surrounding gas—earning itself the nickname \"Bat Shadow.” Astronomers believe this region right now is a good analog to what our solar system was like when it was but 2 billion years old. They study shadows like these to detect particle size of dust and gas, and to learn whether the HBC 672 is in the early stages of eventually forming planets.It’s always bittersweet to hear about the end of a space mission, and last week NASA officially lost contact with its Dawn spacecraft after an 11-year run. Dawn was orbiting the dwarf planet Ceres—the largest body in the main asteroid belt between Mars and Jupiter—when its ion-propelled engines ran out of fuel and were no longer able to point the communications antenna back to Earth. One of the last images from the spacecraft, taken September 1, shows the mountain called Ahuna Mons peeking over the planetary horizon of Ceres.Sometimes the neighbors can get weird. Take this bizarre elongated cloud that is sweeping across the Martian equator, captured by the European Space Agency’s Mars Express orbiter in this near-global image. The curious feature is lingering near a large remnant of a volcano called Arsia Mons, but doesn’t stem from volcanic activity. It’s actually an 1,500-kilometer ice cloud on the leeward (or drier) slope of the volcano. Clouds like these are called orographic or lee clouds.Three’s company: The European Space Agency this week launched MetOp-C, the third in a series of polar orbiting weather satellites, from its spaceport in French Guiana. MetOp-A went up in 2006, and MetOp-B followed six years later. The three satellites will survey the temperature, humidity, ozone, wind speed, and trace gases over the oceans to better understand how Earth’s climate is behaving.There are plenty of pretty photos of Earth taken from the International Space Station, but this one by astronaut Alexander Gerst from September shows a rare phenomenon called “pilot’s glory,” or in this case “astronaut’s glory.” Note the circular rainbow at the center of the frame. This glory is usually spotted by pilots or people on the top of very tall mountains above the clouds. When the Sun is behind you, the atmosphere’s water droplets refract light back in the visible spectrum, and you can almost see the pot of gold.Space fans, we have a visitor from the great beyond. This week’s rundown of space photos starts with a big “Welcome back!” to Comet McNaught, which caused a sensation in 1744.When astronomers first observed it overhead in the 18th century, McNaught confounded them because it had not one, but six tails spread out across the sky. As it swung around Earth again in 2007, the comet put on an even bigger show. It had something to do with McNaught’s interactions with the solar wind, and new image processing from University College London now has brought in focus the effects of flowing particles from the Sun on comet dust. Comets draw out astronerds unlike anything except free beer, because these voyagers are time capsules of the solar system’s early days. When they fly past Earth, it’s an opportunity for researchers to look at the building blocks left over from our formation 4.6 billion years ago.Then instead of looking up, we’re now taking a rare bird’s eye view down on our atmosphere from the International Space Station. The fortunate folks orbiting above us at 17,000 miles an hour are in the unique position to experience a form of “pilot’s glory”—the circle-shaped rainbow created when particles of water refract light from the Sun if it’s positioned behind the observer. “Pilot’s glory” got its name from aviators who flew above the clouds, but NASA has dubbed this perspective properly as “astronaut’s glory.”Long-tailed comets and glorious clouds are not even the half of WIRED’s collection of space photos. Have fun with the full collection here.Retired astronaut Chris Hadfield helps debunk (and confirm!) some common myths about space.\nONE STRANGE ROCK airs Mondays at 10/9c on National Geographic.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}