{"id": "The Spooky Evolution of Text Message-Based Horror StoriesThe Spooky Evolution of Text Message-Based Horror Stories", "paragraph": "Last spring, filmmaker Paul Hough got a eerie bit of intel from his 12-year-old daughter: Apparently, an empty school bus had been spotted in their Los Angeles neighborhood, cruising around without any passengers inside. For Hough, a horror writer and filmmaker, the chilling incident proved inspirational. He quickly got to work on a video, titled \"The Creepy School Bus,\" about a sixth-grader named Chloe who winds up on an after-school ride on an abandoned bus, and meets a terrifying fate. It's a tale that unfolds exclusively via on-screen text messages between Chloe and an unnamed friend:CHLOE: ha you’re just trying to creep me out before I get the bus homeFRIEND: No I swear. The window in the back had a crack in it too. It just gave me a real creepy feelingHough uploaded \"The Creepy School Bus\" to Don’t Turn Around, a YouTube channel he'd launched in 2015, and which had mostly featured narrated scary-story videos and shorts—\"like Goosebumps, but edgier,\" he says. \"The Creepy School Bus,\" however, was different than many of Hough's other videos. Instead of a voiceover, the soundtrack consists mostly of some slow-building background music and numerous innocuous-seeming smartphone bloops. It's little more than nine minutes of back-and-forth dialogue, and Hough wasn't sure how much of an impact it would have. \"I finished writing an hour before it went up,\" he says. \"It was just another story.\"The Singular Joy of the Dumb, Fun Slasher-Movie ThreequelMovie Commentary Tracks Are Back—and They're a Trivia GoldmineThe 17 Best Horror Movies You Can Stream Right Now, From The Fly to The WitchBut \"School Bus\" quickly turned into the channel's biggest hit, at one point earning about a million views a day. Over the next few weeks, \"Creepy School Bus\" became so popular that Snopes.com eventually published a report noting that the kid-abducting vehicle did not actually exist. One myth-busting YouTuber even published his own video debunking the story, which itself earned 1.6 million views.More than a year later, Don't Turn Around has an entire \"Creepy School Bus\" franchise in the works, one of several inter-connected text-tales Hough has been releasing to his YouTube channel, as well as the official Don't Turn Around site. When he started producing spooky videos a few years ago, Hough says, \"I was trying to create the next Slender Man—a character that teenagers would talk about, not knowing whether it's real or not. And texting stories lend a lot of credibility to that.\"Hough isn't alone in using text stories, or chat-fiction, to connect with readers and video-watchers—especially those looking to get freaked out. Outlets like Yarn and Addicted feature several chat-format fright tales, while Hooked, which launched in 2015, currently features more than 1,000 text-message stories, more than half of which are in the horror genre. As with Don't Turn Around, Hooked's readership skews young. \"When I'm at gatherings, and tell people in their thirties and upward that I work for Hooked, they're just kind of like, 'Oh, that's nice,'\" says writer Phyllis Korkki, who's created such popular text-series as the multi-part possession tale \"Deal With The Devil.\" \"But if you tell that to a teenager, they're like, 'You work for Hooked? Wow!' They're really impressed.\"It makes sense that a generation that grew up online would gravitate toward text- and chat-based horror tales. After all, they came of age in the era of \"creepypastas\"—the catch-all term for web-based share-and-scare stories that have long been part of internet culture, but have grown especially popular in the past decade. (The famed \"Slender Man\" creepypasta, which inspired a recent movie, is believed to have begun circulating in 2009, and each season of Syfy's Channel Zero draws from internet horror stories like those found on Reddit's No Sleep forum.) And texting is a constantly evolving lingua franca, one that's been shaped by younger smartphone users, who are often early adopters, if not creators, of new acronyms and repurposed emojis.It makes sense that a generation that grew up online would gravitate toward text- and chat-based horror tales. After all, they came of age in the era of 'creepypastas'—the catch-all term for web-based share-and-scare stories that have long been part of internet culture, but have grown especially popular in the past decade.In early 2014, the popular horror tale \"Annie96 is typing\" successfully merged creepypasta with the chat format, telling the story of two young people whose conversation is interrupted by the appearance of a mysterious stranger. \"Annie96\" soon went viral, inspiring several reaction videos, as well as countless true-believers who were convinced the story was real. Their confusion was partly due to the way writer Pascal Chatterjee mimicked modern text slang, with its effusive emoticontent (:P) and occasional ALL-CAPS EMPHASIS. Like a good campfire story, \"Annie96\" was told with enough attention to detail that, even if you knew it wasn't real, you couldn't help but wonder, \"Yeah, but what if?\" In text stories, verisimilitude is the difference between 😱and 😒.That means writers for outlets like Hooked and Don't Turn Around need to ensure their text tales aren't just scary, but scarily accurate. \"Not everyone texts the same,\" says Hough, who's a bit older than his viewers (he declines to give a number, but says, \"In YouTube years, I'm like Yoda’s age\"). One of his early text-based stories found him adding periods to his sentences; in another, he confused the \"clapping\" and \"praying\" emojis. \"On YouTube, I got tons of people saying, 'Huh?,'\" he says. But he spent time learning the new slang. One of the reasons his \"Creepy School Bus\" works so well is because Chloe and her friend communicate using unfussy language and casual digressions—just like the way real teenagers have been speaking for decades now.But the immediacy of the texting medium, and the way young users can quickly jump between distractions, also dictate the terms of this kind of storytelling. \"Clarity is so important,\" says Korkki, an author and former New York Times editor who jumped to Hooked full-time last year. \"In a novel, you can have things be a little unclear or ambiguous at first. But in these stories, you have to know right away the relationship between the two people speaking. That's why we have a lot of stories about family members, or boyfriends and girlfriends, or lovers. You can start a story with a text like 'Bae...,' and people quickly know the relationship.\" Once the reader understands the players, Korkki says, \"you have to ratchet up the suspense pretty quickly. One way to do that is to have a command really early in a story: 'Don’t do that!'\" If you don't jump into the story as quickly and clearly as possible, she says, \"you're going to lose the reader.\"(Hooked stories like \"Deal With the Devil,\" about a young woman's possessed mom, also include smartphone photos, giving them an extra sense of gravitas and grabbiness.)And as the readership for text-stories grows, so do the ambitions of the writers creating them. Last week, Hooked released a long-form mystery story, \"Dark Matter,\" on Snapchat. And Hough has plans to expand his \"Creepy School Bus\" stories into a full-length feature and novel, with the aim of taking several other popular text-tale characters—like Nancy James, the evil (and similarly Snopes-investigated ) babysitter—into \"this universe where everything pretty much takes place in the same school district,\" he says. Creepy school buses? Homicidal babysitters? Somehow being a kid just became an even bigger nightmare.Ash vs Evil Dead stars Bruce Campbell & Lucy Lawless have seen it all when it comes to horror. So, how will they react to some of the most memorable horror scenes of all-time?CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}