{"id": "The Flu Shot Needs Fewer Stats and More StoriesThe Flu Shot Needs Fewer Stats and More Stories", "paragraph": "Two weeks ago, the CDC disclosed that more Americans were killed by the flu last year than at any time in 40 years—more than 79,000—and hospitalizations and illnesses hit record highs.The CDC pinpointed one possible reason for the high death rate: The number of people who got flu shots was unusually low. Only 37 percent of adults got the vaccine, the lowest rate in eight years, and only 58 percent of children, a 1 percent dip from the previous year. Flu vaccine uptake is never huge; except among the elderly, adult vaccination rates rarely top 50 percent. But the sharp decreases last season may have been enough to force the mortality rate up.Maryn McKenna (@marynmck is an Ideas contributor for WIRED, a senior fellow at the Schuster Institute for Investigative Journalism at Brandeis University, and the author of  Big Chicken.It’s a persistent mystery why flu vaccines don’t find more of a market, given that flu—meaning actual influenza, and not one of the garden-variety colds often lumped into the category—is a grueling disease. But it’s possible that people’s willingness to be vaccinated was squelched by reports that the vaccine for the 2017–18 season wasn’t effective, preventing illness only 10 percent of the time in the Southern Hemisphere’s summer flu season and only 36 percent of the time in the United States.At first glance, that response makes sense: If a vaccine won’t protect you from illness, why take it? But the effectiveness of flu vaccine is more complex than the binary of Sick or Not Sick. People who get the shot may still end up with flu infection, yet because they got the shot, they are less likely to experience grueling symptoms, be admitted to the hospital, or die.That nuance is mostly missing from annual campaigns that urge people to get the flu shot. It’s difficult for health professionals to talk about the possibility that a vaccine won’t always prevent illness. Even acknowledging that the flu vaccine is imperfect feels like a breach of professional standards—an inadvertent signal to the public that it’s acceptable to have doubts about vaccines as a whole. Which they do: A RAND study of people who didn’t get a flu shot, conducted in 2010 after one of the worst flu seasons on record, found that 28 percent didn’t think they needed it, 16 percent weren’t motivated to seek it out, and 14 percent said they “don’t believe” in it.No one who has dedicated their career to public health wants to reinforce attitudes like those. But moving the focus may be what’s needed to shift the public mindset. The flu vaccine needs a new story to tell.Most of the vaccines we receive in our lives—measles, mumps, rubella, diphtheria—are given once or a few times in childhood, and mostly protect for life. (Whooping-cough vaccine needs periodic boosters, because a reformulation in the 1990s that reduced side effects also shortened the length of the immunity it confers.)Flu vaccines are fundamentally different. The organisms that cause childhood illnesses don’t change over a lifetime—the measles virus that’s circulating in the world today is the same virus as 50 years ago—so it’s possible to give a vaccine once. But flu changes all the the time, mutating just enough from season to season that it requires a new vaccine formula, and a fresh shot, every year.The annual repetition means that people think about flu vaccines differently: less like a medical and legal necessity, and more like a seasonal product, the health care equivalent of a pumpkin spice latte, that they can take or leave.An optimistic view is that flu vaccine is only a failure compared to other vaccines. “The expectation that if you get a vaccine, you don’t get the disease — that shows how well other vaccines are working,” says Joseph Kurland, an infection preventionist at the Children’s Hospitals and Clinics of Minnesota, who works on increasing vaccine acceptance.But the flu vaccine’s shortfalls are a result of a complicated mix of factors: Flu vaccine formulation is a game of probabilities, reliant on educated guesses made six to 12 months in advance of the season about which direction the virus will drift. Flu vaccine manufacturing is built on the productivity of millions of chickens laying the eggs it is grown in, and the uncertainty of how well any season’s virus will grow in them.Any time any of those go badly—the virus doesn’t grow and vaccine supplies are short, or the prediction went awry and protection is low—the vaccine takes a reputational hit. Selling the public on an imperfect product, one that reduces risk but may not eliminate it, is a difficult task.People think about flu vaccines differently: less like a medical and\nlegal necessity, and more like a seasonal product, the health care\nequivalent of a pumpkin spice latte.One solution might be flipping the public message from the shot’s perceived failures to its documented successes. Multiple studies show that people who get the flu vaccine are less likely to become seriously ill; with the flu shot onboard, the risk of being hospitalized goes down by 37 percent. People who have been vaccinated but are hospitalized with flu are 82 percent less likely to be admitted to intensive care. If they’ve been vaccinated and still are ill enough to need an ICU, their stay is likely to be several days shorter. The effects are especially strong for pregnant women, who are 40 percent less likely to be hospitalized for flu symptoms, and for children, who are two-thirds less likely to die from flu when they’re vaccinated.These statistics are powerful, but they make up a more complicated message than a simple guarantee of protection. And they illustrate a difficulty inherent in almost all crisis  communication: it's easier to scare people with an account of a terrifying disease than it is to entice them with a calm portrayal of nothing gone wrong. That more nuanced storytelling is something public health might be moving toward.“We try to avoid getting into percentages and effectiveness, and really try to tap into the emotional feeling of what people want for themselves, or their family members or loved ones,”says Nicole Alexander-Scott, a physician who is director of the Rhode Island Department of Health and president of the Association of State and Territorial Health Officers. “We bring it back to personal stories about patients, so it’s real and not abstract.”The anti-vaccination movement long ago seized on the power of\nnarrative, publishing emotionally laden accounts of children who\nregressed after receiving vaccines.To hear a public health official consider the power of storytelling is a big step. As a field it is suspicious of anecdotes, mistrustful of their data-free power to persuade. It’s not unusual, as a journalist, to hear public health scientists of a certain age dismiss a news story of a patient’s experience as an “n of 1”—meaning a numerator of 1 over a denominator of some presumed large number, or, translated from jargon, as an anecdote that isn’t statistically representative. But journalism long ago got that dramatic anecdotes have the power to make people pay attention—stories last season pointed out that flu can cause amputations and sepsis and multi-organ failure. The anti-vaccination movement long ago seized on that power, publishing emotionally laden accounts of children who regressed developmentally after receiving vaccines.It would be satisfyingly symmetrical to see public health claim that power back. Deploying storytelling against the underestimated danger of flu might feel untrustworthy to scientists, less precise than the numbers and percentages that confer believability. But after last flu season, it seems clear that statistics aren’t a motivator for most people. It’s possible that stories are.Each year the World Health Organization determines which of the thousands of influenza variants are most likely to circulate. Flu vaccines then use these variants at the starting point when developing the annual flu shot. Find out what’s inside the influenza-warding shot.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}