{"id": "Does Climate Change Mean You Should Fly Less? Yeah, MaybeDoes Climate Change Mean You Should Fly Less? Yeah, Maybe", "paragraph": "This story originally appeared on Slate and is part of the Climate Desk collaboration.Two weeks ago, the Intergovernmental Panel on Climate Change released a dire report that made crystal clear that we have about a decade to stop catastrophic levels of climate change. The report caught fire for another extremely near deadline: It suggests that if we don’t manage to dramatically shift carbon emissions, we’ll start feeling the brunt of the effects as soon as 2040. These dates have prompted a more urgent asking of the oft-discussed question: How do we start this herculean task?Recent articles in Vox, the Guardian, and the Outline have warned that individuals “going green” in daily life won’t make enough of a difference to be worth the effort. In fact, they argue, such efforts could actually make matters worse, as focusing on individual actions might distract people from pressuring corporations and government officials to lower greenhouse gas emissions and enact the broader policy change we need to meet our climate goals. These articles and others like them tend to conclude that the only truly meaningful action people can take to influence our climate future is to vote.Voting is crucial, but this perspective misses a large point of individual actions. We don’t recommend taking personal actions like limiting plane rides, eating less meat, or investing in solar energy because all of these small tweaks will build up to enough carbon savings (though it could help). We do so because people taking action in their personal lives is actually one of the best ways to get to a society that implements the policy-level change that is truly needed. Research on social behavior suggests lifestyle change can build momentum for systemic change. Humans are social animals, and we use social cues to recognize emergencies. People don’t spring into action just because they see smoke; they spring into action because they see others rushing in with water. The same principle applies to personal actions on climate change.Psychologists Bibb Latane and John Darley tested this exact scenario in a now-classic study. Participants filled out a survey in a quiet room, which suddenly began to fill with smoke (from a vent set up by the experimenters). When alone, participants left the room and reported the apparent fire. But in the presence of others who ignored the smoke, participants carried on as though nothing were wrong.The IPCC has sent up a flare on climate change, but this warning is not enough. Many people will need to see others making real changes instead of carrying on with business as usual. Ask yourself: Do you believe politicians and businesses will act as urgently as they need to if we keep living our lives as though climate change were not happening? Individual acts of conservation—alongside intense political engagement—are what signal an emergency to those around us, which will set larger changes in motion.It’s true that fossil fuel companies bear the lion’s share of responsibility for this crisis, and that consumers buying efficient light bulbs will not set things right; we need government action to shift our energy sources from coal and gas to sunlight and wind. It’s also true that shortsighted campaigns for lifestyle change can backfire. When campaigns focus only on easy consumer tweaks and say nothing about policy, they imply climate change requires little real effort and that consumers can fix this crisis alone.But when individuals supplement policy efforts with substantial, sustained, and wide-ranging action, they inspire new social norms. These norms can then aggregate to large-scale impacts. For instance, mass lifestyle change—flying and driving less, eating less meat, heating and cooling homes less, reducing food waste—helps cover gaps where policy change would fall short of our climate goals. More importantly, social norms can spark collective action and move the needle on policy.As in previous cultural shifts—like those around smoking or drunk driving—more people will need to see fossil fuels as an extreme danger to human health and safety. A powerful way to spread this attitude is to act like it in our own lives, minimizing the fossil fuels we burn. Climate scientist Peter Kalmus—who has not flown since 2012—summarizes this attitude: “I try to avoid burning fossil fuels, because it’s clear that doing so causes real harm … . I don’t like harming others, so I don’t fly.” One person skipping a flight will not solve global warming alone, but when one person withdraws from a system that causes harm, they make that harm palpable to others.How can we get large numbers of people to make such changes? Psychologists find that conservation behavior spreads across people. It’s not enough to tell people they should conserve; people have to see what others do. For instance, the odds of someone buying solar panels for their roof go up for each home in the neighborhood that already has them. In fact, homes with solar panels more visible from the street have an even larger impact on neighbors. This is because people’s actions reveal what they value. When people see their neighbors conserve energy, they infer that their community values environmental action.Advocates similarly gain credibility by walking the walk. In a study released last week, community organizers who owned solar panels themselves recruited 63 percent more homeowners to install solar panels than community organizers who did not. Again, people inferred that advocates with solar panels believed more in the importance of the issue.What can you do when current norms promote unsustainable behaviors like frequent flying or eating large amounts of meat? Change the norms. And people will likely rapidly adapt. In one recent study, café patrons learned that 30 percent of Americans had recently changed their behavior by eating less meat. These patrons were twice as likely to order a meatless lunch compared with a control group (1 in 3 people versus 1 in 6). Why? Changing a habit takes effort; when people do it, they signal the importance of change. Change also signals that more people will curb their meat eating in the future, and people conform to this anticipated norm as if it were a current reality. Finally, change signals that anyone can take climate action, and eating less meat is not just for vegetarians.As a rule of thumb, the more substantial the change you make, the more you signal the need for change. Recycling matters, but it is common and easy. When you order the veggie burger even though you’re a meat lover, take a bus instead of an Uber, or skip a professional conference that requires air travel, you deliver a message that fossil fuels are dangerous and that climate change requires an urgent response.How many people does it take to start change? Just one. This insight comes from research on “social dilemmas,” or situations in which people can contribute towards communal well-being—as in reducing emissions and calling representatives—or can ride along for free while others do the work. Psychologists study these situations using tasks that pit individual gains against collective good. In one task, anonymous players can contribute money to a collective fund, which gets doubled and redistributed, or they can keep their money and benefit from the contributions of their fellows. Share more and the group benefits; keep more and you benefit. In general, people contribute more when they see others do it too—even if only one other person starts the trend at first. Climate change scholar Steve Westlake found this exact pattern in a recent survey: Among respondents who knew one person who gave up flying for the environment, half flew less themselves.Flying less does reduce emissions. Crucially, though, social norms provide a backdrop for policy change. When people forge an initial commitment to a cause, like buying less meat, they often proceed to political commitments, like contacting a senator. People don’t like to be hypocrites; they like harmony between their lifestyles and their politics. Rather than undermining political action, sustainable living prompts sustainable voting. A caveat: These benefits emerge when conservation requires some sacrifice. Easy, single-shot actions (like buying efficient lightbulbs) make us feel like we have done our part and can disengage. More challenging, ongoing actions (like changing our diets) propel us forward into action. Just as sacrifice convinces others that climate action is important, it convinces us of our own commitment; we start to see ourselves as climate advocates. Eating less meat creates a gateway to workplace advocacy—like encouraging digital meetings or lobbying for solar panels—which opens a door to signing petitions or protesting.If people act on climate change in their daily lives, they will expect industry to do its part. People value reciprocity: We punish free riders who don’t do their part and reward those who chip in—and businesses know it. They also pay attention to trends. For example, after roughly a decade of decline in per capita meat consumption, the CEO of Tyson Foods—the world’s second-largest producer of chicken, beef, and pork—announced that the company would shift to more plant-based alternatives. Lyft recently announced it would offset carbon emissions from its rides. Google, Apple, Sony, T-Mobile, and others have committed to buying renewable energy. Did these companies make changes solely out of the goodness of their hearts? Of course not. Every company follows incentives—to manage public relations, meet consumer demand, and stand out from competitors. Where consumers go, industry incentives follow.Politicians run a similar calculus to decide if environmental policies will get them re-elected. When we enact personal change out of climate concern, we show that there is real support for laws aimed at enacting societal change. Personal conservation might not achieve our climate goals, but it can convince politicians to pass laws that will.For instance, California just passed a law known as SB 100: By 2045, the fifth-largest economy in the world will be powered by 100 percent renewable electricity. The bill was sponsored by state Sen. Kevin De León, who has challenged Dianne Feinstein for her Senate seat—a tough race in which any challenger needs good PR. If Californians had no reputation for energy conservation and environmental concern, would De León have taken a political risk anyway and prioritized passing SB 100? Perhaps not. In anonymous interviews, politicians who personally care about climate change have expressed hesitation to sponsor laws when they perceive insufficient constituent concern. Each individual’s choices, especially when amplified through social influence, help create a social environment ripe for political change.There are plenty of things to do about climate change beyond voting. Take a train or bus instead of a plane, even if inconvenient—in fact, especially when inconvenient. Take a digital meeting instead of an in-person one, even if you give up expensed travel. Go to a protest, invest in noncarbon energy, buy solar panels, eat at meatless restaurants, canvass for climate-conscious candidates. Do whichever of these you can, as conspicuously as you can. With each step, you communicate an emergency that needs all hands on deck. Individual action—across supermarkets, skies, roads, homes, workplaces, and ballot boxes—sounds an alarm that might just wake us from our collective slumber and build a foundation for the necessary political change.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}