{"id": "How Boston Dynamics' Robot Videos Became Internet GoldHow Boston Dynamics' Robot Videos Became Internet Gold", "paragraph": "Boston Dynamics’ videos aren’t just famous, at this point they are almost a staple of the internet—typical stuff like robots doing backflips and opening doors for their friends. But the machines only became a YouTube phenomenon because someone grabbed the first video from Boston Dynamics’ website and uploaded it themselves.“We just had it on our website and someone stole it and posted it,” Marc Raibert, founder of Boston Dynamics, told us during a rare on-camera interview at the WIRED25 festival earlier this month. A few weeks later, the video had amassed 3.5 million views. “The light went on—this matters.”“Since then, what we've tried to do is make videos that you can just look at and understand what you're seeing,” Raibert says. “You don't need words, you don't need an explanation. We're neither hiding anything nor faking anything.”It’s just robots doing robot stuff, like fighting off stick-wielding humans. But the videos' slick production obscures some gritty realities. Getting Atlas the humanoid robot to do parkour or SpotMini the quadruped to dance the running man takes a lot of work. These videos showcase the robots on their very best behavior—you’re not seeing the many screw-ups it took to get there. Though it makes for internet gold, that approach also fuels a misperception that the machines are ready to chase us down the street and beat the tar out of us.But robots, whether from Boston Dynamics or elsewhere, are nowhere near that kind of capability. Even Boston Dynamics isn’t exactly sure how customers will deploy SpotMini when it hits the market next year.Check out the video above for Raibert’s thoughts on this, the genesis of SpotMini, and what makes the internet's favorite robot dog so special.SpotMini, Boston Dynamics' celebrity robot dog, greeted visitors to WIRED25 in San Francisco, the event celebrating WIRED's 25th Anniversary.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}