{"id": "Shane Dawson’s YouTube Documentary Shows the Price of Giving People What They WantShane Dawson’s YouTube Documentary Shows the Price of Giving People What They Want", "paragraph": "Youtuber Jake Paul is sort of like Gen Z’s Johnny Knoxville—if, in between ill-advised stunts, Johnny Knoxville rapped about how you should buy his merch and spit on his girlfriend on camera. He and his brother Logan (who infamously filmed a dead body in Japan’s Aokigahara forest earlier this year) leave chaos and scandal in their wake online and off. Jake, especially, is douchebagus americanus var. bro, one of the most hated people on YouTube, but only according to people over the age of 16. To a devoted audience of tweens, he is their universe.Enter Shane Dawson, a YouTube megastar in his own right, but one with a decade on Jake Paul—both in age and experience. At 30, he’s YouTube’s elder statesman, and his channel reflects the growth that comes with age.  It’s morphed from a composite of silly (sometimes racist) sketches, to an equally dark period of making “cakes” out of oozing piles of fast food to what it’s become in the last three months: a vehicle for YouTube’s version of investigative reporting, complete with multipart documentaries deep-diving into the lives of YouTube’s most controversial stars. He’s profiled people like Jeffree Star and Tana Mongeau, with the kind of access only Dawson is likely to get. Whenever Dawson’s videos drop, they make YouTube stand still and gawp—they get millions and millions of views, inspire both positive and negative reaction videos, and generate more conversation than almost anything else on YouTube, except maybe the Paul brothers.So when Dawson announced his next subject would be Jake Paul, the backlash was instantaneous, and thunderous. The series, which culminated this week in an almost two hour final episode, has more than 100 million views altogether.The documentary is by turns engrossing and exhausting, sharp and extremely silly, clear eyed and disturbingly blinkered. It’s central question is at once a focused interrogation (Is Jake Paul a sociopath? And if he is, are all YouTubers?) and an existential crisis (Who made Jake Paul? Who even is Jake Paul?). Through this meandering gaze the series tackles America’s thorniest cultural issues, from the outrage-driven tendency to outcast social media celebrities after a scandal to casual racism and toxic masculinity— while acknowledging Dawson’s own place in the attention-seeking streaming ecosystem.“Listen, I get it, okay? I shouldn’t be doing this. I shouldn’t be giving Jake Paul a platform,” Dawson says in the first episode. “But I also want to be doing shit on my channel that I find interesting.”That ambivalence and helpless self-reproach characterizes the entire series, especially the finale, where Shane and the audience sit down and listen to Jake Paul speak his version of the truth for an hour, like a low budget version of The Bachelor’s “After the Final Rose.”Airing this direct interaction is a radical action. By social media law, Jake Paul’s extremely bad behavior, which includes imperiling neighbors by setting giant fires and making racist and xenophobic jokes regularly, and directly impacts millions of preteens, has gotten him “canceled”—social media parlance for being made a pariah, a tactic designed to starve a problem person of oxygen. That law applies to the rarified world of YouTube celebrities most of all: Later in the series, Paul says that he feels like “the elephant in the room” at YouTube creator events because people pretend he isn’t there. By talking about and to Paul, Dawson is stepping outside YouTube’s norms, and the viewer joins him by watching. Everyone knows it’s not quite right to ignore him and even worse to give him attention, but that makes it harder to look away.The documentary’s main confusion—if Paul is a pariah, are we all making our own culture worse by turning our attention to him?—is also the great question of the internet. The norms well-intentioned commenters try to enforce, that decency should trump shock value, aren’t the norms at all. But by trying to enforce them, these mobs so consistently make their object of outrage the beneficiary of attention that stoking scandal has become a norm of its own. You can talk about how unacceptable Jake Paul’s brand of violent, merch-peddling, wealth flexing bro-ness is, but that doesn’t change the fact that he is accepted and celebrated by millions daily, which in turn wins him brand deals and sponsorships from corporate America.What he’s supposed to be doing, though, is toxic. Even, as the documentary makes clear, for him. Which brings us to another uncomfortable question raised in Dawson’s finale: Should we feel bad for Jake Paul? His family is dysfunctional, and a crucial part of their dysfunction is putting their whole lifes, and especially all their dirty laundry, on the internet forever. (I am haunted by an exchange by between Jake and his father, known of YouTube as Vlogdad Greg Paul. “The secret service is at my house! What does that mean?” Jake asked, wild-eyed. “It means you’re making good vlog content,” his dad replies.) For Jake Paul, a high school dropout living with about a dozen twenty somethings in a giant house with no rules, he’s essentially self-publishing a reality television show about his freshman year of college, with a rabid and instantaneous audience of millions.It’s clear that Dawson sympathizes and identifies with Jake Paul. But from the outside, it feels important not to. Dawson doesn’t hold Paul’s hands to the fire about other issues crucial to internet culture’s current discourse. Paul alleged dragged a woman down a flight of stairs after smashing her phone. Paul openly called a pair of Spanish twins that were part of his crew of vloggers a racial slur for Mexicans—constantly. He says he doesn’t make those jokes anymore because he’s afraid to, not because he knows his behavior was wrong. (Dawson responded that he had gotten in trouble for making racist jokes too.)It’s a documentary whose faults are the same as its virtues.  But for all its faults, Dawson’s series is one that prints itself in your brain—not because it’s shocking to peer into the bleak, glamorous life of Jake Paul, but because it isn’t. You may not feel as akin to Paul as Dawson does, but you will recognize him.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}