{"id": "Rural Kids Face an Internet 'Homework Gap.' The FCC Could HelpRural Kids Face an Internet 'Homework Gap.' The FCC Could Help", "paragraph": "Before and after classes at Panguitch High School, a low-slung brick building nestled in the high desert of southern Utah, students find their way to Shawn Caine’s classroom. They settle in at the computers where Caine teaches coding and software, or they head to the back room for the 3D printer, vinyl cutter, and robotics kits.Some kids come to log extra time on class projects. Others show up just for the internet. Caine oversees the school’s Chromebooks. Her district of Garfield County has provided a computer to every student since 2016. And yet reliable broadband is far from guaranteed in this region of towering plateaus, sagebrush valleys, and steep canyons.Like much of rural America, Garfield County is on the wrong side of the “homework gap”—a stubborn disparity in at-home broadband that hinders millions of students’ access to the array of online learning, collaboration, and research tools enjoyed by their better-connected peers. Many of Garfield’s students trek to internet oases such as Caine’s classroom or one of the local businesses willing to host a district Wi-Fi router. Going without isn’t an option. “All their work is on that computer,” Caine says, “and they need that access.”That’s why district leaders are eager to pilot an ambitious, statewide broadband initiative. Utah’s schools are hardwired with high-speed internet through a statewide network. The new plan would extend that network into a wireless blanket of access covering rural households and the highways on which students spend hours busing to and from sports and other activities. The broadband expansion is supported by the managers of the existing network, and the plan’s backers could tap multiple funding sources for education technology. But the pilot can’t get started without one critical missing ingredient—access to frequencies of electromagnetic spectrum.Federal licenses to use spectrum that can carry mobile internet are a hot commodity, coveted by big telecommunications companies with money to spend at the periodic spectrum auctions conducted by the Federal Communications Commission. The FCC is now poised to decide whether a trove of currently untapped spectrum should be given away for free to Garfield County and other rural school districts—or sold to the highest bidder.On a recent fall morning, Garfield County’s superintendent, Tracy Davis, was stuck behind an out-of-state car crawling up a two-lane highway flanked by red, rocky spires that reached into a cobalt-blue sky.“Probably lost,” Davis grumbled. The tourists who flock to this part of Utah to visit places like Red Canyon and Bryce Canyon National Park clog up the roads, and yet, Davis said, “they are the only money there is.”Drought and low dairy prices have crippled the region’s family farms, and the minerals and coal hidden in the surrounding plateaus can’t be exploited due to federal land ownership and the undeniable remoteness of the place, so far from markets, power plants, and processing facilities. “As you can see,” Davis said, gesturing toward an expanse of scenery home to just one person per square mile, “we’re out in the middle of nowhere.”Southern Utah offers dramatic scenery, but little broadband.The same issues hamper Garfield County’s access to a less tangible, but perhaps more valuable, resource—the internet. In sparsely populated rural America, there’s little or no profit motive for commercial providers to invest in broadband service. According to an April Department of Education report, 18 percent of 5- to 17-year-old students in “remote rural” districts have no broadband access at home, compared with 13 percent in cities and 7 percent in the suburbs. In total, the homework gap hits some 12 million school-aged kids nationwide, according to a 2017 congressional report, “America’s Digital Divide.”When pioneering districts try to build their own broadband networks to reach students beyond school walls, they must first navigate federal control of the electromagnetic spectrum that carries every wireless signal, from radio broadcasts to satellite communications. To avoid interference, licenses to use specific frequencies of spectrum are tied to geographic location. That’s why, for instance, the same preset button on your car radio will be news-talk in one city, classical music in another, and static in between.While several slices of spectrum can carry mobile internet, the most promising for rural school districts is one the FCC first reserved for educational television broadcasts in the 1960s. Over three decades, the government gave away more than 2,000 spectrum licenses to school districts and education nonprofits, primarily in urban areas. But the FCC effectively stopped issuing such licenses in 1995, because many license holders weren’t using their spectrum, and instead making money by leasing it to commercial telecommunication companies.Nobody made a big fuss about the licensing freeze until 2004, when the FCC expanded the allowable use of this frequency band to include broadband internet and renamed it Educational Broadband Service. Suddenly, this sleepy spectrum became extremely valuable. But the freeze on new licenses remained, leaving huge swaths of the country without any legal access to EBS frequencies, areas collectively known as EBS “whitespace.”In recent years, pressure has built on the FCC to open up licensing in EBS whitespace—both from big telecoms eager to fortify their nationwide wireless networks and from tech-savvy educators hoping to spread their schools’ internet into students’ homes. Finally, in May, the FCC suggested lifting the whitespace licensing moratorium, among several proposals to change EBS.“Currently, a large portion of the [EBS] band in approximately half of the United States lies fallow. And it’s been that way for more than 20 years. This must change,” FCC chairman Ajit Pai wrote in a statement. “Today, we take the first step toward putting that asset to work.”Broadly speaking, the proposals reflect an ongoing tension between the public-interest origins of EBS and the fact that the free market has been far more efficient at putting this spectrum to use. On the one hand, the changes would steer existing EBS licenses further toward the free market by eliminating requirements that a sliver of leased spectrum still be used for education. On the other hand, the FCC would still give new EBS licenses free to educational institutions, including rural school districts such as Garfield County, within the current whitespace. (Native American tribes would also get preferential access to new licenses.)Hundreds of people and organizations weighed in during the FCC’s first public comment period on the proposals, which closed in August. Submissions from school districts and education nonprofits largely supported keeping, or strengthening, the spectrum’s ties to education. Meanwhile, representatives of commercial wireless internet providers, and open-market advocates such as the nonprofit R Street Institute, pushed for full commercialization and urged the commissioners to auction off whitespace spectrum licenses.After the FCC weighs the first batch of comments, it may allow a second period of public comment on a revised proposal. According to Steve Rovarino, president of Red Rover, a Reno-based broadband network design firm hired as a consultant to Utah’s bid for EBS spectrum, a final ruling was originally on track for the end of this year, but has been delayed indefinitely due to the pending T-Mobile merger with Sprint, the largest holder of leased EBS spectrum.“There are rumors that a concession to push through the merger might be Sprint relinquishing some of that spectrum,” says Rovarino. An FCC spokesperson declined to comment about the merger's potential impact on the EBS deliberations.The godfather of Utah’s new educational broadband plan is Jason Eyre, who was the IT director for Garfield County Schools during their Chromebook rollout.“We branded it as expanding the classroom beyond the school,” said Eyre, who now works for Murray City Schools, just south of Salt Lake City. Knowing that some students had no broadband at home, Eyre convinced a few local businesses—a gas station in one town, a drugstore in another—to host a Wi-Fi router where kids could connect.But the challenge went beyond students with no home internet. The vast majority of families had some form of home internet access, but their connection speeds were sometimes too slow to retrieve pages and documents from the school district’s heavily content-filtered system.So Eyre and Davis looked into creating their own broadband network to cover Garfield County. That led them to see the potential for a statewide solution. Key to that possibility was Utah’s existing broadband service connecting the state’s school buildings and hospitals. This wired network, known as the Utah Education and Telehealth Network, is run by a public-private partnership of state agencies and commercial telecoms. By the summer of 2017, Eyre and his counterparts in other districts had persuaded UETN to back a wireless expansion of their broadband service statewide.The idea was to mount transmitters on schools to blast broadband into surrounding communities, using UETN as the core and tapping state education technology grants to defray the cost. Garfield would pilot the project, along with Millard County, another massive rural district. But before the effort could get underway, the districts needed spectrum licenses.Last summer, UETN was among the groups that submitted comments to the FCC in support of the whitespace licensing of EBS spectrum. So was the Nebraska Department of Education, which has a statewide broadband plan similar to Utah’s, whereby an existing wired network in the school buildings would be broadcast wirelessly into surrounding rural communities.\"I’d love to see the equivalent of the rural electrification program happening for broadband. But until that day happens, we’re kind of stuck with these patchwork solutions.\"Susan Bearden, Consortium for School Networking“We know all too painfully well the extent of our homework gap for rural students here in Nebraska,” said Tom Rolfes, education IT manager for the Nebraska Information Technology Commission, one of the partners in the state’s broadband initiative. Nearly two-thirds of Nebraska’s districts have fewer than 500 students, and more than a third of the rural students have no broadband access at home, compared with just 9 percent of urban students, according to a recent state study.In an email attached to Nebraska’s FCC comments, one mother whose only home internet is a smartphone hotspot with an expensive data plan wrote to the superintendent of her rural district about driving her daughter to the parking lot of a public library after hours so she could do her homework using the library Wi-Fi.“[My daughter] was told, `‘Since you get to take the Chromebooks home, you have no excuse for not getting the vocabulary homework done,’” she wrote.By 2017, Nebraska had wired every K–12 school building, along with 25 colleges and universities, with fiber-optic broadband. And, according to its FCC comments, the state owns or leases more than enough towers to blanket its rural areas with broadband, provided they get licenses for the necessary spectrum.“We have this perfect alignment of stars. Not only is there a dramatic need, but we have extraordinary assets to throw at the problem,” Rolfes said. “But the premise of this is new licensing, with a more strategic approach, and if the FCC doesn’t grant that, then anything we’ve proposed will be moot.”Back at Panguitch High School, a junior named Hagen Miller sat in the cluttered back annex of Shawn Caine’s classroom. As one of the tech-savvy students in the district’s “CyberCorps,” Miller was debugging and cleaning a few Chromebooks for recent transfer students.Miller has decent home internet, but he knows friends and neighbors who don’t, and he also cites the hours he and other students spend without internet access on lengthy bus rides. Travel for any school athletic team in Garfield County can easily top an hour each way, and Miller competes in four sports—basketball, baseball, cross country, and track. Every team covets the one of the district’s roughly 12 buses with a Wi-Fi router, even though internet service on “the Wi-Fi bus” cuts out for long stretches. “If you have an assignment due the next day, you want the Wi-Fi bus so you can get it done and don’t have to stress about going home and staying up all night to finish,” Miller said.Junior Hagen Miller, in Shawn Caine’s classroom at Panguitch High School.In the meantime, some teachers at Panguitch High School are moving more of their classroom work online. “Given the expectations we now have for student access, it’s difficult for those students who don’t have good internet at home,” said the school’s principal, Russell Torgersen. He’s seen the students sitting in the school parking lot to tap the Wi-Fi on weekends, and he’s had many conversations with teachers about how to work around students’ spotty home connections.For now, it’s a waiting game, as the FCC plods toward a decision on the fate of the EBS spectrum. Given the uncertainty, Eyre and his allies are looking at alternative paths to spectrum licenses, such as the lengthy and complex FCC waiver process successfully used to create a rural educational broadband network in Michigan’s Upper Peninsula.Even if the FCC ultimately decides to give new EBS spectrum licenses to rural school districts like Garfield County, it’s hard to say how much of the homework gap could then be eliminated. Current estimates of rural broadband don't take into account the boundaries of EBS whitespace, nor the fact that a home broadband connection can be inadequate for a school network's needs, according to digital-inclusion advocates such as Susan Bearden, chief innovation officer for the Consortium for School Networking (CoSN), a professional association for school technology leaders.Bearden says there’s no silver bullet to solve unequal student broadband access. She favors giving rural districts EBS licenses, but not every district can build its own broadband network. And in many urban communities, broadband access is plentiful but unaffordable to families struggling to make ends meet.Closing those gaps will depend on a variety of measures, from hot-spot lending programs at public libraries to nonprofit digital-inclusion efforts and districts buying mobile hotspots for students from companies such as Kajeet.“I’d love to see the equivalent of the rural electrification program happening for broadband,” said Bearden, referring to the sweeping New Deal effort to bring electricity to America’s countryside. “But until that day happens, we’re kind of stuck with these patchwork solutions.”This story was produced by The Hechinger Report, a nonprofit, independent news organization focused on inequality and innovation in education. Sign up for the Hechinger newsletter.The launch of Apple’s iPhone X brought face recognition, animoji, and the notch into the mainstream.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}