{"id": "Tesla Finally Turns a Profit, and Promises to Keep Doing ItTesla Finally Turns a Profit, and Promises to Keep Doing It", "paragraph": "People usually have three questions about Tesla and Elon Musk’s promises: When can I get a $35,000 Model 3? Can Teslas drive themselves? And can Tesla actually make money selling electric cars?The answer to the first two, when Musk is asked, is usually something along the lines of “in six months or so.” On the third question, he’s been clearer. He pledged that the automaker would be profitable before the end of 2018.Tesla just released its financial results for the third quarter of the year and reported a net profit of $312 million, finally allowing Musk to keep a promise. “We delivered more cars in this quarter than in all of 2016,” the CEO said on a call to discuss the numbers.Proving that Tesla can make a profit has been a crusade for Musk, and the figure is higher than most analysts had estimated. He’s said that the criticism of the company—that it has to be profitable to be viable in the long term —is fair, and that he's been eager to prove the doubters wrong. One quarter in the black is a start, but Musk will have to keep this up to accelerate away from doubts about the long-term future.“Q3 2018 was a truly historic quarter for Tesla,” the company said in today’s investor update letter. A grandiose line? Sure. Hyperbolic? Not that much. Tesla released production numbers for the quarter at the start of this month, which showed it delivered 52,239 Model 3s. Add in the Model S and X, and that's a record more than 80,000 vehicles delivered between July and September.At the end of the quarter, Tesla actually welcomed existing customers as volunteers to help deliver cars, as that became the new bottleneck. “I’ve never heard of a case where customers volunteered their time to help a company succeed,” said Musk. “That’s amazing. It chokes me up actually.”This news is all the sweeter given what Tesla has endured in 2018. The Securities and Exchange Commission charged Musk with misleading investors when he tweeted his plan to take the company private, resulting in a $40 million fine (half for him, half for the company), and having him step aside as chairman of the board of directors.The company laid off 9 percent of the workforce in June, saying that it was a difficult but necessary reorganization. Moreover, Tesla has continued to struggle with quality control. Coincidentally, just released as well are the latest reliability rankings from Consumer Reports, showing the automaker slipping to 29th place out of 29—mostly due to issues with the Model S. The Model 3, which is less complex, has “average” reliability. Oh, and Musk also smoked weed on a podcast.But making money seems to trump all, and Tesla shares are riding high even as the rest of the stock market is slumping.The positive financial results come as Tesla launched a new, lower-priced version of the Model 3. This isn’t the long-awaited mass market, “standard range” vehicle that will have a redesigned battery and cost $35,000. This is a long-range battery pack with some cells left out, sold as a “midrange” car as Tesla looks to keep sales moving in the fourth quarter this year. It was originally $45,000, but overnight the price crept up $1,000, as Tesla likely adjusts to demand.The car is also an olive branch to customers who placed a $1,000 deposit in 2016, in hope of securing a cheap Tesla. Although this car isn’t what Musk promised, it will likely mean US customers can get a cheap-ish car before the end of 2018, after which the federal tax credit for EVs of $7,500 starts to phase out for Tesla.Tesla now says it makes a 20 percent gross profit margin on the Model 3, which is up there with luxury trucks and cars, and higher than most cheaper cars. Much of it is due to selling higher-end, expensive models, like all-wheel drive and performance versions for as much as $77,000.But the company reported the gross profit margin for the Model 3 will stay the same even as lower-price cars are snapped up by impatient buyers. The company says it’s constantly making savings and improvements in the manufacturing process. “Labor hours per Model 3 decreased by more than 30 percent from Q2 to Q3,” Tesla says, “falling for the first time below the level for Model S and X. In Q4, we will focus even further on cost improvements while continuing to increase our production rate.”Musk also tweeted this week that Tesla would be cutting the number of options available for interior choices (like type of wood, color of leather) on Model S and X vehicles, as the company works to streamline production. On the Model 3, it currently only offers two interior options, black or white seats.Tesla actually has had profitable quarters before; the last was in the third quarter of 2016, during production hell for the Model X, as it’s now doing with the 3. (Now as then, Musk sent an email to employees imploring them to help show investors Tesla could be profitable.) The only other profitable quarter was back in 2013, when it started to fill early Model S preorders.Tesla’s not alone in burning through cash as it’s vying to grow and develop as a business. Amazon went public in 1997 but didn’t have a full profitable year until 2003. Twitter still hasn’t had an entire year in the black. And the big automakers, General Motors and Chrysler, both lost so much money in the global financial crisis that they declared bankruptcy in 2009 and relied on government money to recover.But Musk indicated unprofitable days were over for his company. “Our aspiration will be for all quarters going forward, we can be positive cash flow,” he said. But he then added in a caveat—saying that didn’t count quarters, like the fist one of next year, where the company has to make a major payment on loans.As for answering those other questions, Musk said the company is making good progress on self-driving, but needs its new computer chip, which won’t go into cars until the beginning of next year, at the earliest. What's more, Tesla doesn’t have the ability to build the $35,000 Model 3 right away and stay profitable, but he hopes the $46,000 one is a step in that direction.Musk then threw in reminders of his commitments to the Tesla Semi, Roadster, pickup truck, and solar tile roof on the call, almost as throwaways. \"I think we have the most exciting hardware road map of any company by far,\" he said. If he can fulfill all these promises, then Tesla has a good 2019 ahead of it.Tesla has just delivered the first 30 models of its most crucial car, the Model 3. The new addition to the Tesla family is supposed to be the “affordable” car, starting at $35,000. Tesla CEO Elon Musk says over half a million people have already paid $1000 to reserve their Model 3.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}