{"id": "\n\t\t\t\t\t\tDungeons & Dragons Art Is Finally Getting the Respect It Deserves\t\t\t\t\tDungeons & Dragons Art Is Finally Getting the Respect It DeservesMore Culture", "paragraph": "Dead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9q\n\nSlide:  1 / of  1.\nCaption: \nDouglas Sacha/Getty Images Many people would describe the Dungeons & Dragons art of painters like Jeff Easley and Keith Parkinson as ‘magical.’ But Michael Witwer—who grew up during the so-called “satanic panic“—used to worry that the art was literally magic.“I remember being afraid to look into the eyes of the wizard from Unearthed Arcana, or the dungeon master that has the big doors open on the Dungeon Master’s Guide,” Witwer says in Episode 331 of the Geek’s Guide to the Galaxy podcast. “I was afraid that because these books were somehow tied in with Satanism, I might become possessed or immersed within this unholy world.”Witwer is the co-author of the new book Dungeons & Dragons: Art and Arcana, a visual history of the game that includes hundreds of illustrations and other ephemera. He notes that D&D art helped shaped the imagination of an entire generation, lending widespread recognition to formerly obscure monsters such as gryphons, chimeras, and succubi.“It was really a revolutionary thing, this notion of D&D creating monsters, in many cases from scratch, or in other cases providing sort of the standard visualization of what they would look like,” Witwer says. “It’s actually one of the biggest things that D&D ever did, was provide us with a standardization of monsters as we understand them.”Despite the massive cultural impact of the game, D&D art has only recently become highly valued. Brian Stillman, co-director of the new film Eye of the Beholder: The Art of Dungeons & Dragons, notes that many early D&D paintings were discarded as trash, or else sold off for small sums to collectors.“These artists were selling a lot of it at conventions for 40 bucks, 50 bucks,” he says. “I mean, the most amazing pieces of art—that sell today for thousands—were just set up at conventions and you’d buy them for whatever’s in your wallet.”As recently as a few years ago, D&D artists attracted only modest public interest, and interviews with them were scarce. But now that’s changing in a big way, and Stillman hopes his film will help bring their work to an even larger audience. “I joke that the whole point of making this movie was so I could go hang out with all these artists, and get to talk to them, and I might as well hit ‘record’ on the camera so other people can too,” he says.Listen to the complete interview with Michael Witwer and Brian Stillman in Episode 331 of Geek’s Guide to the Galaxy (above). And check out some highlights from the discussion below.Brian Stillman on chainmail bikinis:“Without really asking [TSR] management, and knowing what they would really cop to, I’d suspect they had to be aware that it was powerful marketing, or they simply wouldn’t have let [the artists] get away with it. They would have just said, ‘No, redo it.’ Because by then they had art directors in place. I think Clyde Caldwell wanted to paint it, I think Larry Elmore wanted to paint that stuff. They were both really big pin-up artists. And I think management, for all their harumphing—if they cared that much they wouldn’t have let it out there. I think they recognized it was a selling point even as they maybe said, ‘My gosh, we don’t agree with this at all. Stick it on the cover!'”Brian Stillman on art history:“A couple years ago my wife and I were at the Prado in Spain, and I’m looking at some of the medieval art, and I’m like, ‘Yeah, that’s totally a campaign I ran.’ There’s just no way to look at it and not see the illustrator at work—the illustrative quality—it’s just illustrating religious iconography or the fears of the time. And then you take that into the golden age of illustration—the turn of the century—and you had monsters all over the place. You had all sorts of cool things, and you had fairy tales and things like that. … But yeah, I think you can trace it back to hundreds of years ago, if you’re just talking about this manifestation of imaginative art, imaginative realism. It just depends on how you want to define the parameters.”Michael Witwer on Tomb of Horrors:“About six weeks before [Gary Gygax] left for Baltimore—which is where this Origins tournament took place, where they were going to run this module for about 120 players, with four dungeon masters—Gary came up with this idea that, ‘Well gosh, if I’ve got four different dungeon masters running the same module, and I’ve got people that haven’t played this game, and it’s a tournament so it’s supposed to be fair and competitive, how do I make sure this is really uniform?’ So he came up with this idea of creating panels that he could show players, and that he could distribute among the four dungeon masters, so that they could have visual uniformity about what they saw and what they experienced.”Michael Witwer on Dave Trampier:“Trampier was not, on a technical level, the most gifted artist. He didn’t have the greatest training. But he clearly was trying to paint the music in his head. You can see it in everything he did. The ambition of what he was trying to do was extraordinary. If you’ve never seen the wrap-around cover for the dungeon master screen that Trampier did, it is unbelievably cinematic. It is as great as any movie poster you would have seen in the early ’80s. Now again, execution wasn’t necessarily his strong suit, because he wasn’t as trained as some of these later artists. But when you look at the things he was trying to do, you don’t have to look very far to see that this guy was a genius.”Dead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9qDead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9qCNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices.\n\t\t"}