{"id": "How Board Game Designer Rob Daviau Built His Creepiest Game YetHow Board Game Designer Rob Daviau Built His Creepiest Game Yet", "paragraph": "Board game designer Rob Daviau is shuffling through a deck of 3” x 3” cardboard tiles, each displaying a somber, aerial-view illustration of a room. He spies one, raises his eyebrows, and plucks it out of the pile.“This is the creepiest,” he says with a sly grin, turning the card’s face toward me. “There’s two things in here: The room is empty except for a crib and a teddy bear that’s been dismembered.” He studies the card a moment. “It implies there’s a larger story.”Daviau has an exacting, methodical eye for detail. As a board game designer, he is at once art director, mathematician, behavioral psychologist and—the role he seems to relish most—storyteller. He’s created expansive, worldbuilding games like SeaFall, Risk 2210 AD, and the H.P. Lovecraft-based Mountains of Madness. His cooperative apocalyptic survival game, Pandemic Legacy (Season 2), earned him a 2018 Spiel des Jahres award, a sort of an Oscar in the board game world.He also invented the \"legacy game,\" a genre of board games built to adapt and change across multiple rounds of gameplay. Each time a game is played, its outcome affects the rules and weights of the games that come afterward. This weekend, one of Daviau’s most popular creations—the horror-themed 2004 tile game Betrayal at the House on the Hill—gets an expansive legacy update.What if a board game had a history, an intergenerational memory?In Betrayal, players assume the role of explorers nosing around in an abandoned house, uncovering tiles that represent rooms. Midway through the game, one player turns against the others, turning a pleasantly spooky co-op into a grisly elimination game. Each game of Betrayal feels like a new story, insinuated in terse, eerie text and ominous illustrations.If games of Betrayal feels like discrete short stories, then Betrayal Legacy, out November 9, should be an epic paranormal saga. “No one builds a house to be abandoned and haunted,” he says. “So what happened to it?” He shrugs, and lets the question hang in the air.Daviau started thinking about legacy games after an offhanded comment about the murder mystery game Clue. In every game of Clue, the dinner party host gets murdered by one of the guests. He joked that the host should stop inviting these murderers to dinner parties. The thought gave him pause. What if, he wondered, the game did remember what happened? What if a board game had a history, an intergenerational memory?That led Daviau to create the first-ever legacy game, Risk Legacy, in 2011. When Avalon Hill approached Daviau with the idea to build a legacy game for Betrayal in December 2016, it seemed like an opportunity to tell a longer, richer story about one of his most popular games.Designing the mechanics of a “living” game is a balancing act. A legacy game must lead players through a predetermined narrative, while also allowing them a measure of autonomy. It needs be able to adapt its original rules across games, but not too many of the rules, and certainly not so quickly that players get frustrated with the pace of change. Since the passage of time is a hallmark across legacy games, the game’s story also needs to evolve across multiple rounds of gameplay.Daviau’s job, of course, is to hide this all from you. “I wanted to make sure that the math got out of the way and became very simple and almost invisible,” he says, “so that you were focusing on the story, and not the systems.”Nearly two years of fastidious game development, play testing, and revision led to the final iteration of Betrayal Legacy, which fits in a large, densely packed game box. It contains 71 room tiles to build out the haunted mansion. Most of the player mechanics are similar to those in the original Betrayal—it begins co-op, until a traitor emerges. The first round of Betrayal Legacy is set in 1666. Each game takes place 30 years after the last, as the house grows, ages, and takes on a life of its own.Daviau’s team included a small staff of writers and the illustrator from the original board game. He pulled in people who designed cards for Magic: The Gathering, who could calibrate how powerful each card should be. As he oversaw the building of Betrayal Legacy, Daviau had to make “hundreds of decisions” about loopholes, probability, and player behavior.Player autonomy, for example, is the most appealing element of a legacy game. In an early game of Betrayal Legacy, I, the traitor, murdered my roommate in the foyer with a crossbow. (Tough nuggets, Mike—I play to win.) Per the rules, I placed a sticker of a ghost in the corner of the tile. Now, in future games, the presence of the ghost will influence certain actions. More importantly, I get to rub it in to Mike, every single time we play. It gives me a thrill and a power high like no other.'It doesn’t tell you the story. It gives you all the ingredients for you to write your own story.'Rob DaviauBut designing for autonomy poses a significant challenge. If the players had total free reign, Daviau would have to design more and more unwieldy storylines than could fit into a single box. Yet if the game’s outcomes are too rigidly predetermined, then players lose the thrill of agency.To negotiate this tenuous balance, Daviau looked to the narrative structure of classic horror stories. In most horror narratives, the main characters fumble in the dark, subjected to unspeakable terrors, until finally, in Act III, they grasp the nature of the curse or creature, and try to overcome it. Part of the thrill of a horror movie, Daviau says, is that the characters are not in control most of the time. “Once we realized the house was the main character, and the characters were at its whims, it allowed us to give up a lot of things that we thought the players would have to do,” he says.While it has some role-playing aspects, Betrayal Legacy isn’t like D&D, where the players are the heroes who drive the game. Player agency doesn’t come from deciding on the storyline, but trying to survive the unknown. It’s not supposed feel triumphant, and god forbid it be cheerful. “The story should blossom,” Daviau says. “Like a mushroom. Not like a flower.”The game board itself is designed to move players through time. When players begin, they read from a card that reveals the story of the house across generations. The card from the first round of gameplay, set in 1666, introduces a story of a mysterious pox, and the subsequent treasure-hunt that unites the players in a dead family’s house.As the game progresses from the 17th through the early 21st centuries, the types of scares evolve. Puritanical poxes morph into modern monsters into the 19th century, and the writing style, too, modernizes slowly across time. Daviau points out that the floorboards are wider in the tiles that show up in the 17th and 18th centuries, then get narrower, to reflect the style of the late 19th century. It’s the details, Daviau says, that players won’t notice as they unfold, but give the house the eerie air of moving slowly through time.For the level of fastidiousness demanded of the player, legacy games like Betrayal Legacy can be less accessible to the casual board gamer. When I opened the box, I immediately started punching out the tiles from their packaging and then, without thinking, shuffled them. Then I opened the manual, which explicitly instructed me not to shuffle the tiles. I had made a grave error. With no way of putting the tiles back in order, the game was useless. After our interview, Daviau kindly rearranged the tiles for me. But not every gamer gets the privilege of having the game designer clean up their messes.For the patient and dedicated, though, Betrayal Legacy can be worth it for the story alone. With the creepy, detailed illustrations and evocative text, playing it feels like wandering through an immersive choose-your-own adventure, where anything could jump out at you from the dark.Daviau, too, cherishes the story-driven nature of the game. Betrayal at the House on the Hill is the only one of the games he’s designed that he’ll choose to play. “I love how it takes very tropey things and lets you as the player fill in the story,” he says. “It doesn’t tell you the story. It gives you all the ingredients for you to write your own story.”If Daviau did his job right, Betrayal Legacy will build upon what had made Betrayal remarkable—the ability not to recount an explicit narrative, but to design, out of cards and tiles, a world where players can tell their own. Stephen King wrote once that the best horror stories thrill us by “lifting a trap door in the civilized forebrain and throwing a basket of raw meat to the hungry alligators swimming around in that subterranean river beneath.” Daviau, with Betrayal Legacy, seeks to crack open the trap door and let the players find their own way through the dark waters.Correction Appended, 11/12/18, 10:35 AM PST: An earlier version of this story misstated the type of cards that the card designers had worked on. They designed Magic: The Gathering cards, not magicians' cards.Can video games help improve hand-eye coordination? Can they help train your brain and improve your cognitive abilities? WIRED Senior Editor Peter Rubin tests his skills against a pro sports gamer to find out if gaming can improve your brain and body.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}