{"id": "Ginkgo Bioworks Is Turning Human Cells Into On-Demand FactoriesGinkgo Bioworks Is Turning Human Cells Into On-Demand Factories", "paragraph": "From the windows of Ginkgo Bioworks’ Boston offices you can peer down into a grimy vestige of the city’s past. Across the street, workers in yellow-slicker overalls scrub, scrape, and repair the decks of worn-out warships and ocean tankers parked in a drydock. During World War II, 50,000 people worked the docks and the eight-story waterside warehouse that Ginkgo now calls home.  Inside the synthetic biology company’s glass-walled foundries, humans are now less obvious, with algorithms designing industrial organisms and robot armies building them in humming, hypnotic synchronicity.“Biology’s ability to make atomically precise products is far superior to the best manufacturing systems humans have ever built,” says Ginkgo CEO Jason Kelly. “And it’s self-assembling.”Colloquially, that’s just called growing. Buzzwords aside though, he does have a point. The biotech unicorn is already cranking out an impressive number of microbial biofactories that grow and multiply and burp out fragrances, fertilizers, and soon, psychoactive substances. And they do it at a fraction of the cost of traditional systems. But Kelly is thinking even bigger. Play out the tape, he says, and within our lifetimes synthetic biology should be able to make anything you’d want, and do so with a self-repair function built in. Big things like buildings, roads, and ships; and small things like semiconductor chips. “Your Apple iPhone is much less complicated than an apple,” he says.But first, drugs.Until now, Ginkgo’s genetic reprogramming platform has been confined to lower-order kingdoms—turning bioreactor-friendly bacteria and yeast into manufacturing workforces for the food, agriculture, and materials industries. But today the company opened its newest foundry, Bioworks 4, where for the first time it will start accepting orders for engineered mammal cells, from mice to hamsters to human. These kinds of cells are in high demand these days, as pharmaceutical firms increasingly employ them to make medicinal biomolecules like antibodies and proteins. And in the case of cancer immunotherapies, the drug is the cells themselves. With a little tweaking, of course.For the last ten years, Ginkgo has built a business on industrializing the theory at the heart of synthetic biology. Namely, that cells are machines running on the software of DNA. Want to change their program? Instead of flipping a bit you flip an A to a T. Tom Knight—an original grandfather of synthetic biology, along with Harvard geneticist George Church and biotechnologist Craig Venter—co-founded Ginkgo in 2008 with Kelly and three other MIT biological engineering grad students. Living off DARPA and ARPA-E grants at first (it was the recession after all), they spent five years automating more than 80 tedious lab tasks and stitching them all together with software. In 2013 they finally opened their first foundry.“It was kind of like the difference between a handmade automobile that someone lovingly put together in the 1890s and the production lines that put out the Model A in 1927,” says Knight. “We were just so tired of doing things one reaction at a time.’Since then they’ve added three more foundries and jumped from 18,000 square feet of space to 100,000. Also in that time, scientists equipped with cheaper and cheaper sequencing technologies began amassing colossal collections of DNA, from microbes in subways and soils and everywhere in between. Ginkgo’s designers have used that resource to reprogram bugs into biofactories. They write Python code to pull down 1000 sequences that might produce the desired gene—say, for how a rose makes rose oil. Robots print out and assemble those 1000 strings of DNA, while other robots insert them into bacteria or yeast. Then all 1000 strains get tested for fitness, efficiency, and yield. Are they making the rose oil? How much? Are there any weird byproducts? Are they living as long as they should or crapping out early? That process narrows down to candidates in the double digits, then rinse and repeat.“Really what’s happening is that for 3.5 billion years nature has been trying out different genetic sequences,” says Ginkgo’s head designer Patrick Boyle. In other words, the functional parts were all developed out in the wild, what Ginkgo is doing is remixing that code in new combinations to produce organisms with useful properties. And the foundries allow them to do that with scale and speed so they don’t have to have a hypothesis going in. Each one cranks out massive amounts of data that gets captured and translated into design principles that help mix and match DNA more efficiently in the future.In that way, Boyle likens the foundries to the wind tunnels the Wright Brothers had to invent to understand the laws of aerodynamics before they could conquer gravity. “They couldn’t do it from first principles alone,” he says. “Similarly, we can’t yet just design biology from scratch.”But things are moving quickly. Even just two years ago, Ginkgo wouldn’t have been able to apply those same principles to a custom-designed mammalian cell assembly line, says Kelly. That’s because mice and humans have a lot more genetic material than bacteria or yeast. And antibodies are a lot more complicated to build than rose oil. Making meaningful modifications meant having to print extra-long pieces of DNA. Which is why last year Ginkgo snapped up Gen9, a synthetic DNA provider founded by Church. Through the acquisition, Ginkgo absorbed the startup’s gene-printing machinery, capable of producing fragments of DNA up to 10,000 base pairs at a time (competing gene vendors top out around 3,000 to 5,000).With that hurdle cleared, Bioworks 4 will give Ginkgo the chance to conquer something new—human disease.It won’t be jumping into the drug development game itself. Rather, the company hopes to enable small biotech startups, so they can investigate promising leads without incurring huge up-front costs building out labspace and hiring specialized bench scientists. It’s the equivalent of tech companies relying on the cloud rather than building out their own server farm. As a PhD student at MIT, Kelly says he could extract DNA from 24 samples on a good day. With help from automated robots, one Ginkgo operator can do more like 1,000.Those economics should prove attractive to seed-stage startups with limited runways. Kelly says Ginkgo has already signed one small client that’s planning to launch lab-free with about $5 million in funding by relying on the foundry’s in-house infrastructure. And he says a big Boston-area pharmaceutical company has contracted Ginkgo to pursue its work on antibodies.While it’s too early to say whether the platform Ginkgo built for microbes will prove transformational in medicine as well, VCs are already placing those bets. Last December, Ginkgo raised $275 million, which included funding from return investor Bill Gates. The company now has five or six construction projects going in parallel, says Nate Tedford, head of foundry operations. As autonomous cell engineering gears up, the face of manufacturing is starting to look a lot more biological.Maybe you've heard of Crispr, the gene editing tool that could forever change life. So what is it and how does it work? Let us explain.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}