{"id": "To Curb Terrorist Propaganda Online, Look to YouTube. No, Really.To Curb Terrorist Propaganda Online, Look to YouTube. No, Really.", "paragraph": "Before most people even knew that terrorist outreach was happening online, YouTube was a top recruitment venue for jihadi terrorist groups. The platform, which consistently ranks among the most trafficked websites in the world, has served as a library for radical clerics’ speeches and calls for fundraising. Meanwhile, the corresponding comments sections provided recruiters narrow barrels from which to fish for new members.Rita Katz is the Executive Director and founder of the SITE Intelligence Group, the world’s leading non-governmental counterterrorism organization specializing in tracking and analyzing the online activity of the global extremist community.YouTube’s problem worsened with the rise of ISIS and its resilient propaganda machine. In a May 2017 study, I detailed the ways groups like ISIS and al-Qaeda were sneaking their media onto YouTube and the massive extent to which they were doing so. In recent years, YouTube was among the most recurrent platforms used by terrorist groups. In link compilations issued by terrorist propagandists, the first item listed was often a YouTube URL.In a June 2017 blog post, Google General Counsel Kent Walker acknowledged YouTube's role in the dissemination of such information and stated that the company would be taking concrete steps to improve its terrorist content removal efforts. The measures included increased use of technology, ramped up human intelligence, updated content policies, and some ambitious approaches to countering the content itself.To its credit, YouTube’s strategy appears to be working. My previous research, along with an exhaustive new SITE Intelligence Group report analyzing nearly 30,000 verified ISIS and al-Qaeda online artifacts published between April and August 2018, show a steep decline—and, in at least one case, complete halt—of YouTube use.ISIS and al-Qaeda’s shifts away from YouTube are promising developments in the online fight against terrorist propaganda. While some in the tech and government sectors have accepted terrorists’ online recruitment as the new normal, YouTube has proven that effective solutions do exist. But despite YouTube’s progress, these extremist groups still maintain an entire tech sector of resources to exploit, including other Google platforms. Moving forward, the tech industry needs a broader accounting of what is deemed a success in the online fight against terrorism.In my 2017 analysis of terrorist YouTube usage, I tallied 515 URLs to Google services used to disseminate ISIS content in the 10 days between March 8 and March 18, 2017. These URLs were obtained from just one ISIS-linked media group, Fursan al-Rafa (“The Upload Knights”). The prioritization of YouTube was obvious: I found 328 URLs for YouTube, 148 for Google Drive, and 39 for Google Photos.However, a comparison of Google service URLs for the same ten-day span from 2017 to 2018 shows a dramatic shift away from YouTube: Only 15 URLS for YouTube, 124 for Google Drive, and 119 for Google Photos.The same trend applies to al-Qaeda groups. The Shabaab al-Mujahideen Movement, whose propaganda garners the most attention of all al-Qaeda affiliates, has shown a similar shift away from YouTube since the platform's 2017 crackdown. Every year, the Shabaab issues a video “gift” for Eid al-Fitr, the Islamic holiday marking the end of Ramadan. Its June 26, 2017 Eid al-Fitr video release, titled “The March of Steadfastness,” was initially published with 129 unique URLs by the Global Islamic Media Front, the official media outlet of the Shabaab. Among these URLs were 10 to Google services (six for Google Drive, two for Google Photos, and just two for YouTube). As usual, the YouTube URLs were listed among the first of them.The Shabaab’s Eid al-Fitr release for the following year, on June 17, 2018, was officially issued with 431 unique URLs, including versions in or translated to Arabic, Swahili, and Somali. Of these URLs, though, only 12 were for Google services: six for Google Drive and six for Google Photos. No links were provided for YouTube.Other al-Qaeda affiliates have demonstrated the same tendency to steer away from YouTube. AQAP channels, for example, no longer feature the platform at the beginning of their URL compilations.But YouTube’s victories against ISIS and al-Qaeda must be evaluated in the context of the entire tech industry—including other Google services. Despite the drastic drop in YouTube use by these groups between 2017 and 2018, Google Drive saw only a small decrease in use (148 to 124 URLs), while Google Photos saw a major increase (39 to 119 URLs).Bolstering that point, SITE’s latest study identified 16,219 URLs specifically for video and audio files by ISIS, al-Qaeda, and their supporters. Of those, nearly 2,000 were created using Google Photos and Google Drive. Based on that data, Google Photos, Dropbox, and Google Drive are the three top platforms used by ISIS and al-Qaeda to share audio and video with their affiliates and supporters.While major platforms like YouTube, Twitter, and Facebook are often widely cited as platforms that have been exploited in ISIS and al-Qaeda’s outreach, it is often understated how far these terrorist groups’ tentacles reach. SITE’s five-month study documented the use of over 100 platforms, from major players like OneDrive, Google Photos, and Dropbox to those you’d be forgiven for having never heard of.These propaganda machines are far too massive, sophisticated, and adaptive for isolated approaches across the tech industry—regardless of how effective one company’s efforts at content removal has been. As we have seen for the last two decades, when terrorists are banished from of one place online, they recuperate elsewhere.Online vigilance remains as critical as ever in combatting violent extremism. Stifling terrorist propagandists and recruiters demands a far more collaborative, coordinated approach between governments, tech companies, and third-party entities. YouTube’s recent successes against terrorist content dissemination should be seen not just as victories, but also as a potential road map for other platforms combatting the onslaught of digital violence and hate.WIRED Opinion publishes pieces written by outside contributors and represents a wide range of viewpoints. Read more opinions here.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}