{"id": "Guns in America: Our Relationship With Firearms in 5 ChartsGuns in America: Our Relationship With Firearms in 5 Charts", "paragraph": "Americans could be forgiven for becoming numb to the swarm of stories reporting gun massacres. In the last five years, ordinary Americans have been murdered in mass shootings in a synagogue, in churches, at elementary and high schools, at a nightclub, at a bar, at a music festival, at a center for people with developmental disabilities, among countless others. After a shooting in Isla Vista, California, in 2014, The Onion wrote, \"‘No Way To Prevent This,’ Says Only Nation Where This Regularly Happens.\"The Onion got it right—at least for the “only nation” bit. The US is the only country where this keeps happening. And the US also claims the dubious distinction of being the only rich nation to see so many deaths from firearms, as the chart below shows. (We kill ourselves even more than we kill each other: Worldwide, the US ranks second only to Greenland in the rate of suicides by firearm; when you remove suicides from the equation, the US falls to number 28 worldwide for deaths from firearms, both from violent acts and accidents. But even subtracting suicides, the US's death rate from guns remains far ahead of every single European nation and nearly every Asian one.)Most countries that see high rates of gun violence are also economically depressed; El Salvador, for example, which claims the world's highest rate of deaths from gun violence, has a per capita GDP of around $4,000—roughly 7 percent of the earnings per citizen in the US. The chart below shows that, generally, it's the poorer countries that see high rates of violence, while rich countries—Luxembourg tops the list—tend to lose very few residents to gunfire. The US, again, stands alone for having a relatively high GDP per capita (number 8 worldwide) and a high level of gun violence (number 12 worldwide).Rich countries that see virtually no deaths from firearms include Japan, the United Kingdom, Singapore, and South Korea, according to data from the World Bank and the Institute for Health Metrics and Evaluation's Global Burden of Disease survey.Unsurprisingly, firearm deaths are correlated with firearm proliferation. American companies manufacture millions of guns each year and import many more. Domestic firearm manufacturing increased dramatically during President Barack Obama's first term, in part because of fears that, after eight years of a Republican White House, a pro-gun-control president would take away citizens' weapons.That didn't happen. By 2017 the number of handguns, shotguns, and rifles available in the United States was nearly three times higher than it was two decades earlier, according to the US Bureau of Alcohol, Tobacco, Firearms, and Explosives. Today, the US boasts more firearms than residents.Canada, for its part, may have a lot of guns as well, as the chart below shows, but its citizens don't often die from gunfire; the country ranks 72nd in the world for deaths from firearms. Despite having one firearm per every three Canadians, the country's death rate from gun violence is about one-tenth that of the US (though still four times that of the UK). While mass shootings have been on the rise in Canada, only 223 Canadians died from firearm violence in 2016, compared with more than 14,000 in the US. Prospective gun buyers in Canada must pass a reference check, background check, and a gun-safety course before receiving a firearm license; the country also imposes a 28-day waiting period for new gun licensees. The AR-15 rifle—which was used to kill high school students in Parkland, Florida, moviegoers in Aurora, Colorado, and worshippers at a Pittsburgh synagogue, among many others—is a \"restricted\" firearm in Canada, meaning owners must pass an additional test and obtain a special license.If Barack Obama had succeeded in passing stronger gun laws, would it have helped save lives? Maybe. On a state-by-state basis, there's a general correlation between stronger gun laws and lower rates of firearm deaths. A May 2018 paper in JAMA Internal Medicine that sought to evaluate whether strong gun laws resulted in fewer deaths concluded, \"Strengthening state firearm policies may prevent firearm suicide and homicide, with benefits that may extend beyond state lines.\"  Still, a February 2018 analysis by The New York Times found that most weapons used in mass shootings had been obtained legally.The Giffords Law Center to Prevent Gun Violence gives the states of Alaska and Louisiana a failing grade for their gun-safety laws; those states also claim the nation's highest per capita rate of deaths from firearms. Massachusetts, New York, and New Jersey all receive higher marks for their laws and have comparatively lower death rates from guns.But as long as it's easy for firearms to be transported from, say, a gun-friendly state (like Nevada) to a state with strong gun laws (like California), as long as lawmakers fail to enact strong policies to restrict sales to people with mental illnesses or a history of violence, as long politicians continue to take money from the gun industry, as long as the gun lobby continues to pressure medical doctors to stop advocating for their patients with bullet wounds, and as long as a box of ammunition for an AR-15 rifle costs $20 for 50 rounds, the shootings will no doubt continue.WIRED senior writer Andy Greenberg puts new homemade gunsmithing tools to the test as he tries three ways of building an untraceable AR-15 semi-automatic rifle---a so-called \"ghost gun\"---while skirting all gun control laws.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}