{"id": "Cure Kitchen Boredom With Noma's Primer on Fermented FoodsCure Kitchen Boredom With Noma's Primer on Fermented Foods", "paragraph": "Occasionally, when shredding cabbage to make sauerkraut, I wonder, of all vegetables, why this one? Don't get me wrong—little makes me happier than a late-night snack of beer, cheddar, crackers, and kraut, but the popularity of the lowly cabbage for fermenting always felt weirdly limiting.It wasn't for lack of great teachers. For the last few years, I've enjoyed working with the genius cheerleader Sandor Katz's Wild Fermentation in one hand and the bulletproof straight shooting of America's Test Kitchen's Foolproof Preserving in the other. Somehow, though, the two left me tradition bound, and I never ventured beyond sauerkraut and kimchi. I needed some uncharted territory.Flipping through The Noma Guide to Fermentation, which hits shelves this week, I came across a photo of corn on the cob being painted with a paste of fermented blueberries. It sounded like a crazy combination but Copenhagen's Noma is often ranked as the top restaurant in the world and I felt confident that it would be good.I made several ferments equipped with little more than a bunch of large Ball jars and some inexpensive specialized equipment.Once residing mostly in the domain of hippies and health-food stores, fermentation is quietly becoming the obsession of many high-end chefs. The Noma Guide is a deep dive that makes that infatuation official, describing what fermentation is, why it tastes good, and how we can learn from some incredibly capable pros about how to make our home kitchens hospitable for the good bacteria and fungi that transform our food, lending it more complex flavors.In 2014, chef René Redzepi and his team at Noma went all in and built a fermentation lab out of shipping containers, later hiring the Guide's co-author David Zilber to run it. Now, Redzepi says, \"Fermentation isn't responsible for one specific taste at Noma—it's responsible for improving everything.\"He's not kidding. When Noma opened in a new location in Copenhagen earlier this year, symbolically integrating the fermentation lab, every dish on the menu featured a fermented element.Following an informative and deftly written primer to start the book—the authors got editing and recipe testing help from food pros Chris Ying and Martha Holmberg—the Guide then divides and conquers, splitting Noma-style fermentation into several sections: lacto fermentation (salting fruits and vegetables to make the magic happen), kombucha, vinegar, koji (rice or barley inoculated with Aspergillus oryzae fungi), misos, new kinds of shoyu (soy sauce), various garums (fish sauce and friends), and non-fermented black fruits and vegetables like black garlic. Each of those sections gets its own detailed description and a raft of recipes.Redzepi and Zilber's interest in fermentation may sound simply like a good excuse for a new book, yet stretching the possible is a near necessity at Noma. Finding interesting ingredients in Denmark's winter is challenging, but transform something that's abundant in the summer into a wholly different food in the winter and you've got enough excitement to get you through the cold months.In their guide, Redzepi and Zilber encourage readers to build a fermentation chamber out of a speed rack (translation: make a temperature-controlled tent from a restaurant’s rolling sheet-pan rack, a little heater and humidifier, and a PID temperature controller), or make one out of a styrofoam cooler. I did none of this in my test kitchen and still made several ferments equipped with little more than a bunch of large Ball jars, and some inexpensive specialized equipment. I even did some book-sanctioned cheating, buying some rice koji, then riffing on the book's roasted koji mole recipe, which has nothing to do with a traditional mole, but it has an intense range of deep flavors similar to its namesake. It also makes a swell glaze for roasted potatoes or a lovely stand-in for hot chocolate.My partner in crime was Brian \"I belong to several fermentation groups on Facebook\" Gojdics.   He's a buddy, a world-class pizza chef, and—full disclosure—I've done a bit of consulting in the past for the restaurant where he is the executive chef.Together, we plowed through the prep for multiple ferments: vats of lacto-fermented blueberries, pluots, mushrooms and honey; vinegar made with pluots—the recipe called for plums, but the pluots looked better; and coffee and mango kombuchas.\"This book's rad, it gives the why,\" Brian said.Initially, I lost Brian to the book since he was seeing it for the first time. But once he set it down, all went quickly. We had our first few jars filled in half an hour, largely because it was easy. Fermenting with salt, aka lacto fermentation, where the salt lets the good, flavor-making microorganisms do their work while inhibiting any that might be harmful, simply requires the ingredient itself, plus about two percent of its weight in salt. A kilogram of cabbage, for example, gets 20 grams of salt. Or, as Brian put it, \"You're just adding salt to a thing and putting it into a jar.\"Eaten raw, elderberries can irritate the stomach. By adding them to elderflower wine, they become fermented and are rendered deliciously edible.Here, apple kombucha has been combined with pine needles, giving the drink a bright green hue.We started a pair of kombuchas, and this was where I was particularly happy to have a fermentation buddy—I'd never before deployed the Symbiotic Culture of Bacteria and Yeast known more commonly as a scoby. This is the rubbery disk you set floating atop a jar of sweetened black or green tea, so the microbes housed within can transform the sugars in the brew into alcohol and acetic acid. Scobys can live for months or years, and are often handed down or shared amongst kombucheers. Brian even keeps a collection of them in a big jar known as a scoby hotel, a term that makes me chuckle every time I read it.That pluot vinegar required nothing more than the fruits themselves, a little bit of liquid yeast, and some already-made unpasteurized vinegar that's added late in the game, a process dignified by another great term: backslopping.What's particularly nice about the book is that it takes the time to go into in-depth explanations. Many of its recipes have photos that illustrate what your ferment should look like over days, weeks, and even months, which is really helpful if you're worried that what you're making is going sideways. It also gives Redzepi and Zilber room to talk about their more unique creations. When they make vinegar out of celery, or miso out of peas (usually it's soybeans), they understand that we're going to need some suggestions on what to do with them. Celery vinegar, it turns out, makes an intriguing topping for fresh cheese when combined with herbs and olive oil. Miso made with with peas, or \"peaso,\" as they call it, can be folded into butter to adorn mashed potatoes, or it can be combined with garlic oil and used as a beef marinade. One particularly helpful pairing note is to simply use the fermented product with the same foods you'd pair their unfermented versions with.The ferments we made became a bit of a running project (they all are, really), and they fared better when I gave them a quick, daily once-over. Brian stopped by after about a week and made sure everything was looking good, and discovered that the lacto pluots had developed a thin layer of harmless kahm yeast.\"It won't hurt you, but the yeast itself might taste like vomit,\" he said before walking it back a little. \"OK, how about 'it can have unpleasurable flavor profiles?'\"He skimmed off the offending yeast and it was good as new.Over the course of a week or two, the flavors of each ferment developed in interesting ways. The blueberry brine went from intense sweet-salty, to a bit tart, to very pleasingly sour while their flesh became intriguingly meaty. The Noma Guide calls the brine created by lacto-fermented mushrooms a “Swiss Army knife” that they use to season \"everything from fennel tea to monkfish liver.\" Lacking either of those, I dribbled a spoonful on a sandwich with cheddar and fresh tomatoes, which gave the whole thing a lovely, deep mushroom-y flavor. Swiss Army knife, indeed, I thought, getting similarly pleasing results when I drizzled some over a slice of reheated pizza with pesto and goat cheese.We did have one significant flop. That pluot vinegar bubbled up a storm for a couple of days, eventually giving off a pleasant banana smell with boozy notes and bubbly fruit—early-stage booze!—but after about 10 days, it developed a layer of what looked like near-black fruit leather on top. I tried scraping it off, then stirring it up, but that didn't work so well, and a new layer of darkness appeared on the top in mere moments. I checked in with Brian and decided to dump it.Ya know what, though? I'd never made vinegar before, and everything else worked out pretty well. The Noma Guide preps you for the idea that not every experiment will work out every time. Besides, my wife Elisabeth, who jokingly referred to herself as a “kombucha professional” as she really enjoys the drink, gave my mango kombucha two thumbs up. Suddenly, taking another stab at vinegar sounded like fun!One of the things that I like most about the book is the combination of getting nerdy in the lab and handing that work off to Redzepi and his chefs who, with expert technique and refined palates, tell you what to do with what you've made. Sparkling citric koji amazake practically has “amazing” in its name, but I'd have no idea what to do with it. Made from rice koji, rice, and water, amazake is a sweet Japanese drink. The Noma Guide's riff on the recipe uses barley in place of the rice, and fermenting with A. luchuensis fungi. Redzepi and Zilber suggest combining it with olive oil, garlic and shallots, then steaming clams in that mixture, reducing the liquid, and pouring it over the finished clams.Sounds good, doesn't it? Prepare to be amazed.Instagram Cofounder Kevin Systrom spoke with WIRED's Lauren Goode as part of WIRED25, WIRED’s 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}