{"id": "(Pseudo) Scientific Strategies for Trick-or-Treating Like a Beast(Pseudo) Scientific Strategies for Trick-or-Treating Like a Beast", "paragraph": "If you are somewhere between the age when you get teeth and the age when you lose them, you are probably interested in candy. Since Halloween is the best night of the year to indulge your sweet tooth, it should be right up your spooky, deserted alley.You should know, though, that spooky, deserted alleys are actually very bad for Halloween celebrants interested in maximizing their hauls. And while you probably already knew that, maybe you’re not sure, exactly, what kind of place you should be prowling. The answer is out there, but this being the night of horrors, finding it requires a spot of mathematics.Our first equation comes from Paul Knight, an architect and city planner for Historical Concepts, an architecture firm, and the Doug Allen Institute for the Study of Cities. A few years ago, Knight wondered how to prove, pseudo-scientifically, that cities are the best places to trick-or-treat. But he thought there was a bigger lesson to be learned here: “It was kind of silly, because it's about trick-or-treating and having fun, but it’s also talking about very real principles of good urban design,\" he says.So Knight came up with a vital equation, which he wrote about on his blog:Total Candy Haul = Acres × (Residential buildings per acre) × (Families per building) × (Share of candy-giving families) × (Candy pieces per family)Say your typical suburban subdivision has about 3.8 single-family homes per acre. And say, in a place like that, the kids pledge themselves to a roughly mile-long trick-or-treating route, the equivalent of walking around six acres. Let’s assume that this route has plenty of family-friendly homes, with baskets of candy at the ready. In that case, we’re looking at:6 acres × (3.8 buildings per acre) × (1 family per building) × (80 percent candy-giving families) × (2 candies per family) = 36.5 pieces of candyThat’s about six candies per acre—not bad! But now, let’s move to a city. Here, our target neighborhood has one big apartment building that takes up a whole city block, and then a few other mixed-use buildings, where there’s a store on the bottom floor and families living above. One city block is about 2.2 acres, so let’s plan on hitting two. Let’s also assume that residents are a little less family-happy and generous here: Just 20 percent of families give out candy, and they only give out one piece each:4.2 acres × (an average 5 residential buildings per acre) × (an average 100 families per building) × (20 percent candy-giving families) × (1 candy per family) = 420 pieces of candyIt’s not even close: 100 candies per acre. And if you’re taking an elevator between building floors, you’re not even walking that much—max efficiency. To the apartment buildings, children!Knight’s not the only one crunching the data. Amy Hillier, a professor of city planning and social policy and practice at the University of Pennsylvania School of Design, has done some of her own strategizing on candy hauls. Her tips: Head to higher-income areas, which are more likely to give out more and better candy, but not the highest-income areas, which tend to have more security. Focus on neighborhoods with lot of intersections, which give kids plenty of connected routes to choose from. (“Cul-de-sacs are bad,” she says.)You’re going to want to stay safe as you collect, too, and it turns out that streets that are safe for Halloween walkers are safe for walkers all year round. Hillier recommends avoiding streets with fast car traffic.If you want to get even more quasi-scientific with it, Hillier suggests looking for places with evidence of civic life. That neighborhood with a volunteer corp and seasonal block parties a few times a year? That feeling of fellowship will probably extend to Halloween. “If you have lots of parties with your neighborhood, you’re going to want to engage with kids who walk down your streets,” she says. A quick Google search or neighborhood calendar might point the way.Hillier, for the record, intends to teach a class this week on ways to scrape and manipulate geographic data to discover the best Halloween haul strategies. But she has no intention of doing it herself. “I’m not going to subject to my children to that,” she says.\"The Nutcracker and the Four Realms\" stars Keira Knightley and Mackenzie Foy take the WIRED Autocomplete Interview and answer the internet's most searched questions about themselves. Does Keira Knightley have a baby? Is Mackenzie Foy related to Claire Foy? Where did Keira Knightley grow up?CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}