{"id": "Apple's New MacBook Air Is Thinner, Lighter, and Has a Retina Display", "paragraph": "It's the MacBook update everyone has been waiting for, and it's coming more than a decade after the laptop was first introduced.Apple today announced a new MacBook Air, one with a Retina display, slimmer bezels, and an even thinner and more lightweight body than the first MacBook Air, which had set new industry standards when it was first released. Apple CEO Tim Cook revealed the new laptop at a media event today in Brooklyn, New York, to cheers and a sea of smartphone users trying to capture the moment on their cameras.The New MacBook Air has same overall design, but now includes a 13.3-inch Retina display.But Apple's MacBook Air update is long overdue, and as sleek as the new MacBook appears to be, it's now entering a crowded market of slim, powerful laptops and convertible machines that attempt to bridge the laptop and tablet experience.The new MacBook Air has same overall design, but now includes a 13.3-inch Retina display, with four times the resolution as the display on the previous MacBook Air. Its bezels are significantly smaller, and somehow, the computer is thinner. Overall, it's 17 percent smaller than the last MacBook Air, and weighs just 2.75 pounds. Apple made point to say that this new machine is being made with 100 percent recycled aluminum.It also ships with TouchID, so users can authenticate with their fingerprints. This can be used both for Apple apps, like Apple Pay, and third-party apps, like 1Password. The fingerprint sensor is built right into a key on the keyboard, and the laptop now has Apple's T2 security chip, which debuted last year. This ensures a secure boot and encrypted storage. While TouchID is new to the MacBook Air, this is not new to the broader market: Premium Windows laptops have had fingerprint sensors for years now.The \"Force Touch\" trackpad on the MacBook Air is also larger, though it has the same butterfly-switch keyboard as the MacBook Pro, despite that design causing some issues for MacBook Pro users. The new MacBook Air has upgraded speakers, and a new three-microphone array allows you to shout at Siri—and not have to shout during group video chats.The MacBook Air was first introduced in 2008, when then-CEO Steve Jobs pulled it out of a manila interoffice envelope and wowed people with its slim, chiseled design. Since then it has received a couple of updates, but its design (including its low-res display) has remained entirely the same. Apple last \"updated\" the MacBook Air in 2017, although it was less of a major update and more of a chipset refresh.Meanwhile, Apple has continued to update its MacBook Pro line of laptops, aimed at professionals, as the name suggests. It also introduced a 12-inch laptop, simply called \"MacBook,\" into the lineup in recent years. But despite the 12-inch MacBook's convenient size—it's easy to mistake for a large iPad when it's closed—it's somewhat underpowered. The new MacBook Air has an an Intel i5 8th generation (Coffee Lake) processor. This should be more powerful than the Intel Core M3 in the 12-inch MacBook, though it's not the latest and greatest Intel processor. The new MacBook Air also starts at 16GB of RAM, double the amount in its predecessor, and ships with up to a 1.5 terabyte solid state drive.Its pricing isn't as friendly as the original MacBook Air, however. That once started at $999; this new laptop starts at $1,199. And that's for a paltry 128GB of storage. So Apple has finally delivered on an update to the MacBook Air that includes a high-resolution display, a super-thin body, and the continued promise of all-day battery life—but it's going to cost you more than you would have paid before.WIRED's Lauren Goode reviews the latest iPhone models -- the iPhone XS and iPhone XS Max -- and tests the battery life, camera and video capabilities.\nCORRECTION, Sept. 19, 5:05 PM EST: The video above misstated the water rating for the iPhone XS and XS Max. While the IP68 standard states that devices must be waterproof to more than 1 meter, Apple's new phones are waterproof up to 2 meters for up to 30 minutes.\"CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}