{"id": "Photo Gallery: Pulsars Beam Like Lighthouses in the CosmosPhoto Gallery: Pulsars Beam Like Lighthouses in the Cosmos", "paragraph": "Inside this supernova remnant called Kes 75, scientists have found the youngest known pulsar. NASA’s Chandra X-ray Observatory observed this region as it was expelling large amounts of x-ray light, seen here in bright purples and pinks. Astronomers think the star’s death took place around 500 years ago and the remaining debris is being pushed out by wind created from the spin of the pulsar, visible in blue.Imagine you are on board the Juno spacecraft and have just completed your 15th orbit of Jupiter. This is what you’d see as you started to move further along on your orbital path. Juno is in a very elongated orbit around the planet, swinging closely to it every 53 days—and when the spacecraft gets near, the view gets much more interesting. This image was taken a mere 55,600 miles away from the cloud tops.Introducing the barred spiral galaxy Messier 95, a ballet of stars located 35 million light years away in the constellation Leo. It’s one of the first objects discovered by comet hunter and French astronomer Charles Messier back in 1781. A bridge of stars connects Messier 95’s center to an inner ring forming new stars; add the encircling arms, which once hosted supernovae, and you have all the components of a barred spiral. Our own Milky Way is also a barred spiral galaxy that has had its share of supernovae, but lacks a star bridge. We’ll just have to live with that.The National Oceanic and Atmospheric Administration’s NOAA-20 satellite imaged the coast of the Florida Panhandle after Hurricane Michael made landfall. The image reflects the impact of the storm on electrical power, leaving large swaths of the area in darkness.Now for something completely different: Let’s look at the Hyperion Proto-Supercluster. Using the Visible Multi-Object Spectrograph at the European Southern Observatory's Very Large Telescope, astronomers examined the most remarkable supercluster of galaxies ever discovered—one that came into existence just 2 billion years after the Big Bang. (Our Milky Way itself lives in a supercluster called Virgo.) Hyperion is so massive that it could contain tens of thousands of galaxies, making it larger than 1 million billion Suns.Inside this supernova remnant called Kes 75, scientists have found the youngest known pulsar. NASA’s Chandra X-ray Observatory observed this region as it was expelling large amounts of x-ray light, seen here in bright purples and pinks. Astronomers think the star’s death took place around 500 years ago and the remaining debris is being pushed out by wind created from the spin of the pulsar, visible in blue.Imagine you are on board the Juno spacecraft and have just completed your 15th orbit of Jupiter. This is what you’d see as you started to move further along on your orbital path. Juno is in a very elongated orbit around the planet, swinging closely to it every 53 days—and when the spacecraft gets near, the view gets much more interesting. This image was taken a mere 55,600 miles away from the cloud tops.Introducing the barred spiral galaxy Messier 95, a ballet of stars located 35 million light years away in the constellation Leo. It’s one of the first objects discovered by comet hunter and French astronomer Charles Messier back in 1781. A bridge of stars connects Messier 95’s center to an inner ring forming new stars; add the encircling arms, which once hosted supernovae, and you have all the components of a barred spiral. Our own Milky Way is also a barred spiral galaxy that has had its share of supernovae, but lacks a star bridge. We’ll just have to live with that.The National Oceanic and Atmospheric Administration’s NOAA-20 satellite imaged the coast of the Florida Panhandle after Hurricane Michael made landfall. The image reflects the impact of the storm on electrical power, leaving large swaths of the area in darkness.Now for something completely different: Let’s look at the Hyperion Proto-Supercluster. Using the Visible Multi-Object Spectrograph at the European Southern Observatory's Very Large Telescope, astronomers examined the most remarkable supercluster of galaxies ever discovered—one that came into existence just 2 billion years after the Big Bang. (Our Milky Way itself lives in a supercluster called Virgo.) Hyperion is so massive that it could contain tens of thousands of galaxies, making it larger than 1 million billion Suns.Warm up your warp drive and grab some travel snacks, because we’re diving into deep space to the earliest days of the universe. This week, the European Southern Observatory released an image of a proto-galactic supercluster. That’s a mouthful, but deservedly so: Superclusters like this can contain tens of thousands of galaxies. Hyperion is the oldest and most massive one ever discovered, offering a rare inkling on what the universe was like some 11 billion years ago.Next we’ll pick through the remnants of a dead star and pulsar that seem to be lingering some 19,000 light years from Earth. When a massive star collapses in on itself it can create a neutron star, one of the most dense objects in the universe. A neutron star that spins is called a pulsar. The spin rate is so consistent that people who navigate spacecraft around our solar system use them as mile markers to know exactly where they are in space—sort of as the lighthouses of the cosmos.While observing this same region, astronomers found a large amount of highly magnetized activity; with NASA’s nifty Chandra X-ray Observatory, they were able to capture images of this pulsar. The star that created the now-visible supernova material likely died around 500 years ago. By studying such objects, scientists can learn more about how stars end their days, and what phenomena can take place long after their deaths.Keep your spacesuit on and your eyes peeled for more space oddities. View Wired’s full cosmic collection here.We speak with the Juno mission's lead scientist to find out what lies under Jupiter's poles.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}