{"id": "Tesla's Autopilot Now Changes Lanes—And You're Gonna Help It OutTesla's Autopilot Now Changes Lanes—And You're Gonna Help It Out", "paragraph": "If you’ve been driving your Tesla in the past week, you’re likely enjoying the major upgrade Elon Musk’s automaker just issued with a free, over-the-air software update. And if you believe the blog post trumpeting the advance, you’ve taken a major step towards chillaxing on the highway while the car handles the traffic for you. By accepting this download, owners give their cars the ability to “Navigate on Autopilot,” which Tesla says “guides a car from a highway’s on-ramp to off-ramp, including suggesting and making lane changes, navigating highway interchanges, and taking exits.”It comes with a mass of caveats though, not least that the driver still has to stay in control, and confirm every single move the computer comes up with. No surprise, owners are already debating how much better their cars really are now. Forget the short term reality: This is a long term play designed to help Tesla deliver on Musk’s promise of a truly self-driving vehicle.Every Tesla built since the end of 2016 comes with eight cameras around the car, a radar behind the front bumper, and ultrasonic proximity sensors embedded into the front and back bumpers. For $5,000, a driver can enable “Enhanced Autopilot,” a system that hasn’t done much to merit that adjective. Like similar systems from other automakers, it keeps the car between clear lane markings, and away from the car in front.What may have seemed odd is that Tesla puts those sensors into every single car, even if the new owner doesn’t pay the $5,000 for the feature. (It just doesn’t unlock the software that makes Autopilot work.) That’s an expensive move for an automaker stretched for money, but it’s a clever one.The big upside for Tesla is data gathering. The automaker can run its software in “shadow mode” on all those cars, to test new features against real roads, without the drivers ever being aware. The fleet of Tesla vehicles—growing at around 30,000 cars per month now—scoops up data about the environment and driver behavior, on a wide scale, at speed.That’s how Tesla can say it has covered tens of millions of miles to validate this latest Navigate on Autopilot feature, running it in the background, testing what the computer would have done, and how that compares to what a well-behaved human did. Tesla can also upload data from cars to run in simulations, to shake out as many bugs as possible. A wide variety of drivers on different roads also exposes its software to edge cases—weird one-offs, like when a worker just happens to have spilt a line of paint that looks like a lane marking but only when the sun is low on the horizon. These cases are both strange and countless, and a major pain for people working on self-driving.A video released by Tesla shows how Navigate on Autopilot should work. The driver enters a destination into the car’s navigation via the touchscreen, and hits a new “navigate on autopilot” button. Then they use Autopilot as normal, when it’s safe to do so, by double tapping a steering wheel stalk. But now, on roads where lane change suggestions are available (which is supposed to be on limited access highways) an on-screen graphic of their car will show with a blue line, shooting ahead, highlighting what it considers the best path.That will usually be straight on. But say there’s a slow truck up ahead: The blue line will bend, to show a switch to the left lane. The driver has to notice that, verify it’s safe to swap lanes, then tap the turn signal to give the robot the OK. Then, the car should execute the maneuver. (In typical Tesla style, options for how aggressive that merge can be are named Mild, Average, or Mad Max.) The car will also chime gently along with the suggestion on screen if the lane change is an essential one to stay on the suggested nav route. If you think it's a stupid or dangerous idea, just ignore it.Some drivers are already reporting that it feels like a gimmick. “On my morning commute downtown Navigate on Autopilot sticks like glue to the left lane until a quarter mile from the exit where it finally decides to try to cross six lanes,” one Atlanta driver griped on Reddit. “That’s about two miles too late...” Others complain that it’s distracting to try to keep an eye on the screen for suggested changes.But that’s also useful information for Elon’s automaker.“Tesla and other vehicle manufacturers really need to understand how humans interact with different levels of autonomy,” says Costa Samaras, a civil engineer who studies electric and autonomous vehicles at Carnegie Mellon University. Do drivers use the suggestions? How confident are they in them, and how quickly do they notice and accept them? Which setting do they use for how aggressive lane changes are?\"These types of partially automated features, where there’s a very visible human in the loop, enables them to get data and eventually make their systems better,\" says Samaras.Of course Tesla also wants customers to give it money, not just data, so releasing this futuristic sounding update, and talking up other Enhanced Autopilot abilities like enabling the car to drive off and park itself, and then come back (Musk says some version of that might be ready in six weeks) might mean more people pay the $5000 for sensors that Tesla will install anyway. That's important while the company tries to make a profit for a second quarter in a row.A spreadsheet added to voluntarily by people who’ve placed orders for Model 3s shows that of 186 people who report ordering the new, cheaper, $45,000 mid-range Model 3, 93 did not pay the extra for Enhanced Autopilot, perhaps unconvinced that they really need it.But if Tesla is using the data it can collect well, then the system should get better over time, convincing more people. Each confirmed or ignored suggested lane change from the human driver is a data point for how good the idea was. Everyone who uses Navigate on Autopilot is potentially teaching the system as a whole how to drive.To Tesla, you’re not just an end customer, you’re a beta tester—with a better product to look forward to with the next software update.Sebastian Thrun, CEO of Kittyhawk and president of Udacity, and Sam Altman, president of Y Combinator and co-chair of Open AI, spoke with WIRED’s Former Editor-in-Chief Chris Anderson as part of WIRED25, WIRED’s 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}