{"id": "Waymo Can Finally Bring Truly Driverless Cars to CaliforniaWaymo Can Finally Bring Truly Driverless Cars to California", "paragraph": "The driverless cars cometh. Waymo just became the first company allowed to test fully self-driving cars—the kind with no carbon-based beings behind the wheel—in the state of California.The outfit that started life as Google’s self-driving car project has been running driver-free cars in Arizona for almost a year, where the state testing rules are far more lax than in California, and where it plans to launch a commercial robo-taxi service by the end of the year. But securing the right to do the same in its home state is still a milestone, and evidence it can win over even comparatively wary regulators to the way of the robot.To begin, the truly driverless cars will test only at up to 65 mph in the southern Bay Area, in Mountain View, Sunnyvale, Los Altos, Los Altos Hills, and Palo Alto. (Waymo and its parent company Alphabet are headquartered in Mountain View.) The company said it will inform local governments before expanding its tests any further. And though Waymo has clearly stated its intention to run its own driverless taxi service, the company’s first driver-free passengers will only be employees. Waymo did not say when it will open its cars to the wider California public.To receive this first-of-its-kind permit, established by rules California introduced earlier this year, Waymo had to:That last and most important bit is a self-administered evaluation. When it applied for its permit back in April, Waymo pledged to the government that it had tested and validated its technology, and that it was “satisfied,” according to the rules of the regulations, that its vehicles are safe enough for public roads. But if state officials think the cars aren’t as safe as Waymo says, they can step in.“The DMV has the authority to immediately suspend or revoke a driverless testing permit ... to protect the safety of people on public roads,” says Marty Greenstein, a public information officer at the California DMV.In the absence of firm federal rules governing the testing of self-driving cars, California’s DMV is widely regarded as the most advanced and involved regulator of this space. It has granted 60 companies, including Waymo, the more basic version of its AV learner’s permit, which allows testing on public roads with a human behind the wheel. (The Alphabet company says it will continue to test cars with safety drivers in the Bay Area too.)With this announcement, Waymo’s self-driving Chrysler Pacifica SUVs join their brothers and sisters down in metro Phoenix, Arizona. Waymo has said that it will launch a driverless taxi service in that state by the end of this year. Its “early rider program” will eventually have hundreds of local participants, self-selected (and Waymo-approved) beta testers who are helping the company iron out its user interfaces and learn more about how self-driving robots should interact with humans. Waymo is also giving rides to some local public transit workers, Walmart shoppers, and business travelers staying at a Chandler, Arizona, hotel.Waymo recently “moved into very early days of commercialization,” Alphabet CFO Ruth Porat said during an Alphabet earnings call last week. She said some riders are now handing over real dollars for rides in Arizona, as the company tests out its pricing levels.Waymo’s tests have not been frustration-free. The Information reported in August that the company’s cars in Arizona were having trouble with left turns and sudden stops. And a recent report by The New Yorker suggested Waymo’s early years—when it was still part of Google—were mired by crashes and reckless, unsafe road incidents, one of which left an exec with lasting spine problems.But whatever happened in its past, Waymo believes it’s ready to deliver the driverless future it has long promised. The California DMV, at least, seems ready to watch it roll in.\"The Nutcracker and the Four Realms\" stars Keira Knightley and Mackenzie Foy take the WIRED Autocomplete Interview and answer the internet's most searched questions about themselves. Does Keira Knightley have a baby? Is Mackenzie Foy related to Claire Foy? Where did Keira Knightley grow up?CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}