{"id": "Fusty Ol' Scientific Texts Get a Gorgeous, Pricey MakeoverFusty Ol' Scientific Texts Get a Gorgeous, Pricey Makeover", "paragraph": "Alexander von Humboldt began his working life as a mine inspector for the Prussian government. But in his late twenties, he left his government gig and set off to explore Venezuela, Cuba, Mexico, Colombia, and Peru with botanist Aime Bonpland.He did an astounding amount of work during his travels, in pursuit of his hypothesis that “all forces of nature are interlaced and interwoven”—and that, maybe, he could figure out how. He mapped the Orinoco River; he saw Mercury pass in front of the sun; he realized that guano was fertilizer; he sliced into and was shocked by electric eels; he studied Inca ruins; he catalogued 2,000 new plant species. Humboldt became not just an inspector but also an interpreter of the world, and he settled down in Paris to share his thoughts and illustrations in 30 written volumes. People loved it, and they loved him. He was one of the most famous people in Europe.Until, that is, he wasn’t. Public memory is short, and others—like Darwin—scaffolded their knowledge onto his, becoming the new names on people’s lips.Like most of us today, publisher Jordi Anton wasn’t familiar with Humboldt until he read a biography by Andrea Wulf, which the New York Review of Books brags “will make Humboldtians of us all.” It certainly made one of Anton, who set out on a journey to learn more—and possibly bring Humboldt's work back to the limelight as part of his own print business. “[Wulf] talks repeatedly about the illustrations of his trips,” says Anton, “but after researching a bit on the internet, it was very difficult to find this material for the general public.”Anton decided to change that.  Unlike most of us, he had the tools to do so. He’s the founder of a small, independent press called Kronecker Wallis, which republishes original, seminal scientific works, with modern, clean design. They're the kind of thing you’d be proud to stash on your Swedish coffee table. That attention to aesthetics is partly because beautiful is better, but also because the bones of these old works are largely in the public domain. Anyone can go get the text for free. If you want people to pay for a copy, you have to add something—and Anton is asking people to pay quite a bit for them, with texts ranging from around $40 up to $200. That puts them out of reach of many readers, and suggests that they are as much art objects as they are scientific studies.Still, Anton hopes people will do more than impress their friends with fancy spines. He wants people to actually read them, and appreciate the science that brought us the understanding we have today. “If we think about it from the point of view of literature in general, I would ask myself why we should be interested in the first edition of Alice in Wonderland, Jane Eyre or Anna Karenina?” says Anton. “Reading the work as it was written by its author transports us to how they imagined it while writing it, how the author chose each of the words and not others.”Setting aside the commercialism, it's a philosophy that historians enthusiastically endorse, to help people understand that science is not a set of static facts but a process that will likely unfold until there aren't humans anymore. Design-y reprints might be an effective way to convey that reality, for those willing to plunk down for a collectible. Kronecker Wallis's edition of Humboldt's work, called Illustrating Nature, showcases his text and illustrations as if the book itself were a modern museum, with tri-column trilingual copy, antique-y prints, full-bleed diagrams, and bound insert pages of explanation in neutral Army colors.So far, Kronecker Wallis has published Newton’s Principia, and will be shipping out his Opticks and a college notebook of his early next year. Around then, too, the press will publish a visually amped up version of Euclid’s Elements, a 13-book series. In the mid-1800s, author and engineer Oliver Byrne republished the first six of those, reimagining them graphically, using visuals that seem straight from the brush of Piet Mondrian. But Byrne didn’t finish the job. Anton would like to: all 13, illustration-centric.“Euclid’s book is probably the most important scientific book of all time,” says Michael Gordin, a Princeton science historian1 who uses historical primary sources in his classes (some schools, like St. Johns College, go even further, and incorporate “Great Books” into a whole curriculum). Yet it's not a given that reading the works of Newton, or Carl Linnaeus, or any of the other pioneers is worth students' time, now that their insights are centuries out of date.The reason has to do with the culture of science as much as the science itself. Neither Linnaeus nor Newton—nor anyone, ever—was right, or complete, about everything. There are ideas in old, once-dogmatic science that we bright modern folk can now laugh off. The topography of your skull tells of your character and intellect? Haha, what idiots phrenologists were. Gordin tries to train his students to look at such research as people saw it in its prime, to read it like they would an Astrophysical Journal paper from June. “I want them to get to think that way about the opposite thing, the thing that is not considered correct,” says Gordin, “to understand why a very smart person might believe it. That’s a way of learning empathy for the past, and a way to see that the truth we know now is not obvious.”What seems true now probably also isn’t permanent. Just as the \"knowledge\" that Earth is the center of the universe was tossed into the void, “most of the science that’s published this year, in 10 years we’ll think was wrong,” says Gordin. \"Not completely wrong. But incomplete or with inadequate variables. That’s the way science works.”But that’s not often the way students, at least early in their education, learn about science. Most people grow up thinking about science in a textbook-centric way. “Textbooks, if you think about it, are a list of statements,” says Massimo Mazzotti, director of Berkeley’s Center for Science, Technology, Medicine, & Society. “Very clear, very neat: ‘This is what we think is the case.’”When reading a historical scientist’s account of their own work, though, a different sentiment sticks out. “It’s more like, ‘Things are complicated,’” says Mazzotti. “People are struggling to understand how the world works.”Those people—Darwin, Newton, lots of other old white men—were also steeped in the assumptions and conventions of their time, which is easier to see when you’re not of their time. That means, by inference, that the scientists of our time are (gasp!) subject to their own biases, whether scientific or social. “As a scientist in our society, you’re not trained to start questioning the broader framework in which you’re working,” says Mazzotti. A little historical context could help with that.You don't need a pretty copy of Principia to do that. Mazzotti's and Gordin's classes are probably full of kids who just downloaded PDFs, with no special layout to distract from or enhance the philosophical or scientific points. Kronecker Wallis's editions, meanwhile, are very limited, and very expensive—their price the price of art for display and admiration, rather than pure analytical perusal. They are decidedly not the ones that will bring historical awareness or humility to the masses. When a curious dilettante or a serious student wants some context, they'll still likely turn to library loans or free ebooks. But if part of Kronecker Wallis's point is also to unite two cultures (here's a free copy of author and chemist C.P. Snow's eponymous treatise on the division between science and the humanities), portraying old science as an exquisite object—and also something that isn't locked in its original form, confined to its original era—then a bound edition with weight and gloss can convey that, to a certain well-heeled demographic.For any kind of edition, though, fancy or not, seeing a big bound book of science, caught up in its own struggles and assumptions, is humbling, not just for scientists but for anyone who enjoys the fruits of their labor, some of which will warp and rot in time. “You’re just one moment, one iteration, in the process of knowledge-making,” says Mazzotti. Maybe someday, someone will reprint your work, and use it as an example of just how absurd those 21st-century intellectuals were. And that future person will see, through your flaws, that they too will never be totally right. All forces of nature are interlaced and interwoven, after all, and those forces include us.1Update 10-19-18 2:15 pm EDT: This story has been updated to reflect Michael Gordin's institutional affiliation.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}