{"id": "Making a Stormtrooper Out of Bodies Is Easier Than You'd ThinkMaking a Stormtrooper Out of Bodies Is Easier Than You'd Think", "paragraph": "If the work of Pilobolus looks familiar, it’s probably because you’ve seen them on the Oscars. Or on YouTube. Though the dance troupe was founded in 1971 at Dartmouth College, the group’s most recent spate of notoriety comes from its projected shadow play routines, multi-person performances done behind a screen that give the illusion that multiple bodies have morphed into animals, plants, and other objects.Ever since Pilobolus started doing the shadow routines, they’ve gotten massive amounts of attention: trips to The Oprah Winfrey Show, work in car commercials, and—yes—a gig acting out the Best Picture nominees at the 79th Academy Awards. In 2009, they launched an entire Shadowland show, all based on the shapes people could act out with their bodies and maybe a few stretch-y pieces of clothing.\"Limitations are awesome for creativity,\" says Renee Jaworski, one of Pilobolus’ artistic directors \"They are super helpful, because if the world is your oyster then it’s really hard to make a decision. But when there are limitations there are rules and you work within those rules and suddenly you have to be creative to bend those rules and push the boundaries of what is possible in that world.\"Recently, WIRED put that creativity to the test and asked Jaworski’s dancers to do a lightning round, creating shadow formations on the spot based on images we gave them. The best one they pulled off? A Star Wars stormtrooper. After a little bit of plotting they got it all—the shape of the helmet, those angular eyes, that menacing grill. Pilobolus makes it look easy, but it’s actually just the result of years of practice. “You have to be willing to fail,” says Matt Kent, another of the troupe’s artistic directors, \"that’s our guard against mediocrity.\"Watch Pilobolus create a shadow stormtrooper and many more inspired shapes in the video above.Former Chief of Disguise for the CIA, Jonna Mendez, explains how disguises are used in the CIA, and what aspects to the deception make for an effective disguise.\nYou can watch new episodes of WIRED MASTERMINDS on your smart TV.\nhttps://www.wired.com/brandlab/2018/06/wired-smart-tv-app-new-way-watch-wired/CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}