{"id": "These Wasp-Like Drones Lift Heavy Loads With Their BelliesThese Wasp-Like Drones Lift Heavy Loads With Their Bellies", "paragraph": "You might know wasps for their ability to brainwash cockroaches or inflict one of the most painful stings on Earth—one so powerful that the actual scientific advice to victims is to just lie down and scream until it passes.  Lesser-known is the wasp’s superlative ability to carry loads that are unexpectedly heavy given the creature’s size.Small drones, or “micro air vehicles,” are only able to lift the equivalent of their own weight. If we want flying robots that can move massive objects without requiring them to be the size of pterodactyls, engineers will need to come up with new ways of lifting stuff. So drone designers are looking to wasps for help, and developing creative ways to use the environment itself as a secret weapon in robotics.If a wasp stings and knocks out prey that’s too big for it to fly off with, the predator drags the thing away. It can do this using a structure on its feet called an arolium, a pad that helps them get a grip on a surface. Combined with claws on the feet, the arolium allows wasps to maneuver objects that they can’t outright fly away with. Which means they can punch—or sting—far above their weight class.Engineers want drones to do the same. So a new class of robots, known as FlyCroTugs, takes a cue from these feisty fliers. On the surface, they look like regular old quadrotors that would fit in your palm. But the secret is hidden away on their bellies. While sitting on the ground, one version of the machine uses hooks to snag bumps and pits to anchor itself to the surface like a wasp’s claws do, while another version uses a pad to stick to a smooth surface. The machines can then use a tiny winch to lift and drag things up to 40 times their own weight.The physics of the hooks are pretty straightforward—good old anchoring for leverage. “We're just trying to get these hooks lined up, one right next to another, and have them each be able to find their own bump and all pull together to generate larger forces than a single hook could,” says Stanford roboticist Matthew Estrada, who describes the machines today in Science Robotics.The physics of the pad, on the other hand, are more dazzling. The technology, which is inspired not by wasp feet but gecko feet, isn’t particularly new—Stanford researchers have already used it to, for instance, design a gripper that might one day grab space junk in orbit. But the resulting forces can also give the FlyCroTug a gecko-like grip and give it the ability to lift like an insect.That trick relies on what’s called van der Waals forces. A material on the bottom of the drone is packed with tiny silicone ridges. When it makes contact with a smooth surface, and you tug on it, the ridges align to the surface in a uniform direction. (As you can see in the GIF below.) “They all lay down and create very intimate contact with whatever they're pressed up against,” says Estrada. The contact is so intimate that a minute attraction develops on the molecular level for each ridge. Because there’s so many of them packed into the material, those forces add up to produce excellent adhesion.That’s how geckos can manage to walk up a wall, and how the FlyCroTugs can lift 40 times their weight. As long as the robots are sitting stationary on, say, the edge of a table, they can use van der Waals forces to winch objects far heavier than themselves. So lifting a water bottle that’s sitting down on the ground, for instance.If you wanted to lift something bigger, you could employ several of these tiny robots. That might be more useful than simply scaling the drones up to increase their power. This approach might make them cheaper to manufacture, and allow them to work their way into tight spaces if need be. Who needs bulk when you’ve got numbers?Unlike earlier bio-inspired drones, FlyCroTug doesn't look for inspiration in a wasp merely as a flying animal, but as a larger system. \"Flying insects are not just about flying when they carry an object,\" says Caltech roboticist Soon-Jo Chung, who's developed a bat-inspired drone. They also drag loads that would otherwise be too much to carry. \"That's the very interesting innovation and contribution of this paper.\"In other words, making use of the ground or another feature of the environment can help supercharge new robots. Most bots roll on the ground or fly through the air without interacting much with their surroundings. FlyCroTugs are fundamentally different: They leverage the environment itself to increase their power. A surface isn’t just something to navigate, it’s something to use as a tool for some serious winching.This new lifting ability isn’t only useful for dragging around big objects. Two robots can also work together to manage a complex manipulation such as opening a door. The first drone wheels into position and extends a spring-loaded hook under the door. The second robot’s own spring-loaded hook snags the handle. Then, braced against the door, the second robot tugs the handle down while the first robot tugs the door open.The idea is that groups of adhesive robots can tackle tasks that individual robots might struggle with. “Maybe think of each robot as a move on a chess board,” says Estrada. “How are you going to build up exerting these forces in different directions to attain more dexterous tasks?” Instead of loading complex capabilities into one highly sophisticated and expensive robot, the solution in some cases may be to coordinate multiple bots instead.Or at some point the researchers could combine the two techniques—hooks for grabbing onto rough materials and pads for smooth ones—in a single drone that works on a wider array of surfaces.While leaving out the stinger, of course. Let’s go ahead and leave that path unexplored.The robotic snake has 16 windpipe-constricting actuators, but this serpent bot is more likely to save your life than suck it out of you.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}