{"id": "Beep! Bloop! Buzz! Why Do UX Designers Often Neglect Sound?Beep! Bloop! Buzz! Why Do UX Designers Often Neglect Sound?", "paragraph": "Imagine you’ve finished shopping. Then, just as you're getting ready to leave, the chip reader shrieks at you to remove your credit card. No matter how pleasant the shopping experience was or how nice the checkout person, the last thing you'll hear before exiting the store is that grating noise—a sound that, statically speaking, affects your subconscious as negatively as nails on a chalkboard. It’s a great example of what we call \"sonic trash\": sounds that are unpleasant, emotionally distressing, and degrading to everyday experiences.Kevin Perlmutter is EVP, Chief of Innovation at sonic studio Man Made Music.Most companies would never consider using an online library to select their brand logo or visual identity. Yet they frequently allow their products to go out into the world with cheaply produced or licensed sounds downloaded from a mass market sound effects library.Why this undervaluation of sound and music? The reality is that most brand marketers and product designers are not aware of the positive or negative impact sound has on the consumer experience. But the cognitive and emotional effect is greater than you think.We partnered with Sentient Decision Science, a behavioral science research firm, to quantify this relationship using Implicit Association Testing, an online experiment that scientifically measures the strength of an individual’s associations between concepts and emotions.In this study, we assessed the strength of association between 20 different sounds and the emotion they inspired: 10 naturally occurring sounds—from a bird singing to squealing brakes—and 10 \"designed\" sounds created for products and experiences, like a microwave, a severe weather alert, and streaming TV sounds. (Our reactions to naturally occurring sounds provide intuitive reference points for evaluating emotional responses to designed sounds.) The test produces an index score for each sound that rates how negatively or positively it makes the individual feel. We assessed the same sounds with a conscious choice experiment called MaxDiff, in which respondents played each sound and rated whether or not they'd want to hear it again.We found an 86 percent correlation between how sound makes people feel at the subconscious level and their conscious desire to have or avoid that experience in the future. We also know from the research of customer experience consultancy The Temkin Group that emotion is the strongest driver of customer loyalty. Put simply, greater positive emotion will drive greater loyalty, and vice versa.Bringing these two data points together make a compelling case for designing sound that has positive emotional appeal. If people can’t avoid a bad experience in the short term, they will accumulate negative reactions, skewing their feelings about the experience. Eventually, this adverse impression can diminish the use of a brand or device and discourage repeat purchases.Our research revealed that pained scream was the most unpleasant sound tested (with an Emotional Index value of 91.5), while that of a baby laughing was the most pleasant (Emotional Index = 116.8). These scores offer an objective measure of what we instinctively know, but we also found that many designed sounds fall into a territory that indicates a lack of purposeful sonic design.That credit card chip reader sound has an emotional appeal of 95.7, just slightly better than nails on a chalkboard. In that same range is the relentless beeping of a typical microwave when your food is done. The least appealing designed sound we tested was the government issued Emergency Broadcast Alert—with an Emotional Index of 93.1, it’s only marginally better than hearing a pained scream.Interestingly, the most appealing designed sound we tested was that of The Weather Channel's Severe Weather Alert on its mobile app, which falls somewhere between an orchestra tuning and the sound of applause (Emotional Index = 107.8).  Not far off, with an emotional index of 107, was Disney Now’s streaming media UX sounds.Context also plays a role in amplifying the impact of sound. For example, we evaluated two home security keypad alert sounds—one with a high-pitched, piercing tone and another with a warm heartbeat sound. In isolation, the first one is deep in sonic trash territory and the other is in the neutral zone. However, when the sounds were associated with a photo of a home security keypad, the high-pitched sound remained in emotionally distressful zone, but the heartbeat sound jumped to significantly positive on subconscious level.When you put these sounds in the context of an experience, you realize that the home security system keypad sound is not there to alert you to an intruder; that first sonic alert is to remind you to turn off the alarm when you return home. When it squawks at you, it triggers a subconscious negative emotional reaction. When it warmly welcomes you, you instinctively feel positive about the experience and are more likely—our research shows up to 86 percent more likely—to want to have that experience again.The clear takeaway for brand and product designers is that sound can create or destroy value, depending on how effectively it’s used. No matter how small or expansive the medium, designers can bring empathy, efficiency, and emotional engagement to an experience by purposefully creating and curating appealing sounds. This directly drives consumers’ desire to interact with the brand or product in the future. “We’ve shown that sound doesn’t have to be obnoxious to get someone’s attention,” concludes Cyrus McCandless, Sentient Decision Science's VP of Scientific Discovery & Innovation. That's music to all our ears.WIRED Opinion publishes pieces written by outside contributors and represents a wide range of viewpoints. Read more opinions here.It turns out emotions are complex (surprise!), and sometimes words just can’t do justice in expressing them. Cove, a new app, helps translate feelings into music.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}