{"id": "LeBron James Is More Than an All-Time Great—He’s a MogulLeBron James Is More Than an All-Time Great—He’s a Mogul", "paragraph": "The LeBron James era in Los Angeles began, predictably enough, with all the flash and drama of a Hollywood blockbuster: a home-court introduction from rapper-actor Ice Cube, a slew of replay-worthy dunks, and an end-of-game fracas against the Rockets that culminated in a miasma of ejections, suspensions, and fines. Just as predictably, the LeBron James era kicked off with a trio of losses—what, according to critics, is expected to be the first of many. As a three-time NBA champion and seven-time MVP, James is among the most dominant players to grace the hardwood. Still, for the first time in nearly a decade, his supernova talents likely won't be enough to catapult his team into the finals.What is less questionable this season, however, is James’ off-court presence. He has just as effectively proven to be the rare multi-hyphenate athlete whose impact extends well beyond the league—it’s LeBron as activist, philanthropist, and emergent business titan. In moving to LA as part of a much-ballyhooed four-year, $154-million deal, James fully positions himself as an enterprise of change, a one-man orbit whose aspirations signal a new kind of moguldom for athletes: one centered on social good.Nike, Colin Kaepernick, and the Changing Role of the AthleteHow The Best Jumpers in the World Fly So Damn HighWatch a Sporty AI Teach Itself to Dribble Better Than YouNearly since his entrance into the NBA in 2003, James has moved with the eyes of the crowd on his back. He’s a populist, if decisive, figure who has done more to shape the league, and the image of its athletes, than just about any player: rekindling the superteam era by joining Chris Bosh and Dwyane Wade on the Miami Heat in 2010; testing our understanding of the athlete-activist by wearing an “I Can’t Breathe” t-shirt to honor Eric Garner in 2014; calling President Trump a “bum” on Twitter last year for using sports as a dividing force instead of a unifying one.Each of those actions has come after careful consideration; for an athlete who makes in excess of $50 million yearly from endorsements, voicing conviction is always a calculation. For James, though, legacy has always trumped risk. And in signing with the Lakers, besieged as they are by unrealized potential, he made the ultimate legacy play, one that stands to immortalize him while also solidifying his footprint as an influential Hollywood executive.When James founded production company SpringHill Entertainment with his childhood friend Maverick Carter in 2015, the original idea was to leverage the athlete's star power from behind the camera; a move that would allow the company to slowly find its own identity outside James magnetism. Early on, though, SpringHill safely flirted with sports biography: including a prize-winning documentary about James’s high school days, More than a Game, and I Am Giant, which chronicled the trials of former NFL wide receiver Victor Cruz. Even scripted shows, like Showtime sitcom Survivor’s Remorse, paralleled James’ rise out of adversity to basketball phenom.What’s on tap for SpringHill in the coming year, though, seems more in line with James evolving, socially-conscious moguldom. In addition to HBO’s The Shop—an unscripted series where James and his famous friends (Odell Beckham Jr, Snoop Dogg, Drake, and Candace Parker among them) confab in a barbershop about adulthood, racial expectations, and more—the company is currently developing a limited-series starring Octavia Spencer as Madame C.J. Walker, the first black woman millionaire (it was acquired by Netflix); a documentary about the controversial champion boxer Muhammad Ali; Lean On Me, a CW drama inspired by the 1989 film that follows a young educator trying to “transform a failing campus into an urban oasis;” and a three-part HBO documentary about the athlete’s role in the political sphere titled Shut Up and Dribble. (The company also has shows in development with NBC, Starz, and Facebook.)It’s hard to pinpoint exactly when James had his political awakening. He was raised in a single-parent, paycheck-to-paycheck household in Akron, so it’s likely he’s always understood the weight of his skin, and the consequence it carries in America. But as his foray into television and film has continued, each project has functioned as a conduit, even a conversation starter, for larger messages around race, politics, and social justice. Within each of these undertakings is a push for wider representation, a calculated gamble that seeks disruption and balance behind and in front of the screen.James’s growing reach, of course, extends past these projects—he’s reportedly in talks to produce a Friday the 13th reboot—and even past the glint of Hollywood. This summer, in July, he opened the first I Promise educational facility in a bid to revolutionize public education. An Akron-based non-charter school that plans to do more than just educate students, its offers what administrators refer to as “wraparound” services—each student is supplied with a Chromebook and a bicycle, has access to the school’s pantry, is provided with job and family services, tutors, as well as emotional and psychological services. All graduates are guaranteed free tuition to the University of Akron beginning in 2021. “When people ask me why a school, it’s because I know exactly what these 240 kids are going through,” James said in a speech during the school’s opening ceremony. “I’ve been there.”Increasingly, as players have invested in outside entities—most noticeably, the Golden State Warriors’ Kevin Durant  made a series of investments in Silicon Valley startups, following the lead of his teammate Andre Iguodala—James has continually bet on himself. It reminds me of what he said during his I Promise speech: about having been there. Having accrued the experience to know what it would eventually take to make a lasting imprint. It’s about opportunity and representation. It’s perhaps James’ most vital lesson, the one that will define his legacy: In trying to change a system, he built—and became—his own.From what shots are the most efficient to how defenders alter offense in the post to placing a value on every action on the court, they’re helping bring hoops into the big data era. See here how they do it.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}