{"id": "While You Were Offline: Memes, Malevolently Misleading Movies, and Other Midterms MadnessWhile You Were Offline: Memes, Malevolently Misleading Movies, and Other Midterms Madness", "paragraph": "Another week, another seven days so full of events that it’s difficult to remember all that’s happened. That’s especially true on a week that saw another mass shooting, as if everyone needed a reminder of what that felt like. I mean, we were just a week out from the last one, so perhaps some people had forgotten. Elsewhere, California is on fire again, Scotland has made LGBTQ education compulsory and someone’s getting free soup. Of course, this week was dominated by the midterm elections, which took place on Tuesday, but lingers like a cold; results and hot takes are still coming in as I write this, despite everything else that happened this week to steal the attention of the internet. What kinds of everything else? We're glad you asked!What Happened: Normally, it’s only the President of the United States who prematurely ages during his White House tenure—but according to this week's favorite meme, it’s happened to all of us.Where It Blew Up: Twitter, media reportsWhat Really Happened: It was fair to say that a lot of people had a lot of anxiety about this week’s midterm elections. They were, after all, being touted as the most important in a generation and a potential rebuke to President Trump, even though he personally wasn’t on the ballot and refused to take responsibility for any Republican losses, even though many GOP House members fretted that he had hijacked the campaign. No surprise, then, that people took to Twitter prior to Election Day to vent their anxiety.https://twitter.com/brianscully/status/1059246612193566720https://twitter.com/JenniferReitman/status/1059467406572052480https://twitter.com/meganamram/status/1059497475336294401https://twitter.com/JordanMeehan/status/1059556946313928706https://twitter.com/alex_segura/status/1059539074690760704https://twitter.com/jbouie/status/1059591771208990720As the meme got picked up by the media, at least one person took a different approach to the meme, just to emphasize that the election hadn't actually happened yet.https://twitter.com/loislane79/status/1059536762651865088Let’s be honest: as a motivator, this is far, far better than the ensuing deluge of “I Voted” sticker selfies across social media.The Takeaway: At least Concerned Voter and celebrity Mark Ruffalo impersonator Mark Ruffalo joined in—because aren't we all Bruce Banner these days?https://twitter.com/MarkRuffalo/status/1059924254278463488What Happened: In his first public appearance after the midterms, President Trump seemed like he wanted to come across as unbothered—but the reality was just the opposite.Where It Blew Up: Twitter, media reportsWhat Really Happened: So, yes; the midterm elections happened, and even if people debated the reality of the “Blue Wave,” Democrats took control of the House for the first time in eight years, giving them the chance to investigate his dealings (and his taxes) and curb his power. Many people wondered just how he’d react, but the president’s initial response to the midterms was certainly not what people expected:https://twitter.com/realDonaldTrump/status/1060022696703070208https://twitter.com/realDonaldTrump/status/1060130202418864129https://twitter.com/realDonaldTrump/status/1060141780878979072https://twitter.com/realDonaldTrump/status/1060153052676702208Pressing ahead with his weird victory lap, he announced a press conference for the next morning:https://twitter.com/realDonaldTrump/status/1060148982968733696How did it go? Probably not the way he imagined.https://twitter.com/markknoller/status/1060215964044873728https://twitter.com/NiallStanage/status/1060216453713068032https://twitter.com/jdawsey1/status/1060218490110595073https://twitter.com/maggieNYT/status/1060218045313019904https://twitter.com/Olivianuzzi/status/1060218954147348480https://twitter.com/PhilipRucker/status/1060223826204725248https://twitter.com/peterbakernyt/status/1060225476164272128https://twitter.com/NPRinskeep/status/1060228773851873280https://twitter.com/W7VOA/status/1060230920043720705https://twitter.com/LisaDNews/status/1060231982888685568https://twitter.com/liamstack/status/1060233729040437248The surreal, combative, disaster was obviously much discussed across the media, because of course it was; it was a chance to watch the President live down to everyone’s worst expectations across an almost unbelievable 87 minutes. All that was missing was someone being fired by proxy from the White House — but, wait, we’ll get there soon enough.The Takeaway: What should be the takeaway from this meltdown? Let’s go with the one that perfectly summarizes the problem, as President Trump would no doubt be secretly delighted by it.https://twitter.com/jeffmason1/status/1060227902569099264What Happened: The Trump Administration takes its war on the press to the next level after a particularly intense confrontation gets the literal fake-news treatment.Where It Blew Up: Twitter, media reportsWhat Really Happened: By Thursday, it had become obvious that an exchange between the President and CNN reporter Jim Acosta during the previous day's press conference had turned into something far bigger than the traditional Presidential press bullying. The problem—well, a problem—began as the right-wing Twitterverse sought to use the moment to bring down Acosta:https://twitter.com/derekahunter/status/1060243172041912322https://twitter.com/TeaPartyNJ/status/1060376039833194496https://twitter.com/Cernovich/status/1060275618976194560Did it work? Better than anyone could have anticipated. (“Better” in a very specific context, of course.)https://twitter.com/Acosta/status/1060332691143491584https://twitter.com/Acosta/status/1060334166083059712Yes, the White House pulled Acosta’s press credentials after the press conference, which is a totally normal thing to do, yes, definitely. Hey, Press Secretary Sarah Huckabee Sanders, what gives?https://twitter.com/PressSec/status/1060333619728801792https://twitter.com/PressSec/status/1060334818796453889https://twitter.com/PressSec/status/1060335251682222085In other words, Sanders was repeating the right-wing version of events, which is problematic for reasons we’re about to get to. Before that, though, CNN responded quickly:https://twitter.com/CNNPR/status/1060350746703597568The network wasn’t the only organization releasing a statement:https://twitter.com/PeterAlexander/status/1060358411739652097https://twitter.com/JeffMcMillanPA/status/1060634237953589251https://twitter.com/sejorg/status/1060636256474984448https://twitter.com/dabeard/status/1060410384404819968Here’s the thing, though; Jim Acosta didn’t actually do what he was accused of by Sanders and the White House, as he pointed out:https://twitter.com/Acosta/status/1060336119315873792It doesn’t have to rely on his word, though; the press conference was broadcast live, including the event (mis-)described by Sanders; but that didn’t stop Sanders from tweeting out a doctored video in support of her argument:https://twitter.com/PressSec/status/1060374680991883265Yes, that’s right; the White House press secretary was sharing a doctored video to argue her case. Funny story — it was actually the same video that had been posted by an InfoWars contributor earlier that evening:https://twitter.com/PrisonPlanet/status/1060344443616800768People noticed the connection.https://twitter.com/brianstelter/status/1060409752650506240https://twitter.com/RaySteeleRTV6/status/1060514199040864257https://twitter.com/Elise_Jordan/status/1060514693322813440Here’s CNN’s VP of Communications and Digital Partnerships on the release:https://twitter.com/mdornic/status/1060500212307910661Oh, and here’s a comparison between the raw footage and the version posted by—once again—the White House press secretary:https://twitter.com/rafaelshimunov/status/1060450557817708544The dude from InfoWars claimed that he hadn't touched the video:https://twitter.com/PrisonPlanet/status/1060513688208240640Well, surely he's telling the truth, right?https://twitter.com/MikeStuchbery_/status/1060535993525264384At time of writing, reporters are condemning the White House’s move, and others are making the argument that this isn’t a fight the President should have. You’d think that that someone so stuck in the past as President Trump would remember the saying about never arguing with people who buy ink by the barrel…The Takeaway: This is just the beginning of a bigger fight—and one that's likely going to happen sooner rather than later.https://twitter.com/melissakchan/status/1060531575492935680What Happened: If no one expects the Spanish Inquisition, and no one expected the president to fire his attorney general immediately after the midterm elections, does that mean that Jeff Sessions was a victim of the Spanish Inquisition? Asking for a friend who may or may not be fired A.G. Jeff Sessions.Where It Blew Up: Twitter, media reportsWhat Really Happened: As if this week wasn’t seem busy enough with everything happening all at once, a tidbit of news broke just an hour or so after the Wednesday press conference, potentially explaining why the President was acting so testy. (As if the midterms wouldn’t have been explanation enough.)https://twitter.com/AP_Politics/status/1060256970685452288…Wait. What? But, yes, the Attorney General had resigned, when no one was expecting it.https://twitter.com/SchneiderCNN/status/1060257660388413440Please note the opening sentence of that letter, because it’s important:https://twitter.com/lourdesgnavarro/status/1060258932915085318Yes, the resignation came at the President’s request, which is to say, Jeff Sessions was fired, which is a big deal. As should be expected, the internet was sad to see him go:https://twitter.com/sarahkendzior/status/1060259019795898369https://twitter.com/ashleyfeinberg/status/1060258991853522949https://twitter.com/morninggloria/status/1060265844242935808But people didn’t get too carried away with the upside of what was unfolding, because once again, the President firing his Attorney General when he’s under investigation by the authorities overseen by that Attorney General is a big deal:https://twitter.com/JuddLegum/status/1060265985423360000https://twitter.com/TomSteyer/status/1060269404561137664https://twitter.com/markknoller/status/1060261140540936193https://twitter.com/SenWarren/status/1060283871802130456The President announced his replacement via Twitter, because of course he did:https://twitter.com/realDonaldTrump/status/1060256619383193601As if we needed any more proof that the government is a well-oiled machine these days, Twitter was also how people at the Department of Justice found out about Sessions’ resignation, it was swiftly announced:https://twitter.com/ericgeller/status/1060269408252297217Who is this Matthew Whitaker, anyway?https://twitter.com/ddale8/status/1060258589804249093…Oh. As it turned out, Whitaker was a fascinating choice for a replacement, based on everything that came out about him in a surprisingly brief period:https://twitter.com/AaronBlake/status/1060260464893005824https://twitter.com/nedprice/status/1060279756028084226https://twitter.com/RollingStone/status/1060280440152621058https://twitter.com/KenDilanianNBC/status/1060284515992641544https://twitter.com/JoyceWhiteVance/status/1060285204567388165He is almost definitely not going to recuse himself. But then again, he may not have the position for that long. In the face of widespread disbelief at his hiring, Trump stood behind his choice in traditional fashion on Friday:https://twitter.com/ddale8/status/1060900766263754752https://twitter.com/maggieNYT/status/1060900736677171200The Takeaway: Chalk another White House departure up for the man famous for firing peo — oh, apparently not.https://twitter.com/michaelwhitney/status/1060266857125502976What Happened: The Notorious RBG had a bad week, but the internet was there for her with offers of anything and everything she needed, from emotional support to literal body parts.Where It Blew Up: Twitter, media reportsWhat Really Happened: Bad news for anyone who loves Supreme Court justice Ruth Bader Ginsburg arrived late this week:https://twitter.com/chrisgeidner/status/1060533995195244544RBG’s fall was obviously big news, with multiple outlets covering the story, and social media was equally excited about it. Maybe “excited” wasn’t the right word to use, though; some were people looking to reassure others that there was no reason to panic, after all.https://twitter.com/missmayn/status/1060606910905249792https://twitter.com/PalmerReport/status/1060558987282866176Others were simply preparing for whatever it takes to keep Ginsburg in good health, if not all-out action:https://twitter.com/MissLeslieG/status/1060545463726657536https://twitter.com/AmyGDalaMD/status/1060554624137076737https://twitter.com/louisvirtel/status/1060561496852185088https://twitter.com/JustSchmeltzer/status/1060555195581575168https://twitter.com/TheDweck/status/1060677691664289794https://twitter.com/ADifferentRebel/status/1060564460908220416And then there was the question of what actually happened to consider…https://twitter.com/erikburnham/status/1060644210649587714Of course, everyone here at While You Were Offline Towers sends all the best to the Notorious one, as well as good wishes for a speedy recovery. We need you out there, Justice Ginsburg. Have you seen what else is happening?The Takeaway: But did anyone consider the possibility that RBG’s injuries were self-inflicted and done for a very particular reason?https://twitter.com/JamieOGrady/status/1060637122166771714Many fake news peddlers didn’t care if Trump won or lost the election. They only wanted to pocket money. But the consequences of what they did shook the world. This is how it happened.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}