{"id": "'Red Dead Redemption 2' Reaches for Magic on the Shoulders of Indie Games'Red Dead Redemption 2' Reaches for Magic on the Shoulders of Indie Games", "paragraph": "Red Dead Redemption 2 begins in the harsh dead of winter. As roaming outlaw Arthur Morgan, you accompany your half-extinct gang into a barn, barely making it out of the terrible blizzard before hypothermia sets in. It's a slow, miserable trudge, and the first few hours of the game are equally slow and miserable. You linger in this frozen waste, barely alive, for days, learning to hunt, fetching a friend from the mountains, and moving at a crawl as the snow clings to your horse's hooves.For people who pick up the game expecting the brisk, freeform playfulness of most other Rockstar games, this might be too much to handle. As its early priorities, Red Dead Redemption 2 demonstrates less an interest in the freedom and expansiveness of its world–though it gets there, eventually–but an interest in forcing you to take your time. Look at the snow, it insists. Feel the weight of each weary step you take. Listen to the long, meandering conversations between these faux cowboy criminals and try to sympathize with terrible men. There's no rush.Red Dead Redemption 2 Is Too Big for Just One ReviewWith Black Ops 4, Call of Duty Takes Aim at a Fortnite WorldAssassin's Creed Odyssey Promises Romance—Then Locks It AwayEven once the game moves beyond this opening chapter, into the freedom more familiar to the Rockstar open-world formula first established by Grand Theft Auto 3 18 years ago, that emphasis on slowness remains. Red Dead Redemption 2 goes out of its way to complicate simple things. Horses have limited stamina, and require food and upkeep, which forces journeys to go slower than they would otherwise. Fast travel is inconvenient, and gated behind limited early-game resources, to force the player to get accustomed to lengthy travel time before doing anything else.Every interaction is suffused with this sort of depth, which doubles as a slowing complication. You have to clean your guns. Hunted animals need to be carried back to camp on the back of your horse. Keeping Arthur clean requires retiring to a hotel for a bath, wherein you have to scrub each individual body part in turn. And the distance between locations, the swaths of open wilderness separating townships and mission areas, is, by videogame standards, astounding. For long stretches, Red Dead Redemption 2 is spent in busywork and quietude.This is not a bad thing. It might, in fact, be a very good thing, and one of the big points one would lean on if recommending this game. By creating frustration and imposing slowness, it allows a type of involvement with the world unattainable in more straightforward games. It forces you to pay attention, to learn and follow its rules, to shaped yourself in such a way as to successfully inhabit its world. The degree of involvement required by the game's slowness forces a strange, added identification with Arthur Morgan and the petty frustrations that make up his outlaw life. It's a novel means of player engagement.Or, it would be, if it was new.It's easy to imagine that Rockstar came upon these ideas naturally. It would be in keeping with the ambitions of previous games in the series to imagine that the creators simply pushed for as much detail and care as possible, creating deeper and deeper levels of interaction until those interactions became complicated to the point of significantly altering the way the game feels, until they reshaped the entire tone and tenor of the experience. But even so, the idea of using deliberate slowness, clumsiness, or flat-out inaccessibility bears a powerful resemblance to other corners of the gaming world.It's easy to imagine that Rockstar came upon these ideas naturally. But the idea of using deliberate slowness and inaccessibility bears a powerful resemblance to other corners of the gaming world.Red Dead Redemption 2's exploration is like Proteus, with its emphasis on dreamy, carefully paced exploration. Its love of mundane interactions is like Quadrilateral Cowboy and other works by Blendo Games. Not to say that only independent games do these things, but that the broader ethos at play here–an intentional or accidental focus on distancing the player, as a paradoxical means of deepening engagement or as an end to itself–owes a significant debt to independent and alternative games.It's a common belief, among these games, that while games are by nature objects to be played and experienced, that they don't necessarily exist for the personal satisfaction of the player. That good games can be obstinate, or uneasy, or unpolished to the point of being near breaking. Critics like Aevee Bee and Lana Polansky, as well as countless others, have shaped the theoretical framework of this movement to create games that deliberately push against players—games that unwelcome them, that create friction to express something messier than simple joy.Which is to say that, Red Dead Redemption 2, while massive, and involving, and willing to do things rarely seen in triple-A videogames, might still not be worth recommending on those merits. I ended my last piece on this game with ambiguity, an uncertainty about how to comfortably reckon with both the game's power and the circumstances that helped create it. I'm still uncertain, on that front. The more I play it, the more I find myself enjoying significant parts of the way it has shaped itself as a messy, anxious, tragic thing.Yet, I also I find myself thinking that, maybe, its best tricks are already found elsewhere. In games made by people using those tricks to advocate for the oppressed, or to create a depth they thought was lacking in games, or just to express something true. Even though Red Dead Redemption 2 is a good game, I'm not sure if it's a game worth playing. And if I'm going to recommend something, perhaps I should be recommending those other games, instead.Can video games help improve hand-eye coordination? Can they help train your brain and improve your cognitive abilities? WIRED Senior Editor Peter Rubin tests his skills against a pro sports gamer to find out if gaming can improve your brain and body.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}