{"id": "15 of the Best Weekend Deals From Amazon, REI, and More15 of the Best Weekend Deals From Amazon, REI, and More", "paragraph": "Welcome to the weekend! As we round the corner to Amazon Alexa’s third birthday, Amazon is posting deals on select Alexa-enabled devices to celebrate. A few other of our favorite retailers, like REI and Walmart, are beginning to post their holidays deals as well. As usual, we cruised through the web to bring you our favorite picks this week.REI Outlet is having a fantastic deep sale this weekend, and our pick are these polarized sunglasses from Smith. They may look like a pair of casual frames, but they have Smith’s proprietary, polarized ChromaPop lenses, which optimize color, increase clarity, and reduce glare. The Megol nose and temple pads become tacky when wet to avoid slippage, and the frame is made from Rilsan Clear, a renewable, plant-based material.Buy the Smith Comstock Sunglasses for $84 (Was $169).Amazon Fire HD 10 for $120 (Was $150). Last year, we said that the Fire HD 10 served up the best that Amazon had to offer. Now, it's an even more affordable way to soak up all that great Prime content.Fire TV Stick 4K Bundle for $80 (Was $100). This is the best, and cheapest, way to browse Amazon's wealth of movies and TV shows. With the included Echo Dot, it's also one of the easiest.WeMo Smart Plug Bundle for $44 (Was $75). This bundle includes the WeMo Mini and one Insight smart plug. Both plugs let you control your lights remotely to fool burglars into thinking you're home when you're not.Echo Spot for $100 (Was $130). If you're comfortable with keeping a camera by your bed, Amazon's cute Spot is a convenient alarm clock.Polk Alexa-Enabled Soundbar for $199 (Was $299). The Polk Command Bar is the best soundbar to buy if you want access to Alexa integrated. Read our review to learn more.Alienware Aurora for $1,500 (Was $2,000). Dell's Early Black Friday Deals are worth checking out on your own time. This tower is designed for virtual reality, with an 8th-gen K-series Intel processor.Dell 25 FreeSync Gaming Monitor for $330 (Was $500). This gaming monitor has AMD FreeSync technology, which minimizes distortions.Jaybird Run True for $150 (Was $180). Jaybird makes some of our favorite running headphones, and the Run are no exception.Netgear Orbi for $280 (Was $329). If one router can’t supply Wi-Fi to every room of your home, you might need a mesh router network. The Orbi is simple to set up and upgrade.Vizio 55-Inch 4K UHD Smart TV for $348 (Was $578). Walmart has a lot of pre-Christmas sales happening right now. This Vizio TV has it all for a very good price: 4K resolution, HDR, smart TV apps, and voice control capabilities. It even has built-in Chromecast.Lego Space Shuttle for $24 (Was $30). Walmart has lots of Legos on sale! Do you know any kids that want to fly a rocketship when they grow up?iPad Mini 4 for $275 (Was $400). It’s still the best iPad mini around.Zootility Hedgehog Pocket Tool for $10 (Was $140). It's a stainless steel comb, wrench, screw driver, bottle opener, phone stand, and HEDGEHOG. And it fits in your wallet!Patagonia Houdini Full Zip for $69 (Was $99). The OG pocketable running rain jacket.When you buy something using the retail links in our stories, we may earn a small affiliate commission. Read more about how this works.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}