{"id": "\n\t\t\t\t\t\tGadget Lab Podcast: Pinterest’s Evan Sharp on What Makes Good Software\t\t\t\t\tPinterest’s Evan Sharp on the Future of SoftwareMore Uncategorized", "paragraph": "Dead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9qWhy did Apple’s Jony Ive name Pinterest co-founder Evan Sharp as one of the figures in technology who he believes will change the future? If you were wondering about that, here’s a great chance to learn a little bit more about Sharp and make the call yourself. During the 25th anniversary festival for WIRED last week, the Gadget Lab team had the chance to interview Sharp on stage, among other high-profile technologists. Over the next few weeks we’ll be publishing these taped conversations as a part of the podcast. In this interview, Mike and Arielle ask Sharp what it’s like to receive praise from Ive, how machine learning is changing software design, and whether Pinterest can remain once of the internet’s last happy places. Show notes: Click here to read more about Jony Ive’s nomination of Evan Sharp for our 25th anniversary issue. And here’s Lauren’s WIRED 25 interview with Kevin Systrom, which we mentioned in this week’s show. Recommendations this week: Lauren recommends the Dakota backpack from Dagne Dover. Mike recommends these awesome smartphone accessory lenses made by Moment. Send the Gadget Lab hosts feedback on their personal Twitter feeds. Arielle Pardes can be found at @pardesoteric. Lauren Goode is @laurengoode. Michael Calore can be found at @snackfight. Bling the main hotline at @GadgetLab. Our theme song is by Solar Keys.You can always listen to this week’s podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here’s how:If you’re on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts, and search for Gadget Lab. And in case you really need it, here’s the RSS feed.If you use Android, you can find us in the Google Play Music app just by tapping here. You can also download an app like Pocket Casts or Radio Public, and search for Gadget Lab. And in case you really need it, here’s the RSS feed.We’re also on Soundcloud, and every episode gets posted to wired.com as soon as it’s released. If you still can’t figure it out, or there’s another platform you use that we’re not on, let us know.Dead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9qDead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9qCNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices.\n\t\t"}