{"id": "Overwatch's Newest Hero Tops the Week in Gaming NewsOverwatch's Newest Hero Tops the Week in Gaming News", "paragraph": "This week, Overwatch has a new hero, the Video Game Awards are here to give us something to argue about, and Telltale's ending becomes permanent. Let's get to it.Games like Overwatch grow via the introduction of new characters, playable heroes that expand the roster and change up the climate of play in casual and competitive modes. This week, Overwatch introduces its newest character, Ashe, the leader of the villainous Deadlock gang, a cowboy-themed heroine with a semi automatic rifle and a robot companion.This means that, alongside launch hero McCree, Ashe is now the second cowboy-themed character in Overwatch. That's weird, right? That futuristic cops and robbers have whole gangs of cowboy warriors? Like, I can't be the only one bothered by that. Do the rest of the cast think they're just, like, cosplayers? Anyway, Ashe is live now for casual play, and will be available for ranked in a couple of weeks. If you need some extra lore, enjoy her origin story, as first revealed a Blizzcon a couple of weeks ago.Another year, another iteration of The Game Awards (née the Spike Video Game Awards), the Geoff-Keighley-hosted extravaganza celebrates the accomplishments of the videogame industry while presenting itself as a major promotional event. One delightful surprise this year is the indie game Celeste —which we at WIRED very much enjoyed—being a finalist for Game of the Year, as well as Best Score, Best Indie Game, and the Games for Impact award. (We at WIRED, we should also point out, are also one of many nominating outlets helping determine said finalists.)One casualty of the growth of the awards is the Trending Game award, a fan-voted award that in recent years has had a tendency to go to fairly controversial figures in the community. Instead, we've got the slightly less authoritative Content Creator of the Year award, which is nice and all but doesn't quite have the same \"yes, I'm the President, for VIDEOGAMES\" ring to it that the other award had. Probably for the best.It's official, now: the slow, messy, worker-abusing death of Telltale Games is complete. According to Variety, the company has formally begun liquidating, pulling its titles from the Steam store and filing for assignment proceedings (like bankruptcy). It's an ignominious and disappointing end for a company that, had it maybe valued its workers more, been a good deal more successful than it was. Let's hope those who used to work at Telltale land safely, and let's work to make this industry a more hospitable place.Spyro the Dragon is one of the most surreal platformers of the early 3D age. A world of petrified dragons, roaming wizards, and platforms and cities drifting in the clouds, it was transfixing, strange, candy to my childhood brain. Now, Spyro and its two sequels are back in fully remastered fashion, attempting to take that dream and make it shine with modernized controls, fancy graphics, the whole package. Attempts to do that can easily lose the magic of certain lo-fi games, and Spyro is no different. But my childhood self would still encourage you to check these out. They're like goofy, exciting Saturday morning cartoons. And who doesn't love Saturday morning cartoons?Michael Chu, the lead writer of Blizzard's Overwatch, breaks down every character in the game. Michael explains the backstories for every hero in Overwatch, from how they were first designed to their in-game lore. Michael reveals where McCree's name originated from, how they found Lúcio's voice actor, the different incarnations of Doomfist and much more.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}