{"id": "How to Safely and Securely Dispose of Your Old GadgetsHow to Safely and Securely Dispose of Your Old Gadgets", "paragraph": "There comes a period of time in every beloved gadget's life—some more prolonged than others—when you need to think about replacing the electronic device that's given you so much loyal service, whether it's a smartphone, a laptop, a digital camera, or anything in between.Aside from the fun of choosing a replacement piece of hardware, you've got two main considerations to think about when it comes to disposing of your outdated gadgets carefully: security, and the impact on the environment. You don't want your personal and private data accessible after the gadget has left your possession. And you want to get rid of the device in a way that's as kind to the planet as possible.Here we'll show you how to take care of both considerations, no matter what the gadget you need to dispose of.Whether you're sending your device to be recycled or sticking it on Ebay, you don't want your finance spreadsheets, family photos, or Twitter login to stick around on the hardware, even if you don't think anyone would go to the trouble of trying to extract the data from your old gadgets.When it comes to gadgets with on-board storage, we're primarily talking phones, tablets, and computers. The easiest way to wipe these devices—and all the data and applications on them is to do a full reset of the operating system. But first, make sure to back up all your precious documents, pictures, and so on to a hard drive or the cloud.For Android devices, open up the Settings app then tap System > Advanced > Reset options,  and then Erase all data (factory reset). Over on iOS, the equivalent option is in the Settings app under General > Reset > Erase All Content and Settings.If you're using a Windows computer, you need to load up the Settings app then click Update & Security, then Recovery, then Get started under the Reset this PC option. Choose to remove all personal files during the process. If you're using a Chromebook or Chrome OS tablet, open up the Settings pane and pick Advanced, then Powerwash to get your computer into an as-new state.It's slightly more involved on a Mac: You need to restart macOS, then as soon as it begins to boot up again, hold Option+Command+R until you see a spinning globe. Release the keys, then choose Reinstall macOS, then choose Continue. Follow the on-screen instructions and select your main hard drive when prompted.For most devices using flash or SSD storage, that should be enough to stop all but the most determined data recovery experts. If your computer uses an older, mechanical hard drive (i.e. not an SSD), certain bits of data may still be recoverable by tech-savvy users with the right tools.It's up to you whether to take the risk and leave it at that. The average Ebay buyer or computer recycling facility employee likely isn't going to go to the trouble of putting together a complicated hard disk recovery setup, just on the off chance that they might stumble across some of your home movies or budget spreadsheets.But if you want to be absolutely sure nothing can be recovered from a drive, US-CERT recommends actually physically destroying it—a hammer or drill will do the job well enough, but wear some safety goggles. You can also find specialist facilities that will take care of the destruction for you, but again, this is only really necessarily if have extremely sensitive data on your machine, or a reason to suspect that someone has specifically targeted your old electronics.Perhaps just as importantly, you need to disconnect the devices you're about to discard from your various your online accounts. If you've followed the steps above, it's going to be very, very hard for anyone to log into your Facebook, for instance. But to be absolutely sure, you can log in on a different device and log out of other sessions remotely.Most apps and services—Facebook, Twitter, Google, Apple, Microsoft and more—let you do this. Follow those links, log in, and look for the option to sign out of a session or remove a device to make sure it's disconnected from your key apps and services.If you're not selling your device or passing it on to someone else, it's important to make sure it's disposed of correctly. Fortunately, you've now got a choice of ways to get rid of your laptop, phone, or other gadget in a way that minimizes the impact on the environment.Your first port of call should be the company that manufactured your device. Apple, for example, has a comprehensive recycling program, and will even give you some cash back for a new purchase if your device is in reasonably good condition. Answer some questions online, then mail off the device or take it into an Apple Store.Other manufacturers have similar schemes available, including Google and Samsung. Again, you can to ship your device back to the company involved, and you might get access to a trade-in deal depending on the age and condition of your gadget.If you don't want to give the device back to the manufacturer for whatever reason, then try the place where you bought it. Best Buy will accept just about any used electronic device, giving you some trade-in value or just taking care of the recycling for you. All the major phone carriers have trade-in and recycle programs as well.That should give you enough options no matter what type of gadget you're dealing with, but you can also opt to go for one of the local electronic recycling programs in your area. These vary state by state, but if you head to the E-Cycling Central website you can plug in your address and see what's available in your region.You don't necessarily have to get rid of your old gadget; in fact, it's better if you don't. Most obviously, you can simply pass it on to a friend or family member, who can make good use of it and save another laptop or phone from being built, as well as saving you the hassle of disposing of it. Chances are you don't need to worry too much about wiping a device you're giving to a nephew or niece, either (though you never know...).If there's no one to take the redundant hardware off your hands, stick it on Ebay, Craigslist, or your selling platform of choice. You might be surprised at the prices you can get even for older or damaged devices; plenty of repair shops and people needing parts happily scavenge broken down gear. If you don't get any interest, give the kit away for free. Just make sure you do wipe your devices and disconnect your accounts, as detailed above, before you sell.It's also worth taking a moment to consider whether you really need to get rid of your old device after all. An old phone or tablet can become a Spotify controller or a security camera; an old laptop can be set up to serve up videos and music to the other devices in your house; you could use an unwanted tablet as a dedicated ereader; and so on.It seems like every time you turn around there's a new breach of personal information. Follow these steps to minimize the damage.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}