{"id": "Tesla's Booming Model 3 Sales and More This Week in the Future of CarsTesla's Booming Model 3 Sales and More This Week in the Future of Cars", "paragraph": "We spend a lot of time talking to researchers here at WIRED Transport. Those are the gals and guys filling the spreadsheets, tapping out the algorithms, and splaying in fear as they ride yet another roller coaster for science. This week, we spoke to engineers and developers who have sacrificed mind and body to solve problems, ones like car sickness and unfair school bus schedules. They want to create tools that work for disabled farmers, and electric trucks that drive themselves. Hard stuff, sure, but there’s fun to be had along the way.Plus, we peeped Tesla’s newest sales figures, and wondered what cities’ scooter regulations might mean for autonomous vehicles. It’s been a week—let’s get you caught up.In WIRED's new series “Know-It-Alls”, we’re answering your most basic questions about transportation tech. First up: How do self-driving cars see, anyway? If you have a pressing query for our team, please send it to asktheknowitalls@wired.com.Looks like Tesla is a real automaker. Jack takes a look at a new report on monthly vehicle sales, which finds the Model 3 was one of the US’s top 20 most sold vehicles in the third quarter of 2018. Tesla was ranked fourth in luxury car sales during the same quarter.Audi’s new A8 sedan comes with 24 cameras, radars, and a lidar setup, WIRED contributor Eric Adams reports. That might sound like overkill, but attempt to T-bone the $84,000 car and you’ll see what all those sensors (plus an active suspension) can do.Swedish autonomous truck maker Einride’s newest creation is an electric, driverless hauler—with zero space for a human driver. Turns out you can make an electric truck much more efficient if you don’t have to think about the needs of pesky people.If you saw Jaguar Land Rover wellness technology researcher Spencer Salter riding your local amusement park’s teacup ride while wired up to a bunch of sensors, now you know why: Salter’s trying to crack why people get car sick, and what the automaker can do to beat it.One in five famers may be disabled, a real hardship in an industry built on manual labor. Contributor Nick Stockton talks to the people developing farmer-friendly tech—easy-grip tools, telescoping fruit tree tenders, customized forklifts—to help the country’s agricultural workers back on the job. And he wonders what happens next, now that the federal funding that supports its development might be on the White House chopping block.The fees that cities are charging scooter companies right now might help them prep for autonomous vehicles, I argue.In bizarre business news: Transit agency veteran Jay Walder, who has held big time positions the world’s largest and most innovative agencies, is moving on to...head up a hyperloop company? The tech doesn’t exactly exist yet, but he’d like to convince city governments to give it a chance.WIRED Ideas Contributor and MIT media lab director Joi Ito writes about a Boston school bus scheduling algorithm he thought was unfair—until he learned more about the researchers, and their fight for equity in the Boston school system. The takeaway: People need to build technology that produces fair outcomes for all. But then, they have to explain their work in a way that everyone might understand.In this inaugural episode of WIRED’s new original series, [De]constructed, motorcycle mechanic Matt Dawe takes apart a 1974 Harley Davidson “Shovelhead” motorcycle, piece by piece.More fun news if you love electrics: Veloz, the non-profit coalition of carmakers, tech companies, advocacy groups, and California regulators, reports that Californians purchased almost half a million electric vehicles between 2011 and 2018. Plus, sales are picking up: In September, American electric car sales more than doubled compared to the year before.News from elsewhere on the internetA report posted by California’s DMV shows a Waymo that had just come out of autonomous mode collided with and a sent a motorcyclist to the hospital last month. What does the incident mean for the industry’s safety driver system?Chinese giant Tencent is recruiting self-driving engineers in Silicon Valley, and Axios takes a look at the state of self-driving play in China.Elon Musk says Tesla will indeed compete with Uber and Lyft in ride-hail.The transportation sector is deeply insane these days, so of course Ford bought scooter-share startup Spin for $40 million.Lime is getting into car-share in Seattle, and The Information uses that as an excuse to explore car-share-nomics.Also in -nomics, The Information digs into the financials of Bird’s business, thanks to a slightly outdated pitch deck. The documents show that, as of May, the company made a gross profit margin of 19 percent.Lyft vomit fraud hits North Dakota.Think you love to solve problems? You’re nothing compared to the puzzlehunters that WIRED profiled in 2012. Their game involves a van, remote locations, and 26 mind-busting puzzles.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}