{"id": "What Entrepreneurs Can Learn From Paul Allen's Second ActWhat Entrepreneurs Can Learn From Paul Allen's Second Act", "paragraph": "When the Jeff Bezoses and Jack Dorseys of the world leap from the bow of the ships they’re sailing forth, what will happen to them? Where will they go?When Paul Allen, the cofounder of Microsoft who died this week at age 65, left the business he started, he traveled the world. He collected paintings and learned to scuba dive. Scuba diving, he said at the time, “takes me away from myself.”Allen had it right. Entrepreneurs who leave their companies—whether it’s because they’ve sold the business, they are ready to retire, or they are just done—do need to get away from themselves. Starting and running a business are all-consuming endeavors that hijack an entrepreneur’s identity.To the public, Allen’s identity will always be tied to his role in the creation of Microsoft. In 1975, Allen convinced childhood pal Bill Gates that they should develop a programming language to help make computing more accessible to more people. Their larger goal of a computer on every desk took several years to realize, but that initial project set the company on its way.Gates and Allen became a sort of boy-wonder duo that built Microsoft into an important software company. But following a bout with cancer in 1982, Allen decided the clashes with Gates were wearing on him emotionally and went on his world tour.He never returned to Microsoft. What followed holds lessons and a cautionary tale for entrepreneurs who will leave their businesses at some point. The exit can bring about an identity crisis, separation anxiety, and fear of failure, as well as often unrealistic expectations of success. These problems aren’t relatable to many people—exorbitantly wealthy business founders are rare, though growing less so—and can lead to a sense of isolation and abandonment. In Allen’s case, Microsoft didn’t have its IPO until three years after he left, delaying some of the post-exit sudden-wealth symptoms until 1986, when his net worth increased by $134 million overnight.After his European tour in 1983, he went back home to Seattle, took out a business loan based on his experience with Microsoft, and launched into what he expected would be his own rightful tech empire, distinct from Gates and the company they cofounded.His next move followed another common hiccup of the second-act journey, when one success does not guarantee the next. The circumstances of Microsoft’s early momentum were unique to the founders, the personal computing environment and the state of technology at the time. Allen, “sought to recapture the feeling he had creating Microsoft in the first place,” as I wrote in my 2003 biography of him, The Accidental Zillionaire. At Asymetrix, a software-development shop, he brought together people who made him feel more creative and inspired than he was at Microsoft. In the end, though, the company was not ambitious enough to become the tech rival Allen anticipated. Another effort, Interval Research, handled some of Allen’s more audacious concepts, including a service called SkyPix that would send TV signals down broadband channels and a virtual reality platform called ePlanet. Again, a lack of commercial instincts proved fatal.Many successful entrepreneurs become investors after their exits, and Allen did the same, setting up Vulcan Inc. and stumbling here as well. The list of Vulcan investments that didn’t make it is long, and mostly forgotten: Virtual Vision, Egghead, Lone Wolf Technologies, Trilobyte, Medio Multimedia. Allen’s hopes for a “wired world” led to a major investment in AOL as well as a $4.5 billion deal to buy Charter Communications in 1998 with the aim of getting into people’s homes and bringing services and entertainment to them.Entrepreneurs are not always natural born investors; they invest themselves in one business and have a use case of one. As with Allen, it’s easy for them to become enamored by shiny ideas, eschewing financial good sense. Not all of Allen’s investments were bombs; Starwave, essentially a website development shop, was sold to Disney for $200 million, earning Allen $100 million. And the “wired world” approach to investing he eventually adopted brought some sense and order to where he put his money.Put simply, Allen remained a strong technologist, but didn’t have his former partner’s operational acumen. He never built the tech empire he imagined and never achieved a tech identity outside of Microsoft.Throughout the 1990s, Allen continued his quest for a next act. By then a billionaire thanks to Microsoft’s continued success, he began exploring interests outside of tech. He bought the Portland Trail Blazers and Seattle Seahawks, and built a museum tribute to his childhood guitar hero, Jimi Hendrix, called the Experience Music Project, in his hometown Seattle.In the 2000s, Allen seemed to finally move past his tech ambitions as he became more involved in philanthropy around brain science, disease remediation, climate change, the arts and more. He launched his own space efforts that built rocketships and spacecraft carriers. The mix of sports, space, science, and Hendrix was Allen finally coming into his own. More than 20 years after leaving the company he started, Allen had gained an identity that was about more than Microsoft.How come it took him so long? It’s easy to forget that Allen was just 30 years old when he left Microsoft, at a time when there were fewer tech millionaires, and even fewer under 40. There wasn’t a clear template for what to do next. Microsoft hadn’t yet gone public, and that was the real game-changer for Allen. The source of his wealth was Microsoft and thus he would always be “of Microsoft.”Entrepreneurs today benefit from a culture of philanthropy that involves them in causes and activities outside of their day jobs. Salesforce’s Marc Benioff has spent billions in health care, as has Mark Zuckerberg, who plans to cure every disease within his young daughter’s lifetime. Bezos this year launched his own philanthropic venture.When these and other stars of the tech world transition into their next phase, they would do well to view Allen after Microsoft as a peer on a similar journey. He wisely took time off to separate his identity from his former business yet failed to separate the dreams of his first business from the realities of starting the next one. And though with good intentions, he nevertheless misunderstood at first the value of his money and how he might spend it.We called Allen the “Accidental Zillionaire.” But he was just finding his way like any other entrepreneur in search of his next act.With a wingspan of 385 feet, the Stratolaunch is the world's largest plane by width.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}