{"id": "Inside Facebook’s Stormy Debate Over 'Political Diversity'Inside Facebook’s Stormy Debate Over 'Political Diversity'", "paragraph": "At one point this summer, Brian Amerige seemed destined to become the next James Damore.Like Damore, the Google engineer who wrote a manifesto protesting the company’s “ideological echo-chamber” last year, Amerige also authored a controversial memo accusing his employer, Facebook, of being a “political monoculture that’s intolerant of different views.” Like Damore, who argued against gender equality in engineering based on supposed biological differences, Amerige was also a self-styled philosopher who deeply offended his more liberal-minded colleagues when he lobbied for an office mural promoting solidarity with transgender people to be taken down. Like Damore, Amerige’s name was also splashed across the press once the memo he wrote leaked publicly. And of course, like Damore, Amerige was invited to tell his story on Tucker Carlson Tonight.But there’s one key difference between the two provocateurs: While Google fired Damore over the incident, leading him to sue the search giant for discrimination, Amerige says Facebook’s leaders, from CEO Mark Zuckerberg to chief operating officer Sheryl Sandberg, embraced him.“I have every confidence that they take these issues really, really seriously, and they’ve treated me with a lot of respect,” Amerige says. “They’re pretty intimately involved.”Last week, Amerige left Facebook over disagreements about the company’s platform-wide hate=speech policy, which he describes as “dangerous and impractical” for a platform that promotes openness. But he had spent the two months before that working closely with Facebook’s human resources team on ways to foster what he calls “political diversity.” One initiative Amerige says they discussed was an updated employee speech policy that would draw a distinction between attacking people's ideas (which would be permitted) and attacking their character (which would be prohibited). He's unsure whether Facebook plans to implement the ideas.Facebook wouldn't comment on \"personal matters of current and former employees,\" but a spokesperson directed WIRED to the company's harassment policy, which does prohibit harassment on the basis of political viewpoints. \"We believe this policy goes above and beyond what most companies have in place, which is why we have shared it publicly,\" the spokesperson said. \"Diversity is something we are all talking about at [Facebook], including our most senior leaders.\"\"They're headed in the wrong direction, but I would defend Facebook’s right to screw this up until the very end.\"Brian AmerigeThe contrast between Facebook and Google's treatment of polarizing figures within their ranks comes amid heightened conversation around Silicon Valley's role and reputation in American politics over the past year. Whereas Damore's treatise launched a wave of accusations of liberal bias against Google, Amerige's memo rode the crest. Facebook had already faced criticism over alleged conservative censorship in its Trending Topics portal back in 2016. By the time Amerige wrote his memo, Facebook's leaders had already been called to Congress repeatedly to talk about supposed liberal bias. They'd also discussed the topic behind closed doors with President Trump's campaign manager, Brad Parscale, the chair of the Republican National Committee, Ronna McDaniel, and House majority leader Kevin McCarthy. In August, when Amerige's memo went public, Facebook, and indeed the rest of Silicon Valley's giants, were eager to fend off the creeping threat of regulation from the right.In truth, so was Amerige. The 28-year-old's issues with Facebook are many and varied. In addition to its hate-speech policy and political culture, Amerige objects to the company's diversity training program. And yet, he says Republicans have received his message all wrong.Amerige says his biggest fear and annoyance was the fact that his comments “were going to be used as a weapon for legislating or regulating the company.\" \"I left the company because I think this is such an important issue, and they're headed in the wrong direction,\" he says, \"but I would defend Facebook’s right to screw this up until the very end.\"Amerige is a somewhat contradictory messenger for the cause. He insists he's not a conservative nor a liberal, but rather an objectivist or, if you like, a “radical capitalist.” As a teen, his aunt gave him a copy of Atlas Shrugged, told him it’s a book smart people read, and that was that. He dreaded a Hillary Clinton presidency but says he finds President Trump’s “lack of principles to be disturbing and dangerous.”Amerige started working at Facebook six years ago as a technology lead on the company's news-reading app called Paper. At the time, he says, \"politics was not a thing inside the company.\"Of course, Facebook's workforce is generally seen as left-leaning. Sandberg is a prominent Democratic donor. Zuckerberg has been funding the immigration-advocacy lobbying group Fwd.us since 2013. And Federal Election Commission data show that Facebook employees overwhelmingly donate to Democrats.But Amerige says the 2016 presidential campaign made people more vocal about politics than ever before. There were calls to remove Trump financier and adviser Peter Thiel from the company's board, and, Amerige says, employees began hanging President Obama's famous Hope posters on the walls. But the tipping point for Amerige came on July 9 of this year. Facebook had installed a giant mural on a wall in his office, meant to signal solidarity with the transgender community. The mural featured two faces beside a tangle of roses with the words “Gender Free” written in block print to the left. Amerige thought it should be taken down, so he logged onto the company’s internal discussion board, called Workplace, to say as much.“I wrote a post that said: Look, putting aside the transgender piece entirely, the phrase ‘gender-free’ is a radically left-wing term, and I don't think it’s appropriate to be on the wall of our workplace,” Amerige remembers. According to Business Insider, the post was more pointed than that. \"Facebook is free to put up whatever art it wants,\" it read, according to Business Insider, \"but I just want to register my frustration and frankly the disgust I feel every time I pass this.\"The backlash began immediately. Dozens of Facebook employees left outraged replies calling Amerige transphobic and urging Facebook to fire him. The conversation grew so contentious that the team that manages Workplace turned off comments altogether. He says employees who were offended by his comments reported him to human resources and charged him with fostering a non-inclusive workplace.Amerige says his comments were specific to the artwork and not an affront to trans people. Not everyone agreed. \"Brian voiced criticism of a recently painted office mural on gender expression, in an internal post, that casually denied the existence of white privilege, which was read by most employees as a direct attack on transgender rights,\" one trans woman who works at Facebook told WIRED on the condition of anonymity.When human resources approached him about the issue, Amerige says, \"I was quite defiant about it. I don't think I have anything to apologize for.\" Facebook refused to take down the mural; it was still on the wall as of Amerige's last day. But the company didn't punish him as his colleagues were demanding, either. Instead, he says, \"they told me this was not a new issue for them. They were seeing this kind of thing all the time: I don't feel like I can speak out, I don't feel like I can share my perspective. They didn't know what to do.\"At the same time, Amerige says, he got hundreds of private messages from fellow Facebookers who said they agreed with him but didn’t want to speak up about it. These messages inspired Amerige to write the now infamous memo titled “We Have a Problem With Political Diversity.\" \"We are a political monoculture that’s intolerant of different views.​ We claim to welcome all perspectives, but are quick to attack—often in mobs—anyone who presents a view that appears to be in opposition to left-leaning ideology,\" it read.In the memo, Amerige announced a new group he was creating on Workplace called FB’ers for Political Diversity. He plastered posters around the office advertising the group, featuring anonymous messages he'd received from his colleagues like, \"It's not easy speaking out here, so props to you and good luck with the outrage mob.\" Within days the memo leaked to The New York Times and was quickly coopted by right-wing media.Amerige says the company’s human resource department “tried quite hard” to keep him around after the memo published. \"The optics of me starting a political diversity group, making this statement about it being a political monoculture, and leaving the company immediately after doesn't look good,\" he says.Instead, Amerige amassed a solid following in his FB'ers for Political Diversity group, which is like a Facebook group, but just for staffers. It has since grown to 800 members, with roughly 600 more people on the waiting list. (Yes, people who want to get into this group for diverse ideas must be vetted first.) They don't all share Amerige's perspective. But they must all promise not to attack each other's character. So far, Amerige says, the plan is working \"wonderfully.\" When he left the company, he hand-picked a team to take over management.Amerige views himself as a free-speech crusader, who was so turned off by Facebook's crackdown on hate speech that he left the company. And yet, he wants badly for Facebook to crack down on what he calls the \"moral outrage mobs\" that came after him.Current Facebook employees are divided on their view of Amerige's group. The trans employee who spoke with WIRED says, \"In creating a space claiming to be for controversial discussions, he has created a space for employees to express offensive viewpoints that wouldn't be acceptable in broader society. I think Mark and Sheryl don't agree with these hateful views but are scared to make a move due to the inevitability of facing more right-wing outrage if they do.\"Still others, even those who oppose Amerige's political ideology, say the group has been constructive to civil debate. \"There's a difference between Brian's actions and the group he started,\" said one engineer who's a member of the group and identifies as a \"Democratic Socialists of America-style leftist.\" \"I mean, sure, there are folks talking about things that they wouldn't feel safe discussing in front of 40,000 of their coworkers, but I've seen a lot of hard-right folks become more moderate after actually talking with people. Same on the left. At least discourse-wise, it's become more healthy.\"One thread, in particular, asked people to introduce themselves, their political and religious beliefs, and how they've changed over time. \"Based on the coverage, it sounds like a hotbed of alt-right, which couldn't be further from the truth,\" the source says, adding that now the task before remaining members is \"distancing the group from Brian.\"There is, of course, some irony in all this. Amerige views himself as free-speech crusader, who was so turned off by Facebook's crackdown on hate speech that he left the company. And yet, he wants badly for Facebook to crack down on what he calls the \"moral outrage mobs\" that came after him. Then there's the fact that he is claiming to have been attacked by the very people who first charged him with attacking them. What’s more, it's the tech industry's fear of angering the right that gave him cover to state his case publicly to the media in the first place.Amerige has his answers to these contradictions. He says his expectations of Facebook the workplace and Facebook the social platform are different, for one thing. And while he says he's happy to have intellectual arguments about ideas with his colleagues, it's the personal attacks he objects to. Of course, the line between an idea and a person whose identity depends on that idea is often blurry, making such distinctions tricky if not impossible to draw. Amerige's critics within Facebook view that as an excuse for anyone to criticize people's religion, ethnicity, sexuality, or gender identity, so long as they don't target the individual.Amerige believes Facebook's culture wars haven't yet reached their peak. Just this month, the company's head of public policy, Joel Kaplan, attended his friend Justice Brett Kavanaugh's controversial Supreme Court confirmation hearing, during which Kavanaugh defended himself against claims that he had sexually assaulted a woman. Kaplan's apparent support for Kavanaugh incited a new round of fury from Facebook employees, who flooded internal message boards with concerns about the statement Kaplan was making. Days later, appearing by videoconference at a townhall meeting, Kaplan apologized.To Amerige, the ordeal felt like another illustration of his point. \"I have a lot of empathy for people who were reliving something as a result of that [hearing],\" he says. \"But the level of disrespect and hostility toward Facebook in that townhall was shocking.\"That culture, he says, is a very different problem from the one that Republican members of Congress have been talking about on Fox News all year: that Facebook is actively and intentionally censoring conservatives on the platform. \"Nobody’s explicitly enforcing a left-wing orthodoxy within the company,\" Amerige says. \"That’s not happening.\"Instead, he says the same polarization that has taken over the country and turned politics into a blood sport has emerged at Facebook's headquarters. You could argue, and many have, that by driving people into like-minded echo chambers with algorithms that elevate the most extreme and engaging posts, Facebook has contributed to this polarization. Now it's not just a problem to be solved on Facebook, but within Facebook too.Additional reporting by Nitasha TikuIntel Vice President & Senior Fellow Genevieve Bell spoke at WIRED25, WIRED’s 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}