{"id": "12 Things You Learn Over Two Decades of Lunches With Stan Lee12 Things You Learn Over Two Decades of Lunches With Stan Lee", "paragraph": "For nearly two decades, I met Stan Lee for lunch about once every month or two. In the 1990s and into the 2000s I was writing for Wizard magazine, which at the time was kind of a catch-all, 800-pound gorilla in the comics business. And Stan, as we all learned from his many MCU cameos, knew the value of publicity. He liked seeing his name in print, which meant he was happy to sit down with a reporter—especially if I picked up the tab. So in 1999, we started meeting regularly for mid-day meals.Captain Marvel and the Long, Strange History of Female Superhero NamesDoes Comics Culture Have an Inferiority Complex?Video: Stan Lee Marvels at How Tech Has Changed SuperheroesThere was rarely an agenda during a lunch with Stan, who passed away today at age 95. It was just a semi-regular catch-up, very friendly and collegial, although it’s hard to consider yourself a colleague to one of the most prolific creators in all of comics.We all know “Stan the Man,” the showman persona Stan first created during Marvel’s ascension in the 1960s and maintained throughout his long life and illustrious career. But once every few weeks or so, I got to see glimpses of Stan the man, lower-case “m.” During those years, I learned a great many truths about Stan Lee.Stan’s office at POW! Entertainment was at the corner of Santa Monica Boulevard and Beverly Drive in Beverly Hills. We’d usually meet and just tumble down the street, heading south-ish on Beverly to the deli Nate ’n Al or the Cheesecake Factory. Usually the Cheesecake Factory. Stan hated to wait for a table, so we’d usually try to scope out where we could get seated quickly.Once seated, Stan rarely deviated from his standard order: two eggs over easy, toast, bacon, sliced tomatoes, and black coffee. Starting about a decade ago, he’d sometimes skip the bacon in deference to his doctor and cholesterol.In 2014, Fatburger opened a franchise right across the street from Stan’s office. Stan was in heaven. A Fatburger and a vanilla shake became his second go-to lunch.I always asked Stan when he was going to retire. For years, I got variations of the same answer:“I’m not going to retire. Most people retire so they can go do what they want. I’m already doing what I want. I like to write. I like to work with creative people. If I retired, I’d be giving up my fun.”And so it remained. Stan was in the office every day at 9 am.Stan loved to work. We’ve established that. He also loved to leave the office at about 5:30 pm with the sole purpose of heading home to spend time with his wife, Joan, who passed away last year.Lunches were one thing, and Stan could justify that as “business”—but beyond that, during many years of what I can accurately describe as a friendship, I got Stan to socialize with me outside of business hours exactly once. I practically had to bribe him. Which leads us to:He loved the different segments, the music, and generally thought the whole damn package was brilliant and imaginative.In 2000, Disney released Fantasia 2000, an ever-so-slightly remastered version of the original. A large IMAX screen was set up on Howard Hughes Parkway in Los Angeles, and an impromptu outdoor theater was established for the purpose of screening the flick. I got tickets, and invited Stan to see the premiere screening. He accepted.We met near the theatre, had a cocktail, and saw the film, which Stan loved. Immediately after, he hopped in the car and cannonballed out. “Gotta get home to Joanie,” he said before we parted ways.Stan might have come from the era of the three-martini lunch, but he would rarely imbibe when we met up. On the rare occasions he would—usually Fridays—he would always declare with typical Stan Lee theatrics, “This occasion calls for an adult beverage!” and order a screwdriver.Stan would occasionally knock back those screwdrivers at the old comedians' haunt in Beverly Hills, where he was a member. About 2003 or so, Stan sponsored me for membership in the club … rather against my will. He just called me one day and said I should join the Friar’s. Said I'd love it. Told me a nice guy from the Club was gonna call me. Nowhere in the conversation was there a question mark; this was simply going to happen.I politely inquired of Stan if, perhaps, median age among members was reaching 82 years old and current members were being asked to bring in new blood before all the old blood perished from this Earth. \"No, nothing like that, True Believer!\" Stan assured me. (OK, he probably didn’t say “True Believer.”) \"It's just a great place. You've been there! You love it! You'd love being a member!\"Sure enough, later that day, I got a call, and they sent me a membership packet. A polite salesman called me a few times to follow up, until I told him that I really wasn't interested. Stan and I would have to settle for screwdrivers at the Cheesecake Factory.Before he decamped to LA in 1981, Stan was also a member of the New York Friar’s Club. And so was Carmine Infantino, DC Comics’ editorial director and later publisher between 1967 and 1976.Marvel hit the comics world like a house afire in 1961, and slowly but surely inched up the charts, taking bites out of DC’s market share every year. By 1971, Marvel finally surpassed DC. Like any business clash, this was a war. Over the course of many years, the two publishers fought for the same fans on the same pulp-paper battlefields. The rivalry between the companies was fierce.But once a week, a truce was called. Stan admired Infantino’s artistic sensibility—he had offered him a job at Marvel before DC came calling—and he liked him personally. Monday through Friday, 9 to 5, Stan rolled up his sleeves and tried to knock DC out. But once a week, every week, through the late ’60s and early ’70s, Stan would sit down with Infantino for a few friendly cocktails at the Friar’s Club. When the business day was over, the two rivals would meet as friends.Stan Lee wrote the “The Amazing Spider-Man” newspaper strip starting in 1977, with longtime collaborator John Romita as the first artist. Later, other artists took over. As they came and went, Stan’s deal with the syndicate stayed the same: he got paid for the strip, and had to pay the artists out of his own pocket.And so Stan ran a mini accounts-payable office every two weeks. He would scratch out a personal check to inker Joe Sinnott or letterer Stan Sakai and dash them off a short letter thanking them for their work. A letter to Sinnott would always start with “Hi, Joe!” in a word balloon coming out of Spider-Man’s mouth on Stan’s custom Spidey stationery. The personal touch was always important to Stan.Around the time I started asking Stan when he was going to retire, I became obsessed with chipping away at the showman. The public image was so refined, so polished, I figured there just had to be something different underneath.There wasn’t.After 95  years, Stan remained remarkably consistent. Walking down the street, he’d move faster than you, even in his tenth decade. He’d happily wave at people who recognized him. He’d sprint a couple steps ahead to open a door for a lady. And over the years, I saw him happily autograph dozens of slightly soggy Cheesecake Factory napkins.The voice you heard in movies and cartoons was the voice he had every day. It commanded, if it didn’t boom, and always had a friendly quality. Witticisms and puns would flow, along with Shakespeare quotes—Stan loved the classics. And the tone and timbre was always enthusiastic.“I get excited easily,” he’d say. “I live a nice life, and I’m usually very happy. Why not share a little of that?”Stan believed in God and an afterlife, no doubt. But he was skeptical about channeling those beliefs through a religion. He examined various faiths, charting their strengths and weaknesses. Stan believed that if religion made someone a better person, then he was all for it—but he wasn’t sure of it for himself.He thought that “golden rule” was the key, and he really couldn’t understand why people couldn’t just take a few seconds out of their day to be nice to others. He counted on a reward. “I don’t believe you get wings,” he once told me. “I don’t think you sit on a cloud and play a harp. But I believe if you live a good life, there’s something for you.”Stan saw God not as perfect, but as a flawed being, just like man. Stan loved to quote Omar Khayyám’s Rubaiyat line, “Did the hand then of the potter shake?” To Stan, it meant that just as the hand of a potter could make an imperfect jug because the potter is flawed, so too is God flawed in his creation of an imperfect man. Stan also found great joy in reading and re-reading Lin Yutang’s The Importance of Living. Yutang was raised an ardent Christian, but later became, in his own words, “a happy pagan.” Stan believed in God, but thoroughly enjoyed the notion that God was far from perfect.In February of 2003, I got an odd call from Stan.“Hey, I got a question for ya,” Stan bellowed through the phone in his very Stan-like way. “You know a lot of people, and they tend to listen to you. Can I ask you for a favor? They’ve got this new Hulk movie, and I don’t have a cameo appearance in it. Maybe you can call [producer] Gale Anne Hurd, and see if they can find a part for me. Whaddya think?”Honestly, my heart sank. I “get” that the cameo appearances are fun and all, and a nice little wink to the audience, but in my mind—not that it should have any bearing on how Stan felt—they were just the parsley on the edge of a massive plate of career achievements. I think it can be easily argued that Stan Lee (or perhaps Stephen King) is the most significant American author of the 20th century. I saw Stan as a man possessing a tremendous body of work, and the fact that he felt he had to do these teeny movie shout-outs to validate the work felt incongruent to me. The fact that he wasn’t getting the response he wanted through normal channels saddened me. And worst of all, I knew there was practically zero I could do about it.I backpedaled as fast as I could. “Stan, I barely know Gale Hurd,” I said. “I think I met her twice, and I’m pretty damn sure she couldn’t pick me out of a lineup. I’d help you if I could, but all I can do is call her office, get shuffled off to an assistant, leave a message, and wait. Maybe this one just isn’t meant to be.”Stan saw where I was going in about half a second. He backpedaled from my backpedaling, saying it was OK, and sorry to bother me. I assured him it was no bother.I never saw the 2003 Hulk flick, but I hear he got his cameo. We’ll call that a win.We chat with Stan Lee about the characters he helped create and his latest ventures.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}