{"id": "\nThe Haunting of Hill House Is 90 Percent of an Amazing Show\t\t\t\t\tThe Haunting of Hill House Is 90 Percent of an Amazing ShowMore Culture", "paragraph": "Dead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9q\n\nSlide:  1 / of  1.\nCaption: \nNetflix Horror author Paul Tremblay was very impressed with the new Netflix series The Haunting of Hill House, based on the classic novel by Shirley Jackson.“I think it’s an amazing achievement,” Tremblay says in Episode 333 of the Geek’s Guide to the Galaxy podcast. “I think people are going to be talking about it for years. On social media I’m connected with so many people who either read horror or write horror, and that’s all people have been talking about for a week or two straight.”The 10-episode season was directed by Mike Flanagan, who has established himself as a top horror director with feature films like Oculus and Hush. Geek’s Guide to the Galaxy host David Barr Kirtley ranks the early episodes of The Haunting of Hill House among his all-time favorite ghost stories.“I would give my strongest possible recommendation for the first six episodes,” he says. “If you have any interest in haunted house stories or anything like that at all, you’ve got to watch the first six episodes.”Unfortunately the later episodes have divided critics. Writer Leah Schnelbach had mixed feelings about the finale. “I was glad that they went on the happier side, rather than being nihilistic,” she says. “But then the more I thought about it, I’m like, ‘They had to kind of tear down the worldbuilding to make all of that work.'”Science fiction author Seth Dickinson also had issues with the finale, but felt that the show’s strong characterization more than makes up for any deficiencies. He thinks viewers should give the show a try and judge the ending for themselves.“The show does amazing work in the first six episodes, and then things wrap up,” he says. “You might like the ending and you might not, but by that point you’re definitely going to care about the people in the show.”Listen to the complete interview with Paul Tremblay, Leah Schnelbach, and Seth Dickinson in Episode 333 of Geek’s Guide to the Galaxy (above). And check out some highlights from the discussion below.David Barr Kirtley on acting:“The adult actors were supposed to match the kids’ behavior, so they would look at the little quirks they had, or body language things, and try to imitate those—rather than having the kids try to imitate the adults. So I thought that was pretty clever. … Also, if you’re a fan of Mike Flanagan’s work, all of these actors have appeared in his previous films. The actress who plays Theodora was the main character in Hush, the father was the father in the flashbacks in Gerald’s Game. Even Mrs. Dudley, all of them, if you go back through his previous movies, you’ll recognize them all. So these are all people who have worked together in some capacity for a while now, and are all clearly comfortable working together, and all do a really good job, I thought.”Paul Tremblay on adaptation:“This is no shade to Flanagan’s TV show, because I think it’s an amazing achievement, but I think part of the reason why The Haunting of Hill House is the haunted house story of the 20th century is that the whole book is really about Eleanor. She’s the one who is haunted—or may not be haunted, because there is some potential ambiguity to it. There are other characters there, but really all of the horror and haunting is reserved for Eleanor, and by the time you get to the end of the novel, it’s really powerful. And obviously it’s difficult, almost impossible, to do that for 10 episodes, where you need—necessarily—more than just one character who’s going to be haunted.”Seth Dickinson on scary houses:“Maybe there’s a secret design I don’t understand, but with the seeming randomness of the supernatural intrusions, I really lost a sense of the house as a coherent menace. … For me the scariest thing about the house was that when I was a kid, my parents would—over the summer, when I was off school—make me do work on our house, and it was always miserable. I would spend hours painting the eaves, with paint dripping on my face, and I was up on this ladder, sobbing, 20 feet off the ground. So when the series started, and I heard that the hook was ‘this family with a bunch of kids moves in to refurbish a house,’ I was expecting those kids to have to do grueling manual labor. And they didn’t, at all. Those kids got off really easy.”Paul Tremblay on endings:“Horror doesn’t have to have a nihilistic, depressing ending. You can have an optimistic ending, but for me, in order for that to work, to not feel like sentimentality, that optimism has to be defiant. Take the ending of The Terminator, where Linda Hamilton—even though it’s not a horror movie—but Linda Hamilton is on the side of the road, and the nuclear storm—the machine storm—is coming. And yeah, the world’s going to end, but it’s still weirdly optimistic, or defiantly optimistic, because she’s going to go on and fight, even though she knows everything she knows. … You have to honor the decisions and experiences that [your characters] have had, and you honor it by showing how they’ve been changed by what they just went through.”Dead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9qDead trees mean dead people, and scientists are finally starting to figure out why. wired.trib.al/zsbdu9qCNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices.\n\t\t"}