{"id": "Meet the Badass, Costumed Motorbike Taxi Drivers of NairobiMeet the Badass, Costumed Motorbike Taxi Drivers of Nairobi", "paragraph": "Dutch photographer Jan Hoek noticed this Ghost Rider–obsessed motorbike taxi driver during a recent visit to the Kenyan capital of Nairobi.To stand out from the hundreds of thousands of \"boda-boda\" drivers in Nairobi, many adopt special bike themes such as this Manchester United–loving driver.Hoek teamed up with Ugandan fashion designer Bobbin Case to design costumes for seven of Nairobi's most creative drivers, such as this Mad Max-inspired driver.Hoek and Case interviewed each driver to learn what they wanted in a costume. This driver chose a Machete theme.This driver's costume and bike were inspired by Mad Max: Fury Road.To match this driver's lion-themed bike, Case designed a fur-covered costume and helmet.This Rastafarian-inspired driver requested a helmet with holes through which he could poke his dreadlocks.After the photography shoot, all the drivers got to keep their costumes; many still wear them as they shuttle customers around Nairobi.Jan Hoek and Bobbin Case pose with some of the drivers they outfitted for the photography shoot.Dutch photographer Jan Hoek noticed this Ghost Rider–obsessed motorbike taxi driver during a recent visit to the Kenyan capital of Nairobi.To stand out from the hundreds of thousands of \"boda-boda\" drivers in Nairobi, many adopt special bike themes such as this Manchester United–loving driver.Hoek teamed up with Ugandan fashion designer Bobbin Case to design costumes for seven of Nairobi's most creative drivers, such as this Mad Max-inspired driver.Hoek and Case interviewed each driver to learn what they wanted in a costume. This driver chose a Machete theme.This driver's costume and bike were inspired by Mad Max: Fury Road.To match this driver's lion-themed bike, Case designed a fur-covered costume and helmet.This Rastafarian-inspired driver requested a helmet with holes through which he could poke his dreadlocks.After the photography shoot, all the drivers got to keep their costumes; many still wear them as they shuttle customers around Nairobi.Jan Hoek and Bobbin Case pose with some of the drivers they outfitted for the photography shoot.The Kenyan capital of Nairobi is notorious for having some of the world’s worst traffic. To beat the congestion, many residents have turned to the city’s fleet of motorbike taxis, known as boda-bodas; hundreds of thousands of such taxis are currently in operation, and their numbers continue to swell. With so much competition, the struggle to get customers is a fierce one, and so many boda-boda drivers decorate their bikes in eye-catching themes.During a recent visit to the Kibera slum of Nairobi, Dutch photographer Jan Hoek noticed a particularly creative boda-boda driver who had customized his bike to resemble the one driven by Nicholas Cage in the 2007 film Ghost Rider, based on the Marvel Comics character. There was only one thing missing: a matching costume. To remedy that fault, Hoek teamed up with Ugandan fashion designer Bobbin Case to create outfits for seven of the most creative boda-boda drivers in Nairobi.The Techies Turning Kenya Into a Silicon SavannahLoon's Internet-Slinging Balloons Are Headed to Work Over KenyaSomeone Finally Mapped Cape Town's Bewildering Taxi NetworkIn addition to the Ghost Rider, they recruited drivers with bikes inspired by Mad Max: Fury Road, the Danny Trejo film Machete, the Manchester United soccer team, and the Jamaican musician Vybz Kartel; there was also a dreadlocked driver with a Rastafari-themed motorbike. After interviewing the drivers about what they wanted in a costume, Case spent two months fabricating the outfits from scratch. Some of the drivers had special requests. The Rasta-inspired driver, for instance, wanted holes in his helmet so his locks could poke through.“In all my work, I think it’s really important that the subject is also a collaborator,” Hoek says. “What we were asking them to do was just a next step from what they were already doing, so for most of them it felt really natural.”Hoek photographed the riders in locations around Nairobi in the early morning, when the light was gentler and the roads were relatively clear. After the shoot, the drivers kept their costumes. Hoek has learned that the Machete driver hung his outfit up in his home like an artwork, and that the Mad Max driver sold his to a fellow boda-boda operator. The other drivers continue wearing various elements of their costumes while speeding around Nairobi.“We always hoped that they would get more customers because of the costumes,” Hoek says. “And we wanted to set a trend in Nairobi so that more motorbikers will dress up this way.”Shot mostly in Africa with real vehicles and complex stunts, “Mad Max: Fury Road” brings a high intensity to the post-apocalyptic franchise. Mike Seymour breaks down the complicated camerawork and VFX behind the action-adventure flick.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}