{"id": "Meet the Illustrator Diversifying Airbnb's ImageMeet the Illustrator Diversifying Airbnb's Image", "paragraph": "In her first few days working at Airbnb, Jennifer Hom saw that she had her work cut out for her. Hom had been hired as the company's first full-time illustrator, tasked with updating the bubbly cartoon figures spattered throughout the website and app. When she asked her coworkers what they most wanted to change about the illustrations—ones that showed stick-figures holding up cameras, or trading keys to their apartments—it wasn't the inconsistent style that bothered people. It was who the illustrated people looked like.\"My coworkers who are underrepresented minorities didn't relate to them at all,\" she says. They repeatedly told her, pointing to the drawings of people who looked nothing like real people, \"This doesn't represent me.\"Before joining Airbnb, Hom had spent six-and-a-half years working as a Google Doodler, creating the animated drawings that decorate the search engine's landing page each day. She'd also led an effort to update illustrations at Uber, dovetailing a major design refresh at the ride-share company. So when she arrived at Airbnb, she knew that illustrations could help to change a brand's image and engender loyalty with its users. If Airbnb wanted to reflect those users—the ones handing their keys over to strangers around the world—those illustrations needed to change.'If we’re going to represent who our community is, we should literally reference real people.'Jennifer Hom, illustration manager at AirbnbNow, one year later, Hom and a small team of illustrators have begun rolling out a series of new illustrations that they think better reflect Airbnb—and the world. The contributions are small, but significant: There's the colorful illustration of folks waving to new members when they sign up for an account. The group of multiracial colleagues high-fiving, roller bags in tow. Illustrated people of all shades flip open passports, take selfies, open the doors to their illustrated homes.For Airbnb, which has tried for years to ingratiate itself with diverse communities, the new illustrations represent a subtle but important change. In the past, it's created policies to fight discrimination on its platform, and even partnered with the NAACP to encourage participation with black households. All the while, the site's been filled with illustrated caricatures of white tourists on vacation. Lately, that's starting to change.Like so many Silicon Valley companies, Airbnb began as an accidental discovery. Co-founders Brian Chesky and Joe Gebbia, both graduates from the Rhode Island School of Design, shared an apartment in San Francisco and realized they could make extra cash by letting strangers sleep on an air mattress in their spare room. In the decade since, Airbnb has grown from their side hustle into a billion-dollar company, counting over 500,000 listings across 191 countries.The design, though, veered more \"fledgling start-up\" than \"global enterprise.\" When Hom joined the company last year, Airbnb was still using a patchwork of drawings from previous designers, along with some one-off illustrations someone had created for an early corporate PowerPoint presentation. The illustrations that popped up when people signed up to use the site, or browsed the listings, showed all kinds of people, drawn in all kinds of styles. Some of those people had brightly colored skin, in shades of pink and green. Others, designed more like stick figures, seemed absent of ethnicity, which made them look white. Few, if any, nodded to the geographic diversity in Airbnb's listings.\"Our motto is 'belong anywhere,' and by extension, that means 'everyone belongs,'\" says Hom, citing Airbnb's ethos. \"I took that to heart.\"So she got to work. Hom knew she needed to create a set of guidelines, imbuing a consistent style across all of Airbnb's illustrations. But she also wanted to tell a story about the company, and the people who use the service. Before anyone reads the fine print on Airbnb's sign-up page, they see the pictures. Before they sign up to start hosting guests, they look at the drawings of people in their illustrated homes. Hom saw an opportunity.  \"I looked at it not from an aesthetic perspective, but what is the company trying to do? How is it moving into the future?\"She began collecting reference photos from Airbnb’s network of hosts and guests, from her own friends and family, her coworkers at Airbnb, and famous figures throughout history. An experiment with non-human skin tones—like painting people in purple, or varying shades of gray—was quickly nixed. “If we’re going to represent who our community is, we should literally reference real people,” says Hom.The repository of images helped inform diverse face shapes, skin colors, facial expressions, and poses. One illustration, which now appears on a page about Airbnb's focus on community, borrows the likeness of a “famous human rights activist in San Francisco,” a choice that Hom says fit with the text on the page. (She declined to state due to image rights issues.) Others show illustrated versions of real hosts, real guests, or coworkers who asked Hom to illustrate their families. Some of the characters wear saris; at least one shows a woman with a prosthetic leg. The people who use Airbnb show up over and over—sometimes, quite literally, because Hom drew them onto the site.Design considerations, like Hom's illustrations, can seem small compared to the way a company handles policies or new features. But Silicon Valley companies—including Slack, Dropbox, and Shopify—are increasingly turning toward illustrators to add value in areas where engineering alone cannot. One survey, from the stock image site Shutterstock, found that diverse imagery can overwhelmingly help a brand's image. Illustrations can go even further than stock images, since they let people imagine themselves in the picture.Illustrations have created communities around brands for years. Reddit's early users latched onto Snoo—the illustrated alien mascot—as an extension of their identities online. At Google, the daily doodles gave users an excuse to come back to the site, if only to see what had changed. \"It didn’t serve any function, or drive revenue,\" she says. But it gave visitors a reason to come back, and proved that there was someone human on the other end of the website. “It presents an identity to the user—that we are real humans, and we are making things for you.”At Airbnb, Hom hopes the new illustrations can make good on Airbnb's claim of being for everyone, everywhere. And while her new illustrations have begun to pop up across Airbnb, her work there has only just begun.Apple Chief Design Officer Jony Ive spoke with VOGUE Editor-in-Chief Anna Wintour as part of WIRED25, WIRED’s 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}