{"id": "Trump's Game of Thrones Tweet Is Odd—but Probably Not Trademark InfringementTrump's Game of Thrones Tweet Is Odd—but Probably Not Trademark Infringement", "paragraph": "Of all the apparatuses presidents have at their disposal for making pronouncements—press secretaries, official statements, televised addresses from the Oval Office—the one President Trump used to trumpet forthcoming sanctions on Iran is by far the strangest: a Game of Thrones meme.On Friday morning the president posted the image below on Twitter. It’s a picture of himself emblazoned with the phrase “Sanctions Are Coming” in a typeface not that dissimilar from the one used in the Game of Thrones logo along with the date “November 5.” Subtle, it was not.https://twitter.com/realdonaldtrump/status/1058388700617498625As soon as it went up, and as soon as it was clarified by the White House that the sanctions in question were indeed the ones that had been relaxed during the Obama administration and which Trump had been seeking to reimpose, Twitter went nuts. Folks began responding with memes of their own—”Indictments Are Coming” etc.—and even the show’s cast got involved. Sophie Turner, who plays Sansa Stark, replied “Ew,” and Maisie Williams (Arya Stark), in perhaps the best Twitter drag of the day, retweeted the president and just added “Not today.” (“Not today,” for those who don’t remember, is what Arya Stark’s swordfighting instructor, Syrio Forel, told her is what she should say to the god of death.)Then HBO got in on the action, sending out a tweet reading, “How do you say trademark misuse in Dothraki?” Reached for comment the network added, “We were not aware of this messaging and would prefer our trademark not be misappropriated for political purposes.” Trump evoking the show’s logo and slogan, it seems, doesn’t sit very well with the people who actually make the show.But could the network or creators successfully sue? Probably not. First off, it doesn’t seem likely that HBO actually wants to make a legal claim of trademark infringement. At most, the network is playing along. Trump referenced the show; they responded. Simple as that. But the response, and subsequent online chatter, did raise some questions about whether or not the president went too far.Most likely, he didn’t.Trump's Plan to Redefine Gender Makes No Scientific SenseThe Internet Defines 'Covfefe'Trump's Auto Emissions Plan Is Full of Faulty LogicIf HBO were to bring a claim, it would probably be for what’s known as trademark dilution, says Daniel Nazer, a staff attorney for the Electronic Frontier Foundation’s intellectual property team. Typically, these are the kinds of claims companies make when they feel their very-famous trademarks are being used in ways that deplete the uniqueness, or dilute, their intended message. A company can’t, say, put something that looks like the Nike “swoosh” logo on the side of a commercial plane or use “Just do it.” to sell condoms.A dilution claim also generally requires that the entity claiming infringement be able to prove the public was genuinely confused. Because Trump’s tweet wasn’t being used in commerce, and because it’s unlikely anyone thought he was legit affiliated with Game of Thrones, dilution would be a hard argument to make. \"I think this would be a tough, a tough case,\" Nazer says. \"No one is likely to be confused that HBO is endorsing this tweet or sponsoring sanctions against Iran. My view is that this shouldn’t be a viable suit.\"Instead, Nazer says, Trump’s tweet would be treated more like a parody—legally speaking. If, for example, Saturday Night Live did a sketch about waiting for a train in New York titled “The G Train Is Coming” that pokes fun at MTA tardiness and references Game of Thrones, that’s not an infringing use. (It’s also a funny idea, SNL. Please make that sketch and credit Nazer.) As for Trump’s use of the Thrones font, the files used in typefaces can be protected, as is (presumably) the actual logo, but because Trump just uses a script that looks like the GoT emblem, the image the president tweeted is likely not infringing. It’s ironic, but the bottom line is that the man who likes to take shots at the media is protected here by the First Amendment.The bottom line is that the man who likes to take shots at the media is protected here by the First Amendment.The parody aspect, though, is compelling, because the metaphor doesn’t quite align. In Game of Thrones, “winter is coming” is a call to remain vigilant, and a warning that White Walkers could come and threaten the living when winter arrives. Yet winter has been coming on the show since the pilot; it’s a slow march that’s taken seven years. Trump’s “November 5” warning promises something he intends to do in a matter of days. Also, one presumes, Trump thinks the sanctions are a good idea, but the coming of winter in Game of Thrones is something most sane people in Westeros fear. It’s possible Trump wants Iran to be afraid of the sanctions, but the wordplay still doesn’t quite land.“It’s kind of riffing on it, but it’s hard to know what the satirical or parodic intent is here,” Nazer says. “Winter in the Game of Thrones universe is kind of terrible, so I’m not sure if they really thought it through. There’s probably nothing much beyond it looks cool.”Half an idea without any sense of its viability? Sounds about right.In the aftermath of the US elections, documentary photographer Guy Martin travelled to Veles, Macedonia to find out why this small town became the heart of the fake news scandal. These are the photos he took.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}