{"id": "Early Black Friday Deals on Dyson, Amazon Echo, and MoreEarly Black Friday Deals on Dyson, Amazon Echo, and More", "paragraph": "Last week, we featured sales on gear from outdoor retailers who were hoping to get a jump on the creeping monolith that is Black Friday. They're not alone. Many other manufacturers and retailers are hoping to entice you into checking out their wares before you fall into a post-turkey stupor. If you're in the mood—or if you have better things to do on your holiday weekend than shop—we've rounded up more than a dozen of our favorite deals to check out.It may not be as beautiful as the Nest, but the Ecobee4 was our smart home thermostat of choice when we reviewed it last year. Temperature sensors ensure that the far reaches of your house remain unbaked (and unfrozen). It has a full-color 3.5-inch LCD touchscreen that shows the indoor and outdoor temperature as you walk past, built-in Alexa, and can easily manage humidifiers and ventilators, as well as your HVAC system.Buy the Ecobee4 Smart Thermostat for $199 (Was $249).Amazon Echo Sub Bundle with Two Echo Plus Speakers for $330 ($100 off). If you have your eye on an Amazon product, know that they'll release new deals on them every few days through the holiday. This is one saves you $100 on a speaker system that also doubles as a smart home.Echo Dot and Tile Mate Bundle for $50 ($50 off). With this bundle, you can ask Alexa to find your keys in the morning. Just enable the Tile skill in the Alexa app. If only the Tile Mate were small enough to attach to your sunglasses.Echo Dot Kids + Fire HD 8 for Kids for $150 ($50 off). When you get an Echo Dot Kids and a Fire HD 8 for Kids, you're not really paying for hardware. You're paying for peace of mind and a little more free time. It's worth it.25 Percent Off a New Kindle with Trade-In. Of all the new Amazon products this year, the waterproof Kindle Paperwhite is what I'm most excited about. Here's a good way to get one for considerably cheaper.LG OLED 55-Inch 4K TV for $1,697 ($400 off). The inky blacks and vivid colors of an LG OLED TV are even better with LG's alpha 9 intelligent processor. Oh, and with a much lower price tag.Sceptre 55-Inch 4K UHD TV for $250 ($150 off). A great price for a TV with deep blacks and fantastic image detail.Microsoft Surface 13.5-Inch Laptop for $800 ($200 off). Still debating over which Surface you should buy? Here's one good option.Alienware Aurora for $1,600 ($360 off). Do your holiday weekend plans involve a little virtual reality? An 8th Gen K-series Intel processor might help with that.Beats Powerbeats3 for $134 ($64 off). These are an oldie but a goodie. We loved how the over-ear fit held the headphones secure. They also have decent battery life and just enough of that signature Beats oontz.iRobot Roomba 960 for $449 ($250 off). Our favorite robot vacuum manufacturer has a couple of great deals this weekend. Roomba's 900 series has it all: Smart maps; Dirt Detect to sniff out gross spots; and AeroForce cleaning technology to suck up dirt with a typhoon's force. You can also get a Braava Jet mopping robot for $30 off right now, too.Dyson V8 for $356 ($144 off). A cordless stick vac is a lifesaver when it comes to picking up small messes quickly. The V8 has a battery life of 40 minutes and like the others in this series, it has a HEPA filter and can convert to a handheld.Ultimate Survival Technologies Heritage Camp Lantern for $30 ($30 off). REI's Gear Up, Get Out sale is going strong through November 19. This water-resistant camp lamp has a dimmer switch and a candle flicker mode, if you want the cozy ambiance of an open flame but not the danger or inconvenience. You can look at last week's picks here.When you buy something using the retail links in our product reviews, we may earn a small affiliate commission. Read more about how this works.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}