{"id": "14 Weekend Deals on Great Games, Consoles, and Gear14 Weekend Deals on Great Games, Consoles, and Gear", "paragraph": "Maybe it's the new Call of Duty game, or maybe it's just a coincidence. Either way, there are a surprising number of videogame deals and bundles this week. So many that we decided to dedicate this week's deal roundup to the gaming gods. Below are some console bundles, software, and accessories that we like—all with extra attractive price tags.Sony PlayStation Gold Wireless Headset for $71 (Was $90). This is one of the Best Wireless Gaming Headsets you can buy (8/10, WIRED Recommends).64GB MicroSD Card for $14 (Was $25). Great for Nintendo Switch owners. Every Switch needs a SD card if you hope to download games.Xbox One Camo Controller for $50 (Was $70). This controller is offbeat in color, but much cheaper than the normal price.Other Xbox Controllers On Sale (Various Colors). The black model is now down to $46.2 PS4 Controllers for $75 (Was $106)These bundles are brand new. Check out our Bundle Deal roundups for PS4, Switch, and Xbox One for more discounts if you're shopping for a new system.Nintendo Switch Diablo III Edition for $360PS4 Pro Red Dead Redemption 2 Bundle for $399 (Was $460)Call of Duty: Black Ops 4 for PS4 ($56) or Xbox One ($51). Also available at GameStop. Read our Review here.SoulCalibur VI for $60. PS4 and Xbox owners can now buy the latest Bandai Namco fighter, which has solid reviews and now uses the Unreal engine. It's new this week.NBA 2K19 for $40 (Was $60). Discount available for PS4, Xbox One, and Switch. We haven't played it yet, but this game has favorable Metacritic ratings.Donkey Kong Country: Tropical Freeze for $45 (Was $60). If you like a good sidescroller, this is it. It was remastered for the Switch without much fanfare this year, but it's a ton of fun (and has a great soundtrack).3 PS4 Hit Games for $40. This bundle has Uncharted 4, The Last of Us Remastered, and God of War III Remastered.Resident Evil 7 for $30 (Was $40). Read our review to learn why this RE is especially frightening.Life is Strange: Before the Storm for $20 (Was $30). This is a prequel to the original Life is Strange and operates much the same way. You make story choices and those choices impact the narrative in surprising ways.Best Buy Game Sale. There are a bunch more games on sale at Best Buy, including titles like Mario Kart 8, Assassin's Creed Origins, and more.When you buy something using the retail links in our product reviews, we earn a small affiliate commission. Read more about how this works.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}