{"id": "Why WhatsApp Became a Hotbed for Rumors and Lies in BrazilWhy WhatsApp Became a Hotbed for Rumors and Lies in Brazil", "paragraph": "WhatsApp has been in the news recently almost as much as its corporate parent, Facebook. During the recent Brazilian presidential campaign, a group of wealthy supporters of eventual winner Jair Bolsonaro purportedly paid for an army of WhatsApp shills to spread disinformation about his opponent. One outlandish piece claimed Bolsonaro’s opponent Fernando Haddad planned to distribute phallic-shaped baby bottles to children to counteract homophobia. Haddad supporters responded with their own media assault. A Brazilian fact-checking industry sprung up to counteract the rumors, and the fact checkers themselves were soon the subject of a misinformation campaign.WhatsApp is very different than Facebook, making it a foil to the company that ingested it. To use the language of growth marketing (popular at both Facebook and WhatsApp), they’re an ‘A/B test’, a side-by-side experiment of differing conditions that (in this case) led to similar results.First, a WhatsApp primer, largely for Americans who by and large don’t use the service. It’s a spare and minimalist mobile-messaging app, much like Apple’s iMessage or Google’s Hangouts, and much simpler than Facebook’s feature-riddled Messenger. In brief, it looks like the semester project of an ambitious mobile-development student: You can send and forward messages to people in your phone’s contact list, and create groups with them. That’s it. (More recently, it added voice and video calling.)To those outside the WhatsApp universe, it might be hard to understand the app’s impact, or why Facebook spent $22 billion to acquire the 50-person company. Neither did I, until I moved to Spain in 2015 and soon realized I’d be a social pariah unless I became a WhatsApp user. In countries where WhatsApp reigns, the app is synonymous with phone messaging, and it is the way people talk to each other.How did such global dominance result from such a basic app? The founders of WhatsApp seized an opportunity created by most non-US phone carriers, who charged high rates for texts. They created an app that routed texts over cheaper data connections instead. In effect, what Skype did to international calling, turning expensive calls into essentially free internet usage, WhatsApp did to SMS. And once it created a network-effect moat, there was no stopping it. Which is why Facebook had to buy it at any cost.One key feature of WhatsApp is group messaging. Join any group activity, and you’re added to a growing group chat whose snowballing messages make your phone buzz constantly in your pocket until, in a fit of frustration, you leave the group or toggle notifications off. The feeling is that of being inside a loud bar or club where everyone is screaming at everybody. Yet, from WhatsApp’s astronomical and sustained usage, many users like living inside that noisy bar.As a contrast to Facebook, however, WhatsApp is more important for the features is does not have. There’s no News Feed, with its mysterious and much-maligned algorithm that supposedly creates the online filter bubble that turns a user’s mind into dangerously moldable putty. WhatsApp (and Mark Zuckerberg) have no influence on what you see or read; it’s purely decided by the people you engage with.There’s also almost no tracking of user data. Thanks to the WhatsApp founders’ cypherpunk leanings, messages on the platform are “end-to-end encrypted,” protected even from WhatsApp itself. Neither WhatsApp nor Facebook can hoover in the content of messages and tailor content or ads to that user.Speaking of which, there are no ads. You’ll find none of the “Attention Merchants” who turn a scintilla of your attention into dollars. Nor can political candidates attempt to sway your vote via ads (at least directly). The app historically funded itself with a modest $1-per-year fee, which Facebook dropped after the acquisition.So WhatsApp has none of Facebook’s most talked-about evil features, and yet it’s been implicated in much recent drama. That raises an important question: What are the ingredients of a weaponizable social media platform, the features shared by every such platform from WhatsApp to Facebook to Twitter, and whatever catches on next?For starters, the virtualization of your online identity via an app that spans all your devices, and the universalization of that identity among your entire cohort. Facebook discovered this by birthing itself inside the tightly knit social life of colleges, saturating them, and then expanding out. Everyone you know is on the platform, and you can’t have social standing without being a user, as true for WhatsApp (outside the US) as it is for Facebook (inside the US).That’s made possible by another development for which WhatsApp’s timing was impeccable: the wiring of every human brain to a smartphone, and the endless reinforcement training—Pavlov’s dogs come to mind—that’s turned most of us into cognitive cyborgs, making the phone an extension of our brains.So even though WhatsApp is free of News Feed and ads, it contains the key functionality that reverts our brains to the heavily social and fragmented medium that predates the textual age of editors and encyclopedias. As an old Facebook marketing saw put it, it’s “word of mouth at scale.” It’s this wiring of age-old human nature that evolved in a period of a few dozen social contacts to the instant, globe-spanning internet that’s the real problem.It’s almost cliché to compare the digital and mobile revolutions to Gutenberg’s printing press, but the comparison is apt. Gutenberg, like Zuckerberg or the founders of WhatsApp, raised what could only be called venture capital for his risky idea. He had to solve technical problems in moving from illuminated manuscripts and monks laboring in scriptoria to the typeset and scalable text whose digital echoes we see in our Kindles; this required new types of paper, new inks, the very notion of a typeface itself had to be invented.We understand the internet revolution—with its gradual accumulation of technologies from fiber-optic routers to email to browsers and smartphones—as separate things coming together slowly, but that’s because we’re living through it. Future historians looking back to us as we look to Gutenberg will coin some catch-all term for all this, just as we refer to that earlier revolution with the facile catch-all “printing press.”When they do look back, historians will look to see how we resolve our struggle between tribalism versus globalism, far more than any micro-drama around Zuckerberg, the EU’s GDPR law, or the latest Facebook data scandal. Put bluntly, can the bounties of the Enlightenment—liberal democracy governing pluralistic nation-states, the primacy of empirical truth over folklore or “fake news”—co-exist with technology that takes us back to a pre-Enlightenment mode of discourse: us vs. them, feeling over reason, the ephemeral and fragmented over the fact-checked and continuous.Facebook took an interesting step in Brazil to stem the deleterious effect of WhatsApp: It limited the message-forwarding feature to 20 people, down from the previous limit of 250. That brings the limit below what’s known as Dunbar’s number, which is the number of strong social relationships a person can maintain (somewhere around 150). With this change, users can’t broadcast salacious gossip or fake news or deceptive video to all their family and friends. This hopefully slows or stops the flow of false information and disrupts the echo chamber of in-group rumor-mongering. Facebook apparently has no plans to lift the forwarding limit even now that the election is done. For the moment, the company judges that the power of unfettered and universal group chatting is incompatible with social harmony.It’s still early days. There were 70 years between Gutenberg printing a book and Luther posting his theses. We haven’t even begun to see the real impact of our printing press—the socially mediated, globally connected smartphone; but we’d best get ready for a world in which it engulfs everything. Will the solution be to reinforce institutions that created the world we know, or will it evolve past those moribund institutions to some new way of mediating our communication? A recent Pew study showed that youngsters are better at distinguishing fact from opinion than the olds. Perhaps the new generation, born into a world where global connectivity is a given—but the commanding position of Wired or The New York Times is not—will cobble together some way to maintain institutions like democracy while ones like newspaper editors expire. The survival of the civilization we’ve built since inked letter blocks first hit paper will depend on it.WIRED contributing editor Garrett M. Graff, who covers special counsel Robert Mueller's Russia probe, authored the magazine's June cover story about Mueller's time in Vietnam, and wrote \"The Threat Matrix: Inside Robert Mueller's FBI and the War on Global Terror.\" Graff breaks down the investigation's status, the big outstanding questions, and where the investigation is likely to go after the midterm election.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}