{"id": "The Pie of the Future Is Baked With Freeze-Dried IngredientsThe Pie of the Future Is Baked With Freeze-Dried Ingredients", "paragraph": "High-end chefs spend a lot of time figuring out how to get foods to taste their best. Are they seasoned correctly? Is there a balance between fat and acidity that makes you want more? Is there a way they could pull off the ultimate feat of making a food taste more like itself?Using the trick I've just learned from rising-star chef Eric Rivera, you can up your holiday game rather easily and I'm willing to share it: using powdered freeze-dried foods to amp up the flavors in your favorite recipes.Rivera's apple pie, made with freeze-dried ingredients.I went up to Rivera's Seattle restaurant, Addo, to learn how to do it and for an apple pie taste test. I'd been intrigued by this \"freeze-dried\" idea, but what really made me want to learn more was the way he described his guests' reaction to his pie.\"What'd you do to this? What's in there,\" they ask, and he responds that it's just apples, butter, and flour.\"No man,\" they say, \"What'd you do to it?\"Rivera, who was previously director of culinary research under chef Grant Achatz at Chicago's ultra-high end restaurant, Alinea, set up a head-to-head competition so I could understand.For every gram of liquid in Rivera's test pie, he replaced it with a gram of powdered, freeze-dried apple, which he stirred into the filling.He was cooking when I arrived, sautéing two pans of cubed Braeburn apples with cinnamon, clove, allspice, sugar, and vanilla bean paste. Do what you want with your pumpkin spiced-whatever, I'll take the lovely aroma of apple pie. Once the apples let off some liquid and took on an al dente texture, he pulled both pans from the heat, then strained off and weighed the liquid from each. For every gram of liquid—he had 60—in the test pie, he replaced it with a gram of powdered, freeze-dried apple, which he stirred into the filling.Rivera caught me nervously eyeing the syrup as if it might be tossed.\"Oh no, man. You can alcohol that,\" he said. \"Throw that liquid in your bourbon!\"Phew.He sped on, pinching a ball of dough into two roughly equal pieces, rolling one out, placing it into the pie dish, adding the filling, then covering it with the other half of the dough. It all happened in a few minutes, Rivera quickly trimming the edges of the pie with a tiny offset spatula. It had nice, high-fat butter and a cheffy bit of koji powder in the crust \"for extra oomph,\" but the whole thing had a distinct \"weeknight pie\" vibe, and was nothing to give a home cook pause.\"Don't fuss too much,\" he counseled. \"It's pie.\"He whipped up the other pie exactly the same way, just minus the freeze-dried apple powder, popped both pies into the oven, and immediately switched to ideas for the rest of Thanksgiving.\"You can put freeze-dried cranberry powder in cranberry sauce—just stir it in at the end. Freeze-dry lean turkey meat and throw that powder in at the end of your gravy. Freeze-dry bread and put that in your stuffing,\" he said, all of these examples of making a dish taste more like itself. It was easy to imagine all of them tasting a little better.I asked him to move beyond Thanksgiving and project into the rest of the year and there was no beat-skipping on the powders he suggested: freeze-dried squash on roast squash, freeze-dried mushrooms in broths and sauces, freeze-dried pineapple \"as a finishing move\" to bring out acidity in a dish, freeze-dried soy sauce, \"because it's incredible.\"Rivera, of course, has his own $3,500 Harvest Right freeze-dryer so he can fiddle with these things with abandon, but there are all sorts of freeze-dried foods available online. Wal-Mart has stuff like asparagus and bananas, Whole Foods has whole house lines of them, and Amazon has everything, including Whole Foods.After the pies came out of the oven and the horrible waiting period where all we could do is stare at the beautiful pies and distract ourselves by taking pictures of them was over, Rivera finally sliced each one up with his paring knife and stared at me while I ate his pie.\"You have some, too!\" I said, trying to deflect his attention.I had nowhere to hide so I just dug in. Pie one—the \"normal\" pie—was grand. Lovely, but not fancy, and a great way to end a meal. Pie two—with the freeze-dried goodness—was fascinating and, in retrospect, started messing with my idea of \"pie\" right away. It will do the same to you. That's a good thing. The flavors were concentrated, apple-y, and the filling set up firm.\"It's the pectins! It's like a McDonald's apple pie,\" Rivera joked, referring to the soluble gelatinous polysaccharide in apples that lead to that setting up.Yet with that first bite still in my mouth, I was forced to understand what I think of when I think of apple pie. My version had a bit more juice in there, and some more, uh, squish.It was, most emphatically, not a problem. My take on the recipe turned into a Rivera-approved version where I kept some of the juice and scaled back a bit on the freeze-dried powder. It doesn't have to be an exact science. It's Pie!Lacking my own freeze-drying machine, I got a bag of freeze-dried apples, assembled the rest of my pie ingredients, and got cooking. The important thing about using freeze-dried apples in apple pie is that as long as you're used to making pie, nothing about this one is going to feel very different. Straining and weighing the juice and running the freeze-dried apple slices through the spice grinder might be a bit different from classic apple pie recipes, but nothing to give you pause.One thing that might catch your eye is the dough's virtual one-to-one ratio of flour to butter, feels like a homage to Joël Robuchon's incredibly buttery mashed potatoes. A bit of practice, though, and you'll get it.My big takeaway is that while we've got a killer recipe to try here, you can just tweak your classic pie recipe and add some powder. Use your own dough recipe if you prefer. Toss a bit of koji powder in it. Or don't. Take out an apple and add some freeze-dried powder. Don't take out an apple and still add some freeze-dried powder. Experiment! More than likely, your pie will get better. Rivera will approve!I made the pie twice in my test kitchen, the first time to get the hang of it, the second mostly to nail the dough—the \"freeze-dried\" steps weren't much to get used to. I went with the half juice and half freeze-dried apple powder route and my pies were great. I really knew I was on to something at the end of a dinner when my friend Rob sat in front of his slice, fork in hand, and looked over at me. He didn't speak, but the look in his eye seemed to say, \"What did you do to this?\"For the dough:For the filling:Keep handy:1. Combine the dry ingredients for the dough in a medium mixing bowl, sift them into the bowl of a food processor, then add the butter and 75ml of cold water. Pulse the food processor with just a couple 1-second bursts until the dough takes on an uneven, pebbly texture. (Err on the side of caution—if the dough takes on a stretchy texture, you'll need to pitch it and start over.) Return the dough to the mixing bowl and knead it just until it holds together in a ball. Pinch the dough into two roughly even balls, dust them with flour, cover them in plastic wrap, and rest them in the refrigerator for at least an hour or overnight. Do not freeze them.2. Preheat the oven to 350 degrees Fahrenheit. Toast the cinnamon, clove, allspice, and nutmeg in a large sauté pan over medium heat until fragrant, about one minute. (If you're using a combination of ground and whole spices here, toast the whole spices, followed separately by the ground.) Grind the whole spices to a powder in a spice grinder, and return all the spices to the pan. Quickly stir in the salt, brown sugar, vanilla bean paste, and apples. Cook, stirring occasionally, until the apples release some liquid, soften a bit, and have an al dente texture, about five to 10 minutes.3. Turn off the heat, strain the liquid from the apples into a container, and return the apples to the sauté pan. Weigh the liquid. Replace 50 to 100 percent of the liquid by weight with an equal weight of powdered, freeze-dried apple, stirring that into the filling. Try 100 percent if you like firmer filling, 50-50 if you like it juicier. Save any unused liquid for another use, perhaps adding it to a glass of bourbon.4. Roll out one dough ball on a lightly floured surface, creating a 12-inch disc, then transfer it to the bottom of a 9-inch borosilicate glass pie dish, gently pressing the dough against the side of the pie dish and draping the excess over the edge. Add the filling. Roll out the second dough ball and drape it over the top of the pie. Use your fingers to pinch the top and bottom layers of dough together, then trim the edge with a knife. Cut a couple of 2-inch slits in the top of the dough, and add a dusting of cinnamon and a fat pinch of Maldon salt.5. Bake the pie for 30 minutes at 350 degrees, then take a look at the crust. If it's on its way to a nice brown color, leave it be and let it cook for another 10 minutes. If it's not starting to brown, increase the heat to 450 degrees and check its progress every five minutes. Remove the pie from the oven when the crust is a nice, golden brown.Food writer Joe Ray (@joe_diner) is a Lowell Thomas Travel Journalist of The Year, a restaurant critic, and author of \"Sea and Smoke\" with chef Blaine Wetzel.We brought a renowned Houston chef to NASA's Food Lab so he could try and provide a fine dining experience using only space food.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}