{"id": "This Week's Bomb Scares Are a Perfect Misinformation StormThis Week's Bomb Scares Are a Perfect Misinformation Storm", "paragraph": "At least five explosive devices and suspicious packages targeting the homes of prominent Democrats and the New York offices of CNN have been intercepted this week, sending the internet's misinformation machine into a tailspin. On Wednesday, news broke that two packages were intercepted en route to the home of former President Barack Obama as well as that of Bill and Hillary Clinton, the former president and secretary of state, respectively. Another, containing a pipe bomb and an envelope of white powder, was discovered in the CNN building mailroom.The news set off a wave of reports about additional packages targeting other liberal leaders, including former Democratic National Committee chair Debbie Wasserman Schultz. The Federal Bureau of Investigations later said that Wasserman Schultz was listed on the return address of all of the packages.1Meanwhile, false reports of a bomb sent to the White House quickly spread, while partisans on both sides ginned up unproven theories about who was behind the attempted bombings—or whether there were really any bombs at all. (There were.)As with any breaking news story, the conversation you see online may not always represent the truth. Here's what we know so far.What’s HappeningOn Monday night, an explosive device was found at the suburban New York home of billionaire philanthropist and Democratic donor George Soros . The pipe bomb, affixed with a detonator, was reportedly hand-delivered, not sent through the mail, and discovered by a caretaker, who then called the police. The FBI's Joint Terrorism Task Force is investigating the matter, but as of Wednesday morning hadn't produced any results.Then, early Wednesday morning, reports of three additional bombs emerged. According to the Secret Service, on Tuesday night agents intercepted a \"suspicious package\" addressed to Hillary Clinton at her home in Chappaqua, New York. The next morning, Secret Service discovered a second package addressed to Obama's Washington, DC home.\"The packages were immediately identified during routine mail screening procedures as potential explosive devices and were appropriately handled as such,\" the Secret Service wrote in a statement. \"Both packages were intercepted prior to being delivered to their intended location. The protectees did not receive the packages nor were they at risk of receiving them.\"Shortly after that story broke, CNN’s offices at the Time Warner Center in New York were evacuated after the mailroom received a suspicious package. In a press conference, NYPD Commissioner James O'Neill confirmed that the package included a \"live explosive device\" and an envelope full of white powder. According to the FBI, the device was addressed to former Central Intelligence Agency head John Brennan, who is now a contributor to MSNBC.\"This clearly is an act of terror attempting to undermine our free press and leaders of this country through acts of violence,\" New York City mayor Bill De Blasio said at the press event.Police also responded on Wednesday to a suspicious package at the Sunrise, Florida, office of Wasserman Schultz. According to the FBI, the package was actually addressed to Eric Holder, the former attorney general, but because it listed Wasserman Schultz as the return address, it was rerouted to her Florida office.All of these packages were sent in manila envelopes, with six stamps and computer-printed address labels. While the FBI has only confirmed five targets, a sixth package, intercepted by a congressional mail facility and addressed to Representative Maxine Waters of California, is also under investigation. Capitol police didn't respond to WIRED's request for comment, and the FBI has not listed Waters as a target.Throughout the day, an avalanche of additional supposed targets, including New York Governor Andrew Cuomo and Senator Kamala Harris, also from California, were named, only to be disputed later by officials.What People Are SayingLet’s say this first: Local and federal authorities are in the process of investigating these incidents.“This investigation is of the highest priority for the FBI. We have committed the full strength of the FBI’s resources and, together with our partners on our Joint Terrorism Task Forces, we will continue to work to identify and arrest whoever is responsible for sending these packages,” FBI Director Christopher Wray said in a statement.They have not commented on who the bomb maker (or makers) may be, nor their potential motives. President Donald Trump condemned the acts Wednesday afternoon from the White House. \"Acts or threats of political violence of any kind have no place in the United States of America,\" he said. \"We’re extremely angry, upset, unhappy about what we witnessed this morning, and we will get to the bottom of it.\"But the lack of evidence as to the perpetrators didn't stop the outrage machine on the left from blaming the attempted attacks on their opponents on the right. Nor did it stop fringe voices on the right from calling the bomb scares \"false flag\" attacks.Even before bombs were discovered en route to the Obama and Clinton homes, QAnon's conspiracy theorists were waving false flag theories about the bomb scare at the Soros home on the internet message board 4chan. On Wednesday, the notion that the whole thing was actually a hoax bled onto Twitter, where Pizzagate proponent Michael Flynn Jr. wrote that the bomb scares were a \"political stunt.\" Far-right radio personality Bill Mitchell tweeted: \"These 'explosive packages' being sent to the #Media and high profile Democrats has Soros astro-turfing written all over it so the media can paint the #GOP as 'the dangerous mob.'\"As these conspiracies spread, liberal voices were just as quick to pin the blame on Republicans, without knowing anything about the bomber's identity or motives. \"YOU OWN THIS, @GOP Every last ugly iota of the destruction of our democracy,\" wrote Peter Daou, a former Clinton adviser. Another vocal Clinton adviser, Philippe Reines, tweeted at President Trump with the message: \"This is on you.\"In the middle of all this, false reports of another bomb being sent to the White House began to spread. CNN reported it, then rescinded the report. Former Alaska Governor Sarah Palin shared the rumor with her 1.51 million Twitter followers, writing \"BREAKING: FOUR Potential Bomb Scares JUST Happened: At White House, Homes Of Clintons, Obamas, And NY Building.\" The Secret Service quickly corrected the claim, writing that \"Reports of a third intercepted package addressed to the [White House] are incorrect.\"Cuomo, meanwhile, said at a press conference that his office had been targeted too. But an NYPD spokesperson tells WIRED the package was \"deemed to be non-suspicious.\" The building where both the San Diego Tribune and Harris have offices was also evacuated, stirring speculation of another suspicious package bound for the senator. But her office dispelled the rumor, saying the package was not addressed to her and was deemed not to be an explosive device.Why It MattersThese bomb scares have formed a perfect storm for misinformation. First came a torrent of breaking news reports, which are always riddled with holes and unanswered questions: Who sent the packages? Who were they addressed to? What was inside? Were they really all bombs? Add to that the fact that the incidents involve high-profile, polarizing figures in American politics who already are the frequent subjects of misinformation campaigns, and that the country is just weeks away from a contentious midterm election. Put it all on social media, where anyone can baselessly speculate and fear monger, and you get a deluge of unintentionally false reporting, partisan finger-pointing, and bad-faith conspiracy theories.The investigation will take time, and not just because mail moves through the postal system at different speeds. The FBI warns that additional packages may be out there. With the country's political leaders on alert, there will likely be more false reports made, as the FBI and US Postal Service work to put the pieces together. As these reports arise, it's imperative to be vigilant. At a time when someone is targeting members of a political party with bombs, the last thing anyone needs is misinformation making the situation more explosive.1Update 5:45 pm ET 10/24/2018 This story has been updated to include comment from the FBI.YouTube CEO Susan Wojcicki spoke with WIRED’s Peter Rubin as part of WIRED25, WIRED’s 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}