{"id": "Don’t Be Duped by Voting Misinformation Before the MidtermsDon’t Be Duped by Voting Misinformation Before the Midterms", "paragraph": "The midterm elections are just a few days away. Though historically the president’s party takes a beating in the House and Senate, that’s far from assured this year. Will the midterms be a rebuke or an endorsement of the Trump administration? On November 6, you will decide.As 2016 emphatically demonstrated, elections are also a major battleground for information warfare. Coordinated misinformation campaigns focus not just on individual candidates but also the electoral system itself. And though political operatives have used misleading tactics for years, the amplification and network efforts of social media have been like gasoline to a fire. Misinformation now spreads farther, faster, and ensnares unwitting accomplices who share bad information without realizing it.Tech companies and governments are slowly beginning to realize that the information war is on and they need to respond. But you still need to be aware, and be informed.The balance of the House and the Senate will be decided on Tuesday, along with 36 governorships, 30 state attorneys general, many state legislative seats, and crucial local ballot initiatives on everything from a new tax to fight homelessness in San Francisco to recreational marijuana to climate change to drug sentencing reform.To find out accurate information about where you can vote, whether you can still register, and who and what is on the ballot in your area, you can consult your local election officials. The US Election Assistance Commission lists the phone numbers and websites for every state and US territory on its website. There are also third-party tools supported by nonpartisan organizations like Ballotopedia, Democracy Works,  and Vote411.org, which allow you to input your address and receive individualized voter information for your area.There’s a ton of misinformation out there, and it’s always evolving, but there are a few general themes that come up every election cycle.Voter FraudVoter fraud is a constant boogeyman. In the months leading up to the 2016 election, for instance, President Trump warned that millions of undocumented immigrants would vote. After he won the presidency but lost the popular vote to Hillary Clinton, he said that voter fraud was the reason. None of this, said the state authorities whose job it is to maintain the integrity of elections in the US, was true. In fact, when all the votes had been tallied—137.7 million of them—states investigating claims of voter fraud found “next to none,” according to Tthe New York Times.Still, months into his first term, President Trump created a commission explicitly to study voter fraud. After intense criticism from experts who called it unnecessary, as well as legal challenges, it was dissolved in January, having released no evidence to substantiate the president’s allegations that millions of people voted illegally in the 2016 election. That hasn’t stopped people from claiming it’s a major issue, or from imposing restrictions like voter ID.To support claims for widespread voter fraud, many point to states and counties where there are more registered voters than eligible adults. In California, for example, the claim that 11 counties have more people registered than are eligible to vote has spread from a conservative activist group called Judicial Watch to Alex Jones to Breitbart all the way to secretary of state candidate Mark Meuser, who regularly records and tweets out videos alleging widespread registration fraud in the state. This argument is misleading, as The Sacramento Bee, the Los Angeles Times, and The San Diego Union Tribune have all reported, because they combine “inactive” and “active” voters lists.  In California, inactive voters—who, for example, may have moved but not returned an address confirmation notice—are still eligible to vote, according to state law; they just need to show proof of residency when they arrive at the polls. A January report from the California secretary of state noted that only 75 percent of eligible voters in the state are registered.Fraudulent claims of voter fraud don’t always come in the form of misleading numbers; they can be photos, too. Doctored or out-of-context photos and videos that purport to show voter fraud taking place were shared during the 2016 election—such as one Photoshopped image that combined two separate photos to make it look like ICE was arresting people in line to vote—and as recently as last week during the presidential election in Brazil. As with other misinformation campaigns, real images taken out of context are often used as fake “proof.”What makes this kind of misinformation so intractable is how it has the trappings of verisimilitude—a lawsuit from a Washington, DC-based group, the buy-in of political candidates and mainstream-adjacent news organizations. It also feels right to many people, who have been primed for years to suspect that fraudulent votes are a huge problem.It’s not that voter fraud never happens; it does. But very rarely, and nowhere near the levels suggested by right-wing conspiracy theories or the president. Here’s where you can find these numbers yourself: The nonpartisan Brennan Center for Justice, run by the New York University School of Law, has put together lots of research on the persistent myth of voter fraud.Voter SuppressionUnder the National Voter Registration Act of 1993, states are required to accurately maintain their voter rolls. The rules by which states purge voters vary by jurisdiction, and they are incredibly confusing. Errors in the process and inaccurate data have led to the disenfranchisement of thousands of eligible voters. And some states have become far more aggressive in purging voter rolls since the Supreme Court struck down aspects of the Voting Rights Act in Shelby County v. Holder.Georgia, in particular, is facing ongoing lawsuits for voter suppression over its practices. Other states have drawn national scrutiny for moving polling places miles out of town or implementing voter ID laws that disproportionately affect certain communities.But the issue of voter rolls can be complicated and varies by state, making it a perfect topic to sow confusion along party lines. For instance, one viral stat going around says that 700,000 voters have been removed from the voter rolls in Colorado; some have suggested this is part of the nationwide effort to purge legitimate voters. The Colorado government has pushed back, pointing out that these voters were purged over the course of a decade, according to the Republican secretary of state, Wayne Williams, for legitimate reasons.Voting MachinesThere’s also misinformation swirling around the actual hardware we use to vote. Again, this is nothing new. In the 2016 election, a video that purported to show a \"rigged\" machine not allowing a vote for Trump in Pennsylvania went viral, at least in part after being promoted by Russian operatives. The malfunction turned out to be user error, but it was shared as proof of voting fraud by thousands of people.During early voting for this year’s midterms, reports emerged of machines in parts of Texas switching US senate race votes if people vote the straight party ticket. This is actually happening; according to the Texas secretary of state’s office, only 20 or so people have reported such a problem, and the government and the voting machine company blame the issues on user error. But voting experts say the problem lies with the machines themselves, which have been known to be unreliable when voting a straight party ticket for years. And while experts have also said that the machines are insecure, there does not appear to have been hacking in this case. Nevertheless, claims that this is the work of hackers or a coordinated conspiracy by Republicans have flourished.Stories about voting machines are ripe for misinformation. After 2016, the US is on high alert for election interference: More than half of Americans say they are not too confident or not at all confident that the US election system is secure from hacking or other technological threats, according to a recent Pew survey. In both of the above cases, though, quirks of the voting machines themselves turned out to provide the more likely explanation—something to remember before drawing quick conclusions. And while progress has been uneven, it’s worth noting that election officials have taken steps to shore up the electoral system in the past few years.Bad-Faith Campaign MessagingSpreading misinformation and uncertainty about elections is another unfortunate electoral tradition, whether it’s by candidates, parties, or more anonymous actors. Historically, these tactics often target specific communities, such as robocall campaigns intended to suppress the black vote or fake flyers distributed on college campuses or in communities of color. This week, North Dakota's state Democratic Party affiliate posted on its website and Facebook a warning to hunters that they may lose their licenses in other states if they vote in the election.Politicians and their campaigns are engaged in direct disinformation targeting people likely to vote for their opponents, as The New York Times notes. This includes everything from the wrong date for election day being sent out to voters, to text messages that seem to come directly from the president. These texts are made to look like the presidential alert that went out a few weeks ago, though in this case they are telling voters that their early vote has not been recorded. The purpose seems to be merely to confuse,  as the Daily Beast reported, noting that state governments aren’t sure the messages are illegal but are looking into it. Fake text messages have also popped up this campaign season, too.Voting in America is hard. It happens on a work day. People aren’t automatically registered when they hit voting age or even when they get a driver’s license in most states. The early voting process is different in every state. All of this contributes to low voter turnout, particularly in non-presidential elections.Researchers trying to understand why people don’t vote point to myriad factors, including confusion about how to vote and whether people are eligible. It’s this problem that misinformation can so easily exacerbate. In 2007, then senator Barack Obama and Senator Chuck Schumer introduced the Deceptive Practices and Voter Intimidation Prevention Act, after high-profile cases of misleading voter tactics in the 2006 midterms. It didn’t pass, and subsequent attempts haven't been any more successful. California recently passed a law creating an Office of Elections Cybersecurity to explicitly counter online misinformation intended to discourage voting. Facebook also recently announced a new policy to try to address misinformation on its platform that is intended to suppress the vote.To help you recognize fact from fiction, familiarize yourself with the many sites and sources devoted to identifying misinformation. There are fact-checking sites like Snopes, where you can look up specific stories. The nonprofit investigative news organization ProPublica runs a coalition of newsrooms called Electionland dedicated to accurate reporting on the midterms, which is a fantastic resource for finding real news that matters. (WIRED is a partner on ProPublica’s Political Ads Collector project.)  You can also arm yourself with tools, such as the new bot-catching Chrome extension BotCheck, which will reveal bots in your social feeds, and reverse-image-search tools, which let you figure out where an image actually originates.With voter turnout during midterms historically low, each vote can have a large impact—particularly when it comes to local elections, which can be decided by a handful of votes. If misinformation, intentional or otherwise, can dissuade one person from showing up, that matters.Yuval Noah Harari, historian and best-selling author of Sapiens, Homo Deus and 21 Lessons for the 21st Century, and Tristan Harris, co-founder and executive director of the Center for Humane Technology, speak with WIRED Editor in Chief Nicholas Thompson.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}