{"id": "What Is a Bot?What Is a Bot?", "paragraph": "Our in-house Know-It-Alls answer questions about your interactions with\ntechnology.Q: What is a bot?A: It’s a sunny day outside, but you wouldn’t know it. You’ve been staring at the modern hellscape known as Twitter for hours now, refreshing feed after feed. Your eyes are glazed over but you keep going; you’re too deep into Politics Twitter to stop. That’s when you see her. Or maybe...it? The account’s handle is @DeplorableGranny4545. The profile picture is a slightly blurry selfie of a white woman who is maybe in her 60s, sporting a Make America Great Again hat and a duckface. Her bio is full of seemingly nonsensical hashtags, out of place punctuation marks, and, strangely enough, the phrase “Not A bOt!!” You take another sip of six-hour-old coffee and look closer. Over the last 3 days @DeplorableGranny4545 has tweeted nearly 2,000 times, averaging about 660 retweets and seven original tweets a day. Each one is about politics and includes a litany of hashtags and links popular with the far right. Is this a bot?, you wonder, trying to mentally calculate if would even be possible for a human being to accomplish that much in a day.You’ve stumbled on a question that Twitter itself can’t quite figure out. Technically speaking, bots are automated programs designed to perform a specific task, like tweet every new word that appears in the New York Times, colorize black and white photos on Reddit, or connect you with a customer service agent. There are bad ones, good ones, and countless more in between. Bots are often associated with sites like Twitter, but there are many other types.A chatbot is a computer program designed to simulate human conversation. You’ve probably encountered one on Facebook Messenger, a retail website, or on Tinder (sorry to break it to you, but that extremely-out-of-your-league model you matched with that’s interested in knowing your mother’s maiden name likely isn’t real). As you probably know, interactions with bots don't feel as mechanical as you might think. In 1963, a rudimentary chatbot dubbed ELIZA won users over despite laughably basic canned responses for a therapy-like messaging service. ELIZA mostly just turned users’ statements into questions based on a number of keywords (e.g. “I am unhappy,” “Can you explain what made you unhappy?\") and would revert to blanket statements like “I see” or “Please go on” anytime it got confused, yet people cited feeling an emotional connection with the bot. Since then, chatbots have come a long way, but most still operate using some combination of machine learning and set scripts.Other bots keep the internet running smoothly. Crawler bots help search engines like Google decide what to display when you frantically search for “How to tell if dog ate AirPods” at midnight on a Tuesday; monitoring bots, well, monitor things, like whether Twitter is down and your soul is finally free; aggregator bots keep your RSS feeds filled with piping hot takes about whatever Donald Trump tweeted that day.What isn’t a bot?Most things, really. Much like trolls or fake news, the term “bot” has lost much of its actual meaning, becoming a vague tech-adjacent buzzword. This is especially true in the case of the so-called propaganda bot, which has morphed into a catchall term for a Scary Fake Account With A Specific Purpose. There are countless “bot trackers” and dashboards out there that claim to show what the big bad bots are up to on sites like Twitter. Most aren’t tracking bots per se, but rather accounts associated with known groups of bad actors, like Russia’s Internet Research Agency, or accounts exhibiting “bot-like activity.”What is bot-like activity?Though there are many types of bots, “bot-like activity” is typically used only in reference to Twitter. Retweeting things hundreds of times a day, spamming the same link repeatedly, and using multiple accounts to amplify the same message are all good indicators of bot-like activity, but it doesn’t necessarily mean that the account is a bot.Even Twitter gets confused sometimes. Earlier this year, a group of Trump-loving grannies ran into trouble because they spent up to 14 hours a day tweeting about the president and his allies. Some retweeted content from the same handful of other accounts over 500 times a day at all hours for months on end, flooding their followers’ feeds with a stream of seemingly automated activity. Twitter decided they were bots and kicked them off the service. Yet the women were very real humans.So, are bots bad or not?Bots are having a bit of an image problem right now. Sure, some bots aren’t great, but most range from innocuous to delightful. Twitter is full of purposefully good (and sometimes even pretty funny) bots. There’s a bot that replaces the word “blockchain” in headlines with “Beyoncé,” another one that shares surreal memes from Reddit, and one that just tweets out random verbs followed by the phrase “me daddy.”https://twitter.com/blkchninstitute/status/1060934448882049024https://twitter.com/bot_me_daddy/status/1060026772543193088https://twitter.com/MemesSurreal/status/1060803147185176576You can even make your own without much effort on sites like CheapBotsDoneQuick. A pitch: A bot that sends people this article whenever they incorrectly use the word bot.Happy botting.Paris Martineau is not a bot, but she does tweet a lot. She is also a staff writer for WIRED’s business section and the proud owner of 27 TweetDeck columns.What can we tell you? No, really, what do you want one of our in-house experts to tell you? Post your question in the comments or email the Know-It-Alls.Richard Browning built the world's fastest personal jet suit. WIRED spoke with him to find out about the design process and engineering of a radical new form of transportation.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}