{"id": "Waymo Drops the Driver, Plus More This Week in the Future of CarsWaymo Drops the Driver, Plus More This Week in the Future of Cars", "paragraph": "It was sneakily a big week for driverless cars. Waymo, the Googley guys and gals who are supposed to be winning the self-driving race, officially received the very first California DMV permit to test their vehicles in the state—without a human behind the wheel. The company suggests it will welcome members of the Golden State public into its driverless ... at some point. Meanwhile, Tesla is embroiled in another lawsuit over whether its Autopilot feature is being marketed the right way—that is, as not a driverless feature. (Pay attention to the road at all times, folks!) Meanwhile, it launched Navigate on Autopilot, a new capability that relies on using Tesla drivers as beta testers.In other news: Uber makes it easier to eat on the company dime, Chevrolet makes an electric Camara, and I could look at these transit maps for hours. It’s been a week. Let’s get you caught up.Lordy, look at this electric Chevy Camaro concept, unveiled this week in Las Vegas. Its makers promise it can run the quarter mile in the 9-second range, which just might be fast enough to get Vin Diesel to change his name to Vin Voltage.A Florida man named Shawn Hudson sues Tesla after his Model S crashed into a disabled Ford Fiesta while on Autopilot. Hudson says the car was going 80 mph and he was looking at his phone at the time of the crash—but his lawsuit claims Tesla’s salespeople misled him about the capabilities of the semi-autonomous feature.Oh, and speaking of Autopilot: Tesla says it’s getting even better with the “Navigate on Autopilot” feature, which is meant to guide a car from highway on-ramp to off-ramp. Senior writer Jack Stewart has the deets.Waymo receives California’s very first permit to test completely driverless cars in the state.Uber is really more than a glorified taxi company now, huh? This week, the company officially integrated its Uber for Business and Uber Eats services, making it that much easier to order pad thai takeout on the company dime.Transit maps that ask you to rethink the way to evaluate competent bus and rail systems. (Hint: It’s not about the ribbon-cuttings.)In WIRED opinion, MIT’s Ashley Nunes asks: If driverless taxis are coming, why hasn’t the Trump administration done much of anything to prepare?OK, so it’s a little late for this one, but put in a calendar reminder now to return to this in 2019: Here are some (pseudo) scientific tricks to optimize your next trick-or-treating haul.Running is a form of transport, too, which is why you nerds should read about WIRED editor in chief Nicholas Thompson’s scientifically-influenced attempt to beat his personal marathon record at the truly ancient age of 43.The team at Polestar (that’s Volvo’s electric performance division) offers a look at the Polestar 1’s first crash test, which posed a real challenge to the car’s new carbon-fiber-reinforced polymer body. And though the results aren’t gorgeous—no crash test is—the Polestar team says the frontal crash into a stationary barrier at 35 mph was mostly absorbed by the body’s structure, and that the car remained rigid. So they’re sticking with the weight-saving, range-extending carbon fiber—woot.The share of parents and teens, respectively, who admitted to Liberty Mutual surveyors that they zone out behind the wheel. Olds, please find something new to shame the kids about.News from elsewhere on the internetNine months after one of its driverless cars killed a woman, Uber reveals new details about its revamped safety program and applies to resume testing in Pittsburgh.If Congress doesn’t pass its self-driving car bill by the end of the year, it will have to start all over again in 2019.Baidu hooks up with Ford to test driverless vehicles in China by the end of the year.Baidu also inks a deal to build self-driving tech with Volvo.Volkswagen, not to be left out, is reportedly in talks with Ford to create a self-driving car venture. Volkswagen could take a 50 percent stake in Ford’s AV unit, or the two could combine their units to create a separate self-driving company.What Segway’s past has to teach about electric scooters’ future.Transportation planner Jarrett Walker explains why he thinks microtransit is a sham, and buses are the best.🎵 Beverly Hills! That’s where scoots wanna be! 🎵 Bird sues the Southern California city over its motorized scooter ban and vows to “aggressively review” restrictive laws in other California cities.On the latest Recode Decode podcast, two Silicon Valley stars deliver the 21st century's version of the Lincoln-Douglass debates.Kara Swisher: I love the scooter, no, get on the scooter.Elon Musk: It lacks dignity.KS: No, it doesn’t lack dignity.EM: Yes, they do.KS: They don’t lack dignity, what are you talking about?EM: Have you tried driving one of those things? They —KS: Yes, I do it all the time, I look fantastic.EM: They do not, you are laboring under an illusion.Speaking of California: Travel with me back to 1999, when Microsoft faced a major antitrust lawsuit in Washington—but managed to corner the software business in Los Angeles County Superior Court.Also known as the spinning thing atop self-driving cars, lidar is the technology that could unlock autonomy for everybody.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}