{"id": "Halloween Annihilates the Weak Sequels That Came Before ItHalloween Annihilates the Weak Sequels That Came Before It", "paragraph": "The scariest scene in John Carpenter's original 1978 Halloween is completely bloodless. It takes place at night, on a patch of lawn in the perfectly leafy suburb of Haddonfield, Illinois. Just a few moments earlier, the masked babysitter-stalker Michael Myers had been stabbed, shot, and sent falling to the ground—and to his ostensible death. Seconds later, though, the yard is once again empty. When no one was looking, the unstoppable Myers somehow got up and disappeared into the dark, presumably to kill again. He could now be anywhere. Cue the audience members' gasps, as well as the movie's familiar plinkety-plinkety-plink theme song.Netflix May Not Win Best Picture, but We’ll Win Better MoviesMovie Commentary Tracks Are Back—and They're a Trivia GoldmineThe Latest Company to Try a Subscription Streamer? CollegeHumorIt was a corker of an exit, one that captured everything that was so great about Carpenter's box-office-murdering classic: Much like its villain, Halloween never stopped moving. The film's success would inspire numerous slasher rip-offs. But none matched the stripped-down brutality of the first Halloween, the tale of a maniac who, years after butchering his own sister, becomes fixated upon teenager Laurie Strode (Jamie Lee Curtis), and spends the holiday murdering her friends. Myers didn't have Freddy Krueger-ish zingers or Jason-like ingenuity; he just hacked and stabbed away in silence. He was as uncomplicated as a killer could get, and all the more terrifying because of it.In the 40 years that followed Halloween, the Myers mythos was spruced up and reworked numerous times, with sequels that range from agreeably gory (Halloween II) to rinkety-rinkety-dink (Halloween: Resurrection). But the latest iteration—also called Halloween—is the first to recapture the unfussy rigor of Carpenter's original. Directed by David Gordon Green (Pineapple Express), who co-wrote with Jeff Fradley and Eastbound and Down's Danny McBride, the new Halloween annihilates the various narrative bad turns of its predecessors. Instead, it reunites Michael Myers and Laurie Strode four decades after their first run-in. Both have spent their lives working toward the same shared goal: Killing the object of their obsession, once and for all.Time hasn't been particularly kind to either of the Halloween-night survivors. Myers has been locked up in a psychiatric hospital, where he's been studied and interviewed by nearly 50 experts—yet never uttered a word. When two pontificating true-crime podcasters show up bearing Myers' washed-out old mask, hoping to cajole some comments on his killing spree, the other patients howl in a crazed fury. Yet Myers himself doesn't even flinch, and remains forever mum. Anyone looking for canon-expanding backstory in Halloween will be disappointed: He's a guy who wants to kill, and those who try to figure out why don't last too long. When it comes to Myers, \"there's nothing to learn,\" Laurie Strode warns at one point. \"There are no new insights or discoveries.\"Halloween may be the umpteenth franchise entry of the year, but it comes with a nudging warning to its own audience: There's a danger to spending too much time in the past.As it turns out, Laurie herself is the real discovery of Halloween. The trauma of the 1978 murders has upended her life: She's now a stressed-out prepper who's barricaded herself in a D.I.Y. fortress, one equipped with a hidden bunker, homemade food preserves, and a backyard shooting gallery populated with blasted mannequins (she owns more guns than an Arizona sheriff). Laurie's grown-up daughter, played by Judy Greer, bemoans her mother's \"paranoia and neurosis,\" which helped spike two marriages, and damaged her relations with her remaining family, including her high-school-aged granddaughter (Andi Matichak). Curtis plays Strode with deceptive steeliness—she's spent years planning and hoping for Myers' inevitable return, so that she can finally kill him. Yet when she finds herself outside Myers' mental hospital, fingering a gun and taking jittery swigs from an airplane-sized liquor bottle, you get the sense that some of Laurie's self-empowerment is a nervous facade, and that her trauma overpowers her more than she wants to admit. While the rest of Haddonfield has moved on, Laurie is reliving 1978 every day and night—and while she's no victim, it's quietly destroying her. Halloween may be the umpteenth franchise entry of the year, but it comes with a nudging warning to its own audience: There's a danger to spending too much time in the past.Mostly, though, the new Halloween exists to serve up new victims for Myers, who slips back into town after being transferred between facilities. The kills come quickly and mercilessly, and they're far gorier than expected (I oof'ed four times, and eep'd at one vicious head-stomp). Myers' victims are a mix of ding-a-ling teenagers and oblivious law-enforcement-types—the type of easy targets that slasher films have been carving up for years. Yet in Halloween, they're all surprisingly memorable. Green and his cowriters worked on the script throughout production, and there's a loosey-gooseyness to the dialogue that brings alive the most perfunctory characters, even if just for a few quick minutes: Two bored cops discuss Vietnamese sandwich-making, while a wise-ass kid teases his babysitter with the same real-talk bluster of Kenny Powers.That same run-and-gun filmmaking approach, however, also makes for some dubious third-act maneuvers, including a late-in-the-game reveal that feels undercooked, and the disappearance of a few supporting players altogether. And when a movie's this smart, the usual horror-movie non-logic feels all the more stupider: Why would anyone transport a bus load of criminals in pitch-black darkness? And wouldn't it have been easier for Laurie to simply change her name, move far away from Haddonfield, and, I dunno, settle down with a nice middle-aged lawyer or something?But Halloween moves so relentlessly, and so remorselessly, that you forgive its less-successful tricks. Instead, what stays with you are the moments of playful terror. One of the film's creepiest kills takes place on that familiar Halloween haunting ground: A spare suburban lawn, covered in darkness. Once again, Myers appears and disappears. Yet this time, he comes back, his presence marked by a series of switched-on motion-detector lights, as he slowly closes in on his victim—and on you.This year, the Halloween industry is expected to bring in an all-time high of $8.4 billion in revenue. Let's take a look at some of the numbers and see why Halloween is good for the economy!CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}