{"id": "The Risk That Ebola Will Spread to Uganda Is Now ‘Very High’The Risk That Ebola Will Spread to Uganda Is Now ‘Very High’", "paragraph": "Ebola is one of those scourges where the mere mention of its name strikes fear: the virus, which kills about half of those it infects and gets passed on through body fluids, is notoriously hard to contain.That means that the best, perhaps only, way to contain an outbreak like the one currently ravaging the Democratic Republic of Congo is by obsessively tracking infected individuals—monitoring their social circles and their movements, and limiting their exposure to other people for weeks at a time. But containment is proving so difficult in DRC that last week, Robert Redfield, director of the Centers for Disease Control and Prevention, suggested an alarming possibility. The current Ebola epidemic could be beyond control, he said, and may—for the first time since the deadly virus was first identified in 1976—become persistently entrenched in the population.The 329 confirmed and probable cases of Ebola infection reported so far have made it the largest outbreak in the nation’s history, with no signs yet of slowing down. Militia groups clashing in DRC’s North Kivu Province, the epicenter of the outbreak, have scrambled health workers’ attempts to trace the movements of people exposed to the virus. A massive effort to vaccinate more than 25,000 of the highest-risk people has slowed transmission rates but not yet stemmed the tide. Between October 31 and November 6, 29 new cases were reported in DRC, including three health workers.Now neighboring Uganda is bracing for the virus to cross the 545-mile boundary it shares with DRC. The border is porous and heavily trafficked, with large numbers of local farmers, merchants, traders, and refugees constantly moving through the area. A checkpoint in the region receives 5,000 people on an average day, with the busiest ones swelling to 20,000 twice a week on market days.On Wednesday, the country began immunizing frontline health workers with an experimental vaccine that produced good results in a previous outbreak. The Ugandan Health Ministry said it has 2,100 doses of the vaccine available for doctors and nurses working in five border districts. At hospitals in these districts, four special Ebola treatment units have also been constructed, with staff on standby to manage any suspected cases. “The risk of cross-border transmission was assessed to be very high at a national level,” said Ugandan Health Minister Jane Ruth Aceng at a press conference last week. “Hence the need to protect our health workers.”Since the start of the outbreak in the DRC, anyone crossing into Uganda has been subjected to health screenings at official checkpoints—a series of questions and no-contact infrared thermometers aimed at the side of the head that read out body temperatures like a highway patrolman’s radar gun. Fever is one of the first red flags for an Ebola infection. The process isn’t foolproof; symptoms can take up to three weeks to appear, and lots of other tropical diseases in that part of Africa can also cause soaring temperatures.The abundance of caution arises from the unstable situation in the DRC. Ebola has never before broken out in a war zone, so in many ways the current situation is unique and unprecedented. But as larger changes have swept across the African continent—ballooning populations, billions of dollars of Chinese infrastructure investments, the increase of urban-wildland interfaces—some infectious disease doctors see a lasting change to the shape of Ebola outbreaks. \"It's a cruel irony that better roads and improved connectivity of people also make it easier for the disease to travel, particularly when the public health systems are still lagging behind, “ says Nahid Bhadelia, medical director of Boston Medical Center's Special Pathogens Unit, who worked on the front lines of the 2014 outbreak in Sierra Leone.For decades, the natural disaster that Ebola outbreaks most resembled was an earthquake. One would hit in an isolated, rural area, and health workers could quickly converge to treat infected people and seal off the disease. But when the disease strikes in more populated areas or in a conflict zone, it’s a lot easier to lose track of people. Knowing how big the outbreak is becomes impossible. If the disease jumps into Uganda, says Bhadelia, it won’t just be a new epicenter, it will be another example of Ebola’s changing profile.With Uganda already devoting significant resources to that possibility, international public health experts are more concerned with Ebola extending further into areas controlled by clashing rebel groups. “We can’t afford for it to go deep in the red security zones where we have no access,” says Mike Ryan, Assistant Director-General of Emergency Preparedness and Response at the World Health Organization. “Ebola exploits the cracks, so the more we can keep it out in the open, the better.”Reached on Sunday at his home in Ireland, where he had just returned from a month coordinating the WHO’s health response in North Kivu, Ryan expressed cautious optimism that the outbreak is beginning to turn a corner. Teams on the ground have finally gotten a handle on what’s been driving the second pressure wave of the epidemic, which ticked up in the city of Beni starting in mid-September. “It’s almost completely transmission within healthcare facilities,” says Ryan.In every outbreak, some people catch the virus at a hospital or clinic. But only in the last few weeks have health workers realized the extent to which Ebola was spreading through Beni’s network of more than 300 healthcare facilities, many of which keep poor patient records. Even as workers vaccinated victims’ close friends and family, new cases would show up seemingly out of thin air. Last week the Washington Post reported that between 60 and 80 percent of new confirmed cases had no known epidemiological link to prior cases. Ryan says a huge push in the last few weeks to completely retrain case investigators has made a big impact to change that. “We’ve now linked 93 percent of new cases to known transmission chains,” he says. Surveillance teams have also begun using tablets to register contacts and vaccinations. By layering that information over the geographic locations of new cases coming in, they’re beginning to build models to understand where the virus is likely to spread next.“Fears of this thing becoming endemic are real, and rational, but we also need to see that as a worst-case scenario,” says Ryan. “We still have plenty of opportunities to put this virus back in the box, we just need to get behind the people risking their lives on the front line and push hard for the next three to six weeks. It’s going to be a long march, but I don’t think we should be raising the white flag just yet.”11/12/18 2:00pm EST Editor's note: this story has been updated to remove language that suggested Ebola patients can spread the disease before symptoms appear. That was incorrect and WIRED regrets the error.The CDC's elite Disease Detectives investigate outbreaks of dangerous diseases like Ebola, Marburg Virus, Rabies, Anthrax and more. Find out about the equipment they use -- from protective gear to bat traps, machetes to blow guns, liquid nitrogen and more.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}