{"id": "Kilogram Redefined. The Metric System Overhaul Is CompleteKilogram Redefined. The Metric System Overhaul Is Complete", "paragraph": "On the morning of Friday, November 16, scientists and diplomats crammed into an auditorium in Versailles, a stone’s throw from the Sun King’s gilded chateau. Patrick Abbott, an American physicist, had flown into France for the long weekend. Forehead gleaming and blue suit jacket draped across his lap, Abbott watched from a packed balcony as a group of diplomats from 60 different countries voted unanimously on a treaty that intended to change global trade and technology forever.The vote re-defined the metric system for the first time since 1983. The new system completely upends the historical methods for setting standards using physical objects. Previous systems have used things like the notches on a metal rod to set a distance standard. Up until the vote, the kilogram had been based on a platinum-iridium cylinder stored under lock and key in France.Scientists have now scrapped all physical objects from the system. The units are instead based on fundamental constants of nature. For example, the meter has been defined in terms of the speed of light. This means that as long as you can measure the speed of light, you can create a meter stick; you don’t need access to a special object. Using this principle, astronauts on Mars could theoretically make a precise tape measure from scratch.These standards offer more stability because fundamental constants don’t change over time. In the 1960s, for example, a more precise standard for time made possible GPS technology, which needed to keep time to one-billionth of a second per day. With more precise standards for the kilogram, mole, Kelvin, and Ampere, scientists anticipate more technology breakthroughs. “This [is] the biggest revolution in measurement since the French revolution,” said Bill Phillips, a physics Nobel Laureate, from the stage below.Perhaps the biggest change was in the definition of the kilogram, which was the last remaining unit to be based on a physical artifact: the International Prototype Kilogram, also known as Le Grand K, locked in a vault in a Paris suburb. While scientists will still monitor and study Le Grand K, it no longer has its former scientific significance. Now, it’s just a cylinder with a lot of history. Starting in May, the kilogram will be defined in terms of Planck’s constant, a number that relates a radio wave’s energy to its frequency.The system was due for an upgrade, says Abbott. The French cylinder tends to gain weight over time. But still, he’s got a soft spot for it. “There are a lot of people who refer to the International Prototype Kilogram irreverently as a hunk of metal. They’ll say how outrageous it is for us to still use it in the 21st century,” says Abbott. “But the fact remains that it’s done a wonderful job for over a century. Yes, it has changed from its original value. But has it been a problem? No. I get kind of defensive about it.”And so he should. He’s allowed a little sentimentality: Abbott, who works at the National Institute of Standards and Technology, is one of three designated keepers of the US kilogram standard. The lab maintains the standard using a collection of platinum-iridium cylinders stored in an underground lab in Maryland, all replicas of the IPK. All scales manufactured in the US have to be calibrated using some method that traces back to these weights. Your bathroom scale was calibrated by a weight whose mass was confirmed via another weight, and so on, where the last weight in the calibration chain is perching in a bell jar in Abbott’s lab.A month ago at his lab in Maryland, Abbott showed me the weights. He handled the weights sweetly, almost like an owner tending to his pets. The first time he ever picked up one of the kilogram replicas, to place it inside a machine, was 12 years ago. The proper protocol involves grabbing them with a pair of tongs covered in soft chamois leather and coated in lint paper. “I was so scared,” he says. “It was like if someone had said, ‘Why don’t you take my Ferrari for a ride?’” The IPK’s home lab in France sells kilogram cylinders at around $85,000 apiece, depending on the price of platinum. Platinum iridium is an extremely hard material and difficult to scratch, but “it makes you paranoid,” he says.Abbott also has to monitor the weights, to check that their masses stay the same over time. In the lab, he has developed a nearly obsessive attention to cleanliness and frequently reminds his colleagues to change their gloves. “If your gloves are dirty, and you pick up a tool, whatever’s on the gloves are going to go on the tool. And that means it could get on the mass and change its weight,” he says. “You have to remember where your hands have been, and what they’ve touched.” His vigilance has kept the cylinders largely safe from mishaps. “One time I dropped one of the masses rather hard [inside a machine], and it fell over,” says Abbott. “I was worried about that, but it didn’t hurt anything.”He knows the weights well enough to have favorites: K4 and K79, whose numbers signify the order in which they were manufactured. “They’re just so stable over the years, so I really like them,” he says. “When you measure their mass, they really don’t change.”K4, along with another cylinder named K20, are the most historic items in the collection: both are 130-year-old platinum iridium cylinders that are replicas of Le Grand K. “They’re brothers, cut from the same bar of platinum iridium,” says Abbott. Periodically, he or one of his colleagues have to hand-carry them to France, to check if their masses have fluctuated against the one true kilogram. There, they reunite the cylinders, one per trip, with its brother at its home French lab, which compares their weights.Abbott has made the trip once, in 2011. “It’s a real cloak-and-dagger affair,” he says. He treated the kilogram like a precious carry-on. Using the tongs, he placed it in a custom-built container, a tiny covered platform with ungreased screws that squeak when you fiddle with them. Then he wrapped it in bubble paper and stuck it inside a camera bag. To keep customs and TSA officials’  grubby hands from opening the container, the director of NIST wrote him an official letter describing the mission to accompany the kilogram.On the plane, Abbott kept the kilogram next to him on the seat for the whole ride. He even took it to the bathroom with him. “I didn’t want to be the one known for losing the kilogram,” says Abbott.In the end, it was a meeting in Versailles that concluded the cylinders’ travels.Abbott’s day-to-day work won’t change too much once the kilogram gets its new definition in May. He’ll continue to monitor his weights—they’re still a practical way of calibrating other weights. The key difference is that they no longer have to trek back to France. The cylinder won’t need to go on any bathroom trips. Instead, Abbott and his colleagues will check the mass of the cylinders using a new machine called the Kibble balance.When you place a weight on the Kibble balance, the machine produces an electric current proportional to Planck’s constant. With Planck’s constant set, the kilogram will correspond to a specific amount of current in the Kibble balance. The promise in this design is that even if the balance breaks, they can just fix it—something that you can’t do if you dent a platinum-iridium cylinder.The keepers of the Kibble balance are now the new caretakers of the mass standard. And they are just as obsessive as Abbott. They’ve hooked up various parts of the machine to the Internet. When the machine is collecting data, Darine El Haddad, a physicist at NIST, regularly logs in from home to see how it’s doing.Many of Haddad’s Kibble balance colleagues have even gotten tattoos of Planck’s constant on their forearms. Haddad, on the other hand, showed up to Versailles with merely a week-old henna graphic on her forearm, soon to fade. “I’m very committed to Planck’s constant,” assures Haddad. “I just haven’t committed to a tattoo yet.”The standing vertical jump is an important measure of an athlete's explosive power and a critical test in the NFL Combine. So who jumps the highest? And what's the limit? WIRED's Robbie Gonzalez jumps in to examine the physics and physicality of maximum leaping ability.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}