{"id": "The Pink Transit Tax: Women Spend More Than Men to Get Around NYCThe Pink Transit Tax: Women Spend More Than Men to Get Around NYC", "paragraph": "Women in New York City spend an average $26 to $50 extra on transportation per month for safety reasons, and up to $100 each month if they are their family’s main caregiver—as much as $1,200 more than men each year. Those are the numbers from a report released by researchers at New York University’s Rudin Center for Transportation on the “pink tax”, or gender-based price discrimination etched into the city’s transportation system.“This project stemmed from looking at the #MeToo movement,” says Sarah Kaufman, associate professor with the Rudin Center who studies transportation technology and worked on the report. “It got me thinking about the day-to-day issues that women face in major cities.”The survey suggests that those experiences on public transit led to many women to make a different set of transportation choices from those made by men. Seventy-five percent of female respondents said they had experienced harassment or theft on public transportation, compared with 47 percent of men. And they responded differently: 29 percent of women said they don’t take public transportation late at night because of it, compared with 8 percent of male respondents. And they spent differently: 42 percent of women said they felt safest taking for-hire vehicles like an Uber or Lyft (which is almost always more expensive than a transit ticket) late at night. Just 15 percent said they felt best on public transit.The cost burden falls even more heavily on people who take care of children—and research suggests that about three-quarters of the people doing that today are mothers. “It is REALLY hard to get around the city with children, even as an able-bodied person, particularly with multiple children,” one survey respondent wrote. (Try carrying a kid-filled stroller down the stairs at one of New York’s 355 elevator-free subway stations, and you’ll understand why many parents try to avoid mass transit.) The majority of survey respondents who said they took frequent caregiver trips spent more than $76 extra on transportation each month.The report is based on responses from a web-based survey, with 33 questions about day-to-day transit challenges. Just under 550 people responded to the questions, over half of them women. Some caveats: Because the researchers collected their survey responses on the web, they didn’t hit some key New York demographics. A disproportionate number of their respondents had bachelor’s degrees or higher (93.4 percent compared with 34.5 percent citywide), and a disproportionate number lived on the Upper West Side, which is whiter and richer than the rest of the city. (A helpful neighborhood city council member put a link to the survey in her newsletter, which might explain the overrepresentation.) That indicates that the respondents had easier access to more expensive travel options, like Uber rides or taxi trips, than others in the city—meaning lower income women may simply not be able to afford to feel safe when they travel.Kaufman says that there’s no reason to believe these same effects aren’t happening in other places, too—but that New York’s may be amplified, because so many residents depend on public transit.The most worrying question is this: What opportunities are women missing because they can’t get around the city safely or cheaply? “We cannot say that labor force participation is completely entangled with sexual harassment on public spaces and transport, but the data and figures suggest we need to learn more about the correlation,” Karla Gonzalez Carvajal, who heads up the World Bank’s gender in transport projects, said during an October event hosted by the Rudin Center, according to a transcript provided by the center.Kaufman and her colleagues point to a few possible solutions. The first is to make public transit feel safer by posting staff in highly visible places and training them to deal with harassment situations, so women feel protected while they’re waiting for transit. Another is to get more women at the highest echelons of transit, so the people running the system look more like the people riding it. Research and advocacy group TransitCenter reports that women are just 39 percent of the transit workforce, and only three of the 20 biggest American transit agencies have women at the helm.“If you have more lenses through which your leadership team is looking at the service they experience, you will, just by nature, have a better level of customer service for your diverse base that comes from many different perspectives and uses the system in different ways,” Sally Librera, the senior vice president of subways at New York’s Metropolitan Transportation Authority, said at the same October event. (Librera, appointed in May, is the first woman to hold that position.)The Rudin team still has lots of research questions they’d like answered: How do public transportation challenges differ for New York women of color, or women in underserved neighborhoods? How about women in other cities? Are there technological solutions to these problems—apps that might monitor their surroundings and make women more comfortable in public? Every New Yorker knows to mind the gap. But it’d be nice if someone got around to closing this one.Subway commuters traveling between San Francisco and Oakland got tired of looking each other in eye. So, the Bay Area Rapid Transit agency redesigned their train cars to give commuters more space.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}