{"id": "Can Outdoor Gear Experts Make a Better Kid's Car Seat?Can Outdoor Gear Experts Make a Better Kid's Car Seat?", "paragraph": "Most parents would sooner let their kid lick a lead battery than let them ride in a car without a car seat. According to a 1996 study conducted by the National Highway Traffic Safety Administration, car seats reduce the risk of fatal injury by 71 percent for infants, and by 54 percent for children one to four years old.But protecting your kids in the car can be a muscle-busting task. Children's car seats are gigantic foam-and-plastic devices, loaded with webbing threaded through arcane pathways, and plastered with dire warnings. They’re intimidating to install, clean, or carry. Case in point: Many first-time parents hire a professional to install their car seats for the first time.\"A lot of parents are intimidated because there’s a lot of pieces to [a carseat],\" says Lorrie Walker, the technical advisor to Safe Kids Worldwide, which works to reduce preventable childhood injuries and administers the National Child Passenger Safety Certification program. \"It’s scary! It’s not something you can take out of the box and plug in, like a toaster.\"A few years ago, Tio Jung saw desperate parents hauling these enormous, complicated contraptions while traveling. The Jung family owns Dong-In Entech, a South Korean manufacturer that specializes in aluminum-framed backpacks and other high-end outdoor gear. That gave him an idea. In 2014, he called long-time family friend Michael Crooke—the former CEO of Patagonia, who currently teaches sustainable business MBA classes at the University of Oregon—with a proposition. Could expertise in the outdoor industry make baby gear better?Four years later, Jung, his father, and Crooke are working to make better family travel gear with their new company, Wayb (rhymes with \"baby\"). Their first product: the reinvented car seat.Designing gear for the great outdoors comes with high demands. Outdoor gear manufacturers have to develop and test equipment like tents and safety harnesses that look great, weigh as little as possible, withstand unpredictable weather, and can save your life if you fall off a cliff or get trapped in a snowstorm.But taking care of a baby and a toddler? That can be just as unpredictable and scary. To create their car seat, called the Pico, Crooke and Jung assembled a team of outdoor-savvy gear experts. That included Wayb lead designer Kurtis Sakai, who worked with brands like Adidas, Salomon, and Decker Sports, and director of product Jeffrey Lockie, who was the quarterback for the University of Oregon Ducks and whom Crooke recruited after he received his MBA.'We went so far out of the box with the Pico.'Kurtis Sakai, lead designer at WaybTheir first, and biggest, innovation was to use an aluminum frame. Most car seats are made from plastic and foam, which keeps costs low. But those enormous (and non-biodegradable) car seats are usually thrown into landfills once they expire. Depending on the manufacturer, that's usually between six to ten years. Temperature changes, humidity, and time can all degrade the plastic and render the seat unsafe, making it harder to pass carseats down.Crooke wanted sustainability be a central component of the Wayb philosophy, and an aluminum frame fit those values. Aluminum is abundant and recyclable, and the alloys that the Wayb team uses have a high enough strength-to-weight ratio that they are commonly used in aerospace engineering. “[Aluminum] is an underrated wonder material,” Sakai says. “It’s so ubiquitous that people take it for granted that it can hold 12 ounces of fluid under pressure, indefinitely.”The second innovation: replace the polyurethane foam padding found in most car seats. Foam makes for an inexpensive padding, but it isn't biodegradable. Polyurethane foam also off-gasses volatile organic compounds, high levels of which have been linked to an increased risk of allergies, asthma, and lung infections in young kids.“You see this a lot in footwear,” Sakai says. “The foam makes it look good on the shelf, but it quickly breaks down, yellows when exposed to UV, and ultimately ends up in the trash… It boils down to the least expensive construction that looks good, but from a comfort or durability standpoint, it falls short.”Instead of foam, the Wayb team decided to use a tensioned, technical mesh. Just as with tents and high-performance framed backpacks, the car seat supports the child in lightweight, breathable comfort.Switching out these two materials drastically reduced the Pico in weight and size. It’s a mere 8 pounds, much smaller than other popular car seats. The popular Britax Marathon that I use for my two children weighs 28.5 pounds.“It’s second nature in outdoor gear to have something that’s lighter and more portable, but with sustained performance standards,” says Amanda Reid, Wayb's chief marketing officer. “That thinking just hadn’t been applied to car seats.”The Pico is forward-facing with a five-point harness, intended for children two to five years old and weigh between 22 and 50 pounds. It meets official U.S. safety standards for both cars and airplanes, folds down, and can be stowed in a backpack-sized travel carrier.And despite the upgraded materials, the cost is comparable to that of other standard car seats. It can currently be pre-ordered on Indiegogo for $245, and Sakai estimates that the final cost will be between $300 to $350. In comparison, a Britax Marathon retails new for $200, while a high-end carseat, like the Clek Foonf, costs $450.In advance of the Pico’s launch in January 2019, the product has undergone extensive safety and product testing. Each iteration of the Pico has been sled tested at MGA Research Labs in Virginia; undergone toxicity testing on flame retardants at the University of Oregon’s Green Chemistry Lab, FITI Labs, and at the Ecology Center in Ann Arbor; and tested for physical durability at SGS Labs. Of course, the most important durability tests took place at the Jung’s own facility.The Pico car seat took 18 months to create, from the first prototype to finished product. The process was expedited by the fact that Jung and his father, I.S. Jung, manufacture everything in their facility—from extruding (or shaping) the aluminum, to welding and anodizing the frame, to weaving and screen-printing the webbing, sewing the fabric, and assembling the finished product.Most manufacturers work with an agent and third-party product team, which communicates with the manufacturing facility on behalf of the company and vice versa. Instead, Wayb engineers travel directly to the facility and work directly with Jung’s engineers. This close relationship between Wayb’s designers and manufacturers has made the process of designing the Pico remarkably fast and simple. “Ultimately, the goal is to control the quality. It’s not a cost-saving measure,” says Lockie. “[But] we can make a prototype in a couple of hours.”The process was also highly expedited by the fact that the Jungs have worked with these same materials for decades. “This is the same facility that’s making tents, so using aluminum poles and technical fabric to make something that’s incredibly light and still performs beautifully,” says Reid. “It’s the same facility making high-end backpacks and rock climbing harnesses! And every step of the process gets strength-tested.”While the team’s efforts have been focused on pushing out the Pico by early 2019, Wayb also hopes to reinvent other types of family travel gear, such as a stroller. But so far, those are still very early on in the development process.“We went so far out of the box with the Pico,” says Sakai. “If we’re going to approach other products, we do have to be solving a problem… We’re going to truly look at where the pain points of parents exist, and how we can [find] better solutions. We’ve had to go back to the drawing board on a few projects that we’ve already started! But that’s a good thing.”Hover your way across the room with this homemade GeekDad hovercraft.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}