{"id": "Chevy's Making an Electric Camaro to Dominate the Drag StripChevy's Making an Electric Camaro to Dominate the Drag Strip", "paragraph": "Punch \"Tesla drag race vs\" into YouTube, and you're offered a panoply of ways to complete your search. You can watch one of Elon Musk's electric cars face off with Lamborghinis, Ferraris, Dodge Hellcats, McLarens, Corvettes, and just about any supercar or muscle machine you can think of. These videos are much the same: Again and again, the instant torque of the EV's motors smokes the gas belcher off the line, leaving nothing but the squeal of tires ringing in the reddening ears of whoever's watching its taillights pull away.Today, Chevrolet unveiled its bid to keep up with the Muskses: It has electrified the Camaro. At the SEMA automotive parts and aftermarket mods show now underway in Las Vegas, the company revealed a battery-powered version of the iconic muscle car so closely associated with American muscle, V8 engines, booming exhausts, and—above all—tradition. It's called the eCOPO Camaro, an apt spin on this new offering from the company's COPO high-performance racing division.Buy into the heresy, though, and you get more than 700 horsepower and 600 pound-feet of torque from the two 300-pound-feet-torque motor assemblies, bolted together and mated to a conventional racing transmission sturdy enough to relay all that torque to the solid rear axle. Chevy says that should be good for quarter-mile times in at least the 9-second range, but its engineers are still running final tests. For reference, the 2017 COPO Camaro, shown a year ago in the same liquidy metallic blue paint, makes 470 horsepower from a 7-liter engine, and can put up a 9.2-second quarter-mile time. Still, showing an electric car with that badge, even as a concept, is likely to get mixed reactions from hardcore fans.“That’s me,\" says Russ O’Blenes, director of performance variants, parts, and motorsports at GM and proud owner of a barn full of big-block Chevys. \"For 25 years I did race motors for GM, and that’s all I ever did.\" But he has accepted his charge.“There’s sounds, there’s smells, there’s that stuff that we’re used to,” he says. Stuff that's going away, but in exchange for cleaner, more reliable racers. Electric motors aren't just quicker, O'Blenes says, they'll go much longer between rebuilds than internal combustion engines usually do. “I think there’ll be some polarization to start, but the reality is it’s really an incredible thing.” He sees this vehicle as a continuation of the aims of the COPO program, which goes back to 1969: to push performance limits.“I think there’ll be some polarization to start, but the reality is it’s really an incredible thing,\" says the man who electrified the Camaro.For all their prowess at the drag strip, electric cars can struggle to keep up their performance in those quick turnaround elimination rounds, where you have to put down max power sprints one after another. To fix that, Chevy's concept uses a new 800-volt battery that lets engineers pump electrons back in faster. Most electric cars on the road now have packs in the 400-volt range. Porsche's upcoming Mission E will be the first production car to use the higher voltage. “Voltage is a great enabler,” O’Blenes says. Chevy hasn't revealed the exact size of the Camaro's battery pack or what its range might be, but nobody cares about the gas mileage of a 7-liter V8, so don't worry about it.O’Blenes and his team plan to do a lot more testing of this concept to make sure it’s race-hardened, and they'll gauge the reaction of the racing community before settling on how many to build. (They did the same for the last COPO vehicle, surveying potential customers. They have sold over 500 to date.) They haven't announced pricing yet, but the gas-powered COPO Camaro runs around $100,000.This project isn't just for volts and giggles. The eCOPO's battery is made up from four 200-volt modules, two under the rear seats and two in the trunk. For racing, engineers have surrounded them with crash structures and roll cages and added a battery-management system to continually monitor their condition. And what they learn could make better batteries for road cars one day too.And down the line, the electric Camaro's drivetrain could become what O'Blenes calls “one of our biggest tools in the performance parts area”—a crate motor. These are the plug-n-play engine and drivetrain setups that enthusiasts can buy and install in any vehicle. Going electric could be the next-generation conversion, and O'Blenes imagines not just racers, but hot rods, pickups, and vintage cars, which may not come with the parp of the exhaust, but have no trouble showing everyone what they can do.The $35,000 TESLA Model 3 is finally here. It is sleek, quick, more affordable and it's the most important car that Tesla has built.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}