{"id": "Skip Scooters Get a Latch So They Don’t Junk up the SidewalksSkip Scooters Get a Latch So They Don’t Junk up the Sidewalks", "paragraph": "A scooter nightmare for cities might look something like this: Thousands of unused, rickety twists of metal and tire, sprawled across sidewalks. No walking, no wheeling: Just private companies’ private property, littered across public space.Of course, no American city really looks like that, even though the scooter-share craze has reached well over two dozen major urban places. And many do want scooter-share to work: Scooters might be a tool in the fight against car traffic, emissions, and sedentary lifestyles. But how to get the mobility without the mess?Well, today, San Francisco-based Skip Scooters rolls out a new feature. The addition, to be honest, doesn’t look like much: a retractable, 28.7-inch, high-strength steel wire, covered in a protective vinyl wrapping. At the end is a latch. Pull the steel wire out of the new, bright blue casing that surrounds the scooter’s stem, loop it around a bike rack, and click it back into the side of the scooter.Et voila: A purpose-built tool to keep scooters from tipping over on the street and blocking walkers, wheelchair users, and stroller-pushers. It’s a shiny, steel wire olive branch to the cities that ultimately control the shared scooter industry’s fate.Skip's new 28.7-inch retractable steel wire acts as a scooter lock. The startup hopes it will help its scooters stay upright.It makes sense that Skip, of all the startups that have spilled onto city sidewalks this past year, would be the first to build in a bike lock–like mechanism that allows riders to secure its shared scooters to a bike rack. The startup has built its brand on two tenets: First, that unlike those who launch first and ask permission from City Hall later, it will work hand in handlebar with local government officials and community groups. And second, that Skip’s custom-designed scooters will be better than everyone else’s. The company says its scooters were designed for sharing from the get-go, with dual suspension, adjustable handlebars, and headlights, taillights, and brake lights. Skip gets its gearhead-y bent from cofounders Sanjay Dastoor and Matt Tran, who also founded Boosted Boards, the electric skateboard company.Those two things—the form of the scooter and the way the company works with governments—are tightly related, says Dastoor, who is also Skip's CEO. “With scooters and bikes with locking mechanisms, you see a different response from how scooters have been received in the past,” he says. “A big part of that is the way you talk to the community, but another part is building technologies like locks that are actually mitigating those problems, and not just assuming they'll go away.” As with models, sumo wrestlers, and airplanes, shape is destiny.The scooters with the tethering feature are slated to be tested during a year-long pilot project in San Francisco. Skip also operates in Portland, Oregon, and Washington, DC, and is testing in Long Beach, San Jose, and Oakland, California.San Francisco’s Municipal Transportation Agency, which launched an intensive scooter permitting process after ordering all other scooter-share companies off the road in June, emphasized that it had chosen Skip and competitor Scoot out of a field of 12 in part because both startups had promised to run services with tethering mechanisms. (Scoot senior marketing and events manager Jasmine Wallsmith says that company should have a lock-to mechanism available on its scooters by the end of the year.)“Thoughtfully designed shared mobility devices help both riders and non-riders, whereas devices strewn carelessly across sidewalks are helpful to no one at all,” says SFMTA spokesperson Ben Jose.Austin also required scooters to come with lock-to mechanisms for its scooter pilot project, but backed off the requirement by late summer, partly because, well, no one had built them yet. Chicago and Washington, DC, currently require dockless bicycle companies to provide locking devices, and users to secure their rides to bike racks or streets signs when they end their trips.Skip is betting that officials in other cities will be attracted to its new feature, especially as more roll out official scooter pilot programs with stricter rules.Not all scooter and bike startups are sold on the lock-to stuff, though. They argue that there aren’t enough racks to support the explosion of scooter- and bike-share companies, and that riders might lock the scoots to something they shouldn’t—a staircase rail, an emergency sign, scaffolding—and block street access. “The benefit of not lock-to is that it makes scooters truly flexible,” says Lime CEO Toby Sun. (He says Lime does “have the capability” of offering scooters with lock-to devices for very small fleets.) Like vehicles from competitors Skip, and Lyft, Lime’s come with built-in sensors that can alert the company when one of its bikes or scoots has tipped over. (Bird has also said its implementing this tech.) The companies can then dispatch workers to right them.But Jose, from the SFMTA, says the city hasn’t had trouble with vehicles locked in the wrong places so far, even after 10 months of a dockless shared bicycle pilot with the Uber-owned e-bike service Jump.For now, Skip plans to keep testing and refining its locks. And burnishing its image as the nice guy of the scooter industry. It wants to launch a community advisory board, which will advise the startup on service issues. And it has placed the number for its hotline, staffed 24/7, on each of its vehicles, so even non-users can call to complain.“We actually want to hear from people who say this isn't working, so that we can address that with better training or better technology,” says Dastoor. Because wouldn’t it be nice if everybody could be friends?In honor of WIRED's 25th Anniversary, we're bringing back an old favorite series -- The Most Dangerous Object in the Office. And in this special one-off, WIRED's Arielle Pardes tries on Segway's Drift W1 e-Skates.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}