{"id": "Apple Is Ditching the Mass Market and Focusing on Rich PeopleApple Is Ditching the Mass Market and Focusing on Rich People", "paragraph": "Big companies attract big attention, and none quite as much as Apple. Its quarterly reports have become something of a collective soothsaying moment for stock markets and the tech industry, and so Thursday’s report garnered its usual share of outsized attention.Zachary Karabell is a WIRED contributor and president of River Twice Research.As its market cap hovers near $1 trillion, Apple has gradually been shifting its strategy away from grabbing ever-more market share and focusing instead on dominating the higher end of its markets. If there were even a small doubt about that, the recent results made it screamingly clear.For sure, Apple continues to sell an astonishing number of iPhones along with its tablets and computers. It moved 46 million iPhones this last quarter, but that was basically unchanged from the same period last year, and fewer than expected. What was startling was the average selling price—nearly $800 per device rather than the $750 that many had anticipated. If its average selling price continues on that trajectory, Apple could realize close to $1,000 per iPhone in the current quarter. It doesn’t take a CPA to recognize how significant that is for the company’s bottom line.What really caught investor and analyst attention—and not in a good way—was the company’s announcement that it would no longer tell investors how many devices it sold in a quarter, and instead simply present overall revenue for its suite of devices. That did not sit well, and some analysts speculated that Apple was reducing its transparency because it “has something to hide.”Maybe. Apple has never cultivated a culture rife with transparency. While the hard edge of secrecy has ameliorated somewhat under Tim Cook as CEO, compared with the hyper-secretive Steve Jobs, Apple rarely embraces the notion that it owes anyone an explanation of anything.Its decision to stop breaking out numbers of handsets sold, however, is jarring to investors who have, over the past decade, come to evaluate the company based on how many phones its sells along with how much its sells them for. Apple, however, apparently does not judge itself that way, at least not to the degree that Wall Street analysts have.Instead, judging from its new devices, Apple is focusing on price and profits rather than sheer volume. That makes sense in a world where the basic functionality of the hardware Apple offers can be found in numerous other devices made for and sold for much less, whether by China’s Xiaomi and Huawei or Korea’s LG and Samsung, or many others. Apple is losing market share in China and other parts of the developing world, which are still in earlier stages of mass smartphone adoption. The one exception may be tablets, where Apple’s iPad retains a unique combination of form and functionality. Whether or not the world is ready to use tablets as a replacement for laptops and computers, however, remains an open question.And so Apple is gravitating to its strength—selling a commoditized product at a very high price as a part of a semi-open (or partly closed) ecosystem of services. Indeed, another change in how the company plans to present its financial picture is a more detailed breakdown of its “services” segment, which includes iTunes, the App Store, and ApplePay, all of which presumably will be a greater share of its revenue and profit.Look, then, at where Apple is growing and where it isn’t: It is gaining share in the wealthy countries of the European Union and in the United States, and flat (or losing) in places such as China, Nigeria, India, and the rest of the world formerly known as developing. But its profit is growing massively, and from what we can tell growing everywhere. In a world where everyone will soon have a smartphone as surely as electricity, and the middle class will likely have a tablet or some form of computer, Apple has elected to be more like Tiffany or Mercedes rather than Walmart or Hyundai. That means speaking to as an aspirational clientele for whom brand, form, and function are all of a part, and where the higher price point is at times a sotto voce aspect of the appeal.It is hard to argue with that strategy, although it does make Apple a different sort of company than it was a decade ago, away from owning the market with a range of prices and products and toward a premier provider in a mass world. It is also hard to see that strategy not producing incredible profits and cash for the coming years, absent some tectonic disruption in communications akin to the introduction of the iPhone in 2007, which is not evident but not impossible. In some sense, it is back to the future for Apple, which began in the 1980s selling a high-priced, elegantly designed Mac that eschewed the mass market.Unlike then, however, it is hard to picture Apple as a leading innovator of the next thing or things, whatever those may be. Rife with cash and focused on honing and defending a premier brand, it is more like a dynamic retailer than a tech disrupter. Those lines may, of course, blur, and those categories may not matter much in the end. But Apple today is one more sign of the dramatic transformation of the US tech industry from a gaggle of innovators and disrupters into a smaller clique of industry titans with different mantras and different agendas. Goodbye to changing the world; hello to profiting from it.The launch of Apple’s iPhone X brought face recognition, animoji, and the notch into the mainstream.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}