{"id": "The Top Political Advertiser on Facebook Is ... FacebookThe Top Political Advertiser on Facebook Is ... Facebook", "paragraph": "On Tuesday, Facebook released a new tool that shows who's spending the most money on political ads on the platform in the US. At a glance, the Ad Archive Report suggests that Texas senate candidate Beto O'Rourke is the biggest spender, having plowed more than $5 million into Facebook ads since May. But the fine print reveals a more surprising finding: The advertiser spending the most on political and issue ads on Facebook is, well, Facebook.Since May, Facebook has spent the equivalent of over $12 million on political and issues ads across Facebook and Instagram. That's about as much as the next four top advertisers, including O'Rourke and President Trump's super PAC, spent combined. The ads Facebook ran promoted the company's efforts to secure elections. They also encouraged Instagram users to vote.It should come as no surprise that Facebook would be the biggest power user of its own technology. But the size of the ad campaign, which according to Facebook’s ad archive only began in August, reflects the company’s eagerness to restore its reputation. Since the 2016 election, Facebook has been blamed for the spread of fake news, for allowing its users' data to be misappropriated for political means, and for being blind to the ways its platform could be misused by foreign actors. Facebook has since launched television ads and wallpapered cities with posters warning against the dangers of fake friends and vowing to protect user privacy. Facebook's own Facebook ads are, it seems, a core part of that strategy.But arguably the most important part of Facebook's reputational turnaround process is not what the company says about itself, but what it does. In May, Facebook released its political advertising archive for the first time, keeping a promise to introduce more transparency to digital political ads. The tool was a start, but it proved difficult to navigate. There was no way to see who was spending the most money on Facebook, how advertisers stacked up against each other, or how much they were spending on Facebook overall.The new Ad Archive Report tool makes that possible. It ranks every political advertiser on Facebook by ad spend, with links to the ads themselves, as well as information on how many ads they've run. It's not a perfect system; Facebook has been caught automatically labeling ads for Bush's Beans as political, simply because they happen to include the name of two former presidents. Other clearly political ads, including some run by Senator Kamala Harris to oppose the nomination of Justice Brett Kavanaugh, have not always been flagged. Still, the Ad Archive Report provides a window into how campaigns and interest groups are spending their money on Facebook compared to one another—and compared to other mediums.It reveals, for instance, that not only is the O'Rourke campaign outspending every other congressional campaign by millions of dollars, but that President Trump's campaign and super PAC are still as active as ever on Facebook. While the Trump Make America Great Again Committee ranks just after O'Rourke, the president's campaign comes in at number nine. In between are some of the usual suspects. Billionaire Tom Steyer's Need to Impeach group is among the top ten spenders, while ExxonMobil has spent big in Colorado, fighting against Proposition 112, which would limit the location of new oil and gas projects.According to the report, since May, advertisers have spent more than $256 million on nearly 1.7 million political and issue ads on Facebook. That's still small compared with the $8.8 billion that's expected to be spent on political advertising this year. Nevertheless, given the sheer volume of ads on Facebook, a tool like this offers valuable insights into who's dominating the political conversation on the world's biggest social media platform—even if the answer is Facebook itself.Former Chief of Disguise for the CIA, Jonna Mendez, explains how disguises are used in the CIA, and what aspects to the deception make for an effective disguise.\nYou can watch new episodes of WIRED MASTERMINDS on your smart TV.\nhttps://www.wired.com/brandlab/2018/06/wired-smart-tv-app-new-way-watch-wired/CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}