{"id": "What It's Like to Fly the WWII-Era Plane That Just Crashed on LA's 101 FreewayWhat It's Like to Fly the WWII-Era Plane That Just Crashed on LA's 101 Freeway", "paragraph": "Watching the flames devour the wing of a World War II-era aircraft that crash-landed on the 101 Freeway in Los Angeles, a few questions come to mind. How did the pilot escape unharmed? How’d he manage not to whack any cars as he came down around 2 pm on Tuesday? Why was the plane, a T-6 Texan, dressed up like a German fighter aircraft (sans swastikas)? And, most pressing of all, what is anybody doing flying a 70-year-old plane over northwest LA?That last one, at least, is easy enough to answer.“The T-6, out of all the airplanes I’ve flown, is one of my favorite aircraft to fly. It’s a beautifully handling aircraft, it’s extremely well built, very powerful, and it’s just a lot of fun,” says Dave Whitcomb, a professional pilot who has logged about 500 hours in the T-6 while working with a group called History Flight, which takes members of the public out flying in old-timey planes.The crashed plane, a North American T-6 Texan, currently belongs to Condor Squadron, KTLA reports. (The Van Nuys-based non-profit’s pilots fly the vintage aircraft for parades and other events, according to its website.) In its previous life, the aircraft saw some combat during World War II and the Korean War, but mostly served as a trainer for pilots preparing to climb into the cockpits of Mustangs and Corsairs. Like a driver’s ed car, the two tandem seats each have a full set of controls. Forty-two feet from wingtip to wingtip, the plane can hit 205 mph at 5,000 feet, thanks to its single engine.The joy of flying a vintage aircraft is similar to that of driving an old race car, Whitcomb says. Without any of the automated systems that pilots now spend most of their time monitoring, operating the T-6 requires constant adjustments to the stick in your right hand, the throttle and propeller controls in your left.“You’re always flying the airplane,” he says. “In a smaller aircraft like that, it feels like it’s a part of you. Whereas big heavy jets today, you’re not manipulating the controls as much, because they’re so stable.”Throw in the joy of reliving history, and it’s easy to see why you’d want to climb into the T-6’s cockpit, slide open the canopy, and slide through the air like the pilots of old.Most of the folks flying T-6’s today are very experienced, Whitcomb says, largely because insurance companies aren’t in the business of covering rookies who want to zip about in a relatively rare and expensive plane. (Someone in Italy’s selling one for $28,735.) Most of the aircraft now have GPS navigation systems; they all have modern radios.And while the T-6 is generally reliable, it only has a single engine, meanings that if that one craps out, you’re gonna make like Icarus. (This is why Whitcomb avoided flying the T-6 over large bodies of water or unlandable terrain.) That’s where the experience comes in. When an engine failure turns your plane into a glider, it’s time to look for a long, smooth landing surface—like the 101— steadily drop altitude, float down gradually, and hope everybody in their 21st century car can get out of the way.Lost luggage is down by 65% thanks to some new tech. Follow the roller coaster ride that your bags make into the bowels of the airport.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}