{"id": "This Tiny Drone Uses Friction to Pull More Than Its Own WeightThis Tiny Drone Uses Friction to Pull More Than Its Own Weight", "paragraph": "Last week, Stanford researchers revealed that that they had built tiny drones that can open doors. I'm not sure I'm happy about this: How will we keep the robots out of our houses if they can just open the doors?But this is also pretty cool. These tiny drones (or micro air vehicles) are able to pull super heavy loads as compared to their own weight—up to a factor of 40.  That might seem crazy.  Well, I guess it's crazy—crazy awesome.Let's get to the physics.  How much of your weight can you pull?Suppose you are trying to pull a large box with an attached rope while standing on flat ground.  Why do you need a rope?  You don't—but it's easier to draw a diagram that way.Here is the important part.  If you pull on the rope with some force (I will call it T for tension), that rope pulls back on you with the same magnitude force.  Forces are an interaction between two things: Pulling with a force of 10 Newtons to the left on a rope means the rope pulls on you with a force of 10 Newtons to the right.  That's just the nature of forces.That means that if I want to pull on a block with a rope, I will need another force pulling on me in the other direction that will prevent me from moving.  That other force is the frictional force.  I'll be honest.  Friction is super complicated.  Just think about all the atoms in one material (your shoes) interacting with all the atoms in another material (the floor).  That's way too much for anyone to deal with.  Fortunately, we have a pretty good approximation for the friction force.  Here are the details of this friction model.Wow.  I just summarized the friction model with bullet points.  OK, that's just a physics appetizer.  If you need more friction, here is a post for you.We are ready to look at the forces on a person (or micro air robot) pulling a larger object. I'm representing both objects as blocks because it's easier.In this diagram notice that the two blocks have different masses.  With its greater mass, the blue block also has a greater downward gravitational pull since the gravitational force is the product of the mass and the gravitational field (g).  Since the block doesn't accelerate vertically (it stays on the table), the upward normal force must be equal to the gravitational force.  That means that the blue block can also have a greater frictional force on it.The only way the red block can move the blue block is for the coefficient of friction between the blue block and the surface to be much smaller than for the red block.  Oh, but this can indeed happen.  Just consider the case of pushing a car.  You can push a car even though it is WAY more massive than you are.  You can do this because the car is on wheels, which effectively makes it very low friction.But this is the old way of pulling things.The flying robots don't use normal friction.  Using plain friction would mean that with their super tiny mass, they couldn't move very massive things.  So instead these robots \"cheat\" with two different methods.  The first way they do this is by using super tiny \"claws\" that grab onto the surfaces below them.  Now it's no longer simple rubbing friction—it's more like holding onto a rope with tiny robot hands.The second method is much more interesting—these robots can use special materials to \"grab\" onto very smooth surfaces with special gecko-based gripper surfaces.  Geckos can stick to smooth surfaces using very tiny hairs.  These hairs allow the materials to get close enough for a Van der Waals interaction.But what the heck is the Van der Waals force?  Let's start with a simple demo you can do at home.  Get something plastic-like and rub it on something.  In my case, I'm using a pvc pipe and rubbing it with a plastic grocery bag (you can try rubbing it on cotton or wool too).  This should make the pvc electrostatically charged.  Now bring this charged pvc near some tiny torn up pieces of paper.  Check it out.It's like magic (except it's science).  It is just an awesome demo.  But why?  Why is the paper attracted to the charged plastic?  The paper is neutral, but it has electric charges in it.  These charges in the paper are pushed to make an induced dipole.  How about a diagram?  Assuming the pvc is positively charged, the charges in the paper would do something like this.The positive charge in the pvc pulls the negative charges in the paper closer to the pvc.  This leaves the other end of the paper with the leftover positive charge (but the paper is still neutral).  The result is an induced dipole—that's just what we call it.  Also, technically this induced dipole in the paper happens at the molecular level and not across the whole paper.Since the negative charges in the paper are closer to the positive charges in the pvc, there is an attractive force between them.  There is also a repulsive force between the positive pvc and the positive charges in the paper.  But since the positives in the paper are farther away than the negative charges, the repulsive force between the paper and pvc is less than the attractive forces between the positives and negatives.In the end, you can get a charged object attracting a neutral object because of this induced dipole.  This is sort of what happens with Van der Waals forces except that it's between two molecules and both molecules are neutral.  You can get an induced dipole due to small (and very short-lived) changes in the arrangement of positive and negative charges in the other molecule.  It's a super tiny effect, but it is indeed there.  Just ask a gecko.This is how a micro air vehicle can sit on a surface and pull things that are much heavier than its own weight.  Impressive.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}