{"id": "The New iPad Pro Ditches the Home Button For a Giant Display", "paragraph": "Apple's new iPad Pro models have all the requisite updates you'd expect: faster processors, better graphics. They're most interesting not for what they've gained but what they've lost: a home button, and a port for Apple's proprietary Lightning cables. Instead, they squeeze in as much display as physically possible.In the place of Lightning, Apple has opted for USB-C, the more broadly adopted standard that MacBooks—including the new MacBook Air—also lean on. And in place of the home button? Much more display real estate, and a reliance on Face ID to unlock the device rather than a thumb-press.The display, a so-called Liquid Retina like the iPhone XR, eats up most of the device; bezels are there, but extremely thin. For context, Apple's smaller iPad Pro squeezes an 11-inch display—with a quarter million more pixels—into the same form factor as the previous 10.5-inch model. The larger iPad Pro still has a 12.9-inch display, but shrinks the hardware down to about the size of an 8.5 x 11-inch sheet of paper. It's 25 percent less volume than its predecessor, with the same sized screen. Both versions are just 5.9mm thick. Both versions are also missing a headphone jack, so maybe keep those AirPods charged.Having more room on the screen—thinner bezels help here as well—seems like a natural benefit for the creative class that Apple has recruited to the iPad Pro, although they'll have to get accustomed to the gesture-based user interface that the company ushered in with the iPhone X. It also manages to offer functional Face ID—which will work no matter what your iPad's orientation—without the need for a notch. None of this should come as a huge surprise, given both recent leaks, and iOS 12 telegraphing that the iPad would use iPhone X-style navigation.The more surprising development, though, is the embrace of USB-C, which Apple first put in the MacBook in 2015. The first thing to know about USB-C is: It's great! It charges, it transfers, it's widely compatible with an ever-longer list of accessories. It also makes sense, if Apple wants to position the iPad Pro as a laptop alternative, to align its iPad I/O set-up with its computers rather than its smartphones.\"It's going you can push what you can do on iPad, or on any computer, even further,\" said Apple CEO Tim Cook at the company's hardware event Tuesday.That switch also enables some fun new capabilities, including using your iPad Pro to charge your iPhone, provided you have the right dongle combo. You can connect to high-resolution external displays, and a wider range of peripherals generally.For all the focus on the iPad Pro's new look, its insides also make some impressive advances. The two models both feature Apple's new A12X Bionic chip, cousin to the A12 found in the company's most recent iPhone lineup. The A12X is bigger, though, featuring 10 billion transistors in an eight-core CPU. Apple touted a single-core performance improvement of 35 percent over the previous generation, with multicore workloads up to 90 percent faster. In fact, Apple claims that the iPad Pro is now faster than 92 percent of all recently sold portable PCs.It also features a seven-core GPU, which doubles the performance of the previous generation; Apple puts it in the same class as the Xbox One S. And its latest-generation neural engine—which handles on-device machine learning tasks—is capable of a whopping five trillion operations per second.All of these numbers understandably might not mean much in isolation. But for some context, the new iPad Pros appear to be able to run full Photoshop admirably well, and gaming demonstrations on Tuesday showed impressive smoothness and detail. Apple also emphasized the iPad Pro's augmented reality prowess, which makes sense given the combination of power and portability.The peripherals have gotten some love as well. The Apple Pencil stylus now attaches magnetically to the exterior of the iPad Pro, and automatically pairs and starts charging wirelessly. If you tap the iPad Pro display with it, you'll launch the device and open the Notes app automatically.The 11-inch iPad Pro will start at $799 for 64GB of storage, but you can go all the way up to a full terabyte. The 12.9-inch version has the same storage configurations, and starts at $999. You can order both starting today, and they'll be in stores on November 7. You can't miss them; they're the ones where the display ate the device.The launch of Apple’s iPhone X brought face recognition, animoji, and the notch into the mainstream.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}