{"id": "Tesla’s New 'Mid-Range' Model 3 Is the iPhone XR of CarsTesla’s New 'Mid-Range' Model 3 Is the iPhone XR of Cars", "paragraph": "Whatever you think of Elon Musk, it's fair to say he doesn't run a typical car company, and the idiosyncrasies go beyond the electric powertrains and hulking center screens. Tesla's approach to building and selling automobiles looks rather like that of its Silicon Valley brethren, with a steady stream of over-the-air software updates to go with frequent, sometimes unexpected changes to its products.The latest of these came last night, when Musk announced (on Twitter, as ever) that Tesla is now offering a \"mid-range\" Model 3, a new middle ground in battery size and price between the more expensive version of the sedan it has been selling, and the $35,000 model it has long promised.https://twitter.com/elonmusk/status/1053060766771761152The tweet sent petrol electronheads to the internet to hunt out information, just as another group of hardcore fans were setting their alarms for 12 am PT, to preorder Apple’s new iPhone.The $750 iPhone XR does most of what the $1,000 (and up) XS and XS Max do, minus a few bells and a couple of whistles: no OLED screen, one camera on the back instead of two, and so on. Apple may make less profit per phone, but it opens itself to a broader market, full of people who don't want to drop four figures. The XR isn't cheap by any means, but analysts think it could be a sweet spot in pricing and sell well.The new Model 3 could find that same spot for Tesla. When Musk launched the car in July 2017, he promised two basic versions. The “long-range” car with 310 miles of range and the one that got everyone excited: a “standard battery” Model 3, with 220 miles of range, for $35,000. So far, Tesla has only built the more expensive version, with compulsory options that take its starting price to $49,000. This new \"mid-range\" Model 3 will run 260 miles between fill-ups and will start at $45,000. (Let's note that while Tesla and Apple may have similar product strategies, they're quite different when it comes to production: Apple is a master of supply chains and rarely misses targets, while Tesla struggles with capacity and rarely hits deadlines.)So this isn’t Tesla's long-awaited “affordable” electric (a car Musk has been talking about for more than a decade), but it is the cheapest one yet. And it might help Musk and Tesla deliver on another promise: reaching profitability this year.“From a product-line strategy perspective, it does make sense,” says R. A. Farrokhnia, a business and engineering professor at Columbia University. “For Tesla, a $45,000 car and a $35,000 car are not that different.” For an internal-combustion-powered car, you'd have to develop, test, and certify a new engine and drivetrain to make this sort of move. For an EV company like Tesla, a new model variant is a tweak to the battery and some software changes. So if Tesla can make more money from what's essentially the same car, why not?The lower price comes with Tesla's estimate that buyers who place an order now will receive their car in six to 10 weeks. That's key, because at the end of the year, Tesla buyers will no longer receive the full federal $7,500 tax rebate for buying an EV. (The rules are funky—and might be changed—but essentially, Tesla has sold too many cars to keep qualifying for credits and is starting a phase-out.)The mid-range Model 3 may not have the same profit margin as the Performance version of the car (which costs $69,000 with the fancy wheels, brakes, and pedals, making it the equivalent of the iPhone XS Max), but it could attract more buyers, including those who've been holding out for the $35,000 vehicle.Tesla is continually working to reduce the cost of its batteries, which it builds at its Gigafactory in Sparks, Nevada, near Reno. The 75-kWh pack that powers the long-range Model 3 costs Tesla about $14,000 dollars (based on the Union of Concerned Scientists estimate of $190 per kWh).Although Tesla doesn’t specify battery sizes for the Model 3, it’s likely the new car has a roughly 60-kWh pack, which would cost about $11,400. So it costs Tesla $2,600 less to produce than the 75-kWh version. It’s selling the car for $4,000 less than the previous starting point for a Model 3, and therefore potentially losing some profit. But there's still plenty of potential margin. Customers are still required to buy the “Premium” interior package, for example, with leather-like seats and a glass roof, which adds $5,000 to the price and likely nets Tesla a nice profit.https://twitter.com/elonmusk/status/1053061826794016769Along with the new car, Tesla has quietly made another change to the ordering process. It no longer offers the “full self-driving” option on any of its vehicles. Previously it’s been a check-box choice costing from $3,000 to $5,000, but with the big caveat that it isn’t actually available. Moreover, nobody knows if Tesla’s approach to autonomy, using just cameras, radar, and a lot of computing power, can even work.The option is still available for believers, as an off-menu choice, via a request through a salesperson. But removing it from the website reduces the chance of confusion—and of a lawsuit from customers who feel short-changed. Autopilot, which keeps the car in its lanes and away from other vehicles on the highway but requires constant human supervision, is still available for $5,000.Anyone who follows Tesla shouldn’t be surprised by this sort of surprise. Musk Motors doesn’t stick to model year refreshes like conventional car manufacturers. It drops updates like Autopilot, a facelift for the Model S, and new battery sizes whenever it can, or when it thinks it will boost sales. As 2018 winds down, Tesla is on a huge push to prove to investors it can be profitable. An Apple-esque mastery of production capabilities would help it get there, but in the meantime, an Apple-esque product strategy isn't a bad way to move forward.Author Anand Giridharadas has penned sharp appraisals of Silicon Valley's benevolent titans and their technocratic solutionism. At WIRED25, he spoke with WIRED's Virginia Heffernan about the colliding forces that challenge a default optimism when it comes to technology. This event was part of WIRED's 25th anniversary celebration in San Francisco.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}