{"id": "Security News This Week: Japan's Top Cybersecurity Official Has Never Used a ComputerSecurity News This Week: Japan's Top Cybersecurity Official Has Never Used a Computer", "paragraph": "The US refused to join a new global cybersecurity agreement this week—maybe because it was created by French president Emmanuel Macron, with whom President Trump isn’t on great terms.On the same day, internet traffic that was supposed to route through Google’s cloud servers instead went haywire, traveling through unplanned servers based in the likes of Russia and China. Hack? No, as Lily Hay Newman explains, though the cause was still worrisome.We also brought you the lowdown on how Darpa is preparing a Hail Mary plan to restart an electric grid in the case of a major infrastructure hack. We showed you how to get rid of old electronics without leaving your personal data on them. We explained what a bot really even is. And, with Mozilla’s help, we explained how to shop for cyber-secure toys for the holidays.Cryptographer Bruce Schneier explained why surveillance kills freedom and experimentation. And Garrett Graff laid out why the Mueller investigation is probably going to be just fine—despite Trump firing Jeff Sessions and replacing him with a person who called the investigation a witch hunt.And there's more! As always, we’ve rounded up all the news we didn’t break or cover in depth this week. Click on the headlines to read the full stories. And stay safe out there.The most cybersecure devices are the ones that aren’t connected to the internet at all. Japan’s minister of cybersecurity Yoshitaka Sakurada appears to have taken that advice a little far, admitting in front of Japanese parliament this week that he has actually never used a computer. At all. The nation of Japan was understandably aghast. When asked whether nuclear power plants in the country allowed USB drives to be used on their computers, Sakurada admitted he didn’t know what a USB drive was. He told parliament if they need to have better answers they should bring in an expert.Though the story is funny in a “this is fine” meme kind of way, it’s actually terrifying, and exemplifies a growing trend of nonexperts in governing positions—and not just in Japan. American lawmakers are increasingly without expertise in the areas they’re assigned to oversee. After the midterms, it made headlines that a lawmaker with an actual science background would be leading the House science committee. It was news because it was such a rarity. This isn’t really fine, is it?It happened in 2016. And now it’s happened again. A judge in New Hampshire has said that Amazon’s Alexa may have heard the stabbing murder of two women. The judge ruled this week that Amazon should hand over the records to prosecutors in the case against the man accused. Amazon said it will only deliver the recordings with a binding legal order, which it appeared to deny the ruling constituted.In an apparent error, a US assistant attorney revealed in an unrelated court filing that Julian Assange has been charged “under seal” in the US. That means no details of the charge, or even the charge itself, are meant to be known by the public. The unrelated filing stated: “Due to the sophistication of the defendant and the publicity surrounding the case, no other procedure is likely to keep confidential the fact that Assange has been charged.” It went on to indicate the US plans to arrest Assange, who is reportedly wearing out his welcome at the Ecuadorian Embassy in London, where he’s been hiding for the past six years. A spokesman for the court told The Washington Post, “The court filing was made in error. That was not the intended name for this filing.” The Post suggests the filing might relate to the Mueller probe, which has been investigating the role Wikileaks played in Russia’s misinformation attack on the US presidential election in 2016.Facebook says that US government requests for user data have gone up by 30 percent year over year. Most of these were court-ordered search warrants, which the company prevented from alerting users about. The figures were released in its latest transparency report, which came out a day after The New York Times bombshell investigation into the company’s mishandling of Russian misinformation on the platform during the presidential election. Facebook’s transparency report also reveals that between 2014 and 2017, Facebook reports the US government served it with 13 national security letters, the secret subpoenas the FBI issues to companies for data without any judicial oversight, and about which companies are often prevented from discussing publicly. Facebook disclosed the information after the government lifted the gag orders on these specific NSLs earlier this year, according to Facebook’s deputy general counsel Chris Sonderby.As if its traffic being rerouted erroneously through Russia and China wasn’t bad enough, Google’s official G Suite Twitter account was also hacked this week. In a since-deleted tweet, the account promoted a bitcoin scam to its more than 800,000 followers. The Next Web reports the hack was part of a string Bitcoin related scams going around. Earlier that same day Target’s Twitter account had done the same thing.In good news, internet security company Cloudflare released a mobile version of its 1.1.1.1 public DNS resolver, which works to protect your browsing privacy while on a public internet connection by hiding your IP address. Available for iOS and Android devices, the app is free and early reviews suggest it’s fast.It seems like every time you turn around there's a new breach of personal information. Follow these steps to minimize the damage.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}