{"id": "Where to Order the Colorful iPhone XR (and 5 More Phone Deals)Where to Order the Colorful iPhone XR (and 5 More Phone Deals)", "paragraph": "Apple's iPhone XR is the odd duck this year. It's the first iPhone to come in a rainbow of colors for many years and looks nearly identical to the other new iPhones, with an edge-to-edge screen with that signature notch cut out up top. It doesn't have dual rear cameras like the new iPhone XS (8/10, WIRED Recommends) and it's somewhere between the size of a regular iPhone and Plus-sized iPhone. More importantly, it's $250 cheaper than the other new iPhones.The XR hits shelves Friday, October 26 at 8 am (local time) and preorders have begun. Most colors are still in stock at the starting price of $749, though a few models have slipped to 2 weeks ship time. Below are the stores taking preorders, and a few other good phone deals happening this week.There is no labeled unlocked version of the iPhone XR yet that works on every wireless carrier, so you'll have to pick the right one for you. If you pay in full from Apple.com, your phone will come unlocked, according to Apple.Apple for $749 or $898 if you pay $37.41/24 months for Yearly iPhone Upgrade Program where you can trade in your phone for a new iPhone every year. - WIRED Recommended ChoiceBest Buy for $750 or pay monthly on Verizon, AT&T, Sprint. Monthly prices are the same as seen for each carrier below. Best Buy also lets you trade your old iPhone 7 Plus (or newer) for up to a $275 Best Buy Gift Card.Walmart In-Store Reservation for $750. You don't have to pay anything online, but Walmart will let you reserve an iPhone XR to pick up at your local store.T-Mobile for $750 or $20.84/36 months. T-Mobile has a complicated deal to get an iPhone XR half off if you start a 4-line plan.Sprint for $750 or $31.25/18 months. Sprint offers a lease plan that lets you upgrade after 12 months if you turn in your phone, like Apple's upgrade program.AT&T for $750 or $25/30 months. AT&T has a complicated way to get $700 off a second iPhone XR, assuming you buy them on its Next upgrade program and also have DirecTV. You may want to read the fine print on this deal (there's a lot of it).Verizon for $750 or $31.24/24 months. Verizon offers a second iPhone XR for free if you add a new line of service.U.S. Cellular for $749 or $24.96/30 months. U.S. Cellular offers $600 back on iPhone XR in bill credits if you are switching from another wireless network and order the unlimited plan with device protection.Not yet available at TargetMaybe we're trolling the iPhone XR just a little. It appears to be a great phone, but it can also be really expensive. The price of high-end smartphones has shot through the roof in the last couple years, which makes it a great time to consider a cheaper phone.iPhone 8 for $599 or iPhone 7 for $550. This article explains why it's not a bad idea to order an older iPhone.Moto Z3 Play for $420 (Was $450). I like the Moto Z3 Play even more than I did when I wrote our review. Not only does it work on all four wireless networks, it comes with a magnetic MotoMod battery pack that more than doubles its battery life. It's thin enough that I started just leaving it on, and my Moto Z3 has never ended a day with less than an 80 percent charge. It can last 2.5 days and that peace of mind, combined with a speedy interface and decent camera, has made it such a good phone I've been using it as my go-to phone ever since.LG G6 Plus for $420. The LG G6 was a fantastic, underappreciated phone, and that's why it costs so little. It's as powerful as the best phones of 2017, which makes it very competitive this year, too. It's one of\nour favorite Android Phones and works on AT&T, T-Mobile, and Verizon.Moto X4 for $250. This phone also works on all four carriers and gets great battery life (8/10, WIRED Recommends). You'll notice a bit of slowdown now and then, but you can buy three of these for the price of one iPhone XR.Huawei Mate 10 Pro for $500 (Was $800). The Mate 10 Pro is a fantastic, powerful high-end phone that's on sale right now. It's up there with the best Android devices in most every measure that matters.When you buy something using the retail links in our product reviews, we may earn a small affiliate commission. Read more about how this works.WIRED's Lauren Goode reviews the latest iPhone models -- the iPhone XS and iPhone XS Max -- and tests the battery life, camera and video capabilities.\nCORRECTION, Sept. 19, 5:05 PM EST: The video above misstated the water rating for the iPhone XS and XS Max. While the IP68 standard states that devices must be waterproof to more than 1 meter, Apple's new phones are waterproof up to 2 meters for up to 30 minutes.\"CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}