{"id": "A New Climate Change Lawsuit Takes Aim at ExxonMobilA New Climate Change Lawsuit Takes Aim at ExxonMobil", "paragraph": "This story originally appeared in the Guardian and is part of the Climate Desk collaboration.New York is suing the oil giant ExxonMobil in a lawsuit that claims the company engaged in a “longstanding fraudulent scheme” to downplay the risks posed to its business by climate change regulations.The legal action, launched by New York state attorney general Barbara Underwood, alleges that ExxonMobil deceived its investors by hiding the true extent of its financial exposure to laws aimed at curbing greenhouse gas emissions.Exxon provided “false and misleading assurances” to shareholders that it had factored in climate regulations and that its vast reserves of oil and gas weren’t at major risk of being left as stranded assets, New York’s lawsuit claims.Senior executives, including former chief executive Rex Tillerson, who was briefly US secretary of state in the Trump administration before being abruptly fired earlier this year, took part in this facade, the lawsuit states.The suit, lodged in the New York supreme court, comes after three years of investigation into Exxon by attorneys general in New York and Massachusetts. Exxon has previously attempted to block an investigation into its practices, claiming its first amendment rights were being violated.Underwood said: “Investors put their money and their trust in Exxon – which assured them of the long-term value of their shares, as the company claimed to be factoring the risk of increasing climate change regulation into its business decisions. Yet as our investigation found, Exxon often did no such thing.“Instead, Exxon built a facade to deceive investors into believing that the company was managing the risks of climate change regulation to its business when, in fact, it was intentionally and systematically underestimating or ignoring them, contrary to its public representations.”New York’s lawsuit paints a picture of corporate malfeasance whereby Exxon told investors it was applying a “proxy cost” to its extraction of fossil fuels to account for the risk of governmental action to address climate change. In practice, the lawsuit alleges, Exxon applied much lower proxy costs than it initially stated, essentially assuming that existing climate regulations would remain in place, unchanged.This led to inaccurate information about investments in major projects, such as Exxon’s oil sands operations in Alberta, Canada, the lawsuit states. Canada has recently outlined a national plan to put a price on carbon dioxide pollution in a bid to reduce emissions.Exxon’s role in covering up the impact of climate change has come to light in the recent years, with the company aware for decades about the consequences of burning fossil fuels only to downplay this in public.The company now says it accepts climate change is real and a threat, even pledging $1m toward a campaign to put a price on carbon.This support comes with the caveat that mounting lawsuits aimed at making Exxon pay for damage wrought by climate change are dismissed. In July, a federal judge kicked out a lawsuit lodged by New York City that took aim at the five major oil producers, including Exxon.The New York state lawsuit does not concern the impact of climate change, but rather Exxon’s role in communicating the risk of climate regulation to investors.“Big oil may finally face some consequences for its role in wrecking the climate,” said Bill McKibben, co-founder of climate campaign group 350.org. “The New York attorney general is standing up for investors who may have been swindled, and indirectly for the seven billion of us who will suffer from Exxon’s lies.”Exxon was contacted for comment.Attorneys general in California and Illinois, asked if they would join the New York suit, said they planned to take a “close look” at the securities fraud law the state is suing under.The case, “has been a topic of mutual conversation among various state AGs, and we are all going to take a close look at the filing,” California attorney general Xavier Becerra said.California would need to consider how its own laws apply, Becerra said. In Illinois, the power to join this type of case lies with the secretary of state, attorney general Lisa Madigan explained.She said: “The overall message here is that Exxon and others that were really at the forefront of causing climate change conditions in our country and around the world long knew that this was taking place and withheld that information to the detriment of not just their investors but ultimately all of us around the country.”Though the planet has only warmed by one-degree Celsius since the Industrial Revolution, climate change's effect on earth has been anything but subtle. Here are some of the most astonishing developments over the past few years.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}