{"id": "These DNA Startups Want to Put All of You on the BlockchainThese DNA Startups Want to Put All of You on the Blockchain", "paragraph": "In 2018, people started using the blockchain to battle deepfakes, track sushi-grade tuna from Fiji to Brooklyn, and even cast a (symbolic) vote. It was only a matter of time before someone figured out how to put all 6 billion bits of your genetic source code on the blockchain too. Starting this week, a startup called Nebula Genomics is doing just that, offering whole-genome sequencing for free, as a way to stock up for its real ploy: a blockchain-based genetic marketplace.Of course, nothing is free free. But if you’re willing to cough up some health information and refer your friends, you can earn special Nebula tokens that can help pay for a lo-fi sequence, the equivalent of a first draft that someone went over once with a subpar spell-checker. If you don’t want to answer survey questions about your donut and negroni habits or your family’s history of heart disease, you can get the same quick-and-dirty sequence for $99. But if you do answer the questions, and if a researcher or pharmaceutical company finds them interesting, they might pay to upgrade you to the Cadillac of whole genomes (what’s called 30x coverage, in the gene biz). In exchange, you grant them permission to study your data.This offer comes bundled with all the promises of security, anonymity, and transparency (and money!) at the core of the blockchain’s immutable ledger. Once users have their genome sequenced, they can charge a fee, in tokens, to anyone who wants to access it. In the future, those tokens can be redeemed for additional tests and products that will further interpret your DNA.Users also retain more control over their data than is typical. Anyone who’s been granted access to an individual’s de-identified DNA can only crunch analyses on that data using Nebula’s own computers. Buyers get to see the results, never the raw data itself. The only person who can download DNA data from the platform is the person whose DNA it is. The goal, says Nebula co-founder and chief scientific officer Dennis Grishin, is to create an environment where users can cheaply learn about their DNA and share it with scientists, while protecting themselves from potential privacy breaches.The field of DNA testing has long been stuck with a circular problem. With whole genome sequences running about $1,000 each, the tests are so expensive, and the privacy concerns serious enough, that adoption has been slow. Further, only about two percent of people who get sequenced will turn up any information that could help them treat or stave off potential health risks. Your DNA could tell you more, if scientists had more genomes to work with. But the incentives for individuals just aren’t there yet.This entrenched chicken-and-egg situation is the reason the federal government is spending $4 billion to sequence and study a million people across the US, asking them to donate their blood and spit and, eventually, giving them their results for just the price of participation. Now Nebula is joining the trend with its freemium approach.Co-founded in 2016 by George Church, one of the field’s OGs (that’s Original Genomicist to you), Nebula is one of a collection of companies trying to speed up the arrival of personalized medicine. Its subsidized whole-genome sequencing services will be provided primarily by nearby Veritas, another Church-founded startup. Together, they want to help people see the value in every bit of their double helix. DNA can be big business, as genetic testing company 23andMe recently made plain with its blockbuster $300 million pharma deal. Marketplaces like Nebula will allow individuals to cash in on the genomics rush themselves while retaining control over who gets to profit from their data.Using the blockchain to do so is an enticing idea, and Nebula is far from alone. In the last three years, nearly 150 companies building biomedical blockchain applications have raised more than $660 million in the private and cryptocurrency markets. About a quarter of those projects aim to be decentralized clearinghouses for various kinds of health data, according to a recent analysis by researchers at Mount Sinai’s newly formed Center for Biomedical Blockchain Research.“What’s the closest thing you can come up with to a direct data marketplace?” asks Noah Zimmerman, the center’s director. “I can’t think of one. We’ve always required trusted third-party brokers to make these deals, and the value isn’t accruing to individual participants.”He likens the current system—where pharma companies pay intermediaries for de-identified health information—to college sports. In the same way unpaid student athletes are told to be grateful for their free education, patients who participate (knowingly or unknowingly) in research are told to be happy there’s now a drug on the market that treats their illness. “I mean, sure,” says Zimmerman. “Be happy. But there’s someone up there making gobs of money on the backs of people that product is built on. Now, there is the potential here for people who are contributing data to be rewarded proportionally to how valuable their data is.”For that promise to materialize, marketplaces like Nebula’s are going to have to recruit a LOT of customers. That’s one of the reasons it’s offering the free sequencing deal. It’s not unlike when Google debuted Gmail in 2004, offering ample free storage that the search giant monetized through targeted ads—targeting that only became possible once the company had collected bazillions of emails. Zimmerman just hopes they can make it that long.“My biggest concern from an entrepreneurial standpoint is that these marketplaces are only valuable once they get to huge numbers,” he says. “Anything less than 100,000 genomes probably isn’t going to be useful to anyone.” 23andMe was able to survive some dark times because it had deep pockets. It’s unclear how far Nebula’s $4.3 seed investment will carry it.The company declined to comment on whether it would be pursuing an ICO—the controversial and increasingly regulated practice among blockchain startups of raising funds through an “initial coin offering.” Like many other medical information-related startups, Nebula’s blockchain is closed, with the company acting as a central authority to award tokens and verify researchers before letting them in. Church hopes to convince people that getting your genome sequenced is just like buckling a seatbelt or not smoking. “Cars, cigarettes, genomes, these are all public health risks,” says Church. “They’re rare, but extremely impactful if they hit you.”Nebula is joining another genomic data platform, called EncrypGen, which launched the first blockchain-enabled DNA marketplace on November 6. Called Gene-Chain, it allows users to upload the kind of genetic data produced by most direct-to-consumer companies, including 23andMe and Ancestry, and set a price for potential buyers. David Koepsell, the company’s CEO, says it is aiming to attract the 20 percent of 23andMe customers who’ve decided against participating in the testing company’s research program. Encrypgen plans to support whole genome sequences by the end of the year.It also faces a challenging road forward. In the last week, EncrypGen has seen a couple dozen transactions on its platform, according to Koepsell, and most people are setting the price for a person’s genotype data plus answers to health-related survey questions at less than ten dollars. Potential buyers can search for data by self-reported health conditions or by physical characteristics, such as body-mass index, ethnic background, or age. DNA tokens used to buy any data can be converted to bitcoin or ethereum on a cryptocurrency exchange.Unlike the Nebula marketplace, once buyers have spent their DNA tokens to purchase genetic data, they’re free to download it to their local machines. Also unlike Nebula, anyone whose computer can do the required math can join to mine and add blocks. “One of the things we’re trying to empower is citizen science,” says Koepsell. “There’s no legal reason to prevent anyone from purchasing de-identified data and doing research with it. We wanted to democratize the process.”Federal policies for protecting human research subjects do not currently extend to de-identified genetic data. But those laws have come under increasing scrutiny as DNA data combined with information from other databases has exposed individuals’ identities. “Once you give access to your genome data, there’s no magical self-destruct button,” says Zimmerman. Not even a blockchain can prevent that from happening. So you still have to be careful about whom you trust with your DNA.Maybe you've heard of Crispr, the gene editing tool that could forever change life. So what is it and how does it work? Let us explain.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}