{"id": "All the New Hardware Apple Announced Today in New YorkAll the New Hardware Apple Announced Today in New York", "paragraph": "The theme of Apple's second fall hardware show: throwbacks. The event, at Howard Gilman Opera House in New York City, featured a revival of the MacBook Air, a dusted-off Mac Mini, new iPads, and, for some reason, Lana del Rey.Did you miss the show? You can watch the whole thing here, catch up on the analysis from our liveblog, or simply read on for our TL;DR recap.Ten years ago, at an event not unlike the one today, Steve Jobs pulled the very first MacBook Air out of a manilla envelope and introduced it to the world. The device was unlike anything that came before it—a laptop so thin, so lightweight, you could take it everywhere. In the decade since, a lot has changed. For one thing, the market for portable laptops and feather-light two-in-ones has never been more crowded. At the same time, the MacBook Air has quietly begun to fade.Today, Apple changed that with a refreshed MacBook Air. The minimalist laptop now comes with a 13.3-inch Retina display, Touch ID, and a Force Touch trackpad. Apple added a faster processor, its latest-gen butterfly keyboard, and a couple of USB-C ports. And it's even lighter than before: It weighs 2.75 pounds, and takes up 17 percent less volume than the earlier MacBook Air.It's also made entirely from recycled aluminum, part of Apple's new pledge to use more recycled materials in its devices. At the starting price of $1,199, you only get 128 gigs of storage—so expect to pay more to make this the lightweight laptop worth buying.Another long-awaited update: We saw a beefed-up Mac Mini, which Apple has left untouched for the past four years. The new Mac Mini brings with it all the updates you’d expect after languishing for so long. For starters, it comes in space grey now. Apple also added a quad-core chip, with the option to upgrade to six cores, and up to 64 gigs of RAM. It’s got a whole heap of ports, including four Thunderbolt 3 ports and one for Ethernet.Like the MacBook Air, the new Mac Mini enclosure comes from 100 percent recycled aluminum, because sustainability is important. It’s available to order today, starting at $799.For years, the iPad has been an exemplar of Apple hardware: It’s portable but powerful, lasts forever, and bridges the gap between the iPhone in your pocket and the MacBook on your desk. Today, Apple updated its iPad Pro to better refine that middle-ground.This is a smaller, thinner device than the iPad you already own—Apple says this one has 25 percent less volume than its predecessor. Also: no home button, and no headphone jack. Apple added a giant Liquid Retina display, which squeezes an 11-inch display into the same form factor as the previous 10.5-inch model. Like Apple’s newer iPhones, this new iPad uses a new gesture-based interface and unlocks with Face ID. It also adds a seven-core GPU and fresh A12X Bionic chip for more processing power than before. Apple says these new iPad Pros are faster than 92 percent of all portable PCs—which seems like a reason to get this over, say, the new MacBook Air. It comes in two sizes: $799 and up for the 11-inch version, or $999 and up for the 12.9-inch version.You probably already have iOS 12 on your iPhone—but do you have 70 new emoji and the ability to FaceTime with 32 people at once? No, but you will soon with the release of iOS 12.1. The software update brings with it a few new features, like depth control in Portrait mode and dual SIM support for the iPhone XS, XS Max, or XR. There’s also a redhead emoji.Finally, in keeping with the theme that everything old is new again, Lana del Rey capped off today’s Apple event with a surprise performance. She sang two songs from her new album, but couldn't say the album title out loud, since Apple asked her not to curse on stage. But the album is called Norman Fucking Rockwell and it comes out in March. Now you know!With iOS10 on its way, we thought we’d look back at the way iOS changed the world. But the most pivotal thing in iOS history is something Apple got right on its very first try.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}