{"id": "Space Photos of the Week: A Star Is Born After Gases CrashSpace Photos of the Week: A Star Is Born After Gases Crash", "paragraph": "Stars are born from star clusters. But where do the clusters come from? Scientists seeking a greater understanding on that have a new theory. When two gas clouds collide, they are clashing at 20,000 miles per hour or more. Consequently, the gas and dust they each carry is compressed into a shockwave that then creates massive star clusters. This image is an artist's illustration of such a collision, using data from NASA’s SOFIA telescope—the Stratospheric Observatory for Infrared Astronomy. Astronomers will keep using SOFIA to study how cold, dusty clouds interact and spur star cluster formation.NASA’s Juno completed its 16th science orbit around Jupiter on October 29. From 4,400 miles above the cloud tops, the spacecraft snapped this stunning image of a large anticyclone known as a white oval. The detail in the image is so granular that you can discern high-altitude clouds, next to the red storm at right center, as slightly raised white dots.Here is a galaxy teeming with young stars, the compact blue dwarf galaxy called ESO 338-4 to be exact, captured by the Hubble Space Telescope. These galaxies are named for the blue light they emit as a result of the creation of stars in their cores. And all this creation maybe have been the result of an accidental collision: Scientists believe a galaxy in the vicinity collided with ESO 338-4, and their subsequent interaction of gas and dust is what’s feeding all the stellar activity in this region.We’ve come across the galaxy cluster called Abell 2597 in our travels before, but never looking like this. Image data from three observatories have been combined to create this image of the supermassive black hole at the center of the cluster. The yellow is from the Atacama Large Millimeter Array in Chile; the reds are from the Multi Unit Spectroscopic Explorer instrument on the European Southern Observatory's Very Large Telescope, also in Chile; and the blues and purples are from the Chandra X-ray Observatory in space. These colors represent the violent flows of gas being forced around the region by this black hole; the yellow in particular shows cold gas being sucked in, while the red marks a hot spout of hydrogen shaped by the hole’s energy.For a European perspective, all astronaut Alexander Gerst had to do was look down.  He took this photo from the International Space Station as it orbited over the continent, illuminated at night. From 254 miles up, Europe looks ready for Christmas, but consider that this level of brightness is actually a form of pollution—light pollution. Researchers rely on images like these to spot what regions need to work on the issue most and reduce their energy footprint to boot. Besides, urban dwellers are blinded to the stars, planets, and even meteor showers when so much artificial light drowns out the sky.Not animal, not vegetable, but mineral: The European Space Agency’s Mars Express orbiter teamed up with NASA’s Mars Reconnaissance Orbiter to declare they have identified clays rich in iron and magnesium on the Martian surface. These clays, called smectites, are likely left over from volcanic activity spread over hundreds of square kilometers in a region known as Oxia Planum. Astronomers believe the area is a good place to further study whether traces of life might possibly, maybe, be preserved on Mars.Stars are born from star clusters. But where do the clusters come from? Scientists seeking a greater understanding on that have a new theory. When two gas clouds collide, they are clashing at 20,000 miles per hour or more. Consequently, the gas and dust they each carry is compressed into a shockwave that then creates massive star clusters. This image is an artist's illustration of such a collision, using data from NASA’s SOFIA telescope—the Stratospheric Observatory for Infrared Astronomy. Astronomers will keep using SOFIA to study how cold, dusty clouds interact and spur star cluster formation.NASA’s Juno completed its 16th science orbit around Jupiter on October 29. From 4,400 miles above the cloud tops, the spacecraft snapped this stunning image of a large anticyclone known as a white oval. The detail in the image is so granular that you can discern high-altitude clouds, next to the red storm at right center, as slightly raised white dots.Here is a galaxy teeming with young stars, the compact blue dwarf galaxy called ESO 338-4 to be exact, captured by the Hubble Space Telescope. These galaxies are named for the blue light they emit as a result of the creation of stars in their cores. And all this creation maybe have been the result of an accidental collision: Scientists believe a galaxy in the vicinity collided with ESO 338-4, and their subsequent interaction of gas and dust is what’s feeding all the stellar activity in this region.We’ve come across the galaxy cluster called Abell 2597 in our travels before, but never looking like this. Image data from three observatories have been combined to create this image of the supermassive black hole at the center of the cluster. The yellow is from the Atacama Large Millimeter Array in Chile; the reds are from the Multi Unit Spectroscopic Explorer instrument on the European Southern Observatory's Very Large Telescope, also in Chile; and the blues and purples are from the Chandra X-ray Observatory in space. These colors represent the violent flows of gas being forced around the region by this black hole; the yellow in particular shows cold gas being sucked in, while the red marks a hot spout of hydrogen shaped by the hole’s energy.For a European perspective, all astronaut Alexander Gerst had to do was look down.  He took this photo from the International Space Station as it orbited over the continent, illuminated at night. From 254 miles up, Europe looks ready for Christmas, but consider that this level of brightness is actually a form of pollution—light pollution. Researchers rely on images like these to spot what regions need to work on the issue most and reduce their energy footprint to boot. Besides, urban dwellers are blinded to the stars, planets, and even meteor showers when so much artificial light drowns out the sky.Not animal, not vegetable, but mineral: The European Space Agency’s Mars Express orbiter teamed up with NASA’s Mars Reconnaissance Orbiter to declare they have identified clays rich in iron and magnesium on the Martian surface. These clays, called smectites, are likely left over from volcanic activity spread over hundreds of square kilometers in a region known as Oxia Planum. Astronomers believe the area is a good place to further study whether traces of life might possibly, maybe, be preserved on Mars.If this week’s space photos had a theme, it would be impacts. Let’s start with a blue dwarf galaxy that has a strange shape, almost like a sparkly smear across a window. Our dwarf galaxy is pretty and blue and it’s nice to think of it as a sweet stellar nursery, but in this case we’re actually seeing what happened after another galaxy got way too close—a violent clash of dust and gas.Scientists have been studying star clusters for decades, but they are still not sure how they take shape. Using NASA’s SOFIA telescope, they think they’re a bit closer to unraveling this mystery. When one molecular cloud gets too cozy with another cloud, all that gas and dust come into contact at speeds above 20,000 miles per hour. By studying that violent collision, scientists are beginning to learn more about the building blocks for star factories.Enjoying all the space drama? Binge-watch the full cosmic gallery of WIRED space photos, here.WIRED staffers, and some family, built the largest and most expensive lego set to date, the Millennium Falcon. Of course, we made a time-lapse of us putting this behemoth together.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}