{"id": "The Mac Mini Gets an Update After Four Long Years", "paragraph": "On October 16 of 2014, Apple announced a modest upgrade to the Mac Mini, the puckish computer that plays caboose in Cupertino's desktop train. And then... nothing. For four years, despite remaining for sale, the Mac Mini languished without any updates at all.But now, it's back with a vengeance.\"There’s another small but mighty Mac our users have been waiting for,” said Apple CEO Tim Cook at an Apple hardware event in New York. He then introduced a slick teaser video which, in fairness, the company has had four years to work on.The new Mac Mini keeps the essential form factor of its predecessor—one that the Apple TV has embraced as well—but now features a space grey finish, and comes with a processor that's more recent than the first John Wick movie. Specifically, it has Intel's 8th generation Core processors, which came out in 2017 but still have plenty of kick. It starts with a quadcore chip, but you can upgrade to six cores. Similarly, the entry level Mac Mini has a relatively scant 8GB of RAM and 128GB of flash storage, but you can upgrade all the way up to 64GB RAM, and a 2TB solid state drive.As for connectivity, it comes with ports aplenty: one ethernet (upgradeable to 10GB), four Thunderbolt 3, one HDMI, and two USB-A.Apple touted the Mac Mini's performance on Tuesday, noting that it was up to five times faster than the previous generation. This, we should point out, means nothing. You might as well say how much faster a Camry is than a Conestoga wagon. Still, it at least seems to have internals that can actually get work done, even fairly intensive creative work and video encoding, if you're willing to pay for it.Speaking of which, the Mac Mini starts at $800, which Apple touted as \"by far the best value we've ever offered\" in a Mac Mini. And while it's certainly way less than an iMac or even the new MacBook Air, remember that for many use cases you're going to have to cough up money for a display, keyboard, and mouse as well. Once you get that memory and storage up to ramming speed, it'll add up.Other assorted details: As with Apple's new MacBook Air, the new Mac Mini is made of 100 percent recycled aluminum, and has a new thermal system for more efficient cooling, a good idea given how much more horsepower it's got.You can order it today, and it'll get to your doorstep on November 7. Which is to say, against all odds, the Mac Mini has finally returned, with plenty to show for the wait.The launch of Apple’s iPhone X brought face recognition, animoji, and the notch into the mainstream.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}