{"id": "Intricate Maps Reveal What US Public Transit Gets Wrong—and RightIntricate Maps Reveal What US Public Transit Gets Wrong—and Right", "paragraph": "New York City is by far the country's biggest and busiest transit system. But Spieler points out that service in northern New Jersey is seriously lacking. Just look at all those red and orange areas without access to frequent transit!Los Angeles is doing a good job expanding its light-rail system, and its Orange and Silver lines count as pretty good bus rapid transit. But there aren't great connections outside LA County, and the metro's densest employment corridor, along Wilshire Boulevard, doesn't have rail service.Oh, San Francisco. You can get around the city's dense core pretty easily, but the area has neglected suburban connections and routes to even some dense, urban neighborhoods. Plus, its multi-agency system—there are 27 transit operators in the Bay Area—is a real pain.Dallas, Texas, is no one's idea of a transit haven. Its trains and buses don't run frequently enough, and its light-rail system, DART, bypasses major population and employment centers. But the region has opened more miles of all-day rail service since 1995 than any other in the US.Philadelphia, you aren't too bad. Half of the residents of the City of Brotherly Love can take a train or bus to its downtown City Center in 30 minutes or less. But the region has also failed to adequately fund transit for decades. It could be so much better.Spieler was a key player in Houston's recent bus redesign, so don't be surprised that he gives the unlikely city fairly high marks. The new bus network is high-frequency and linked to light rail, and the area is building a bus rapid transit system. But connections between uptown and downtown Houston are still hard to come by.Seattle is growing, and amazingly enough, its transit system is growing, too. Voters have approved funding increase after funding increase, and by 2040, Seattle could have one of the largest and best transit networks in the country.Nashville completed one of cheapest commuter-rail systems in recent history in 2006. But not that many people ride it, because it doesn't take many where they want to go. There's a pretty good bus network, though.New York City is by far the country's biggest and busiest transit system. But Spieler points out that service in northern New Jersey is seriously lacking. Just look at all those red and orange areas without access to frequent transit!Los Angeles is doing a good job expanding its light-rail system, and its Orange and Silver lines count as pretty good bus rapid transit. But there aren't great connections outside LA County, and the metro's densest employment corridor, along Wilshire Boulevard, doesn't have rail service.Oh, San Francisco. You can get around the city's dense core pretty easily, but the area has neglected suburban connections and routes to even some dense, urban neighborhoods. Plus, its multi-agency system—there are 27 transit operators in the Bay Area—is a real pain.Dallas, Texas, is no one's idea of a transit haven. Its trains and buses don't run frequently enough, and its light-rail system, DART, bypasses major population and employment centers. But the region has opened more miles of all-day rail service since 1995 than any other in the US.Philadelphia, you aren't too bad. Half of the residents of the City of Brotherly Love can take a train or bus to its downtown City Center in 30 minutes or less. But the region has also failed to adequately fund transit for decades. It could be so much better.Spieler was a key player in Houston's recent bus redesign, so don't be surprised that he gives the unlikely city fairly high marks. The new bus network is high-frequency and linked to light rail, and the area is building a bus rapid transit system. But connections between uptown and downtown Houston are still hard to come by.Seattle is growing, and amazingly enough, its transit system is growing, too. Voters have approved funding increase after funding increase, and by 2040, Seattle could have one of the largest and best transit networks in the country.Nashville completed one of cheapest commuter-rail systems in recent history in 2006. But not that many people ride it, because it doesn't take many where they want to go. There's a pretty good bus network, though.The first thing Christof Spieler does in Trains, Buses, People, his so-called “opinionated atlas” of US public transit, is thank his wife. She seems to deserve it: For more than a decade, Spieler has been picking their vacation destinations based on what transit systems he wants to explore.At least the trips were productive. This week, Spieler, a urban planner at the design firm Huitt-Zollars and an adjunct professor at Rice University’s Schools of Architecture and Engineering, published a slick, map-filled volume documenting the condition of the 47 metro areas in the country that have functioning rail or bus rapid transit systems.“Functioning” might be an overstatement. This is Spieler’s point, and why he spent more than 15 years traveling to, observing, and collecting data on all these cities to begin with. “I feel a lot of the discussions around transit take as its major metric of success the opening of new rail lines,” he says. “I think the definition of ‘success’ is you made a network that makes it easy to get around the city.”Spend a little time with the book’s meticulously detailed maps, and you’ll see what he means. Metros like Seattle; Portland, Oregon; Salt Lake City, Utah; and even El Paso, Texas, connect their densest residential and employment centers with bus or train lines that run at least every 15 minutes during the week—exactly the metrics, in Spieler’s opinion, that should be used to judge a system. (Some cities publish data on route frequency online. Others don’t, so Spieler sometimes found himself manually searching through their transit schedules, charting how often a train or bus route makes its run.)Some very big places have some very obvious gaps. Spieler calls out metro New York—especially Westchester County, northern New Jersey, and Long Island—as places that could do a lot better with transit service. Dallas, too. These are locales where the dense streets necessary for transit do exist, but no one has built the bus or rail systems to capitalize on them.No matter what kind of bus or streetcar or subway seat gently supported Spieler during his nationwide travels, every system had one thing in common—they were ultimately the products of a bunch of land use decisions. Your bus system may be crappy partly because someone did a silly job of laying out your route, but it could also be because long-ago planners engineered your city for personal car travel.“When we look at the success of transit systems, we’re not just seeing transit decisions. We’re seeing land use decisions,” Spieler says. “How are people distributed? How are jobs distributed?”And yet, the cartographer feels somehow upbeat about the state of the American transit system. “I came away from this with a real feeling that there’s a lot of opportunity in the United States,” he says. “If cities really focus their investments in the right places, it can really improve a lot of people’s lives.” And while that happens, you can find the rest of us gazing at these pretty maps, and getting a little obsessive too.Your first thought upon seeing Swindon's 'magic roundabout' might be: man, the Brits have really lost the plot lately. But this thing—which is actually seven roundabouts in one—has been working for 60 years.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}