{"id": "Google Is Putting More Privacy Controls Directly in SearchGoogle Is Putting More Privacy Controls Directly in Search", "paragraph": "Google has faced mounting criticism about how it manages your data and lets you control what Google holds. But a new tool that the company says it has been working on for months aims to make it easier for you to understand what data Google collects, and surface the choices you have to control it.The company will start showcasing privacy mechanisms directly within search, so you can review and delete your activity log without having to navigate to another screen, learn what data Google collects about you, and more easily find relevant granular privacy controls. Google says it will take similar steps for greater transparency across some of its other products as well.\"A lot of things with Google start with search; it’s a good test bed where we see a lot of our users,\" says Eric Miraglia, Google's director of product management in the Privacy and Data Protection Office. \"Search is a tool that people depend on for a lot of things as they go through the day, so feeling in command of that is really important. We want this initiative to make the controls and resources a little more visceral and a little more actionable.\"Google calls the new feature Your Data, and has experimented with offering information about data privacy in different formats like video, illustrations, and text. The idea, Miraglia says, is to help as many users as possible understand what data a service collects, why, and what controls are available.\"It ultimately doesn't get to the heart of the concerns.\"Douglas Schmidt, Vanderbilt UniversityFor search, for example, Google collects data not just on your query, but which links you click, and your location at the time. To review and control that collection you would normally need to navigate the settings pages for your Google Account.​ But Your Data will put the relevant controls directly into the main search screens, removing some friction between wanting to know more and acting on it.Miraglia says that Google will start offering Your Data in Maps sometime next year. Other services should eventually adopt the feature as well. \"We think the format of offering multiple modes of explanation, including a video, will work really well across different products,\" Miraglia says. \"We’ve been meeting with teams across the company make sure the framework is reusable and meaningful across lots of different products.\"Google says Your Data has been in the works for a long time, but it certainly gestures, either intentionally or not, toward recent controversy about the efficacy of Google's user protections. Privacy advocates say, though, that while more clarity and explanation is always helpful, Your Data doesn't address underlying questions about whether users can trust that Google's controls actually do what the company claims.\"It never hurts for people to be reminded that their online activities are being monitored, but I’m not sure it would make anybody feel better about what’s being done with it,\" says Douglas Schmidt, a computer science researcher at Vanderbilt University who has extensively studied Google's user data collection and retention policies. \"A lot of criticism of Google is they appear to provide you ways of disabling stuff and then it doesn’t actually have that expected effect. They’re letting people know that they have a little more control or knowledge, which is helpful, but it ultimately doesn't get to the heart of the concerns.\"With so many Google services to keep track of, though, Your Data will at least provide a more direct route for users to access relevant controls rather than wading through settings menus. And for users who have never really thought about the reality of the data Google collects, a visual reminder could be a valuable wake up call.Thanks to an assist from Congress, your cable company has the legal right to sell your web-browsing data without your consent. This is how to protect your data from preying eyes.CNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}