{"id": "What Diane Greene's Departure Means for Google CloudWhat Diane Greene's Departure Means for Google Cloud", "paragraph": "Alphabet, the parent of Google, generated 86 percent of its revenue from advertising last year. On Friday, the woman leading its best shot at building a second big revenue stream said she is leaving.Diane Greene, a storied entrepreneur and cloud computing executive, has been leading Google’s cloud computing division since early 2016. Snagging her was seen as a good sign for the company’s effort to compete with Amazon and Microsoft in the booming business of providing computing infrastructure for other sites and businesses.Greene’s announcement Friday morning that she will move on in January is being read as the latest evidence that the project hasn’t gone as well as planned. Greene said she wants to spend more time mentoring and investing in women tech entrepreneurs. She will retain her Alphabet board seat.The new head of Google Cloud in January will be Thomas Kurian, who until September was a top executive at Oracle.Google’s cloud division made strides under Greene’s leadership, but Amazon and Microsoft have advanced their own more mature cloud businesses. Amazon essentially invented the business of renting out computers and storage by the minute or megabyte, and has cemented its dominance. The company has roughly a third of the global cloud market, according to Canalys, and that business contributes more to its bottom line than sales on Amazon.com.Microsoft has roughly half Amazon’s market share, but it’s growing more quickly than Google—which Canalys says has only 8 percent. The search company’s prospects now seem more challenging than ever. “When Diane Greene came in they had a really solid chance of being the No. 2 provider,” says Maribel Lopez, of Lopez Research. “Microsoft has really closed the gap and is the No. 2 provider for most enterprise customers by a significant margin.”A mechanical engineer by training, Greene started her career designing oil rigs. Industry rules forbade her from visiting them because of her gender, and she pivoted into computing. Greene sold her first startup and its video streaming technology to Microsoft for $75 million in 1997, and then cofounded cloud computing giant VMware, where she was CEO for 10 years.Hiring Greene was seen as a big fillip for Google. She was the kind of steady enterprise boss a company known for expansive data collection and quirky consumer services needed to lure customers in the buttoned-up cloud market.Greene positioned Google’s cloud division to be more independent from its parent, and lured customers such as Twitter, Target, and HSBC. She made expertise in artificial intelligence the platform’s calling card, building on projects like creating custom chips for machine learning.While the AI-centric strategy played to Google’s strengths, it didn’t help much with more boring workloads such as storage and website hosting that drive Amazon’s dominance and are the bulk of the cloud market. “They’ve been making the right moves and saying the right things, but it just hasn’t shown through in performance financially,” says Meaghan McGrath, who tracks Google and other cloud providers at Technology Business Research. She says Google is still hamstrung by a perception that it doesn’t really know how to work with corporate IT departments—an area where Microsoft has a long track record.Greene’s replacement in January brings skills to addressed that problem. Kurian was president of product development at Oracle and a leader of its cloud strategy. McGrath says he has a reputation for being expert at the kind of business positioning that Google needs to become more palatable to the big buyers in cloud computing.Produced by WIRED Brand Lab with Google Cloud | How Google Cloud Uses Multi-Layer Security To Protect BusinessesCNMN Collection© 2018 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices."}