{"id": "Red Dead Redemption 2 Preorder Bonuses, Special Editions Announced", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.Red Dead Redemption 2 is only a few days away, and if you preordered it digitally, you may already be able to preload the game on your console of choice. This means you can start playing your digital version the moment it goes live.All preorders of Red Dead Redemption 2 will include a War Horse and The Outlaw Survival Kit. The War Horse, previously seen in the first game, is a valiant steed with greater stamina and speed than your average horse. The Outlaw Survival Kit contains a collection of useful supplies including Dead Eye and items to replenish health.\n\nThose who preorder Red Dead Redemption 2 digitally on the PlayStation Store and Xbox Store also receive a cash bonus for story mode and an exclusive treasure map. However, to get the treasure map you must preorder by July 31.In addition, all digital preorders reward GTA Online cash. The Standard Edition rewards $500,000, the Special Edition rewards $1 million, and the Ultimate Edition will reward you a whopping $2 million.You can preorder the standard edition in the US from several different retailers.You can preorder the standard edition in the UK from the following retailers.You can preorder the standard edition in Australia from the following retailers.Tthe Special Edition includes exclusive content including a bank robbery mission and gang hideout in story mode, a dappled black thoroughbred racehorse, gameplay boosts, cash bonuses, discounts, special story mode items, free access to additional weapons, and the Nuevo Paraiso Gunslinger outfit.An Ultimate Edition is also available, including all the Special Edition content, plus additional bonuses for online such as outfits, access to the survivor camp theme, additional weapons, rank bonuses and a black chestnut thoroughbred.If you're a die hard Red Dead fan, a Collector’s Box is also available with a metal tithing box with lock and key, collectible challenge coin, double-sided puzzle, six shooter bandanna, treasure map, pin set, playing cards, cigarettes cards, and a Wheeler, Rawson and Co. Catalogue. It doesn't include a copy of the game, however, focusing solely on collector's items.Red Dead Redemption 2 is due for release October 26 on PlayStation 4 and Xbox One. If you want more details on what to expect from the highly-anticipated sequel, check out Red Dead Redemption 2: Road to E3.Vic is a freelance news writer for IGN. Often found force-feeding people The Sims or gifting PlayerUnknown potato bread. You can follow her on Twitter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}