{"id": "Daredevil Season 3, Episode 10: \"Karen\" Review", "paragraph": "Warning: The following contains spoilers for Daredevil Season 3, Episode 10. If you need a refresher on where we left off, check out our review of Season 3, episode 9.\"Mom lost again.\"Yes, \"Karen\" represents a pause in the story, somewhat, for about two-thirds of this episode, but that time is spent in giant flashback to Karen's tragic past and not our present day characters pacing, blabbing redundant dialogue, or hemming and hawing around the actual story.Boy, it's about time this series got around to illuminating certain aspects of Karen. Usually, all we get are Matt-centric trips down memory lane. In fact, even with all the mentions of her brother this season, I still didn't expect this much focus on her. Yes, I thought the brother stuff would resurface in a big way, but I didn't figure we'd actually devote this much time and effort to Karen's dark past.And it's damn great. Even though less would have been totally fine, this is still a splendid and unique diversion from the show's usual M.O. I'm so glad Deborah Ann Woll is our Karen because it's a delicate role to balance. Woll was always light-years better than her last show, True Blood, so it pleases me greatly that she has a part now that showcases her ability to present viewers with complexities and hypocrisies and subtitles like only she can. All three of Daredevil's lead characters are inherently polarizing, in fact, so kudos to our three main players for giving us severely flawed people who we're still drawn to and root for.Once the Karen-y part of \"Karen\" is over, the episode launches into a death trap: a ferocious and feral church battle that, as expected, easily out-classes the Daredevil/Bullseye church fight in the 2003 movie. Yes, Muay Thai fist ropes rule!\n\nDex hurls candles, rosary beads, collection plates, bibles - anything he can get his hands on. And you might think, from the lengthy backstory we're given, that this is all leading to Karen's death. As if she's being given the spotlight right at the end of her journey (which is a time-honored TV trick). Well, the true trick here is that she isn't going anywhere. Father Lantom takes the club to the heart that's meant for her, sacrificing himself to save her life. Which then allows her to save Matt's life five minutes later. It's a clever re-molding of Karen's death from the comics where she took a Bullseye club that was meant for Matt.So, we get yet another impressive battle between Matt and Dex while still slowing things down a bit to bring into focus the death of Karen's brother. Overall, there really isn't much present day story here except for Matt's choice to give up his chance to kill Fisk (yup, he's still on that train) so that he can save Karen, and the ensuing battle. The more dynamic character moments in \"Karen\" happen in the past - back in Fagan Corners, Vermont, with its failing diners and s***ty sheriffs and go-nowhere attitude.Obviously, Karen's not a drug addict now, but we can allow ourselves to wonder if her strung out past was influenced, at all, by Frank Miller's Born Again arc (as Miller usually preferred his female characters as drug-addled prostitutes). More likely, though, is that the show planned, from the very beginning, to give Karen these shadowy shadings and dark edges. She came into the story with secrets and a strong desire to \"do good\" as a hardly-veiled attempt to redeem herself for something. And this is why she's such a compelling character and has been from the start. Her will to do what's right outweighs both wisdom and fear. We didn't need to know why.Given all that happened though, with her mom's cancer, her father's (hey, it's Lee Tergesen!) frittering away of the family business, her \"loser\" boyfriend Todd, and her coke habit, it was ultimately wise of the series to hold off on showing these particular cards until now. That show of restraint over the past two seasons (plus her time on Defenders and Punisher), worked well for Karen as a character. And while, as mentioned, this type of hyper-focus can often signal a character's exit, once we see what she actually endured in the past and realize that she's still shunned for it, we need her to have a happy ending. It's not a guarantee, of course, but it would feel like some serious short-sheeting if she came all this way, and made all this effort to turn her life around, and wound up failing. Give Karen that win, y'all.Sidenote: I love how she and Matt take advantage of his super hearing by her whispering to him during the Poindexter fight.Not much happens in \"Karen\" with regards to present day story, but it still needs to be commended for giving us two things that, more often than not, work really well on TV: flashbacks and fighting. Here we're given a lengthy flashback featuring a hefty and heartbreaking performance by Deborah Ann Woll, that isn't so greedy that it takes up the whole episode, and a super sick church battle between iconic comic book foes.  Next up: Our review of Daredevil Season 3, episode 11.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}