{"id": "Pokemon: Let's Go, Pikachu and Eevee Review", "paragraph": "It's often with rose-colored glasses that I look back at Pokemon’s Kanto story, and I know I’m not the only one who feels a deep connection to the wooded region. It's where many long-time fans had their first Pokemon adventure, and it’s the region where I met one of my favorite characters of all time. It’s with great relief that, even when I consciously remove those glasses, I find something greatly deserving of that deep admiration when I look at Pokémon: Let’s Go. After about 40 hours with the Pikachu version, I put down my Nintendo Switch impressed with how well this reimagining of Pokemon Yellow matches my memories of my first adventure, albeit with a few major differences that almost all turn out to be for the better.Similar to Pokemon Yellow before it, Pokemon: Let’s Go starts you with either a Pikachu or Eevee before the team can set out on their adventure to capture more Pokemon, collect the region’s eight gym badges, and defeat the Pokemon League Elite Four. The opening scene with either Pikachu or Eevee is adorable, and I love how different turns in the story acknowledge that this is not the first adventure set in Kanto.The goofy Kanto trainers and denizens return in full force. Team Rocket’s James is as charmingly pathetic as I hoped, and my favorite trainer type, the Poke Maniac, is wonderfully eccentric. Each gym leader gets a neat reveal animation that gives even characters who have limited dialogue a more defined personality. The 3D animation suits Kanto well, especially with its vibrant color palette. The only hiccup with its presentation are consistent frame rate slowdowns in one corner of Viridian Forest.Let’s get down to the biggest and most important change: catching Pokemon. Generally, the shift to a Pokemon Go-style catching system works incredibly well for Pokemon: Let’s Go. Tossing one, two, or even a few Poke Balls at the Pokemon of my choice – and it excitingly is entirely my choice since all Pokemon are visible in the overworld – is, for the most part, a relaxing way to fill out my Pokedex. I was able to prioritize catching the Pokemon I actually wanted by simply walking into them to initiate the encounter, and likewise avoided the ones I didn’t want. Strolling through Mt. Moon and not encountering a single wild Zubat felt like a miracle.I was able to prioritize catching the Pokemon I actually wanted. Pokemon: Let’s Go offers enticing rewards for catching a bunch of Pokemon. Whenever you catch one, you’ll earn a score multiplier based on how you caught it, just like in Pokemon Go. Catching many of the same species in a row creates a combo multiplier, and as you catch more to build up the combo, versions of that Pokemon with better hidden stats (also known as IVs) and other rare Pokemon may spawn. Pokemon caught with a combo bonus will also drop more Candy – items needed for boosting specific stats, much like vitamins in past Pokemon games – and will likely earn your team more experience. It’s an addicting cycle, and I’ve started competing with friends to try to get the biggest combo.I appreciate that types of Candy – which boost Pokemon’s stats – aren’t distributed randomly but rather are associated with certain Pokemon. For instance, when it yields Candy, Raticate gives a type which improves a Pokemon’s speed stat. It’s great having a predictable way to earn such a valuable resource for buffing up my team.Knowing that Pokemon storage space and access is important, developer Game Freak made the smart change of making the Pokemon Storage System accessible through the main menu instead of locking it to a computer at Pokemon Centers. This allows you to transfer the excess Pokemon whenever you want to get more Candy from Professor Oak, just like in Pokemon Go. I do wish the Box had better organization options to make this process a bit easier, though.The new catching system isn’t without its issues, and the biggest of those issues stem from the way you choose to play Pokemon: Let’s Go. Playing with the Switch docked means using motion controls to simulate actually throwing a Poke Ball, which worked rather well with still and slower-moving Pokemon. Catching a Pokemon that moves erratically from side to side like Abra or Haunter, on the other hand, is an annoying feat when the Joy-Con and Switch don’t properly register your throws to the side. A berry can calm a Pokemon’s movement temporarily, but it was frustrating to waste a bunch of Poke Balls in the process. On the plus side, there is an added a small bonus multiplier for using motion controls that you can’t get while playing in handheld mode. That makes sense considering it’s far easier to land “Great” and “Excellent” throws that way because the handheld mode’s motion controls are mild and the center of the screen can be repositioned with the left Joy-Con thumbstick.\n\nAnother problem with catching Pokemon is the inconsistencies with the catch chance shown by a shrinking reticle. This is a big part of where Pokemon: Let’s Go’s catching system deviates from Pokemon Go’s, but in a bad way. The reticle shows a color to convey how likely you are to successfully catch the creature, but in the 40 hours I’ve played it’s felt inconsistent with higher-level Pokemon. For instance, a level 40 Raticate and a similar-level Magmar spawn in the same area, but I was able to catch the Raticate easily with a regular Poke Ball even though it displayed a red reticle, but couldn’t reliably catch the Magmar with an Ultra Ball showing a yellow reticle (and that’s the best Poke Ball you can buy). For a game boasting more approachability for all ages, this seems like a strange oversight.These problems didn’t discourage me from catching Pokemon, though. Sure, it’s easier in handheld mode, but the novelty of throwing a Poke Ball – especially with the cute Poke Ball Plus – makes me feel like I’m living out a real Pokemon adventure.You’ll catch many Pokemon on your adventure in Kanto, but Pokemon: Let’s Go makes sure you remember that this is not your journey alone. It’s immediately obvious that a lot of care went into shaping how to present Pikachu and Eevee as partner Pokemon. Yes, they’re incredibly adorable Pokemon to begin with, but their characters are shaped so well through short interactions. For instance, each time I shook my Joy-Con to see Pikachu or chose the option to interact with him in the menu, Pikachu almost always had some sort of cute reaction. One time Pikachu “chopped” me for attention. Another time I “caught” Pikachu trying to play a prank on me and I managed to startle him. Similar moments happen with Eevee. This is not Ash’s Pikachu, and it’s not someone else’s Eevee. This little buddy is here for you.This is not Ash’s Pikachu, and it’s not someone else’s Eevee. This little buddy is here for you. Cute company is not all these Pokemon offer, though: Their stats are incredible and their moves are amazing. Beneath their fuzzy exterior are death machines that can knockout entire enemy teams. They’re not invincible, but if you train them right they sure can get close to it. This is where the Pikachu and Eevee versions differ most. Pokemon: Let’s Go allows you to teach these special Pokemon even more special moves; for example, Pikachu can learn a fierce Flying-type move called Floaty Fall, which not only has an incredible animation that mimics Pikachu flying in the air with balloons like one does in the Pokemon Yellow opening, but also usually makes the target flinch. Pikachu can also learn a Water-type move and a neat Electric-type move. Both of their animations reflect past Pikachu’s accomplishments.Eevees moves are different, and maybe even better. It can learn a special move from each of its evolution types, which, in case you forgot, gives it access to Fire, Water, Electric, Ice, Grass, Dark, Psychic, and Fairy moves. That’s incredible. You could play through Pokemon: Let’s Go, Eevee! with just that partner Eevee and maybe another two Pokemon with ease thanks to its move flexibility. This means that if you choose to play that way, Pokemon: Let’s Go, Eevee! is potentially the easier version. It’s definitely overpowered, but considering this is supposed to be a unique, more accessible Pokemon game for new players, it’s actually cool.As with all Pokemon games, there’s nothing forcing you to use Eevee or Pikachu or any other Pokemon, and it’s certainly possible to get the two leads in bad situations, too. You can even remove them from your party if you want (but they won’t leave your trainer’s shoulder). I had fun playing through Pokemon: Let’s Go, Pikachu! without completely relying on my strong companion, but when it came to a fight I didn’t want to take it was satisfying to send out my pal to wreck my opponent.Even when they’re not on the field, Pikachu and Eevee can occasionally perform a special move that temporarily boosts all stats of a Pokemon you have in battle. It’s a shame this is only clearly conveyed and easily activated when playing with your Joy-Con disconnected from the Switch, though, as you have to shake the Joy-Con to activate it. As far as I saw, there’s no way to use it while in handheld mode.I also wish Game Freak had used Pokemon: Let’s Go to give Eevee more definition as a character. One spot I’d want to see change would have been with Secret Techniques, the marvelous replacement for HMs that Pikachu and Eevee learn to cut, surf, push, light up, and fly you through your adventure. The animations for the equivalents of Fly and Surf are directly pulling from past iconic Pikachu moments, and Eevee shares these animations and styles. Game Freak kind of leaves Eevee as the B version to Pikachu’s A. That mild disappointment aside, you’ll still have a delightful partner in whichever version you choose.Not once did I feel like I was missing out on battling because of the catching system change. Kanto is littered with trainers ready for a fight, and specialty trainers like Coach Trainers and Ace Trainers offer a nice challenge with tougher teams if you choose not to sick your adorable partner of destruction. Even against Pikachu or Eevee, some of the Ace Trainers can give you a satisfying battle.Even when I wasn’t using my ultra-powerful Pikachu, early on I almost always felt like I could steamroll any opponent so long as I had the right type matchup. This felt like it evened out after I got my third Pokemon badge, but still, the rock-paper-scissors battle system seems more extreme than ever. I felt like I trained a handful of Pokemon rather well throughout my adventure, but I was still surprised when they took out one of the Elite Four’s Pokemon in one hit. When Pokemon: Let’s Go says something is super effective, it’s not messing around. Again, this is supposed to be an easier Pokemon game, so I understand that this is trying to reward you more for using the correct type matchup. It’s not bad, just surprising.\n\nIn keeping this more approachable, I appreciated how areas around tougher trainers are designed. In the Rock Tunnel, for instance, I came across two Ace Trainers in a row. One is a mandatory battle, but the other was on an optional side path – and not far from those two was a free Super Potion. In places like these I could tell Game Freak sets is up for success without explicitly telling us what to do. That extra challenge is up to you, and I think trainers looking for more difficulty will appreciate it.Once a battle is over the loser will fork over some money, as usual, and this time around they give you a few Poke Balls, too. These two rewards are generally far more important than the experience your Pokemon gets from beating its opponent, so catching Pokemon smartly and building catching combos can earn your team far more experience faster than grinding through battles. This feels reinforced through battles since the defeated trainers essentially just give you resources to get back out there and catch more Pokemon. Both sides of this coin work in service of the other in your adventure to build a great team of Pokemon, and it makes for a delightful cycle.As a reimagining of Pokemon Yellow, there's a lot that's changed in terms of series staples beyond the capture system. You’ll come across items in different and often easier ways, but the most noticeable of these changes is the removal of the bike and fishing rod. I was worried at first that I had missed something, but eventually I found out that those items are replaced by the Pokemon in your party. I do wish that change would have been more explicit but, having spent some time with it, I do adore it. Each of the rideable Pokemon’s unique animations ranges from cool to hilarious, and I hope this feature is something we see again in future Pokemon games.Each of the rideable Pokemon’s unique animations ranges from cool to hilarious. The co-op feature is a nice addition as well. It’s reminiscent of Maggie Simpson’s toy steering wheel in The Simpsons’ opening animation in that the second player has something to do that seems important, but they’re not actually driving the car. A second player can join in at just about any time – excluding during Master Trainer battles – can’t initiate battles or Pokemon encounters and can’t talk to people, but they can help you catch Pokemon for an extra experience bonus and add another Pokemon to any battle you take that they get to control. This is a great way to help a new player in tough spots or give a younger player something to do while a more experienced player leads the way. One other big addition I’m looking forward to checking out is Go Park. Its new minigame and Pokemon Go transfer feature were unfortunately unavailable at the time of this writing, but the limited access I did have displayed a charming facility.With all its changes, the one part of Pokemon: Let’s Go that really seems to feel the strain of its additions is the user interface. The Pokemon Box change is fantastic, but its organization system is clunky. Shiny Pokemon don’t even have their odd coloring or any other special marking to indicate the difference between them and the rest of the Pokemon in the Box. Then, when catching Pokemon, changing the Poke Ball type or using a berry ends up being tedious because you have to go into your item menu each time you want to change Poke Balls or use a berry. Then, when distributing Candy to my team, it doesn’t show my Pokemon’s stats before being able to give it to them. I instead have to write down my Pokemon’s stats on a piece of paper to know which one needs Candy. The list of cumbersome UI issues goes on. They don’t ruin anything, but they do add up to be as irritating as it is to see a Magmar spawn – sorry, Magmar, but you’re one unfortunate-looking Pokemon.I placed my six Pokemon on the Pokemon League Champion pedestal as an undefeated trainer. Our nearly 40-hour adventure had a handful of tough battles, but nothing Max Potions or my superpowered Pikachu couldn’t handle. Even still, I was proud of my team. All the training we did during the main story wasn’t for naught, though, as far more difficult challenges wait in the post-game adventure. Even Max Potions and Revives couldn’t cheese my team to victory in the first serious battle I took in the post-game, and I suddenly felt like one of the kids I met early on in the Viridian Forest whom I crushed in just a few moves. My severe defeat was a pleasant shock. Even as the champion of Kanto, I still have a long way to go to truly be the very best of the region.\n\nIn addition to specialty battles like the one I lost, a major challenge in the post-game is defeating the Master Trainers, who each specialize in bringing one Pokemon up to a high level with great moves. For these battles you must use challenge them with the same kind of Pokemon and items aren’t allowed. If you win, you gain the title of the Master Trainer of that Pokemon. It is a silly reward, but it’s a great post-game task for completionists. I’m curious to see if anything happens if I’m eventually able to claim all Master Trainer titles. On top of that, some neat features are unlocked after you beat the story, and though I don’t want to spoil those I will say I’m excited to explore Kanto even more as I work toward training all my Pokemon to the best they can be.Returning to Kanto in Pokemon: Let’s Go, Pikachu! or Eevee! is almost as much fun and as heartwarming as I’d hoped it would be with its fresh, colorful design and new mechanics. Pikachu and Eevee are adorable, overpowered leads with the capability to learn some incredible moves, and they feel special both in and out of battle. The Pokemon Go catching system is a more relaxing way to fill out the Pokedex and grind for experience, and I never felt like I was missing out on battles because of it. Kanto is littered with charismatic trainers ready to fight. Some irritating UI design and issues with its motion controls add up to be a minor annoyance, but the addicting capture cycle and great challenges in the post-game keep me coming back to play. We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}