{"id": "The Best Black Friday 2018 Deals and Sales at Walmart ", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.The Walmart Black Friday 2018 flyer is filled with tons of items on sale, from laptops to toys, and Walmart's changing its hours to accommodate the holiday shopping rush. Participating Walmart locations offer hot chocolate and cookies between the hours of 4 am and \"whenever they run out,\" according to its Black Friday ad. Check with your local store to find out which hours it officially opens.Some Walmart's Black Friday sale begins on Thanksgiving, November 22, depending on where you live. You can beat the crowds by shopping online instead: Walmart's online Black Friday savings begin at 10 pm ET on Wednesday, November 21.The savings are unsurprisingly excellent. Among the biggest savings are the $199 PS4 Slim with Spider-Man deal, a 60-inch Vizio 4K TV for $498, and tons more Black Friday chances to save. Some of the deals are across the board, meaning Amazon's Black Friday deals cross over in some cases.Some states, such as Maine, prohibit retailers from opening on Thanksgiving, so check your local laws before you head out. For a complete look at the best deals and sales for Black Friday, check out our guide to what to expect from the best Black Friday sales this year.LIVE NOW:Sony PlayStation 4 Slim 1TB with Spider-Man for $199 (Live right now)List Price: $299Walmart's biggest Black Friday deal goes live tonight at midnight Eastern time. If you click on the link, there's a time to let you know exactly how much longer you have to wait to grab this awesome deal. The PS4 Slim Spider-Man bundle goes on sale in Walmart stores on November 22, so you can beat the rush and get one online later tonight.Walmart started early Black Friday deals on plenty of electronics, putting laptops on sale, televisions, and more ahead of next week's enormous, official Black Friday deals. Here are some of the best early Black Friday deals at Walmart.Get 12-months of PlayStation Plus for $39.99 (Live Right Now)This deal originally popped up on the PlayStation Store and now Walmart has brought its own price down to match it. This is a fantastic deal on a full year of PlayStation Plus membership. If you create a new account on Walmart's site and apply the code ELLEN10 at checkout, you can save an additional $10, however, your mileage may vary. We've tested the ELLEN10 code and as long as the account is new, it works, but some people have reported difficulty with it. Worst case scenario, you still get a year of PS Plus for $40!Samsung 55-inch 4K Smart TV for $398One of the best 4K smart TV deals going on right now. List price: $699NOW LIVE. List price $1200-$4800.NOW LIVE. List price $599.99.NOW LIVE. List price $1500-$2700.List price $2800-$4000.Sharp 55-inch 4K Smart HDR TV for $299This Sharp 55-inch set can be yours right now for $299. This early Black Friday price is good until November 17, or while supplies last.List price: $499/$399Red Dead Redemption 2 and $10 Xbox Gift Card for $59.89Get one of the best games this year and add $10 of free Xbox cash. Plus this bundled deal has free 2-day shipping so you can get it before Black Friday even begins. Today only, if you create an account on Walmart's site and use ELLEN10 you can get an extra $10 instantly. Dell G3 Gaming Laptop for $799List price: $999Intel Core i7-8750H, GeForce GTX 1050 Ti 4GB, 1TB HDD and 16GB Intel Optane Storage.HP Pavilion X360 Convertible Laptop for $529List price: $699Dell RVJXC 27-inch Full HD Monitor for $119.99List price: $199Lenovo ideapad 320 for $299List price: $399Dell Inspiron 15 5000 Series Laptop for $479List price: $529Here are some of the best deals coming to Walmart for Black Friday. These prices aren't live yet. The full Black Friday savings begin online the day before Thanksgiving, November 21, at 10 pm ET.Xbox One X for $399List price: $499Nintendo Switch Mario Kart 8 Deluxe Bundle for $299List price: $259List Price: $879Here are the specs on this Black Friday gaming laptop:Pac-Man Arcade1up Cabinet (Walmart Exclusive) for $249List price: $299Red Dead Redemption 2 Limited Edition Steelbook (Walmart Exclusive)This isn't a sale item, but an exclusive collectible edition of Red Dead Redemption 2. This steelbook for PS4 or Xbox One is only available at Walmart.Fallout 76 Limited Edition Steelbook (Walmart Exclusive)Here's another new-release AAA game with an exclusive Walmart steelbook. The Fallout 76 steelbook is available for Xbox One and PS4 with a Fallout 76 controller skin inside.One of the best deals in gaming is the Starlink: Battle for Atlas starter pack for $35. These packs have a list price of $74.99 and include everything you need to get started in the world of Starlink.A great new fighting game with one of the most ridiculous character creators around.The following games will also be available for $35 during Walmart's Black Friday sale.List Price: $39.99Get one of the funnest competitive shooters around for either Xbox One or PS4. The Legendary Edition has the base game as well as exclusive skins and other Blizzard bonuses.Here's the list of $25 games going on sale for Black Friday at Walmart, as listed in its Black Friday flyer.Some excellent 3DS games are part of the Black Friday $17 games list at Walmart, but plenty of games on all systems are represented.There are over 30 games at Walmart with prices set for $12 for Black Friday. Many of them are last-gen games, but have backwards compatible support on Xbox One. Here are some highlights:TCL 65-inch 4K Roku Smart TV for $398List price: $598Sharp 65-inch 4K Roku Smart TV for $398List price: $498VIZIO 60-inch 4K Smart TV for $498List price: $698Hisense 55-inch 4K Smart TV for $248List price: $429Hisense 40-inch 1080p TV for $99List price: $199Samsung 32-inch HD Smart TV for $178List price: $249More highlights from the Walmart Black Friday savings sale for 2018:For up-to-the-minute Black Friday deals and stock alerts be sure to follow IGN Deals on Twitter or Facebook, or subscribe to the IGN Deals newsletter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}