{"id": "Star Trek: Short Treks - \"Runaway\" Review", "paragraph": "Full spoilers follow for this episode. And yes, this review isn’t very timely, but let’s blame that on my running around at New York Comic-Con the week “Runaway” debuted. Read all my Star Trek coverage from that event here!Wow! It really felt great to see the USS Discovery back in action in the opening moments of this episode. Unfortunately, those first couple of minutes, complete with fancy new effects featuring a bustling shuttle bay, wind up being the most exciting part of the first of the Short Treks.The Short Treks, for those who aren’t aware, are a new initiative from CBS All Access to offer viewers a little bit of Star Trek in the months leading up to Season 2 of Discovery. One new short, running roughly 10-15 minutes, will be released each month over the next four months. This first installment, “Runaway,” focuses on Mary Wiseman’s Sylvia Tilly, promoted at the end of last season from cadet to ensign.\n\nAfter the business in the shuttle bay, where we first encounter the mysterious runaway of the title, the scene cuts to Tilly arguing with her mom over the holo-communicator. We’ve heard about Tilly’s overbearing mother before, and here we get a real taste of her not-great parenting style. Wiseman slips right back into the role of Tilly perfectly, and it’s terrific to see her again even as she’s dealing with the frustrations of Ma Tilly. Unfortunately, the scene as staged comes across as kind of odd in that we never see the elder Tilly’s face. The actress is only depicted in wide shots, and it seems that the producers of Discovery are choosing to keep her obscured so as to allow themselves room to recast the role with more of a name actress at some future point. But this choice distracts from what should’ve been an otherwise effective scene.Wiseman continues at Peak Tilly from there, screaming into her pillow and moving on to the mess hall where she orders a quadruple espresso and argues with the food replicator as usual. (When the computer warns about the amount of caffeine in the drink, she responds that it’s “my best friend so shush!”) And then she runs into the stowaway, played by Yadira Guevara-Prip, who we learn is an alien named Po from a species that recently became warp-capable.After some messy mess hall shenanigans that are perhaps less fun than they should be, Tilly and Po connect on a sort of mother to daughter/friend to friend basis, or at least that’s what the episode is hoping to accomplish. Po, we learn, is on the run because of the dilithium incubator she created, which has basically changed the status quo of her planet virtually overnight.Both actresses are good in their roles, and I’d certainly like to see more of them together at some future point. But as it stands, “Runaway” doesn’t quite hit the marks it sets for itself. We’re meant to see how Tilly, because of her meeting with Po, overcomes the anxiety her mother brings to her life, just as Po comes to realize what her true role in her planet’s development should be after talking to Tilly. The problem is, the episode is so short that it’s hard to really buy into the bond between the two that we’re being told is formed, and the back story of Po and her planet is confusing and rushed.Questions and Notes from the Q Continuum:Ultimately, “Runaway” is nice in that it gives us a quick dip back into the world of Star Trek while we wait for Disco Season 2. But it also makes evident the challenges of these shorts. Telling a coherent and effective story in 15 minutes or less is a very different thing from a 45-60 minute episode. Hopefully next month’s segment will improve on the formula.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}