{"id": "It's Now Easy to Get Pokemon's Most Powerful Card", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.If there’s one card in the current competitive Pokemon scene that could be agreed upon as the most powerful of them all, it would be Tapu Lele-GX. Though it might not look like much to the uninitiated, the combination of its Supporter-searching ability, dependable colorless-energy attack, and lack of weakness make it so strong that it’s a must-have for virtually every deck. Most players use at least one copy, but it’s not uncommon to see multiple copies in a deck. The 2018 Pokemon TCG World Champion used three in his deck. It’s just that good.The high demand for Tapu Lele-GX also means it was one of the most expensive Pokemon cards out there on the secondary market. Most competitively viable cards cost $5, $10, maybe $20 at most, but a single copy of Tapu Lele-GX could go for $50, and the rarer full art and rainbow versions could easily cost you over $100.But we’re talking past tense here because Pokemon has just released a new product that contains a promo of Tapu Lele-GX, the Pokémon TCG: Island Guardians GX Premium Collection. Players no longer need to open booster pack after booster pack hoping to get a copy of this much sought-after card when they can pick up this collection and be guaranteed a copy. With a more easily attainable version now purchasable in stores, the price on Tapu Lele-GX has dropped across the board. As of this writing, the market price for Tapu Lele-GX is down to $16.12, according to TCGplayer.com. (The full-art has dropped to $27.68 and the rainbow to $44.84, if you were wondering.)Image Credit: The Pokemon Company.The Premium Collection box retails for $49.99  and comes with promos of Tapu Lele-GX and Tapu Fini-GX, a Tapu Lele coin, an oversized Tapu Lele-GX card, a playmat featuring all four Island Guardians, and an assortment of eight booster packs. So in addition to getting Tapu Lele-GX, you also get a variety of other goodies along with it. Or you could head to the secondary market and pick up the single for cheaper than ever before.For more from the world of Pokemon, check out our thoughts on whether the real-life Pokemon in Detective Pikachu are cool... or creepy:\n\nJoshua is Senior Editor of IGN Comics. If Pokemon, Green Lantern, or Game of Thrones are frequently used words in your vocabulary, you’ll want to follow him on Twitter @JoshuaYehl and IGN.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}