{"id": "Luke Cage Cancelled: No Season 3 for Netflix Marvel Drama", "paragraph": "One week after Netflix pulled the plug on Marvel's Iron Fist, the streaming network has cancelled Luke Cage, IGN has confirmed.\"Unfortunately, Marvel’s Luke Cage will not return for a third season,” Netflix and Marvel said in a joint statement Friday. “Everyone at Marvel Television and Netflix is grateful to the dedicated showrunner, writers, cast and crew who brought Harlem’s Hero to life for the past two seasons, and to all the fans who have supported the series.”\n\nThe news comes the same day Netflix premiered Season 3 of Marvel's Daredevil, which has been earning rave reviews from critics. Luke Cage Season 2 didn't fare quite so well when it debuted back in June, with IGN noting that the season \"never quite finds its footing over the course of its 13 episode run.\"Although Iron Fist and Luke Cage are no longer in rotation, and a second Defenders team-up seems highly unlikely, Marvel and Netflix previously announced Season 3 of Jessica Jones and Season 2 of The Punisher, which are both expected to premiere at some point next year - although it remains to be seen whether Jessica Jones will last longer than its third outing, since showrunner Melissa Rosenberg plans to leave the series after Season 3.While Marvel and Netflix were cryptic about the possibilty of seeing Iron Fist in some other capacity in their confirmation of that show's cancellation (the statement read: \"while the series on Netflix has ended, the Immortal Iron Fist will live on\") there is no such wording in the Luke Cage announcement. But it's worth noting that the character is inextricably linked to Jessica Jones in the comics, and was introduced in Krysten Ritter's show, which theoretically leaves the door open for further crossovers beyond the bulletproof hero's standalone series.What do you think of Netflix's decision to cancel Iron Fist and Luke Cage? Do you think we might get a Heroes for Hire miniseries or Daughters of the Dragon spinoff? Weigh in below.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}