{"id": "The Darkest Superhero Movies Ever", "paragraph": "It's hard to believe, but there was a time when people didn't take superheroes very seriously. After all, we're talking about adults who dress up in costumes and beat up other adults in costumes. At its heart there is something fundamentally quirky about the concept.But one of the most beautiful things about superhero stories is that they have the capacity to be fun, and the capacity to be dark as hell. Once writers started exploring the psychological depths of why, exactly, people like to put on costumes and get violent, we started learning things about these superhero characters... and it isn't always pleasant.Bright and breezy superhero movies tend to make the most money at the box office, but there are still a lot of people in the world who prefer them to be dark and brooding. And sure enough, many of the best superhero movies ever made are exceptionally, even depressingly grim. Many of them star Batman, for perhaps obvious reasons. Heck, we had to change the rules a bit just to make sure Batman didn't completely dominate this list.So here they are, our picks for the darkest superhero movies ever made -- not just violent but cynical, mean, depressing motion pictures. Some of them can be taken seriously, others are big and broad, but they all represent the darkest points of the genre. And just to keep the list varied, we're limiting our picks to just one film per franchise (or, in the case of Batman, per iteration of the franchise). Enjoy... if you can.Tim Burton's first Batman movie convinced mainstream audiences to take a billionaire in a bat costume seriously, but the sequel took the dark side of the hero to an all-new level. The Penguin (Danny DeVito) plans to kill all the first sons of Gotham, and Catwoman (Michelle Pfeiffer) lashes out against a virulent, sexist corporate culture, led by the wicked Max Shreck (Christopher Walken), who wants to install Penguin as a corrupt, puppet mayor. Tim Burton set Batman Returns at Christmas but it's so dark and violent and cynical that it's like an antidote to holiday cheer.Zack Snyder's follow-up to Man of Steel took the darkest possible interpretation of the previous film's finale - that Superman was indirectly responsible for countless deaths - and ran with it, taking Superman to task and bringing Batman to the violent edge of xenophobic villainy. Meanwhile, all the brightest minds in the country argue that the existence of Superman is terrifying, the American government is acting like HUAC all over again, and Lex Luthor gloats about his false flag terrorist attacks with great big jars of urine. Now that's grim.\n\nWatch the video above for the best BvS Easter eggs!James O'Barr's gothic revenge fantasy, about a rock musician who comes back from the dead to avenge the brutalization and murder of his fiancee, is grim from the premise on up. But this time it has to be. The Crow is a violent tragedy, in which a good person gets driven to commit acts of (arguably justified) murder, against bad guys who are completely irredeemable. Alex Proyas films The Crow like the darkest music video imaginable, evoking German Expressionism in its depressing visuals and limited color palette, and in the extremity of its characters' emotions. Brandon Lee, who died in a tragic on-set accident, gives an iconically tortured performance that could have, should have, and almost certainly would have made him a superstar.Christopher Nolan's first two Batman movies were dark, but hopeful about humanity, arguing that evil can be thwarted and in the end, good can kinda-sorta prevail. The Dark Knight Rises explodes that idea by arguing that Bruce Wayne could have done more good as a billionaire philanthropist than as a costumed crimefighter, and by reducing Gotham City to an anarchic state in which the poor are enacting violent revolution against the wealthy. Sure, it's still a superhero movie and good kinda-sorta prevails, but society completely collapses under Batman's watch and Batman bears a lot of the responsibility.Let's set aside the debate about whether Judge Dredd is technically a superhero (obviously, we've decided to allow it). This is one oppressive movie, in more ways than one. Dredd (Karl Urban) is an agent of an authoritarian state, trapped in a building where everyone wants him dead, which effectively sidelines the morally quagmirous nature of his \"heroism.\" Dredd is one of the least bad people in the film, so we have no choice but to root for him as he kills scores of criminals with his psychic rookie partner Anderson (Olivia Thirlby) by his side. The seriously grim subtext and ultraviolent text of Dredd only highlights how much the cheesy Sylvester Stallone version missed the point.What if people actually dressed up as superheroes? Perhaps the most remarkable thing about Kick-Ass is that it makes that question sound revolutionary, even though it's the premise of every superhero story. Matthew Vaughn's film, based on Mark Millar's comics, places superhero tropes in an aggressively cynical and immature version of reality, in which people use superheroic tropes to justify murder and abuse, but seem totally cool with it. Kick-Ass and its sequel aren't just grim, they're twisted.Hugh Jackman's final outing as Wolverine (so we're told) is a dour and pensive dystopian Western in which almost all the other heroes have died, and the ones who remain are dying and filled with regret. One last opportunity to do the right thing presents itself, and we watch as Logan shakes off a lifetime of misery to make the most of it. Few superhero movies are as serious as Logan, and fewer still get away with it. This is one of the great superhero dramas.\n\nFind out what surprising scene Logan originally opened with in the video above.Every Punisher story is grim to the core, because Frank Castle isn't just a vigilante, he's a mass murderer and most filmmakers blend over backwards to be fine with that. Lexi Alexander's version of the character is one of the best, a gloriously violent but solemn antihero who accidentally kills the wrong guy and tries to atone for his sin. We're invited to revel in his cartoonishly over the top violence even as we see how little joy it brings him. Punisher: War Zone is half camp, half grim, and altogether one of the most distinctive Marvel superhero movies ever.It may not usually get categorized as a superhero movie, but he's a cop who gets turned into a robot with a secret identity who turns vigilante, so what else could he be? Paul Verhoeven's original RoboCop is a vicious satire of American consumer culture, in which the free market runs the police department and a simple contract can make your body property of a company that turns you into a weapon against your will. Wildly violent and mean-spirited, the original RoboCop makes the world as oppressive as possible in order to make even the tiniest victory against it seem superheroic.Before he directed the Guardians of the Galaxy movies, James Gunn directed Super, the superhero version of Taxi Driver. Rainn Wilson plays a man who thinks he's been touched by the tentacled hand of God, but who probably has lost his mind. So he puts on a costume and starts hitting people on the head if he thinks they're criminals. Along the way he picks up a sidekick who's more interested in the petty side of violence and the kinky side of cosplay, and together they learn the hard way that maybe they should never, ever have done this.M. Night Shyamalan's follow-up to The Sixth Sense is a brooding superhero movie, about a man who's lived his whole life never realizing his full potential. Bruce Willis gradually realizes he might have superpowers, but the revelation brings with it new and serious problems, and the one person who believes in him - a comic book merchant played by Samuel L. Jackson - isn't telling him everything. The dark side of superhero stories, by way of a dreary midlife crisis, and a relatively brilliant motion picture.\n\nWatch the video above to find out how Unbreakable finally got a sequel.Another dystopian superhero film, this one taking place in an Orwellian landscape where oppression and corruption and misinformation is rampant. V, played by Hugo Weaving, isn't fighting conventional criminals, he's taking his fight directly to the government, blurring the line between superheroism and terrorism and coming to uncomfortable conclusions about whether or not there's any meaningful difference. Oddly enough, this cynical film is a little more hopeful than the comic!Alan Moore and Dave Gibbons' superhero story Watchmen is generally considered one of, if not the best comic book ever made. Zack Snyder's adaptation abandons the subtlety of the text in favor of a bigger, punchier tone, but he keeps the ugliness of these characters, their tragedies, and their personal evils intact. This is a story about how people who think they're great frequently make terrible decisions that affect the whole world, usually for the worse. The film condemns many of these \"heroes\" even as it finds them utterly fascinating.What are your favorite dark superhero movies? Discuss in the comments!We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}