{"id": "Daredevil: Season 3, Episode 13: \"A New Napkin\" Finale Review", "paragraph": "Warning: The following contains spoilers for Daredevil Season 3, Episode 13. If you need a refresher on where we left off, check out our review of Season 3, episode 12.\"Today was the happiest day of my life.\"Well this is certainly a crazed, charged blaze of glory!Daredevil vs. Bullseye vs. Kingpin? Are you kidding me?All while Poindexter's trying to kill Vanessa and Matt keeps stopping him? This is pure malicious magic.And bloody magic too. In fact, funny to note, as soon as you see both Fisk and Vanessa wearing sheer white (with that trademark rose as a final touch) you can almost smell that things are going to get messy. It seemed like either Vanessa was going to get killed, spilling her blood all over Fisk while she dies in his arms, or Fisk was going to kill someone else and get that sinister splatter all over him. Hell, he could've even spilled celebratory nuptial meatballs all over himself, but somehow that garb was going to get ruined. Fisk, at his most powerful, at the happiest he's ever been, was going to face tragedy.The final fight is so powerful. Everyone's skill is on full display, from Fisk's pummeling strength to Poindexter's accuracy game to Matt's varied fighting styles (and pure grit). This is one hell of a three-way dance. And a really emotional one too. I didn't tear up per se (which I often do, easily), but I did get a sharp chill after Matt beat Fisk's face in and screamed \"I beat you!\" It's really thunderous and unexpectedly moving.\"A New Napkin\" stands tall as a really well-executed \"storm the tower\"-style finale. Whether or not Matt was going to kill Kingpin, ultimately, was at the heart of it, even though Season 3 gave us example after example as to why he probably should. Even Mahoney, at the top of this one, is perfectly content letting an anonymous person, who Foggy can't name, take a swing at Fisk for the greater good. In \"One Final Shot,\" Team Daredevil plays by the rules, even when we all probably would have forgiven them if they hadn't.So what makes Matt stray from his original plan? Well, all in all, it's a \"Catholic thing,\" as Foggy tries to explain to Karen. Face to face, given the precise opening he needs, Matt's never going to kill Kingpin. He may really want to, but he won't. He'll stand down. Of course, just to play things safe, in case we're all wrong, Foggy and Karen leak Nadeem's from-beyond \"dying declaration.\" This basically gives the story, and Matt, the out they need for Fisk to live. It's a little cheap, but it also makes Nadeem's efforts in \"One Last Shot\" feel fulfilling. Oh, and it lets us know that his widow and son are probably going to go on with their lives knowing he wasn't the terrorizing tool they briefly thought he was.Matt plays things smart in \"A New Napkin.\" He gets to Felix and then uses that intel to do what Fisk's been doing all season long: manipulate Dex. After he leads Dex to Julie's corpse, he uses Dex like a Trojan Horse to get into the hotel and crash the wedding. He just rides the warpath in. Then it becomes about getting to Fisk before Dex can.  There are a lot of moving parts and it makes for a uniquely exciting final fight - which is even more impressive when you consider all the great action this season. Granted, a huge part of the giddiness involved is seeing Fisk head into battle. He's the secret ingredient here.\n\nThe final moments of the finale, the 10 minutes of wrap up, following Fisk's fall from the glory are nicely peppered with happy moments and amends being made between Matt and Maggie. A nice eulogy for Father Lantom. The Nelson family business is going to be okay. It's almost too neat a bow. But look, we have to face the real scary possibility that this show might not come back for more. Any sour notes or warping of a clean finish might lead us toward a cliffhanger that won't get answered.\"A New Napkin\" gives us a solid and satisfying rebuilding of the team that got splintered back in Season 2. Dex pops up right at the end to tease us about going full Bullseye next time, complete with the costume and metal-laced bones (this time with something called Cognium, not Adamantium), but - look - that's not a full cliffhanger. It's a wink. A nudge. And \"Dr. Oyama\" is a jolly Easter egg in his own right, for comic fans who know him as Lord Dark Wind - inventor of the Adamantium bone-bonding process. Of course this show should return, but it may also be nice to leave our heroes at that table laughing and drinking over the idea of \"Nelson, Murdock, and Page.\" And Jessica Jones' instability.\"A New Napkin\" makes Matt work heinously hard for his redemption, taking the fight to Wilson Fisk with all of his friends' futures on the line. It perfectly uses Matt, Kingpin, and Bullseye for an incredible penthouse fight that will drop your jaw and make you cringe. It's a very rewarding capper to a season dominated by the return, and wretched rise, of Fisk. And even though Vanessa only appears in the final two episodes, Fisk's love for her is such a clean and clearly established driving force that it helps add the perfect amount of salt to his wounds.   We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}