{"id": "Fantastic Beasts: The Crimes of Grindelwald Ending Explained: Who Is Credence Barebone Really?", "paragraph": "Fantastic Beasts: The Crimes of Grindelwald positions itself as being out to answer the big question left hanging after the first Fantastic Beasts movie: Who, really, is Credence Barebone? If you’ve seen the movie, you know the audience definitively does get that answer, but not in the way likely anyone expected.Spoilers for Fantastic Beasts: The Crimes of Grindelwald continue below.The final scene of the movie has Grindelwald reveal the surprising truth to Credence about his true heritage: He’s a Dumbledore -- Aurelius Dumbledore, to be exact, and the brother of Albus Dumbledore. Grindelwald even has a phoenix to prove that this is Credence’s true lineage. A phoenix, he tells Credence, always appears to a Dumbledore in their time of need. If you’re anything like me, your first question after this twist was a big ol’ “HOW?” We’ll do our best to puzzle it out.Crimes of Grindelwald had a big misdirect leading up to its Credence surprise, as the movie makes the audience -- and characters -- think Credence was actually a missing Lestrange. Leta Lestrange revealed she actually caused the death of her half-brother, who everyone in the movie seemed to think was Credence. While traveling on a boat to New York, she swapped her brother with a baby from across the hall, who just happened to be this Dumbledore child. It’s still unclear how or why that Dumbledore baby was also traveling across the Atlantic.\n\nPuzzling out this twist gets a bit muddied when we try to fit the events and dates we know together. Albus’ parents were Percival and Kendra Dumbledore. They also had another son, Aberforth, and daughter, Ariana. The father, Percival died in Azkaban around 1890, and mother, Kendra died in 1899.Since Ezra Miller said Credence was 18 years old in Fantastic Beasts and Where to Find Them in a 2016 interview with SeaCoastOnline, that means he would have been born in either 1908 or 1909, which doesn’t line up. Warner Bros, however, has never officially released Credence’s age, so Miller’s comment shouldn’t be taken at face value. We can chalk it up to a continuity error or maybe there are more details at play than initially apparent -- in the Deathly Hallows novel, Aberforth said his mother taught them “secrets and lies” when they were growing up, after all. If we take the end of this movie at face value, Credence is a real, true Dumbledore sibling, but there is always the chance Aurelius didn’t have the same parents as Albus. If there was an affair, then maybe the illegitimate Aurelius was being taken away on that boat to New York to spare the Dumbledore family any controversy.It is hugely significant that it’s Grindelwald who found this missing Dumbledore, and his history with Albus could explain some of his obsession with Credence. Albus and Grindelwald were close friends when they were younger, and it’s largely presumed by fans that Albus had romantic feelings for his friend. Albus and Grindelwald hatched plans for wizarding domination, but 18-year-old Albus was responsible for taking care of his 14-year-old sister, who had been attacked by Muggles when she was a child and traumatized her to the point of having severe magical problems, something her family kept a secret. (Aside: Many fans have speculated that Ariana actually became an Obscurial, like Credence.) It was an outburst of magic from Ariana when she was 14 that caused the death of her mother Kendra.Only several months after Kendra’s death, when Albus was responsible for Ariana’s welfare, an argument between Grindelwald, Albus and Aberforth set off Ariana once again, and a rogue spell (which fans have deduced seem to have come from Grindelwald) caused Ariana’s death. Grindelwald fled from both the authorities and Albus, and their friendship ended there, though Crimes of Grindelwald revealed that there was a blood bond between the two former friends that still kept them tied together and prevented Albus from attacking Grindelwald as an adult.Could it be that Grindelwald sought out this new Dumbledore to try to form a bridge back to his old friend, or is he using him as leverage over Albus -- which would be especially timely now that the Hogwarts professor might know a way to break their blood bond? Considering Grindelwald said Credence can help him destroy Albus, it’s likely the latter. Those questions will likely be answered in the next Fantastic Beasts movie, along with another big one: Did Dumbledore even know he had a missing second brother?This last question does crack open a pretty huge plot hole J.K. Rowling will have to solve in the next three Fantastic Beasts movies. Why did Dumbledore never bring up his third sibling in any of the Harry Potter stories, especially since his tragic family history was such a pivotal part of the end of that series? It could be that Aurelius’s real identity never became public knowledge, or that Grindelwald was somehow lying (which we really hope isn’t the case), or even worse, Albus never found out.\n\nWe can presume that last option won’t come to pass and that Albus at least will know about his secret brother eventually. Our theory to back this up all hinges around that phoenix we see at the end, who looks a heck of a lot like Albus Dumbledore’s phoenix Fawkes. (Granted, we haven’t seen many phoenixes in these movies to see how similar or different they typically look.) We don’t see Albus with his signature flaming bird from the Harry Potter movies in Crimes of Grindelwald, so it could be that, after eventually confronting Aurelius, Albus comes to take the phoenix on as his own. Considering Newt’s affinity for magical beasts, could he be the one who brings Fawkes and Albus together? This is a Fantastic Beasts series, after all.That is our explanation of Fantastic Beasts: The Crimes of Grindelwald’s ending, but obviously there’s plenty of room to theorize about what’s ahead for Aurelius, Albus and Grindelwald. Let us know your take on this twist in the comments!Terri Schwartz is Editorial Manager of Entertainment at IGN and loves Harry Potter so much she has the Deathly Hallows tattooed on her wrist. Talk to her on Twitter at @Terri_Schwartz.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}