{"id": "The Kylo Ren Joke That Had to Be Changed for Ralph Breaks the Internet", "paragraph": "[EDITION NAME]The Kylo Ren Joke That Had to Be Changed for Ralph Breaks the InternetDisney’s first Wreck-It Ralph came out in 2012, the same week that the studio announced its acquisition of Lucasfilm. Which is to say, new Star Wars movies were barely a twinkle in the eye of the Mouse House at the time. But now six years have passed, which has provided the filmmakers behind the Wreck-It sequel Ralph Breaks the Internet plenty of Star Wars fodder to play with amid the film’s many nods to other Disney properties like Marvel and the Disney princesses.And yet, there was one particularly noteworthy joke that didn’t make the cut.As directors Rich Moore and Phil Johnston and head of story Josie Trinidad explain it, Disney declined to run with a certain Kylo Ren gag.“At one point we had a joke about Kylo Ren being kind of a spoiled child,” laughs Moore. “We went to Lucasfilm and said, here’s what we’re doing. And they said, well, we’d prefer that you don’t show him as a spoiled child. You know, he is our villain, and we’d prefer you don’t do that. So we were respectful of that.”It’s just part of the process, the filmmakers explain, but also the whole point of including beloved and familiar Disney characters in Ralph Breaks the Internet is to “honor who these characters are” and be appropriate to their history while taking “playful jabs.” Like C-3PO being the butler to the princesses, for example. That “felt like that’s of his character,” says Johnston. “It’s really loving satire that we’re doing.”“Mostly at our own expense, with our jobs!” smiles Moore.In Ralph Breaks the Internet, Ralph (John C. Reilly) and Vanellope (Sarah Silverman) have to leave Mr. Litwak’s arcade and venture into the scary territory of the online landscape in an attempt to find a replacement part for Vanellope’s game Sugar Rush. This leads to them discovering, to borrow a familiar Disney phrase, a whole new world… but it’s one that the two friends find themselves feeling very differently about.Check out all the Easter Eggs in the Ralph Breaks the Internet trailer above.“We definitely thought of Litwak’s arcade like a small hometown,” says Trinidad. “And these two country bumpkins from the small hometown are going to New York City, or Tokyo, or London, or all those three cities combined. At first it was, what fun are these two kids gonna have in exploring this great city? But ultimately what we realized was this is about the city sort of testing their friendship.”Vanellope starts to fall in love with the outside world while Ralph longs for the comforts of home.“He wants to kind of complete the mission and get back home and get back to life as normal,” says Moore. “But we’re not making a judgement about that, you know? It’s great that Ralph loves his home here, and it’s good that she likes what she’s discovering. So it’s really kind of an examination of, can two best friends -- who thought that they were alike in every way -- have varying kinds of points of view about life and still remain friends?”As Johnston points out, the team wanted to be sure to show both the “beautiful and also very ugly” sides of the internet. The good and the bad. “You could go on the internet and take a class on MIT for free, and you could also go and have someone tell you you’re an idiot for no good reason,” he laughs. Hence Ralph Breaks the Internet’s depiction of the Dark Web, which started with concepts like dark alleyways with signs for body parts, social security numbers, passwords, mother’s maiden names and so on. That’s where the character Double Dan came from, who can be spotted in the trailers for the film.Watch the full trailer for Ralph Breaks the Internet above.“It’s where Ralph goes to procure a virus,” says Johnston. “He makes a terrible choice, as Ralph does, and he goes and he meets this worm guy, Double Dan, who Alfred Molina does the voice for, who’s possibly my favorite character in the history of animation. He’s this giant, Jabba the Hutt-looking worm guy with a vestigial twin.”Dan’s twin is in his neck, and while he barely talks -- “Little Dan just squeaks,” says Moore -- there was a “Lady and the Tramp moment” between the two Dans that, alas, did not make it into the film.“They were eating a virus, and ended up kissing each other! It didn’t even end up in the cut,” laments Johnston.Since this idea was only boarded and not fully animated, it was easy enough to cut from the film. And that’s the key to the process. “Be wrong fast” is a catchphrase of Pixar filmmaker/legend Andrew Stanton, and so the storyboards are where the keep it or cut it decisions are largely made -- the part of the process where elements can be dropped without a big fuss.“I was like, I wanna see that!” says Trinidad. “Because I always want to try things. Because story is that, it’s disposable. And I don’t want to have this go all the way into animation and realize, okay, the Lady and the Tramp thing, it’s not working. I’d rather get it out really rough and really fast. We try it.”One thing that may yet be tried -- assuming this sequel does well enough to merit a third film in the series -- could be a 3D printed version of Ralph who actually exists in the “real” world. This is just the filmmakers spitballing ideas for now, but it is a concept that has been with them for several years now.“We went to South by Southwest, the technology conference, like four years ago when we were first starting talking about this movie, when 3D printers were just out,” says Johnston. “And I took a picture of us in front of a 3D printer and was like, this is the moment we got the idea for a movie! Ralph is going to 3D print himself, he’s going to go into the real world, and he’s going to be a real boy!”Ralph Breaks the Internet will be released on November 21, 2018.Talk to Executive Editor Scott Collura on Twitter at @ScottCollura, or listen to his Star Trek podcast, Transporter Room 3. Or do both!"}