{"id": "Best Black Friday 2018 PS4 Deals: PS4 Pro, PS4 Slim, Controllers, Games and More", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.Black Friday 2018 is nearly upon us and with it comes numerous sales in video games. PlayStation is no exception, of course, with the PS4 Slim 1TB Spider-Man bundle being one of the best Black Friday 2018 deals so far. We've been collecting the announced deals to let you know what to expect from the top Black Friday 2018 sales events, and we're adding the best PlayStation deals right here. There's still no sign of one of the most requested Black Friday 2018 deals, and that would be a Black Friday PS4 Pro sale. So far, there's no sign of one, but there are still some surprises and announcements in store for Black Friday 2018.Given the sheer volume of Black Friday 2018 deals, we've broken them down into categories like the best Black Friday 2018 TV deals, or the best Black Friday sales at Walmart, for example. Below you will find all the best deals on anything PlayStation related, with console bundles at the top of the list, followed by games and accessories. Default links will take you to Amazon, but if we spot other retailers with competing sales, they will get listed beside the default link. If you want to search for a specific item, make sure to use your browser's built in search function by pressing Ctrl+F.Note: This article will be continually updated until Black Friday has passed. Make sure to return regularly to spot the latest deals that have been added. Unless otherwise noted, these Black Friday deals haven't gone live yet.Get 12-months of PlayStation Plus for $39.99 (Live Right Now)This deal originally popped up on the PlayStation Store and now Amazon has brought its own price down to match it. This is a fantastic deal on a full year of PlayStation Plus membership. This Black Friday PS Plus deal is live right now at Amazon and the PlayStation Store, so go right ahead and scoop it up!PlayStation 4 Slim 1TB Spider-Man Bundle As of right now, this is probably the best video game deal of Black Friday 2018. You get a brand new PS4 Slim 1TB with a copy of the extremely excellent Spider-Man, all for $199. This deal looks like it will be at every retailer, too, so if one place is sold out you can always try another. This is also going to be an early Black Friday deal, going live on November 18 at most retailers.This is another Black Friday deal that's going out across the board. Pick up a new DualShock 4 in about a million different colors for $39.This bundle has two awesome games, camera, 2 Move controllers, and of course the PS VR helmet, all for $249.PS VR Astro Bot + Moss Bundle for $199Astro Bot Rescue Mission might just be the best VR game going right now. It's neck and neck with Tetris Effect. Moss is similarly charming, and this bundle is priced very nicely. It doesn't have Move controllers, but the good news is a lot of PS VR games don't require them.Red Dead Redemption 2 Limited Edition Steelbook (Walmart Exclusive)This isn't a sale item, but an exclusive collectible edition of Red Dead Redemption 2. This steelbook edition is only available at Walmart.Fallout 76 Limited Edition Steelbook (Walmart Exclusive)Here's another new-release AAA game with an exclusive Walmart steelbook. The Fallout 76 steelbook is available for Xbox One and PS4 with a Fallout 76 controller skin inside. ThereSoul Calibur VI for $35Soul Calibur VI is a fun fighter with an absolutely amazing character creator. It's almost worth full price just for that aspect alone. Having a fast-paced, deep fighter on top is like icing on a cake already made of icing.God of War for $21.99 at the PS Store Right NowIf this isn't everyone's game of the year... it will be in the top 5. Maybe top 2. I'd be surprised if it doesn't take it, honestly. And now it's on sale for Black Friday.Grab this PlayStation 4 exclusive on sale for Black Friday.Dragon Ball FighterZ for $17Brush up on your Dragon Ball character knowledge ahead of the Broly movie by smashing each other repeatedly in this fighting game.Dragon Quest XI for $35The ratio of enjoyment to cost with Dragon Quest XI is pretty astonishing.Shadow of the Tomb Raider for $35One of the best Tomb Raider games ever, the finale to an incredible series.Starlink: Battle for Atlas Starter Pack for $35This is normally $74.99, and for Black Friday it's getting a huge price drop. This is a really fun game, and the toys are actually awesome and can be appreciated beyond just the context of the game itself. Call of Duty: Black Ops 4 Standard Edition for $35If you buy this at Walmart for Black Friday, you also get 2XP so you can prestige much faster than your friends, which is what really matter during the Black Friday season.Assassin's Creed: Odyssey for $35Another strong contender for the best game of 2018. Grab this one on sale for Black Friday.Sony's official Black Friday sale has already kicked off, with the biggest draw being the $39.99 12-month PS Plus subscription.Here are some of the best deals going on right now on the PlayStation Store's Black Friday sale:Turtle Beach Ear Force 50p Headset for $25Looking for a low-cost, comfortable gaming headset? This Turtle Beach Ear Force is a low-cost way to improve your sound and comfort while playing PS4, and it's on sale for Black Friday.For up-to-the-minute Black Friday deals and stock alerts be sure to follow IGN Deals on Twitter or Facebook, or subscribe to the IGN Deals newsletter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}