{"id": "Best Black Friday 2018 Xbox One Deals: Xbox One X, Xbox One S, Controllers, Games and More", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.Black Friday 2018 is nearly upon us, and with it comes numerous sales in video games. Given how many games are out there, across the various platforms, we decided to break things down into three separate pages this year. Below you will find our continuously-updated guide to the best Black Friday deals on anything Xbox related, with console bundles at the top of the list, followed by games and accessories. All links will take you to Amazon, unless otherwise noted!With Black Friday almost upon us, we've put together an ever-growing list of all the best Black Friday 2018 deals, including Black Friday sales from Walmart, Amazon, Dell, and more. If you're looking to grab a new Black Friday laptop deal, or want to scoop up a new 4K smart TV on sale, make sure to keep checking our complete Black Friday coverage, as it's constantly being updated as new deals are announced or go live.For up-to-the-minute Black Friday deals and stock alerts be sure to follow IGN Deals on Twitter or Facebook, or subscribe to the IGN Deals newsletter.The deals below are not live yet, but we'll update this article as soon as they start going live, or if we find some early deals.Xbox One X 1TB for $399The Xbox One X is an amazing console and, coming in at only $400, makes it a steal for those who want to get into 4K gaming.Xbox One X 1TB Gold Rush Special Edition Battlefield V Bundle with Bonus 2nd Wireless Controller for $429.99 at Best BuyCurrently one of the best console bundles around, you get a 4K gaming machine, plus a bunch of Battlefield related goodies, including the latest game, Battlefield V.Xbox One S 1TB Minecraft BundleThe Xbox One S is a great way to jump into gaming, and with 1TB of space, there's plenty of room to expand in the future.Xbox One X Console + Call of Duty: Black Ops 4 + 2 Controllers for $562 at WalmartRight now at Walmart you can get an Xbox One X, Call of Duty Black Ops 4 and 2 extra controllers, all while saving $80! It's a steal of a deal, particularly for those who frequently find themselves playing couch co-op.Xbox One S Console Bundle + Call of Duty Black Ops 4 or Fallout 76 + 2 Bonus Controllers at Walmart for $365Walmart is also having a bundle sale on the Xbox One S! Get the console bundle of your choice, along with either Fallout 76 or Black Ops 4 and two extra controllers!Microsoft Xbox One Wireless Controller - $45Whether you need a new one, or you're picking up an extra for couch co-op, there is no better time than now as controllers are being discounted for nearly 50%!3-Month Xbox Live Gold Membership for $12.50Xbox Live has many perks associated with it these days, not the least of which is the free monthly games you get access to for being subscribed. Now, you can get access for even cheaper with discounts on almost all memberships.Fallout 76 - $59Explore the wasteland with friends in the latest version of Fallout. Find loot, build a base and conquer the wasteland!Red Dead Redemption II - $59The prequel to Red Dead Redemption. Set in a vast world, with dozens of hours of content, you can't go wrong this holiday when purchasing Red Dead Redemption II.Call of Duty: Black Ops 4 Standard EditionCall of Duty: Black Ops 4 drops the franchises single-player campaign and instead hits you with a triple whammy of multiplayer action in the forms of Battle Royale, Zombies and normal Multiplayer.Monster Hunter World - $29.99Monster Hunter World is a giant game, about hunting huge monsters with impossibly big weapons. Can it really get any better?Far Cry 5 - $35 at WalmartTake back America in this wild shooter, full of crazy driving, intense action and some of the strangest characters you'll ever meet.Dragon Ball Fighter Z - $37Taking the over the top action of Dragon Ball Z and merging it with a hyper-faster fighting game made for the perfect Dragon Ball experience, and is one no fan should miss.State of Decay 2 - $23The world is in shambles, the zombies are taking over and it's up to you to find survivors, build a base and last for as long as possible.Shadow of the Tomb Raider - $35Lara's latest adventure is also her hardest. Don't let anything stand in your way as you hunt for treasure in this action packed adventure game.Assassin's Creed OdysseyTravelling back to ancient times, explore Greece like never before in this sprawling world, full of loot, adventures and of course, people to assassinate.$35 Games$30 Games$25 GamesWe encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}