{"id": "How DC's Existential Masterpiece Helped Me Confront Fatherhood - Between the Panels", "paragraph": "Warning: this article contains spoilers for all 12 issues of Mister Miracle!When it debuted last year, Tom King and Mitch Gerads' Mister Miracle seemed to be a story about master escape artist Scott Free confronting the one trap he can't outwit: death itself. Even as Scott joined in on a massive cosmic war between the rival worlds of New Genesis and Apokolips, he faced the prospect that his very reality is a lie. At a certain point, readers are left to question if the entire series is some sort of fevered hallucination generated by the mind of a dying god.The series reached a major turning point midway through, however. Scott abruptly learns in issue #6 that his wife Big Barda is expecting, which hit home to me: this spring, my wife very matter-of-factly informed me she was pregnant with our first child as we were driving home from the grocery store one afternoon.Art by Mitch Gerads. (DC Entertainment)Needless to say, that qualifies as my most significant personal development of 2018. And like any parent-to-be, you can't help but react to that sort of news with equal parts joy and utter, existential dread. Scott and Barda respond similarly; the latter half of the series tells the story of two cosmic superheroes learning how to be parents even as they continue to fight for the very survival of New Genesis. And for me, suddenly the series was connecting on an even deeper and more personal level.King has rapidly developed into one of my favorite comic book writers over the past few years. His fundamental appeal as a writer is the way he finds an intimately personal connection with each of his characters, no matter how outlandish their world might be. In a way, that makes him the perfect writer to tackle one of Jack Kirby's most iconic DC creations. Kirby's work was all about contrasting the utterly fantastical with the mundane and ordinary. He conceived of Thor as an all-powerful god whom Odin bonded with a disabled human doctor in order to teach him humility. The Thing is a hero who experiences all the wonders the Marvel Universe has to offer, but at the end of the day he's just a blue collar schmuck from Yancy Street. And in this series, Mister Miracle rises to become the almighty ruler of New Genesis even as he and Barda constantly trade shifts back on Earth changing diapers and caring for their infant son.As time has passed, it's become more and more clear that Mister Miracle is basically a parable for raising a family in the 21st Century. At the end of the day, all the devastation on Apokolips is just a metaphor for the horrors unfolding in the real world. King and Gerads channel all of that in their depiction of Darkseid as the ultimate evil. \"Darkseid Is.\" has become the series' slogan, a phrase repeated over and over again throughout the story. There's no reasoning with or overcoming evil like this. It just is.The series reaches its dramatic peak in Mister Miracle #10 and 11, as Scott is given an impossible choice. He can bring a swift end to the war engulfing his home planet of New Genesis, but only by agreeing to hand over his infant son to Grandpa Darkseid. That impossible moral dilemma is basically summed up in a bizarre exchange between Scott and a random cashier in Issue #10.Art by Mitch Gerads. (DC Entertainment)This random encounter captures that collision between the high-concept and the mundane as well as anything else in this series. The lofty problems of gods become a simple intellectual exercise for a bored sales clerk. More importantly, it speaks directly to all my fears about trying to raise a kid in a world where there's so much uncertainty and cause for dread. How do you confront the inevitable impossible choices that face every parent? How do you weigh the good and the bad and choose the path that's going to result in the greatest good for the most people?It’s a question Scott is forced to grapple with many times throughout the series. Can he kill Granny Goodness, the closest thing he ever had to a mother, for the good of New Genesis? Is it worth sacrificing millions of foot soldiers for the sake of the war effort? When his brother Orion unfairly marks him for death, does he resist or turn himself in? None of us will ever be called upon to make these sorts of life-or-death decisions that alter the very course of the universe, but I imagine it feels that way to a lot of new parents.\n\nAs an expecting parent, I mostly crave reassurance that everything will be alright for my daughter in the end. As various people have reminded me, humans have been having babies for thousands of years, and most of them have done an okay job of raising them. But that's why it helps to have a story like Mister Miracle as a source of comfort. The series has been a constant reminder that no matter how dark the outside world gets, day-to-day life goes on. Even a cosmic war between two civilizations has to be put on hold so Scott can pick up a birthday cake. There are still diapers to change and meals to prepare and home repairs to undertake and rush hour traffic to slog through. It's true for humans, and it's true for gods like Mister Miracle and Big Barda.The series finale serves as its own source of comfort. Issue #12 shows Scott tormented by various ghosts of his past, figures who might not be literal ghosts so much as pieces of his psyche grappling with the difficult and uncertain road ahead. This issue avoids giving readers a definitive answer as to whether Scott's world is real or a hallucination. When given the chance to escape yet again and find out what lies on the other side, he makes the one choice he never considered before. He stays.Art by Mitch Gerads. (DC Entertainment)My takeaway from the series finale is that, whether cosmic hero or average Joe, there's only so much anyone can do to combat the evils of the world. You can't get so distracted by the worrying and the wondering and the second-guessing that you miss the life you have right in front of you. Escape isn't an option. You just have to push forward and hope for the best. All I can do as a new father is try to live by Mister Miracle's example.\"Between the Panels\" is a monthly column from Jesse Schedeen that focuses on the world of comics. You can see more of his thoughts on comics and pop culture by following @jschedeen on Twitter, or Kicksplode on MyIGN.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}