{"id": "Call of Duty: Black Ops 4 Review", "paragraph": "Hello Call of Duty fans! This year we're trying something new: because Call of Duty: Black Ops 4's modes are so different, we're reviewing them separately, followed by our overall review and score. You can read more about the review plan here. This part covers the entirety of Black Ops 4 – be sure to check out the individual reviews next. Call of Duty: Black Ops 3 flung the series into a thrust-jumping, wall running future. With Black Ops 4, we see this long-running series land in far more interesting terrain, even without a campaign. This year, Treyarch is leaning into robust multiplayer modes. Its excellent battle royale addition, Blackout, acts as a nice homage to everything in the Black Ops series. Combined with smart innovations to both Zombies and multiplayer, Black Ops 4 is a strong entry in the series. However, persisting technical issues and a number of already stale multiplayer maps hold Black Ops 4 back from being an even greater package.Though there are significant changes to each mode's formula, the biggest change is Black Ops 4’s lack of a classic campaign. This is certainly disappointing for some, but, for me, Black Ops 4 gets along just fine without it. With three solid maps and new modes, Zombies has a meaty launch; plus, Blackout and multiplayer have that attractive gameplay loop that keeps me drawn in. The multiplayer does get some narrative direction from the Specialist HQ, which serves as a good training ground for each of the multiplayer characters. Their introductory missions are laced with story cutscene. The story Specialist HQ tells is a little hard to follow, as there’s no specific order for the Specialists, but it’s neat nonetheless. Zombies also includes two storylines, though those are definitely harder to follow than a normal campaign because the story of each map is hidden behind Easter egg challenges.Each of Black Ops 4’s modes build upon the series’ excellent gunplay to provide uniquely enjoyable experiences Black Ops 4 unfortunately has a laundry list of technical and balance issues infecting each of its modes. For example, teaming up with friends in Blackout doesn’t always work correctly, and the Theater mode crashes regularly. However, Treyarch has been great about staying on top of those issues, continuously updating their blog with information on what they're actively looking at and fixing. This communication is important for a multiplayer game with a high life expectancy, especially at launch. I look forward to seeing how user complaints with equipment like the 9-Bang, general bugs in Zombies, and erratic spawn issues in multiplayer change Black Ops 4 in the future.Each of Black Ops 4’s modes build upon the series’ excellent gunplay to provide uniquely enjoyable experiences, all of which feel like they have room to be personalized in the direction of your preferred playstyle. Though they all also have unique flaws that detract from the overall experience, they’re occasionally ones Treyarch is at least aware of.  \n\nZombies, for instance, launched with more maps and even more customization options than ever before. It’s made for not only the most accessible version of Zombies, but potentially the most challenging, too. The new Rush mode offers an interesting, unique way to play Zombies by challenging players to rack up multipliers and zombie kills quickly.Here’s more from our Zombies review by Dan Crowd:This is the most confident and welcoming iteration of the Zombies mode yet. Black Ops 4’s Zombies is the showcase of a confident team that has iterated and improved the formula they created. The addition of a tutorial, a more streamlined single player experience, and a wealth of match customisation shows Treyarch wants everyone to experience what the studio has been perfecting for the last decade. And with the 10 year anniversary of Call of Duty Zombies looming, there’s never been a better time to grab some friends, chug an elixir, and see how long you can survive. \n\nThat exciting action I’ve come to love in the Black Ops series returns with a more tactical twist in the basic multiplayer mode. The Specialists, general weapon balance, and removal of automatic health regeneration make for a solid foundation for all of Black Ops 4’s multiplayer modes. It’s a shame, though, that some of its launch maps hold it back from being even better. When your best maps are remakes, there’s a problem.Here’s more from my multiplayer review:Black Ops 4 multiplayer features a great arsenal and versatile Specialists, but lackluster launch maps and bugs hold it back. Black Ops 4’s multiplayer lets players be more tactical without sacrificing the excitement of engagements. The reworked health system and Specialists offer great, mostly balanced tools that allow for more creative playstyles and cater to strategic teams and lone wolves alike. Just about every weapon class in Black Ops 4's arsenal feels like a viable option, too, though automatic weapons are expectedly as popular as they have been in the past.As good as these changes are, Black Ops 4 is held back by a few of its more narrow maps that feel stale after just a few playthroughs. Even worse are the unfortunate design choices around spawn areas that allow aggressive enemies to pick off players just as they're coming up. When these flaws don’t all align at once, though, Black Ops 4 keeps me coming back to work toward unlocking the cool Operator Mods for my favorite weapons and experimenting with loadouts in the fun new Heist mode. \n\nBlack Ops 4’s biggest addition, Blackout, may not be for everyone – it’s tense, death means an instant game over, and much of your game relies on the luck of your drop – but it is an impressive take on the popular game mode.Here’s more on Blackout from our review by James Duggan:Everything, from the creative equipment to the familiar Call of Duty locations, works remarkably well in the Blackout's dynamic battle royale space. In lieu of significant innovation, Call of Duty: Black Ops 4’s Blackout instead presents a remarkably polished and intuitive take on the basic battle royale formula with a first-person shooter focus. Everything from the creative perks and equipment to the familiar Call of Duty locations works remarkably well in the dynamic battle royale space, and some elements like the arcade shooting are even enhanced as a result of it. The plethora of technical issues ranging from simple fixes to more involved workarounds on PC are concerning, but ultimately didn’t stop me or my friends from playing and having a great time. I thoroughly look forward to playing Blackout for months to come, and hope that Call of Duty’s annualized release cadence doesn’t interfere with the frequency and longevity of post-launch support that I expect of the genre.Each aspect of Black Ops 4 introduces some great new ideas that continue to evolve the series. Active healing in multiplayer gives players more control and, paired with Specialists, it makes for a great tactical experience. The new heist mode is a wonderful palate cleanser, too. Zombies thrives from having more than just two launch maps; the beginner mode is a fantastic way to ease in to the tense action, while Rush keeps the maps feeling fresh. Blackout is the most exciting of the three, though. Instead of bringing some crazy twist to battle royale, Treyarch smartly uses the format to combine past Black Ops offerings into a fun, hectic mode that entices us to jump in over and over again. Black Ops 4’s rough edges do hold it back from an even better execution of its best moments, but when you’re not experiencing those technical issues, any of Black Ops 4’s three modes make for an enjoyable shooter experience that feel distinct and personalized.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}