{"id": "EVE FPS Project Nova Is Shooting for the Stars, But It's Not There Yet", "paragraph": "Project Nova is more of a sequel to the doomed Dust-514 than I’d expected. The last EVE FPS was an insanely ambitious shooter that intertwined platforms, meaningfully shared a universe and, well, didn’t quite work. Laudably, even having to prematurely shut down that particular experiment hasn’t dissuaded developer CCP from trying again.Even more laudably, the developer really wants to get that crossover appeal right, not just make a simple spin-off. Project Nova not only picks up on Dust’s story (it tells an ongoing tale of the elite clone troopers we were introduced to in the PS4 game), but aims, once again, to integrate with the always-fascinating EVE Online. Just not quite yet.CCP’s making very clear that it’s learned from the mistakes of Dust, where wild ambitions were prioritised over core sprint ‘n’ shoot principles, leaving a game that always felt as though it could have been incredible but never played well enough to justify your time. Nova, on the other hand, is far more measured in its early goals, with mixed results so far.\n\nAt its core, this is an FPS pitched somewhere towards the Halo end of the spectrum, nabbing the familiar rhythm of rechargeable shields and chipped-away health, and the longer time-to-kill stats that brings along with it. It’s a game clearly as much about smart movement and tactical thinking as it is twitch reflexes. That feeling’s extended with a small element of Tower Defence – taking control points on the map allows you and your team to build turrets of various types, bolstering your defence in one area to (hopefully) allow you to defend or attack another.It’s a solid foundation, and proof that CCP is putting gameplay first this time around. That’s backed up by the developer’s choice to initially work on just two modes. PvP (which I’m sadly not shown) will see two teams simultaneously transporting payloads to opposite ends of the map, while building turrets along the track and harrying the other.A PvE horde-style mode – which I do get to play – has waves of enemies (a return for EVE’s Sansha’s Nation faction) drop onto the exterior of a ship, while your team of four attempts to capture and hold control points across its hull, building up points until you claim victory, then complete an extraction to claim a maximum score.It’s challenging, hectic and, it must be said, unspectacular. What I played is an early build, so elements may change, but no matter how right it feels under the fingers, Nova doesn’t quite connect in terms of excitement right now. Sound effects are oddly muted (a space-magnum with exploding bullets shouldn’t sound like my oven door closing), enemies appear without fanfare and traipse across the gunmetal battlefield unthreateningly and even the act of evacuating at the end of a round feels lacking in peril.Given that I’ve criticised Dust for exactly opposite issue, it might seem a little “damned if they do, damned if they don’t”, but I can’t stop thinking that a solid foundation isn’t quite enough at this point. CCP does have wider plans for Nova – and even more hopes – but, crucially, I don’t see any evidence of them other than being told they could exist one day.It’s promised that Nova will bring a level of customisation to suit even EVE players, creating custom clone trooper builds piece by piece from hundreds of options. But what I see are the game’s introductory classes, built more like the set heroes currently in vogue in FPS games. I’m told those defensive turrets can also be wildly different (not to mention potentially customisable themselves) but, again, I see three variants; chain gun, rocket and EMP, none of which feel particularly surprising.I don’t play long enough to see the game’s approach to procedural variation – while maps will be completely static, the control points on them will move around, and the number of turrets that can be deployed at each will change. It should mean teams can never fully master a map, but the changes I actually saw were minimal. On a more cosmetic level, I’m told that the skybox will generate bespoke space battles, which will rage above your match using EVE’s hundreds of ship types as fodder. Honestly, I wish I’d seen how that could play out, because it does sound brilliant.I’m told about more mode variants, the addition of ‘champions’ for factions, and expansions every three to six months. But the key missing piece is in how the game will tie into EVE Online. CCP’s clear that it will no longer attempt Dust’s real-time integration with EVE, instead wanting to reach a position where Nova can asymmetrically work alongside the spacefaring MMO. But, from the sounds of it, that won’t come for some time, even after launch.\n\nCCP plans to wind the two games around each other slowly, beginning with social or economic benefits, before attempting anything more unusual. This is a fairly vague premise right now. Senior director Snorri Árnason is only willing to talk about ideas of how this might work. You might have a ship scrapped in EVE, but be able to drop onto it in Nova and salvage otherwise lost modules during PvE, for instance. You could be able to target specific players’ or corporations’ ships in EVE, sabotaging them in Nova. There are fascinating possibilities – it’s just unclear which ones will ever make the cut.I mention to Árnason that much of what we’ve been told feels more like a promise of what Nova will be one day, rather than on launch day. A little surprisingly, he agrees: “It has to be,” he explains, “because there's no way to make this game on day one. It's just not possible. We wanted to make the gun game great, then people get faith in that and say 'OK, this could be a long-term game', [and then we] start building cool features on top of that.”So is the goal that this starts as a simpler shooter, and becomes a more complex EVE tie-in later? “That’s the dream.”This is, of course, a game without a final name or a release date. The pre-alpha build I played may show a solid if unremarkable game right now, but CCP’s wilder plans at least make it clear that what I saw may be very different to what the general public ends up playing. I hope so, as a game released on the promise of what will come later might find it hard to build up an audience in the first place – I don’t want it to be that kind of a sequel to Dust.Joe Skrebels is IGN's UK News Editor, and he wants to sabotage your expensive ship one day. Follow him on Twitter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}