{"id": "10 Awesome Switch Games For Under $10", "paragraph": "It’s payday and you just got paid! You’ve got a Nintendo Switch, and now it’s time to spend that money. You buy groceries, pay your phone bill, pay your rent, pay your internet bill, and now it’s time to ball out and buy some Switch games... with whatever money you got left.Ten dollars. That’s... not a lot of money. But don’t worry! We’re gonna make it work. Here are the best 10 Nintendo Switch games you can buy for under ten bucks.As close as you can get to making a Bomberman game without getting sued!The real Bomberman on Nintendo Switch is forty dollars. You know what isn’t forty dollars? Ten dollars. Bombing Busters is basically bootleg Bomberman, or if you wanted to be Bomberman for Halloween but didn’t get your costume together until the morning of Halloween. It’s got a full 30 level single player campaign with power-ups and stage bosses and also a classic Bomberman-style multiplayer mode where you and your friends try to blow each other up. And you’ll still have three dollars left to spend on whatever you want! Ball out, baby. Buy some gum or something crazy.Relaxing, zen-like block stacker that only sometimes makes you want to throw furniture.Art of Balance last appeared on the Wii U which means two things: you probably missed it, and it’s legally required to be ported to Switch. This physics-based puzzle game is pretty brilliant because it doesn’t force you to choose a single solution, which means lots of experimenting and lots of your blocks falling in the water and you losing and starting over. You can also race to the top in split screen multiplayer and try to be the first person to scream at the television when your entire world collapses. It’s a really chill game.Four bite-sized retro Zelda-style action RPGs in one cheap download.Nintendo Switch has Breath of the Wild, arguably the best Zelda game ever made. The Fairune Collection is not that game, but it’s also four games at a fraction of the price, so it sort of makes up for it. This top-down Zelda-inspired game collection is just as much of an action RPG as it is puzzle game and there’s enough content to hold you over until Nintendo drops the price of Breath of the Wild, which knowing them is probably never. Also, it stars a girl, kind of like Zelda – who is not the star of Zelda, because that’s Link, who is a boy. Many people get confused by this.Intelligent picture puzzler that you also might totally fall asleep playing and that’s OK.What if – and hear me out – instead of looking at rudimentary pictures of everyday household objects, you had to slowly reveal those pictures using a series of rules and counting techniques? It sounds boring, but this game is really smart and rewarding and also almost too relaxing. And with dozens of puzzles and plenty of modes, there’s lots to do here, assuming any of this is something you want to do, which you should, because it’s good! I swear! Just believe me! Hey, wake up!Wordy roguelike action platformer with giant turd worms that keep killing me.Finally, a roguelike Metroidvania action platforming game on Nintendo Switch. I was hoping we’d finally get one of those! Just kidding, that’s like, 80% of the Switch’s library. Hyperbole aside, Risk of Rain is one of the best games in its genre and an absolute steal at ten bucks. Risk of Rain drops you into a procedurally arranged nightmare hell that gets more difficult the longer you play it. There are tons of items and stacking them and organizing them to your heart’s content will help you customize your build and survive until you’re killed by something large and horrible and you try again. Risk of Rain is so good you’ll want to make it rain.*cut to shot of me gently dropping a handful of coins*Sorry about that.Shamelessly bootleg Mario Kart-inspired multiplayer racing with Dollar Store Sackboys.It’s Friday night, you worked all week, and your friends TJ, Big Bob, Lolo, and The Gooch are coming over to party and play Mario Kart. There’s just one problem: you spent all your money on party supplies and you can’t afford Mario Kart because it’s sixty whole dollars and you only got ten. Well watch out, because here comes Beach Buggy Racing – AKA Broke Ass Mario Kart. Instead of items in question blocks, it has question orbs! Instead of karts, it has cars! And instead of classic, iconic characters like Super Mario and Princess Peach, it has… weird people that look like they’re made out of potatoes. But hey, it’s $10 kart racing on a budget, even if it’s definitely not Mario Kart.Top-down arcade shoot 'em up where you shoot them up by shooting upwards.Most shmups hook you by forcing you to memorize insane bullet hell patterns and then punish you by blowing you up if you don’t. Sky Force has a bit of that, but it also builds on that loop by adding an incredible progression system, lots of unlockable ships, ship parts, objective bonuses, and trophies. On top of that, it urges you to replay levels with different requirements, like avoiding damage or rescuing the people who are stupid enough to stand around in an active warzone. With tons of levels, secrets, and challenges, it’s one of the most infinitely replayable shooters on Switch.Yes, they actually made a good Mighty No. 9 game and nobody noticed.Please try and forget everything about 2016’s Mighty No. 9 – I know I still am. Mighty Gunvolt Burst is the actually, genuinely good Mega Man style game starring Mighty No. 9’s Beck and guess what? It’s a totally hidden gem on Switch for just under ten bucks. Mighty Gunvolt Burst not only manages to just totally nail that vintage Mega Man aesthetic and feel, it actually kind of does so better than Capcom’s own Mega Man 11. It’s got evil robot masters, awesome chiptune music, great power-ups, and a perfect 8-bit aesthetic. And best of all? It’s not Mighty No. 9.Do you remember this action platformer franchise? Congrats, you are 40-years-old.In 1988 on the NES, a game called Blaster Master dared to ask the question, “What if somebody made a video game about a kid who chased his pet frog down a hole in his backyard and accidentally found a giant mech tank that he used to battle nightmare subterranean monsters?” Video games were weird back then. Anyway, Blaster Master is back on Switch, and the series signature blend of side-scrolling shooting and top-down exploration is back, only this time Shovel Knight is here too, because he shows up in practically every indie game. Giant bosses, DLC, and a meaty single player campaign await you here, all for under a tenner.It's basically Dirt Metroid but with weird pickaxe cowboy gremlin people.SteamWorld Dig 1 and 2 are hands down some of the best games on Switch and since SteamWorld Dig 2 is outside of our ten buck price range, SteamWorld Dig 1 is the perfect place to start. This is a Metroid-style action platforming game where you carve your own path through the world using steampunk mining equipment and clever platforming skills. Instead of side scrolling, most of your time is spent digging downwards into the earth, uncovering treasures, secret caves, and bad guys. Bring your collected loot back up to the surface and trade it in for upgrades, then go back down and do it again. It’s an incredibly addictive loop in a game you absolutely shouldn’t skip, especially for ten bucks.Any great, cheap Switch games we missed? Let me know in the comments. I actually read them all, a hobby that brings me both immense joy and immeasurable sorrow. If you like this article, good news! I’ll be making more of them! I’m Brian Altano and this is The Switch List. Thanks for reading.\n\nWe encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}