{"id": "Battlefield V – Multiplayer Review", "paragraph": "Welcome, Battlefield fans! This year, we've broken up the review into its single-player and multiplayer components to give fans of each style of play a better idea of what's up. This review covers only the multiplayer mode – read the single-player review here, and stand by for the overall Battlefield V review, coming soon. With all of the development muscle behind EA DICE’s massive shooter, I didn’t expect going in that playing Battlefield V’s multiplayer would feel so much like discovering a very promising early access game. It appears that there’s a sizeable number of modes and major bug fixes still to be delivered. To its credit, a cavalcade of clever gameplay changes succeeds in taking the series’ standard 64-player warfare in a more tactical direction, but the execution of this long-awaited return to a World War II setting simply feels rushed. Still, there's plenty of dynamic FPS fun to be had in the Battlefield V of today, and it’s the kind of shooter I could see becoming one of the best in the series’ history after some substantial updates.\n\nThese changes aim to emphasize teamplay, satisfying gunplay, and immersion. Across all of its current multiplayer modes, Battlefield V’s default mechanics take a bold step toward the hardcore. Health regeneration is limited, the time to kill is reduced, and the spotting system is almost entirely removed. And while some of these changes feel like a Band-Aid being ripped off, Battlefield V is a better shooter because of them. After all, the revisions are more thoughtful than simply adopting all of the hardcore rules. For example, while time to kill is generally faster, sniper rifles deal less damage than ever before, lending a snappier feeling to gunplay without excessively disrupting the classes’ balance of power. And in lieu of the entire removal of 3D spotting, only a handful of gadgets and certain combat traits can now place that infamous red circle over enemies’ heads. This change helped me stay engaged with Battlefield V’s gorgeous environments instead of playing the HUD. On the whole, these changes aim to emphasize teamplay, satisfying gunplay, and immersion and all of them find their marks.The incentives for coordinating with your four-person squad are borderline coercive. Lost health no longer regenerates past a certain point without a medkit (you can only carry one unless you’re a Medic), and ammunition reserves are less abundant - most weapons are sustained by only two extra magazines to start, making a Support teammate a very welcome ally. The scarcity of these vital resources, collectively dubbed the “attrition system,” succeeded in making me go out of my way to work with my squad, but felt a little heavy handed at times. I often found myself S.O.L. when it came to recovering lost HP, which is certainly realistic, but retreating in search of a friendly medic or supply station rarely leads to any interesting moments. Being able to scavenge ammunition from enemy corpses, on the other hand, encouraged me to take a lot of fun risks.The ability for anyone to revive a squadmate, regardless of class, is another welcome incentive to stick together. Glitchy and awkward though it may be, the lengthy new animations give revives a much-needed nerf by making the action riskier and more deliberate. Medics are still valuable, though, because they can revive allies faster and aren't limited to only reviving their squad members.Class identity in general in Battlefield V is remarkably well defined, thanks in no small part to the attrition system. When you’ve experienced the agony of going minutes on end with less than half your HP or running out of ammunition seconds after finding an excellent vantage point, the prospect of an infinite supply of medkits or ammo pouches feels like a bona fide superpower. Combat roles attempt to mix things up further by giving you the option of choosing between two archetypes, but the passive bonuses each confers are so minor that the entire system feels like an afterthought. The 37 firearms of Battlefield V feel fantastic. Across the board, the 37 firearms of Battlefield V feel fantastic. Pronounced and predictable recoil replaces the random-feeling spray of Battlefield 1. Each class has access to an assortment of seven or eight primaries that, with the exception of Medics who only wield SMGs, present a variety of playstyle options. The Support class possesses the greatest variance with access to shotguns, LMGs, devastating MMGs that must be deployed to aim, and the FG-42 which (in Battlefield V, anyway) behaves like an assault rifle. The MP 40 and Sten Gun are nearly identical mechanically, but other than that every weapon I’ve used thus far feels distinct.One big change to how the weapon customization system works is that every scope and sight available to a weapon comes “standard” without any additional grinding necessary to unlock multiple variants of the same gun. I find this to be a thoroughly thoughtful touch as the sight picture can sometimes make or break my enjoyment of a freshly unlocked gun in an FPS. \n\nBattlefield V introduces a specialization system which, in theory anyway, allows you to further tailor a weapon to your preferred playstyle. Unfortunately, most of the choices are uninteresting statistical improvements, exemplified by the numerous options to reduce recoil. The irony is that this progression system diminishes the perceptible effect of Battlefield V’s brand-new recoil system. The result is that the only times I really gave a damn about the specialization system were when I unlocked the 50-round drum magazine for the Thompson SMG and the bayonet for the SMLE. I’d prefer fewer choices here with more meaningful impact on the gun you’re tweaking and its gameplay. Vehicle specializations are generally much more alluring, offering meaningful and visual alterations.I’m a big fan of cosmetics that tell the story of their acquisition. The most rewarding part of Battlefield V’s weapon progression is, surprisingly, aesthetic in nature. The skins earned from the mastery assignments (increasingly difficult challenges like getting hip-fire kills on an objective) are fun to unlock and fun to show off. I’m a big fan of cosmetics that tell the story of their acquisition, especially when that story is something other than “I paid for this.” Overall, the customization system does its job of flaunting your achievements and offering visual variety for both your weapon and character without coloring too far outside the lines of Battlefield’s somewhat fantastical historical setting. The flashiest thing I’ve unlocked after 60 hours is a gold-plated MP 40. Battlefield V boasts 26 era-appropriate vehicles, a number that absolutely dwarfs its predecessor’s paltry eight at launch. And yet part of me misses the rampant chaos caused by the admittedly overturned cavalry, elite units, and behemoths of Battlefield 1. Tanks can be fun, and whizzing around in a Spitfire is neat, but I can’t help but feel that the relationship between vehicles and infantry in Battlefield V is overly binary.I’ve never enjoyed hate-picking the Assault class to destroy enemy armor, but since Battlefield V’s tanks are much more difficult to avoid than their BF1 ancestors, that’s exactly what I found myself doing. Similarly, you will be bombed. And when you are, you will either choose to bring your current objective to a grinding halt to track down an anti-aircraft gun or tank, or just keep going and accept the bombings as part of life. \n\nThese issues are compounded by the fact that Battlefield V currently offers no practice mode to hone your skills in these first-come, first-served vehicles. I would love to take a Spitfire for a few practice spins against a bot instead of spam-clicking the plane spawn icon for minutes on end to get any time in the cockpit (and the single-player campaign barely provides any opportunity to fly or drive, either). Battlefield V offers eight maps at launch, and while I’m not a fan of the extensive labyrinth of identical unfurnished apartments in Rotterdam, I felt the other seven maps to be quite enjoyable. Fjell 652 takes place on a high-altitude Norwegian mountain overlooking the entirety of the Norvik map and is subject to intense and atmospheric snowstorms. Twisted Steel is built around a massive bridge that serves as both a spectacular landmark and a functional mechanism to add a linear lane to the map’s familiar open environment speckled with rural villages. Building is a welcome inclusion but has a far smaller impact on gameplay than I was expecting it to. Fortifications can be constructed on any map and are situationally useful, but sandbags evaporate after being hit with a single explosive, so they’re often more trouble than they’re worth to set up.\n\nUnfortunately, even the good maps don’t always stand up to the test of being ported to seven different modes spread across three playlists. The modes themselves are all over the place, especially in the infantry-focused playlist where Frontlines lasts many times longer than TDM or domination. There’s a particularly messy potion in Frontlines on Twisted Steel where the defending team has a clear vantage directly into the attacker’s bomb spawn. On more than one occasion on the Frontlines version of Narvik I spawned outside of the boundaries, at one point resulting in an unavoidable death due to \"desertion.\"Battlefield V is frankly riddled with bugs. And that’s part of a disappointing trend because Battlefield V is frankly riddled with bugs. Some are of the superficial and even comical variety (like watching the corpse of an enemy you’ve killed launch 50 feet in the air for no reason), but quite a few others have a major, at times game-breaking impact. In total, I’ve had to exit a match or relaunch Battlefield V more than a dozen times in my 60 hours because of menus getting stuck open with no way to close them or match timers or objectives bugging out. The all-too-frequent appearance of minor glitches and sticky geometry conveys a general lack of polish.The feeling of getting in on the ground floor of something that will inevitably much better mere months from now is unavoidable while playing Battlefield V’s multiplayer. Squadplay and infantry combat in general is taken in a very worthwhile direction with smart tweaks to guns and resources, but the same care hasn’t been applied throughout. Rampant bugs, wildly varying mode times in similar playlists, and half-baked features like Combat Roles take their toll. The good news is that patches are already rolling out, and with a year or more of free maps and modes on the way, Battlefield V can only get better from here.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}