{"id": "In Wake of Red Dead 2 Crunch Discussion, Rockstar Office Now Explicitly Told Overtime Is Optional", "paragraph": "Surrounding the controversy of Rockstar employees working mandatory 100-hour work weeks during the development of Red Dead Redemption 2, a UK-based office, Rockstar Lincoln, has decided to switch their system of mandatory overtime to voluntary, according to Kotaku.Kotaku originally heard from six sources and was told differently from Rockstar's head of Publishing, Jenn Kolbe, that overtime was never mandatory, but was part of a system that involved requesting and scheduling overtime by bosses – but that employees could always say no.\n\n(Make note that we spoke about the controversy on this week's Beyond! episode, but it was filmed before Rockstar's policy of letting people speak openly was revealed.)“Through the conversations we’ve been having it is clear to us that the requested scheduled overtime felt like an obligation to some, if not many, of the team,” Kolbe said. “We therefore spoke to them to make sure it is clear that the OT is not mandatory.”The decision is a direct result of multiple employees speaking freely of the overtime requirement for Red Dead Redemption 2, which was first mentioned to Vulture by Rockstar co-founder and Vice President of Creativity Dan Houser.“We were working 100-hour weeks,” Houser said, which immediately gained traction on social media Monday. The Rockstar employees Kotaku heard from said the Lincoln studio was one of the worst in terms of the company's forced overtime.A QA tester from Rockstar Lincoln posted a piece to Reddit on Friday detailing their experience with overtime.The poster broke down how overtime works at the Lincoln studio and clarified that all employees do get paid for their overtime, but that until now, it was always expected of them.\n\n\"If we are not able to work overtime on a certain day without a good reason, you have to make it up on another day. This usually means that if you want a full weekend off that you will have to work a double weekend to make up for it,\" the Reddit poster said.The poster then wrote they attended a meeting Friday where the company said overtime will be different beginning the following week.“We had a big meeting today where it was announced that all overtime going forward will be entirely optional, so if we want to work the extra hours and earn the extra money (As well as make yourself look better for progression) then we can do, but there is no longer a rule making us do it.“This is huge for us here in Lincoln as many of us haven’t been able to take full weekends without paying for it in a long time and it’s a giant step forward in making crunch less of a hell to deal with,” the Reddit poster said.On Wednesday, Rockstar allowed their employees to speak publicly about their time spent working on Red Dead Redemption 2, which was not the first time working conditions were brought up at Rockstar.While we wait for Red Dead Redemption 2 to release on Oct. 26 for Xbox One and PS4, check out how we felt after playing through 4 hours of the game, and 79 incredible details we found in the gameplay.Jessie Wade is a news writer for IGN and will probably make friends with the animals in RDR2 opposed to having shootouts. Chat with her on Twitter @Jessieannwade. We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}