{"id": "Black Friday Daily Deals - 1 Year of PS Plus for $39.99 or Less", "paragraph": "Welcome to IGN's Daily Deals, your source for the best deals on the stuff you actually want to buy. If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.Like us on Facebook and follow us on Twitter to get the latest deals.For more Black Friday 2018 coverage, check out our Black Friday article complete with tips, predictions, and early Black Friday deals.The first 50,000 people can get $10 off your Walmart order of $35 or more with coupon code \"ELLEN10\" as part of a promotion for The Ellen DeGeneres Show. As of now the code is still live so pick up your favorite game (including preorder games). Technically this code only works for new accounts. ALL YOU HAVE TO DO IS CREATE A NEW ACCOUNT WHEN YOU CHECK OUT!1-Year PS Plus Membership for $39.99 (Maybe $29.99)Paying only $39.99 for a $60 1-year Playstation Plus membership is an outstanding Black Friday deal by itself, and it won't get any cheaper on Black Friday. However, you can try using code: \"Ellen10\" mentioned above to get an additional $10 discount. Some people have got it to work although a vocal few have mentioned that their orders were cancelled. IMO it's worth a try.Use code \"ELLEN10\" and create a new account to get this price:You're basically getting $20 off this 10/10 \"Masterpiece\" rated game. You get $10 back as an instant discount when you apply the code, and another $10 back in the form of an Xbox gift card.Use code \"ELLEN10\" and create a new account to get this price:Not only has Walmart released these great Black Friday deal early, they are offering free 2-day shipping on the 43\", 50\", and 55\" models. The NU6900 series TVs will be one of the hottest sellers this month because this is one of Samsung's least expensive 2018 model 4K TVs during Black Friday.This will be on oDiscover your ancestry and find relatives you never knew existed. As long as you use the \"Ellen10\" coupon, you are matching the best price that it will be on Black Friday. There is no extra cost to this service.Use code \"ELLEN10\" and create a new account to get this price:Today Only - $10 off NES and Super NES Classic Consoles at WalmartWhen is the last time you've seen a discount for the NES or SNES Classic? If your answer is \"never,\" then you are in the same boat as me.Use code \"ELLEN10\" and create a new account to get these prices:We reviewed this game and really like it! Miranda Sanchez writes \"Powerful friends and new mechanics make for a delightful return to the Kanto region in Pokemon: Let's Go, Pikachu and Eevee\". Besides, if you really want this game, this looks to be the only way to get a discount for the bundle.Use code \"ELLEN10\" and create a new account to get these prices:It's not often Nintendo products dip from their original retail price, but the Nintendo Switch Pro controller has a small discount on Walmart worth checking out. It may be a weeks away, but it doesn't hurt to start stocking up on controllers before Super Smash Bros. Ultimate rolls around!Use code \"ELLEN10\" and create a new account to get this price:This is a Black Friday deal that's featured in several ads but has gone live early. For Black Friday, the NU8000 series will be one of Samsung's least expensive 2018 models with true HDR, wide color gamut, and local dimming. If you haven't experienced it, trust me, HDR is a game changing feature much like the jump from 1080p to 4K.There's a hefty $270 discount on this well regarded ASUS ROG STRIX gaming laptop. The GTX 1050 Ti can easily handle any game at 1080p.Take 80% off ($9.99). This deal should be available to anyone who doesn't have a current active subscription. An Xbox Live subscription is a must for anyone who wants to play online, plus you get bonus free games and discounted pricing at the Xbox Store every month.Not only has Walmart released this great Black Friday deal early, they are offering free 2-day shipping on it. The NU6900 series TVs will definitely be one of the hottest sellers this month.Lowest price ever at Dell Outlet! If you're looking for the ultimate beast in gaming monitors, the Alienware AW3418DW should be a tops on your list. Specs include a 34\" 3440x1440 curved IPS panel display with super wide viewing angles and 99% sRGB coverage, 4ms response time, NVIDIA G-SYNC compatibility, up to 120Hz refresh rate, and RGB lighting.This is a Dell refurb product that you're getting directly from the manufacturer (Dell). Dell Outlet monitors look and function as if brand new and include a 90-day manufacturer's warranty.This is a great price for a budget conscious shopper who still wants a gaming-worthy laptop. Specs include a 15.6\" 1080p IPS display, latest generation Intel Core i5-8300H quad-core processor, 16GB RAM, dual drives (256GB SSD + 1TB HDD), and GeForce GTX 1060 video card.For only $11.99 per course, you can train yourself in tools, software, and programming languages specific to the gaming industry. There are thousands of course to choose from, and many of them are from accredited instructors that supply you with tutorials, training videos, assignments, and more. Taking the courses in school could costs gobs of money.Black Friday is next week. We've written up several complete articles on announced Black Friday deals, predictions, tips, and more.Eric Song is IGN's deal curator and spends roughly 1/4 of his income on stuff he posts. Check out his latest Daily Deals Article, follow him at IGN Deals on Twitter and Facebook, and subscribe to his IGN Deals Newsletter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}