{"id": "Netflix's Castlevania Season 2 Review", "paragraph": "Note: this is a spoiler-free review of Castlevania Season 2, which debuted on Netflix on Friday, October 26.Why is it that Hollywood has managed to perfect the comic book movie formula over the past decade, yet producing even a halfway competent video game adaptation seems entirely beyond the abilities of most studios? Why, after all these years, are projects like 1995's Mortal Kombat and 2006's Silent Hill still held up as the benchmarks by which all others are judged? It's enough to wonder if this genre just isn't meant to succeed. Then, something like Netflix's Castlevania series comes along to prove that all we ever needed was the right combination of worthwhile source material and talented storytellers. Season 2 now cements Castlevania as king of the (admittedly short) video game adaptation hill.The new season has been a long time coming. Season 1 hit Netflix in July of 2017, offering fans a paltry four episodes before vanishing for the next 16 months. Fortunately, not only is Season 2 dropping just in time for Halloween, it doubles the episode count and dives much deeper into this horror fantasy universe. The result is a much richer, and ultimately more satisfying experience.Building on the setup of Season 1, the new season pits monster hunter Trevor Belmont (Richard Armitage), half-vampire Alucard, and spell-caster Sypha Belnades (Alejandra Reynoso) against the brooding Dracula (Graham MacTavish), who's currently waging war against humanity in retaliation for the death of his wife, Lisa (Emily Swallow).\n\nMost video game adaptations would have left it at that, focusing on the familiar Castlevania tropes fans expect - the long trek through Castle Dracula, the puzzles and mazes and boss fights and the climactic showdown with Dracula himself. But while some of that is included here, there are plenty of unexpected wrinkles and subversions of the usual formula. For one thing, Season 2 introduces a whole new wave of vampire characters to complicate Dracula's vendetta. The solitary vampire lord is joined by entire tribes of vampires, each with their own array of abilities, motivations and fashion sensibilities.Season 2 tends to focus on these supporting villains as much as its heroes. That includes the regal, treacherous Carmilla (Jamie Murray) and barbarian warlord Godbrand (Peter Stormare). Also a big focus this season are Dracula's two human servants, the fanatically loyal Devil Forgemasters Isaac (Adetokumboh M'Cormack) and Hector (Theo James).Castlevania's greatest strength is the fact that none of these characters fall neatly into hero or villain categories. Writer Warren Ellis gives each major character an impressive amount of depth and nuance. Dracula himself remains the most compelling player in this complex plot. He's a tragic figure, one lashing out at the world of men after his one chance at peace and happiness was stolen from him. Carmilla may be a political schemer, but she and her fellow vampire lords are understandably worried by their master's questionable actions and seeming inability to execute his own war. Isaac and Hector are particularly fascinating, with the series focusing a great deal on their motivations for turning against their own kind and help Dracula commit wide-scale genocide. Even men like Trevor and Alucard hold nearly as much disdain for humanity as their enemies do, and for good reason.That does speak to one minor problem with the series, which was equally evident in Season 1. There's so much emphasis on fleshing out the main heroes and villains, but little when it comes to the humans Alucard and friends are fighting so hard to save. We rarely even see other human characters except when the series flashes back to the death of Lisa Tepes or various other acts of human-on-human atrocity. At some point the series does almost too good a job of illustrating Dracula's position, leaving you to wonder why anyone bothers to fight in defense of the cowardly, hypocritical and superstitious humans in the first place.Still, that's a small concern when held against everything the series does well. And it speaks to the depth of the character work that Season 2 remains so consistently engrossing despite moving at such a slow pace. It isn't until the final three episodes that the action really begins to pick up and the plot takes on a more traditional Castlevania slant. Before that, the focus is heavily geared towards character development. It's surely possible to condense these first 12 episodes into a leaner, more focused movie. But in the process, that story would lose the strong characterization that gives the conflict its weight in the first place.Ellis proves himself to be an inspired choice of writer for this project. Having followed his comic book career for many years, Ellis has always struck me as someone who approaches licensed properties as a sort of intellectual exercise. He's admitted to having no familiarity with the franchise when he came on board. But rather than working against this series, that distance seems to have given Ellis the ability to approach Castlevania with a clinical eye, cherry-picking those elements that suit his story and discarding the rest. While ostensibly an adaptation of Castlevania III: Dracula's Curse, the series winds up drawing from all sorts of Castlevania lore. The result is a new story faithful to the spirit of the source material, but also one witty and self-aware enough to poke fun at itself when necessary.It certainly doesn't hurt that the series is so adept at capturing the look and mood of the games. Symphony of the Night and the character designs of Ayami Kojima remain the main source of visual inspiration for the series. The varied fashion and architectural designs combined with the moody lighting make for a stylish animated series. And it looks great in motion, too. While only a handful of episodes feature significant action sequences, those that do offer a satisfying blend of gore, over-the-top martial arts, and supernatural chaos. The penultimate episode is especially strong in that regard.The vocal cast is effective as well. There's often a very delicate line when it comes to depicting vampires as tragic, perpetually miserable antagonists. Push that too far and you wind up with the insufferable emo vampires of Anne Rice's novels. Here, the performances, as much as the writing, are responsible for balancing out the pathos with dark humor. McTavish makes for a compelling Dracula. Callis is given plenty of emotionally charged material to work with as the father/son relationship between Dracula and Alucard becomes paramount. Murray is deliciously sinister as Carmilla.\n\nThere are a couple of relatively weak points in terms of the voices. Reynoso's Sypha is generally good, but her exaggerated Eastern European accent is extremely inconsistent. It's not clear why she's even bothering with the accent given that most of the other character voices are very neutral. Then there's Stormare's Godbrand. It's a fun casting choice, though Stormare's voice doesn't exactly scream \"Celtic barbarian.\" Godbrand mostly just sounds like a drunk Peter Stormare, and doesn't always seem like he's on the same wavelength as his fellow vampires. Maybe that was the intent.Not only does Season 2 offer a deeper and meatier story than the truncated Season 1, it also provides viewers with a much more satisfying conclusion. Taken as a whole, these 8 episodes tell a cohesive and well-rounded story of supernatural warfare and family drama. There's certainly plenty of ground that can be covered in the recently greenlit Season 3, but fans can already rest easy knowing that Castlevania has done justice to the source material in a way so few video game adaptations have managed.In a time when most studios still can't seem to figure out how to properly translate video games to film and TV, Castlevania emerges as the new gold standard. Season 2 builds on the foundation of the brief first season, expanding the world and introducing more compelling, nuanced characters caught up in Dracula's war. It manages to be faithful to the source material while still making big changes where necessary and emphasizing character growth over mindless action. We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}