{"id": "Marvel's Spider-Man (PS4) - The Heist DLC Review", "paragraph": "The first post-game DLC episode for Marvel’s Spider-Man, The Heist, is like the main game in miniature form — fantastic character work, coupled with engaging story missions and side objectives occasionally hampered by repetition. The Heist clearly serves as the first chapter of a larger story waiting to be told across Spider-Man’s three-part DLC saga called The City That Never Sleeps, and so it feels a little light on its own. But when it works, it’s a reminder of how great it is to inhabit this webhead’s world.The Heist DLC begins quite literally with its namesake — a heist that, on a gameplay level, kicks things off with what I loved most: methodical stealth scenarios. It’s satisfying and easy to slink back into Spider-Man’s move set, especially while tackling foes who pack quite a punch. From the first brawl, which inevitably breaks out in the DLC-opening museum scenario, it’s clear these enemies are as strong as those in the later levels of the base adventure. It’s nice to see Insomniac Games try to switch things up right from the start with an engaging new crowd control objective that forced me to focus on specific enemies while also taking on the larger horde. I like The Heist's gameplay twists, but I wish we saw more of them. Outside of a couple of battles, the DLC’s story missions largely play into stealth, along with a few chase sequences. After that initial sequence, they’re a bit of a mixed bag — the chases are fun, but a brief insta-fail stealth section and very quick playable Mary-Jane mission hamper the flow. That insta-fail mission is relatively easy as, rather than using stealth takedowns, there’s the potentially cool idea to call on Black Cat to knock out foes, but her presence is largely superfluous.Other than hinting at how Spider-Man missions with a buddy might work, she is simply an alternate takedown option, not a necessary one. I like that The Heist tries to add some twists to the established gameplay loops, but I wish it made more use of them throughout the DLC. I hope we see those experiments grow in the next two DLC chapters. \n\nThat’s also true for the side objectives. The DLC instances you into a version of New York City where you only have to focus on its objectives (plus landmarks and backpacks if you haven’t collected them all). It’s jarring at first, but boils down to letting you really hone in on the one new collectible --a light but sweet story tie-in --and the Taskmaster-esque challenges of Screwball.The EMP challenges are the good versions of Taskmaster's drone chases. The social media-loving baddie is, personally, one of my least favorite villains used in the main game, and while I don’t love her presence in the DLC, her challenges are relatively fun. Her EMP challenge missions are wholly better versions of Taskmaster’s drone chases, while her combat scenarios require you to defeat enemies in certain areas to earn bonus points. It’s nothing revolutionary, and I would have liked a few more, but they’re a welcome variation. (Less so is her challenge to defeat enemies using only two gadgets. The idea is nice but in execution it felt odd and frustrating as a one-off challenge.) On top of those side objectives, one new enemy faction is also thrown into the mix, as is a new Spider-Bot-focused crime to thwart. The new baddies are a relatively vanilla group, save for a frustrating brute with a chaingun thrown into the mix. The new crime is a nice break from the crime monotony while trying to 100% the DLC, but I only encountered it twice in completing every district.The emphasis of the roughly three-hour DLC really is on the story, in which Black Cat immediately makes an indelible mark on this world. Her history with Peter is palpably awkward for him, fun for her to exploit, and captivating to watch. Seeing how their connection informs Peter and Mary-Jane is as fantastic as the character work done in the main game. Yuri Lowenthal and Laura Bailey once again turn in stellar performances as Spidey and MJ, respectively, while Erica Lindbeck from her first line breathes captivating life into the cunning, mysterious, and chaotic addition to Spider-Man’s current life. (And, a few incidental dialogue sequences with Miles Morales are just the sweetest thing.) \n\nThe story smartly twists lore to make Black Cat’s connection to Spider-Man and Peter all the more interesting. Insomniac Games toys with expectations, and proves yet again that it can nail the world of Spider-Man while also putting its own stamp on the character.What’s unfortunately lacking is the larger threat, who is clearly being saved for future DLC episodes. Obviously, there’s plenty of time to focus on them to come, and Black Cat more than justifies her moment in the spotlight for this chapter, but I would like to have seen a little more specificity from the villainous side of things, especially considering the slew of strong baddies you’re fighting from the main adventure.The Heist certainly sets up a story and characters I’m excited to see more of, but feels more like the start of something instead of a whole worth recommending solely on its own. Its character work is once again stellar, and it left me wanting to see more, but it’s more an unresolved first act than a conclusive story tying into a larger plot. Should the upcoming Turf Wars and Silver Lining DLCs live up to what’s established in The Heist, some of its weaker elements will be easier to overlook — new gameplay ideas are intriguing, others frustrating, but none are put into practice long enough to make much of an impression. But it’s still more of what I loved about Spider-Man, making the quick return to his world a joyful one.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}