{"id": "Suspiria Review", "paragraph": "Dario Argento’s phantasmagoric nightmare classic Suspiria is a rite of passage for most horror fans. It’s not so much a movie as it is a vivid hallucination about a young American woman in a haunted German ballet school, where the laws of reality do not apply and terror fills the air like music. It’s a film that’s hypnotic to watch and nearly impossible to explain, and that’s a big part of its appeal.So it’s intriguing that Luca Guadagnino’s remake of Suspiria is desperately eager to explain it. The new version has elements of the surreal but it takes place firmly within the recognizable reality of politically-charged Berlin in 1977, during the period when the Baader-Meinhof Group hijacked an airplane, an event which came to be known as “German Autumn.” Suspiria doesn’t show that event but reminds the audience about it constantly, with news reports and graffiti and dialogue that reminds us that a supernatural dance academy is only one of many local troubles.Suspiria once again tells the story of a young American woman in a haunted German ballet school. Susie Bannion (Dakota Johnson) is a naive Ohio immigrant who arrives in Berlin with dreams of joining the famed Markos Dance Academy. She soon finds favor with the company’s director, the mysterious Madame Blanc (Tilda Swinton), who sees an otherworldly talent in Susie, which might be exactly what Blanc’s coven needs to enhance their supernatural power.\n\nOver the course of Suspiria, Susie falls prey to confusing nightmares with seemingly random, frightening imagery. Her dancing takes on an orgasmic quality, which she equates to having sex with a wild animal, and her sudden influx of power and talent makes her unaware - or uninterested - in the eerie tragedies that befall her less talented classmates. Don’t go in the basement, whatever you do, and if you find a secret door in a mirror… run.If it sounds scary, it’s actually not. Suspiria has moments of terrifying creativity, like a seemingly normal dance routine which has unspeakable, unpredictable consequences for one of Susie’s classmates. But the majority of this 152-minute movie is less invested in frightening the audience than it is in exploring what it must be like for a coven of unholy, evil witches to operate secretly, within an urban sprawl, and survive the various fascistic political waves in Europe.It sure is ironic, Guadagnino suggests, that in isolating themselves from totalitarianism the witches in Suspiria have developed their own internal brand of it. And he’s right, it is. But it’s not absorbing and it’s not frightening. The whole movie plays like an epic think piece about the original Suspiria, taking the day-to-day minutiae of the characters far more seriously than the style or the mood. Even Thom Yorke's score eschews the gothic intensity of the original, classic Goblin theme, in favor of dreary tones and meditative atmosphere. It's a score for a film that wants the audience to feel pensive, not terrified.\n\nIn short, the new Suspiria slips into the trap that many pop culture geeks fall for, time and time again. It doesn’t just take Suspiria seriously, it takes it literally. You can either accept Guadagnino’s interpretation of these events or you can leave, because there’s no room for interpretation anymore. Which might be fine if the interpretation we’re given was captivating in-and-of itself, but the film doesn’t seem to work without the original Suspiria acting as a pretense. It’s not interesting to see witches make lunch while casually voting for their new leader unless you already know the evils they do when they’re not engaging in bureaucracy.Suspiria builds and builds to a climax that is every bit as wild as you’d want it to be, but it takes an awful long time to get there and an awful lot of it is dedicated to a male psychologist played, for reasons which are never clearly laid out, by Tilda Swinton. And his part in the tale turns out to be incredibly important, if only to Guadagnino, and so distracting from the film’s tale of total female empowerment and its unintended consequences, that it’s more off-putting than illuminating.Which is probably a good way to describe the film itself.Luca Guadagnino’s Suspiria is an interesting intellectual exercise, too ambitious to be ignored yet too overbearing to be enjoyed. Despite moments of genuine terror the film is less interesting in being scary than it is in humanizing what scares us, but once we know more about the witches in Suspiria, the less intriguing they are. Fans of the original might find Guadagnino’s interpretation intellectually fascinating; people who’ve never seen Argento’s film might just find it impregnable.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}