{"id": "Star Wars: The Secret of Darth Vader's Castle Revealed", "paragraph": "If you've ever wondered why Darth Vader built a castle on Mustafar, Marvel has revealed the answer.Warning: this article contains spoilers for Star Wars - Darth Vader #22!2016's Rogue One first introduced Vader's sinister fortress into official Star Wars continuity, revealing that the Dark Lord of the Sith built a castle on the very world where Anakin Skywalker died. But as it turns out, there's much more to the castle than just Vader's need to get away from it all and have a spa day. It all ties into the return of Lord Momin, an ancient Sith Lord first introduced in the 2015 comic Star Wars: Lando.Art by Giuseppe Camuncoli. (Marvel Comics)Though long dead, Momin's consciousness has survived inside his helmet. Momin reflects on his own sordid past in this issue, revealing himself to be an aspiring artist who uses the Force itself to create masterpieces of death and suffering. Momin once tried to use his skills to craft a weapon capable of freezing time, until he and his acolytes were stopped by the Jedi.But though he never realized his ultimate goal, some of Momin's work still survives. That includes schematics for the massive building that will one day become Vader's Mustafarian fortress. And as Momin reveals, that fortress serves a specific purpose. It can channel the Dark Side and erase the barriers between past and present, effectively bringing the dead back to life. This fuels Vader's hopes that he can finally resurrect his wife, Padme.Art by Giuseppe Camuncoli. (Marvel Comics)This issue ends with Vader reluctantly forming an alliance with Momin, knowing all too well that he's been promised the power to manipulate life before. Will Momin follow through where Palpatine delivered only lies and betrayal? We doubt it, but we'll find out as the \"Fortress Vader\" storyline reaches its climax over the next several months.Let us know what you think about this reveal and the prospect of Vader resurrecting Padme in the comments below.\n\nJesse is a mild-mannered writer for IGN. Allow him to lend a machete to your intellectual thicket by following @jschedeen on Twitter, or Kicksplode on MyIGN.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}