{"id": "Nintendo Fans Are Scrambling To Figure Out the Latest Big Smash Bros Rumor", "paragraph": "Update: New information has been released involving the employee behind the Super Smash Bros. Ultimate rumored leak. The person who was rumored to be accused of spreading the alleged leak has denied having anything to do with the situation.Twitter user @Doctor_Cupcakes tweeted the news Thursday, citing the unofficial French Nintendo news Twitter, @NintendoActu, for confirming the update. Doctor_Cupcakes said the person responsible for the alleged leaked art is most likely impersonating the employee.The translated tweet by @NintendoActu reads: \"A @NintendoActu source was able to find out from the supposed author of the supposed leak Super #SmashBros. Ultimate, who claims to be unaware of the situation and not to have been contacted by partners about it.\"An official version of the empty battlefield banner has also been found by users, including @Vaanrose on Twitter, who detailed discrepancies between the banner art that is reportedly from E3, and the leaked image itself. Leak Buster Artsy Omni on YouTube goes over the differences, pointing out the likeliness that the leak is fake.The original story continues below.An alleged leak for the Super Smash Bros. Ultimate roster appeared online Wednesday, and Nintendo fans have been completing hours of research to uncover details behind the leak.After being posted to Snapchat in a video by an unnamed French person at the time, it was quickly deleted and then appeared as pasted-together images on Discord, and later 4chan. The images have since been circulating the internet and can now be seen on Imgur.Photo credit: ImgurLeak Review took to Twitter to explain the exhaustive lengths that fans have gone through to put together the missing pieces in the puzzle, including who the person is behind the images and which characters could be where in the pixelated mash up.The user's name was scribbled out but still possibly legible to an extent, and is rumored to be a person who, according to their LinkedIn page, went to school for graphic design and works for Marina PLV – a company who prints out promotional materials for companies.\n\nA user by the name of ecylis on GameFAQS, carefully translated the person's LinkedIn page, as it is entirely in French.The title reads, \"responsable grands comptes chez les ateliers Marina.\" User ecylis found out that translates to, \"account manager at Marina workshops.\"From there, the words \"les ateliers Marina\" in a Google search takes you to the Marina PLV website, which lays out the companies they have worked for doing promotional materials – including Bandai Namco.A thread on Reddit has chronicled heavy updates as fans have uncovered new details with the alleged leak, including a tweet from what appears to be an unofficial French Nintendo news Twitter profile, who tweeted earlier Wednesday that they contacted the company the rumored person works for to confirm their employment.Translated, the tweet reads: \"Nintendo News was able to check with the company concerned that the employee behind the alleged leak of Super #SmashBros. Ultimate works well for this one.\"The Reddit post outlines some ways Nintendo fans are trying to prove the leak is true, including an in-depth investigative-type map that lays out a dozen ways the evidence connects to one another – but there is no confirmation of any truth behind it and that it's not just a fake design.Fans are also speculating that if it is true, it could possibly be an unintentional leak, with someone sending the video to a friend on Snapchat, who ended up screenshotting it on their end.\n\nWe found out last month that Nintendo is releasing a special Super Smash Bros. Ultimate Nintendo Switch hardware bundle that releases on Nov. 2nd – a month before the game's release on Dec. 7. It features a special dock with characters from the original N64 roster, special Joy-Con's with the Smash Bros. logo, and a digital download for the game.While we wait to find out the confirmed roster for the latest Super Smash Bros., check out our hub of everything you need to play the game, along with preordering the Super Smash Bros. Ultimate Pro Controller and Special Edition Steelbook.Jessie Wade is a news writer at IGN and loves putting her detective hat on. Chat with her on Twitter @jessieannwade about your thoughts on the Nintendo community being investigators.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}