{"id": "Opinion: How Cowboy Bebop Changed My Life ", "paragraph": "I popped my head into my brother’s room. He was on his computer playing video games -- likely Warcraft. He was one of those overachievers who could do eight things at once, so he also had his textbooks open on his desk and some anime on in the background.“What’s this?”“Oh -- it’s awesome. Cowboy Bebop. You’ll love it.”He didn’t even take his eyes off the computer screen to answer my question. I looked at the TV. And there he was, Spike Spiegel, in all his green-haired glory, those brown, bounty-hunting eyes staring back into mine. I knew it right then: I was in love.My brother and I watched Dragon Ball Z and Sailor Moon on Toonami when we were young. We caught some episodes of Ronin Warriors, Inuyasha and Outlaw Star on Adult Swim. I owned one Sailor Moon VHS, and it was pretty pricey. Anime wasn’t easy to come by back then.But Ian, somehow, convinced my parents to buy the Cowboy Bebop DVD set (I still have that very collection). Cowboy Bebop was the first anime I remember watching in its entirety. And I watched it again, and again, and again.I can clearly hear the jazz music in the opening credits (3...2...1… Let’s jam). I can still see Mad Pierrot screaming in agony, rolling around on the floor, wailing for his mother. And without question, my favorite cinematic scene of all time is the epic Cathedral battle: Vicious vs. Spike. Oh. And one word. Bang. One of our editors asked me to write about why I love Cowboy Bebop. I made a long list, but it’s impossible to distill the show into simple bullet points. There’s too much to talk about -- spaceships; guns; samurai swords; weird-ass technology; action scenes that hold up against the best of any genre, in any medium.Sure, Bebop is philosophical and mind f***s you, but it’s not over-the-top, or condescending. It makes you take a hard look at this world, a hard look at yourself. You can find something to relate to in all of the characters -- their sadness, their struggle, their helplessness. The stories chill you to your core. Spike, Jet, Faye, Ed, Ein -- they feel like family.And the music. Go google the soundtrack, right now. Find it on YouTube. You don’t like jazz? Don’t worry, you’ll find a new appreciation for it, I promise. And it’s by no means limited to that genre.I can clearly remember when the end credits rolled after my first time watching the series all the way through. I turned to my brother:“Is it really over? Did it have to end?”I missed the true message of Cowboy Bebop when I was young. I just thought it was cool. But it’s a story about a man who has lost the one person who mattered to him the most, who gave him meaning, who gave him life - who loved him despite his faults and weaknesses.And then things change. Life happens. But he survives. And maybe it isn’t the life he envisioned, but he makes a different life for himself. He keeps going. He keeps fighting. Because that’s what she would have wanted.My brother passed away two years ago. I still feel so lost sometimes, more often than I can explain. But things work their way into your life when you need them the most, and when I moved out here to L.A. to work for IGN, my parents shipped all of Ian’s belongings to me.This anime, like most great stories, brings people together. I can’t keep count of how many conversations I’ve had about Cowboy Bebop, with anime fans and newcomers alike. I have “See You Space Cowboy…” tattooed in big bold letters on my side, paying homage to this story that was so important to me and my brother. It’s just that good.Cowboy Bebop changed me. It affected my life. My brother and I were always close, but talking about video games, action movies, comic books and anime -- that was a passion we shared, one that strengthened our bond. It also taught me that life is hard and cruel, there will be difficult endings, but you must survive. You will find your way.I remember, the box marked DVDs was one of the last ones I got to. I was super tired from unpacking. Exhaustion and anxiety were getting to me. Was I going to like it in L.A.? Would people like me? Exasperated, I cut deep into the cardboard and ripped the box open.“What’s this?” I thought.“Oh -- it’s awesome. Cowboy Bebop. You’ll love it.” Jacki Jing is an Amazonian Super Hero Ninja wannabe by moonlight and a host/producer for IGN by daylight. Anime's her jam and Tuxedo Mask is her main man -- him, or Batman. Follow her on Twitter at @jackijing.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}