{"id": "AOC C27G1 Curved Gaming Monitor Review", "paragraph": "Be sure to visit IGN Tech for all the latest comprehensive hands-on reviews and best-of roundups. Note that if you click on one of these links to buy the product, IGN may get a share of the sale. For more, read our Terms of Use.AOC has been building solid budget-range monitors for years, and its latest release is a quality unit at a pretty great price of just $280. If you’re looking for an affordable 1080p, 144Hz curved gaming monitor the C27G1 (See it on Amazon) is a great option.The monitor has an obvious “gamer” aesthetic, with jagged edges on the stand and red accents on the front and back of the display. It doesn’t have any LEDs or over-the-top flourishes though, so it stays in the realm of “gaming monitor” rather than “alien spaceship.” The monitor can tilt up to 4 degrees forward and 21.5 degrees backward, swivel up to 34 degrees in either direction, and is height-adjustable. It also has a “frameless” design where the bezels are part of the screen rather than thick plastic edges around it. The C27G1 has decent IO options with one DisplayPort 1.2 port for your PC, two HDMI 1.4 ports (for game consoles or other devices), and a VGA port for legacy devices. It also has a 3.5mm audio out jack, if you prefer to send audio through your graphics card’s HDMI port to speakers or headphones.The curved VA panel comes in at 1920x1080 resolution with a 144Hz refresh rate, and AMD’s FreeSync built-in to eliminate screen tearing. At 27 inches, that means you don’t have super-sharp pixel density here, which is apparent in desktop work, but not as much in games. The brightness is also a little low, measuring only 250cd/m2. But it’s hard to complain too much since it's less than $300, especially when you consider the other specs. As a monitor designed for gaming rather than productivity, I'm willing to forgive a lower resolution in order to have 144Hz FreeSync.The on-screen display boasts a ton of different settings, but its controlled via a traditional line of buttons along the bottom, which make it slow and cumbersome to navigate. But once you get all your settings dialed in, hopefully you won’t have to revisit the menu too often.I ran the C27G1 through a battery of tests using Lagom’s LCD patterns, and despite being a value proposition, black and white levels were great, and I saw zero banding in grey-to-white gradients. Gamma was a touch low with a value of 2.1 (the target is 2.2), but colors looked quite accurate in my test clips, so you shouldn’t have to do much tweaking to get a good image.Response time was the main sticking point—AOC pegs grey-to-grey transitions at 4ms, which is typical for a VA panel. I noticed pretty heavy flickering in Lagom’s test patterns, putting it in line with other VA panels I’ve tested. (The 1ms response time on the box is Moving Picture Response Time, not the typical grey-to-grey value most displays quote.) However, in practice, you can reduce the ghosting caused by this slow response time with an Overdrive setting (more on that in a bit).As is typical for VA and IPS panels, I also noticed some slight backlight bleeding around the edges of the monitor, but it’s far from the worst I’ve seen. It shouldn’t be too noticeable except on an entirely black screen, and I didn’t find it to be much of a nuisance in gaming or movies. Viewing angles were good, not great, which is to be expected—it’s still significantly better than a TN display.My initial experience gaming on the C27G1 was, to put it mildly, a letdown—at stock settings, this monitor has some serious ghosting, and even in a slower-paced game like Dishonored 2, slight movements turn the entire screen into a blurry mess. Thankfully, AOC’s Overdrive feature (which is turned off by default) helped a fair amount: I recommend setting it to “Medium” or “Strong”. Strong produces less blur overall, but produces its own artifacts in certain conditions that might annoy some users. Try both to see which you prefer.There’s also a Motion Blur Reduction (MBR) feature on this monitor, but it requires turning FreeSync off and playing your games at a very high framerate to work well. I found Overdrive to be sufficient in alleviating motion blur.Once I had Overdrive in place, gaming was a very pleasant experience. Motion, while not perfect, was much better, and the VA panel’s color accuracy and 3000:1 contrast ratio produced a great looking image with darker blacks than most displays will provide. I didn’t feel that the lower 1080p resolution harmed the gaming experience, producing a suitably sharp picture, and FreeSync prevented any nasty screen tearing thanks to my RX 580 graphics card. (Note: You’ll need to use DisplayPort, not HDMI, to get FreeSync’s full range—which on this monitor is 48Hz-144Hz.)The 1800R curve is subtle in a monitor this size, so I can’t say it led to any increased immersion, but it didn’t produce any noticeable side effects either. Overall, this display checks the most important boxes, and performs admirably for the price.The AOC C27G1 Curved Gaming Monitor has an MSRP of $325, but is usually on sale for a bit less on Amazon.  The AOC C27G1 isn’t going to blow your mind, but at only $280 (street), it has great gaming features, and the stand’s extra adjustability puts it ahead of other similarly-specced monitors at this price range. If you want an affordable 1080p display, this is a great option.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}