{"id": "Black Friday 2018 Deals - What To Expect", "paragraph": "Welcome to IGN's Daily Deals, your source for the best deals on the stuff you actually want to buy. If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.For the best deals today, check out our IGN Daily Deals article.Black Friday 2018, the best deal day of the entire year, is happening next week! We'll be here every step of the way to highlight the best deals and cheapest prices. In addition to the mega article we'll be publishing, make sure to like us on Facebook and follow us on Twitter in order to get real time updates on the best Black Friday deals as they go live.The official date is Friday, November 23, but the deal frenzy spans longer than a single day. Here's an approximate timeline.So many websites and stores participate on Black Friday that it can easily be overwhelming for the casual shopper. It's always wise to make a list of what you want and set a budget beforehand, but we've also come up with some advice on where to shop, how to shop, and what kind of deals we expect to see on all the things you're into.Please note that the extended holiday return windows have not yet been published for 2018. These are the dates that have been used for previous Black Fridays. Although they are most likely going to remain the same, there is a possibility that the dates listed below might change.In the UK? Check out IGN UK's list of the Best Black Friday and Cyber Monday UK Deals NOW LIVE. List price $299.99.The first 50,000 people can get $10 off your Walmart order of $35 or more with coupon code \"ELLEN10\" as part of a promotion for The Ellen DeGeneres Show. As of now the code is still live so pick up your favorite game (including preorder games). Technically this code only works for new accounts. ALL YOU HAVE TO DO IS CREATE A NEW ACCOUNT WHEN YOU CHECK OUT!Use code \"ELLEN10\" and create a new account to get this price:1-Year PS Plus Membership for $39.99 (Maybe $29.99)NOW LIVE. List price $59.99.Use code \"ELLEN10\" and create a new account to get this price:NOW LIVE. List price $279.99.NOW LIVE. List price $499.99.NOW LIVE. List price $719.99-$839.99.List price $39.99-$49.99.List price $119.99.NOW LIVE. LIst price $69.99.Use code \"ELLEN10\" and create a new account to get this price:Today Only - $10 off NES and Super NES Classic Consoles at WalmartUse code \"ELLEN10\" and create a new account to get these prices:Use code \"ELLEN10\" and create a new account to get this price:NOW LIVE. List price $9.99.NOW LIVE. List price $499.99-$1499.99.NOW LIVE. List price $1200-$4800.NOW LIVE. List price $499.99-$2399.99.NOW LIVE. List price $999.99-$1399.99.NOW LIVE. List price $599.99.NOW LIVE. List price $699.99-$1199.99.NOW LIVE. List price $1500-$2700.NOW LIVE. List price $1798-$2998.NOW LIVE. List price $2800-$4000.NOW LIVE. List price $1499.99.NOW LIVE. List price $79.99.NOW LIVE. List price around $99.99 per course.NOW LIVE. List price $179.NOW LIVE. List price $99.99.NOW LIVE. List price $599.99.NOW LIVE. List price $34.99.Pros for Everyone (including those WITHOUT Prime membership):Pros for Amazon Prime membersPros:Pros:The Dell Black Friday sneak peek flyer has been released.Pros:Pros:The Target Black Friday sneak peek ad has been released.Pros:Here are some of the prices I expect to see on Black Friday. I'm actually being conservative here, so I wouldn't be surprised if several of these items actually ended up selling for a lower price. I would be surprised if the prices were higher. These are just my personal predictions, as someone that lives and breathes deals each day.Eric Song is IGN's deal curator and spends roughly 1/4 of his income on stuff he posts. Check out his latest Daily Deals Article, follow him at IGN Deals on Twitter and Facebook, and subscribe to his IGN Deals Newsletter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}