{"id": "Thor, Loki, Wolverine, Doctor Doom Obtain Insanely Epic Power Sets", "paragraph": "The latest issue of Thor by Jason Aaron and Mike Del Mundo saw Thor, Wolverine and Dr. Doom battle it out in the far future while utilizing immense power obtained from other Marvel heroes. Loki gets a major upgrade, too.Warning: full spoilers for Thor #6!Art by Esad Ribic. (Marvel Comics)Eons in the future, King Thor brings new life to the long dead planet Earth. This spark of life in a dying universe draws the attention of both Wolverine and Doctor Doom.Wolverine was resurrected by the Phoenix Force and now travels the universe helping to usher it towards its end by killing ailing stars and burning out black holes. Wolverine takes offense at Thor rekindling life on Earth, feeling strongly that the Earth had its time and it should stay dead, but Thor convinces him to change his mind and let it flourish.Art by Christian Ward. (Marvel Comics)While Thor and Wolverine were fighting and debating, Doom was traveling back to his home planet intent on snuffing it out, primarily because the new people created by Thor were living in the spot where Doom’s home of Latveria used to stand, a place he considers sacred ground. Thor and Wolverine stand up to Doom, and given how powerful the combatants have become over time, it’s an epic battle for the ages.Doctor Doom is now imbued with the powers of numerous superheroes, presumably because he absorbed them as the bearers slowly died off over the years or he just took their powers by force. He’s so strong that his heralds are the massive monsters Fin Fang Foom, Goom, Gorgilla, and Monstrum, who refer to him as “the Fist of Iron! The Starbrand Supreme! The Master of Mystic Vengeance!” Doom wields the combined power of Iron Fist, the Starbrand, the Sorcerer Supreme, and the Spirit of Vengeance, and that’s on top of all his original abilities which include a mastery over science and sorcery.Art by Christian Ward. (Marvel Comics)Thor is now the All-Father of Asgard, so he has all the power of Odin in the form of the Odinforce, now called the Thorforce, as well as his trusty hammer, Mjolnir, not to mention his lost arm has been replaced with a prosthesis made from the powerful Destroyer.It’s worth noting that all of the powers between Thor, Wolverine and Doom are the same utilized by the ancient Avengers 1,000,000 B.C. (except the power of the Black Panther), which marked the beginning of the age of superheroes, also written by Aaron, so in a way this battle sees that story come full circle.When the battle for Earth’s survival begins, Thor and Wolverine’s initial strikes do little to phase Doom, who returns the favor by blasting them away. Doom incinerates Wolverine with a breath of fire, leaving only his smoking skeleton behind. Doom then uses the Penance Stare on Thor, reflecting his long life’s worth of sins back at him with intense pain, leaving Thor in a shaken state. Wolverine, being the Phoenix, resurrects to continue the fight against Doom, although the duo are still unable to defeat Doom. Wolverine decides to transfer the Phoenix Force into Mjolnir, sacrificing his life to do so and transforming Thor into King Phoenix, God of Fire. It’s implied that Thor once loved the Phoenix, so they form a bond stronger than Wolverine was ever able to achieve, giving Thor the strength he needs to finally take down Doom.Art by Christian Ward. (Marvel Comics)Curiously, Odin and the Phoenix were seen having a romance in the flashbacks to 1,000,000 B.C., so this is a reveal of sorts that the firebird later had the hots for Thor. Perhaps that's a story for another day that Aaron plans to tell.Even though Doom is gone, another evil force across the universe brings a new threat. Loki has coerced the symbiote power of the All-Black Necrosword from Ego the Living Planet and absorbed it to become “Loki the Necrogod, Loki the All-Butcher, Loki… The End.”Art by Christian Ward. (Marvel Comics)This transformation was teased in a vision of the future during 2016's Civil War II and we now see how it came to be, setting up an epic confrontation between Thor and Loki at the end of time.Art by Esad Ribic. (Marvel Comics)For more Marvel goodness, check out our list of the best villains Marvel has to offer:\n\nJoshua is Senior Editor of IGN Comics. If Pokemon, Green Lantern, or Game of Thrones are frequently used words in your vocabulary, you’ll want to follow him on Twitter @JoshuaYehl and IGN.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}