{"id": "Xbox Players Are Upset About Fallout 76's Exclusive 'Early' Beta", "paragraph": "Update: Bethesda has announced another Fallout 76 beta play session this week for Sunday, October 28, from 12:00 pm - 2pm ET. This earlier time window should help accommodate United Kingdom and European players.Original story follows:The original announcement of the Fallout 76 beta detailed that Xbox One players would be given early access to the beta – one full week ahead of PlayStation 4 users.However, many players' expectations of the amount of playable time in that exclusive beta window don't align with the reality, as Bethesda announced Wednesday on Twitter that the second beta time slot after Tuesday's first 4-hour opening, wouldn't be until Saturday, Oct. 27, from 5:00 pm - 7:00 pm ET.\n\nIn Bethesda's post on their website Tuesday, they detailed aspects of the \"Break-it Early Test Application\" saying the beta may be offline for a day or two while they review data from the beta itself. Responding to IGN's request for comment, a Bethesda representative emphasized that all of the current information is in the aforementioned existing blog post.\"On any given day, the game might be online in blocks of time ranging from two to eight hours long. Additionally, there will be times when the B.E.T.A. is offline for a full day or two while we review data from the previous test and work to make adjustments as needed.\"Players who preordered Fallout 76 on Xbox – specifically for early access to the beta – are voicing their frustrations on both Twitter and Reddit, saying instead of having a week of on-again-off-again early access, after Saturday it will have been only 6 hours.With a 4-day break of the beta being offline, it doesn't give much time for Xbox players to have access to the servers before PS4 players jump online Tuesday, Oct. 30.   Bethesda originally stated they would have the beta windows open anywhere between four and eight hours at a time, and would make immediate fixes and updates for players before putting the server back online.Users outside of the US are also unhappy due to the timezone differences, with the first beta occurring from midnight - 4:00 am on a weekday in the UK.Reddit user HarraReeves_ posted Wednesday that at first, they felt the Xbox One beta was unfair to PS4 players, but now they simply feel bad for any Xbox users.\n\n\"They barely get any time to play because of these weird schedules. This isn't a week early, this is like 10 hours of gameplay at most, early,\" Reddit user HarraReeves_ wrote.Reddit user ArcticReaper from Australia responded about the time differences. \"Sucks that us in Australia have a 8am start and everywhere else has an arvo/night start. 2 hours I don't think warrants getting up early for it. 4 hours was worth it. Got the full 4 hours in. But 2? No thanks, Not enough time for me to test and try breaking the game with a friend. Rather get more sleep.\"User JLArmitage jumped in stating that, \"To be fair, it’s not early access to the game. It’s a week’s early access to beta. They’re using it almost exclusively to test server strain, hence the small windows of time. Crowd everyone in and see how much the server can take before it crashes.\"Another user, AncientRent then commented about the way Bethesda was marketing the beta for preorder sales, saying that if the beta was solely for testing server stress, they would have made it an open beta to ensure as many people as possible could get online.\"It was clearly used as a way of saying \"Pre-order our game to get early access\" especially given them being so vocal about progress carrying over,\" Reddit user AncientRent wrote.Users who have yet to preorder Fallout 76 and were planning on doing so for Xbox One, are now saying they are going to wait and get it on PS4.\n\nThe first time slot of the beta was originally announced Monday, with ranges between 4:00 pm in the US and 2:00 pm in Sydney, Australia.Stay tuned to IGN for more news on Fallout 76 and rewatch our livestream of gameplay. While we wait for the second wave of the beta to begin, check out IGN's interactive map of Appalachia and plan some spots to head to outside of Vault 76.Jessie Wade is a news writer for IGN and is curious about what's inside and outside of Vault 76. She's going to play on PS4 though. Follow her on Twitter @jessieannwade.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}