{"id": "Harley Quinn's Future Is Looking Goofy (Old Lady Harley #1 Review)", "paragraph": "The success of Old Lady Harley may depend largely on what you want out of this new miniseries. If you merely crave an extension of the main Harley Quinn book, one that features a similar tone and sense of humor but a radically different setting, then Old Lady Harley delivers the goods. But if you're hoping for a somber reflection on Harley's life and legacy a la Old Man Logan or The Dark Knight Returns, you may come away disappointed. It's a fun read, but not one that runs as far with the premise as it could.Building on the initial Old Lady Harley storyline form the main series, this spinoff takes a deeper dive into the alternate future DCU where Power Girl is President of the United States, Canada is overrun by poutine-loving zombies and Harley is a few decades older and exactly as weird. The big selling point this time around is that Harley and her faithful sidekick/Deadpool clone Red Tool have to hunt down Joker, who apparently managed to cheat death yet again.Old Lady Harley #1 offers a fun romp through a distorted version of the DCU. Writer Frank Tieri and artist Inaki Miranda are clearly having a blast with the setting and the chance to poke fun at various bits of DC lore. Suffice it to say, this issue has one of the better Condiment King cameos in recent memory. And while Red Tool is a character who tends to wear out his welcome after a while, here he functions perfectly well as a foil to Harley and someone who can amplify her own brand of zaniness. And despite the title, it's nice to see that Old Lady Harley doesn't go overboard trying to be a blatant 1:1 parody of Old Man Logan. If anything, the book seems more inspired by the Mad Max franchise.Miranda's art only enhances the goofy, post-apocalyptic vibe. His expressive figures keep the story reasonably peppy and light-hearted despite the occasionally grim subject matter. At the same time, Miranda's art pairs with Eva De La Cruz's murky colors to create a vaguely unsettling and grungy look at a DCU coming apart at the seams. This is a series that very much fits the mold of the ongoing Harley Quinn comic while still finding ways to forge its own identity.As entertaining as the story is in its first chapter, it's hard not to wish for a bit more depth out of the book. The prospect of an older, more world-weary Harley confronting Mister J for the last time is appealing. Yet this issue never really tries to sell this impending showdown as anything m,ore than another goofy chapter in Harley's ongoing journey. There's little sense of significance or finality to the story.It doesn't help that Harley is written almost identically to the present-day version. Age doesn't seem to have changed her much at all. She even continues dropping 2018-appropriate pop culture references despite jumping ahead several decades into the future. Old Lady Harley is entertaining, but it does feel like a bit of a missed opportunity all the same.Old Lady Harley #1 offers an entertaining glimpse into the future of a DC icon, one where the DC Universe has become just as warped and bizarre as Harley herself. Fans of the ongoing series will feel right at home. Unfortunately, it's not a particularly deep comic despite the potential inherent in the premise. Old Lady Harley #1 is an entertaining read, but not one that lingers long.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}