{"id": "Daredevil Season 3, Episode 8: \"Upstairs/Downstairs\" Review", "paragraph": "Warning: The following contains spoilers for Daredevil Season 3, Episode 8. If you need a refresher on where we left off, check out our review of Season 3, episode 7.\"God dammit, Karen. Don't turn into Matt on me.\" Even Daredevil's bridging episodes, during parts of the season that traditionally slouch, are great this year. To a surprising degree, perhaps. And I'm pretty sure I haven't mentioned, in my reviews thus far, how awesome it is to have Wilson Fisk back as a character. He just adds so much. Vincent D'Onofrio's restrained, grimacing, and mostly internal performance is just a behemoth achievement. Most of the time when a single villain dominates the adversarial element for an entire run, things tend to get sluggish. But Daredevil needs Kingpin. He needs this type of cerebral foil.\"Upstairs/Downstairs\" has a bit of everything. Whatever whets your whistle. It has team ups and revelations and (literal upstairs/downstairs) action - along with our heroes all being severely stubborn, which is a huge reason why the Matt/Karen/Foggy trio works so damn well.And it has that scene. This season's had an ample amount of great moments so far, but Karen's sit down with Fisk is a damn knock-out punch. I feel like it's the longest scene of the season so far, save for maybe some Matt/Sister Maggie moments, but it uses the time to just crush us emotionally. And in a way that really bolsters Karen and turns her into a roguish superpower of wicked righteousness.Both characters, to varying degrees, get rattled and shaken, trying to out-needle one another with half-threats and personal digs. But neither are allowed to lose their cool. Not Fisk, when Karen speaks about his mother and the murder of his father, and not Karen, when he brings up the fact that he knows about Matt being Daredevil. It's a thrilling game of mental chicken. Karen has to get Fisk to break. The moment when she turns the tables, doesn't give in, and brings up (in whispered tones) her killing of James Wesley is a masterstroke. Deborah Ann Woll is able to paint Karen with the perfect combination of vulnerability and strength.\n\nOf course, Karen is also on a suicide mission of sorts. Not fully, but she's relying on Fisk to snap and attack her. She's also willing risk the FBI possibly overhearing what she tells Fisk about Wesley to get him to become violent. And the show tricks us, in a rather cheeky manner, by having the agents rush in and cuff her. Because for a moment it was like \"Did they hear her confess?\" All in all, it seems like this is going to bite back at Karen badly because nothing gets brought up this many times without paying off. Following that rule, Fisk also mentioned that murder hammer a few episodes back, so that just might be what does him in too.Speaking of purposeful writing, you didn't think Sister Maggie bringing up the brief period of time when she left the convent was a dead end, did you? When she shared her past life doubts with Matt, recalling a moment when she wondered about her own path? Comic fans, of course, aren't surprised by the reveal that Maggie is Matt's mom. It was going to come out at some point this season. My worry is that this will stop Matt in his tracks and spin his wheels for way too long. One of the best parts about Episode 7, \"Aftermath,\" was how it could have chosen to lay everyone down for the count, but didn't. \"Upstairs/Downstairs\" carries the ball, and that charged momentum from the previous episode, in an effort to come at Fisk from all sides. But what will happen to Matt now that he knows Maggie's been lying to him his entire life? Back when he needed a parent but was forced to live life as an actual orphan, right under her nose, because she refused to acknowledge him as her son? This has to floor him and take him off the board a while, I feel.Hey, Agent Nadeem still lives! He makes it through \"Upstairs/Downstairs\" semi-scathed, but now he's got a hit out on him. Nadeem's still dead set on taking down Fisk, along with Poindexter, at great risk to himself and those around him. Unfortunately, Fisk's still manipulating Dex from afar - even going so far as to have Julie murdered (this is for the pizza!) and faking blow off texts to Dex in order to unspool him. Because of this, Matt and Nadeem aren't able to get the drop on Dex like they want and a very clever and cool fight ensues involving Dex ricocheting freakin' bullets off a fire escape across the street so they'll hit his foes in an apartment above him. Then there are the chandelier shards he chucks at Matt! It stands to reason that at least one of these episodes won't have a cool action sequence, but it really hasn't happened so far.Also, not to be overly morbid, but I'm glad they eliminated Julie. Not because I wanted her to die per se, but she'd just finished agreeing to let Dex back into her life, even act as his therapist and it didn't sit all that well with me. I get that she's kind and charitable, but Dex comes with so many damn red flags and warning signs that all I could do is scream at the TV and ask \"Nooooo, what are you doing?\" But since this season is whacking moles right as they pop up, she gets taken out almost immediately following this. And then the plastic paint tarp is brought back later when Fisk thinks he might have to kill Dex. That's a fun beat.\"Upstairs/Downstairs\" is a busy, intense, and rewarding episode that showcases all our heroes battling back against Fisk, in their own way, and getting thwarted because he's always several steps ahead of them. Despite some twists and cool action though, it's Karen's mesmerizing meeting with Fisk that steals the story this time around. Next up: Our review of Daredevil Season 3, episode 9.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}