{"id": "The Best PS4 Games", "paragraph": "If you’re just now picking up a PlayStation 4 or PS4 Pro, you’re in luck — there are a lot of fantastic games to play. So whether you’re just buying a system, or have owned once since the 2013 launch and are looking to play the greatest hits, these are the best 25 games you can play, as ranked by a group of our biggest and most knowledgeable PS4 fans.Review scores factored into compiling this list, but the ranking takes many more aspects into account. The ways these games take advantage of the PS4, the design risks they’ve taken, the unique experiences, the influence they’ve had on the industry, and more all played a role in helping us narrow down the system’s wide library to just 25 games. (One caveat — we did not include PSVR games, as the intention of this list is to suggest what someone picking up just a PS4 or PS4 Pro console should play, and so we can't necessarily expect new buyers will have a PSVR setup.)The selection for this iteration of the list, made up of games released before Oct. 15, 2018, included Jonathon Dornbush (News Editor), Andrew Goldfarb (Executive News Editor), Lucy O’Brien (AU Games & Entertainment Editor), Brian Altano (Host/Producer), Barrett Courtney (Gameplay Producer), and Dan Krupa (UK Managing Editor).If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.\n\nAs our Yakuza Kiwami review notes, this update \"makes great strides\" in reviving the original Yakuza game, thanks to \"better combat, bizarrely charming side quests, and a gorgeous graphical revamp.\" A great entry point for those looking to dive into the longrunning franchise, Kiwami offers a \"fun trip through the tangled web of Japan's criminal underground.\"\n\nFrom our Assassin's Creed Odyssey review: “Assassin’s Creed Odyssey is a resounding achievement in world building, environment, and engaging gameplay with occasional problems throughout. Its incredible recreation of ancient Greece is something I’ll want to go back to long after I’ve finished its main story, and its excellent systems mesh together in a way that’s hard to beat. While there are definite rough edges, Odyssey sets a new bar for Assassin’s Creed games and holds its own in the eternal debate over the best open-world roleplaying games ever.\"\n\nFrom our Monster Hunter World review: “[Monster Hunter] World takes a dramatic leap into a look, feel, and size that feels truly new, simultaneously staying true to the series’ ideals by maintaining the addictive loop of combat, intimidating monsters and meaningful upgrades that fans love. The sheer depth and commitment required is still intense, but it clearly isn’t Capcom’s aim to court a casual crowd. This is as all-consuming and incredible a ride as ever.”\n\nAs our Final Fantasy XV review states, when we’re riding chocobos across the beach at dusk with our three friends and hunting iconic Final Fantasy monsters in a huge, picturesque open world, Final Fantasy XV feels like nearly everything we could want from a modern Final Fantasy. There is so much good here, so much heart - especially in the relationships between Noctis and his sworn brothers. And given that Square continues to improve the game with constant updates, XV is one of the best games in the series in a decade.\n\nMuch as our Nier: Automata review says, Nier is a crazy, beautiful, and highly entertaining journey full of nutty ideas and awesome gameplay. It may not include the most sensical story or compelling characters, but its frenzied combat -- coupled with beautiful visuals and a stunning soundtrack – make it too much fun to pass up.\n\nFrom our Guacamelee! 2 review: \"Guacamelee 2 is a hilarious, challenging, and rewarding follow-up to Drinkbox’s original. It expands on the first’s ideas in so many great ways, and marries a complex but understandable set of moves to both its combat and platforming. While a few more additional moves would have been nice, this new adventure offsets some of the saminess with wacky, one-off gameplay experiments that are often a blast to experience.\"\n\nThe legacy of Dark Souls can't be understated – not only is it one of the best action RPGs of all time, it also helped redefine the genre in just a few years. With updated graphics and much more stable multiplayer options, Dark Souls Remastered is now the definitive way to play.\n\nAs our Celeste review said, Celeste is a surprise masterpiece. Its 2D platforming is some of the best and toughest since Super Meat Boy, with levels that are as challenging to figure out as they are satisfying to complete. But the greatest triumph of Celeste is that its best-in-class jumping and dashing is blended beautifully with an important and sincere story and an incredible soundtrack that make it a genuinely emotional game, even when your feet are planted firmly on the ground.\n\nFrom our Dead Cells review: \"Dead Cells is rewarding in its flexibility in a way few games are. Each easily digestible run through its beautifully detailed and shifting levels instills a feeling of discovery and familiarity. It goads you to push the limits of your ability, and mercilessly crushes you when you get too comfortable. There are layers of strategy and tactics buried not only in the immediate choices you make, but in the grander metagame each run builds toward. Dead Cells is a triumphant union of instinct, forethought, fun, and failure.\"\n\nFrom our Shadow of the Colossus PS4 review: \"The true definition of a classic, the gameplay and story of Shadow of the Colossus are every bit as great and emotional today as they were in 2005. This outstanding remaster skillfully enhances those qualities with improved controls, performance, and sheer graphical beauty. It remains one of the best PlayStation games ever made, and it’s wonderful that Sony has brought it back to the fore so a new generation of gamers can experience it without having to look past its aged facade.\"\n\nMuch like our Rocket League re-review from 2017 said, the idea of rocket-powered cars flipping through the air in Thunderdome-esque matches of cage-soccer sounds like the incoherent ramblings of a madman, but it turns out to be just crazy enough to work. Psyonix’s Rocket League, the follow up to Supersonic Acrobatic Rocket-Powered Battle-Cars, finds dumb fun in pulling turbocharge-assisted front flips in an ice cream truck, and the white-knuckle strategy in working with your team to control the giant ball on offense and defense. The fast and fluid absurdity of Rocket League fuses into one hell of a good time.\n\nAs our The Witness review mentions, this puzzler has a power and pull that carried us through its wonderful journey. Its graceful combination of tangible goals, obscurity, and freedom creates ample opportunity for small victories and grand revelations alike. Its themes weave themselves beautifully throughout the gorgeous world and wide variety of puzzles, and the sense of accomplishment you feel after completing a particularly-tricky puzzle is unrivaled.\n\nAs our original Overwatch review said, Blizzard's multiplayer shooter is an incredible achievement in multiplayer shooter design. It manages to maintain addictive, fast-paced action whilst also demanding thoughtful strategy. There are an array of masterfully balanced classes and characters, and it’s that diversity that really defines Overwatch. The group seem like they should look utterly ridiculous standing next to each other, or even belonging in the same battlefield, but Overwatch lives at an intersection between design and artistry, and tactile joy and refined, intelligent gameplay.\n\nAs our Ratchet and Clank review says, the latest entry is a culmination of everything Insomniac has done with the series over the past 14 years. It takes the characters that we fell in love with long ago, and sets them off on their most gorgeous quest yet. The deep and rewarding weapon system, beautiful and varied worlds, and charming-as-heck story make it an adventure that anyone with a PlayStation 4 should strap in for.\n\nAs our The Last of Us Remastered review notes, The Last of Us is one of the very best games on the PS3, so it makes sense that Remastered is one of the very best on PS4. Naughty Dog’s harrowing tale of trying to find hope in a hopeless world tells one of the most emotional stories that our medium has ever seen. While the core single-player game is more than enough to make this list, the addition of a fantastic multiplayer suite and the incredible Left Behind DLC makes Last of Us: Remastered a must-have on PS4.\n\nFrom our Fortnite: Battle Royale review: \"Mastering Fortnite Battle Royale’s many systems is worth every second of investment. Whether you go it alone or queue up with a squad, even if you’re the first to die or you actually manage to earn the Victory Royale, Fortnite’s zany style and unique blend of shooting and building almost never offers anything less than an outstanding time. It may not be the first battle royale game, and it certainly won’t be the last, but Fortnite sets itself apart from the crowd by giving you the freedom and tools to express your own personal playstyle.\"\n\nThe PlayStation 4 edition of Grand Theft Auto V earns extra points for taking an already huge, deep game and adding more soundtrack songs, more props to cutscenes, more vehicles, and, biggest of all, an incredible first-person mode that makes the already seminal GTA V feel like a completely different game. And, as echoed in our original GTA V review, with an open world so packed to the brim with an attention to detail, it's little things that combining together that make GTA V on PlayStation 4 a definitive experience on the young console.\n\nAs echoed in our Uncharted 4 review, the sequel combines the kind of realistic beauty that stops you in your tracks with a level of blockbuster storytelling that’s rarely seen in games. The adventure takes you across multiple totally diverse countries, uncovering an alluring mystery about politics, betrayal, pirates, relationships and responsibility, both in the present day setting, and in the game’s fictitious history lesson. Smooth, third-person action is spaced apart by genuine, heart-felt character moments that are likely to get you invested whether you’ve played and loved the Uncharted trilogy or this is the first one you play. To top it all off, there’s a solid multiplayer component, too, which maintains the series’ proud style and polish.\n\nFrom our Marvel's Spider-Man review: \"...What I didn’t expect from Spider-Man was to come away feeling just as fulfilled to have inhabited the life of Peter Parker. Aside from a few odd pacing issues, which momentarily took me out of the experience of being a superhero, and a world of optional missions that don’t always quite live up to the heft of the main story, Insomniac has delivered a Spider-Man story that both surprised and delighted me, coupled with gameplay that made me feel like Spider-Man nearly every step of the way. The Wall Crawler’s open world doesn’t consistently deliver the thrilling moments of its main campaign, but the foundation laid here is undoubtedly a spectacular one.\"\n\nIn a time seemingly all about various genres and franchises stepping out into the open world format, Metal Gear Solid V stands tall above the rest in terms of adapting its gameplay to the new structure, as we mentioned in our MGS V review. Where some other franchises struggle to maintain their identity within a sandbox, Metal Gear’s thrives on it, turning all that open space into a tactical espionage playground. It hands you a useful set of weapons, gadgets, helpers, and support abilities and incorporates them all masterfully into the minute-to-minute gameplay, empowering you to conceive and execute a plan your way. No game in recent memory has rewarded player intelligence so generously.\n\nAcross a vast and beautiful open world, Horizon: Zero Dawn, as said in IGN's Horizon review, juggles many moving parts with polish and finesse. Its main activity - combat - is extremely satisfying thanks to the varied design and behaviors of machine-creatures that roam its lands, each of which needs to be taken down with careful consideration. Its missions are compelling thanks to a central mystery that leads you down a deep rabbit hole to a genuinely surprising - and moving - conclusion. It also doesn’t hurt that it’s one of the absolute best looking console games ever made.\n\nAs noted in IGN's Persona 5 review is a massive, gorgeous JRPG with well over 100 hours of gameplay for completionists. With more to do than ever and the series’ strongest story to date, it stands out as an extraordinary, memorable experience and easily one of the deepest JRPGs of the last decade. Its sprawling dungeon design and stylish, fully realized world are an absolute joy to explore. This is a new gold standard for Japanese RPGs and by far the best entry in the series yet.\n\nThe Witcher 3, as our review mentionsz, is a remarkable feat of open-world design savvy. Its two main sandbox areas are beyond massive, but their density actually matches their breadth. You can't go anywhere within its breathtaking landscapes without running into things to do. The best part is that almost every point of interest you come across ties back into one of the deepest lore pools in gaming, providing motivation, and context for its detailed RPG systems and its brutal, responsive combat.\n\nAs mentioned in IGN's review, Bloodborne is an amazing, exacting, and exhausting pilgrimage through a gorgeous land that imposes the feeling of approaching the bottom of a descent into madness. From Software has taken the formula they conducted with the Souls games, and injected it with a sense of speed, anger, and urgency that makes for an unforgettable experience. There’s an incredible power to unlocking its mysteries, and in succeeding, despite its demand for a pound of your flesh.\n\nFrom IGN's God of War review: \"I expected great action from God of War, and it delivers that handily. But I didn’t expect it to be a thrilling journey in which every aspect of it complements the others to form what is nothing short of a masterpiece. It’s a game in which Kratos, a previously one-note character, becomes a complex father, warrior, and monster, embattled both on the field and within his own heart about how to treat his son; one in which the world opens up and shifts, offering rewards in both gameplay and knowledge of its lore that I treasured with each accomplishment. The obvious care that went into crafting its world, characters, and gameplay delivers by far the most stirring and memorable game in the series.\"Looking for a great deal on a PlayStation 4 or PS4 Pro? Be sure to check out our guide to the best PS4 deals.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}