{"id": "Guardians Fans Spend Over $4K on Rehire James Gunn Billboard on Way to Disneyland", "paragraph": "Fans of director James Gunn created a website and paid a company $4,000 to run a digital billboard just outside of Anaheim, CA to show their support for Gunn and Guardians of the Galaxy Vol. 3, reported by THR.The billboard is just four miles away from Disneyland in Anaheim and reads, \"Save the Galaxy: James Gunn for Vol. 3.\" It also has the group's website at the bottom in large letters, RehireJamesGunn.com.A GoFundMe campaign was created last month to raise money for billboards to be posted outside both Orlando and Anaheim Disney Parks. The group's goal shows a total of $12,000, with close to $5,000 already being raised.\"One billboard near each park for at least one month, preferably during the holidays to maximize exposure,\" the GoFundMe page reads.A group of fans originally started the group and website after Gunn was fired from Guardians of the Galaxy Vol. 3 last July due to conservative personalities on social media resurfacing old tweets that held controversial topics and jokes.\n\n29-year-old Ohio chef, Giuseppe Cincinnato and one of the people behind the billboard, told THR it is to show their campaign is \"not just all online outrage.\"\"We really love Gunn as both a creator and the man we've seen him mature into,\" Cincinnato said. \"Even if this wasn't going to cause Disney to see their mistake, we could at least show James Gunn how much support he has in his corner of the galaxy.\"The digital billboard will be up through Nov. 25 and the group said they would like to get a more expensive billboard up before the holidays, as well as a little closer to Disneyland if they raise enough money.The current billboard is located at 13541 Newhope Street and can be viewed from the 22 eastbound freeway before the Harbor Blvd. exit.Since Gunn's firing, the Guardians of the Galaxy cast has publicly asked for him to be reinstated and a Change.org petition has over 422,000 signatures and continues to climb.\n\nEarlier this month it was confirmed that Gunn has connected with Warner Bros. to write the script for Suicide Squad 2, and will possibly be directing the film as well. Following Gunn's departure from Disney, IGN took a look at some other DC properties he might be a good fit for.Jessie Wade is a news writer for IGN and loves the Guardians' franchise. Follow her on Twitter @jessieannwade.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}