{"id": "Call of Cthulhu Review", "paragraph": "It doesn’t take long for Call of Cthulhu’s dark and intriguing detective story to rapidly spiral down the well of occult madness. Inspired by the legendary Chaosium RPG of the same name, it tells its Lovecraftian tale with writing so strong that I couldn’t help but get sucked into the immersive atmosphere it created. The story itself can be confusing in spots, and some rougher mechanics and levels do rear up occasionally, but Call of Cthulhu still delivers what is perhaps one of the finest cosmic horror experiences in modern gaming.The hero of this story is Edward Pierce, a grizzled veteran and alcoholic PI who acts mostly as a blank slate for you to experience the story through. There really isn’t much to the character beyond the many choices you make for him, shaped by which skills you choose to upgrade. In the beginning, I found Pierce’s somewhat wooden portrayal a little jarring, but as I made him my own by focusing heavily in the stats that intrigued me most – like Investigation and Eloquence – and then leaned on those skills in my conversations and investigations, I rapidly became invested in his tortured tale. \n\nA Pierce skilled at Eloquence and knowledgeable about medicine will be able to notice certain things and coax out certain clues that a more Strength-focused Pierce with a penchant for the occult might not, and vice versa. The finest writing in a very well-written game often comes as a reward for investing deeply into a skill and clearly defining what your particular Pierce is good at. Near the tail end of things, my mastery of the Occult skill provided me with my favorite exchange of dialogue in the entire adventure.Hunting for clues in Call of Cthulhu’s detective sections is a true highlight. The story begins in almost rote pulp fashion – Pierce, the PI with a history, gets a weird case in a weird place and immediately sets to work. Very, very little is revealed at first glance, and it is only over its 15-hour campaign that clues are dug up and the bigger picture starts to piece together. Finding those clues in Call of Cthulhu’s detective sections is a true highlight – I enjoyed investigating the well animated and atmospheric environments, reading notes and books, and taking in environmental hints. In certain key areas, Pierce can “reconstruct” events that occurred, and when the information hard-won by thorough detective work meshes with the information these fun “CSI Cthulhu” segments reveal, magic can happen. Several times I found myself leaning forward in my chair, my brain fully engaged on piecing together what I’d seen, only to lean back with a breath and a “wow” when the answer clicked in my head, not simply because I was told it.All too often, dialogue options feel stunted and unimaginative in games of this nature, but Pierce always seemed to have the same questions that I had. In many cases, you are only allowed to ask one question of the many available to you, but this never felt restrictive, and indeed made me consider what I wanted to learn most in any given conversation. It’s a nuanced, engaging take on a detective game, and the chapters that highlight these mechanics are the best in Call of Cthulhu. Unfortunately, a small handful of chapters introduce stealth mechanics, and, extremely briefly, even a couple of combat scenarios and chases. The stealth is the definition of bland, not particularly difficult but rendered agonizingly slow by labyrinthine environments that look so similar room to room and hallway to hallway that it’s easy to get turned around. The combat is shoehorned, as basic as point and click, and completely jarring and unnecessary given the tone of the rest of the experience.I can understand the desire to inject some variety into the occult investigation, but the combat and chase asides just don’t really work. Call of Cthulhu’s one attempt at a boss encounter, a claustrophobic cat and mouse game with a true Lovecraftian horror, is wonderfully atmospheric and very tense, but so obtusely designed that it was difficult to ascertain what I had to do to progress. That made a scary moment quickly evolve into a frustrating one. I can understand the desire to inject some variety into a dark occult investigation, but these asides just don’t really work.Thankfully, as Call of Cthulhu goes on, those segments become fewer and farther between (or at least feel like they do), and it eventually begins leaning into its source material in earnest. Call of Cthulhu puts its own spin on the lore from the original H.P. Lovecraft short story, wraps it in a detective tale, and sends Pierce tumbling down the rabbit hole to Insanity Town. The deeper you dig, and the more you learn, the more Pierce’s sanity comes under attack, and the more the truth lurking behind the facade that is reality comes poking out. Knowledge is not strictly a good thing in Lovecraftian cosmic horror, and while elusive answers might be satisfying to the player, they do a number on Pierce as he shambles inexorably down a road that ends in brain rending revelation. To share much more would risk spoiling an extremely authentic and well-written story, but rest assured, it’s trippy, frightening, and asks as many questions as it answers. \n\nPart of that impact comes from the sheer sense of weight and atmosphere Call of Cthulhu provides. The environment animations are fantastic – from a musty old bookstore to a decrepit portside tavern to dark and claustrophobic caves, the sense of place I got from each new area was immediate and impactful. The sounds populating these spaces are just as good. Even after stepping away, the baritone chanting of cults or the shrieking wails of an asylum’s mistreated patients stuck with me for a good while. Turn off the lights and put on good headphones for this one.Call of Cthulhu is a tight, brisk journey, and while the ending was incredible, the immediate lead-up to it felt a bit rushed, with revelations and twists hitting fast and furious. I suppose the result was that I felt just like Pierce did – exhausted, overwhelmed, and dizzy with the sheer toxic heft of what I had learned. Different choices and different uncovered clues can shape these final moments, and it doesn’t seem possible to see and experience everything in one playthrough. The lingering sense of mystery and the brief length make Call of Cthulhu unimposing to replay, and I plan on diving back in with a completely opposite Pierce to see what madness I might have missed.Call of Cthulhu is a dark ride through a mad, cosmic horror nightmare with a paranormal detective story as your vehicle. Occasionally poor level and encounter design can make the eerily atmospheric road a little bumpy, but the engaging mystery and an intriguing utilization of RPG mechanics make it one of the more enjoyable Lovecraftian games in years.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}