{"id": "Game of Thrones Prequel Casts Naomi Watts in Lead Role", "paragraph": "HBO's Game of Thrones prequel has cast Naomi Watts in a lead role, IGN has confirmed.The untitled prequel, written by George R. R. Martin and Jane Goldman, is set thousands of years before the events of the hit HBO series, taking place during the Age of Heroes and tracing civilization's fall into a dark period known as The Long Night.Per HBO, Watts will play \"a charismatic socialite hiding a dark secret,\" although her character's name is not being revealed. Much like Game of Thrones, the prequel has been designed as an ensemble, with HBO boss Casey Bloys telling Deadline, “There are very strong female characters but it’s an ensemble, there are men and women. Jane is a very good writer, we don’t want to limit her to writing female leads. There are a lot of very complicated leads in [the pilot].”The official logline for the series reads: \"Taking place thousands of years before the events of Game of Thrones, the series chronicles the world’s descent from the golden Age of Heroes into its darkest hour. And only one thing is for sure: from the horrifying secrets of Westeros’s history to the true origin of the white walkers, the mysteries of the East to the Starks of legend… it’s not the story we think we know.\"Goldman will serve as showrunner on the prequel and wrote the teleplay for the pilot based on a story she conceived with Martin. Executive producing alongside Goldman and Martin are James Farrell, Jim Danger Gray, Vince Gerardis and Daniel Zelman, with Chris Symes serving as co-executive producer.Watts' last TV role was as the lead of Netflix's shortlived drama series Gypsy. On the big screen, Watts most recently starred in Ophelia opposite Daisy Ridley, and will next appear in Once Upon a Time in Staten Island, The Wolf Hour, Boss Level, and Luce.For more on the Game of Thrones prequel, check out our explainer on the Age of Heroes and some of the events that we'd like to see in the new series. We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}