{"id": "10 Best English Dubbed Anime Series", "paragraph": "Whether you’re new to anime and seeking an accessible entry point, a longtime fan who could use a break from reading subtitles, or just looking for an excuse to revisit a classic show in a fresh way, a quality English dub has a lot to offer. As such, we’ve put together a list of some of our favorite anime dubs. Please note we opted to keep movies off this list in favor of specifically highlighting the best English dubbed shows.Check out our picks for the 10 best English dubbed anime series in the slideshow below, or scroll down to see the list. \n\nDragon Ball is without question one of the most popular and recognizable anime franchises outside of Japan, and Funimation’s spectacular English dub of Dragon Ball Z is a huge reason why. Centered around Goku, who’s voiced by the wildly talented Sean Schemmel, DBZ chronicles the adventures of the aforementioned super powerful Saiyan and his friends as they fight to protect humanity from various alien threats. While yes, Dragon Ball Z is known for its crazy, over-the-top action, its beloved cast of eccentric and unforgettable characters is what has truly made Dragon Ball the phenomenon it is today. This is due in no small part to the involvement of one of the most prolific and talented voice actors ever, Christopher Sabat, who does an unbelievable job bringing multiple characters from the series, including Vegeta and Piccolo, to life. — Alex OsbornEnglish dub streaming on Funimation \n\nCowboy Bebop changed the game for anime dubs, not only because it was the flagship show of Adult Swim’s action block in 2001, but also thanks to the brilliant performances by Steve Blum, Beau Billingslea, Wendee Lee, and, truthfully, the entire cast. It also helps that Cowboy Bebop was just a very special anime series all on its own, a type of which hadn’t been seen before on western shores by a mainstream audience. It’s a deeply grounded anime with a mature story about a crew of bounty hunters, each with their own emotional baggage, who cruise the solar system in search of riches, but usually wind up coming face to face with the demons of their past instead. All of this paved the way for some of the best acting in dubbed anime for its time, and even today, Cowboy Bebop stands the test of time as one of the best dubs ever. — Mitchell SaltzmanEnglish dub streaming on Funimation and VRV \n\nFew English dub anime voice actors have a fanbase as large as Vic Mignogna, thanks to his career-defining performance as Edward Elric in Fullmetal Alchemist. While the original 2003 series is fantastic, the 2009 adaptation, Fullmetal Alchemist: Brotherhood, which adheres more closely to the source material and arguably tells a more cohesive story, is the one that earns a spot on this list. The story centers around two young alchemists, Edward and Alphonse, as they search to find a way to restore their bodies, after an attempt to bring their dead mother back to life goes horribly wrong. While humor and drama can sometimes get lost in translation for dubs, Brotherhood’s fantastic English script, brought to life by an expansive and diverse cast of incredible voice talent, will have you laughing, cheering, and crying throughout the course of Ed and Al’s journey.  — Alex OsbornEnglish dub streaming on Crunchyroll, VRV, Netflix, Amazon, and HuluOne of the great things about English dubs is that in the rare case of an anime that largely takes place in a portion of the US with distinctly American accents, they can lend an added layer of authenticity that isn’t present in the original. Such is the case with the Baccano! dub, much of which takes place in 1930s New York, and has such great actors as Todd Haberkorn and Bryan Massey rocking their best New York gangster voices. The story is complex but compact, with the central plot revolving around serial killers, mobsters, con artists, and straight up crazy people, all tied together by a runaway train and the pursuit of immortality. Even beyond the accents, though, Baccano! is just superbly acted all around, with a great script to boot that enhances the villainy of its bad guys and affability of its good guys. — Mitchell SaltzmanEnglish dub not currently available for streaming \n\nThe heartbreaking story of piano prodigy Kousei Arima is one of the most gripping and well told narratives in all of anime, and the incredible English dub for Your Lie in April only elevates its impact. Voice actor Max Mittelman perfectly captures the turmoil Kousei finds himself in, emotionally broken after the death of his mother. The other core characters are also superbly cast, with Erica Lindbeck doing a standout job as the bubbly and spontaneous violinist Kaori Miyazono, and Erica Mendez nailing Kousei’s spunky and sometimes brash childhood friend, Tsubaki Sawabe. The writing is often poetic, and the delivery of the dialog marries beautifully with the soundtrack to heighten the melodrama. If you’re looking for an emotionally exhausting and cathartic anime that compromises nothing in its translation to English, you’d be hard pressed to find one better than Your Lie in April.  — Alex OsbornEnglish dub streaming on Crunchyroll, VRV, and Netflix Yu Yu Hakusho stands shoulder to shoulder with Dragon Ball Z not only as one of the most influential action anime of the 90s, but also as one of the highest profile dubs of the early 2000s. The English dub definitely has that “Early 2000s” sound to it, where studios hadn’t yet completely figured out how best to deal with the challenges that come with dubbing. That being said, the script adaptation is so good in the Yu Yu Hakusho dub, and it injects so much more energy and comedy into the anime that simply doesn’t exist in the original Japanese version, that any instances of awkward line deliveries barely even register. Not to mention the fantastic performances of Justin Cook and Christopher Sabat, who each give one of their most memorable performances of their storied careers as Yusuke Urameshi and Kazuma Kuwabara, respectively. — Mitchell SaltzmanEnglish dub streaming on Funimation, VRV, and Hulu Searching for the Lunar Flower that will lead them to Paradise, four wolves fight for hope in a desolate, post-apocalyptic world. Wolf’s Rain’s entrancing plot, haunting music, and complex characters are truly enhanced by the English dub voice cast. Johnny Yong Bosch, who was also the second Black Power Ranger, has a voice that matches his character Kiba, a young lone wolf seeking to fill the void and sadness he has come to know in his harsh (and literally ice cold) surroundings so well. His monologues are touching and emotional, and the dialogue between the rest of the pack, whether they’re bonding or fighting, hit the right tone. Voicing a serious, tragic anime can be very challenging, but the Wolf’s Rain dub pulls it off. It will have you wrapped up in the story and rooting for their journey to end successfully. — Jacki JingEnglish dub streaming on Funimation and VRV Golden Boy is a six-episode OVA about studious protagonist Kintaro Oe’s journey to enrich his life by moving from job to job, learning from each experience as he goes. Typically, these jobs involve getting into compromising positions involving beautiful women. Rather than going into specifics, let’s just say if you’re a parent, you wouldn’t want to let your kid watch Golden Boy, or, if you’re a kid, you wouldn’t want your mom to walk in on you watching it. Golden Boy is not one of the best anime on this list, nor is it one of the best acted. However, it will forever go down in anime dub history one of the most hilarious dubs of all time, and that is 100 percent thanks to the unforgettable performance of Doug Smith, who throws every ounce, every single fiber of his being, into the role of Kintaro. In just about any other anime, Smith’s overacting would be a detriment, but in Golden Boy, it actually helps sell the fact that Kintaro is the ultimate anime tryhard. — Mitchell SaltzmanEnglish dub streaming on Crunchyroll and VRV \n\nTeenage boy Ryuji Takasu has a crush on the best friend of Taiga Aisaka, who just so happens to have eyes for Ryuji’s best friend. Upon realizing this, Ryuji and Taiga form a pact to help each other win the hearts of their respective friends. It’s a fairly well worn premise for romantic comedies, but the way in which Toradora! executes on it is second to none, thanks to an instantly lovable cast of characters and just the right balance of humor and drama, which is elevated by the excellent English dub. Cassandra Lee Morris does an amazing job capturing Taiga’s spunky, hot-headed personality, and Erik Scott Kimerer’s fantastic performance perfectly captures Ryuji’s calm, collected, and often self-conscious demeanor. If you’re looking for a quality anime rom-com, you likely won’t find one better than Toradora!, and the fact that it has an amazing English dub is just icing on the cake. — Alex OsbornEnglish dub streaming on Crunchyroll and VRV Fate/Zero is directed by Tony Oliver and features Crispin Freeman, two of my own voice acting mentors and teachers, so I may be biased, but Fate/Zero’s dub is something special. It serves as a prequel to Fate/Stay Night, covering the events of the fourth Holy Grail War, with Shirou Emiya’s mentor and father figure, Kiritsugu Emiya, serving as the main protagonist of the show.  Fate/Zero is the perfect match of AAA anime storyline with AAA cast, featuring a collection of voice acting’s finest, from Matt Mercer and Kari Wahlgren, to Johnny Yong Bosch and the aforementioned Crispin Freeman, and that’s just to name a few. Fate/Zero is one of my favorite anime of the last 10 years, and that’s largely thanks to its extremely complex characters, who are brought to life flawlessly by the English dub cast. — Mitchell SaltzmanEnglish dub streaming on Crunchyroll, VRV, Netflix, and Hulu Did your favorite English dubbed anime series make the list? What other noteworthy shows do you think also deserve a mention? Let us know in the comments, and for more on anime, check out IGN’s mini-series Anime Omake.Alex Osborn is IGN's Associate Homepage Editor. You can follow him on Twitter @alexcosborn. Mitchell Saltzman is an Associate Gameplay Editor for IGN. You can follow him on Twitter @jurassicrabbit. Jacki Jing is a host/producer for IGN. Follow her on Twitter at @jackijing.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}