{"id": "Breach Blends All Your Favorite Game Genres with Mythology", "paragraph": "Breach is a potent mixture of the last decade of game design. Like something engineered in an off-the-grid laboratory, its a multi-headed creation spliced together with DNA from hack-and-slash action games, hero shooters, MOBAs, and MMOs. It’s currently growing and coming into its own, boiling down that blend into a jump-in-and-play experience of quick 15-minute solo, cooperative, or competitive matches.After getting hands-on with a healthy section of the technical alpha, what surprises me most about Breach is how well that insane-sounding concoction works. You pick a class – complete with its own basic attacks, skill shots, and abilities – and fight through a series of maps that are broken into six sectors. Each sector has an objective, so you and up to three other players fight to complete the objective in the allotted time while the enemy team of monsters, minions, mythological nightmares, and in some modes player-controlled demons tries to delay or stop you.\n\nIf your team is able to hold the control points, gather enough resources, activate the uplinks, etc. in time, you win the sector and gain some in-match progression to power up your character. If you don’t, the enemy team gets those much-needed buffs. Once you finally blow through the gauntlet of objective-based sectors, you’re thrust into an arena for the final showdown against a massive, mythological boss encounter like the Baba Yaga.What struck me hardest about my time with Breach was how uniquely different classes changed the experience – where swapping classes really feels like you’re swapping game genres. On my first attempt I used a Gunslinger which is a straightforward third-person shooter damage dealer. I would dodge, fire of shots, lay down a cone of bullet spray and whip ricochet shots between spawned soldiers and minions. In some ways it reminded me of WildStar with a hint of Overwatch. It was familiar and satisfying.Eventually, you can start swapping out abilities from one class for another. But then I changed over to the Gladiator, which is all about isolating enemies and using melee attacks to knock them up and juggle with a skill rotation. It immediately reminded me of hack-and-slash action games like Devil May Cry and Darksiders, or Overwatch’s Doomfist-style smash-and-bash tactics in a third-person perspective.And as I was beating on things, one of my teammates whipped heals as an Arcane Mender, a healer akin to a priest from World of Warcraft, while the Mana Warrior bruised his way through the minion ranks like a traditional tank. The same level was completely different depending on which class you chose for that match.\n\nOf course the beauty of all that is you’re not bound to one class with a character. There are literally dozens of different classes. And while each class has its own progression tree for unlocking new abilities, you’re not tied to that discipline. Eventually, once you’ve got a healthy stable of classes to choose from you can start swapping out abilities from one class for another. In this way you can effectively create your own classes. Want to be a bruiser tank that can also do some long-range damage? Sure, go for it – there are endless combinations of class elements for you to craft your own playstyle.While the classes I played were fun and varied – admittedly, I’ve only played a small subsection of what’s available – the part of Breach that excites me the most is the Veil Demon. The Veil Demon is an otherworldly purple ball of wispy energy which can be controlled by a player in competitive modes to try and murder the other team with a menagerie of minions and elite creatures pulled from mythology.\n\nThe Veil Demon’s only job is to stop the “hero team” from completing their objective in a sector. To do this, it uses powers that start fairly pedestrian: build walls, lay mines, summon laser pylons, etc. And as the you progress through the match with the Veil Demon, you can do things like suck a player into a purple-hell dimension, or summon elite monsters like the Egyptian cat-goddess Bastet, or Anubis, or a massive mythological Foo Dog, to name a few.The playable Veil Demon can suck a player into a purple-hell dimension, or summon elite mythological monsters. At any time the Veil Demon can possess any creature, from lowly soldier grunts to the aforementioned nightmares. Watching an expert Veil Demon player put all those pieces together to really, truly, completely screw over the heroes is like watching the Mona Lisa of trolling come together from globs of paint. It’s horrible and perfect all at once and I really can’t wait to get to that level. This singular mode makes me think Breach is going to be something special to the streaming community as it sets itself apart with antagonizing moments that are fun to watch unfold.The story of Breach is as interesting, and varied, as its lofty gameplay designs. It’s set against the backdrop of a cosmic conspiracy theory that pulls mythology and historical fiction into the modern day, with elements that are strangely based in fact. So here’s the premise:\n\nAbout 70,000 years ago humanity was on the brink of extinction. Everything we've come to know of mythology was real, and coexisted with us, so humans were at the bottom of the food chain. Strangely enough, the whole “70,000 years ago” element is a thing rooted in science. The human gene pool was on the verge of extinction and scientists don't know why. Breach’s story plays off of that.70,000 years ago the human gene pool was on the verge of extinction and scientists don't know why. Breach plays off that. At some point back then a mysterious immortal came and said humanity is going to get wiped out by all this mythology: dragons, trolls, all that stuff. So he created The Veil to separate the Earth into two worlds – everything from mythology into one, and our Earth became the other. He gifted a subset of humanity with magic so they can maintain the veil over the ages. While most of the time they did it right, sometimes they messed up. So the guy in Ancient Crete who was drunk at the bar and insisted he saw a Minotaur, he did see it, that was real. It was because the mages messed up but they brought it back just in time.Fast forward to today and this immortal who's been among us this whole time realizes he made a mistake. Humanity is not what he was hoping it would be. Humans are on the verge of destroying the planet and he decides to burn The Veil down. To undo his meddling in the first place.It's this idea that humanity is either going to make it, or they're not, but this is their only chance. He has to return the world back to how it was supposed to be. So he tears down The Veil. When that happens, small subsets of people start to gain the ability to practice magic. So the now-not-so-secretive society of mages at the Library of Alexandria go out and start to collect those people to train and fight against the horrors of mythology that have been dropped into our world.All said, Breach is definitely something that will be interesting, no matter what when it comes to PC in the near future. My burning questions are about longevity, if it’s horizontal progression will be enough to keep me invested hundreds and potentially thousands of matches later, and how it evolves over time. But right now you can register for the technical alpha to try it out yourself.Breach is an exciting prospect on a horizon that’s perpetually saturated with multiplayer games designed to devour hours of your time. From everything I’ve played, the mechanical building blocks are all there. The premise is top-shelf, I-want-to-believe conspiracy theory, and the potential for streaming and spectating is undeniable. Breach is definitely something to keep one eye on over the coming months.Brandin Tyrrel is IGN's Xbox Editor. You can find him on Unlocked, or chat over on Twitter at @BrandinTyrrel.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}