{"id": "Update: Netflix, Warners Hit With $50 Million Lawsuit Over Sabrina Satanic Temple", "paragraph": "Update as of 11/08: The Satanic Temple has filed a $50 million copyright suit against Netflix and Warner Bros. that they publicly threatened at the end of October, Variety reports.The lawsuit was filed Thursday in U.S. District Court in New York, and states that Netflix's new series, The Chilling Adventures of Sabrina, has copied the organization's design of the statue of Baphomet. The suit alleges that four episodes in the show feature the statue and that producers of the series are now profiting from their work.In the lawsuit, the temple states that the statue was based on iconography from the 19th century, and was created in 2013 and 2014 for the organization itself. It outlines that multiple design elements of the statue were added to make it an \"original expression\" and therefore, subject to copyright.The original story follows:An organization called The Satanic Temple is threatening legal action against Netflix for copyright of the design of the monument to Baphomet in the newly popular series, The Chilling Adventures of Sabrina.As reported by The Wrap, the Temple's co-founder, Lucien Greaves, said on Tuesday that, “we’ve sent [Netflix] a letter from our lawyers informing them of the copyright violation, asking them to take our imagery out of their show.”The statue can be seen in multiple scenes while Sabrina attends the Academy of Unseen Arts.Greaves also is taking action against appropriating the organization's design, as he tweeted Sunday.“Yes, we are taking legal action regarding #TheChillingAdventuresofSabrina appropriating our copyrighted monument design to promote their asinine Satanic Panic fiction.\"Yes, we are taking legal action regarding #TheChillingAdventuresofSabrina appropriating our copyrighted monument design to promote their asinine Satanic Panic fiction.— Lucien Greaves (@LucienGreaves) October 29, 2018I'm amazed that anybody is confused as to why we would seek legal remedy over Sabrina using our monument. Would they be as understanding of a fictional show that used a real mosque as the HQ of a terrorist cell? A fictional Blood Libel tale implicating real world Jews?— Lucien Greaves (@LucienGreaves) October 29, 2018In an interview with SFGate, Greaves spoke more about the copyright claim and what he wants to come out of the legal letter.“It’s deeply problematic to us. (But) even if that wasn’t the case we’d be obligated to make a copyright claim because that’s how copyright works,\" Greaves said.\n\n“I want them to take it out,” Greaves added. “It looks like it’s a CGI facsimile to begin with. I don’t know how much work that takes, but I simply refuse to have our monument used in this way in perpetuity. I don’t want our monument to be associated with this.”While we sit tight with our spell books to see how this legal situation unfolds, check out everything we have on The Chilling Adventures of Sabrina in our hub, including our season 1 review where we give the new series a 9.2 saying, \"Sabrina shines in its deliciously dark plotlines, volumes of camp, and irreverent and at-times antagonistic humor.\"Jessie Wade is a news writer for IGN and wanted to be a witch ever since Sabrina the Teenage Witch premiered back in the 90s. Chat with her on Twitter @jessieannwade.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}