{"id": "Red Dead Redemption 2 Players Reporting HDR Issues", "paragraph": "It appears that the High Dynamic Range (HDR) implementation in Red Dead Redemption 2 may not be true HDR.According to Eurogamer, the video output of all versions of the game is derived from a Standard Dynamic Range (SDR) image, and therefore is not rendered in high dynamic range. Generally speaking, an SDR image doesn’t offer nearly as much contrast, color range or luminance as an HDR image, and Eurogamer claims that all of the limitations present in SDR are simply packaged in what the game is presenting as HDR.\n\nUltimately, Eurogamer says using HDR at recommended settings produces an image similar to what you get with HDR turned off, or it can even make the game look incredibly dim or overly bright if settings are tweaked in either direction.While many players agree with these claims, some feel the HDR is a noticeable improvement over the game’s SDR output. Reddit user travelsnake wrote \"Just tweaking the HDR calibration in-game gives me a massive amount of control over how dark or bright it gets. The game looks [noticeably worse] without HDR. I'm pretty sure it works at least with my configuration.”\n\nAnother user BLAQKROXSTAR mirrored this sentiment, saying \"Yea I tired turning off HDR because my video clips looked like trash and the game looks horrible without HDR.” Other personal anecdotes share mixed reactions, with some saying turning off HDR improves colors but harms contrast, and others calling for Rockstar to release a proper HDR patch as soon as possible.Many users are also reporting issues with blur on the PlayStation 4 Pro version of the game. Some fans took to RDR2.org to say they believe the checkerboarding in the PS4 Pro version is to blame for this blur, while others think HDR is the culprit. Rockstar support did allegedly tell one user that “We are currently hard at work fixing a few of the issues the community is facing.\"IGN has reached out to Rockstar Games for comment.\n\nIn other Red Dead Redemption 2 news, the game has experienced the second biggest entertainment launch of all time, selling through $725 million worth of copies in about three days.Colin Stevens is a news writer for IGN. Follow him on Twitter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}