{"id": "Daily Deals: PlayStation Classic in Stock Again, PlayStation 4 Controllers on Sale", "paragraph": "Welcome to IGN's Daily Deals, your source for the best deals on the stuff you actually want to buy. If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.Like me on Facebook and follow me on Twitter to get the latest deals.  Zelda: Breath of the Wild: Creating a Champion Hero's Edition for Discounted PreorderLet your love for Breath of the Wild continue to burn with a preorder for the hardcover edition of Creating a Champion, an art book with official sketches and design artwork. This special edition includes an exclusive cover, a Hyrule map printed on cloth, a print of the Champions, and a glass replica of a spirit orb. Set to release on November 20.  PlayStation 4 Controllers for $49 and UnderA number of PlayStation 4 controllers are on sale over at Walmart. Discounted controllers include the Black, Crystal, Gold, and Magma Red editions.Overwatch Tracer Figma for $45.50Standing at 10 inches, this Tracer Figma is a great way to get some Overwatch representation on your desk or figurine collection. Currently at its lowest price on Amazon.Mega Man X Legacy Collections on Sale (Digital, Switch)Still in the mood for some Mega Man after 11's recent release? Why not play through the Mega Man X series with two separate collections, both of which are currently on sale. Each collection features four different games. Discounts apply to the digital version of the Switch release. MagicMount Magnetic Phone Mount for $9A nice little mount to plop your phone onto. The strong magnetic top keeps your phone secure while the suction cup on the bottom locks the mount into place.Save 20% Off of a Steam Code for CupheadThis gorgeous sidescroller uses hand drawn animations that brings Cuphead to life. Seriously, it's awesome. Digital code sold on Amazon to be used with Steam.Our favorite 2D platformer is finally getting the Switch treatment. This set actually includes two games - Super Mario Bros U and Super Luigi U. Up to 2 people can play the side scrolling adventure together, and since each person only needs a single Joy-Con controller, you don't need to buy additional controllers for this game.Dell Outlet is currently offering up to 17% off Dell Outlet configs. Usually the compromise with refurbished items is the shorter (or lack of) warranty, but not with Dell Outlet. Dell Outlet PCs have the same 1-year warranty.Some current examples. For the Dell G series, I would strongly suggest the \"G7\" lineup since it has better build quality than the G5 or G3 for a very minimal price premium at Dell Outlet.Lowest price ever. The PS4 Gold Headset boasts comfortable ergonomics, 7.1ch surround sound audio, hidden noise cancelling microphone, and compatibility with both PlayStation consoles and PCs (with included dongle).Sony PlayStation Classic Available for Preorder at Best BuyPlayStation Classic is back in stock, this time at Best Buy. The retro system is not quite the frenzy we've seen with SNES and NES classic, but it has been sold out several times already. The consoles will ship out in December, right in the middle of the holiday shopping spree, and this may be your best chance.20 games will be pre-loaded, but the only titles we know of for sure are Final Fantasy VII, Tekken 3, Ridge Racer Type 4, Jumping Flash, and Wild Arms.This is the lowest price currently for this very capable video card. I have this card and I can run my Oculus Rift as well as Battlefield 1 and Witcher 3 at 1440p resolution without any complaint.The Strix cards are well known for being among the most silent and overclockable thanks to their beefy 2.5-slot cooling solution and slow running fans. They are also priced well above the competition. Lo and behold, here's a Strix card that's the least expensive of the bunch.Dell's TV sale is consistently one of the best places to find deals on 4K TVs. The deals are updated every Monday morning so if there isn't a TV you're interested in, just check back again. Most of the discounts are in the form of a Dell eGift Card, which can be used on anything at Dell (except other Dell gift cards). That includes gaming consoles, video games and accessories, gaming laptops and monitors, and much more.Get 20% off the scariest LEGO set ever made.You don't see too many true ergonomic keyboards geared towards the gamer. The Kinesis Freestyle Edge is one such rarity. On the ergo side, it features a true split key design (both halves connected by a braided cable). It even supports tenting with the optional lift kit. On the gaming side, it has your choice of Cherry MX mechanical keys, macro support, NKRO, and slick LED backlighting. You can also detach the right hand part of the keyboard if you want to game with just the left hand side.This is the lowest price ever for a very well-rated AC gaming router. This router boasts gaming and streaming friendly features such as MU-MIMO technology, WTFast Game Accelerator, and Adaptive QoS, dual-core processor for efficient multi-tasking, USB 3.1 port for shared storage or print server, and four Gigabit ethernet ports.We rated this game a \"Great\" 8.9/10. Seth Macy writes \"An abundance of modes and great gameplay make NHL 19 a real winner.\"We rated this game an \"Amazing\" 9.1/10. Dan Stapleton writes \"The excellent shooting action in Wolfenstein: The New Colossus is paired with a fantastically written and acted story.\"Nioh (PS4) for $19.99Split into six hardcover volumes, this anniversary set features 2530 pages of the classic manga. This special edition has only been on the market for over a year and includes a neat iron-on patch.This edition has just been announced! Even if you don't factor in the crazy Kingdom Hearts hype, the fact that you get 8 full-fledged games for an entry price of $39.99 is pretty insane. The list includes:I wouldn't be surprised if this preorder went out of stock really, really quickly.Buy a PlayStation 4 Pro, Get Red Dead Redemption 2 for FreeYou can get one of the most anticipated games of 2018 for free if you buy it with the PlayStation 4 Pro. Red Dead Redemption 2 is developed by Rockstar (the same folks who make the Grand Theft Auto series) and will be released very soon on October 26.Note, Amazon and Walmart are both sold out.The upcoming Super Smash Bros Ultimate themed controller is in stock on Amazon, but not for long. Besides the Joy-Cons, this Switch Pro is the only other licensed wireless Switch controller that supports motion controls, HD rumble, and built-in amiibo functionality.How can you get away with a 65\" curved 4K TV with solid image quality? Sceptre strips down all the features you don't need - like Smart functionality - and gives you the absolute lowest prices around. If you need Smart features, just get yourself an Amazon Fire Stick or Google Chromecast.For just under $250 you can score a brand new 4K HDTV with 120Hz refresh rate and built-in Chromecast functionality. You get free shipping on this order and you can extend your warranty to 3 years for only $26.If you want a big TV without breaking your budget, here's a 55\" 4K Smart-enabled HDTV for $320, plus you can extend the warranty to 3 years for a measly $26. To top it all off, you get free 2-day shipping.For only $10.99 per course, you can train yourself in tools, software, and programming languages specific to the gaming industry. There are thousands of course to choose from, and many of them are from accredited instructors that supply you with tutorials, training videos, assignments, and more. Taking the courses in school could costs gobs of money.Open in an incognito window to see this price.Black Friday is only 2 months away. BlackFriday.com and BestBlackFriday.com have already come up with a list of predictions on what will be the best deals during this upcoming holiday season. Check them out.BlackFriday.comBestBlackFridayMichael Koczwara is IGN's Weekend Web Producer. Follow IGN Deals on Twitter and Facebook, and subscribe to the IGN Deals Newsletter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}