{"id": "Undertale's Creator Is Teasing... Something", "paragraph": "Undertale’s creator Toby Fox is mysteriously teasing something, and whatever it is may be revealed tomorrow.Toby Fox tweeted out, saying it’s “really important” for those who completed Undertale to check the official Undertale Twitter account in 24 hours from when he posted the tweet early this morning. He says he wants to make something new using fan feedback, and a Windows PC or MacOSX PC is needed for whatever he has planned.For those who completed UNDERTALE it's really important that you check @UNDERTALE 24 hours from now.I want to make something new, and it all begins with your feedback.A Windows PC / MacOSX PC is needed. https://t.co/N1IJLyiswy— tobyfox (@tobyfox) October 30, 2018The official Undertale Twitter account has blacked out its thumbnail and visible username, tweeting out a series of all-caps messages suggesting something will be announced tomorrow. For reference, the characters Papyrus and Mettaton are both known to speak this way, though Mettaton stops doing this once he transforms into Mettaton EX.The full message spread throughout the tweets reads: “WELCOME. HAVE YOU BEEN LOOKING FOR ME? HOW WONDERFUL. I HAVE BEEN LOOKING FOR YOU AS WELL. I HAVE SOMETHING, SOMETHING I WANT TO SHOW YOU. SOMETHING I THINK YOU WILL FIND VERY, VERY INTERESTING. BUT IT IS NOT YET COMPLETE. NO, IT IS FAR FROM COMPLETE. THUS I HAVE A SMALL FAVOR TO ASK OF YOU. RETURN HERE IN [24] HOURS. AT THAT TIME, I WILL ASK YOU A FEW QUESTIONS. THEN, USING YOUR RESPONSES, WE WILL APPROACH ITS REALIZATION. THANK YOU VERY MUCH FOR YOUR TIME. I WILL BE IN CONTACT AGAIN SOON.\n\nWhat exactly Fox has planned is anyone’s guess, but whether it be an expansion to Undertale, a proper sequel, or a new project entirely will hopefully be cleared up by tomorrow morning.In our review of Undertale, we called the game a “Masterpiece” saying, \"It tells its story in such a dynamic way, and with such a great understanding of the RPG player’s mindset, that it couldn’t have been told in any other way.\"\n\nUndertale was recently released on the Nintendo Switch alongside 16 other games. For more on Undertale, read our Genocide walkthrough and Pacifist walkthrough of the game.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}