{"id": "Razer BlackWidow Elite Gaming Keyboard Review", "paragraph": "Be sure to visit IGN Tech for all the latest comprehensive hands-on reviews and best-of roundups. Note that if you click on one of these links to buy the product, IGN may get a share of the sale. For more, read our Terms of Use.Razer has updated its flagship mechanical keyboard, the BlackWidow Elite (See it on Amazon), adding the same media controls that first appeared on the recently released Hunstman Elite. Instead of having to use key combos to control media, the Widow now has a handy row of buttons as well as a slick multi-use wheel. Razer sent me the clicky Green-switch version to test, but it is also available with tactile Orange and linear Yellow switches as well. It's priced at the very top of the mechanical keyboard market, and has most of the bells and whistles you'd expect in a $170 keyboard. Here’s how it performed.The BlackWidow Elite is a full-size board with high-end materials and premium features. The hefty keyboard weighs around 2.9 pounds, thanks to its beefy metal top plate, which gives the keyboard a thoroughly premium feel (despite the rest of the body being plastic). The key switches are exposed above the plate, and are painted black (as are the stabilizers), keeping the aesthetic fairly clean.The plate doesn’t seem to pick up fingerprints, which is amazing—and more than I can say for the keycaps, which seem to get shiny almost immediately after touching them (yes, even after washing my hands). The RGB lighting underneath shines through the thin laser-etched legends very clearly. I wish there were textured PBT keycaps at this price, or at least double-shot injection molding, especially since Razer's non-standard bottom row all but eliminates the possibility of replacing the keycaps yourself. Bummer.Razer’s clicky Green switches are a tad loud, as you'd expect, and a bit higher-pitched than the Cherry MX Blues they’re modeled after. But the tactile click is subtle, and the 50g actuation force is just right, giving each keypress a smooth, satisfying feel. The newest version of Razer’s switches has a “dual wall” setup around the stem, which Razer claims improves stability and protects the switch from water and dust. I didn’t find the keys to be any more stable than my Cherry-branded keyboard; the keys have the same moderate wobble you find on most gaming boards. It’s not great, especially given how much the BlackWidow Elite costs, but I wouldn’t say it feels “cheap,” either.The included wrist rest is one of the nicest I’ve ever used. The pillow-esque top is incredibly soft and puffy, and while it’s a bit too tall for my tastes, fans of wrist rests will love how it feels. It attaches to the keyboard’s sloped bottom using a magnet, which is an infinitely smoother experience than trying to clip it to the bottom like you do with Corsair keyboards. I left the wrist rest off most of the time, but I can’t understate how nice it is to place it gently on the keyboard and have it slide into place with no fiddling.The top right corner of the keyboard sports a line of dedicated media keys and a volume wheel that hangs off the edge for easy adjustment. The media keys look good, but they only depress a tiny bit with an unsatisfying click, which feels a little weird. Their legends are also very subtle and don’t let the RGB lighting shine through, so it’s hard to tell what the keys do in low light—a strange oversight on an otherwise well-lit board.The left side of the keyboard sports both a USB and a 3.5mm audio passthrough jack, which is convenient, but makes the braided keyboard cable extra thick, since it has to pass three plugs to your PC (one USB for the keyboard, one USB for passthrough, and one 3.5mm audio). This makes it a bit hard to straighten and manage, but it isn’t a dealbreaker.I’d be remiss to talk about Razer without mentioning its reputation for sub-par quality control. While my review unit didn’t have any noticeable hardware issues during my two weeks of use—I actually found it to be remarkably well-built—a quick Google search revealed many users reporting incorrect keycaps being installed from the factory, or switch failures early in the life of Razer’s other keyboards. Thankfully, Razer offers a two-year warranty with decent customer service according to Laptop Mag, which should provide decent peace of mind—even if it is a bit of a hassle to get things fixed.Razer’s new Synapse 3 software allows for lots of customization. You can record macros and assign them to the key of your choice, create your own lighting effects, enable a “Gaming Mode” that disables the Windows, Alt+Tab, or Alt+F4 combinations, and link games to specific profiles. Your profiles are stored in the cloud with your Razer account, but can also be copied to the keyboard’s onboard storage for use on other PCs. All this sounds nice, but I found it to be a bit clunky and buggy. Macros sometimes failed to record properly, requiring me to create the keystrokes manually—and both processes took a few minutes to figure out, thanks to a somewhat unintuitive layout. Occasionally, Synapse would create a new profile for my mouse or keyboard without me realizing it, and I’d end up with a few identical profiles stored in my account for seemingly no reason. In other cases, the software would completely freeze when launching or attempting to update, necessitating a full reboot.I found it to be a bit clunky and buggy.When it works, though, Synapse 3 can be quite useful. Razer’s “Chroma Studio” module, for example, allows you to customize the lighting of each individual key on the board, so you can make it match your other peripherals—or use one of Razer’s built-in animation presets, like breathing, ripple, or “fire,” which literally makes your keys look like a digital fireplace. You can even layer different effects, so keys take on one animation at rest, but react when you press down on an individual key.It’s pretty cool, and you can link certain games to different profiles—useful if you want to color-code certain hotkeys, or just get your keyboard’s color to match the tone of the game you’re playing. Razer even has some built-in profiles for certain games, which is very cool.Unfortunately, your custom lighting effects only work when the Synapse software is running—even the keyboard’s onboard storage can not use them on other PCs without Synapse installed, and your lighting will revert back to the default rainbow when you’re logged out of your PC. This behavior isn’t an enormous deal really, but it seems ridiculous for a $170 keyboard.I don’t expect much from most gaming peripheral software, and Synapse 3 is usable if you’re willing to fight with it a little bit. I just wish I didn’t have to.Despite being equipped with Green switches, which are commonly categorized as “typing” switches more than for gaming, I found gaming with the clicky switches to be pleasant. Everything from long presses to quick double-taps felt smooth and natural, and despite the noise—I’m sure my wife thought I was gaming on a typewriter—I felt it performed admirably.Seeing the lighting on my keyboard change for supported games was a treat.Seeing the lighting on my keyboard change for supported games was a treat. When I fired up Overwatch and selected my hero, the keyboard’s coloring changed to match the palette of my character. When I entered a match, WASD lit up in a pale shade of Overwatch orange, with hotkeys blinking when they were available in-game. For example, the “Q” key would be the same color as the rest of the keys until my Ultimate Ability was ready, at which point it would brighten up.This is cooler in theory than in practice, since experienced players won’t be looking at their keyboard much, but I could see it being useful for beginners in certain games. Again, you can see a list of officially supported titles here.Media keys were easily accessible and worked well in-game, though as I mentioned earlier, I wish they had backlit legends. The volume dial, on the other hand, is a double-edged sword. It hangs off the edge of the keyboard in a way that makes it very easy to access—in fact, I’d say it’s one of the most convenient volume wheels I’ve used.But that same convenience caused me to accidentally bump the volume wheel with my mouse hand from time to time, which was annoying. This may not be a problem if you keep your keyboard far from your mouse hand, but if you use a more ergonomic hand position—in which the “b” key is aligned with the center of your body—that volume wheel is in dangerous territory.The Razer BlackWidow Elite keyboard has an MSRP of $169.99, and since it's a new model it's usually the same price online.  The Razer BlackWidow Elite is built like a tank and has a decidedly premium feel—at a premium price. The software is not great, and is unfortunately required to use the keyboard’s gaming-centric features, but if you can fight your way through it, you’ll be happy with the results.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}