{"id": "Daredevil: Season 3, Episode 12: \"One Last Shot\" Review", "paragraph": "Warning: The following contains spoilers for Daredevil Season 3, Episode 12. If you need a refresher on where we left off, check out our review of Season 3, episode 11.\"I hurt people. My pride hurt people. And I need to make that right again.\"Here we are at the penultimate episode of Daredevil Season 3 - perhaps even the penultimate episode of Daredevil as a series, if Netflix's recent Marvel show cancelations are meant to signal something dire - and... well, things don't quite work out for our heroes.I'm actually very surprised that, just from a messaging standpoint, Foggy's plan to take the high road with clean and clear legal tactics doesn't work. I mean, I also understand that you can't repeat the same beats that brought down Fisk back in Season 1, and Nadeem's been a walking corpse, pretty much, since he got blackmailed back in Episode 9. Still, it's very interesting to see the story swerve away from Foggy's plan so savagely. Especially since Nelson and Murdock: Avocados at Law risk so much trying to get Nadeem to that courthouse.Forget the part where they, Karen included, wind up looking like fools in front of the public when Felix Manning swoops in and threatens the lives of the grand jury, sending everything crashing to halt, and at least one officer dies transporting Nadeem. I was so sure, given the cool action scene Nadeem gets to have with Matt out on the streets, where Matt uses his super senses to tell Nadeem where and when to shoot, that some good would come out of this. But nope. Fisk wins again. And it's another crushing blow. So much so that Matt spirals back into his original plan and sets off to take down, and presumably kill, Fisk himself.Some of the scenes get a little chewy in \"One Last Shot.\" Maybe because the structure for the episode feels like that of a finale, like we're barreling toward a big win for the good guys, so the first 15-20 minutes are spent with Nadeem and his crumbling life: A wife who wants to leave him; convincing Tower to play ball; Nadeem's choice to actually do time for his crimes (which is a fun swerve that feels like him atoning for the allowances he gave Fisk for Fisk's testimony). Of course, \"One Last Shot\" also has to stand as a send off for Nadeem, given that Dex shoots him dead in the end, but we still spend a bit too long rooting around in his life. He's a new character to the show that gets a ton of screen time, for sure, but he also doesn't become an engaging, investable presence until the back half of the season.Funnily enough, Vanessa's choice to have Nadeem killed, when Fisk simply wants to let him stand trial for murder and get shamed into oblivion, is the best case scenario option for Nadeem. It feels crueler, and that moment with Vanessa is a joyfully wicked twist, but now Nadeem's way more likely to remembered as a hero. His son, eventually, will be able to sift through things on his own and find out his dad made mistakes but tried to redeem himself. As a dead man, people might imagine Fisk's invisible hand lashing out in the darkness.\n\nFisk himself endures a lot in this episode, given that he's almost indicted and Vanessa comes back into his life not quite right. We watch him squirm and contort both professionally and personally. Even his famed omelet doesn't lift Vanessa out of her ennui. Then comes her scene with Dex, and that painting, and the off-screen death of Mrs. Falb, and I really want to call out Ayelet Zurer's vague reaction to seeing the blood smear, because it helps that moment enormously. You can't tell if she's frightened by Dex's murderous move (at the very least, she knows he's creepy and full of s***) or enraptured by it.We know, previous to all this, Vanessa was turned on by Fisk's power and control. It's why he loves her so much. He found the only woman in the world, he feels, that can accept him. But in the two years she spent away... did she have a change of heart? Was the bloom off the rose? Did she want out of this life? No. She wants to go all in. She doesn't want to feel like one of Fisk's \"beautiful things on display.\" So bringing her back this way, and having her dive into the deep end the way she does, is awesome. Sure, we're close to the end here, but I didn't even know we'd see her this season at all. She could have remained off-screen, forever out of Fisk's reach.I don't think she's safe though, now that it's looking more and more like maaayybe Fisk won't actually fall this season. Again, maybe. Like, he might remain in power moving forward into Season 4 (if Daredevil survives the Netflix chopping block). Because Dex has seemingly been reduced to being seen as a fly in Fisk's estimation; the assassin is hearing literal buzzing noises. He doesn't like being dismissed. He doesn't like disappointing his \"North Star.\" And he might not like the attention Fisk gives to Vanessa. Who knows though? Maybe he'll surprise me and be able to somehow compartmentalize his various needs for validation.Given how little time's left in Season 3, \"One Last Shot\" spends a bit too much time rooting around in Agent Nadeem's sorrow. And it's hard not to feel let down after watching our heroes fail yet again. But it still makes for an exciting ride, and drop off point, leading into the finale. The show's basically stating, for now, that Matt's been right all along. It's an interesting change-up. Next up: Our review of Daredevil Season 3, episode 13.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}