{"id": "Forget About WWE Crown Jewel, But Don't Forgive", "paragraph": "Right up front, I didn't watch WWE Crown Jewel. I may someday but, most likely, probably not. So sharpen all your \"you can't complain about something you didn't watch\" swords. Lunge at me all you'd like.Now that the dust has settled from WWE's second - and far more controversial - Saudi Arabian PPV event, it's time to take some serious freakin' stock - while also acknowledging that Saudi Arabia isn't the only country WWE's recently rented out its services to, as Australia's Super Show-Down PPV was just a little over a month ago.On a very basic level, taking Saudi Arabia out of the picture for a second, it's just inherently weird for WWE to be doing any of this. Yes, WWE's all about big business and the company is getting paid a vast fortune to send their men and women (mostly men though) overseas to entertain fans in other counties. But they've basically become a very expensive billboard. It's elite shilling. I've tried to think of a comparison for those who don't watch wrestling. It'd be something like:\"What if you had a favorite long-running TV show, but then some very wealthy person far away dropped a ton of cash on the production studio so that they could control all your favorite characters, and even old characters from that show who'd been killed off, utterly hijacking a good chunk of the season? The characters no longer served the show's story, but rather the whims of this very rich and powerful person. Meanwhile, you had to keep watching the show even though everything felt wrong and the stories being told, and the stars coming back, made no sense.\"That's as close as I can get. It's not perfect. Bottom line: What if someone else took over your show and drastically affected everything you were watching? These international business deals include marquee stars of yesteryear. People like John Cena, The Undertaker, Triple H, and even Shawn Michaels - who returned for Super Show-Down and Crown Jewel, breaking his eight-year absence following an earnest and honest retirement from the industry. After the stars get wrangled, it's then up to WWE to figure out how to make a story out of it. Vince McMahon and the writers have to explain why these stars are back, why they're fighting again, and so on.Meanwhile, every other storyline going on also gets sucked into the vortex of these PPVs. And all the while these shows dominate almost every square inch of promotional airtime - even to the detriment of WWE's regularly scheduled PPVs. Even to the detriment of their first-ever, groundbreaking all-female PPV Evolution last weekend. The overseas mega-cards take precedence.Last April, right on the heels of WrestleMania, WWE held the first of these sprawling super-cards, The Greatest Royal Rumble in Saudi Arabia. Even at the time, it was controversial due to women not being able to wrestle in Saudi Arabia. WWE took a lot of flak in the days leading up to, and weeks following, GRR, due to the entire show being a four-hour tourism commercial for Saudi Arabia, promoting it ad nauseam as a newly-progressive nation, even when the biggest and most glaring offense was built into the very fabric of the show itself.But WWE's line at the time was \"Well, who knows? Maybe the day is coming when women will wrestle there. Give us time.\" Yes, WWE labeled itself as an agent of change, and by simply allowing its wrestlers to go over there, wheels were in motion for grand sweeping social reform. At the time, the media more or less accepted this rhetoric, though no one really believed women would be wrestling there anytime soon (or ever). It was a stalling tactic. How long were we all expected to wait and see? By the next GRR? By the one after that? WWE had signed on for a 10-year deal with the Saudis for almost half a billion dollars.Hmm, there’s a difference between the WrestleMania promo that aired on Raw/SmackDown and the one from #WWECrownJewel, which is inset…something’s missing, some kind of de-evolution. Can’t put my finger on it, though. pic.twitter.com/zFn2PWRCL4— David Bixenspan (@davidbix) November 2, 2018Usually, WWE's kryptonite is bad mainstream press. It's the company's biggest fear. WWE does a ton of charity work and community outreach, all usually prominently advertised during Raw and SmackDown, and for all of that to be undone by bad press would usually be unthinkable. Obviously, WWE came through GRR somewhat unscathed, but with critical eyes still narrowed in its direction. We were watching. They told us to wait. We were waiting.It's also worth noting with both GRR and Super Show-Down, a secondary sin was that - well - they weren't great shows. For the most part, these PPVs were disposable. Almost non-canon. Aside from the fact that new champions occasionally got crowned because there was a vacancy that needed filling, nothing notable happened on these shows from a storyline standpoint. Meaning, basically, they're just bad PPVs. So for a while we could take solace in the fact that these shows didn't count. They were massive \"house shows,\" almost not meant for real broadcast.With the shows being less-than-ideal outings for the company (that could also be largely ignored if one truly chose to), an adjacent downside surfaced. These cards diminished WrestleMania. All of a sudden, outside of WrestleMania, the company's biggest show of the year, there were other shows that matched WrestleMania's crowd size and star power. WrestleMania used to be the place where old stars returned to adoring fans, for big paydays and nurturing nostalgia. This year, SummerSlam - one of WWE's \"Big Four\" PPVs - had none of the usual suspects. Not even John Cena, who still performs for the company occasionally. Cena, Undertaker, Triple H, and HBK were all on hand, however, for Super Show-Down a month later.Anyhow, there's a question to be asked, at a different time, a few months from now, about how you make WrestleMania stand out now that other WrestleMania-sized, and WrestleMania-booked, events happen multiple times a year.I should probably actually write about Crown Jewel now.Crown Jewel, which went down on Friday, was WWE's return to Saudi Arabia. With it came the already-installed factory setting controversy over women not being allowed to wrestle there. It's unknown, specifically, if WWE's Evolution PPV, which was announced last July, was done as an attempt to quell the outrage WWE knew was coming when they'd eventually announce the year's second Saudi PPV. Remember, last April, they'd told us all to \"wait and see\" and progress would follow them wherever they went.Then came the real wretchedness. Prominent Saudi journalist Jamal Khashoggi, who was living in the U.S. because he was in self-imposed exile after criticizing the policies of Crown Prince Mohammed bin Salman, was murdered by a team of Saudi agents in the Saudi consulate in Istanbul. His execution is believed to have been ordered by Prince Mohammed. Prince Mohammed is the man paying WWE crazy sums of cash to roll out Jeff Hardy, Kurt Angle, the Brothers of Destruction, and D-X for Crown Jewel. It'd be one thing if WWE was going over there and just taking the money of paying fans. They're taking money from a regime that, among other things, is being accused of savagely killing a reporter who was critical of the Prince.During the weeks leading up to Crown Jewel, controversy poured down on WWE like acid rain. Senators urged WWE to cancel the event. Newscasts, both serious and satirical, mentioned WWE constantly, and not in a good light. WWE held off on making a final decision until about a week ago, but top stars John Cena and Daniel Bryan, both of whom were booked for the show, refused to go. Last week, WWE had to actually write them out of the ongoing story to explain why they were being replaced by someone else at Crown Jewel. On top of all this, the controversy itself loomed so large that it distracted many folks from the company's superb Evolution PPV from last Sunday - which received a paltry build-up on WWE TV, and received little acknowledgment on WWE TV directly afterward.It was then announced that disgraced icon Hulk Hogan, who was still being actively kept off TV because of the racist rant from his sex tape (travel back in time and show childhood you this actual sentence), was booked to appear at Crown Jewel. And at that point...why not? Why not load this show up with the worst of the worst? It was already a thick outrage sandwich. What's one more slice of grossness?WWE Superstars, in words to the press, then started up with the same exact rhetoric they spun last April. The company was a symbol of Western civilization, therefore change was obviously right around the corner for Saudi Arabia. If you wanted dynamic shifts in the paradigm, send WWE. Except no one was talking about women not being able to wrestle anymore. Everyone was talking about murder. That's a pretty tall order in the change department. Could WWE get a government to stop ordering the execution of its critics? Even though they hadn't solved the whole women wrestling thing? This was one hell of a to-do list.Again, I didn't watch Crown Jewel. From everything I saw online though, from those watching the show and reporting on the results, it was quite the s*** show. And this is me knowingly sifting through basic internet snark - snide remarks and crappy criticisms that we all toss to and fro on social media. Those come with every WWE show. But even peeling past all that, the consensus was that this was a very bad PPV. With some even theorizing that WWE made it purposefully bad in order to self-sabotage themselves a bit. That's not true at all, but the show was apparently so awful that it made some people think this.So what all went down? Well, aside from Hulk Hogan \"hosting\" the event, Brock Lesnar ran roughshod over Braun Strowman to become the new WWE Universal Champion. Normally, I'd hate this. And I do resent the apparent squashiness of the (two minute?) match. But I didn't want Braun to win the title at Crown Jewel. Give it to Brock, who's already a purposefully polarizing figure in WWE. Like with Hogan, we might as well just make this entire ordeal as vile as possible, right? Hopefully, Braun can beat Brock for the title at an event we all want to see. And soon.Then there was Shane McMahon being crowned the \"Best of the World\" as part of some silly World Cup tournament - designed to be as utterly meaningless and forgettable as the Greatest Royal Rumble match (and even more laughable since every participant was from the U.S.) - after swapping himself out for Miz in the a final round match.On top of this, in a match no one wanted to see HBK break his retirement for, D-X beat Undertaker and Kane in a bout filled with miscues and mistakes - which saw Kane lose his wig and Triple H tear his pectoral muscle (easily taking him out of WrestleMania this year). From all accounts, even weighing the standard snark, Crown Jewel was a tire fire inside of a dumpster fire.Was Crown Jewel ultimately as skippable as Greatest Royal Rumble and Super Show-Down though? Of course it was. And that's the best for course everyone, I think. WWE included, yes, but mostly us. Erase this entire event from your brain. If WWE can erase parts of its own history, then we can, en masse, ignore and move past these Saudi shows. If it's mostly non-canon, let's make it all non-canon. The best approach is not watching, but second to that is not counting. Yes, a new champ was crowned, but only because there had to be. Though with Brock holding the Universal Championship again, you could make the argument that it's still vacant. Wipe this entire account from your psyche.But, and this is important... we should hold WWE accountable. What's their limit? What could possibly happen to make them cancel an event when a huge amount of money is on the line? It's not murder, that's for sure. What is a bridge too far for them? They're entering a 10-year deal. Did they really think they'd get to hang a \"10 Years Without Incident\" plaque on a wall after all was said and done? Can the Saudi government do, literally, anything they want to and WWE won't change a thing? How much is too much? WWE needs to answer this.From a pure storyline standpoint, given all the TV time Crown Jewel devoured, and because Survivor Series is - whoa - two weeks away, it's best to drop Crown Jewel like a nasty habit and move on fast. In fact, if it could get even less aftermath attention on Raw and SmackDown this week than Evolution got last week (which was hardly any), that would be great. But while we're eradicating the event from our mind palaces, keep riding WWE. Their messaging, even as grim as things have gotten, is that their very presence will somehow, someway, affect meaningful change. Push them to, at least, try to make good on that. Maybe by the time the next GRR rolls around, WWE seriously pushes for certain things on their show. Maybe they make demands of their own. Remember, they all-but promised small steps. Don't allow them to deliver no steps.Matt Fowler is a writer for IGN, a member of the Television Critics Association, and co-host of We Enjoy Wrestling. Follow him on Twitter at @TheMattFowler and Facebook at Facebook.com/MattBFowler.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}