{"id": "The Best 4K HDTV Deals of 2018 ", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.We are finally into the holiday season and the very best HDTV deals come around this time of year. You don't even need to wait for Black Friday - many TVs are discounted well in advance of the main event. For larger TVs we'd recommend a store with an easy in-store return policy because shipping back large TVs is a huge pain. For smaller TVs though, its alot easier and I'd recommend buying from anywhere that's the cheapest. Keep in mind many vendors such as Walmart, Amazon, and Best Buy, have extended return policies through the end of this year. If you purchase a TV now and find a better one later, it's very easy to return and re-buy.The Best 4K HDTV DealsThis recently released TV has outstanding specs for its low price. It boasts HDR10 and Dolby Vision HDR support and has very low input lag which is great for gaming. 4K Roku streaming is cooked right in and the remote uses RF instead of IR, which means you don't need to point it at the TV.This is a Black Friday deal that's already live on Aamzon. This TV is one of the best rated entry level TVs among professional reviews and users alike. It's a 4K TV with solid image quality and has Roku cooked right in. It's available right now for under $350 shipped.Sceptre strips down all the features you don't need - like Smart functionality - and gives you the absolute lowest prices around. What? You want a Smart TV? Just get yourself an Amazon Fire Stick, Google Chromecast and you get all of the same functionality.Check the review at RTings. This is a true HDR set with wide color gamut, sufficiently high brightness levels, and local area dimming. If image quality is of your utmost concern and you have a budget, this is the TV.For just under $250 you can score a brand new 4K HDTV with 120Hz refresh rate and built-in Chromecast functionality. You get free shipping on this order and you can extend your warranty to 3 years for only $26.If you want a big TV without breaking your budget, here's a 55\" 4K Smart-enabled HDTV for $320, plus you can extend the warranty to 3 years for a measly $26. To top it all off, you get free 2-day shipping.The LG C8 is one of the top rated TVs of 2018, with virtually perfect black levels, incredible colors and great picture quality. It uses LG's new A9 video processor to providesmoother and clearer images on top of some of best picture quality technology you can currently get. These are some of the best prices you can get online right now.Best Buy's Weekly TV Promo PageBest Buy's TV deal page updates every week, on Sunday. Although most of their TVs are non-deals (regular price), some of the TVs on sale can be some of the lowest across the net. Bookmark when you're TV hunting.eBay's Daily Deal PageAuctions from eBay's Daily Deal page work differently from your typical eBay auction. All of these deals are \"Buy It Now\" only and vendors have been screened and vetted by eBay. Most have tens if not hundreds of thousands of reviews with 98%+ feedback. Some of the TV deals here are the best you'll find, ever. Just make sure you read the fine print.Eric Song is IGN's deal curator and spends roughly 1/4 of his income on stuff he posts. Check out his latest Daily Deals Article, follow him at IGN Deals on Twitter and Facebook, and subscribe to his IGN Deals Newsletter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}