{"id": "Audible Membership Only £3.99 per Month for Three Months, Red Dead Redemption 2 Xbox One Digital Key for £46.54 ", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.Like me on Facebook and follow me on Twitter for the latest deals.Black Friday 2018 is around the corner. Find our guide on what to expect and how to get the best deals here. 50% off Audible Membership for 3 MonthsLove books? With Audible it's easy to tune into audiobooks wherever you are. By streaming or downloading books onto the free Audible app you will be able enjoy your favourite titles on the go, in your car or even at the gym. Try Audible membership at a discounted rate, which will save you 50% during the first three months, and you can opt-out any time.Alternative DealsIGN Exclusive: Red Dead Redemption 2 Xbox One Digital Key for £46.54 Using Our Exclusive Discount CodeUse our exclusive discount code IGN4 to receive a redeemable digital key for Red Dead Redemption 2 instantly in your e-mail address on day of release for just £46.54. To put this deal in perspective, an Xbox One Digital Key for Red Dead Redemption 2 is currently listed for £59.86 at Amazon.You can also use our exclusive Black Friday discount code IGN4 at SCDKey up until the end of November to get 4% off Digital PC and Xbox One games, Xbox Live and PlayStation Plus subscriptions, and more.Xbox One X Bundle with Five Games under £400Grab an awesome Xbox One X console bundle with the most popular games, including Forza Horizon 4, Forza Motorsport 7, Red Dead Redemption 2, Tekken 7 and Project Cars 2, all for under £400 at Currys PC World.Alternative Deals:Editor's Notes: You need to apply for Very credit card, which is interest free for 12 months. Credit provided, subject to credit and account status, by Shop Direct Finance Company Limited. If you can't get the promo code working, get in touch with Very customer service team and provide the offer URL and they should apply the savings to your account manually.£50 off Ring Video Doorbell 2 with Chime BundleRing Video Doorbell 2 enables you to watch over your home and answer the door remotely. Save £50 off on this device at Amazon now.£126 off WD 20TB My Cloud EX2 UltraOrganise your entire media collection, photos and files in one central, network location. Grab WD's 20TB My Cloud EX2 Ultra at Amazon and save over £126.Save £800 off Sony Bravia 70-Inch 4K HDR Ultra HD Smart Android LED TVEnhance your TV watching experience with Sony's iconic Ultra HD TV. Get it at a discounted price at Very.co.uk or Amazon, where you will save more than £800. PS Plus 12-Month Membership for £36.13We always recommend getting bigger subscription packages if you know you are going to be renewing your membership after the old one runs out. Electronic First currently offer the best price, especially when you Facebook like their page and redeem your unique promo code that will help you save 3% off.Alternative Deals:Forza Horizon 4 Xbox One under £33The price for one of the most beloved games, Forza Horizon 4, has gone down to under £33.IGN Exclusive: CyberGhost VPN for Only £1.59 per MonthRecently, VPNs are becoming increasingly popular because they can ensure your security and privacy when browsing the web. CyberGhost VPN is also a great VPN to access American Netflix from the UK and paying £1.59 per month on top of your current Netflix subscription to get all of the Netflix content you get in America is definitely worth it. This exclusive deal for IGN readers makes it the cheapest VPN available right now which is compatible with Netflix.Read our guide on how to get American Netflix content in the UK. Alternative VPN Deal  Best Broadband Deals for NovemberWondering what are the best broadband deals this month? November sees a lot of great Broadband offers. Get Unlimited Broadband and Calls package with Post Office for just £15.50 per month with no set up costs and no in-contract monthly price rise.You can also compare the best broadband, phone & TV deals in your area now at our sister site PCMag. Just enter your postcode and they will do the job for you.£150 off ASUS 15.6-Inch Full HD Gaming LaptopIn the market for a good gaming laptop? You can start saving ahead of Black Friday and Cyber Monday, as this Asus laptop is discounted by £150 at Amazon. It is armed with great specs, including Intel i5-7300HQ processor, 8GB RAM, 256GB SSD, Dedicated Nvidia GTX 1060 graphics card, and more. PSVR with VR Worlds, Astrobot, Resident Evil, Skyrim and Now TV for £220Experience the world of virtual reality with PSVR bundle, which includes VR Worlds, Astrobot, Resident Evil, Skyrim and Now TV. Save nearly £120 when purchasing it at GAME.Alternative Deals: Nintendo Switch Joy-Con Controller Pair in Neon Yellow under £55The cheapest deal for this controller pair you will find. Grab it at Amazon or Currys PC World now.Nintendo Switch Messenger Bag Zelda Edition under £25This Nintendo Switch messenger bag is idea for anyone who loves The Legend of Zelda. Snag it for under £25 at Argos.Samsung 500GB SSD under £77Want your PC to be faster? You'll be amazed how fast running Windows on a SSD is compared to running it on a Hard Drive.53% off Lexibook Star Wars 16MB Built-In Flash Digital CameraA pretty cool camera that every Star Wars fan will appreciate. Snag it at only £6.99 at eBay.Red Dead Redemption 2 PS4 Digital Key for £59.99 £55.00To get a digital copy of Red Dead Redemption 2 on PS4 for £55, simply follow the below steps.Don't forget to use this trick for digital copies of Special and Ultimate editions. Check out the links below.Get 10% Back on Console BundlesIt's a great time to purchase gaming consoles at Very.co.uk, as you can get 10% back on selected console bundles if you have a Very.co.uk credit account. All you need to do is enter the promotional code N794E at checkout.Editor's Notes: Offer ends Friday 2nd November 2018, at 9PM.PS4 500GB FIFA 19 Bundle with Assassins Creed Odyssey (Limited Edition) for under £280A number PS4 console and VR deals have been posted on Amazon, most of which include games such as FIFA 19, Assassins Creed Odyssey Limited edition, and more. Take a look at our picks below, or head straight to Amazon to check out more deals.£85 off MSI RX 570 ARMOR 8GB OC GDDR5 Graphics CardSave £75 on of the best graphics cards out there according to IGN review, and get three games for no extra cost, including Assassins Creed Odyssey, Strange Brigade and Star Control Origins.Exclusive to Nintendo: Preorder Nintendo Switch Super Smash Bros. Ultimate Edition Mario PackGrab an exclusive Nintendo Switch bundle with one of the most anticipated games of 2018, which is being released on 7th December, 2018. The pack includes a console with a dock featuring fighters from the original game, Super Smash Bros. themed controller, digital copy of Super Smash Bros. Ultimate, Official Steelbook, a Nintendo Switch hard pouch in black and a Nintendo Switch Mario battle pad. This bundle is unique to Nintendo Store and you won't be able to purchase this anywhere else. Everything bough separately would cost you over £359. Preorder it now to get it on 16th November, 2018.Buy 3 Months Gold, Get £10 Xbox Live Credit for FreeYep, you read right. Worth £24.99 usually but available for £14.99 right now.You will receive two codes when you purchase this product. You must redeem each code individually. After you complete the purchase, you will receive a link on the order-confirmation page with detailed instruction to redeem your code on Xbox Live. This link is also stored in your Games & Software Library. Please Note: The £10 Gift Card is valid for online purchase in UK only, one per customer.Game of Thrones Johnnie Walker White Walker Scotch Whisky for £34Johnnie Walker has partnered with HBO's Game of Thrones to launch a limited-edition collaborative whisky blend. A true Game of Thrones fan? You can now indulge yourself with a glass of a unique limited edition Game of Thrones inspired White Walker Whiskey by Johnnie Walker. Flavor notes include caramelized sugar, vanilla, fresh berries with a touch of orchard fruit, and is better to be served cold. It makes an ideal gift for any Game of Thrones or whiskey fan this Christmas. This Month's Humble Monthly Bundle Includes Hollow Knight, Hitman and 7 Days to Die on PC for Just £9.19'Humble Monthly is a curated bundle of games sent to your inbox every month. Each month offers over $100 worth of games for just $12! Every game is yours to keep, and 5% of each month's proceeds support charity. All subscribers receive 10% off in the Humble Store and exclusive access to the Humble Trove of DRM-free games.'We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}