{"id": "Captain Marvel's Brie Larson Wants to Play Samus in a Metroid Movie", "paragraph": "Brie Larson will hit theaters next year as Captain Marvel, and she wouldn't mind jumping into the pilot's seat of another space-faring heroine's franchise.Larson dressed up as Zero Suit Samus — one of the many, many confirmed characters for Super Smash Bros. Ultimate — for Halloween this year. A fan then tweeted at the Captain Marvel star, asking if this costume would be the closest we'll ever get to a true Metroid movie.\"I hope not,\" Larson tweeted back. \"I want to make that movie.\"via TwitterUnderstandably, fans were very excited about the potential for a Metroid movie even being mentioned, but should Larson's dreams come true, it wouldn't be the first time Hollywood has considered the property. John Woo was attached to direct a Metroid movie, which was first talked about in 2004.IGN spoke to the defunct Metroid movie star's producers years later, who discussed how the Super Mario Bros. movie adaptation had caused Nintendo to really tighten their grip on collaborations regarding the company's beloved franchises. Be sure to read our in-depth interview to find out what early scripts of the Metroid movie covered and more.And as much as Larson's tweet is one star's hope for a movie, Nintendo's perceived grip on its franchises has seemingly lessened over the years. Nintendo recently announced a partnership with Illumination Entertainment, the studio behind Minions, to produce a Super Mario movie. And new rumors have surfaced that Castlevania producer Adi Shankar has been in talks with Nintendo to produce a Legend of Zelda series.So, while Larson's tweet may not imply a Metroid movie is in the works, we certainly live in a world where that could be more of a reality that it likely might have been a decade ago.\n\nLarson will make it to theaters next year in Captain Marvel, which will feature the debut of the infamous Marvel alien race the Skrulls.For more on the film, which hits theaters on Feb. 22, 2019, check out our breakdown of who Captain Marvel's Starforce teammates are and how Captain Marvel fits into the MCU.Jonathon Dornbush is IGN's News Editor, PlayStation Lead, and Beyond! Host. Talk to him on Twitter @jmdornbush.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}