{"id": "Netflix's Making a Murderer: Season 2 Review", "paragraph": "Note: this is a mostly spoiler-free review of Making a Murderer Season 2, which is now available to stream on Netflix.It's not often a true crime documentary becomes nationwide watercooler fodder, but that's the power of Making a Murderer. This Netflix original series arrived in 2015 and exposed millions of viewers to the tragic story of Steven Avery and his nephew Brendan Dassey, both of whom are currently serving out life sentences for the rape and murder of Teresa Halbach. As with HBO's The Jinx and the podcast Serial, it arrived at just the right time to tap into the public's current fascination with true crime and controversial murder trials.However, much of what fueled the popularity of Making a Murderer is that it shed light on a story many viewers were wholly unfamiliar with. Three years later, each new development in Avery and Dassey's respective appeals process makes news headlines. The question is whether there's enough uncovered ground remaining to justify a second full season of the documentary. Unfortunately, Season 2 suggests that Making a Murderer would have been better served following Serial's example and focusing on a new case entirely.Writers/directors Laura Ricciardi and Moira Demos remain in charge of Season 2, which is again divided into ten roughly hour-long installments. Season 1 had ample ground to cover, exploring Avery's wrongful conviction of sexual assault and attempted murder in 1985, his 2003 exoneration, the 2005 Halbach case and the various developments afterward. Season 2 has comparatively little material to work with. These ten episodes essentially progress in linear fashion, picking up where Season 1 left off and covering new developments in the ongoing fight to exonerate Avery and Dassey from 2016 through summer 2018. Without giving too much away, anyone who's been following this case in recent years knows there isn't going to be a dramatic, game-changing finale.The biggest wrinkle this time around involves the introduction of Kathleen Zellner, a high-profile defense attorney who takes charge of Avery's appeal effort and quickly becomes one of the dominant personalities in these ten episodes. Many installments revolve around her efforts to recreate evidence from Halbach's murder and poke new holes in the state's original case. In lieu of dramatic new plot twists, the documentary leans heavily on this investigative work and on recurring interviews with Zellner. Some of this forensic work is fascinating, but a lot of it feels unnecessary, simply padding out the season with pointlessly granular details.Even as Zellner leads a very public crusade, the series also focuses Dassey's post-conviction attorneys and their efforts to delegitimize his videotaped confession. As in Season 1, this is where Making a Murderer tends to leave the strongest emotional impact. It's impossible not to watch footage of a teenage Dassey circa-2005 and not feel that he was taken advantage of by the detectives in charge. And for all that the documentary was criticized for presenting a biased, one-sided narrative in Season 1, it has and continues to make a compelling case for a serious miscarriage of justice here. The roller coaster nature of Dassey's legal fight in recent years only fuels the drama of this portion of the documentary.But again, there's not a huge amount of new material to cover here. Season 2 lacks the novelty that fueled Season 1's popularity, and it also struggles to justify such an in-depth exploration of the events of the past three years. There's simply not enough meaningful content to justify ten hours of new content. A follow-up special, yes. A whole season, not really.The presentation is as strong as ever when it comes to music and editing. Better, in some respects. As Ricciardi and Demos have noted, it's a lot easier to bring a project of this scope to life when you have Netflix's backing from day one. Those added resources are sometimes apparent in the use of aerial shots and other more robust visual flourishes (echoing Netflix's popular true crime spoof, American Vandal). But that can only do so much to punch up a narrative that feels far more drawn-out than it did in Season 1.The new season also misses its chance to explore the case from a different perspective. Early on, Season 2 creates the impression that Ricciardi and Demos are eager to address some of those criticisms leveled at the first season. The season opens with a montage of clips covering the reaction to Season 1's debut, including accusations of bias and that the filmmakers ignored a key piece of forensic evidence implicating Avery. Whatever your opinion of Season 1, it's hard to deny that the series took a very one-sided view of the case. Ricciardi and Demos were clearly operating under the belief that Avery and Dassey are innocent and were railroaded by a team of vengeful prosecutors, and that underlying belief informed the shape and tone of the documentary.\n\nUnfortunately, these early signs of a more evenhanded approach to the subject matter aren't borne out by the rest of the season. Even those early clips are quickly drowned out by footage of the show's adoring fans and the newfound celebrity Making a Murderer has provided for Avery and Dassey. There's an almost smugly self-aware quality to the first episode that quickly becomes grating. Between that and the fact that so much of that episode is geared towards recapping the events of Season 1, viewers might be better off skipping straight to Episode 2.Even at that point, this is still very much a documentary framed from the perspective of one side. When it isn't focused on Zellner's crusade or the uphill battle faced by Dassey's lawyers, the focus generally shifts to Avery's prison life or his parents as they grapple with economic misfortune, health woes and the lingering trauma of their son's trial. As much as this material taps into the human side of this infamous legal case, some of it is uncomfortable to watch and borders on being exploitative.To be fair, representing \"both sides\" is easier said than done in this case. The season ends with a lengthy list of people who declined to be interviewed for the documentary, including some half dozen members of the Halbach family. But after seeing the Avery family's private miseries being put on display for the world to see, can you really blame the Halbachs for wanting nothing to do with this series?Making a Murderer simply doesn't have the same impact in Season 2 it had the first time around. Part of that is simply the lack of novelty. Viewers know this story intimately now, and there's not much new to add three years later. But the series also fails to satisfactorily address the criticisms of Season 1 when it comes to its one-sided narrative. Barring any major developments in the years to come, perhaps it would be best if Season 3 moves on to new territory.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}