{"id": "Daily Deals: Smash Amiibos for Preorder, 4 Months of Amazon Music for Echo Owners", "paragraph": "Welcome to IGN's Daily Deals, your source for the best deals on the stuff you actually want to buy. If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.Like us on Facebook and follow us on Twitter to get the latest deals.Latest Smash Ultimate Amiibos Up for PreorderEveryone has been revealed and so have the amiibo! Get a head start and preorder King K. Rool, the Ice Climbers, and the Piranha Plant before they release in February.4 Months of Amazon Music for Echo OwnersAre you an Amazon Echo owner? Looks like you're in luck as  Works for both Prime and Non-Prime members. Only works for new customers of Amazon Music. LEGO Sets on Sale at WalmartA number of LEGO kits are currently on sale at Walmart. Each sports car comes with a minifigure and a few smaller accessories. Madden 19 and FIFA 19 for $29.99 EachGet the latest iterations of Madden and FIFA for half off at Walmart.LG C8 55-inch and 65-inch On Sale The LG C8 is one of the top rated TVs of 2018, with virtually perfect black levels, incredible colors and great picture quality. It uses LG's new A9 video processor to providesmoother and clearer images on top of some of best picture quality technology you can currently get. These are some of the best prices you can get online right now.JBLSmart Portable Bluetooth Speakers $50 OffBest Buy has a sale where JBL wireless speakers are discounted with a cool $50 off. It's not just the base model, the models with longer battery life are on sale too. Dell 'Leak Day' Black Friday SaleDell leaked its own Black Friday sales flyer, which doesn't technically count as a leak, in my opinion, but the savings are real. To celebrate \"Leak Day,\" Dell is having a week-long sale right now, with lots of computers and electronics seeing significant price drops. The code 50OF699 will save you an additional $50 on some PCs and laptops, on top of the sales price. Your mileage may vary with the coupon, but it's definitely worth a try.G3 Gaming Laptop for $729While Dell's site has early savings on PCs, other retailers also have discounted Dell laptops. The G3 Gaming Laptop is part of Dell's early sale, but this version on Walmart has a 1050Ti GPU instead of the regular 1050, while only being $30 more, giving it a great power-to-cost ratio.Super Smash Bros. Ultimate and Fighter Pass Bundle for $84.99If you want to get the Fighter Pass and Super Smash Bros. Ultimate in one fell swoop, Best Buy is offering this bundle. However, if you still have an active Gamers Club Unlocked subscription, you're better off buying the game and pass separately, because the 20% discount doesn't apply to the bundle but it does apply to the game itself. Plus the game offers $10 in rewards, while the bundle doesn't. It's... weird.Diablo III Loot Goblin amiiboWell would you look at that. It DOES exist afterall! And it's a GameStop exclusive. You can preorder your very own reskinned Loot Goblin amiibo right now and use it with Diablo III for Nintendo Switch. By the way, Diablo III on Switch is great. I love it. So of course I'm preordering this amiibo. I have a sickness.Gigabyte GeForce GTX 1080 for $449As amazing and awesome as the new RTX 20 series cards are, there is still plenty to love about the 10 series. I have a GTX 1080 in my personal rig and I love it. I can run most games on ultra in 1440p and still hit 60fps+. The introduction of the 20 series also brought the 10 series prices down, finally.LEGO Architecture Buckingham Palace for $32.99Pip-pip and cheerio, it's Buckingham Palace in LEGO form. These Architecture sets are super cool, mini-models of famous landmarks and architectural wonders.8Bitdo N30 Bluetooth Arcade Stick for $39.94This is the lowest price the N30 arcade stick has ever been, beating out the previous lowest-price set way back in April. If you've been considering picking this up, it works on Switch, PC and Android and if you're playing fighting games on a D-pad, shame on you.Firefly 15th Anniversary Complete Series Special Edition Blu-ray for $12.96One of the most celebrated and beloved sci-fi series of all time is on sale today at Walmart. There's lots of bonus content, too, and it comes in an attractive case for you to display to your like-minded friends.Asteroids Arcade1Up Arcade Machine Cabinets for $279 + Free 2-Day ShippingThe Asteroids cabinet is marked down at Walmart right now, and you can still get the other cabinets at their preorder prices.Preorder PlayStation Classic for $99.99We know all 20 games coming to the PlayStation Classic, and the original Metal Gear Solid is on there. Honestly I'm excited for that one alone. I replayed it recently and it still delivers. The other 19 games are just the icing on the cake.Samsung 55-inch 4K Smart QLED HDR TV (2018 model) for $1297Samsung's QLED displays are amazing. After spending time with one, you won't be able to go back to anything else. The colors are so incredibly vibrant, it's unbelievable. This is over $1000 off its retail price, which is also kind of unbelievable.Buy 3 Months of Xbox Live Gold, Get 3 Months FreeFor those who already have a currently running Xbox Live Gold subscription, buying a new subscription stacks onto your current one. So if you still have 3 months left, adding this will give you 9 months.To get this deal, simply check out with one 3-month membership in your cart. At the very last step of checkout you should get a message noting that you are eligible for another 3 months. Once you've made our purchase, it should be automatically be sent to you via email.You must be logged into your Amazon Prime account to see this deal. This deal is reserved for new subscribers only (although there are reports of people who have cancelled Audible in the past are also eligible). May be for select Amazon Prime accounts only.This is even better than the Amazon Prime Day deal, which offered 3 months for $15. With this membership you can listen to Amazon Audible's extended audiobook library whenever and wherever you want. Every month you also get 1 credit worth 1 audiobook at any price. This you can keep forever.If you commute long hours daily, then this is definitely for you. For only $9.99 per course, you can train yourself in tools, software, and programming languages specific to the gaming industry. There are thousands of course to choose from, and many of them are from accredited instructors that supply you with tutorials, training videos, assignments, and more. Taking the courses in school could costs gobs of money.Open in an incognito window to see this price.Black Friday is only 2 months away. BlackFriday.com and BestBlackFriday.com have already come up with a list of predictions on what will be the best deals during this upcoming holiday season. Check them out.BlackFriday.comBestBlackFridayMichael Koczwara is IGN's Weekend Web Producer. Follow IGN Deals on Twitter and Facebook, and subscribe to the IGN Deals Newsletter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}