{"id": "Diablo: Immortal Reveal Met with Negative Response by Fans, Blizzard Responds", "paragraph": "UPDATE 11/2: Speaking with IGN at BlizzCon, Blizzard’s Wyatt Cheng responded to the community reaction to Diablo: Immortal’s announcement, as well as the accusations that it’s just a reskin of a previous NetEase mobile game.“I don’t think mobile should be a dirty word,” Cheng said, explaining that the developers at Blizzard play and enjoy games on all platforms. “When it came to looking at making a new Diablo game, and this opportunity to partner with NetEase to make this – the technology is there, where our mobile phones are more powerful than ever, and they’re capable of top tier gaming experiences.”Cheng responded to claims that Diablo: Immortal may be a reskin by saying the following: “We’ve been working with NetEase Games from the beginning as a partnership to create everything in Diablo: Immortal. We have artists on our side, they have artists on their side, and we work together as a team, as a partnership to create everything about Diablo: Immortal. The environments, the characters, the skills, the story.”You can read the original story below:  \n\nDuring the BlizzCon opening ceremony, Blizzard announced Diablo: Immortal, a brand-new Diablo game made exclusively for iOS and Android mobile devices, but the Diablo community has reacted extremely negatively.The cinematic reveal trailer has vastly more dislikes than likes on YouTube, with 85K dislikes compared to 3.3K likes at the time this article was published. Its gameplay trailer has a similar ratio, with 45K dislikes and 2.1K likes. \n\nAdditionally, there are reports on Reddit that negative comments are being removed from the trailers – though there are currently still plenty there to read.The backlash has even manifested in-person at BlizzCon, with one attendee sarcastically asking the Diablo developers if the game’s announcement was “an out-of-season April Fool’s joke.” Blizzard responded by saying “No, it’s a fully-fledged Diablo experience on mobile.”My god, the savagery. The absolute savagery. #diabloimmortal #Diablo #diablo @LaymenGaming pic.twitter.com/Jvt4XzswzS— Skill Up reviewing #RDR2 (@SkillUpYT) November 2, 2018This negative response is likely fueled by long-standing rumors and expectations around new Diablo games on the way. Blizzard stated it has “multiple Diablo projects in the works” back in August, and that hype was built up further when people saw that Diablo got the prime panel spot directly after BlizzCon’s opening ceremony.Many people assumed the teases were for an inevitable Diablo 4 announcement, but Blizzard tried to temper that expectation a couple weeks ago. It’s easy to see why a mobile Diablo game developed by third-party studio NetEase isn’t quite what fans of the series were hoping for – though asking rude questions during a live panel is almost certainly a less constructive way to express that disappointment than disliking a video or leaving negative feedback online.\n\nThe Diablo community has also expressed concerns on Reddit related to NetEase’s past projects. One thread on the Diablo subreddit has pointed out the undeniable similarities between Diablo: Immortal and a previously released NetEase mobile game called Endless of God, saying Immortal looks like a Diablo-themed clone or reskin rather than a brand-new game.IGN will have multiple interviews with Blizzard developers throughout the weekend and will update this story with any official comment we receive regarding fan reactions or the similarities to Endless of God.Our own James Duggan got to play Diablo: Immortal at BlizzCon and said he wasn’t exactly sold on it yet. You can hear his hands-on impressions here, and find all the announcements from the BlizzCon here. Tom Marks is IGN's PC Editor and pie maker. You can follow him on Twitter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}