{"id": "What to Expect From Black Friday 2018 PC and Laptop Deals", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.If you've been holding off on getting a new laptop, PC, or components to build your own, you made a wise decision. The best Black Friday deals on gaming PCs and everything else computer-related have already started in some cases. If the deals haven't already started, we have a really good idea of what's coming down the pike for Black Friday 2018. You can already get a look at the best Best Buy Black Friday deals, as well as the best Dell Black Friday deals, among others.We've started rounding up all the savings if you're looking for what to expect and where to get the best Black Friday 2018 deals.Given Amazon's huge selection of PCs, laptops, and components, there will likely be some pretty excellent chances to save for Black Friday 2018. Currently, Amazon has some PC deals already live, but they tend to skew more towards its normal Deal of the Day pricing that full-blown Black Friday savings. Still, there are deals to be found. HP ENVY x2 for $699 ($799 MSRP)This convertible, cellular-enabled tablet PC is on sale ahead of Black Friday at Amazon. The battery life on the HP ENVY x2 is easily its biggest draw, claiming as much as 22 hours on a single charge.HP Pavilion 15-inch Gaming Laptop for $899 ($1099 MSRP)Amazon is holding a lot of its deals for Black Friday, based on its current deal pages, but this HP gaming laptop is a nice buy right now.Here are some of the best Black Friday 2018 deals at Dell. Some of Dell's Black Friday deals went live for Dell's Black Friday Leak Day event, but have since gone back into the great deals abyss. There are some Alienware Black Friday deals coming up, as well as XPS deals, so if you're after a gaming PC for Black Friday, Dell has you covered. ASUS TUF Gaming 17-inch Laptop for $999This is a slick gaming laptop at a great Black Friday price. For just under a thousand bucks, you get a 17-inch FHD laptop with an Intel Core i7, 16GB of memory, NVIDIA GeForce GTX 1060 6GB graphics and a 512GB SSD.Here are some more of Best Buy's 2018 Black Friday PC deals:We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}