{"id": "101 Amazing Little Details in Red Dead Redemption 2", "paragraph": "Red Dead Redemption 2 promises an unparalleled level of depth, from its vast, sprawling world, to the people and animals within it, and how it all fits together in a way that is quite unlike any open-world game before it. You're never quite know how each encounter with another character will pan out because each person is different. Similarly, it's filled with moments where you'll ask yourself, \"I wonder if I can do that?\", and chances are you probably can, no matter how outrageous it is.Below is a list of the cool, quirky and downright awesome little touches we've noticed so far with our time in Red Dead Redemption 2.If you want to know more, check out our review of Red Dead Redemption 2 or our Red Dead 2 wiki guide.\n\n1. Arthur’s facial hair grows in the game’s real-time, and his options when styling it depend on how long it’s gotten – just like facial hair in real life. 2. Arthur can shave at his tent in camp, going clean shaven, keeping a full beard and anything between. He can trim the different areas of his face separately – chin, cheeks, sideburns – so they’re short, medium, or long. 3. To change his hairstyle, Arthur will need to visit a barber in town. He can use purchased pomade to style it, too. 4. Arthur’s beard even has its own physics, bobbing and shifting around depending on how much weight it has.Lawmen will wait for a fistfight to settle down before asking you to move along. 5. If you don’t eat and rest, Arthur will suffer from fatigue. 6. Arthur will visibly lose or gain weight depending on how much food he eats.7. Fellow gang members will also loot downed bodies, so move fast or they’ll bogart all the extra cash and ammo.8. Your hat can get knocked off in a fistfight or shot off in a gunfight.9. Lawmen will wait for a fistfight to settle down before asking you to move along.10. You can craft hats out of animal pelts, like raccoons or foxes.11. Outfits are customizable to an impressive degree. You can choose to have your pants tucked into your boot or not, sleeves rolled up or not, etc.12. Weapons get dirty and clogged up over time, or if you get them wet, so you’ll need to clean them to get the best performance.13. Similarly, your horse will get covered in mud over time, which slows it down, and requires grooming to fix – though it can also be cleaned by riding it through a body of water or a rainstorm.14. Your horse will bond more strongly with you the better fed it is.15. Arthur’s comments while grooming or soothing his horse change depending on the sex of the horse.16. If Arthur is covered in mud or blood the reaction you’ll get from those around you will be different than if he were clean.17. Snow on Arthur’s clothing will eventually melt. Mud will harden and wipe away. Blood will dry.18. You can choose what position you ride in when you’re in a group.19. You cannot ride the horses of other gang members. Dutch’s horse will actually kick you if you get too close to it.20. There are 192 separate pieces of score (not including ambient themes), with Composer Woody Jackson returning to create the music for Red Dead Redemption II.21. You can tap R2 to rapidly fire from the hip, which proves handy if you’re ambushed.22. When reloading, Arthur adds individual bullets into each chamber. If you double-tap L1, Arthur puts his gun away with a flourish.23. When using a repeater, you can pause the lever-action mid-cock for dramatic effect.24. Gunshots make different sounds depending on whether you’re in a tighter indoor corridor versus the outdoors.The moon operates on accurate lunar cycles. 25. Hold up on the D-pad while aiming and Arthur will fire a warning shot in the air, which can be used to attract the attention of other characters or startle an animal (or person) he’s hunting.26. Arthur dynamically shields his eyes or ears just before dynamite goes off.27. Horses poop dynamically.28. In the settings of First Person Mode, you can opt to hide certain visual encumbrances in first-person mode, like your horse’s bobbing head.29. The HUD is customizable, so you can remove the minimap and other on-screen cues if you desire.30. Pause the game or press down on the D-Pad, and the current time and temperature is displayed.31. The moon operates on accurate lunar cycles.32. You can customize weapons at the gunsmith with usual upgrades like longer and rifled barrels or improved iron sights, but you can also add little details like etchings and engravings to both the metal casing and the handle of a weapon. There are various designs that can also be customized with a variety of colors.33. Items can be purchased at general stores by walking around and picking them up off shelves, but there’s also a catalog, too. The Sears & Roebuck-esque catalog sits on the counter, and you can zoom in on every article and full-page ad and read it. The gunsmith also has one of these, with hundreds of words written about every item.Putting on a bandana during a crime and then taking it off afterwards makes the Wanted meter drop faster. 34. You can change the style of your horse’s mane and tail, making it short, medium, or long, even adding braids or dreadlocks.35. If your horse dies, it’s gone – they’re not like cars in Grand Theft Auto 5, which can be resurrected via an insurance claim.36.  You can tell your horse to flee when it’s in a precarious situation to try to spare its life.37. Your choice of clothing has an impact on the game. You’ll need to wrap up warm when the temperature drops and shed layers when it gets unbearably hot.38. You can customize and decorate your camp with the pelts and bones of animals you’ve hunted.39. Putting on a bandana during a crime and then taking it off afterwards makes the Wanted meter drop faster.40. The wildlife operates as a functioning ecosystem – predators hunt and feed on prey, even hawks and eagles will dive to catch fish or small game like squirrels or rabbits.If you leave the bodies of animals where you killed them, they will attract scavengers. Carcasses will decompose over time. 41. There’s a Victrola at camp, and certain NPC companions will serenade you with song.42. Occasionally, at camp, you can sing along to the music. You can continue to sing while walking around – even if you don’t know all the words.43. Arthur will sing to himself while he’s riding alone.44. NPCs all have individual facial animations.45. They also have varying personality types that determine how they react to your actions towards them.46. The Wild West isn’t a period known for great dental hygiene, and the denizens of Red Dead reflect that.47. If you leave the bodies of animals where you killed them, they will attract scavengers. Carcasses will decompose over time.\n\n48. Opossums pretend to be dead when threats – including Arthur – are nearby.49. Nearby predators will scare your horse if you don’t run away from it or deal with it in time.50. If you get a bounty on your head in a town and then clear your name by paying the said bounty, townspeople will still remember any trouble you caused and comment on it when you return.51. Similarly, if you save someone out in the wilderness, they’ll remember you – and often thank you – if they see you again in town.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}