{"id": "Breaking Down The Grinch's Box Office Debut Against The Films of Illumination Entertainment", "paragraph": "Illumination Entertainment has another hit on their hands with a new animated adaptation of Dr. Seuss’ The Grinch, which opened with $67.6 million. With an additional $13.1 million coming from foreign markets, its worldwide debt of $80.7 million has already secured a profit for the film, which has a production budget of $75 million. When compared to the other eight films produced by Illumination Entertainment, The Grinch doesn’t stack up as high as you might think, so we’re breaking down its opening weekend when compared to the rest of Illumination’s slate.The Grinch’s opening weekend ranks as the sixth best out of Illumination Entertainment’s nine films, behind another Dr. Seuss adaptation, The Lorax ($70.2 million), Despicable Me 3 ($72.4 million), Despicable Me 2 ($83.5 million), The Secret Life of Pets ($104.4 million) and Minions ($115.7 million). Its debut fared better than the very first Illumination film, the original Despicable Me ($56.4 million), Hop ($37.5 million) and Sing ($35.3 million). All of Illumination’s films have at least broken the $100 million domestic box office barrier, with the lowest-grossing film being Hop at $108.1 million, but oddly enough, a lower debut doesn’t often foreshadow a lackluster domestic performance.Hop has the second lowest debut and the lowest domestic gross of all the Illumination films, but while Sing has the lowest debut, it showed quite a bit more staying power than other Illumination Films. It’s $270.4 million domestic take the fourth highest of all Illumination films, behind Minions ($336 million), Despicable Me 2 ($368.1 million) and The Secret Life of Pets ($368.4 million). Illumination's other Seuss adaptation, The Lorax, ended its domestic run with $214 million. In fact, the film actually posted an increase of 21.7% in its second weekend, where it rose from $35.2 million to $42.9 million. While a second or third weekend increase seems incredibly unlikely, given the competition it will face in the next two weeks, if The Grinch has the same kind of staying power as the rest of Illumination’s films, it should find a spot within the upper echelon of Illumination’s ranks, despite a debut in the lower echelon.\n\nFor years, animated movies were considered a “sure thing” at the box office, but that started to change just last year. 2017 was the first year since 2011 where there weren’t at least two animated movies in the top 10 at the domestic box office, with, fittingly, Illumination’s Despicable Me 3 the sole animated movie on the charts in ninth place ($264.6 million). This year, to date, there is only one animated movie in the top 10 as well, Pixar’s The Incredibles 2 in third place with $608.3 million, but, barring a huge second-weekend drop-off, The Grinch could very well crack the top 10 in the coming weeks and months.While third installments often drop off considerably from their predecessors, Despicable Me 3 dropped off a lot more than it perhaps should have, especially when you take a closer look at the numbers. Despicable Me 3 opened with the widest release in movie history last year, debuting in 4,529 theaters, 532 theaters more than the 3,997-theater debut of Despicable Me 2. Despite this theater count bump, its $72.4 million debut was still considerably below the $83.5 million debut of Despicable Me 2, and the third movie’s domestic haul ($264.6) came in $103.5 million below the $368.1 million domestic take of Despicable Me 2. Aside from the animated genre as a whole starting to lose its box office luster, the reason for such a sharp decline could have to do with the quality of the film as a whole. 2010’s Despicable Me posted a strong 81% on Rotten Tomatoes, but ever since then, the rating has slipped, with 2013’s Despicable Me 2 dipping to a still-fresh 74% while the spin-off Minions dropped to 56%, although Despicable Me 3’s 59% marks a slight improvement.\n\nThe Grinch isn’t a big hit with critics either, posting a middling 55% rating on RT, which certainly could be another contributing factor for this somewhat lackluster debut. While The Grinch isn’t exactly a “franchise,” it’s based on a character that was created 61 years ago, which was adapted into a 1966 animated Christmas special that still airs on broadcast TV (for free) every year. What’s interesting is, back in 2000, Universal released a live-action adaptation of How The Grinch Stole Christmas, starring funnyman Jim Carrey as the title character, which grossed $260 million. While that doesn’t seem like a huge gross now, that was more than enough to take the box office crown for that year, usurping the Tom Hanks drama Cast Away ($233.6 million).Coincidentally, The Grinch’s $67.6 million debut is just $12.5 million better than the $55.1 million debut of How The Grinch Stole Christmas, 18 years ago, even though it debuted in roughly 1,000 theaters more than Universal’s live-action movie. This could be yet another indication that audiences are tiring of franchises, sequels and remakes in general… or that, perhaps they don’t feel like heading out and paying for a story they can basically see for free on TV next month anyway.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}