{"id": "Monster Hunter Film Will Largely Use Creatures From Monster Hunter World", "paragraph": "The upcoming Monster Hunter film will reportedly feature creatures from across the video game series, though it will focus heavily on popular creatures from Monster Hunter World.In an interview with /Film, director Paul W.S. Anderson discussed the upcoming movie. He touched on the monsters that would appear in the film, saying there would be no original creatures. Instead, they will come exclusively from the games.\"I don’t need to create any new monsters,” said Anderson. \"There’s such a vast array of amazing creatures over the years. We’re leaning quite heavily on the favorite creatures from Monster Hunter World which is the latest game, but we’re also bringing in what I think are some of the fabulous monsters from some of the earlier games [as] well, and some of the imagery from the earlier games.\"\n\nExactly which monsters will appear isn’t clear, but Anderson did confirm a host of characters (specifically from Monster Hunter World) will be present, perhaps alongside the popular Palicoes.\"There’s The Handler and Admiral, Aiden, Aiden’s Handler. We wanted Palico,” said Anderson. \"It’s very much a movie of the video game, but in Monster Hunter you get to create your own character when you go in there. You don’t get to play Lara Croft or Jill Valentine. You get to play your own creation, and there is definitely an element of that in there. Some of the leading characters will be fresh characters but that’s a reflection of what the video game is.\"Anderson also discussed Ron Perlman’s role in the film, saying \"His character, The Admiral, is such a big part of the game, such a larger than life character. It’s great casting.\"On-set photos of the film have been released by actress Milla Jovovich over the last few weeks, almost all showing people in modern military uniforms holding firearms, which fans have noted is highly counter to the video game series. One photo included Jovovich with a Slinger (a piece of equipment from Monster Hunter World) on her arm as evidence that the film will retain some elements from the games.In 2016, Anderson described his dream for the movie, saying it would be centered around an average American who is pulled into a parallel world infested with monsters, with the parallel world eventually invading our world. The film began principal photography in September.\n\nColin Stevens is a news writer for IGN. Follow him on Twitter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}