{"id": "We Saw Two Hilarious Extra Scenes From Pokémon: Detective Pikachu", "paragraph": "While the world was treated to the Pokemon: Detective Pikachu trailer today, IGN and a small group of press were invited to Legendary headquarters to screen two additional scenes from the movie. As you’ve no doubt gleaned from the trailer, the whole production is driven by Ryan Reynolds’ hilarious turn as Detective Pikachu, and the two scenes highlight his unique brand of humor.(We also got a look at several to-scale models of what certain Pokemon look like in live-action and an awesome prop Pokemon chess set, which you can see below.)The first scene saw protagonist Tim Goodman talking to Detective Pikachu inside the Hi-Hat Cafe, a coffee bar with a Ludicolo barista. Any good detective has a bar they frequent, but given this is a kid-friendly affair, Detective Pikachu gets his fix by drinking endless cups of coffee instead of bottles of booze. This scene was from early on in the film where they establish the main mystery of the movie: Tim thinks his father, detective Harry Goodman, died in an accident, but Detective Pikachu convinces him that he’s likely still alive and there’s a larger conspiracy afoot, so they need to find Tim's dad and find out who's behind his disappearance. Eventually Pikachu does win Tim over and they agree to work on the case together, but it doesn’t come without a great deal of bickering between the two. As the trailer highlighted, Tim is pretty caught off guard by the fact that he can understand Pikachu, so he’s justifiably rattled, but he also finds Pikachu to be a little grating and hard to handle.That begrudging dynamic is underlined, bolded, and italicized in the second scene we saw where Tim returns to his apartment where he had left Pikachu to find Pikachu has turned the entire living room into a massive evidence/conspiracy display with strings running across the room connecting various newspaper clippings, photographs and clues. Tim, clearly angry at the mess his apartment has become, can’t help but stumble over the ridiculous number of coffee cups now littering the floor. The two have an energetic exchange, the annoyed Tim playing off the fast-talking, detail-obsessed Pikachu, and eventually they realize a reporter named Lucy who Tim met earlier on may have information that can help them.\n\nThese scenes showcase the chemistry between Justice Smith’s Tim and Ryan Reynolds’ Detective Pikachu, who don’t exactly get along but are starting to get on the same page. Justice keeps pace with the neurotic, quippy Reynolds, and watching their scenes unfold was like sitting front row at a frantic game of verbal tennis. The visual effects were unfinished in the scenes we saw, but they still had the entire room laughing as one zinger landed after another, which goes to show the strength of the performances that will be driving this movie.For more on the movie, here's every Pokemon we found in the trailer:Joshua is Senior Editor of IGN Comics. If Pokemon, Green Lantern, or Game of Thrones are frequently used words in your vocabulary, you’ll want to follow him on Twitter @JoshuaYehl and IGN.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}