{"id": "The True Legacy of Stan Lee at Marvel Comics", "paragraph": "The pop culture world was dealt a huge blow today with the news that Stan Lee passed away at the age of 95. Lee is widely celebrated as one of the primary architects of the Marvel Universe. He co-created many of the company's most famous heroes and villains and managed to become the public face of Marvel for decades. But ultimately, Lee's true legacy at Marvel Comics isn't any one character or franchise, but the deep inspiration he provided for generations of creators that followed.Lee's resume includes a laundry list of iconic superhero characters - Spider-Man, the X-Men, the Fantastic Four, the Avengers and on and on. That said, Lee isn't singlehandedly responsible for creating any of the characters he's so closely associated with. Spider-Man was a joint creation with Steve Ditko. Thor, Iron Man, Hulk, the Fantastic Four and the X-Men were all developed alongside Jack Kirby. But that's the beauty of comics - it's generally a collaborative medium. If you didn't have Kirby's boundless imagination and superhuman work ethic paired with Lee's sense of humor, grandiose storytelling style and marketing skills, none of these characters would be what they are today. It's safe to say many of them might never have left the drawing board in the first place.\n\nAnd even then, most of these franchises didn't achieve their full potential right away. Take the X-Men, for example. Lee and Kirby created a series about a group of unusual teenagers who fought to protect a world that hated and feared them. But those early stories were still missing something vital. It's hard to sell that \"hated and feared\" angle and the mutant metaphor when your leads are a bunch of attractive, well-dressed, WASP-y teens. It was only after Roy Thomas, Len Wein and John Romita, Sr. created Wolverine, and after Chris Claremont came aboard The X-Men and introduced a much more diverse cast of heroes, that the franchise truly came into its own and became the pop culture juggernaut it is today.The same holds true with so many of Lee's creations. Thor was elevated by creators like Walt Simonson, who tapped more deeply into the mythic quality of Asgard and its gods. Black Panther needed someone like Christopher Priest to really capture the struggles faced by an African king who occasionally masquerades as a superhero. Daredevil only became what he is now after Frank Miller went to Marvel and re-imagined him as a tortured ninja hero.Only with Spider-Man do those original Lee/Ditko stories remain the gold standard by which all others are judged. That's one case where Lee and his collaborators seemed to strike gold from day one. Everything from Peter Parker's background as a nerdy outcast to the rich cast of allies and enemies combined to create the perfect storm of comic book storytelling.None of this is to diminish Lee's influence on Marvel and the pop culture realm as a whole. Quite the opposite. These characters were never meant to be Athena, springing fully formed from the head of Zeus. They needed time and fresh voices to truly realize their potential.Lee helped lay a foundation on which countless other storytellers have been allowed to build. Perhaps he didn't perfect the X-Men or Thor or Daredevil, but none of the classic stories that followed would have been possible without Lee helping to light the way. He helped establish an entire shared universe of heroes and villains and mutants and aliens. Superhero comics crossed over with each other before Lee, but never before was the concept of a shared universe treated with such care and reverence. Lee and his collaborators designed these characters to exist in one world, a world where the actions of one hero might spill over into another's book. And it felt like we could share that world too, since so many of the characters were based in New York City rather than Gotham or Metropolis or some other made-up place.That shared universe has only grown by leaps and bounds over the decades. From the small handful of X-Men created by Lee and Kirby, literally thousands of new mutant characters have followed. New creators have routinely come on board these iconic properties, bringing new ideas and new methods of storytelling. And as Marvel has grown from a comic book publisher to a multimedia empire that produces blockbuster films, TV series and video games, Lee's influence and imagination continue to be felt everywhere.\n\nPerhaps no character better embodies Lee's legacy of imagination than Daredevil. Lee, Bill Everett and Jack Kirby originally developed the story of Matt Murdock, blind lawyer by day and swashbuckling superhero by night. Inspired by those early stories, Frank Miller came in and dramatically overhauled Daredevil and his world. Miller enriched the character's mythology, added new levels of pathos and raised the visual standard for all superhero comics. From there, a pair of young, aspiring creators named Kevin Eastman and Peter Laird were so taken by Miller's Daredevil that they were inspired to create their own comic. That comic, a little book called Teenage Mutant Ninja Turtles, quickly exploded in popularity and birthed a multimedia empire unto itself. And who's to say how many creators were then inspired by TMNT to develop their own ideas?That's the real power of Stan Lee. He may not have created or perfected every facet of the Marvel Universe as we know it, but there are so many beloved stories that simply wouldn't exist without him. And the best way Marvel can honor his memory is to keep creating and pushing forward.Jesse is a mild-mannered writer for IGN. Allow him to lend a machete to your intellectual thicket by following @jschedeen on Twitter, or Kicksplode on MyIGN.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}