{"id": "Acer VG270U Gaming Monitor Review", "paragraph": "Be sure to visit IGN Tech for all the latest comprehensive hands-on reviews and best-of roundups. Note that if you click on one of these links to buy the product, IGN may get a share of the sale. For more, read our Terms of Use.Two models comprise Acer’s new Nitro VG0 series of affordable AMD FreeSync gaming monitors. There’s the tiny, affordable 21.5-inch, 1080p model that costs only $130, and the 27-inch model I am reviewing here, which is the VG270U Pbmiipx, (See it at Newegg). It costs $450 and serves up a 2560x1440 resolution and a speedy 144Hz refresh rate. You lose out on some of the connections and design flourishes of Acer’s flagship Predator line, but you do get a crisp IPS panel that offers motion blur reduction – Acer calls it Visual Response Boost (VRB) – allowing for a speedy 1ms response time.The Acer VG270U comes wrapped in a Spartan package, but that doesn’t mean it makes you suffer with thick bezels. This budget monitor lacks a number of modern amenities, but it has razor-thin bezels on the top and sides, which look sleek, and allow for a near seamless multi-monitor setup. The top and side bezels are only 0.5 inches wide, and the bottom bezel measures only 1.0 inch wide.So, what do you miss out on with the Acer VG270U? For one, any adjustment outside of 25 degrees of tilt (5 degrees forward and 20 degrees back). There’s no swivel or height adjustment. The lack of swivel is no big deal because you can just turn the stand if need be, but the lack of height adjustment is a bummer, though not unexpected at this price. The display is a bit of a lowrider; the stand has a short neck that positions the bottom edge of the monitor only 3.5 inches above your desk surface. In addition, you can’t pivot the display into a vertically oriented portrait mode, which isn’t a feature high on a gamer’s wish list but might come in handy if you intend to dabble in creative pursuits outside of gaming.The display sits on a plastic, V-shaped stand. The angular, molded plastic feet of the stand eschew the red accents found on many FreeSync monitors and are instead black and blue. The bezels framing the display are matte black, and a small, silver Acer logo sits centered below the display. There is nothing terrible eye-catching about the design, but there aren’t any design missteps either. It’s all very straightforward and basic.Also basic are the monitor’s connections: a pair of HDMI ports, a DisplayPort connection, and a headphone jack. You don’t get any USB ports. A pair of 2-watt stereo speakers, however, are onboard. Gamers won’t have much use for the tinny speakers, but they suffice for YouTube videos when you don’t feel like wearing headphones.All of the display’s buttons are located on the back panel. Just reach your hand around the right side and your pointer finger will find the small power button. Below it are three hotkey buttons and small joystick for navigating the OSD. The joystick makes it easy to navigate the OSD to enable FreeSync and VRB, change the video input, and make adjustments to the picture. There are also eight preset modes for Action, Racing, and Sports games along with others including Graphics and Movie.You may use one of the preset modes, but I had better luck making slight tweaks to brightness and contrast to get the picture the way I wanted it. The two display settings that will likely be of most interest to gamers are FreeSync and VRB (Visual Response Boost). VRB is Acer’s name for its motion blur reduction tool that strobes the backlight to insert a black image between frames to reduce blur in games.I found it to be effective in making a subtle but appreciated reduction in ghosting but inserting those black images between frames has the effect of greatly reducing the brightness of the display. Even with brightness set at its max, the display looked dull with VRB enabled. And that’s with it at its Normal setting; at the Extreme setting for VRB, the display looked really dim. Acer recommends running VRB at its Normal setting, and I concur. You also must have the display set at a 120Hz refresh rate in order to enable VRB, a useful bit of information not included in the display’s user manual.I used Lagom LCD monitor test pages to measure performance including gamma, black and white levels, color gradient, and response time. On the gamma test, the monitor was nearly perfect at 2.1, which is just a hair below the target of 2.2. With Normal VRB enabled, the gamma dropped to 1.9. On the black level test, the display was good but not great. This test displays 20 gray squares against a black background; so a perfect panel should allow them all to be visible instead of blending into the background. On this test I was only able to see 17 squares, and with Normal VRB enabled, I was able to see only 12 squares. Things improved on the white saturation test that displays 12 checkerboard patterns against a white background; I could see all but one box with or without VRB enabled.Results from the gradient test were stellar; there was no banding with or without VRB enabled. On the response time test, the display was mediocre at best. I saw more flickering on this test than I expected for a monitor claiming a 1ms response time. I ran the response time test again with Normal VRB enabled and while this reduced the amount of flicker I saw, it also dimmed the display so much that I had trouble seeing the darkest portion of the test grid.To further test VRB’s effectiveness at reducing motion blur, I used the Blur Busters UFO Motion Tests. VRB had a noticeable effect at reducing blur in the UFO test image, particularly with the 120fps test image, which was free of blur and exhibited only the slightest flicker with Normal VRB enabled. Without VRB, the test images looked blurry as they raced across the display.After the Lagom tests, I played CS:GO and Overwatch and saw similar results with and without VRB running at 2560x1440 resolution with a refresh rate of 120Hz. IPS advantages were evident with accurate color reproduction and wide viewing angles. I didn’t see any tearing and only the slightest bit of ghosting in the games, and the ghosting all but disappeared with I used Normal VRB.The downside of VRB is the screen gets dark and stays fairly dark even when I raised brightness to its max with VRB enabled. It was so dark with Extreme VRB that I can’t see anyone using that setting. Given the price you pay for VRB, I think most gamers worried about ghosting are better off sacrificing a bit of color accuracy and getting a TN panel. And for a relatively small 27-inch display like this one, viewing angles likely aren’t high on gamers’ priority list.The Acer VG270U has an MSRP of $449.99 and it's the same price on Newegg.  The Acer VG270U attempts to let you have your cake and game with it, too. It uses a motion blur reduction effect to deliver fast 1ms response rates with an IPS panel, which is a first. It achieves its desired result but at the cost of display brightness, so it's a tradeoff. A naturally speedy TN panel like the Dell S2719DGF is better bet if you don't need the color accuracy and viewing angles of an IPS panel.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}