{"id": "Out This Week: Fallout 76, Pokémon: Let's Go, Pikachu! and Let's Go, Eevee!", "paragraph": "With so many new games and movies coming out, it can be hard to keep up. Lucky for you, IGN is here to help with a weekly round-up of the biggest releases each and every week. Check out the latest releases for this week, and be sure to come back next Monday for a new update.Note: The prices and deals compiled below are accurate at the time we published this story, but all are subject to change.Spyro Reignited TrilogyRelease Date: Tuesday, November 13, 2018Spyro Reignited Trilogy introduces players to a fully remastered game collection of the three original Spyro games that started the phenomenon: Spyro the Dragon, Spyro 2: Ripto’s Rage! and Spyro: Year of the Dragon.\n\nSNK 40th Anniversary CollectionRelease Date: Tuesday, November 13, 20182018 marks the 40th anniversary of legendary studio SNK. To celebrate this extraordinary milestone, a variety of classic arcade games from SNK’s golden age come back together in one anthology! The SNK 40th Anniversary Collection includes classic titles such as Alpha Mission, Athena, Crystalis, Ikari Warriors, Ikari Warriors II: Victory Road, Ikari Warriors III: The Rescue, Guerilla War, P.O.W., Prehistoric Isle, Psycho Soldier, Street Smart, TNK III, and Vanguard. Get the complete experience by playing both the arcade and home console versions on many of these titles! Rewind and save at any time while you’re playing, enjoy updated graphics at 1080p resolution, and experience redesigned control schemes for a modern feel! And enter the SNK Museum, which offers an extensive history of SNK and its games. Explore the legacy of one of Japan’s leading developers with high definition artwork and original promotional assets!\n\nRunner3 – PS4 VersionRelease Date: Tuesday, November 13, 2018Runner 3 continues the joyous adventures of Commander Video from BIT.TRIP RUNNER and Runner2. Players will encounter quests, branching paths, item shops, new Retro Challenges, new character moves, new dance moves and a roster of characters. The Timbletot is determined as ever to rid the multiverse of all its love and happiness. CommanderVideo, a lover if ever there were one, refuses to let this happen. He's ready to jump, double-jump, wall-jump, slide-jump, underwear-jump, slide, kick, float, fly, and dance his way to victory, all across a medley of thrilling, challenging, and joyous levels.\n\nHitman 2Release Date: Tuesday, November 13, 2018Unravel the past of the elusive Shadow Client as you track your targets across six new exotic locations and improvise the biggest kills in Hitman franchise history. You can you use everything in your environment to help plan and execute the perfect assassination. Hugely complex environments provide you with endless opportunities to take out your targets in creative ways. Use stealth, sabotage and everything in between to turn your creativity into a deadly weapon. Hitman 2 not only includes a brand new campaign, but also new missions, the high-stakes Elusive Targets and more free live content that gives you new ways to test your killer creativity.\n\nProject Highrise: Architect's EditionRelease Date: Tuesday, November 13, 2018Your job as the architect and developer is to build world-famous skyscrapers that will be the envy of the entire city, masterpieces of art and engineering. But a skyscraper is more than just steel and glass, it’s an intricate ecosystem, full of people that live and work in the building. They become a complex machine that needs your steady hand to keep it running smoothly and efficiently. As well as bringing all the content from the original Project Highrise base game, the Architect's Edition also packs in the Las Vegas DLC as well as the content packs Miami Malls, Tokyo Towers, London Life and the brand new Brilliant Berlin in one definitive edition.\n\nFallout 76Release Date: Wednesday, November 14, 2018Bethesda Game Studios, the award-winning developers of The Elder Scrolls and Fallout game franchises, welcome you to Fallout 76, the online prequel where every surviving human is a real person. Work together, or not, to survive. Under the threat of nuclear annihilation, you’ll experience the largest, most dynamic world ever created in the legendary Fallout universe. Reclamation Day, 2102. Twenty-five years after the bombs fall, you and your fellow Vault Dwellers -- chosen from the nation’s best and brightest – emerge into post-nuclear America. Play solo or join together as you explore, quest, build, and triumph against the wasteland’s greatest threats.\n\nUnderworld AscendantRelease Date: Thursday, November 15, 2018Underworld Ascendant marks the return of the groundbreaking RPG franchise Underworld franchise. Plunder ancient temples, navigate subterranean rivers, gaze in wonder at the masterwork of jade dwarven halls, scale plunging ice caverns, trek through enchanted forests of giant mushrooms, dare shadowy tombs of the undead, and much more. Face monstrous creatures like the ripper, a vicious, ambulatory plant whose bark is prized by The Stygian Abyss' intelligent races; stay clear of mass migrations of ravenous rotworms; dodge the giant spider's sticky webs it casts through the air. This is a world alive with bustling underground societies: enclaves of human renegades scavenging for survival, villages of the mysterious shambler 'mushroom people' performing arcane rituals, dwarven factories producing the finest arms and armor. Alter the environment to your advantage. Flood an arid plain to help the damp-loving shamblers expand their territory, gaining their favor.Changes you make can ripple across the game's reactive, ever-changing ecology, producing startlingly unpredictable results.\n\nWarhammer 40,000: MechanicusRelease Date: Thursday, November 15, 2018In Warhammer 40,000: Mechanicus, take control of one of the most technologically advanced armies in the Imperium -- The Adeptus Mechanicus. As Magos Dominus Faustinius, you’ll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations using the Noosphere technology and control your Tech-Priests every move. Your every decision will shape the missions ahead and ultimately decide the fate of the troops under your command. However, choose your path carefully -- the Imperium depends on it.The MegRelease Date: Tuesday, November 13, 2018From our Review: When the ink has dried on the early 21st century, historians will probably look back and say, “Wow, people loved sharks” and “Wow, people also loved Jason Statham punching things.” Fortunately, those historians will have films like Jon Turteltaub’s The Meg to explain why we love them both. It’s a fun giant killer shark movie, and a solid Jason Statham action romp.\n\nPokémon: Let's Go, Pikachu! and Let's Go, Eevee!Release Date: Friday, November 16, 2018Return to the Kanto region and experience a classic Pokémon journey in a whole new way with Pokémon: Let's Go, Pikachu! and Pokémon: Let's Go, Eevee! Pokémon: Let's Go brings the experience of a classic Pokémon RPG to Nintendo Switch with gameplay that is easily approachable for newcomers to the series, but is also deep enough to keep veteran Trainers on their toes. The games also have two-player simultaneous play, so you can take the journey with a friend! And there’s a deep connection between Pokémon: Let's Go, Pikachu! and Pokémon: Let's Go, Eevee! and Pokémon GO, so fans of the hit mobile game will find even more to enjoy.\n\nLucas M. Thomas assembles Out This Week every week, and when he's not doing that, he's assembling magazine pages as the Editor-in-Chief of Nintendo Force Magazine. New subscriptions available now through Patreon! You can follow him on Twitter, @NintendoForce.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}