{"id": "Best Xbox Gifts of 2018", "paragraph": "If you buy something through this post, IGN may get a share of the sale. For more, read our Terms of Use.The Xbox One has come into its own over the last few years. With 4K Blu-ray and HDR support on both the Xbox One S and the Xbox One X, as well as gorgeous native 4K on the Xbox One X, it's the best possible way to enjoy 4K movies and games right now. But Microsoft's console also plays Xbox 360 and even some original Xbox games, making it great gift for anyone who still has a stack of great, older games on the shelf.If you want to give the best Xbox gifts this holiday season, we've put together this guide to help you out.Xbox One X 1TBIf you want to give the best possible 4K gaming experience, get someone the Xbox One X. Not only is it the best way to play 4K games, it also plays 4K Blu-ray and streams 4K content, too.Looking to give an Xbox One X bundle gift? Check these out:Xbox One S 1TB Console - Battlefield V BundleIf you're not looking to give Microsoft's 4K console, you can get this Battlefield 5 Xbox One S bundle instead. If the person you give it to has a 4K TV, it plays 4K Blu-rays and still does HDR, so it's a cool middle-of-the-road option.Sony XBR49X900F 49-Inch 4K Ultra HD Smart LED TVBe the greatest gift giver of all by getting someone with an Xbox One one of these 4K TVs. This Sony XBR 900F 4K TV makes a great gift because it's a great television. The Xbox One X is an absolute beast with 4K, so your gift recipient will definitely appreciate matching the quality of their console to a quality TV.Looking for other great 4K TV gift ideas? Try one of these sets:Forza Horizon 4Perhaps the best racing game around right now, Forza Horizon is a great gift for the holidays. One an Xbox One X, it's sublime.Call of Duty Black Ops 4Basically three games in one (and we reviewed it as such), Black Ops 4 takes 2 classic modes and adds in a new battle royale mode.Red Dead Redemption 2This one will absolutely be in top contention for game of the year, and it looks and plays its best on Xbox One X. Give the gift of living the cowboy lifestyle.Red Dead Redemption: Game of the Year EditionThe original Red Dead Redemption is backwards compatible, and it even runs and looks better on the Xbox One X. This is a great gift because it's a pair of excellent games in one package.Consider these other Xbox One game gifts this holiday season:Xbox Elite ControllerThe best controller, period, makes one of the best gifts this holiday season. It also works on PC, so it's dual-purpose.HyperX Cloud II Gaming HeadsetIf you want to give a high quality headset without spending hundreds of dollars, the HyperX Cloud II is the best gift you can give. It's comfortable, rugged, sounds great, and is compatible with all kinds of devices.Logitech G920 Dual-Motor Feedback Driving Force Racing Wheel with Responsive PedalsExperiencing Forza Horizon 4 in 4K and HDR is made even more incredible by giving this Logitech G920 racing wheel as a gift.Even more great Xbox controller and accessory gifts:12 Month Xbox Live Gold MembershipA subscription to Xbox Live is a great gift, because it's so loaded with value. Not only does it open up all the online benefits for someone, it also nets them free games throughout the year, as well as exclusive discounts.Even more of the best Xbox One subscription gifts:We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}