{"id": "Everything to Know About Mars Season 2: Terraforming, Martian Babies, More Drama", "paragraph": "Colonizing Mars might seem like a far-future sci-fi fantasy, but National Geographic's half-documentary, half-scripted drama Mars posits that perhaps it's not too far off. The hybrid series is back for a second season on Mondays at 9 p.m. ET beginning Nov. 12, and while the second season leans heavier into the soapy, scripted drama, the urgency of scientists' latest warnings about climate change make it more topical than ever.One thing we learn in the series is that even embarking on the seven-month journey requires years of rigorous training — and there's no guarantee of a return trip back.\"When they go up there, [astronauts] are signing a will. They know there's a very good chance that they could die, and they could not come back,\" star Jihae told IGN and a small group of reporters during a visit to the series' Budapest, Hungary set in the summer of 2017. \"That's quite a sacrifice.\"The second season will jump ahead five years from the end of Season 1, to 2042, when the Mars settlers will deal with a mysterious plague, natural disasters, and a new baby — all while trying to terraform the planet (a.k.a. manipulate the environment) to allow for human life. The most important resource they'll need is water, which is why a private, for-profit corporation joins the International Mars Science Foundation (IMSF) on the planet with one goal: to mine for water (and reap the spoils).Explained new showrunner Dee Johnson, \"It's ultimately the battle for the soul of the planet — who's going to treat it the best, and what's going to happen if they get the other hand?\"If you missed Mars' first season, or just need a refresher, here's what IGN unearthed — or un-mars'd? (sorry) — about the Brian Grazer/Ron Howard-produced series' new six-episode run. (Spoilers for Season 1 follow!)The first season of the series used a unique combination of talking head-style documentary filmmaking — experts including SpaceX founder Elon Musk, astrophysicist Neil deGrasse Tyson, and The Martian author Andy Weir all discussed what, exactly, it would take to send humans to Mars — and a scripted story about sending the first team of scientists to the red planet.The scripted side followed a group of astronauts in 2033 who embark on the seven-month, roughly 34 million-mile trip to Mars on a mission to colonize the planet. Not everyone survived, and the harsh environment got to some — like one scientist who opened an airlock and killed himself and several others. The experiment was on the brink of being canceled when Hana Seung (Jihae) went rogue — and found life.Season 2 begins in 2042, with the IMSF colony expanded and thriving. (Indeed, filming took place on huge soundstages outside of Budapest — coincidentally at the same stages where Matt Damon filmed The Martian. IGN toured the set, which was impressively futuristic and expansive. There's nothing in the Hungarian countryside that screams \"Mars,\" so it's mostly just a coincidence that both productions happened here.) The team of scientists include Hana, who is now the captain, her twin, Joon Seung (also played by Jihae), who is about to join her on Mars, engineer Robert Foucault (Sammi Rotibi), geochemist Javier Delgado (Alberto Ammann), physician Amelie Durand (Clementine Poidatz), biologist Marta Kamen (Anamaria Marinca), second-in-command lieutenant Michael Glenn (Gunnar Cauthery) and biologist Cameron Pate (Levi Fiehler).But the settlers of Olympus Town get new neighbors when the private corporation Lukrum Industries sends a team of miners to find water — and the newcomers' capitalist mission clashes with the scientists' more altruistic goals. On Earth, the company is led by ruthless CEO Roland St. John (Esai Morales), and his No. 1 on Mars is Kurt Hurrelle (Jeff Hephner). Other miners include Shep Master (Evan Hall) and Jen Carson (Roxy Sternberg).New showrunner Dee Johnson, a veteran of shows ranging from Melrose Place to ER (and most recently, ABC's Nashville), told IGN that the percentage of doc sections to scripted is more well-balanced in Season 2 — and the segments themselves pointedly parallel the Mars storylines.\"We worked really closely with our documentary friends,\" Johnson explained. \"They've known all along what story we're telling. Every step of the way we've integrated as best we can what they have anticipated getting.\"\"Big thinkers\" on the doc side include Musk, Pulitzer Prize-winning author Jared Diamond, former Speaker of the House Newt Gingrich, NASA planetary scientist Chris McKay, science educator Bill Nye, and author Stephen Petranek, author of the book How We'll Live on Mars (on which the series is based). The series will skew more toward the serialized, scripted drama side of things, however and star Jihae told IGN that the focus will be on the clash between the scientists and the miners. Essentially, exploration vs. exploitation of the planet.\"They're pretty much corporate thugs and they're coming to monetize Mars,\" she said, likening the situation to oil drilling in Alaska. Plus, \"the corporation didn't sign an outer space treaty. They're not bound by any laws.\"Morales told IGN that his character is the one who reminds the IMSF that Lukrum has the money the scientists need to continue the mission.\"It'd be better if they played ball because without our expertise and infrastructure, their science is about to dry up. It's like a plant without water,\" he explained. \"I have a tightrope to walk, which is get what I need without alienating these people and having backup plans in case they think they can get too precious about their science. As industrialists, our perspective is less idealistic.\"And they need the water, too.\"The only way the Mars colonists can expand is if they find enough water,\" Petranek said. \"You can't bring in hundreds and hundreds of people unless you find acres and acres and acres of more water.\"There are only so many materials that can make the seven-month journey to Mars, which means when explorers do arrive on the planet, they have to build structures there using materials found on-world. The easiest solution? 3D printing using soil from Mars. Fun fact: Production designers used their own 3D printer to make props, set pieces, and even costume accessories — though they used plain old Earthbound materials, of course.The talking heads in the documentary segments discuss real-world, real-time challenges we're facing on Earth today, and most of the stars have thought deeply about what colonizing Mars would mean. It's an incredibly expensive prospect, which is a difficult pill to swallow when you consider that so many people on Earth live in poverty, said Jihae.Then again, she added, \"A lot of leading scientists believe that there are so many ways and reasons why Earth could go extinct and why the human species could go extinct, and it only makes sense for us to explore another [planet].\"But Morales, who is an environmentalist in real life, said the most important thing to remember is that while the future of human life on Earth is at stake, the Earth itself is not.\"We will never destroy the Earth,\" he said. \"It's so arrogant of humans to think we could destroy the Earth. Even if you blew up all the bombs you had, it might look like Swiss cheese but the Earth will be here. We won't, that's for sure, but the Earth will be here.\"Mars airs Mondays at 9 p.m. ET on National Geographic Channel.\n\nJean Bentley is an entertainment reporter who is actually extremely scared of space, and was fascinated by Mars' first season despite still being haunted by the benign image of Wall-E floating outside of the spaceship. Send her comforting cat GIFs on Twitter at @hijean.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}