{"id": "Top Comics to Buy This Week: Uncanny X-Men #1, Firefly #1 and More", "paragraph": "With dozens of comic books to choose from, let us show you which are the best coming out this week. Take a look at this list spotlighting our favorite comics that we know are money-well-spent and new books that look cool and are backed by some top-tier talent.Once you check out our picks, head to the comments to let us know what you’ll be buying this week!Writers Ed Brisson, Kelly Thompson & Matthew Rosenberg | Artists Mahmud A. Asrar, Mark Bagley & Mirko Colak | Cover Artist Leinil Francis Yu (Marvel Comics)It just feels weird to see Marvel publishing so many X-Men comics and not to have Uncanny X-Men among them. The original flagship X-book is finally returning this week. Not only is it replacing the recently concluded X-Men Blue and X-Men Gold, Uncanny is a weekly comic that promises to shake up the status quo of the franchise in a major way. In fact, the first ten issues comprise a story called 'X-Men Disassembled.\" Last time there was a Disassembling in the Marvel Universe, Brian Bendis took over the Avengers comics and completely reshaped the course of that franchise. Only time will tell if this new series is as influential.\n\nWriter Tom King | Artist Mitch Gerads | Cover Artist Nick Derington (DC Comics)This is easily the most bittersweet release of the week (if not the entire year). Mister Miracle has easily ranked among the best superhero comics on the stands since it debuted. That all comes to a close in this issue. Will Scott Free find the happy ending he deserves? Has anything in this story actually been real, or simply the crazed hallucinations of a man struggling to escape death? We'll soon find out.Writers William Gibson & Johnnie Christmas | Artist Johnnie Christmas (Dark Horse Comics)Alien 3 is widely regarded as one of the great disappointments in sci-fi movie history, failing to meet the standard set by its predecessors. And while we're still keeping our fingers crossed that Neill Blomkamp's Alien pseudo-reboot will happen, Dark Horse is giving fans a different taste of what might have been for the franchise. This miniseries adapts William Gibson's unproduced screenplay for the sequel, which thrusts Ripley, Bishop and Newt onto a space station overrun by Weyland-Yutani's genetically engineered Xenomorphs. We're certainly eager to see what the combination of a cyberpunk legend and the mind behind Angel Catbird can produce.\n\nWriter John Barber | Artist Alex Milne (IDW Publishing)This is the other big finale of the week. Transformers: Unicron #6 is the culmination of every IDW Transformers story from the past 13 years. It all comes down to one final confrontation between our heroes and the world-devouring villain. And at this point, there's no telling what will be left standing when the dust settles. We don't even know for sure that IDW will continue to publish new Transformers comics. Even if they do, expect a radically different status quo in 2019.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}