{"id": "Detective Pikachu Trailer Breakdown: 60+ Pokémon, Easter Eggs and Hidden References", "paragraph": "The first Detective Pikachu trailer is finally here, and with it comes nearly two dozen Pokemon rendered as realistically as possible. Some were clear, but many were hidden in a “blink and you’ll miss it” fashion.Featured Pokemon include Jigglypuff, Braviary, Joltik, Pancham, a terrifying Mr. Mime and more. Check out the slideshow below to spot each and every one to see how these creatures would look in the real world.The trailer also had various nods to Pokemon that weren’t actually shown in full, including signs with Victini, Wooper, Petilil and more. There were also multiple posters showing off both regular and legendary Pokemon like Rayquaza, Reshiram and Zekrom.\n\nIn addition to the trailer itself, an official poster for Detective Pikachu was revealed on Twitter, and it’s chock-full of its own poke-references. Looking closely, there’s a “Unova Style Pizza” sign, calling back to the Unova region in Gen 5 being analogous to New York, the Hi-Hat Cafe from the Detective Pikachu game, signs for Moomoo Milk, berry juice, rare candy and more.More cool details, which can be discovered on the movie’s official website, include the purple “M2” graffiti on the dumpster referencing the legendary Mewtwo, a camera sign with the word snap calling back to the Nintendo 64 classic Pokemon Snap, a Pokemon Daycare, neon signs depicting Pokemon such as Loudred, references to in-game items like repel, a sign for J. Puff (Jigglypuff) Records, and an Eevee salon possible alluding to upcoming customization options in Pokemon: Let’s Go, Eevee!For more on Detective Pikachu, check out why the first live-action Pokemon movie features Detective Pikachu instead of Ash Ketchum, and the reveal of the movie’s official logo. Detective Pikachu hits theaters in Summer 2019.Colin Stevens is a news writer for IGN, and realistic Mr. Mime will haunt his dreams. Follow him on Twitter.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}