{"id": "Update: Overwatch's New Hero Ashe Is Now Available", "paragraph": "Update: Blizzard has announced Overwatch's newest hero Ashe is now available to play in the game.Overwatch's official description for the character reads:The 29th hero to join the Overwatch roster, Ashe — also known as Elizabeth Caledonia Ashe — is a gunslinger hailing from the American Southwest. Armed with the Viper rifle, Ashe is a versatile damage hero, able to fire rapidly from the hip or line up a high-damage shot through her sights. She blasts enemies by throwing dynamite, and her coach gun packs a major punch, knocking foes or Ashe back for added mobility. And Ashe is not alone, calling her omnic ally Bob to join the fray when the need arises.For more on Ashe, check out her abilities below in the original story:\n\nBlizzard has announced that its newest hero being added to Overwatch is Ashe, who was heavily featured during the McCree animated short highlighted at BlizzCon 2018.Ashe can call upon Bob, her robotic fellow gang member, as part of her Ult. Ashe is the leader of the Deadlock Gang. Check out her standoff with McCree in the animated short \"Reunion\" below.\n\nAshe is a damage character, who can fire from the hip with her rifle or aim down the sights for higher damage. She carries with her dynamite, and more. Check out the full rundown of details below, as explained by Overwatch's official website:If you'd like to hear more about how those abilities work, be sure to check out our hands-on impressions of playing as Ashe from BlizzCon.\n\nHer character reveal video showed her in action. New details are being revealed at BlizzCon, stay tuned for more on her abilities.Speaking on stage, Blizzard's Jeff Kaplan also seemed to imply that Echo, who also features in the new animated short, will be a playable character at some point, but that more time was needed with the character.\n\nBlizzard has kept Overwatch plenty busy in between BlizzCons, both in and out of the game. In addition to the levitating Snowball and the Genji Sword, Overwatch's heroes and environments have been adapted into LEGO form. The first LEGO Overwatch set has already been revealed and already available.Check out the gallery below to see images of leaked Overwatch LEGO sets, and stay tuned as we wait to see if more LEGO news is revealed at BlizzCon.For more on Overwatch, find out where it placed on our recently updated lists for the Top 25 Xbox One games, the 25 Best PS4 games, and the Top 25 Modern PC games.Stay tuned for more from BlizzCon 2018.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}