{"id": "Comics, Hollywood Communities Mourns Stan Lee", "paragraph": "Immediate outpouring of gratitude for Stan Lee came through social media just moments after news broke that he passed away Monday morning.From actors and directors who have worked with him or were inspired from afar - people took to Twitter to share their thoughts and inspiration they've gained from the late icon.Marvel Studios President, Kevin Feige, said in a tweet, \"No one has had more of an impact on my career and everything we do at Marvel Studios than Stan Lee. Stan leaves an extraordinary legacy that will outlive us all. Our thoughts are with his daughter, his family, and his millions of fans.\"\n\nChris Evans, who has played Captain America for the past seven years until he recently announced he has hung up his shield, tweeted, \"There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!!\"Evangeline Lilly tweeted, \"Stan...more than a master of stories, you always seemed like a master of living.  I will look to you for inspiration for the rest of my life.  You live on. xoxo Your Wasp\" and continued in a separate tweet asking fans to \"flood the internet\" with any artwork that's ever been created out of inspiration from Stan Lee, while starting the hashtag #BreakTheInternetForStan.You may not have known it, but your stories, editorial notes, letters pages, and Soapboxes that we read growing up became the voice we needed to guide us through life and inspire us to strive to be the heroes that you knew we could be. Rest in peace, Stan Lee, and thank you. pic.twitter.com/NisO7GDAku— Bill Rosemann (@BillRosemann) November 12, 2018Awww man, heartbreaking. R.I.P. to a true pioneer and legend. My youth wouldn’t have been the same without him. So grateful to have met the guy, and told him how thankful I was for his work. #stanlee https://t.co/UiYscXKoLQ— James Wan (@creepypuppet) November 12, 2018There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!!— Chris Evans (@ChrisEvans) November 12, 2018No one has had more of an impact on my career and everything we do at Marvel Studios than Stan Lee. Stan leaves an extraordinary legacy that will outlive us all. Our thoughts are with his daughter, his family, and his millions of fans. #ThankYouStan #Excelsior!— Kevin Feige (@Kevfeige) November 12, 2018I wrote a fan letter to Stan Lee as a kid. He sent me a thank you note and a signed copy of HOW TO DRAW COMICS THE MARVEL WAY. There is a part where it compares two different ways to frame a dialogue scene. I literally started my filmmaking education there.— Joseph Kahn (@JosephKahn) November 12, 2018We lost a real-life superhero today. Stan Lee was a visionary, who elevated imaginations across the globe. I’m grateful for the time I got to spend with him. Rest peacefully, Stan. pic.twitter.com/Ie2S18y0A0— Larry King (@kingsthings) November 12, 2018His contribution to Pop Culture was revolutionary & cannot be overstated. He was everything you hoped he would be & MORE. I loved this man & will never stop missing him. They say you should never meet a childhood idol. They are wrong. #RIPStanTheMan pic.twitter.com/6OKH07ahJg— Mark Hamill (@HamillHimself) November 12, 2018Thank you Stan Lee. For your service in protecting our freedom and for your creativity and imagination! You were and will always be a SUPER HERO! pic.twitter.com/d1qpuImyzQ— Jamie Lee Curtis (@jamieleecurtis) November 12, 2018Thank you for filling our childhoods with such joy. You will be dearly, dearly missed... pic.twitter.com/Qt2sZqaNlc— Russo Brothers (@Russo_Brothers) November 12, 2018Rest in peace, Stan Lee. The many worlds of imagination & delight you created for humanity will last forever.— Elon Musk (@elonmusk) November 12, 2018Thank you @TheRealStanLee for being you. Thanks for your generosity and guidance over the years and thanks for always treating me so special. Rest In Peace my friend.— Jimmy Palmiotti (@jpalmiotti) November 12, 2018THANK YOU, @TheRealStanLee. You gave us characters that continue to stand the test of time and evolve with our consciousness. You taught us that there are no limits to our future as long as we have access to our imagination. Rest in power! #EXCELSIOR #StanLee #rip pic.twitter.com/hnSmnHIDln— Winston Duke (@Winston_Duke) November 12, 2018We are deeply saddened to hear of the passing of Stan Lee, a legend in our industry.Our thoughts go out to his many fans, his friends, and family. Excelsior. pic.twitter.com/WU1s2RR6Mb— San Diego Comic-Con (@Comic_Con) November 12, 2018Stan Lee, RIP. Thanks for inspiring so many of us to pick up a pen or pencil and put your dreams onto paper. Excelsior! pic.twitter.com/L33eTjUQdI— edgarwright (@edgarwright) November 12, 2018He inspired millions with his myriad, “Marvelous” characters, from Spiderman to Black Panther, Thor to the X-Men. Legendary creator Stan Lee is dead at 95. But his stories will live on and continue to ignite the imaginations of generations to come. Rest with the stars, great sir.— George Takei (@GeorgeTakei) November 12, 2018Stan Lee’s marvelous, wondrous, infinite imagination gave birth to worlds, heroes, and stories that captivate people everywhere — across generations. While we are sad to lose him today, his creative legacy is immortal. Rest in peace Stan. #Excelsior pic.twitter.com/7i4azNcumK— Mayor Eric Garcetti (@MayorOfLA) November 12, 2018Thanks for being our hero, Stan. pic.twitter.com/HZlUeZW87s— Netflix US (@netflix) November 12, 2018Stan...more than a master of stories, you always seemed like a master of living. I will look to you for inspiration for the rest of my life. You live on. xoxo Your Wasp . #liveon #StanLee pic.twitter.com/JRA2aRM3bG— Evangeline Lilly (@EvangelineLilly) November 12, 2018We’ve lost a creative genius. Stan Lee was a pioneering force in the superhero universe. I’m proud to have been a small part of his legacy and .... to have helped bring one of his characters to life. #StanLee #Wolverine pic.twitter.com/iOdefi7iYz— Hugh Jackman (@RealHughJackman) November 12, 2018Stan Lee created a universe where, if a character was beloved enough, they could never really die.Now THAT’S thinking ahead.Thanks for so much of my life. You’ll never not be in it.— Joss Whedon (@joss) November 12, 2018pic.twitter.com/dTdDjRvXbs— stan lee (@TheRealStanLee) November 12, 2018\"And now, until we meet again, may the blessings of Asgard be showered upon you!\" - Stan Lee, Balder the BraveThank you for sharing your genius and your heart with the world, Stan. pic.twitter.com/uMjipTmyY6— Geoff Johns (@geoffjohns) November 12, 2018Can you imagine being one of the guys that made comic books&comic book characters what they are today. I often wonder what it was like in those offices with those first artists&writers. I never met ⁦@TheRealStanLee⁩ . Only heard great things about him. He'll be missed. pic.twitter.com/8D0OJa9E3x— Vincent D'Onofrio (@vincentdonofrio) November 13, 2018We’re saddened by the loss of @TheRealStanLee, a visionary who created a universe of superheroes and comics. In his honor, here’s a deep-field look into the universe from our @NASAHubble Space Telescope. #Excelsior pic.twitter.com/9UHjyXwIkh— NASA (@NASA) November 12, 2018RIP Stan Lee. Thank you for making me believe in marvels.— Marc Guggenheim (@mguggenheim) November 12, 2018Today, we pause and reflect with great sadness on the passing of Stan Lee: https://t.co/J0cwgdn677 pic.twitter.com/eOBdZAqdZ0— Marvel Entertainment (@Marvel) November 12, 2018Thank you Stan Lee for making people who feel different realize they are special.— Seth Rogen (@Sethrogen) November 12, 2018RIP to the great @TheRealStanLee pic.twitter.com/Xn6bi8kufP— Jonathan Frakes (@jonathansfrakes) November 13, 2018He changed the way we look at heroes, and modern comics will always bear his indelible mark. His infectious enthusiasm reminded us why we all fell in love with these stories in the first place. Excelsior, Stan.— DC (@DCComics) November 12, 2018— Todd McFarlane (@Todd_McFarlane) November 13, 2018— Lupita Nyong'o (@Lupita_Nyongo) November 13, 2018— Anthony Mackie (@AnthonyMackie) November 12, 2018— Jeremy Renner (@Renner4Real) November 12, 2018Thank you @TheRealStanLee for the escape from this world & great joy inhabiting the ones you created!! You made so many believe in the good, the heroic, the villainous, the exciting, most of all, you were giving & gracious to us all. RIP— Samuel L. Jackson (@SamuelLJackson) November 12, 2018Goodnight Stan pic.twitter.com/XQzNnUtAeM— Scott Derrickson (@scottderrickson) November 12, 2018I have just learned of Stan Lee’s passing. I had the honor of knowing this true Superhero whose talents transcend and whose work impacted generations. Rest easy my friend....You made this world so much more interesting and colorful.— Billy Dee Williams (@realbdw) November 12, 2018RIP Stan Lee. (1922-2018) https://t.co/HKoSLNwNEh pic.twitter.com/UR9w8pC3Nk— Venom (@VenomMovie) November 12, 2018Rest in peace, Soldier.Comic book creator @TheRealStanLee has passed away at the age of 95. Lee served in the #USArmy Signal Corps during WWII from 1942-1945. We are deeply grateful for his service to our country and for his tremendous support to servicemembers. #Excelsior! pic.twitter.com/P9tdwoxxx2— U.S. Army (@USArmy) November 12, 2018Onward and upward to greater glory! Excelsior! Good man, Excelsior! https://t.co/rXLCmk4uiS pic.twitter.com/oQ89AKfkao— Angela Bassett (@ImAngelaBassett) November 12, 2018Now that was a life well lived and lived to its fullest. Excelsior! 1922-2018 Thank you Stan Lee, from all your fans.— Paul Bettany (@Paul_Bettany) November 12, 2018RIP Stan. Thank you for your brilliance. pic.twitter.com/FIZEt2B5vN— Karen Gillan (@karengillan) November 12, 2018To dive into the life of the Marvel Comics co-creator, read IGN's piece on the legend of Stan Lee, where we say, \"Lee became an icon known across the world thanks to his glowing personality, sharp wit, and warm sense of humor, instantly recognizable in his signature aviators and tightly trimmed mustache.\"Jessie Wade is a news writer for IGN and is giving hugs to everyone across the world who is saddened by this news. Chat with her on Twitter @jessieannwade if you'd like.We encourage you to read our updated PRIVACY POLICY and COOKIE POLICY."}