{"id": "TechRadarSome Pixel 3 and Pixel 3 XL owners are having problems saving photos", "paragraph": "\nBy\nDavid Nield\n2018-10-20T09:30:38Z\n\nMobile phones\n \n\nIf you've just put down a chunk of cash on a brand new Pixel 3 or Pixel 3 XL phone, then you'd want it to work flawlessly when you get it out of the box. However, some owners of Google's new flagships say there's an issue with the Camera app not saving pictures.And it's not actually a new issue – according to a Reddit thread discussing the problem, it can also affect Pixel 2 and Pixel 2 XL devices, and even older phones running Android. The issue seems to come and go intermittently though, and affects different users in different ways, depending on the hardware and software setup.What does seem clear is that this bug is definitely real, even if it's not affecting everyone: numerous posts on Twitter report photos that magically vanish once they've been taken, even after the little preview image appears down in the corner of the Camera app screen.So what's going on? No one knows for sure, but it might be that if you switch away from the Camera app too quickly, the software doesn't have time to properly finish processing and saving the shot. For the time being that's just a theory, however.Google has yet to say anything official about the bug, but considering the number of users apparently frustrated by it, we'd say a fix should be rolling out sooner rather than later. If there is an official statement issued, we'll update this article – otherwise you might just have to sit tight if you've found this happening on your own Pixel 3 or Pixel 3 XL.It's possible that the problem is related to the way Android handles images in general, or the Google Photos cloud sync, rather than a specific issue with the Camera app. For now though, just give your shots as much time to process as you possibly can.Via Android PoliceGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}