{"id": "TechRadarApple MacBook Air review", "paragraph": "\n\n \n \n \n \n\nBy\nMatt Hanson\n2018-11-08T12:47:28ZLaptops & portable PCs \nFans of the Apple MacBook Air have been clamoring for an update to the thin-and-light laptop for a while now, and they won’t be disappointed by the fact that it’s thinner and lighter than ever before; however, it’s only slightly faster, and definitely more expensive, and if you’ve not been convinced by the MacBook Air before the cosmetic enhancements might not be enough to sway you.Apple’s MacBook Air (2018) isn’t a bold reimagining of its iconic original MacBook Air, arguably the first ever Ultrabook, but it brings enough new features and upgrades that make it the best entry-level MacBook with a Retina display the Cupertino company has made.This year’s update includes updated hardware, a much-improved screen and a thinner and lighter design that makes it more easily portable – finally justifying the ‘Air’ moniker.These welcome updates and new additions do come with a caveat, however: the MacBook Air (2018) is the most expensive MacBook Air to date. So, while the MacBook Air remains one of the more affordable ways to get a MacBook, do the new features justify the higher price tag?Here is the MacBook Air configuration sent to TechRadar for review:CPU: 1.6GHz Intel Core i5-8210Y (dual-core, 4 threads, 4MB cache, up to 3.6GHz)Graphics: Intel UHD Graphics 617RAM: 8GB (2,133MHz LPDDR3)Screen: 13.3-inch, 2,560 x 1,600 Retina display (backlit LED, IPS)Storage: 256GB PCIe SSDPorts: 2x Thunderbolt 3 (USB-C), 3.5mm headphone jackConnectivity: 802.11ac Wi-F, Bluetooth 4.2Camera: 720p FaceTime HD webcamWeight: 2.75 pounds (1.25kg)Size: 11.97 x 8.36 x 0.61 inches (30.41 x 21.24 x 1.56cm; W x D x H)This is the highest price for a MacBook Air in the history of the device, but, while some people were hoping the 2018 model would match the $999 price of previous Airs, it’s still the most affordable Apple laptop when bought new.For anyone dismayed by Apple’s high (and rising) prices for its devices, that might not be much comfort, with the MacBook Air (2018) starting at $1,119 (£1,119, AU$1,849).For that price, you get an 8th-generation Intel Core i5 processor, 8GB of memory and 128GB of SSD storage inside. This can be configured, but of course the price goes up from there if you upgrade things like the memory and storage, which now max out at 16GB and 1.5TB respectively.There's also a more expensive pre-configured MacBook Air for $1,399 (£1,399, AU$2,149) which comes with a 256GB SSD, but otherwise the same components. That’s a price increase of $200 / £200 / AU$300 for an extra 128GB of storage space, and even by Apple’s standards that’s a rather ridiculous hike – you’d be better off sticking with the 128GB model and buying an external hard drive.If you want to configure your MacBook Air, you can double the RAM to 16GB at 2,133MHz for an extra $200 / £180 / AU$320.To up the storage to 512GB SSD will cost you an extra $400 / £400 / AU$600 to upgrade from the base model, while upgrading to 1.5TB is an extra $1,200 / £1,200 / AU$1,800.No other components can be changed on 2018's Apple MacBook Air, which means you’re stuck with the disappointing choice of a 1.6GHz dual-core 8th-gen Intel Core i5 processor. The above costs also highlight Apple’s crazy-expensive prices for storage. We haven't tried to take the MacBook Air apart, but we’d wager it’s extremely difficult to open it up and install a larger – and cheaper – SSD yourself.If you don’t need that much storage space, and rely on cloud services for most things, this won’t be too much of an issue. But, for people who need their disk space, it means the MacBook Air can quickly become quite an expensive proposition – unless, as we suggested earlier, you get an external hard drive.The market for premium $1,000 / £1,000 laptops is now more competitive than ever, with some remarkable machines dominating this price point, mainly spurred on by the success of the original MacBook Air. With a price of $1,119 (£1,119, AU$1,849), the MacBook Air is competing against a number of excellent Windows laptops, such as the Dell XPS 13 and Huawei MateBook X Pro, which both offer more powerful components and gorgeous screens for similar prices.Where the MacBook Air used to be unquestionably the best laptop at this price point, it’s now facing an uphill battle to reclaim that title – and sadly, with these specs, it’s not quite going to manage that.Of course, the XPS 13 and MateBook X Pro are only viable alternatives if you’re prepared to switch to Windows 10. If you’re wedded to macOS and Apple’s ecosystem, then the Apple MacBook Air (2018) offers the most affordable way to get a new MacBook – however, that doesn’t mean it offers the best value. For around $100 / £100 more you can get the base model of the 13-inch MacBook Pro 2018 ($1,299 / £1,249 / AU$1,899), which comes with a brighter screen and more powerful components. For many people, that extra money will be well worth the outlay for a better-performing MacBook.When the first MacBook Air launched 10 years ago the design made an incredible impact on the laptop market, as it proved you could have a powerful and feature-packed laptop in a thin and light design.One could convincingly argue that the MacBook Air caused Intel and rival laptop makers to create the Ultrabook category of laptops, which were premium devices that put power, style and thin and light design above all else.With the original MacBook Air’s design having had such a huge impact on the market you might have been hoping that, for its 10th anniversary, Apple would have created a similarly revolutionary design – and if that’s the case then you may be slightly disappointed by the design of the MacBook Air (2018), as Apple has played it relatively safe.While this means it’s not a market-defining laptop like its predecessor, it does keep that iconic thin and light design, while benefiting from some important improvements where it counts.So, the MacBook Air (2018) has been shrunk compared to the original, making an already thin and light laptop even more impressively svelte, with dimensions of 11.97 x 8.36 x 0.61 inches. There's still wedge-shaped design to this Air, so it tapers off to 0.16 inches at its thinnest point.As we noted in our initial hands-on review of the new MacBook Air, the new laptop has the same width and depth as the 13-inch MacBook Pro, while being a bit thinner and lighter.The reduced size and weight of the new MacBook Air doesn’t mean there’s been a cut to features to accommodate this. You still get a 13.3-inch screen (more on that in a bit), and as mentioned it comes with boosted hardware, including a 8th-generation, dual-core Intel Core i5 processor and 8GB of RAM, which can be upgraded to 16GB.Port-wise, you get two USB-C (Thunderbolt 3) ports along the left-hand side of the MacBook Air. You can use either one for charging, and we’re glad that Apple continues to use the USB-C format as a charging port, rather than its proprietary MagSafe port, which makes the Air a far more user-friendly and flexible device.One issue we were initially concerned with was the fact that both USB-C ports are along one side, and quite close together, as this means that, when the MacBook Air is plugged in to charge, the second USB-C port can be a bit too close to plug things in unless you have an adapter. Having a USB-C port on either side, like the Dell XPS 13, would have avoided this situation, while giving you a bit more flexibility when it comes to charging.However, for most people this won’t be too much of a problem, and we’re glad to see Apple move over to USB-C for the latest MacBook Air. It helps keep the body of the MacBook Air slim, while future-proofing the laptop by making it compatible with new and upcoming USB-C peripherals.If you rely on legacy USB peripherals, then you’re going to need a dongle or dock for them to work with the Apple MacBook Air (2018). Yes, that’s annoying, but you’ll likely find that you’ll soon need to do this with most modern laptops, especially premium thin-and-light Ultrabooks.The two USB-C ports are certainly a step up from the single USB-A port of previous MacBook Airs. The only other port is a 3.5mm headphone jack – an increasingly rare sight on Apple products – on the right-hand side.The Apple MacBook Air has a redesigned keyboard that features Apple’s third-generation butterfly mechanism, which Apple claims provides four times more key stability than standard laptop keyboards, while offering greater comfort and responsiveness.In our time with the new MacBook Air we found that the keyboard does take a little getting used to, especially if you’re coming from an older MacBook Air, but once your fingers adjust it ends up being quite a pleasant typing experience.The keys are very shallow, travel-wise, so you don’t quite get the responsive feedback you get from other laptop keyboards, but that’s the price you pay for such a slimline design. There’s also a satisfying ‘click’ to the keys when pressed, although this does make it a bit more noisy to type on than previous versions.However, the mention of a ‘butterfly’ keyboard may worry anyone who's seen the spate of reports about how the butterfly keyboards on some MacBooks were encountering issues. Apple hasn’t revealed if it has made any tweaks to the butterfly switches of its keyboards to prevent future issues, and while at the time of writing this review it’s too early to be getting reports of MacBook Air (2018) owners encountering the issue, it may give some people pause.Time will tell if the much-maligned butterfly switches used in this keyboard suffer from similar issues as previous generations, but we hope Apple has addressed many of the problems with this third-generation model.The MacBook Air (2018) also has Touch ID built in, allowing you to log into the laptop with your fingerprint. It’s a useful, time-saving feature, and genuinely makes logging into the MacBook Air quick and easy. As with other Mac devices that have Touch ID, the feature works very well, detecting fingerprints and logging us in without any issues.While Touch ID is included, a Touch Bar – that slim additional display that sits above the keyboards of some MacBooks, offering contextual shortcuts for the apps you’re currently using – isn't. We feel this feature won’t be sorely missed, however, with the function keys along the top of the keyboard being more than adequate for offering quick access to various tools.While the chassis surrounding it has shrunk, the Force Touch trackpad has actually grown, and is now 20% larger than the standard trackpad on previous MacBook Airs, offering more room for gestures and to move the cursor around – you won't want to go back to a smaller trackpad once you try it. Also, unlike on older MacBook Airs the trackpad is now flush with the body, and requires only gentle presses to register as clicks. It’s a much more comfortable, and quieter, experience.The use of recycled aluminum makes this the greenest MacBook ever, according to Apple, and while its unibody design has been made from the metal shavings from previously machined devices (which means Apple doesn't need to mine and smelt further materials), there are no blemishes or marks; this is the same premium-looking – and feeling – MacBook Air we’re used to, just greener. Apple told us it has achieved this design feat by employing full-time, in-house metallurgists to help ensure that the recycled aluminum body is up to Apple’s rigorous standards.The MacBook Air (2018) unibody shell is cut from a solid block of aluminum, which gives it a sturdy feel despite its thin and light design. It’s an impressive machine to hold, feeling light enough to easily carry around yet robust enough that you can happily chuck it in a backpack and take it with you when you’re on the move.The speakers have also been improved, and despite their small size have twice the bass of the previous model’s, and are capable of 25% louder volume. The T2 security chip, which is built into the MacBook Air and offers a number of security features, also helps with stereo spacing of the speakers. The idea is that this gives the impression of the two speakers being further apart than they actually are – we tried it out by watching some films, and there is a clear distinction when sounds pan from left to right, although it doesn’t rival a proper stereo setup with speakers placed at either side of a room.The speakers are clear, with a good range, and they still sound really good at high volumes. This sort of sound quality is rare on slim and light laptops, and the improved audio, combined with the updated and improved high-resolution screen, makes the MacBook Air a brilliant laptop for watching films and listening to music on.A 720p FaceTime HD camera and three-microphone array helps to make video and voice calls look and sound good as well, although the resolution is increasingly looking outdated compared to rival laptops that feature 1080p webcams.Apple is offering a range of colors for the MacBook Air: Space Gray, Gold and traditional Silver. However, the illuminated Apple logo has been dropped for a chrome one – the thinner lid design can't accommodate that classic piece of design flair.Overall, while the design isn’t as revolutionary as that of the original MacBook Air, Apple has gone to impressive lengths to improve on the look and feel for the new model.The screen on the Apple MacBook Air (2018) is where Apple has arguably made the biggest, and most welcome, changes. Despite the overall size of the Air shrinking compared to previous models, the screen size remains the same at 13.3 inches.This was achieved by slimming down the bezels around the screen, and not only does it mean the new MacBook Air is smaller and more easily portable than its predecessors, it also means the screen itself is more prominent when in use.The screen keeps the 16:10 aspect ratio, but that’s where the similarity to previous MacBook Air screens ends. The MacBook Air (2018) is the first Air to come with a Retina display, with a resolution of 2560 x 1600 pixels. This results in a pixel density of 227 pixels per inch (ppi), which is a little sharper than the MateBook X Pro, and easily outclasses the entry-level XPS 13.The Retina screen gives this MacBook Air four times the resolution of previous models. The leap from the 900p resolution of older MacBook Airs to the Retina resolution really is impressive, and it’s likely the first thing you’ll notice when you power on the new Air. Anyone who felt the lower resolution of previous MacBook Air models was a bit cramped when working will really appreciate the improvement.It actually puts the screen of the MacBook Air on a par with the more expensive MacBook Pro, the 13-inch model of which features the same screen size and resolution. However, unlike the Pro the MacBook Air doesn't include True Tone technology, which is designed to adjust the colors of the screen to make them more accurate depending on the ambient light you’re using the device in. The MacBook Air’s screen doesn’t go quite as bright as the MacBook Pro, either.Apple has also dramatically improved the viewing angles of the screen for this year’s MacBook Air. That was one of the biggest pain points when using old MacBook Airs, to the point where tilting the screen just a little bit away from our faces made the screen pretty much impossible to view. The 2018 MacBook Air fixes that. It was only at the most extreme angles that we saw a lot of reflection from the anti-glare glass that's protecting the LCD screen. There’s also been a boost to color accuracy for the MacBook Air (2018), with a wider color gamut capable of displaying 48% more colors than the previous Air – it means that photos in particular look bright and vibrant on the new MacBook Air’s screen.The new MacBook Air display is arguably the most impressive update, and the higher resolution gives this entry-level MacBook a premium feel, while also making media and photos look better than ever.\nCurrent page:\n\nIntroduction, price and design\n\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}