{"id": "TechRadar proIDrive review", "paragraph": "\n\n \n \n \n \n\n\nBy\nMark Pickavance\n2018-11-16T13:00:03ZStorage \nIDrive secures servers, desktop system and mobile devices with equal aplomb, and provides a centrally accessible web interface to manage all that captured data. Two-factor authentication is missing, but critically private key encryption isn’t.Even before Dropbox started, IDrive existed. Originally called IBackup, this business launched way back in 1995 from the beautiful San Fernando Valley in California.That’s not to say that the current version is anything like the software and service floated 23 years ago, it has undergone some major changes to keep pace with the demands of its customers.With so many of the older Cloud storage solutions dragging around architectural choices made years before, has IDrive evolved enough to remain relevant? Whereas other SaaS products promote the idea of an online drive, IDrive is more focused as a disaster recovery solution built to secure computers and mobile devices.To this end, the platform coverage is especially impressive, with Windows PC, Apple Mac OS and Linux systems all supported on the desktop plus mobile apps for Google Android and Apple iOS. What’s especially nice about the mobile implementations is that they don’t just snag pictures and music files, but can also secure application data, call logs and other underlying data in addition to the media capture.Therefore a phone or tablet can be restored using IDrive in a way that many other Cloud storage tools don’t support or even attempt.Equally, the desktop solutions go that extra mile in offering drive imaging, enabling a bare metal restore to recover from a hardware failure or theft. That’s a major difference between IDrive and most other Cloud storage solutions.However, this isn’t the only aspect that edges IDrive towards indispensable, it also provides the alternative Cloud storage approach, so that you can use it to store files and folders, sync and also share contents with others.Having a foot in both camps of Cloud storage is most unusual, with most products deciding to do one or the other, but not both.The only caveat to these wonderful facilities is that the service IDrive offers is size capped, and therefore that could easily become the limiting factor in how much use and protection that it offers to your computing hardware.Solutions that offer simply to secure those folders that contain data work better in a scenario where there are storage quotas, where ones that can image the drive could easily exceed their quota before they’ve completed their task.Traditionally, web-based interfaces are updated more often than executable client apps, and as therefore they don’t often share much visual styling.But IDrive ignores that and has a web interface that is almost identical to the client app, and contains 80% of the functionality.Once the system is up and running, the scheduler can be configured, files backed up or restored, and software updates initiated from both the web and app interfaces.The only significant differences are that the client app has a section for Server Backup, and also you can initiate a backup sync, useful if you don’t use ‘continuous data protection’.Overall, this is a very clean application where things are generally placed where you’d expect them, and making changes is relatively painless.In addition to the client controls, IDrive also has another level where you can manage data captured from mobile devices and share files with other users via email.The only caveat to getting an IDrive shared file or folder, is that you must have an IDrive account to access it. That can be the free to join 5GB account, but it’s a hoop that Google or Microsoft don’t insist you jump through.When you install IDrive one of the first things you are asked is if you want a default encryption key, where IDrive keeps a copy, or a Private key that only you possess.Forgetting the private key will condemn your backups to encryption oblivion, but it also means that a leak or infiltration of IDrive can’t provide access to anyone else, ever.That’s a strong feature, and our only reservation is that they didn’t also cover password guessing with two-factor authentication.On the plus side using the web interface, you can disconnect computers from the system if they’re stolen, stopping the stored contents being accessed using it.IDrive is making some bold offers at the time of writing. You can have 5GB for free, but more serious users might be interested in IDrive Personal, that costs either $52.12 (£39.99) for 2TB or $74.62 (£57.39) 5TB annually. That’s remarkably competitive, and a reduction on previous IDrive pricing by 15%.Those costings are based on a single user, but unlimited computers.Business users pay more, starting at $74.62 (£57.39) per annum for 250GB and ranging up to $22,409.62 (£17,225.0)for a massive 12.5TB facility. A major advantage of IDrive Business is that it covers unlimited users and machines, and also offers a monthly payment scheme for businesses that need is a short-term exercise.Another bonus for business users is that their client apps can secure MS SQL, MS Exchange, MS SharePoint, Oracle and Office 365 Mailbox servers. A user/group management, single sign-on, and three free backups using IDrive Express per year, compared with one on the Personal subscription.  Personal users get a very attractively costed deal, and the business offering is also not expensive as these things go.We've already mentioned the technical boxes that IDrive successfully ticks and the strong pricing model completes the decision circle.Unless as a person or a business you are heavily pre-invested in a particular service provider, then IDrive should be a serious consideration.Because it’s fast, secure, and relatively easy to configure and use.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}