{"id": "TechRadar proGoogle makes it easier to manage your security ", "paragraph": "\nBy\nAnthony Spadafora\n2018-10-24T15:45:05Z\n\nInternet\n \n\nIn an effort to make it easier to control what data its services have access to, Google will soon allow users to make decisions about their data directly from within its apps.Earlier this year, the company launched a new Google Account experience that put privacy and security front and center. Google also updated its Privacy Policy with videos and clearer language to better describe the information collected on users, why it is collected and how they can control it.Now users will be able to review and delete their recent search activity while having quick access to the most relevant privacy controls in their Google Accounts without ever leaving Search.Before now, users that wished to review or manage the data Google collects would have to do so by visiting their Google Account. This process added an extra step and could be confusing for less tech savvy users. With the latest update though, Google is bringing these controls directly to users to make changing data settings a more natural and intuitive process.The update will also provide quick access to the privacy controls that are most relevant as users search. For example, users will now be able to control the ads they see while searching right from within search thanks to access to Ad Settings.Google's new security and privacy settings will be available on desktop and mobile today with changes to the Google apps for iOS and Android arriving in the coming weeks.Via GoogleTechradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}