{"id": "TechRadar proHuawei to overtake Amazon in tablet sales ", "paragraph": "\nBy\nAnthony Spadafora\n2018-11-12T18:11:23Z\n\nComputing\n \n\nNew research from TrendForce has revealed that global tablet shipments are expected to decline by 4.3 per cent year-over-year in 2018 to 145.5m units as sales of entry-level devices decline due to the rise of smart speakers and higher currency exchange rates. In response to the overall decline of tablet sales worldwide, brands typically tend to offer lower prices to retain customers while investing less in new tablet development. Huawei appears to be doing just the opposite and the Chinese hardware maker is developing both smartphones as well as new tablets. The company's tablet shipments are expected to rise by more than 30 per cent to more than 14m units with a market share of 9.8 per cent.Huawei's increased tablet sales will also enable the company to become the 3rd largest tablet manufacturer this year surpassing Amazon.Amazon's focus has shifted from tablets to its Echo line of smart speakers and after three years of strong growth, the US e-commerce giant is expected to record a more conservative shipment of 13.4m units this year.Meanwhile, Apple has launched its new 11-inch and 12.9-inch iPad Pro models ahead of the holidays. However, TrendForce predicts that sales of these devices will be hurt by the fact that they were released just after the company starting selling new iPhones with premium prices.“With the launch of new devices in the coming era of 5G, the tablet category will still help the brands build a strategic future, retaining their customer bases and becoming more influential in the global IoT network,\" TrendForce notebook analyst   Kou-Han Tseng said. \"Therefore, major brands will not give up their tablet product lines, even at the expense of downsizing their entry-level product ranges. Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}