{"id": "TechRadarSteam VR's latest trick boosts quality for lower-power Windows 10 PCs", "paragraph": "\nBy\nNick Pino\n2018-10-19T18:33:04Z\n\nGaming\n \n\nIf you haven’t been able to check out the HTC Vive because your PC isn’t up to the challenge, Steam VR is rolling out a new feature called Motion Smoothing that should solve your problem.The feature, which is rolling out to Steam VR beta on Windows 10 PCs this week, reduces the amount of rendering needed to create realistic virtual reality: Instead of asking your GPU to render at 90Hz, the software enables your PC to render at half the rate and fills in the gaps with synthetic frames that are interspersed between rendered images.If this sound familiar to you, you might know the term from the TV world where motion interpolation is incredibly common. The difference between the way TVs render motion and how Steam VR’s Motion Smoothing works is that the latter only turns on when Steam notices a drop in frames - rather than processing every frame. The hitch here is that motion smoothing will only work on Windows 10 PCs (sorry Linux users!) and only with the HTC Vive and HTC Vive Pro - not any of the other Windows 10 VR headsets.Oculus has its own tricks to limit processing (namely a trick called foveated rendering where the headset only renders detail in the places you’re looking) and has developed similar technology to motion smoothing in the past.  Both techniques are necessary to reduce the power necessary to run the headsets smoothly - as anything below 60Hz can cause nausea in players.For VR to succeed we need both bigger and better libraries of games as well as the ability to run VR headsets on nearly any system out there. These are huge tasks, obviously, but one that Steam VR and HTC have taken seriously with this latest announcement.Source: SteamGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}