{"id": "TechRadar proWhy your small business team needs a VPN", "paragraph": "\nBy\nJonas DeMuro\n2018-10-20T09:30:56Z\n\nVPN\n \n\nNCSAM was launched by the National Cyber Security Alliance & the U.S. Department of Homeland Security in October 2004 to make sure that our online lives - at work and at home - are kept safe and secure. That's what National Cybersecurity Awareness Month (NCSAM) – observed in October – is all about!While larger businesses grab the financial headlines, the vast majority of the 5.6 million employer firms in the US are small businesses. In fact, most are quite small with 89% of these businesses having less than 20 employees, and 99.7% of these businesses having less than 500 employees in 2016, according to the Small Business and Entrepreneurship Council.  The good news is that small businesses account for over 60% of the jobs created in the US economy since 1993, which is impressive. The flipside is that small businesses tend to be higher risk, with only half the firms making it beyond five years, and only a third making it to 10 years.Given those stats, small businesses should take necessary precautions to mitigate risk where they can, and to foster their business interests. A VPN is a virtual private network, that allows users to use the internet in a much more private fashion, via an encrypted tunnel.Let’s take a look at how a VPN can enhance your business’ activity.Business often requires travel for employees to meet with clients and suppliers. Even in this day and age of mass emails, and virtual video chats, there is often value in a face to face meeting, and a firm handshake to conduct business and get the deal done.Most companies have resources that their employees need to conduct business, such as documents on a shared hard drive, or online applications hosted on a company server. A private VPN is a way for the employees, when they are away from the office, to access those resources securely.While an employee is overseas, they will need to maintain their connection back to their home country. A VPN is an excellent way to do this, as it allows them to be able to use the services from their country of origin. This can make doing a simple task such as purchasing airline tickets much easier. Also, the same applies for accessing an online bank account that will not be accessible from another country of origin.For example, if they need to purchase goods for the company, they can research, and make these purchase decisions by looking for, and shopping through the VPN encrypted tunnel. Otherwise, they will be shopping at the local sites in the country they are physically in, and will see the products available in that country, with in-country pricing, in the local currency.In addition, shipping charges will be from the country they are in, and not for a domestic purchase. By using the VPN, and choosing the country that they want the encrypted tunnel to emerge in, the employee can control which country’s websites they will be displayed.In addition, for some countries, a VPN is a necessity, as otherwise it becomes pretty much impossible to even communicate, or do much of anything. The best known example of this is China, and their so-called ‘Great Firewall,’ which a VPN is needed for even routine access of mainstream sites, such as the BBC.When traveling away from home, staying connected is essential for business travelers, with the popular activity of keeping up with email. An easy way to do this is to find the local coffee shop, hotel lobby, or public library, and hook into their wireless signal, as they both commonly offer high speed internet, and abundant electrical outlets.However, using public Wi-Fi is a serious security hazard, as the data transmitted is completely unencrypted. This makes it a relatively easy task to intercept the data via packet sniffing. And this is not a theoretical hack, but quite real with the Darkhotel hacker group known for hacking top executive travelers that stay at luxury hotels, and use the hotel’s Wi-Fi.While the best defense is to never use public Wi-Fi, that is really impractical in today’s world. The more practical solution is to use the public Wi-Fi via a VPN. With a modern VPN protocol, such as OpenVPN, the wireless connection can be used- safely, as it gets encrypted via 256-bit encryption that meets governmental Top Secret protocols.Another use case for a VPN is for times when a business needs to use the internet from within a specific country. For example, if you want to see what services are available in another country, from within the country itself. Rather than travel to that country to access the internet, it is far easier to use a VPN to experience the internet in that country, without leaving your location.Heck, you could easily VPN into dozens of countries in one day with this method, a feat impossible via traditional travel methods. This way you can easily check out international competitors, from their domestic sites, and not their international website.This type of “travel” is known as ‘VPN location spoofing,’ or alternatively as ‘Faking your geo-location.’ This is a core function to a VPN, but be sure to pick a robust VPN that has support for multiple countries that your small business has interest in conducting commerce with.The cyber attack statistics are concerning, with 43% of attacks focused on small businesses, and 60% of businesses going “out of business within six months of a cyber attack,” according to People Driven Solutions. Unfortunately, also, most small businesses, as they lack dedicated IT staff are wholly unprepared, and only think about the threat of cyber attacks until after it has occurred.A VPN, with its highly encrypted tunnel that exits at a remote location is a great defense from cyber attacks, with protection for company assets, which is stronger than a traditional firewall, and therefore more secure from a data breach.For situations where a hacker intercepts the data coming from the small business, a VPN ensures that the packets are totally encrypted to top level government security standards, and will be completely unreadable to hackers.Also note that to celebrate National Cyber Security Awareness Month, IPVanish is giving a 69% discount on two year plans throughout October 2018, making its top-tier protection effectively $3.74/month.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}