{"id": "TechRadarRazer Phone 2 review", "paragraph": "\n\n \n \n \n\n\nBy\nBasil Kronfli\n2018-11-02T16:47:26ZMobile phones \nIf you’re an RGB-loving gamer who lives an overclocked life at 120Hz, then there’s a good chance the Razer Phone 2 will push your buttons. Given that our reviews aren’t just for gamers, though, luxuries like a 120Hz display and illuminating back aren’t enough to bump up its score beyond a 3.5. The 16:9 aspect ratio screen feels dated, it’s a bit washed out when viewed at an angle, and the camera is only passable by today’s standards. And, unlike its predecessor, it doesn’t undercut the competition in terms of price, making it a tough sell at full price for all but the most diehard mobile gamers and Razer fans.To look at the new phone from Razer, especially from the front, you wouldn’t really know this was the Razer Phone 2, it’s so similar to last year’s model – Razer is clearly channelling its inner Apple or Samsung, with bold confidence in the original’s design.Heck, even Apple has introduced a new color option in this year’s iPhone XS range – with the Razer Phone 2, you get black with a mirror finish or black with a matte finish. Flip the phone around and the back starts to reflect some key differences between it and its predecessor. Specifically, a sheet of flat glass as opposed to last year’s all-metal body.Glance over the spec sheet and you’ll also notice the internals have been boosted in the Razer Phone 2, with a Snapdragon 845 chipset inside, and the addition of wireless charging and IP67 dust and water resistance.Razer has also taken on board feedback from fans and critics, illuminating the logo on the back of the phone with a full spectrum of RGB colors. The max screen brightness has also been leveled up to a much more respectable 645 nits, in contrast to the paltry 300 nits of the original Razer Phone.As for the features making a return, you have 8GB RAM, 64GB of storage with microSD expansion, dual rear cameras, killer stereo speakers, a 4,000mAh battery and a 120Hz IGZO display.So this thing will be excellent for gaming, that’s a given – for power, sound, screen and ergonomics, this phone nails it. The real point of this review is to ask: will this phone be good for the ‘life’ stuff too?The Razer Phone 2 price is set at $799 (£779, around AU$1,200), which is $100 (£80, around AU$100) more expensive than its predecessor at launch. It's not a huge surprise that the price has been increased – it's common practice across the mobile industry – but with this device the price hike feels less warranted than in other cases, given how similar the new phone looks to its predecessor. Clearly, wireless charging, IP ratings and Chroma RGB goodness don’t come cheap.As for the Razer Phone 2 release date, you can pick up the Mirror Black version now. The Stain Black version will be available later in the year, with availability in the US, Europe and Asia-Pacific also expected.According to Razer, the Razer Phone 2’s raison d’etre is to be the best gaming phone around, and an excellent all-round smartphone too. This explains a number of decisions made here, specifically when it comes to the phone’s design.The phone is boxy, angular and bold, just like the first Razer Phone. The flat sides make it comfortable to hold when gaming in landscape orientation, while the front-firing stereo speakers are all but impossible to cover up – so when you’re first-person-shooting or dungeon-sword-swinging, every bang and clang will be directed squarely at you.It may be bold, but the Razer Phone 2 is also simple from a design point of view – it’s a cuboid. Looks-wise, this makes it more accessible than the overtly gamer-centric Asus ROG phone, which by contrast looks like a Transformer velociraptor. Meanwhile, the screen’s 120Hz refresh rate is silky, enhancing the experience of simple swipes through menus or twitter feeds, as well as enhancing optimized and unoptimized gameplay alike. HDR support also means video content can look rich, with services including Amazon Prime Video, Netflix and YouTube offering HDR content.The power button on the right side of the phone doubles as the fingerprint scanner, while the bottom of the phone houses the USB-C port, with the volume buttons on the left side. There’s plenty of power under the hood, with the same Snapdragon 845 as found in the Samsung Galaxy Note 9 and Google Pixel 3 XL; in the Razer Phone 2, though, it’s paired with 8GB RAM for even more oomph.4,000mAh of battery power is, on paper, exceptional, matching the Huawei P20 Pro and falling just short of the current battery king, the Mate 20 Pro, but not all the numbers are class-leading. Looking at storage, 64GB is a bit paltry for a flagship phone intended for gaming, with lower-cost devices like the regular Mate 20 and the OnePlus 6T both packing 128GB storage options at lower price points.As we've mentioned, from the front the Razer Phone 2 looks virtually identical to its predecessor, with sizable bezels housing the powerful speakers above and below the display, squared-off edges and a side-mounted power/lock key.The power key also houses the fingerprint scanner, which works quickly and accurately.Flip the Razer Phone 2 over though and things are more noticeably different. Razer has given the rear of its new phone a Gorilla Glass 5 makeover, and moved the camera bump to a central position at the top of the device. The bump is much more pronounced than on devices like the Pixel 3, Note 9 and iPhone XS Max, so if you want to make the whole back flush with it you’ll need a case.The rest of the back is sleek and elegant, a sheet of glass with a light-up Razer logo, employing the brand’s own trademark of RGB – Chroma.The Chroma app on the phone allows you to customize the logoits color from a choice of 16.8 million hues, and you can also choose from three different states: breathing (shifts brightness up and down), static (keeps light on at one brightness) and cycle (a party mode which cycles through all colors).The RBG lighting impacts battery performance, but as we’ll come to, even with it turned on the Razer Phone 2 lasted as long as we needed it to on all but the most intensive of gaming and benchmarking days. Naturally, if you want to save as much power as possible you can switch it off completely.This takes the grand total of phones loaded up with RGB lighting to… two, with the Razer Phone 2 in good company alongside the Asus ROG phone.In the hand the edges of the Razer Phone 2 are subtly more rounded that those of its predecessor, making it more comfortable to hold, and the aluminum frame provides a good deal of rigidity to the handset. It’s also nice and durable, with Jerry Rig Everything giving it the thumbs up when it comes to taking a beating, or a bending.The Razer Phone 2 measures 158.5 x 78.99 x 8.5mm, which makes it ever so slightly bigger than the original – but the difference really is minimal, and you can still use it with one hand. Many will lament the fact that there's no headphone jack, with a USB-C connection being the only port on the handset, but the Razer Phone 2 does come with a 3.5mm-to-USB-C adapter in the box – and it features a 24-bit DAC for enhanced audio quality, which is a nice bonus. Comparing this adapter to the one that ships with the Google Pixel 3, Razer’s is indeed superior, with noticeably richer audio reproduction.This welcome touch nicely complements the dual front-firing stereo speakers, which boast Dolby Atmos and Dolby Digital 5.1 support.So sure, for gaming, everything checks out – cuboid with banging speakers and RGB lights. It’s bold though, and blocky, so if you’re not a gamer there’s a good chance the Razer Phone 2 might leave you cold before you’ve even looked inside.The original Razer Phone was meant to be all about that display, with its 120Hz refresh rate and QHD resolution. Despite glimmers of brilliance, however, the IGZO panel made by Sharp ended up being a pain-point in some respects, with low max brightness and duller colors than most competing flagship phones.The Razer Phone 2 uses the same 5.7-inch QHD 120Hz UltraMotion display as its predecessor on paper, but this time around Razer has enhanced the max brightness by 50%. Brightness now peaks at 645 nits, which will be a blessing to anyone intent on using the phone in direct sunlight.The phone’s 120Hz refresh rate provides latency-free gameplay, extremely smooth scrolling, and an 8ms response rate. It does draws more power, but you can choose from three presets: 120Hz, or 60Hz or 90Hz if you want to save a little juice.Razer in name and razor by nature, this phone’s screen is sharp, with the 1440 x 2560 resolution delivering 515 pixels per inch. Like the screen refresh rate, the output resolution can also be tuned in the settings, with two options: Full HD or the native resolution of Wide Quad HD.There are aspects of the screen we’re not sold on though – sticking with a 16:9 aspect ratio for example. Now, this aspect ratio definitely has benefits. It gives you a taller field of view when playing games in landscape, which means that when you’re playing first-person shooters, for example, you won't have to vertically pan the camera to look around as much, saving you precious seconds in the heat of the battle.In spite of this, though, Razer’s decision to go with 16:9 was still, in our opinion, a big mistake. Side by side in a shop, alongside even last year’s Samsung Galaxy S8 Plus, which you can pick up for £370 less, it just looks old.\nCurrent page:\n\nPrice, design and screen\n\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}