{"id": "TechRadarGoogle's new Chromecast third-gen can stream full HD at 60fps", "paragraph": "\nBy\nSudhanshu Singh\n2018-10-24T15:06:42Z\n\nHome Cinema audio\n \n\nGoogle has launched the Chromecast 3 officially in India. The new casting device from Google is a successor to the Chromecast 2, and as the name suggests it is the third generation of the casting device from the company.The Chromecast 3 is priced at Rs 3,499 in India and will be available in Charcoal color variant. It will be available exclusively on Flipkart as of now, and we’re expecting it to be listed on other online websites along with Google Store in near future. Early buyers will get a free one year subscription to Sony Liv and six months ad free subscription of music streaming app Gaana. Flipkart is also offering a Rs 100 cashback if you buy the Chromecast using PhonePe, which brings down the total cost to Rs 3,399. Additionally, during the ongoing Flipkart Festive Dhamaka sale, Axis Bank debit and credit card users can avail 10% instant discount. The Chromecast 3, similar to its predecessors, essentially helps you watch content on a screen via an HDMI by either mirroring smartphone screen or casting the content of a supported app to the TV.The new inclusions are a claimed 15 percent bump in performance, support for 60fps video streaming at full HD (1080p) resolution. It used to be only HD (720p) in the previous models. Another major upgrade includes Google Assistant integration, which allows users to plug the Chromecast third gen to any speaker to simply use your voice to play content on YouTube or a compatible TV.The third-gen Chromecast is supported by both Android and iOS devices and some compatible popular apps include Netflix, YouTube, HBO and Hulu. It has got a new design that goes in line with the latest Google Home products. It looks the same like a hockey pluck, but with a new matte finish, rounded corners and a Google’s iconic “G” logo on top. It measures 162 x 51.8 x 13.8mm and weighs 39.1 grams.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}