{"id": "TechRadar5 things you really should know before you buy an iPhone XR deal", "paragraph": "\nBy\nAdam Marshall\n2018-10-20T08:02:33Z\n\nMobile phones\n \n\nOh 2018, you've been very kind to us mobile phone fans. The Samsung Galaxy S9 kicked things off with a bang back in March, before the Huawei P20 Pro boosted the its Chinese manufacturer into the upper echelons of today's top smartphone makers. The Samsung Note 9 and iPhone XS Max pushed the limits of what a modern mobile can achieve and there were so many Sony Xperia handsets.And now the iPhone XR is here to round off the year of phone releases (yes, Google Pixel 3, we know you're not on the shelves yet - but your pre-orders started last week). And we reckon the year is ending on a high note.\nThat's because the iPhone XR is a lot more affordable than the pricey iPhone XS, but still boasts a number of noteworthy features and lush design. So like its bigger brother, the XR has that virtually bezel-less screen (bye-bye home button, hello notch) and A12 Bionic chip. While the Liquid Retina screen looks extraordinary and the camera is vastly improved over the iPhone 8 as well.The Big Deal isn't trying to play the salesperson here. In fact, we reckon we may well be preaching to the converted. So assuming that you're looking to buy an iPhone XR but want to ensure that you've done your full due diligence first, then these next five pointers are exactly what you need to buy buy buy with confidence.We're in a pretty privileged place here at TechRadar Towers, as we've built contacts all over the UK with retailers and networks. They're actually a lot more interesting than you might imagine! It means that when we build a buying guide like our best iPhone XR deals we believe...nay, we KNOW that we're recommending only the finest offers around.Still not happy? Fine, we'll make things even easier for you. At the bottom of this very page is our iPhone XR price comparison, with the best call outs at the very top. Or we can simply tell you our favourite three here:- iPhone XR on O2 for £75 upfront and £49 per month with 100GB data and unlimited calls and texts from Mobiles.co.uk- iPhone XS on EE for £69 upfront and £48 per month with 50GB data and unlimited calls and texts from Mobile Phones Direct- iPhone XS on Vodafone for £400 upfront and £23 per month with 4GB data and unlimited minutes and texts from Mobiles.co.ukWith all these new mobile phone launches of late, Carphone Warehouse has really learnt what makes buyers tick. And once again it's giving away £40 Currys vouchers with every XR contract deal it sells - but only for TechRadar customers.To get this exclusive Carphone Warehouse promotion, you need to click on the link, fill in your email address and then pick out your favoured XR plan. Again, you won't be eligible to claim this unless you go via the above link. As long as you order your mobile by the end of October, that Currys/PC World voucher will land in your inbox in a few weeks time. A handy little high to go alongside your retail therapy.OK, so £40 vouchers don't do it for you and you reckon you can do better than the deals in our price comparison. Fair enough, we won't take offence (*sniff*). On the contrary, we feel battle-hardened by your valorous determination to squeeze every last penny of value out of your iPhone XR purchase. We doth our metaphorical caps.This is usually the point where we promote the virtues of buying your iPhone XR SIM-free and then combining it with one of the best standalone SIM only deals. But on this occasion, that just doesn't work. Going for a contract can actually work out a cheaper price for you.So what other hacks are there out there? Well did you consider what you might do with your old phone? Sure you can keep hold of it to scroll through photos of that epic hols to Maga 2017 - but that's what the cloud's there for (and trust us, some of those snaps are better off deleted). Retailers like Carphone Warehouse and EE are offering hundreds of pounds back when you send them your old phone.And before you get all excited about finally being able to offload that old, cracked Motorola under your bed, the trade-in value does of course depend on the handset and condition.We've already banged on about the other handsets that 2018 has bestowed - it really has been a bumper batch. And it probably won't surprise you to hear that many of them are priced much lower than the iPhone XR. There's the Samsung Galaxy S9 for starters - one of the best phones ever made and almost £500 cheaper over the two years for some of the data points we've been cooing over for the XR. And then there's Huawei P20 Pro deals, which are really reasonable considering the high quality of the handset.And if you think we're trying to fob you off with non-Apple products, you couldn't be more mistaken (if you don't mind us saying so). We'll happily guide you to the best iPhone 8 deals. In fact, you can save a packet if you go for something like the iPhone 6S - a smartphone we still really admire. Basically, you can check out all the best XR alternatives by heading to our best iPhone deals guide.You just had to make us say it, didn't you. There's over a month to go until, yes...Black Friday is upon us, but it's hard not to suppress it from our thoughts (and, occasionally dreams). We all know that it's the season of bumper sales and discounts, but will the iPhone XR be included?Well if last year is anything to go by, it's a \"yes...but.\" There were iPhone 8 reductions, but they weren't exactly spectacular. More like slithers from the pricing pie, rather than a heaving great slice. So if you're not desperate for your new phone and are happy to play it cool, then waiting for Black Friday could be an option. Prices certainly aren't going to go up, but just don't expect them to plummet completely. Sorry!If you want to discuss, debate or deliberate any phone deals news and views with The Big Deal, then head over to our @TRDeals twitter feed – you'll also find the latest offers on phones, TVs, consoles, broadband and more tech.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}