{"id": "TechRadarAmazon’s first official early Black Friday deals are here", "paragraph": "\nBy\nMackenzie Frazier\n2018-11-16T13:36:07Z\n\nBlack Friday\n \n\nStarting today through Black Friday, Amazon will be releasing thousands of new deals across every department.  Amazon's \"Seven Days of Black Friday Deals\" will include huge savings on electronics, kitchen appliances, toys and more.\nIf you've been waiting for discounts to drop on Amazon devices, then you're in luck. Starting today, you can save over $100 on device bundles, tablets, smart speakers and security cameras.\nOne deal that is sure to be popular this Black Friday is the Fire HD 10 Tablet. Amazon has listed the popular Fire Tablet for just $99.99. That's $50 off the original price and the lowest price we've seen on this device.Fire HD 10 Tablet with Alexa Hands-Free $149.99 $99.99 at AmazonThis top-rated tablet features a 1080p Full HD display and is 33% off starting today at Amazon.View DealWe'll be updating new deals daily to make sure you don't miss out on any savings, but make sure to take advantage of all these stellar sales today.\nEcho Dot 3-pack $149.97 $69.97 at AmazonBuy more, save more! Starting today save $80 when you buy three Echo Dot (3rd gen), smart speakers. That makes each speaker $23 each. View DealEcho Dot Kids Edition 3-pack $210 $99.97 at AmazonThis smart speaker that was designed with kids in mind is on sale for $99.97 if you purchase a bundle of three. That comes out to $33 per device which is half of what they normally cost.View DealFire 7 Kids Edition Tablet $99.99 $69.99 at AmazonThe 7-inch Fire Kids Edition Tablet is $30 off. That's the lowest price we've seen on this popular kids tablet.View DealAll-New Fire HD 8 Kids Edition Tablet $129.99 $89.99 at AmazonThis kid-friendly 8-inch display tablet is on sale for $89.99. That's $40 off and only the second time we've seen this tablet at this low price.View DealBlink Indoor Home Security Camera System $99.99 $66.99 at AmazonAmazon has the top-rated Blink Home Security Camera System for $66.99. That's 33% off and the lowest price it's been all year.View DealEcho Spot 2-pack $259.98 $159.98 at AmazonSave $100 on a pair of Echo Spots today on Amazon.  Usually, an Echo Spot will set you back $129.99, so this is a great deal if you planned on buying more than one. View DealEcho Show 2-Pack $459.98 $339.98 at AmazonStarting today, you'll be able to save $120 on a pair of 2nd-gen Echo Show smart speakers. This Black Friday discount drops the price to $133 per speaker.View DealFire HD 10 tablet and Show Mode Dock $204.98 $144.99The Show Mode Dock that's included in this Black Friday bundle will transform your tablet to a full-screen Alexa enabled smart display. The tablet and Show Mode Dock are on sale for $144.99. That's $59 off the original price.View DealGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}