{"id": "TechRadarApple tipped to launch a 5G iPhone in 2020", "paragraph": "\nBy\nDavid Nield\n2018-11-03T10:30:41Z\n\nMobile phones\n \n\nInfrastructure for next-generation 5G phone networks is only in the very early stages of being established, but that isn't going to stop phone makers building 5G capabilities into their handsets (and making a lot of noise about it) as soon as they possibly can. According to a new report, Apple is going to join the party in 2020.Insider sources speaking to Fast Company say the Intel 8161 5G modem chip will be the one to supply this 5G connectivity, though apparently Intel is battling with heat issues as it looks to get the chip prototyped and developed for commercial use.It would appear Apple is ready to let other companies get to market first with their 5G phones before following up with its own implementation the year after next. The likes of Oppo, LG, Samsung, Huawei, Lenovo, and Sony have all confirmed or at least intimated that 5G handsets are on the slate for some point during 2019.Depending on where in the world you live, you might only have just got used to seeing the 4G or LTE symbol on your phone on a regular basis. The roll out of 5G in terms of actual networks is likely to lag behind the arrival of 5G-capable phones – as with 4G, it'll first appear in pockets, likely in major cities, before extending everywhere else.And the improvements aren't just in raw speed, they're in bandwidth too. That means more devices getting connected (think self-driving cars) and better reception when you're in a crowded area (like watching a game at your local sports stadium).Download speeds have the potential to be up to a thousand times faster than 4G – 10Gbps rather than 100Mbps – though that's a theoretical maximum (so the reality will be somewhat different). By the time Apple's rumored 5G iPhone arrives in 2020, you might even be able to latch on to a 5G network somewhere close to where you live.Via AppleInsiderGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}