{"id": "TechRadarMac mini 2018 vs Mac mini 2014", "paragraph": "\nBy\nMatt Hanson\n2018-10-30T16:30:31Z\n\nComputing\n \n\nApple has announced the new Mac mini 2018. A new version of the Mac mini has been conspicuous by its absence for a good few years now, and many people were concerned that we might never see an update to Apple's small form factor computer.There was a glimmer of hope a year ago when Apple CEO Tim Cook reassured fans that Apple would still support the Mac Mini, and rumors had been mounting that we might see a Mac mini in 2018.And sure enough, Apple has revealed the Mac mini 2018. So how does it compare to the previous version, which was released way back in 2014?So, should you buy a Mac mini 2018? Read on to find out.The Mac mini 2014 kept the same compact design of the Mac minis that came before it, with a small, square-ish metal design that measures 7.7 x 7.7 x 1.4 inches (19.7 x 19.7 x 3.6cm) and weighs 2.6 pounds (1.19kg).It looks like the Mac mini 2018 is pretty similar design-wise – we'll find out more when we have hands-on time with it, but the new Mac mini comes in a new space gray finish, while the body uses an Apple-designed aluminum alloy made from 100% recycled aluminum, the same as other premium Apple products. Apple claims that \"together these advancements help to reduce the carbon footprint of the new Mac mini by nearly 50%\".Ports-wise the Mac mini 2018 comes with four Thunderbolt 3 ports, an HDMI 2.0 port, two USB-A ports, audio jack and Gigabit Ethernet, along with a 10Gb Ethernet option.Meanwhile, the Mac mini 2014 comes with two Thunderbolt 2 ports (up to 20 Gbps), four USB 3.0 ports (up to 5 Gbps), a HDMI port, SDXC card slot, Gigabit Ethernet port, audio in port, 3.5mm headphone jack and IR receiver for remote controls.Apple says the Mac mini 2018 is the biggest update ever for the Mac mini, and it certainly looks like that's the case. It comes with quad- and 6-core 8th-generation Intel Core processors with Turbo Boost Speeds up to 4.6GHz and Intel UHD graphics. This, Apple tells us, results in up to five times faster performance over the Mac mini 2014.The Mac mini 2018 also supports up to 64GB of 2666 MHz memory, four times the RAM of the Mac mini 2014.Meanwhile, the Mac mini 2014 has had a number of hardware refreshes, and the most recent came with three hardware configurations. The base model features a 1.4GHz dual-core Intel Core i5 (Turbo Boost to 2.7GHz), 4GB of 1600Mhz LPDDR3 RAM. Graphics are handled by Intel HD Graphics 5000.The Mac mini 2014 also comes with a 500GB HDD that runs at 5400 RPM (revolutions per minute). That's quite a slow hard drive, these days – solid state drives (SSDs) are much faster and increasingly prevalent in machines, especially small form factor devices where the heat and sound of SSDs is practically nothing compared to standard hard drives.The Mac mini 2018 ditches standard hard drives for SSDs, offering up to 2TB of super-fast storage space, which will make opening and editing large files and complex apps faster than ever.The mid-range Mac mini 2014 comes with a 2.6GHz dual-core Intel Core i5 (Turbo Boost up to 3.1GHz) with 3MB on-chip shared L3 cache, and 8GB of LPDDR3 RAM. You can configure this Mac mini to have a 3.0GHz Intel Core i7 (3.5GHz boost) and 16GB of RAM.Storage-wise, this Mac mini comes with 1TB 5400 RPM hard drive that can be upgraded to a 1TB Fusion Drive or 256GB SSD. The graphics are provided by integrated Intel Iris Graphics.Finally, there's a high-end Mac mini 2014 which came with a  2.8GHz dual-core Intel Core i5 (Turbo Boost up to 3.3GHz) with 3MB on-chip shared L3 cache , which again could be upgraded to an Intel Core i7 processor, 8GB of RAM (up to 16GB), 1TB Fusion Drive (which can be swapped for a 2TB Fusion Drive or a 256GB, 512GB or 1TB SSD and Intel Iris Graphics.The base model for the Mac mini 2018 comes with 8GB RAM, 3.6Ghz quad core Intel Core i3 processor and a 128GB SSD.Meanwhile, the high-end Mac mini 2018 comes with a 3.0 GHz 6-core i5 processor, that turbo boosts up to 4.1GHz, 8GB of DDR4 RAM and a 256GB SSD storage.You can also configure the Mac mini 2018 to better suit your needs, adding in a 3.2GHz 6-core i7 processor (boosts up to 4.6GHz), 16GB, 32GB or 64GB RAM and up to 2TB SSD storage.We don't have any more details just yet about mid-range and high-end Mac mini 2018 configurations, but all Mac mini 2018s will come with the Apple T2 security chip, which comes with an SSD controller with on-the-fly data encryption for \"industry-leading security\".The T2 chip also features HEVC video transcoding that's up to 30 times faster, which will be great news for video editors who are interested in using a Mac mini 2018 for their creative work.The price of the entry-level Mac mini 2018 is $799 / £799 / AU$1,249For the higher-end Mac mini 2018, the cost is $1,099 / £1,099 / AU$1,699. If you change any of the components, the price will also change, which gives you some flexibility when it comes to balancing power with budget.Meanwhile, the entry-level Mac mini 2014 sells for $499 / £479 / AU$749. The Mid-range model costs $699 / £679 / AU$1,049 and the high-end Mac mini 2014 costs $999 / $949 / $1,499.With the Mac mini 2018 hitting stores on November 7, we may see the price of the Mac mini 2014 dropping, which will be good news if you fancy a smaller Mac and don't mind older hardware.As we mentioned earlier, the Mac mini 2018 is the biggest upgrade Apple has made to the Mac mini compared to the previous generation. This is an update that was a long time coming, but it seems the wait was worth it.The Mac mini 2018 is packed with modern hardware that makes it a brilliant mini computer, so if you've been tempted to pick up the tiny Mac, the Mac mini 2018 is definitely worth the money.The new hardware actually makes it a more powerful device than some of Apple's other, aging, devices, like the iMac.And, if you've already got a Mac mini 2014, then the Mac mini 2018 update is still worth considering, as it offers a huge upgrade over the older model, with up to four times the performance.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}