{"id": "TechRadarIntel Basin Falls Refresh release date, price and features", "paragraph": "\nBy\nBill Thomas\n2018-10-24T20:25:12Z\n\nProcessors\n \n\nThe wait for the next iteration of Intel’s HEDT lineup is nearly over, and it’s been quite a ride. There was speculation everywhere that there would be a Coffee Lake-X, a Cascade Lake-X or a new Skylake-X HEDT platform. The latter proved to be the one that actually existed, this ‘Basin Falls Refresh’ will be hitting the streets in November 2018, helmed by the new 18-core Intel Core i9-9980XE.In many ways, this Basin Falls Refresh lineup mirrors the initial Skylake-X lineup, with the same amount of cores, but higher clock speeds and some enhanced features. And, in many ways, these new HEDT processors follow in the footsteps of Coffee Lake Refresh, another CPU lineup announced at the same October event as Basin Falls Refresh – that bumped up the clock speeds and improved connectivity features.However, perhaps the most important question in regards to this new Basin Falls Refresh, especially in this heightened age of Intel vs AMD – is whether or not these new chips provide a better value than the AMD Ryzen Threadripper 2nd Generation chips. That’s something we honestly just don’t know yet without reviewing the CPUs ourselves, but you can bet that we’ll update this page as soon as we get some concrete performance numbers from our own testing.The AMD Ryzen Threadripper 2nd Generation platform launched back in August 2018, and ever since then, we’ve been waiting with bated breath for Intel to launch something to compete with it. Now we finally know the first Basin Falls Refresh HEDT processors will be on the market in November, with the rest likely filtering out over the following months. We’re not sure exactly when in November these chips will be shipping, and there aren’t any retail listings or preorders at the time of this writing, but we’ll update this article as soon as we spot something.We were initially hoping that Intel would price this new HEDT platform more competitively – especially considering how AMD is gaining popularity right now. Unfortunately, that didn’t seem to happen, with Intel instead pricing its Basin Falls Refresh pretty much exactly how it priced its 7th-generation Skylake-X processors. The prices for all the new X299 chips are as follows, from lowest to highest price.It’s pretty clear that these processors, like their predecessors, are extremely expensive, and are probably not a great value for most everyday desktop users. However, with some of these chips being nearly double the price of their Threadripper equivalents (at least in terms of core counts), it remains to be seen whether or not they will be competitive among content creators and enthusiasts. Only time and benchmarks will tell.It goes without saying that these new Basin Falls Refresh processors bring some major improvements to Intel’s HEDT lineup. The biggest improvement here is the support of up to 68 PCI-E lanes (still only 44 natively on the CPU, though, the chipset supports the remaining 24). These new processors also feature much higher clock speeds, which should help in single threaded applications like gaming. The Specifications of the Basin Falls Refresh is as follows:It should be immediately noticeable that as the core count goes up, the base clock speeds go down, this is largely due to increasing power and heat constraints as the core denisty goes up throughout the processor family  Still, the boost clocks are pretty stable throughout. Unfortunately, cache on these new Basin Falls Refresh processors is identical to the last generation, with 24.75MB on the Core i9-9980XE, which is the same amount found on the 7980XE.Now, we don’t actually have any solid performance information about the Basin Falls Refresh lineup. However, we have speculation, manufacturer-provided performance metrics (take these with a grain of salt) and numbers for Skylake-X.The improved clock speeds on these Basin Fall Refresh processors should lead to improved performance across the board, but in heavily threaded workloads, it remains to be seen if a frequency increases will allow the Intel Core i9-9980XE to speed past the Ryzen Threadripper 2990WX and, say, the.Now, Intel claims that this new lineup is going to lead to up to 108% faster performance over the 2990WX in Adobe Premiere. You might want to take this with a grain of salt, because while we haven’t measured Adobe Premiere performance ourselves, we do have Cinebench numbers for both the Intel Core i9-7980XE and the 2990WX. The Threadripper 2990WX scored 4,913 in Cinebench, whereas the Intel Core i9-7980XE scored 3,271. Now, obviously Cinebench and Adobe Premiere aren’t the same program, but the tasks are comparable enough to make Intel’s claims seem fishy – but we’ll have to wait until we get our hands on the Intel Core i9-9980XE to make our final judgment. However, until then, there’s not much more to say about the performance of the Intel Basin Falls Refresh Lineup. It’s obvious that it will be faster than Skylake-X, but the question is “how much faster.” So, keep this page bookmarked, as we’ll keep it updated with all the latest information as it comes out.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}