{"id": "TechRadarAudio-Technica releases ATH-M50xBT wireless studio-grade headphones", "paragraph": "\nBy\nOlivia Tambini\n2018-10-30T15:00:04Z\n\nAudio\n \n\nAudio-Technica has a long history of creating professional quality headphones, with its M50 series used in recording studios the world over, reportedly favored by the likes of Stormzy and Royal Blood.Now the Japanese audio brand has cut the cord, making its famous headphones wireless with the ATH-M50xBT, which connect to your devices via Bluetooth. They are available to buy now for $199 (£179 / AU$379). Harnessing the sonic power of the original M50s, the new headphones should be great for listening on the move, with touch controls to activate your smartphone’s voice activated assistant - whether you use Siri or Google Assistant. The M50xBTs have been designed with portability in mind, with a collapsible design and 90 degree swivelling cups, which Audio-Technica says provides a high level of sound isolation, so listening in noisy environments like trains or planes should be easy.Audio-Technica claim the new headphones have an impressive 40 hour battery life, even during continuous playback - this means you should be able to get enough juice for around an entire week’s worth of commuting from a single charge.If you prefer a wired connection or you’re running low on battery, the headphones come with a 1.2 meter cable that has an inline mic and controls. Whether the M50xBTs can truly provide the same level of audio quality as their wired counterparts remains to be seen, but with large aperture 45mm drivers and support for Bluetooth aptX, it should give you a high level of audio quality provided your source is good too.You will also be able to manage the audio via the free Audio-Technica Connect app, which is compatible with iOS and Android phones. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}