{"id": "TechRadariPad Pro 2018 vs iPad Pro 2017", "paragraph": "\nBy\nDavid Lumb\n2018-10-30T20:50:26Z\n\nTablets\n \n\nAs rumors predicted, the new lineup of products Apple revealed at its late October event included a newly redesigned iPad Pro 2018. But how does the refreshed tablet stack up compared to last year’s model?Here’s a quick-and-dirty comparison in case you’re debating whether to rush out and buy the new model or if the older, cheaper one will meet your needs. Spoiler: you might miss out on some cool new features that'll improve your quality of life.iPad Pro 2017 design and colorsThe new iPad Pro 2018 comes in 11-inch and 12.9-inch screen models, but don’t mistake that for the same dimensions. Thanks to vastly reduced bezels, these tablets are actually smaller than last year’s versions overall, with 5.9mm thickness (down from 6.1mm) and other reductions amounting to 25% less volume. But the most obvious redesign is the frame. Gone is the rounded metallic back, replaced with flat-sided metal that looks very much like the iPhone 4’s squared-off appearance. (This is important for another new feature that we’ll touch on later.) iPad Pro 2018 comes in silver and space gray. Last year’s model comes in those colors along with gold and rose gold, naturally. The 11-inch iPad Pro 2018 model has a 2388 x 1668 display while the 12.9-inch one has a 2732 x 2048 screen, both at 264 pixels-per-inch density. This is the same as last year’s model, so don’t expect much disparity there.The iPad Pro 2018 has what Apple calls a ‘liquid retina display,’ which is a fancy way of saying “very nice LCD screen.” We first saw this in the iPhone XR, and while it’s not as crisp as an OLED display, it should be fine. Aside from reduced bezels, there’s something else missing from the iPad Pro 2018 screen: the old model’s Home button, which also contained its fingerprint sensor. With that gone, the new tablet relies on facial recognition via Face ID to unlock the device. If you relied on the fingerprint sensor to verify your identity within apps, it’s worth checking out whether they also work with Face ID. If not, you might need to stick with the older iPad Pro.But getting rid of the Home button is a bigger deal than you might realize. Without it, navigation around the iPad Pro 2018 is done entirely through gestures, including some new ones imported from the buttonless iPhones. If that’s too odd or cumbersome, stick with the old iPad Pro.The iPad Pro 2018 retains its predecessor’s 12MP f/1.8 rear camera, which can shoot 4K video at 60fps or slow-mo in 720p at 240fps.Nestled in the top of the display (or side, or bottom, depending on if you’ve rotated it: the new iPad Pro now rotates freely to orient right-side up at all times) is the front-facing camera, which is still 7MP at f/2.2. But now the Pro has the TrueDepth suite of sensors featured in the iPhone X and XS lines.That means, you guessed it, Portrait mode (and Animoji, and Memoji) is go for takeoff. Which is an incredible feature if you’re brave enough to take fancy selfies with a tablet. You’re forgiven if this selling point doesn’t enter your purchasing calculus, but any technological progress is good progress, we suppose. Otherwise, the software got a couple tweaks, including some interesting AR capabilities through the new Neural Engine included in the iPad Pro 2018 processor.The iPad Pro 2018 is powered by the new octa-core A12X Bionic chip (split between four performance and four efficiency cores) with a Neural Engine. Apple claims it delivers 2x faster graphics than its predecessor, and on stage, a digital artist breezed through manipulating an enormous 3GB (over 15,000 x 15,0000-pixel) photo without a hint of processing lag.Like the A12 Bionic chip appearing in the iPhone XS, XS Max and XR that it’s based on, the A12X is a 7nm chip. It looks to be the first chip of that size to appear on a tablet, which, at this point, is bragging rights (and the potential for better performance). Last year’s iPad Pro, on the other hand, has a hexa-core A10X Fusion chip (the immediate predecessor to the A12X, since Apple didn’t make an A11X). Until we take the iPad Pro 2018 for a proper spin, it’s unclear just how much faster the new model is over the old. Predictably, Apple has its own highly-quotable bragging points, like that the A12X has 10 billion transistors, its 7-core GPU can manage 5 trillion operations per second, and so on. Apple claims the iPad Pro 2018 manages up to 10 hours of battery life, though we won’t know how for sure until we put the tablet through its paces. That should match the old model’s longevity.In terms of storage, the new iPad Pro 2018 has the edge, coming in the same 64GB, 256GB and 512GB storage options as its predecessor – as well as the new 1TB tier. Packing that much space in an Apple tablet will cost you dearly, however, doubling the base-level $799 pricetag for an 11-inch 64GB Wi-Fi up to a staggering $1,549 for a full terabyte of space.If you’re bummed by the iPad Pro 2018’s switch to a flat-sided look, it has one big benefit. The new version of the Apple Pencil magnetically snaps to the side of the tablet and automatically starts charging and syncing. Otherwise, there’s a couple cute new tricks up the iPad Pro’s sleeve. First, say goodbye to Lightning, as the new tablet now has a USB-C port. Yup, your existing Apple tablet plugs are, once again, obsolete.That’s a bummer for folks who’ve invested in the old cable standard, but it enables the iPad Pro 2018 to more easily link up to accessories or to an external monitor for use as a secondary screen. Even better: you can connect the tablet to an iPhone and the latter will start charging off the iPad Pro’s battery.As a newer device, the iPad Pro 2018 is understandably compatible with more advanced connectivity standards, including Bluetooth 5.0 tech (last year’s has Bluetooth 4.2) and up to 29 bands of Gigabit-class LTE (compared to the 25 bands in last year’s model). The new model can tap into Galileo and QZSS positioning systems in addition to GPS and GLONASS. The only thing the new model gives up? CDMA capability in its LTE versions.If you want the new iPad Pro 2018, you’re going to have to pay a bit more for it than last year’s model. It’s available starting at $799 (£769, AU$1,229) for the 64GB WiFi-only 11-inch and $999 (£969, AU$1,529) for the equivalent base-level 12.9-inch. That maxes out at $1,549 (£1,519 / AU$2,349) for a 1TB WiFi-only 11-inch model and $1,749 (£1,719, AU$2,649) for a 1TB WiFi-only 12.9-inch model, though you should expect to tack on around $150 if you want an LTE-connected tablet. Pre-orders are open now and the tablets will be available on November 7th. You can still get the 10.5-inch iPad Pro 2017 for its original price of $649 (£619, AU$979). Sorry, no discount for waiting til the new models arrived, but you might get lucky with Black Friday or other seasonal holiday deals as retailers try to offload their inventories of old iPad Pros.The iPad Pro 2018 has a new chip and a slick casing redesign that enables some cool interactivity with the revamped Apple Pencil, which will suit some professionals nicely. But the price bump on an already-pricey secondary device to $799 minimum is hard to stomach. At that price point, should you just buy a decently-specced laptop?It’s hard to advocate for an expensive performance tablet, but if that’s your bag, you’ve never had it so good. The Face ID expands the screen real estate nearly to the edges and the USB-C connectivity means you’ll be able to directly link up to far more devices. Whether that justifies a spending the equivalent price of a new computer on this tablet is entirely up to you (and your wallet). Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}