{"id": "TechRadarNew Xbox One that ditches discs for downloads could arrive in 2019", "paragraph": "\nBy\nNick Pino\n2018-11-16T18:41:09Z\n\nGaming\n \n\nA new report suggests that Microsoft has a new console in the works that could arrive in 2019: an Xbox One S-like console that doesn’t feature a disc tray. That means this console won’t be able to use any discs you’ve bought over the years - however, according to the same report by the Thurrott.com website, Microsoft might implement a trade-in program where you exchange discs for digital download codes.  Rumors have been swirling for a while that Microsoft is going to make a streaming-only version of the next Xbox game console, codenamed Xbox Scarlett, and hinted that Microsoft was targeting a 2020 timeframe for two new consoles - the streaming console and the regular next-gen system - and, like most folks, we had thought was the extent of Microsoft’s hardware plans. But, as it turns out, Microsoft has more in the making.  But why create another console in the Xbox One family? One reason is to drive down the cost of hardware even more - somewhere below the $199 / £149 / AU$249 mark. The other reason is that Microsoft wants to test the waters before it goes all-in on a digital-only future with its next-gen Xbox hardware.If this idea sounds familiar, it's because Don Mattrick pitched this as the idea for the Xbox One - an idea widely loathed by the gaming community. Mattrick's pitch was basically to provide games directly to consumers, cutting out retailers entirely. The reason gamers responded so poorly at the time was that they feared games would then lose their re-sale value and many didn't have the internet connection necessary to power through large file downloads - two problems that haven't quite gone away in the last five years.What has changed, however, is the infrastructure of Xbox. Not only do gamers get a number of free titles via Xbox Live every month, but now Xbox Games Pass delivers over 100 streaming titles for a reasonable monthly subscription. It's unclear how gamers will react to a disc-less future given these new features and a potentially lower price point - but, considering Sony isn't going to E3 this year, Microsoft will have more time in the spotlight regardless.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}