{"id": "TechRadarUpdate: YouTube has arrived on the Nintendo Switch", "paragraph": "\nBy\nDavid Nield\n2018-11-08T23:29:33Z\n\nGaming\n \n\nUpdate: As we anticipated, the YouTube app has officially landed on the Nintendo Switch, arriving on the November 8 date that we gleaned from the handy hints Nintendo dropped.The Nintendo Switch has been going from strength to strength since its launch last year, with a host of top-tier titles released for the hybrid console, but it still lacks many of the most popular apps you can find elsewhere.One of those missing apps is YouTube, but that's a gap that might be filled in the very near future: a few Switch users have spotted YouTube appearing in the \"suggested\" section of the Nintendo website, with an availability date of November 8. It's not direct confirmation, but it appears to be a rather big hint.We don't have anything official from either YouTube or Nintendo, but we do know that Netflix and YouTube functionality was previously included on a Best Buy Nintendo Switch listing. The listing was later amended to remove the streaming services.Even with its solid gaming line-up and new games arriving all the time, it would make a lot of sense for Nintendo to add to the Switch's capabilities – letting users relax and watch a few videos in between their gaming sessions.At the moment Hulu is the only streaming service you can get on the Nintendo Switch, and that's only available in the US. Let's hope the imminent arrival of YouTube, if it does indeed show up, is the start of more and more services showing up on the portable console. The likes of Spotify and Amazon Prime Video would certainly be welcome.Bearing in mind the Switch can be docked to a TV, this would be another way of getting YouTube – and maybe YouTube Music – up on the big screen as well. We'll have to wait and see what happens on November 8, this coming Thursday.Via 9to5ToysGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}