{"id": "TechRadarLogitech G900 Chaos Spectrum: should I buy this gaming mouse?", "paragraph": "\nBy\nMark Knapp\n2018-11-16T20:47:43Z\n\nGaming\n \n\nWhen the Logitech G900 Chaos Spectrum came out, it was a gaming mouse to get excited about. It effectively offered whatever you could need from a wireless gaming mouse. It was as reliable as a wired gaming mouse along with RGB lighting, plenty of buttons and an all-around great sensor. Jump forward to today, and the Logitech G900 Chaos Spectrum has a lot more competition. Although, it's price has come down substantially since it launched.We've seen the Logitech G900 Chaos Spectrum running for around $110, and for that price you get an 11-button ambidextrous gaming mouse with PMW3366 sensor that offers high accuracy and a DPI range from 200 to 12,000.  The wireless is responsive thanks to a 2.4GHz connection, and if the 24-32 hours of battery life run out, it can always be used with a wired connection. RGB lighting adds a final flourish, though leaving it off helps the battery last longest. All of that adds up to a pretty good package. Especially when considering Logitech's knack for refinement in its high end products. But, sadly for the G900, it's surrounded on all sides by mice the can show it up. Even Logitech has better to offer. And, they all come at competitive prices.If you were considering the Logitech G900, there's really no reason to buy it. Even if you just liked the looks, you can get the newer Logitech G903 for nearly the exact same price, and you'll get the option for wireless charging.Corsair has a better offer for right-handed gamers in the Dark Core RGB SE. It's one of our top gaming mouse picks thanks to its excellent sensor (an update from the PMW3367). Plus, it offers 2.4GHz wireless, Bluetooth, and USB wired connection along with wireless charging on Qi chargers. And, it does all that at a price well below the G900.Then we get into SteelSeries' offerings. Although it's wired, the SteelSeries Rival 600 is our favorite gaming mouse. It offers RGB, an ambidextrous grip, phenomenal design, custom weight options, and an impeccably precise sensor. Plus, it comes much cheaper than the G900. Finally, for just a few dollars more than the G900, there's SteelSeries' new Rival 650. It's set to offer everything we love about the Rival 600 – but with wireless connectivity. The only clear downside is that it's not ambidextrous. Still, you've got plenty of better options to choose over the G900 and they won't require you to open your wallet any wider.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}