{"id": "TechRadar proCarbonite review", "paragraph": "\n\n \n \n \n\n\nBy\nMark Pickavance\n2018-11-12T13:30:13ZOther software \nCarbonite is designed to secure all the important files on a computer so that they’re protected should the worst happen. It’s not perfect, but for PC users, in particular, it has many positive aspects.For many older computer users, Carbonite was most likely one of the first cloud storage services they encountered, as an early version was bundled on flash drives that used U3 portable app technology.The company has come a long way since it began in 2005, and now offers a sophisticated hybrid backup and disaster recovery services for Enterprise clients.But, is the tool that launched this company still competitive in an increasingly challenging marketplace?Where many online cloud storage solutions operate as essentially a cloud drive to your computer or mobile device, Carbonite has a subtly different agenda.It’s a backup system, so the content that ends up on there must exist on a computer somewhere. Therefore if you wish to unburden yourself of files, Carbonite isn’t the tool or service for you.Once files are secured on Carbonite you can access them from another computer or mobile device, should you need to recover something away from the client machine.The client tool is quick to download and install but can be a little on the confusing side, initially.Because once installed, it starts backing up your computer, without actually asking if you want to do that now, or specifically what files you’d like to keep.We did eventually discover that you can specify which files types you’d like to secure, and folders, but that’s not the default ‘automatic’ mode.If you want a clear view of what Carbonite is doing, the client app creates a linked drive that contains two folders, ‘Backed up Files’ and ‘Pending Backup’.This is a live facility, so once the first complete backup cycle has run, and it might take a very long time, any file changes or additions are automatically secured by the service.Also, as you navigate around with the file manager, files icons have any extra coloured dot added that indicates if they’ve been secured or they’re pending a backup.Carbonite should be commended on how straightforward most of this is once you understand its approach.However, we soon became aware that the performance of Carbonite is its biggest problem as after 40 minutes of operation it had only managed to secure a very small portion of the 18GB of data on our test system.That’s on a broadband connection with about 50MB/s download and 12MB/s upload.It isn’t possible to speed it up, but you can slow it down futher, if you find it is causing problems with internet performance.If the overhead is too great, you can pause the backup, thankfully. You can also set the backup not to be inactive at certain times of the day, but this appears to undermine the very purpose of using a live backup solution.Alongside the PC and Mac OS client tools, Carbonite also provides a web interface that enables you to access the files and folders are already secured.But the real tools for using Carbonite are those that the installation splices into the operating system. Using these you can tag a file or folder to be secured or restored, and if you’ve multiple versions of any file, you can also select those to restore. Or rather you can if you use a PC because very curiously the Mac OS client doesn’t support versioning.As the Mac OS platform supports Time Machine, and you can secure the Time Machine drive to Carbonite, then that is a convoluted was to achieve the same thing, but it would be better if the Mac had versioning inherently.All deleted files are kept for 30 days, should you accidentally trash something you need back, and that deletion replicates to Carbonite.The security options available under Carbonite range from pretty secure to extremely secure, depending on what subscription you have.All versions of Carbonite support AES 128-bit encryption, and when using this mode the company keeps of a copy of your key so that should you mess up and forget your password that those files can be unlocked.You can invoke two-step authentication using a provided phone number, making this option effective enough for most customers.Should you want it and have a Server subscription you can use AES 256-bit, and Carbonite won’t keep a copy of the key. If you forget that then your files will remain encrypted for eternity, sadly.That might seem on the harsh side, but this is the most secure approach and protects your files even in the unlikely event that Carbonite is successfully hacked.Carbonite has just three levels called Basic, Plus and Prime.Basic costs $59.99 (£46.41), will secure a single machine with an unlimited amount of storage, though it doesn’t include external hard drives or video files. For $99 (£76.57) you get Plus service that does include both video backup and external hard drives. And, Prime is $149.99 (£116.02) and includes a courier service that will bring your files back to you in the event of a complete disaster for an additional $99 (£76.57) fee.Your secured files are dispatched on a USB connectable drive that you then must return within 30 days or get hit with another $130 (£155) service fee.There are also versions for business users that cover multiple computers and also servers, and these can secure complete machines to the point where a bare metal restore is possible.All versions can be tried for free for 15 days, not just the basic level.Our only reservation about the pricing model is that it omits any monthly subscriptions, forcing larger yearly investments on the customer.Carbonite tries to soften that blow by offering increasingly better discounts for a longer subscription. Signing up for two years nets you a 5% saving and three years a 10% reduction.On paper, Carbonite is an excellent service, especially for PC owners, as it secures all your critical documents, and once it’s completed the first sync, it runs very smoothly.The problem is that depending on how many files you have got it all secured away over the Internet could take days if not weeks based on the speeds we encountered.If you are in a rush to secure your machine, then Carbonite probably isn’t ideal, but for less demanding users it’s a decent proposition.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}