{"id": "TechRadarGet 75% off your next VPN with NordVPN's Cyber Month deal discount", "paragraph": "\nBy\nAlex Hughes\n2018-10-30T17:23:13Z\n\nSoftware\n \n\nWe all know that Black Friday is a time for great deals on laptops, phones and other tech, but more recently we've seen low prices on software as well - including VPNs. And the opening shots have been fired already with a brilliant VPN deal on a 3-year deal with NordVPN.This deal will last until the end of next month (Friday November 30) and will give you a huge 75% off a three-year subscription of this popular VPN. At $107.55 (around £85), it effectively works out as a monthly cost of $2.99 (£2.35). Over the three years, that works out as a massive total saving of $323 (roughly £254) compared the the regular price of NordVPN's longest plan. It's one of the best value VPN services on the market right now. \nYou will have to pay the full $107.55 in one go, but with such a huge saving overall it is well worth the initial purchase if you have the cash to spend.NordVPN: 75% off on three year plansNordVPN is consistently rated as one of the best VPNs out there (including in our own chart of the best VPN providers) and it is clear why. It boasts \"unmatched\" privacy and encryption, unlimited download speeds, servers in 61+ countries and numerous detailed guides on how to use the system. Nord also allows for protection of up to six devices so you can get all of your gadgets - from your mobile and tablet, to streaming devices and personal computer - on one account. That's a lot of VPN for effectively $2.99 a month!View DealIf you're looking for a VPN deals it is probably for one of two main reasons: protection or bypassing. You could use one to stream Netflix in different countries, watch restricted sports events or even get cheaper tickets for flights.If you're more concerned about privacy, a VPN could protect you on untrustworthy Wi-Fi hotspots and limit the tracking of your data for safer exploration of the internet. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}