{"id": "TechRadarHyundai’s NEXO hydrogen car cleans the air as it goes", "paragraph": "\nBy\nRob Clymo\n2018-10-24T14:08:45Z\n\nCar tech\n \n\nHyundai has teamed up with University College London (UCL) to take on London’s dirtiest driving route, which includes areas such as Kings Cross, Westminster, Elephant and Castle, and Deptford. Research from the collaboration between Hyundai and UCL is being used to raise awareness of worrying pollution levels as part of Clean Driving Month. The move has also been timed to coincide with the release of Hyundai’s next-generation Hydrogen Fuel Cell Electric Vehicle, the NEXO.Journalists were invited to drive the route, which was devised after UCL had scrutinized open source data from a London pollution study conducted in the capital by King’s College. Nitrogen dioxide (NO2) and particulate matter (PM) levels were singled out with the route itself revealing the highest levels of pollutants. In fact, the roads included in the dirtiest driving excursion exceed limits set by the European Union. By drilling down into the data delivered by heat maps that showed the mean levels of NO2 and PM throughout London’s streets UCL, scientists were able to home in on stretches of road that proved to be the worst offenders. And, by bringing the NEXO in to drive the route, Hyundai found that it had the perfect opportunity to show off the car’s advanced air purification system. This, says the Korean manufacturer, filters out 99.9% of very fine dust. Better still, you get to see the ongoing results being dynamically conveyed on a display panel on the dashboard.Hyundai claims that if just one NEXO is driven for an hour, it has the potential to purify 26.9 kilograms of air, which it says is the same amount as 42 adults breathe in 60 minutes. The car producer also claims that if there were 10,000 NEXOs on the road it would subsequently have a carbon-reducing effect akin to planting 60,000 trees. Hyundai had their filters, and the NEXO, on show at UCL so you could see just how grubby the things become in a pretty short space of time.Sylvie Childs, Hyundai’s senior product manager for NEXO, said: “We are all concerned about air quality and what affects it. At Hyundai, we are committed to improving the efficiency and environmental performance of all our vehicles and have been investing billions in bringing a full range of low and zero emission vehicles to the market place. We believe that the availability of alternatives, like the NEXO fuel cell electric vehicle, will bring the UK closer to its zero emissions future.\"However, the responsibility for this cannot only rest with us, the manufacturer. We need the government to invest equally in incentives and infrastructure that would enable Brits to have better choices when it comes to the car they drive and how it can fit into their lives.”Michael Whiteley, senior researcher at University College London, gave his own take on the experiment: “We’ve done lots of research around fuel cell technology and believe that it’s an interesting transport solution to consider as we look to the future of driving. We decided to team up with Hyundai to create the dirtiest driving route to raise awareness of the pollution on our roads and highlight the role fuel cell technology can play.”The next part of the plan is to let the public get a taster of the potential too. Hyundai is allowing people who live in London sign up for a chance to take the NEXO for a spin from right outside their homes, albeit for just one hour. They’ll get a whiff of what sort of air cleaning potential the NEXO has to offer and, round the back of the car, see that the only emission coming from the tailpipe of this particular vehicle is water. There are other nods towards cleaner driving too, such as an adjustable regenerative braking system that claws back energy and, reckons Hyundai, reduces brake dust deposits.In addition to the car being driven on London’s dirtiest driving route, we also got a chance to take the NEXO for a slightly longer test drive, albeit in rush hour, from Victoria out to Heathrow airport. And, despite the reasonably heavy traffic, once we got the NEXO on to the M4 we found it perky, fun to drive and very well appointed. In fact, the NEXO feels like the perfect vehicle for a road trip thanks to the extremely comfy seats and high riding position.The only downside, aside from the premium price of about 60K, is where owners are going to be able to fill up with the Hydrogen needed to power the car. Indeed, this question is the first one you’ll need to ask if you’re tempted by the appealing lines of the NEXO. Hydrogen filling pumps are as rare as hen’s teeth. In fact, there are currently just a couple of forecourt options, with one at Cobham services on the M25 and a more recent addition at Beaconsfield, on the M40. In total there are less than 20 refuelling possibilities across the country, but the majority aren't on typical garage forecourts. Find one and you win a prize. Maybe. The upside to the NEXO is that should you be able to fill it up you get the potential of a near 500-mile range thanks to a trio of 52.2-litre tanks situated under the floorplan. The hydrogen supply is then combined with air to produce a chemical reaction that produces electricity to power the car. Nevertheless, the biggest conundrum facing Hyundai and the other car manufacturers who are bold enough to build a production vehicle that can actually be bought, rather than a prototype, is who will buy one? At the moment, Hyundai has to be commended for taking the chance that a hydrogen pump infrastructure might become a reality. The manufacturer hopes that more government incentives might help push things along too. However, you’ve got to wonder on the odds given that we can't even fix the myriad potholes on our roads. That said, the Department for Transport has made £8.8 million available to expand the hydrogen infrastructure in the UK, so there is hope.Nevertheless, for the time being at least, it might only take 5 minutes to fill up your Hydrogen-powered NEXO – much the same as a conventional petrol vehicle - but it could take a lot longer than that to find the refuelling pump itself. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}