{"id": "TechRadarSome Apple Watches are dying when updated to the new watchOS 5.1 release", "paragraph": "\nBy\nHarry Domanski\n2018-11-05T23:50:34Z\n\nWearables\n \n\nUPDATE: Apple has now removed the watchOS 5.1 update and replaced it with watchOS 5.1.1, which no longer has the bricking issue for Series 4 Apple Watches. If your device has already fallen victim to the bug, you'll need to contact Apple as version 5.1.1 will not restore its functionality and your device needs to be repaired by the company.Original article continued below.After updating their fancy new Apple Watches to the latest operating system, watchOS 5.1, some users are reporting that it has turned their devices into little more than jewelry.When trying to install the update, some owners of the latest Apple Watch Series 4 have found their unit stuck on the Apple logo screen indefinitely, effectively ‘bricking’ their rather expensive devices.Apple has apparently told some customers the update could take several hours, although many users have reported waiting for much longer with no change. Restarting the Apple Watch, or the paired iPhone, hasn’t fixed the issue for those affected either.For those who've successfully been able to install it, watchOS 5.1 introduces new emojis, watch-faces and support for group FaceTime audio, as well as fixing some minor bugs.While there is currently no official word from Apple, we’ve contacted them for a response and will update this story when we have more information. In the meantime, if you're a Series 4 Watch owner, we recommend holding off on installing this update until Apple has addressed the problem.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}