{"id": "TechRadar proDell refreshes its rugged Latitude laptops", "paragraph": "\nBy\nAnthony Spadafora\n2018-10-24T16:52:52Z\n\nLaptops\n \n\nDell has updated its ruggedized Latitude laptops with three new base models designed to operate in rough and demanding conditions.The new family of ruggedized laptops is made up of three base models that offer different levels of protection against extreme handling and environments. Dell's Latitude laptops come equipped with modern CPUs, discrete GPUs, advanced security technologies and dozens of optional communication capabilities.The Latitude 7424 Rugged Extreme laptop is the flagship of the updated line and offers the best protection against extreme handling and environments. The device has up to three SSDs running in various modes but this added storage comes at the cost of portability and brings the starting MSRP up to $3,499 (£2,713.76).Just under the Latitude 7424 Rugged Extreme at a more affordable $1,499 (£1,163.25), sits the Latitude 5424 Rugged. This device features the same expandability options but has a less reinforced chassis to help cut costs and improve portability. Dell has also introduced a simplified version of the 5424 called the 5420 Rugged which does not have an option for a second and third SSD nor an optical disk drive. It does offer the same level of protection and is the thinnest and lightest laptop in the company's Latitude line.All of Dell's new rugged laptops offer the same set of features with all three models being end-to-end secure and manageable. The main difference between each model is their level of protection against extreme handling and environments. Each device can survive being dropped as well as operating under thermal extremes and each one is compatible with existing infrastructure supporting Latitude Rugged machines. This means that industrial and military customers can upgrade to Dell's latest rugged laptops without any extra hardware-related investments.The new Latitude Rugged laptops come with a 14-inch Full-HD display that supports multi-touch, is protected by Gorilla Glass and has a polarizer to improve outdoor readability. What makes these displays stand out is the fact that they feature up to 1000 nits of brightness so that they can be seen easily when working in the field.Each of the three new laptops can be outfitted with either quad-core or dual-core Intel Core i3,i5 or i7 processors and up to three Class 20 or Class 4 SSDs that can reach up to 3TB of storage. For users handling more graphically intense workloads, Dell offers optional Radeon 540/RX540 discrete graphics.When it comes to communication capabilities, Dell's rugged laptops include 802.11ac Wi-Fi and GbE. The devices can also be outfitted with an optional Qualcomm x20 4G/LTE modem (Cat 16) and a GPS card.Via AnandtechTechradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}