{"id": "TechRadarLeaked photos may reveal the Google Pixel 3 Lite", "paragraph": "\nBy\nDavid Nield\n2018-11-17T10:30:36Z\n\nMobile phones\n \n\nRumors about mid-range Pixel phones have been bubbling up for some time already, and now we have a batch of leaked photos that apparently show a cheaper Pixel phone in the flesh – or rather in the glass and plastic. It's being called the \"Pixel 3 Lite\" and it even comes with a 3.5mm headphone jack, apparently.The leaked pictures are via the usually reliable tipsters at Rozetked, and show off a phone that looks a lot like the Pixel 3. However, in this case the 5.56-inch screen uses LCD technology rather than OLED, and the phone has a plastic rather than a metal back.According to the source, the phone is going to arrive rocking a mid-range Snapdragon 670 chip, 4GB of RAM, and just 32GB of internal storage, which can't be expanded – that suggests this is a phone destined primarily for developing markets, though we can't be sure until Google officially announces the handset itself.Rounding off the leaked specs, the Pixel 3 Lite brings with it a 12MP rear-facing camera, an 8MP selfie camera, and a 2,915 mAh battery (all of which seems to match the specs of the Pixel 3). Rozetked says the camera is going to be just as good as the cameras on the other Pixel 3 phones, but we'll have to wait and see.The codename Sargo that the tipsters are assigning to the phone matches previous rumors we've heard about the mid-range Pixel, and considering the number of leaks that have already appeared, we'd say this is now looking more and more likely to be real.Of course we won't know for sure until Google has something to say about this upcoming device – the Pixel 3 and the Pixel 3 XL leaked almost in their entirety before they got announced in October, and the Pixel 3 Lite is following that lead. A starting price of $400-500 (roughly £310-390 / AU$545-680) is being mooted.Via Android PoliceGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}