{"id": "TechRadar proEE and Virgin Media fined millions for overcharging customers", "paragraph": "\nBy\nSteve McCaskill\n2018-11-16T11:56:17Z\n\nNetworking\n \n\nEE and Virgin Media have been handed multi-million pound fines for issuing excessive early contract termination charges to customers.An investigation by Ofcom found that 400,000 EE customers overpaid as much as £4.3 million, while 82,000 Virgin Media subscribers were overcharged to the tune of £2.8 million.The regulator said that both companies failed to make the charges clear to customers and said the costs discouraged people from switching mobile or broadband provider – a violation of Ofcom rules.As a result, EE has been fined £6.3 million and Virgin Media £7 million.“EE and Virgin Media broke our rules by overcharging people who ended their contracts early. Those people were left out of pocket, and the charges amounted to millions of pounds,” said Gaucho Rasmussen, Ofcom’s Director of Investigations and Enforcement.“That is unacceptable. These fines send a clear message to all phone and broadband firms that they must play by the rules, in the interests of their customers.”Ofcom’s investigation found that over a six-year period, EE’s discounted contact terms did not clearly state the early termination charges. Around 400,000 customers who chose to leave their deal were overcharged by £13.5 million because EE “miscalculated” these charges by basing them on the original cost of the tariff rather than the discounted rate.Not all those concerned paid these charges as EE waived some of them, especially if the customer chose to remain with the network. This accounts for the lower £4.3 million figure that was actually overpaid.EE’s fine took into account the fact that £2.7 million had been returned to customers it had been able to identify.‘’We accept Ofcom’s findings and recognise that we have made a mistake,” said an EE spokesperson. “We apologise to customers with discounted tariffs who paid more than they should have when cancelling their contracts early. We’ve already refunded customers and changed the way we calculate early termination charges, and we will continue to focus on ensuring our policies are clear and fair for all customers.’’As for Virgin Media, Ofcom found the company’s exit charges were higher than customers had agreed to for a one year period. Up to 82,000 customers were overcharged by £2.8 million which amounts to an average of £34 per person affected. However 6,000 subscribers were overbilled by more than £100.Virgin Media has refunded or made donations to charity on behalf of 99.8 per cent of all those affected and has reduced the level of its early exit charges. It has also updated its processes and customer agent materials.However it has objected to the severity of the penalty and rejected the conclusion from Ofcom that its charges discouraged customers from switching provider.“We profoundly disagree with Ofcom’s ruling. This decision and fine is not justified, proportionate or reasonable,” said Virgin Media CEO Tom Mockridge. “As soon as we became aware of the mistake we apologised and took swift action to put it right by paying refunds, with interest, to everyone affected.“We wholeheartedly reject the claim by Ofcom that our ETC levels dissuaded customers from switching. This unreasonable decision and excessive fine does not reflect the swift actions we took, the strong evidence we have presented, or our consistent, open and transparent cooperation with the regulator. We will be appealing Ofcom’s decision.”Ofcom told TechRadar Pro that it has an industry-wide monitoring and enforcement programme for early termination charges and that it had no other open investigations into any other providers.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}