{"id": "TechRadarRoli Songmaker Kit review", "paragraph": "\n\n \n \n \n \n\nBy\nNick Rego\n2018-11-12T11:20:44ZMultimedia \nThe Roli Songmaker Kit is a futuristic piece of gear that experienced musicians will have a good time playing around with. It does have some limitations with integrating with certain software, and Android support needs to be stepped up considerably.Recording music has become a lot more streamlined and accessible as technology has improved. Anyone with access to a laptop and a few simple instruments can start recording their own music and adding on layers as they progress, learning as they go. That’s the experience after playing around with the Roli Songmaker Kit, a combination of well-built blocks that seamlessly integrate with each other to turn music-making into an interactive and mesmerizing experience.The Roli Songmaker Kit retails for AED 2,399 and is available at Virgin Megastore and Dubai Duty Free.The kit comes with three blocks - Lightpad Block M, Seaboard Block, and the Loop Block. Though you can buy each block individually, the Songmaker Kit combines them together in one handy carrying case, so you can make music pretty much anywhere you go.The genius of the Roli blocks starts from their design – each one has magnetic edges that allow the blocks to snap easily to each other. So even if they’re not positioned in the accompanying case, they stay connected to each other and don’t move about, even during vigorous use.The connectors also help the blocks to interact with each other, so for example you could quickly connect two Seaboard Blocks to each other to make a larger keyboard to play on. It’s incredibly intuitive and easy to swap things around depending on which hand you want to use to interact with each block.The Loop Block lets you quickly insert new loops into your track, as well as adjust the tempo and quickly toggle through favorite sounds and tracks. All of this can be done via Roli’s NOISE app, but putting physical controls on a block is a much more effective way to control your music.The Lightpad Block M is a MIDI pad controller with a very soft, flexible top. Underneath lies a bed of LEDs, which light up to denote different musical instruments or pads. There’s a USB-C connector to charge it up, and another button to turn the device on. A third button lets you cycle through the block’s different instruments and also independently adjust the volumes for various loops in your track. Similar to other blocks, the Lightpad Block M magnetically attaches and interfaces with other blocks, so you could string two of them together to make an even bigger assortment of instruments. Weighing in at about 260g with four hours of battery life, it’s easy to tote around for when you’re feeling musically inspired.This is also where you’ll be introduced to Roli’s concept of ‘5D touch’, which are five different ways you can interact with the Lightpad Block M to affect the sound being output. It’s a system that works quite well, allowing you to strike instruments harder or softer to change the volume and depth, while sliding or gliding your finger around can bend the pitch or add modulation to a sound. It’s something that normally takes a lot of tweaking through software, so the fact that it’s so easy to do right from the pad itself is a huge bonus.The surface of the Lightpad Block M feels rubbery to the touch, but it’s actually a very durable silicone surface with 225 ‘microkeywaves’ that help to give it texture and more control for when you’re using it. It’s responsive for when you’re gliding across the surface, and overall is not only great to look at, but very straightforward to use.Lastly is the Seaboard Block, a 24-key playing surface that incorporates Roli’s 5D-touch system for some truly responsive playing. The block itself features a USB-C port, power button, and another to cycle through different keyboard tones. There are no other physical buttons present, so everything else needs to be adjusted via software.For those familiar with playing on a keyboard, the Seaboard Block will seem familiar at first, but it’s various degrees of touch will certainly have you relearning how to play properly again. There’s no resistance to the keys in any way, so often the slightest touch can trigger a nearby note instead of the one you intended to press. It would have also been great if this was styled with black and white keys like a normal keyboard, just to make it visually easier to move from chord to chord, as the all-black design makes it hard to visually differentiate between keys.The Songmaker Kit doesn’t actually make any sound of its own of course – you’ll need to pair it with appropriate software in order to start making some proper music. The Songmaker Kit bundles with Roli’s Free NOISE and ROLI PLAY apps, each with a selection of rich soundpacks. You can also purchase additional soundpacks from artists such as A. R. Rahman, Pharrell, Steve Aoki, and more, with each soundpack coming in at an average price of $6.99, thought the Songmaker Kit conveniently allows you to download most of these for free after you register your device.Roli’s PLAY app is very straightforward – choose a theme for your mix, then add in different layers for Bass, Drums, Leads, and Chords. From there you can rearrange your mix as you see fit, before uploading it to Roli’s servers to share via a web browser link. It’s limited in its capacity for music production, but it’s a fantastic introduction to using Roli’s products.There’s more fun to be had in the NOISE app instead, which showcases the true breath of the Songmaker Kit. Once connected to the kit, the app allows you to cycle through a wide arsenal of soundpacks, and mix and match a seemingly endless number of layers.Once you’ve managed to mix a track that you like, it’s down to exporting it. You’re unfortunately only limited to two options here – either export all individual loops as wav files, or as a live set to edit in Ableton. It would have been easier if it could be exported as an mp3 file for more convenient sharing, so hopefully this is something that’ll be included in a future app update. You can also check out Equator, which is a much more in-depth desktop software that offers a range of modulation functions to fine-tune your music.Along with Roli’s own apps, the Songmaker kit bundles with a variety of software to further your music career, including Cypher2 Player, Strobe2 Player, Tracktion Waveform 8, Ableton Live Lite, and a three month license to Max MSP. That’s a fairly decent set of software to play around with, and for those just starting off, it’s a great starting point.It’s a huge shame that the apps only shine when used on iOS devices. For Android devices, the NOISE app is only available on Google Pixel at the moment, so if you don’t own an iOS device then you’ll be stuck only using the Songmaker Kit with desktop software.For more advanced music creators, things can get a bit more complicated when you use the Songmaker Kit with your regular software. It’s fun to play around in Roli’s own apps, but getting the different blocks to talk politely to other software can take a bit of timing and tweaking, especially if you want to enjoy features such as the 5D-touch. This isn’t down to Roli of course, it’s just a matter of different software makers being able to eventually integrate this new MIDI controller into their products.One occasional glitch we did run into was with the Lightpad Block M, which though connected to our iPad, still showed the ‘connecting’ animation on the block, and we had to turn off the block and turn it on again several times before it worked again. In another instance with the NOISE app, the Lightblock M was stuck on a particular instrument when we were cycling through different songbanks, so even though we weren’t pressing it, the block was playing tones. These could be tied down to Bluetooth connectivity, as other than this we didn’t face any issues while using the kit.The Roli Songmaker Kit is a fascinating piece of gear to make music with, as long as you spend the time to get to know each block properly and use them together. Roli does offer a decent library of tutorials and lessons, but the biggest benefit will be when you play around with the various settings and tones to figure out how things work on your own.It’s not a device that will strictly replace your current MIDI controllers, but it’s certainly one that points to an alternative way of producing music for the masses. For a fun and truly interactive music experience, the Roli Songmaker Kit is certainly something you want to get your hands on.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}