{"id": "TechRadarIreland vs New Zealand live stream: how to watch today's rugby union from anywhere", "paragraph": "\nBy\nLuke Edwards\n2018-11-17T17:30:39Z\n\nVPN\n \n\nIt could well be a match for the ages. The number two rugby union teams in the world rankings, both on top form coming in to this international weekend. The All Blacks are in Dublin, with both desperate to win. And you can live stream Ireland vs New Zealand from absolutely anywhere - and absolutely free.Ireland's rugby boys are back at home in the Aviva Stadium, Dublin for the autumn rugby union internationals, this time taking on the All Blacks.The match takes place on Saturday, November 17 with kick-off at 7pm GMT locally, which is 2pm ET, 11am PT and 6am AEDT Sunday morning.New Zealand's Sonny Bill Williams is injured so will be replaced by Ryan Crotty for the game. Other than that it'll be the same side that managed to just beat England in their last match. It's an intimidating XV, but its weaknesses were exposed by England last week and we know they can be beaten after South Africa did a number on the All Blacks in NZ earlier in the season.Ireland's side will have second-row Devin Toner to help make up for the failing line-out against Argentina in their last match. Rob Kearney and Garry Ringrose are now fit so they're in the back line once more. Dan Leavy replaces Sean O'Brien as flanker, while scrum-half Kieran Marmion and Bundee Aki are both match fit again following injuries. Can they repeat their famous victory from this time two years ago?Want to catch an Ireland vs New Zealand live stream? You're in the right place. The UK free-to-air broadcaster Channel 4 is hosting the coverage and you can use a VPN to catch it if you're outside the UK this weekend. Easy!Result! The Ireland vs New Zealand match will be shown live on Channel 4 in the UK. That means you can watch it for free on your TV when it kicks-off at 7pm GMT.Alternatively, you can access the action live via the All 4 online platform or through a third-party online streaming TV service such as TVPlayer.com. This means you can catch the match on TV, computer, tablet and smartphone for free if you're in the UK.Not in the UK this weekend? No worries - just download and install a VPN and use a UK location to watch as if you were back home. Full instructions below.If you're outside the UK and try to start streaming the rugby on All4, you'll soon discover that you can't as it is location restricted. But there's a way you can watch for free anyway. By downloading and installing a VPN, you can effectively trick your computer into thinking that it's in the UK. That way you can enjoy the free coverage without having to pay your local broadcaster or find an illegal stream.It's really easy to get started with a VPN - here's how to do it:1. Download and install a VPNIf you don't have easy access to watch Ireland vs New Zealand online in your country, the best way to watch it for free is to download and install a VPN. We've tested all of the major VPN services and we rate ExpressVPN as the absolute best. It's compatible with all of your devices, supports most streaming services and ranks amongst the fastest. You can even install it on devices like an Amazon Fire TV Stick, Apple TV, Xbox and PlayStation. So for a one-stop shop, you can't go wrong with Express - but there are more fantastic VPN options out there as well:The best 3 VPNs for streaming sports online1. ExpressVPN:  the best all-round VPN for streaming, comes with 30-day trial and/or 15 months for the price of 122. IPVanish supports up to 10 devices, so great on the go3. VyprVPN: blazing speeds make VyprVPN a great choice for 4K video   2. Connect to the appropriate server locationSimply open the VPN app, hit 'choose location' and select the appropriate location - it's super easy to do. Choose UK if you want to stream Ireland vs New Zealand on TVPlayer using the link below.3. Go to TVPlayer.comTVPlayer.com is a very handy little website that hosts all of the UK's freeview channels on one handy website. It's free to use, completely legal and lets you channel hop at your leisure.In New Zealand, Sky Sports has the rights to show the All Blacks take on Ireland in the rugger. That means access via the Sky Go app for subscribers as well. It's an 8am Sunday morning kick off - so get the coffee and bacon in.If you've read the rest of this article, you probably know the alternative route by now. You could give a VPN a try as per the instructions above.A VPN will enable you to watch the rugby from literally anywhere. So that obviously includes: South Africa, Australia, New Zealand, France, Italy, Argentina, Finland, Israel, Germany, Denmark, India, Netherlands, Brazil, Belgium, Romania, Mexico, Sweden, Portugal, Czech Republic, Ireland, Poland, Kenya, Hungary, Indonesia, China, Nigeria, Bangladesh, Russia, Japan, Egypt and more!Images courtesy of irishrugby.ieGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}