{"id": "TechRadarHands on: New iPad Pro 12.9 (2018)\nreview", "paragraph": "\n\n\nNot yet rated By\nGareth Beavis\n2018-11-04T15:23:32ZTablets \nThe larger of the new iPads is the one that will impress the most in the hand, but when you dig into the spec sheet and compare the cost you may find yourself with a difficult decision to make. There's a lot of power here and a lot to like, although the inherent multi-tasking limitations may make this a hard sell over a dedicated notebook. For creatives though, the iPad Pro offers a lot of options and flexibility.The iPad Pro 11 is the device that most people are looking at, but if you're after the very best tablet that Apple can make, then arguably this is going to be it.The larger 12.9-inch screen is going to offer the maximum space to tap, swipe and scroll around compared to the more portable model, and if you're someone that bought 2015's iPad Pro then you're going to want to check this device out.With the narrower bezels, it doesn't bring quite so much heft to proceedings, so you'll be getting a lot more of a display to slot more easily into a bag.The specs on the new iPad Pro 12.9, beyond the larger display and battery, are pretty much identical to those of the new iPad Pro 11, so if you want to read in depth about what’s going on with the new range, we suggest you check out our hands-on New iPad Pro 11 review.We’ll whizz through the main talking points here too though, as well as giving you a rundown on how the larger size feels to use.Oh, the other thing that’s different about the new larger iPad Pro: the cost. It’s pretty hefty, as you can imagine, coming in at $999 to start – although given what you’re holding, in terms of design and screen quality, it doesn’t actually feel that bad.The cheapest version of the iPad Pro 12.9 comes with 64GB of storage and the price starts at $999 / £969 / AU$1,529. The 256GB costs $1149 / £1,119 / AU$1,749, while the 512GB model is $1,349 / £1,319 / AU$2,049. Then there’s the largest, 1TB version, which costs $1,749 / £1,719 / AU$2,649 – that's a lot of money for a tablet.And those prices are for the Wi-Fi-only version, so if you want a mobile connection to your iPad you’ll be spending $150 / £150 / $220 on top of the prices above.Apple has set the new iPad Pro 12.9 release date for November 7 (which is now imminent), meaning you won’t have to wait long to get your hands on the new device.Pre-orders are live already, so if you’ve decided that you want to dump a truck-load of cash on a new tablet, you can do so – and then avoid looking at your bank balance for a while.The first thing you'll notice when picking up the new iPad Pro 12.9 is that it's BIG. We're talking gargantuan in your hands – well, that is if you've not used one of the other 12.9-inch models before.The reason we add that caveat is because, to our eye, one of the most impressive things about this new, ginormous tablet is that it doesn't actually feel that big. Having used the previous iPad Pro 12.9 models, this one feels like their futuristic cousin, shorn as it is of those chunky bezels.The outer rim is now much slimmer and cleaner than before, and you can just make out the sensors locked away on the left-hand side, glinting and trying to pick up your face. Compare this to the iPad Pro 12.9 of 2015 and you’ll feel like you’re holding something truly next-generation.The loss of the home button on this tablet is felt the least out of all the Apple products to eschew it – there's no way that you can easily plop your thumb on that section of the bezel anyway, without worrying that you're going to drop your expensive iPad Pro.iOS 12 brought the same gesture-based interface from the iPhone to the iPad, and we’ve found it’s far more intuitive for a larger device.The size also means the loss of the headphone jack is less of a hassle than you might expect – yes, we're irritated by the need to have a set of Bluetooth headphones, or an adaptor to use wired options, but with the tablet becoming slimmer the loss of the jack was inevitable.Gaming is slick on this larger deviceThe screen quality of the new iPad Pro 12.9 is what sells this device – it's just so expansive, and impressive for something that's more portable than you might imagine. Combine that with the power of the new A12X Bionic chipset inside, and there's very little this thing can't handle.Apple has been making a big deal about the augmented reality capabilities of its devices of late, telling anyone who'll listen that AR is going to become a 'thing' in the near future.On the one hand, the massive iPad Pro 12.9 screen is just what's needed to scope out space aliens hidden in your living room (or similar) but it's also a bit large to hold when you're wheeling around.The new Apple Pencil complements the new iPad Pro 12.9 pretty well, and it’s so much better now that it’s able to sit magnetically on the top and charge. The old ‘alien' antenna was a big miss, it felt. The new USB-C connector means you won't be able to use any Pencils of old though – those Pencils needed to be plugged into the Lightning Port in order to pair with the iPad – which will probably annoy those who are upgrading from the iPad Pro 12.9 that was first unveiled in 2015.Using the Apple Pencil on the new iPad Pro 12.9 was a strong experience though, with the latency of the ‘touch to brush’ the best we’ve felt on an iPad so far – much more than with previous Pros we feel like this is something we’d want to regularly use. It really does feel like it could replace a notepad, and on the larger screen it's much easier to see what you’re sketching out.The new large iPad Pro is supposed to last ‘all-day’ on a single charge if you're just using your tablet for general tasks, and not trying your hardest to run down the battery. However, Apple really skirted over this element in the keynote, so something tells us that battery life isn’t going to be a headline spec here at all.There's also the same 12MP camera here as seen on the iPad Pro 11, so if you need to use the camera for work, or in an educational scenario, we're thinking this is a nice thing to have. Please don't use the iPad Pro 12.9 as your main photography device though, given the whoppingly large screen that will get in the way of anyone trying to actually see the thing you’re trying to snap.The sound quality out of these speakers is better than ever before – and as we were already taken with the power of the iPad Pro as a multimedia device, and given how much thinner it is than before, this achievement is doubly impressive.In the loud auditorium of the demo area at the launch event it was almost impossible to hear people speaking, but still ‘Ready Player One’ was kind of audible over the din – and the vibrations from the speakers certainly felt powerful in the hand.If we were going to buy a new iPad Pro, this would certainly be the one. The extra cash is a lot to take, given you’re not getting that much more of a spec bump beyond the screen, but it’s just so nice to hold.This is the tablet you want if you’re a photographer looking to check out your images on the go, or any professional who needs excellent image quality in a highly portable form factor.There are still inherent limitations within iOS 12 that will prevent many power users from being able to use the iPad Pro as their main device – it can’t multi-task on a larger screen, for instance – and it sucks that you have to buy the keyboard and Pencil separately.But for day to day use, for a device that lets you interact with creative projects on the go, there’s not much that’s going to come close to this device.\n'Hands on reviews' are a journalist's first impressions of a piece of kit based on spending some time with it. It may be just a few moments, or a few hours. The important thing is we have been able to play with it ourselves and can give you some sense of what it's like to use, even if it's only an embryonic view. For more information, see TechRadar's Reviews Guarantee.\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}