{"id": "TechRadarThe Google Pixel Slate edges closer to going on sale", "paragraph": "\nBy\nDavid Nield\n2018-11-03T14:30:43Z\n\nTablets\n \n\nIf you've been itching to get your hands on the brand new Pixel Slate from Google then you're probably very keen to hear when it's actually going to go on sale. While the Chrome OS tablet has been announced, interested punters can only join a waiting list for now.That could be about to change, because the Pixel Slate has arrived at the Federal Communications Commission (FCC), the regulatory body charged with approving all gadgets in the US before they hit stores. Pending regulatory approval is one of the reasons that Google hasn't been able to start selling the tablet yet.With the device already announced, the filing doesn't have anything new to reveal, but it's a sign that the Pixel Slate will be on sale soon. Why FCC approval has come so late isn't clear – a late change in the device design might be something to do with it.All of which still means we're waiting on a specific on-sale date. Most sources suggest Google will try and get the slate available for Black Friday (November 23), which makes a lot of sense. It may end up arriving even earlier than that though.In our early hands-on review of the device, we described it as both \"simply gorgeous\" and \"perplexing\", a tablet with a lot going for it but a few question marks over its performance. Even at the lowest configuration, the Pixel Slate is going to set you back a big chunk of cash, but we'll have to wait for a full review to decide whether it's worth the outlay.What seems certain is that Chrome OS tablets with Android apps running on top are the future, with pure Android tablets largely relegated to the past. Watch this space for our final Pixel Slate review – which we'd recommend reading before buying the tablet.Via 9to5GoogleGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}