{"id": "TechRadarThe new MacBook Air is really just a bigger 12-inch MacBook", "paragraph": "\nBy\nJoe Osborne\n2018-10-30T19:14:24Z\n\nLaptops\n \n\nApple took the stage at the Brooklyn Academy of Music in New York City to revive its most beloved laptop brand, the MacBook Air, but it ended up doing so only in name. Frankly, what I saw on stage today was basically a bigger and better version of the 12-inch MacBook.The spirit of the MacBook Air, what that laptop truly represented in the eyes of its fans, was entirely missed in today’s MacBook Air 2018 update.This is not the no-nonsense, affordable entry point into Apple’s wonderful world of computing that the original MacBook Air quickly became after its launch. Nor does this laptop bring forth the full power of Intel mobile processing into a thinner and lighter design than its rivals.Instead, what Apple has shown off looks an awful lot like a 2018 version of the 12-inch MacBook with a larger display, Touch ID and one more Thunderbolt 3 port. After several years of waiting to see our beloved, approachable MacBook bring that same spirit into the modern era of mobile computing, to have it basically homogenize with an Apple laptop brand that screams luxury above all else, it’s tough not to see a bit of cynicism in this device.Perhaps the biggest selling point of the MacBook Air, after a revision or two, was its incredible price point. The 11-inch MacBook Air cost just $799 at one point in its life, with the 13.3-inch costing a mere $999 for years right up until today.While the MacBook Air didn’t start its life as an affordable Apple icon, it certainly developed that reputation over its lifespan. The accessibility of the MacBook Air was lauded in its later years.In fact, the increasing price of entry into Apple laptops in recent years has become a point of derision, with Apple eroding the lines between its laptop products that had been clearly defined by price. Today, it’s worryingly easy for someone to spend MacBook Pro kind of money on a 12-inch MacBook and get nowhere near the level of power within the former.The new MacBook Air will make this distinction easier in Apple’s new reality, but it does nothing for the fan that was – arguably rightfully – expecting a brand-new $999 laptop.First off, the biggest reason that the original MacBook Air models lasted so impossibly long on a charge was because they used far lower-resolution displays than most competing laptops. Frankly, that was just fine for what most everyone used the laptop for: word processing, emailing and watching the occasional video on Netflix. Sure, Apple is rating the new MacBook Air for up to 12 hours of mixed online use, but that’s with a completely unnecessary (if absolutely gorgeous) Retina display that, coincidentally, matches that of the 13-inch MacBook Pro. Imagine if Apple would have toned it down a bit with a perfectly-fine 1080p display.One thing is certain with a lower-resolution display: we would be seeing absolutely massive battery figures from this laptop, figures that would live up to the MacBook Air legacy.Then we have the processor. The MacBook Air has an 8th-generation, dual-core Intel Core i5 processor, and Apple won’t say much more on the matter. This sounds about right on paper, but the only dual-core, 8th-generation Intel processor is a Y-series Intel Core processor crafted for laptops with fanless designs. Every other current Intel Core i5 processor is a quad-core chip and requires fans to cool it. All previous MacBook Air models ran fan-cooled designs with full-fat mobile processors.The word 'full-fat' today finally means 'quad-core' in Intel's world, so I expected as much with this model considering a major piece of the original laptop's appeal was boasting the power of most rival laptops in a fraction of their size and weight. No matter how you slice it, this will not be the case for the new MacBook Air.Instead, the MacBook Air won’t be that much more powerful than a 12-inch MacBook is today, and at more of a disadvantage against competing Ultrabooks.While I must admit that the MacBook Air didn’t start its life this way, the laptop quickly became Apple’s affordable entry point into its computing ecosystem. This positioning was so successful that it saw the MacBook Air all but dominate college campuses – and thin-and-light laptop sales – at the time.The price of this new version for what it gets you doesn’t compare well to the value of competing Windows-based laptops, which positions the MacBook Air entirely differently from its predecessor. Ultimately, it seems as if this laptop isn’t that much more than a 13.3-inch version of the 12-inch MacBook.By that logic, I’m left wondering why Apple named this laptop the MacBook Air beyond the fact that the name carries incredible brand cache to capitalize on. One thing is for sure: this laptop may be gorgeous and the most affordable Retina MacBook to date, but it certainly doesn’t remind me much of the beloved ultra-light laptop that was basically ubiquitous in its time. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}