{"id": "TechRadarMoto Surround review", "paragraph": "\n\n \n \n \n \n\n\nBy\nCameron Faulkner\n2018-10-24T14:15:00ZHeadphones \nThe Moto Surround might not stray too far from the herd in terms of appearance, but it more than makes up for that with a batch of features and pleasing sound performance for a very affordable price.The Moto Surround headphones have been built with the knowledge that getting in shape isn't exactly affordable. The cost of your gym membership and workout clothes (plus all that time and energy) is expensive enough without a pricey list of associated tech on top.And Motorola has already showed us with its Pulse pair that it can cram a whole lot into a $59 (about £37, AU$80) set of Bluetooth on-ear headphones without sacrificing quality.Thankfully, the even more gym-friendly offering, the Moto Surround, also impresses without breaking the bank for $69 (about £44, AU$93 but currently US-only). Aside from a minor interface issue, these Bluetooth-enabled, in-ear headphones are simply too good to pass up. Read on for our review.The Bluetooth earbuds of the future will be ultra discreet, hiding a battery, Bluetooth radio and microphone inside an inconspicuous form factor that's barely noticeable.Unfortunately, that future hasn't arrived just yet. Even so, companies like Motorola have figured out some eloquent solutions to make today's Bluetooth in-ear headphones easy to use and comfortable, as the Moto Surround headphones show.Moto Surround reviewThe build of the Moto Surround resembles that of many other Bluetooth in-ear headphones geared toward athletic types, but these have a few traits that help it stand out.Specifically, the main design feature here: a black plastic band that wraps around the back of the neck and rests gently above the chest. The outside edge is peppered with matte and glossy plastic textures and rubber, which altogether give it a spiffy look and one you won't be embarrassed by.The controls placed around the Moto Surround band allow for relatively easy no-look access, but the control layout requires some studying.The right side of the band hosts most of the physical features, while a volume rocker is placed on its top that doubles as a song selector if you hold down either of the buttons for more than a second. On the opposite side, there's a power button and a microUSB port covered by a rubber flap.Moto Surround reviewThere are a few more buttons underneath the earphones, which are magnetically-fastened to the Moto Surround. On the right side, there's a play and pause button, and the left side has a phone button to answer and hang up calls.Connected at the back of the rubberized section of the band are the earphone cords: their flat cables rock a deep blue color and are about 6 inches long. When the headset isn't in use, the earphones can attach to the band via magnets so that they don't get tangled up. The plastic earphone housing is basic-looking, but it does the trick well enough.Moto Surround reviewIf the default ear tips don't fit well inside your ears, Motorola has included two other sizes to try on. Also included in the box is a microUSB cord to charge the Surround, which completes the picture.Motorola stuck to a familiar blueprint when designing the Surround. It can't take too many chances if it's going for an approachable price point, but I was impressed with the performance of these Bluetooth in-ear headphones at nearly every angle.Moto Surround reviewOnce you find the right fit, made easy with the three included sets of ear tips, wearing these earphones is a comfortable experience whether you're using the Moto Surround for just a quick workout or as an all-day companion.Listening to music with the Surround is a joy, considering the low price. Like the Moto Pulse, what you're getting here likely won't be the best sound quality you've ever heard, but you do get a lot of bang for your buck.Between the three different equalizers (you can switch by holding down both volume buttons), the sound profile didn't change much to our ears.Moto Surround reviewI'm pleased with the amount of bass, which is exactly what you need the most during a workout. The mids and highs come through with full force on the Moto Surround, but their detail is muddled and rather sloppy. I'd complain more if these cost hundreds of dollars, but they don't – and at that, these buds do an admirable job.The Moto Surround had no issue surviving its advertised 12-hour-long battery life. During my tests, I listened at various volumes and squeezed 12 hours and change out of it before I needed to find a power source.Motorola claims that the Surround can remain tethered to your device while up to 150 feet away. This sounded so bonkers that I had to try it out: I didn't measure the distance precisely, but I was at least 10-15 cars worth of distance down the block before the signal became dodgy. That's impressive.Moto Surround reviewThe only minor flaw that I encountered while using the Moto Surround on iOS is that skipping songs isn't seamless. It's easy enough to push the buttons, but the Surround lags a bit in executing your commands.For instance, when you change to the next or previous song, another second of your current song will play before it switches. Not a big deal – just a bit annoying. Interestingly, this wasn't an issue while using the Surround with an Android device.If you're looking for a wireless set of Bluetooth earbuds for workout or leisure, you'll be hard-pressed to find a better value than the Moto Surround. Not just that, these affordable headphones boast impressive sound and battery life for the low cost.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}