{"id": "TechRadarHands on: TicWatch C2 review", "paragraph": "\n\n\nNot yet rated By\nJames Peckham\n2018-10-24T18:00:00ZWearables \nThe TicWatch C2 brings NFC payments and a refined design to the more affordable Mobvoi watch line. This could be a good smartwatch for anyone who doesn't want to spend over $200 / £200.Mobvoi only started making smartwatches in the last couple of years, but it's a company that has performed well and has multiple products in our best smartwatch list due to what they offer at an affordable price.The TicWatch C2 is the latest addition to the growing range of TicWatch products and it's the first sequel to the TicWatch Classic, the company's first ever wrist companion.That means it sits slightly above the more affordable TicWatch options but isn't as high-end as the TicWatch Pro that we reviewed earlier in 2018.Below you'll find our initial experiences with the new TicWatch C2, and we hope to have our full review up in the near future.You can pre-order the TicWatch C2 now in the UK, US and Australia, but it won't be shipping to customers until December 6 this year. To be able to pre-order, you'll have to head to Mobvoi's site.The price is set at $199.99 / £179.99 / AU$299, which means it's a touch more expensive than the TicWatch E and around the current selling price of the TicWatch S. It's a bit cheaper than the top-end TicWatch Pro though. That's $249.99 / £219.99 / AU$369.99, so the price difference isn't huge and if you're after the two-display screen tech it will be worth you spending that extra.The TicWatch C2 feels more premium than the first generation of this line of watches, and it’s certainly more premium than the TicWatch E or S. All of that said, it doesn’t feel as high-end as the TicWatch Pro and it doesn’t have as many features either.There’s a 1.3-inch AMOLED display at the heart of the watch with a resolution of 360 x 360, which is what you’ll use to navigate around the UI. There are also two pronounced hardware buttons on the right hand edge of the watch to help you move around the interface.The top button has an odd indent that’s an orange color, but it gives it a unique look much like how the crown on the Apple Watch Series 3 and Apple Watch 4 has been a different color.There’s no interesting second screen tech here like you’ll get on the TicWatch Pro, which is a bit of a shame but it has allowed the company to make this watch both thinner and lighter.The watch itself is made of stainless steel and comes in silver, black or rose gold. The rose gold variant sports 18mm straps and is a touch thinner at 12.8mm, while the black and silver ones are 13.10mm thick and sport 20mm straps.It's actually just the front of the watch that is made of stainless steel. That ensures the most visible part looks premium, but it’s a little less good looking on the rear as that’s plastic. But if you want you’ll be able to keep that a hidden secret next to your wrist.You can get a variety of leather straps, but Mobvoi has confirmed that it will bring more options to market soon as well. For anyone who wants to avoid leather or to use this for exercise, you may want to buy a separate third-party silicone strap to put with this.Back to the thinness, the rose gold variant is particularly thin as there isn’t a lip over the top of the bezel around the display. You can see that clearly in the photo below, and it’s just one way the company has made this version more suitable for smaller wrists.All versions of the TicWatch C2 are also IP68 water and dust resistant. That means it'll be able to survive a jog in the rain, but Mobvoi has confirmed this watch isn't designed for use in a pool so you won't be able to track your swimming stats with this.Everything we’ve come to expect from Mobvoi’s range of Wear OS watches is here including a heart rate monitor, Connected GPS and normal fitness tracking features that will keep an eye on your step count and track general exercise.The latest Wear OS software is on board here, so you’ll immediately notice the user interface design changes if you're used to the original version of Wear OS. The new version makes navigating around smartwatches that bit easier.Mobvoi have chosen to use the Qualcomm Snapdragon Wear 2100 chipset to power the TicWatch C2. That’s a bit of a shame as Qualcomm has now revealed a new reworked version called the Snapdragon Wear 3100, which offers extra power and better battery life.While our limited testing of the watch seemed snappy at loading apps, the lack of that extra power may be something you’ll notice over time. We’ve yet to learn how much RAM is in the TicWatch C2.There is NFC here though, so you'll be able to set up Google Pay on your wrist for contactless payments. That's something you won't be able to do on the TicWatch E or TicWatch S.We haven't yet had a chance to fully test the battery on the C2, but we’d like to think it would be similar to other watches made by the company, so it should last at least a day.Mobvoi claims the 400mAh cell will be able to last for two days though, so we’ll be sure to put that claim to the test at the time of our full review. As expected, it won’t rival the TicWatch Pro, which can offer up to a month of timekeeping and step counting from a single charge.So far, the TicWatch C2 looks like a perfect jumping off point for your first smartwatch if you're looking for a reasonably well accomplished device with a premium look but a lower price tag.The smartwatch market is tougher than ever, with top-end products like the Samsung Galaxy Watch, Apple Watch Series 4 and the TicWatch Pro vying for your attention, but we have high hopes for this more affordable choice.\n'Hands on reviews' are a journalist's first impressions of a piece of kit based on spending some time with it. It may be just a few moments, or a few hours. The important thing is we have been able to play with it ourselves and can give you some sense of what it's like to use, even if it's only an embryonic view. For more information, see TechRadar's Reviews Guarantee.\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}