{"id": "TechRadarThe best keyboards of 2018: top 10 keyboards compared", "paragraph": "\nBy\nKane Fulton\n2018-11-16T20:05:00Z\n\nPeripherals\n \n\nIf your keyboard is starting to look like a horror movie prop, you might want to consider going out and buying one of the best keyboards you can buy today. Even if you don’t have a keyboard that looks grimy and barely works – the benefits to comfort, speed and reliability you gain with one of the best keyboards can make them worth the price of entry.Once you lay your fingers on the best keyboards, you’ll never go back. The advantages you gain in reliability and speed are simply breathtaking. No matter what kind of work you’re looking to do – whether it’s programming, writing or just playing the best PC games – the best keyboards will make your life easier. And, if you’re looking for the best gaming keyboards, we’ve got you covered too. (Spoilers: it’s the Razer Huntsman Elite).So, whether you’re just trying to chat it up with some old friends on Facebook, or you’re trying to get some work done, you should be on the lookout for any keyboard that checks all the boxes. And, with Black Friday and Cyber Monday rapidly approaching, we went ahead and compiled a list of all the best keyboards. So, while you’re out there finding all the best Black Friday PC components deals, stay tuned to TechRadar so you can find the best keyboard, too.The keyboard from the futureInterface: Wired | Keyboard backlighting: Yes | Switches: Roccat Titan SwitchesIn 2018, it’s becoming the norm for keyboard manufacturers to implement their own custom keyboard switches, and Roccat – with the Vulcan 120 Aimo – is no different. While this keyboard is primarily marketed as a gaming keyboard, its Titan Switches are tactile enough to be satisfying, while still bouncing back quickly enough to be comfortable to type on for extended periods. And, we’d be remiss to not mention the looks – the Vulcan 120 Aimo looks like a science fiction keyboard, we love it.Read the full review: Roccat Vulcan 120 Aimo A low-profile speed machine Interface: Wired | Keyboard backlighting: No | Switches: Topre electrostatic capacitive (30/45/55 grams variable, 45 grams, 55 grams)Made by the Japanese Topre Corporation, the Realforce is, as its name suggests, a force of nature in the keyboard world. It's all down to the Topre switches inside, which in contrast to Cherry's MX switches, are super smooth to type on and are often compared to playing weighted piano keys. The RealForce comes in both 45- and 55-gram configurations, though which one you buy depends on the importance of key weight. Oh, and we should probably mention that neither come cheap.For a quieter Topre experience Interface: Wired | Switches: Topre electrostatic capacitive silenced (30, 45 and 50 grams)As long as you don’t mind missing out on some of that signature ‘thock’ sound that’s associated with regular Realforce keyboards, opting for a silenced model like the 104 UBS offers some solid benefits. Hitting the 104 UBS’s keys produces sound on par with a membrane keyboard, so it’s going to be great if you work in a busy office or a shared bedroom. The ‘dampened’ feel of Topre’s silenced switches can feel kind of like typing on sandpaper compared to a non-silenced board, but we found that it’s worth the trade-off if you need a quieter keyboard. Built like a tank and compact Interface: Wired | Switches: Cherry MX (Brown, Blue, Black, Red)Filco's keyboards tend to be built like tanks, and the Majestouch TKL is no different. This space-saving mechanical keyboard features a compact tenkeyless design that has less than 1cm of space between the edge of the keys and the keyboard. Its durability doesn't simply allow it to stand up well to knocks and scrapes – it has a positive impact on its typing feel too. You can hammer away on it at speed, even bottoming out to your heart's content, and the Majestouch 2 will take every bit of punishment.Finally, a keyboard for creativesInterface: Wireless | Switches: Scissor switch mechanismWe’ve seen all kinds of keyboards over the years here at TechRadar, from stylish tenkeyless keyboards to RGB-laden gaming behemoths, but something has always been missing – a focus on creatives. Thankfully, with the Logitech Craft, this is no longer the case. Not only is this a sturdy, tactile and attractive keyboard but it also features a unique dial on its top left corner, which will help creatives expedite their workflow. This dial’s utility will vary depending on the application, from simply controlling the volume on the desktop, to changing levels in various tools in Photoshop. If you spend a lot of time creating content on your PC, the Logitech Craft is one of the best keyboards you can buy today.Read the full review: Logitech Craft A coder's dream and typist's treasure Interface: Wired | Switches: Topre electrostatic capacitive (45 grams)Somewhat legendary in keyboard circles, the PFU Happy Hacking Professional 2 (or HHKB2 as it's usually referred to) is that rare beast - a 60% Topre keyboard. Aimed at coders but fantastic for document warriors too, it foregoes traditional arrow keys, instead making use of function keys and key combinations to provide such functionality. It only takes a short while to get used to, once you've got there the huge benefit is that the HHKB2 is small and light enough to take anywhere, giving you access to that sweet Topre \"thock\" sound and feel anywhere, anytime.Beauty meets securityInterface: Bluetooth | Keyboard backlighting: No You need only look at Microsoft’s Surface devices to know that they’re kind of killing it when it comes to style, and the Microsoft Modern Keyboard with Fingerprint ID takes it to another level. This is one of the best keyboards you can buy today if you’re running Windows 10, and especially if you’re into the Surface aesthetic. Not only does this keyboard feel amazing to type on, but it also features biometric security, by including a discrete fingerprint scanner right next to the right “Alt” key. Sure, it’s expensive, but as with everything Microsoft, you can be sure you’re getting what you pay for.Read the full review: Microsoft Modern Keyboard with Fingerprint ID Has just enough keys to be useful Interface: Wired | Switches: Topre electrostatic capacitive (45 grams)Leopold's Fc660c is more portable than the Realforce 87u, but less so than the lighter and more compact HHKB2. However, the Fc660c benefits from its extra heft and feels like the more solid board. Despite having the same 45 gram actuation force as the HHKB2, the Leopold's keys feel slightly weightier - somewhere nearer to 50 grams. It results one of the most satisfying \"thock\" sounds on a Topre board.The ultimate keyboard for typing nostalgia Interface: Wired | Switches: Buckling springRemember those old IBM Model M keyboards? Well, that’s what the Unicomp Classic 104 seeks to emulate. Available in both USB and PS/2 versions, it uses a buckling spring switch that takes more effort to press than just about every other modern switch. You’re rewarded for this hard pressing with a tactile response that feels like the classic mechanical keyboards of old, along with a noise that will drive everyone around you mad. Mixing minimalistic style with premium quality Interface: Wired | Keyboard backlighting: White | Switch type: Cherry MX Red or Brown switchesSome keyboards just ooze class, and the Das Keyboard Prime 13 is one of them. Its features a solid aluminum top panel for added rigidity and a very minimalistic look. With Cherry's MX Red or Brown switches under the keycaps, you're given a choice between linear and non-linear offerings with a range of actuation points.It's a great option for media enthusiasts thanks to side lit media control and the inclusion of white backlighting is another bonus. It's not the most affordable keyboard on our list, but if you're looking for something a little bit more premium, Das is the way to go.A great option for mobile device owners Interface: Wired | Keyboard backlighting: NoAccording to a government survey, the average British household owned 7.4 internet-connected devices in 2015. Logitech is targeting smartphone and tablet owners who prefer to see their device's display while sat at a computer with its latest keyboard, the K780. If you liked its predecessor, the K380, there's more to love here. (Literally thanks to its added numberpad.)The K780 can still pair with up to three devices using Bluetooth or wireless, allowing you to chop and change between them, and it features the same comfortable rounded keycaps that remain a pleasure to type on. The star of the show, however, is the keyboard's base, which can hold mobile devices up to 11.3mm thick in an upright position. This places them within arms' reach to make anything from replying to WhatsApp messages or reading a digital magazine easy as pie. It goes without saying that if you demand the look and feel only mechanical switches can provide, rather than those that are slim and stealthy, we suggest perusing our best gaming keyboards round-up instead.Gamers prioritize the actuation that clicky feeling mechanical keyboards bring, whereas traditional home and office users are more about practicality. That said, the sheer magnitude of sound produced by a lot of mechanical keyboards is offputting to some. For those folks, we have some membrane keyboards to recommend as well.Gabe Carey has also contributed to this articleGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}