{"id": "TechRadar proTech giants facing major UK GDPR probe ", "paragraph": "\nBy\nAnthony Spadafora\n2018-11-12T16:51:40Z\n\nInternet\n \n\nPrivacy International (PI) has filed complaints of “systematic infringements” of data protection law by seven companies that it claims have exploited the data of millions of users without thorough criticism.The civil rights group has singled out data brokers Acxicom and Oracle, ad-tech firms Critero, Quantcast and Tapad as well as the credit rating agencies Equifax and Experian.PI wants European data protection watchdogs to launch probes into the seven companies to assess whether their practices meet the standards laid out in GDPR.The complaints against the companies in question are based on over 50 Subject Access Requests and the information provided on their websites. PI argues that the way these companies use data contravenes the new regulation especially when it comes to profiling.Legal officer Ailidh Callander explained why regulators should go after the companies identified by PI to the Register, saying:\"GDPR sets clear limits on the abuse of personal data. PI's complaints set out why we consider these companies' practices are failing to meet the standard – yet we've only been able to scratch the surface with regard to their data exploitation practices. GDPR gives regulators teeth and now is the time to use them to hold these companies to account.\" The Information Commissioner's Office has issued assessment notices to Axicom, Experian and Equifax which will allow it to carry out compulsory audits. However, this is not enough for PI which wants the ICO to go after other businesses in violation of GDPR.The group argued that the companies it highlighted as well as others have failed to comply with Article 5 of GDPR which lays out the data protection principles of transparency, fairness, purpose limitation, data minimisation and accuracy.Via The RegisterTechradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}