{"id": "TechRadariPhone XR deals US: Get ready for Black Friday discounts", "paragraph": "\nBy\nMark Knapp, \nStephen Slaybaugh\n2018-11-08T21:10:32Z\n\nMobile phones\n \n\nApple's new iPhone XR is available for you to order now, but with Black Friday and Cyber Monday right around the corner, you might want to wait and see what kind of iPhone XR deals pop up. The iPhone XR isn't alone either. Apple's more premium iPhone XS and XS Max are also available, but of the three phones, the iPhone XR is easily the cheapest option, and the most colorful. It's available. The iPhone XR starts with a base configuration of 64GB, with 128GB and 256GB versions also sold. It comes in white, black, coral, blue, yellow, and (Product)RED. \nDespite being cheaper, the iPhone XR still has a high base price of $749. Fortunately, unless you're trying to buy an unlocked model, there are iPhone XR deals you can take advantage of. And, with Black Friday coming around November 23 followed shortly by Cyber Monday on November 26, there's a slight possibility the iPhone XR could get some kind of deal, even if its not a straight price cut.The new iPhone XR didn't go on sale quite as early as the iPhone XS. Instead, Apple announced that it would be available for pre-order starting October 19, with units shipping on October 26. In other words, the wait is over. You can go online or head to stores to shop for the new iPhone XR.Touted as Apple's \"affordable\" handset, the iPhone XR still boasts an impressive price of the $749 for the base 64GB model, slightly more than the price of an iPhone 8 prior to today. Meanwhile, the 128GB model costs $799 and the 256GB edition is $899. You can head to our dedicated unlocked iPhone XR page to see the latest retailers that are selling it.Buying from a carrierOf course, no matter what model you choose, you're not going to want to pay full price for the iPhone XR if you can help it. The easiest way to get an iPhone at a discounted price is through one of the major carriers as they all offer incentives or installment plans to get you to purchase the phone and possibly sign up for their wireless service. When the iPhone 8 was released, Sprint essentially offered the phone for free if you traded in an eligible phone and signed up for an 18-month lease and wireless contract. Meanwhile, the other carriers (Verizon, T-Mobile, and AT&T) offered up to $300 off when you traded in an eligible phone.Here's a look at what options carriers are offering on the iPhone XR:Xfinity Mobile has a straightforward deal for customers who order the iPhone XR: $200 back. There's no trade-in involved, which may be the most surprising aspect of the deal. Instead, customers need to be coming from a different carrier, activate a new line with Xfinity mobile, and port their phone number over. This deal runs through January 6, 2019.Verizon is offering the iPhone XR at retail or starting from $31.24/month on a 24-month installment plan. But, that's just whether things start, as Verizon has multiple ways to make upgrading easier.Verizon is offering up to $750 off a second iPhone XR or X with the purchase of an iPhone XR, XS, XS Max, or X. There's no trade-in required, but you must activate at least one new line of service.Topping off the deal, if you order the iPhone XR, Verizon is offering $100 off the payment plan for any iPad and $50 off the payment plan for an Apple Watch.Sprint is offering the iPhone XR on a 18-month Flex lease to bring the price down to $31.25/month. But, for a limited time, it's also giving customers a way to reduce the lease price to $0/month with an eligible trade-in. If you're getting a new line of service, the trade-ins that will lower the lease to $0 are the following: iPhone X, iPhone 8, iPhone 8+, iPhone 7, iPhone 7+, Samsung Galaxy S9, Samsung Galaxy S9+, Samsung Galaxy S8, Samsung Galaxy S8+, Samsung Galaxy S8 Active, Samsung Galaxy Note 8, LG G7 ThinQ, Google Pixel, Google Pixel 2, Google Pixel 2 XL.If you're upgrading, your lease will be $0 with a trade in of an iPhone X, iPhone 8, iPhone 8+, Samsung Galaxy S9, Samsung Galaxy S9+, Samsung Galaxy S8 Active, Samsung Galaxy Note 8, or LG G7 ThinQ.The 18-month Flex lease includes Sprint's iPhone Forever program, which allows you to upgrade to a new iPhone any tie after 12 lease payments by trading in your currently leased iPhone.Currently, AT&T offers a 30-month installment plan for the iPhone XR. That brings the monthly price down to just $25. But, that's not the only way AT&T is helping lower the price. If you're in the market for two new iPhones, AT&T is offering close to a buy-one-get-one deal. Ordering an iPhone XR, you can get $700 in credits towards a second iPhone. A new line of service is required, as is DirecTV, and AT&T specifies certain thresholds that plan must exceed. You can learn the rest of the details at AT&T.T-Mobile has the iPhone XR for $749, but actually offers the lowest installment plan of the bunch. It gives you the option of spreading out the price of the device over 36 months, bringing the month cost down to $20.84. There's also the ability to get up to $390 in bill credits with an eligible trade-in. If they are in good condition, the following trade-in devices are worth the full $390: iPhone 7, 7 Plus, 8, 8 Plus; Samsung Galaxy S8, S8 Plus, Note 8; Google Pixel, Pixel XL, Pixel 2, Pixel 2XL; LG V30, and LG G7. This can effectively halve the price of each monthly installment plan bill.We haven't seen any iPhone XR Black Friday or Cyber Monday deals crop up quite yet. But, some deals appear early, and some even start ahead of the sales event. As we find iPhone XR deals for Black Friday, we'll make sure you can find them here.You can find all of our Black Friday iPhone deals here.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}