{"id": "TechRadarOnePlus 6T launch date has changed because, you know, Apple", "paragraph": "\nBy\nMatt Swider\n2018-10-19T18:59:36Z\n\nMobile phones\n \n\nThe next OnePlus launch date has officially been moved to October 29, a day earlier than the company originally announced, proving it's hard to compete with Apple.The OnePlus 6T launch event was scheduled for October 30 at 11am ET in New York City until Apple pounced on that same date, in the same city, an hour earlier at 10am.Instead of conflicting with the expected iPad Pro 2018 launch event, OnePlus changed its date to 24 hours earlier, at 11am on October 29.\"After deep reflection, we have decided to move the OnePlus 6T Launch Event in New York City to October 29,\" said the OnePlus Team on its official forum.The company pointed at Apple specifically, saying that many members of the press provided feedback. \"They showed us that, if we chose to stick to our original timeline, launching the OnePlus 6T on October 30, we would be overshadowed by Apple.\"But, the change does affect OnePlus fans, too.\"To those affected, we know sorry isn’t good enough,\" said OnePlus, which charges its most die-hard fans admission for launch event tickets. \"We will do everything in our power to make things right. Starting with those of you who own a ticket, but won’t be able to make the event. Everyone who owns a ticket will be able to apply for a full refund for their ticket.\"There's a lot of excitement around the OnePlus 6T phone, with leaks pointing to an in-screen fingerprint sensor on a mainstream smartphone, 8GB of RAM even for the entry-level configuration (unlike the OnePlus 6), and longer battery life.The design is rumored to change in two ways. You'll see it get a smaller notch (a 'teardrop notch' not unlike the Huawei Mate 20 'dewdrop' notch), and no more headphone jack, as OnePlus co-founder Carl Pei confirmed to TechRadar last month.TechRadar will be at the OnePlus 6T launch event and the Apple iPad Pro 2018 launch event – without having to be in two places at once.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}