{"id": "TechRadar proSecureData SecureDrive BT 1TB review", "paragraph": "\n\n \n \n \n\n\nBy\nDesire Athow\n2018-10-24T18:00:22ZDisk drives (HDD & SSD) \nIf you want an additional level of security and peace of mind, the SecureDrive BT can help you achieve that at a cost. This particular model is great for transporting large amounts of data around, but just be aware that it is a hard disk, and therefore more sensitive to drops and knocks than an SSD.When it comes to storing data, there are two schools of thought. Either do it locally (on a hard drive or local server) or store the data in the cloud. A growing number of vendors are pushing external storage devices as an elegant alternative, and the expanding popularity of SSDs means that you can now have affordable, fast, solid and reliable storage at a price point that will be attractive for small and medium businesses alike.SecureData has introduced a new external drive, the SecureDrive BT, which can be unlocked through a smartphone app using Bluetooth, and more specifically IP licensed from Clevx and covering its DataLockBT technology.Available in both SSD and HDD flavors, the former comes with sizes ranging from 250GB to 8TB, with SRPs from $289 (around £220) to $4,369 (around £3,370). As always, think of backing up your data to the cloud or elsewhere, as well, because it is unwise to have only one copy of your data. We were sent the 1TB hard disk model for review, which carries the SKU SD-BT-12-BU1000GB.The SecureDrive BT looks like a normal external hard disk drive. It sports a dark blue metal finish for the aluminum chassis and a three-step peel-able diagram at the back to show how to lock and unlock the device.Other than the flat USB connector (sadly no Type-C here) and status lights (a red padlock light and a green one), there’s barely anything else. We’d have preferred to have a flap to seal the USB connector and protect it from dust and debris.The drive is sturdily built (and backed by a two-year warranty), although the cable provided is a little short for our liking. It is not waterproof, however, and at 127 x 77 x 12.5mm with a weight of 204g, is small enough to be carried around.Unlike a few of its competitors, the drive has to be connected to a host client in order to be activated as it doesn’t have an internal battery. While some might view this as a disadvantage, one has to remember that batteries are chemical products and likely to degrade over time.The first thing you have to do before you use the drive is to download the corresponding app. The Datalock app is available from Google Play and from the Apple App Store (don’t confuse it with Datalock Admin or Datalock Managed). It is available only for smartphone platforms, so you won’t get the app for Mac or Windows. Don’t try to download ‘Secure Drive’ or ‘Secure Data’ apps as they are not affiliated with the SecureData brand.Once the app is installed, you will need to plug the storage device into a host client (usually a computer or a laptop running any recent version of Windows, Linux or macOS) and then just connect using the app. Of course, make sure Bluetooth connectivity is switched on with your device.You will be asked to create a new password, and will then pair it with your device; make sure you enter the 8-digits located near the USB connector correctly. There are no limits to the number of devices that can be paired, and even if your smartphone gets lost, you will be able to rapidly get access to your stored data.Since you are using your smartphone as the master key, the SecureDrive BT is TouchID and FaceID compatible (when using iOS), has a proximity lock (aka Step Away auto-lock), and an inactivity auto-lock that can be configured in the app.The drive is locked and invisible to the host computer until unlocked, and the device is host/OS independent. You could plug it into a TV (with a compatible USB port) or even a printer.While the drive itself is relatively bland, the real added value comes from its remote management capabilities, more specifically the geo-fencing capabilities that rely on the actual physical location of the smartphone (via GPS) rather than on the connecting IP address.Here’s how the SecureData SecureDrive BT performed in our benchmark tests:CrystalDiskMark: 124MBps (read); 117MBps (write)Atto:  123MBps (read, 256mb);  116MBps (write, 256mb)HD Tune Pro: Did not runAS SSD: 117MBps (seq read); 108MBps (seq write)The SecureDrive we reviewed used a WDC Blue Mobile hard drive (WD10SPZX), a 1TB model spinning at 5400RPM with 128MB cache. This is a traditional hard disk but solid-state drive options exist, and given that the platform is agnostic, it might be worth having an option with an empty enclosure.As expected the drive delivered a solid performance. Our test 10GB file was transferred in just under 95 seconds. In comparison, one of our fastest SSD alternatives, the G-Technology G-Drive, managed to do that in 33 seconds, almost three times faster.Other metrics are similarly underwhelming although understandable given the hardware used. Clearly, this particular model targets those who want to strike the right balance between performance and price with security in mind.SecureData’s SecureDrive BT uses a different encryption technique, separating the portion used to enter the unlocking key from the storage device itself. This method naturally comes with its pros and cons, but so do the other alternatives that rely on the host computer or on having a keypad on the USB device itself (like the Apricorn Aegis Padlock SSD).Ultimately, no encrypted storage device is totally foolproof as long as there is a human element involved – but at least this product makes things a bit more difficult as you have to unlock the phone first.The SecureDrive BT lacks a Type-C connector which might have improved its reliability (you can’t buy a flat-type USB cable in a corner shop), while the app fulfills its role as a control tower, but the drive’s performance is painfully slow if you’re used to SSD goodness.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}