{"id": "TechRadarHitFilm Pro review", "paragraph": "\n\n \n \n \n \n\nBy\nSteve Paris\n2018-10-24T14:52:01ZSoftware \nHitFilm Pro is a remarkable piece of software. Yes, the interface does feel clunky and antiquated, and it can chug along unless you have a truly powerful computer, but what it offers in terms of effects creation is truly impressive, making it hard to beat at that price pointFXhome’s HitFilm Pro is one of many video editing apps for Mac or PC fighting for your attention, and between the free software bundled with every PC and the behemoths used for professional video editing, it’s a hard segment to wedge yourself in. And wedge itself, it has.In a time where some software companies are considering going subscription only, and others have already embraced that business model wholeheartedly, it’s a pleasure to see a developer sticking to the traditional approach that you are actually purchasing a tool, while trying to offer the best advantage of the subscription-based model: getting updates as soon as they’re ready, rather than waiting for the next major revision number (and paying for the privilege).With that in mind, HitFilm Pro no longer advertises its own version, and the original purchase price includes free updates for a year. If you would like additional updates after that, you’ll have to pay for another year, but contrary to subscription software, if you choose not to, you can still use the tool you already paid for, for as long as you please, without giving the developer another penny.So what do you get for you money when you shell out this much? HitFilm Pro is an advanced video editing tool and compositor, which means you can cut a movie and apply effects to it (like colour correction or green screen), all within the same software package.The workspace on display is versatile enough so you can easily change the layout to suit your needs, adding, removing or reordering panels as you see fit.The interface is divided into two parts: although you can add effects and titles to your project, from simple letters appearing on screen to complex 3D animations, all from within HitFilm Pro, you can’t actually do it all while editing: in order to add some of those effects, you need to turn your clip into a composite shot, which prepares it for all manner of alterations that will be applied to it. This feels unnecessarily cumbersome, especially since many effects can be applied within the app’s editing section (those that can’t are greyed out and labelled “(layer only)”). It’s like something you used to have to deal with back in the 90s. Other editors have done away with such separation making for a more seamless experience, allowing you to simply focus on your editing, without having to work in a way that feels unnecessarily convoluted.Editing is as straightforward as you’d expectIt’s fair to say that this negative view comes from experience of other video editing programs. If you’re coming in fresh, you’ll be able to adapt quickly to this particular method of working and will easily enjoy all that HitFilm Pro has to offer.It’s easy to import your media, preview it, set in and out points, and insert clips into your project. Depending on your computer’s power, HitFilm has support for up to 8K video. The editing side has everything you’d expect, from standard tools like blade, slip, slide and roll, to navigating along your timeline, either by mouse, or keyboard (thanks to the newly implemented JKL shortcuts). You can animate pretty much any clip’s value, be it its basic properties (like size, position, opacity), or any effect you apply to it (or to the layer as a whole). There’s even a supplemental timeline section you can open up in the Controls panel to manually interact with all the keyframes you’ve created, allowing you to move them around, change their values, delete them, and even add new ones with ease.You can keyframe any parameter and easily animate it over time thanks to the control panel’s sub-timelineIt’s possible to manipulate the clips’ audio layers, and even apply some effects to them, but contrary to what HitFilm Pro offers in the way of visuals, your options there are pretty limited. The same also applies to transitions. Yes, you have the basic ones at your disposal, but little beyond that.Where HitFilm Pro truly shines however, is in the visual special effects department. This is this app’s biggest selling point, as it offers hundreds of effects and presets. You have access to masks, blue/green screen keying, particle simulators, distortion effects, powerful colour correction tools - the list is impressive.If you work in 3D, you can import 3D models into your scene, have access to tracking features, and there’s even a dedicated 360 degree viewer for those with the right recording equipment. Granted, these effects aren't as advanced as After Effects (little surprise considering the price difference), but on the plus side, HitFilm Pro is easier to use.In fact, FXhome is so invested with the compositing side of its software that the interface’s Home tab (the section that opens up when you launch HitFilm Pro) is dedicated to highlighting some of the tutorials they regularly publish, teaching you how to create a vast array of effects with its program. There's a wealth of effects at your disposal, not least of which a very versatile keying toolFantastic though this is, there is a drawback: you need a powerful computer to be able to render these effects - there are options to lower the quality of your creations during playback but if you want to truly see how everything looks in real time, you’ll have to render it first, and any changes you make after that will mean having to render it all over again. Each time.The Export tab is there when it’s time to share your work with others. You can choose to export the composites you’ve created, the entire project, or just specific sections of it, and apply any of the export presets available to you - any preset you’ve created yourself will be displayed in a separate folder to the built-in ones, making it easier to find the one you need. And best of all, these exports happen in the background, allowing you to keep on working on other parts of your project at the same time.If you’re really into applying visual effects to your projects, HitFilm Pro may well be the app for you.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}