{"id": "TechRadarApple Mac mini review", "paragraph": "\n\n \n \n \n \n\n\nBy\nMatt Hanson\n2018-11-08T16:31:51ZPC & Mac \nThe Apple Mac mini (2018) was a long time coming, but it’s been worth the wait. This brilliantly-designed small-form factor computer packs in some impressive specs and pulls off neat tricks to do so. It’s not cheap, but it’s priced very competitively compared to other small PCs, especially considering what it’s capable of.The new Apple Mac mini (2018) makes good on Apple’s promises that it hadn’t forgotten about its small-form factor Mac. Despite being fan favorites, the Mac mini hasn’t seen a decent update for four years now, but with the arrival of the new Mac mini, that’s all changed.On paper it looks like the long wait was worth it, with Apple claiming that the Mac mini (2018) is five times faster than the previous Mac mini. This performance increase comes by way of some impressive spec bumps including a maximum RAM limit of 64GB and up to a six-core processor.The Mac mini is also now being positioned as a tool for creators, with Apple claiming that it's 30 times faster at encoding HEVC video. It also has a bunch of ports on the back, and while there's just one HDMI port,  there are four Thunderbolt 3 USB-C ports to pick up the slack.So, has the wait for an updated Mac mini been worth it? We take Apple’s mini PC for a spin to find out.Here is the Apple Mac mini configuration sent to TechRadar for review:CPU: 3.6GHz Intel Core i3-8100 (quad-core, 4 threads, 6MB cache)Graphics: Intel UHD Graphics 630RAM: 8GB (2,666 MHz DDR4)Storage: 128GB PCIe SSDPorts: 4x Thunderbolt 3 (USB-C), 3.5mm headphone jack, 2x USB 3, HDMI 2.0, Gigabit EthernetConnectivity: 802.11ac Wi-F, Bluetooth 5.0Weight: 2.9 pounds (1.3kg)Size: 7.7 x 7.7 x 1.4 inches (19.7 x 19.7 x 3.6cm; W x D x H)This year's Apple Mac mini starts at $799 (£799, AU$1,249) and tops out at $1,099 (£1,099, AU$1,699) with the preset configurations. If you change any of the components, the price will also change, which gives you some flexibility when it comes to balancing power with budget.If you’re looking for a Mac to work on for creative applications, then this is certainly a more affordable device compared to the likes of the iMac Pro, which costs $4,999 (£4,899, AU$7,299) for the base model and is similarly geared towards creatives.More interested in the Mac mini as a small PC? Then the nearest rival is arguably the Intel Hades Canyon NUC, which is a powerful, yet barebones, mini PC that runs either Windows or Linux, and costs $999 (about £710, AU$1,302). That makes the price of the Apple Mac mini seem rather generous, especially when you consider you’ll need to buy storage, memory and an operating system separately for the NUC, which adds extra expense (though you don’t need to pay for Linux, obviously).Fans of the compact, no nonsense, designs of previous Mac minis will be pleased to learn that the new Mac mini pretty much keeps that intact, with the same small, square-ish metal design that measures 7.7 x 7.7 x 1.4 inches (19.7 x 19.7 x 3.6cm) and weighs slightly heavier than the last Mac mini at 2.9 pounds (1.3kg), compared to the older Mac mini’s weight of 2.6 pounds (1.19kg).Apple has made some subtle tweaks to the design, however, as it now comes in Space Gray to match the iMac Pro (which is now the only color option available), and Apple proudly states that the Mac mini contains 60% post-consumer plastic in certain parts (like the base), with the case made from 100% recycled aluminum.Apple has also managed the impressive feat of cramming more powerful hardware into the same compact dimensions thanks to a redesigned thermal architecture that includes a bigger fan, expanded vents and an overhauled power supply unit. The move to a PCIe solid state drive (SSD) for storage doesn’t just make the Mac mini faster, it means it runs cooler and quieter as well – essential for a small form-factor PC.Ports-wise the Apple Mac mini (2018) comes with four Thunderbolt 3 USB-C ports, an HDMI 2.0 port, two USB-A ports, audio jack and Gigabit Ethernet, along with a 10Gb Ethernet option. On the back corner there’s a power button and the increasingly rare (for Apple products, at least) 3.5mm headphone jack as well.All these ports are kept at the back of the Mac mini for a clean look, which keeps wires from sprawling all over the place.With just one HDMI port, you're going to have to either upgrade to a Thunderbolt 3 monitor or make do with an adapter if you want to plug in more than one monitor. Considering the Mac Mini is built as a creator's tool, multiple monitors are often a must, so many people will have to buy extra accessories.The good news is that with Thunderbolt 3 you'll be able to run two 4K displays at once, and you'll still have two ports left over – maybe one for an external graphics card solution, which the Apple Mac mini (2018) supports. As per usual, the keyboard and mouse aren't included, so there's another two accessory to factor in to the overall price.As is also usual with Apple’s products, it’s not easily upgradable, unlike mini PCs like the Intel NUC or Zotac ZBox range. This means that when the Mac mini starts showing its age, you’re not going to be able to easily open it up and add in more powerful components – aside from the memory. For anyone coming from a PC background where upgradability is essential, this will be frustrating, but for anyone used to Apple’s way of doing things, it won’t be too surprising.There’s also a few things Apple has done to mitigate the user’s inability to upgrade easily. First of all, you’re able to configure the Apple Mac mini (2018) quite extensively, allowing you to upgrade various components before you buy, ensuring you get a Mac mini that best suits your needs and budget.It’s also worth noting that thanks to the modern technology in the Apple Mac mini, you should hopefully not feel the need to upgrade for a while yet. And, considering the gap between Mac mini releases these days, that may be for the best.Overall, we’re pleased that Apple has maintained the small size of the Mac mini while filling it with more powerful components and plenty of ports, though creatives that want multiple monitors may need to think carefully thanks to the single HDMI port, and lack of any DisplayPorts.The Space Gray color looks great, as it does on other Apple products, and the 100% recycled aluminium case is a welcome move, which also keeps the Mac mini feeling sturdy and robust.Here’s how the Apple Mac mini (2018) performed in our suite of benchmark tests:Cinebench CPU: 587 points;Graphics: 40.75 fpsGeekbench 4 Single-Core: 4,733;Multi-Core: 14,447The Mac mini runs with desktop-grade 8th generation Intel Core processors in quad- and hexa-core iterations, so we had high hopes for its computing power. According to Apple, its new square-shaped desktop delivers five times the amount of performance over its predecessor.With the Apple Mac mini being aimed at creatives, which usually rely on intensive software applications and editing large files, the Apple Mac mini (2018), more so than previous versions, needs to be able to keep pace.The choice of quad- and hexa-core 8th gen Intel Core processors with Turbo Boost Speeds of up to 4.6GHz, and support for up to 64GB of 2,666 MHz memory (which is four times the maximum amount the Mac mini 2014 could handle) will definitely keep the Apple Mac mini feeling fast and responsive for most tasks, and allows it to handle multiple tasks at once thanks to the generous helpings of RAM.The latest Mac mini comes with the Apple T2 security chip, which comes with an SSD controller with on-the-fly data encryption for \"industry-leading security\". The T2 chip also features HEVC video transcoding that's up to 30 times faster, which will be great news for video editors who are interested in using an Apple Mac mini for their creative work.The only place the Apple Mac mini (2018) is let down, specs wise, is with the Intel UHD 630 integrated graphics. We would have much rather seen some form of discrete graphics, and anyone using the Apple Mac mini for graphically-intensive creative work, such as video editing and 3D modelling, may find the integrated graphics a bit limiting. However, those looking for a boost in performance on this front can always plug in an eGPU.We got to see how flexible the Mac mini (2018) is with a Black Magic eGPU plugged in. Editing raw 4K video files and adding effects on the fly in Final Cut was impressively smooth for such a diminutive machine. Of course, the external graphic card was doing a lot of heavy lifting, but it was a good indication of how the new Mac mini can be used in creative work.Apple also showed us an interesting setup where a single Mac mini (2018) was connected via a network switch to a network cluster of five Mac minis (piled on top of each other). By putting the 10Gb Ethernet port on the Mac mini (if you choose that option when purchasing the Mac mini) to good use, we saw how you can offload intensive processes (such as rendering video) to these other Mac minis. The process of doing this is impressively simple in Final Cut, where it was a matter of opening up a menu and selecting the attached Mac minis.Once done, the tasks were completed by the other Mac minis, while the main one could still be used for working on without any noticeable impact to performance. Perhaps most impressively, the stack of five Mac minis remained pretty much silent, even when working on those intensive tasks. For anyone who has used multiple PCs at once on complex projects and had to put up with the sound of fans blasting off, this will be a welcome solution.Of course, there won’t be many people who will be using a pile of Mac minis like that, but it’s a good demonstration of how versatile the new Mac mini is.In our day-to-day use we were really impressed with the new Mac mini, which felt fast and responsive when running macOS 10.14 Mojave. Apps opened and closed  instantaneously, and even more challenging processes, such as video transcoding, was accomplished quickly – and silently as well.What we really like about this new Mac mini is that Apple has produced a powerful and versatile mini PC that’s compact enough to be easily carried around, or hidden out of view behind a display.In our benchmark tests, the Mac mini doesn’t hit the highs of professional-grade Apple devices such as the MacBook Pro or iMac Pro, but it still performs very well, especially in the multi-core tests thanks to that quad-core Intel processor. If you go for the Mac mini configuration with a hexa-core processor, expect even better results.It’s also worth remembering that the Mac mini is a fair bit less expensive than either of those other devices, even when you factor in the fact that you need a monitor, mouse and keyboard for the Mac mini.Compared to the previous generation of Mac mini, there’s no competition: this year’s Mac mini blows it out of the water, performance-wise. If you love your Mac mini and have been waiting for an upgrade, then you’re going to be very pleased with the new Mac mini.Many of us had been hoping that Apple would release an updated version of the popular Mac mini for years now, so we were excited when the Cupertino company finally announced the new Mac mini earlier this year. However, this isn’t just an afterthought, or a quick and dirty update to keep the more vocal Mac mini fanatics quiet.Instead, we’ve got a hugely overhauled Mac mini that in some ways goes way beyond what we had been hoping for. This is a very accomplished little machine that packs some brilliant modern features and components for a level of performance that puts many other small form-factor PCs to shame.Apple has acknowledged that the computing landscape has changed since the last Mac mini was released. Back then, the Mac mini was designed with casual users in mind, as well as an accessible device to win over people from Windows.With the rise of laptops, and with the entry level MacBook now acting as that crossover device, Apple has pitched the Mac mini towards creatives and professionals. That might sound crazy, but you know what? It works. This is a brilliant little machine in its own right, but paired with an eGPU (or even a few extra Mac minis) and you’ve got a powerful machine for heavy-duty tasks. By being scalable in this way, as well as allowing you to use your own monitor and peripherals, you’ve got a very flexible device.It’s also very competitively priced compared to other small form factor computers that offer similar levels of performance. We’ve been waiting a long time for an updated Mac mini, but in our view it has definitely been worth the wait.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}