{"id": "TechRadariPad Pro bend tests show you need to be gentle with your tablet", "paragraph": "\nBy\nDavid Nield\n2018-11-17T14:30:43Z\n\nTablets\n \n\nIt's simple physics that a large 10-inch tablet is going to be easier to snap than a small 5-inch phone, but thanks to a YouTube bend test and several user complaints it seems the new iPad Pros might be a little more prone to bending than anyone would like.First up is the YouTube video from JerryRigEverything, which shows the 11-inch iPad Pro getting snapped in half with a certain amount of force – is it a reasonable amount? We'll let you decide. The iPad Pro in the clip goes through a number of other scratch and structural tests too, leaving it in a very sorry looking state at the end.Perhaps more significantly, a small number of users on the MacRumors forums are saying their iPad Pros are becoming misshapen from a normal amount of use – being carried in a backpack, typically. Apple has replaced the affected units though.It's too early to say whether the new iPad Pros are any easier to snap or bend than their predecessors – a device this shape is always going to be susceptible to deliberate attempts to bend it, and most iPad Pro owners are reporting no problems with bending.At the same time we do know that the new tablets are thinner than ever before (just 5.9 mm or 0.23 inches) – by making the devices so slim, Apple may have made them easier to break too. The lesson is to take good care of your new iPad Pro, something we hope you were doing anyway.If you are noticing a bend in your iPad Pro, take it into an Apple Store and get some expert advice on whether you can get it replaced as a defective unit. We'll be keeping an eye out for any more reports of Apple tablets bending more easily than they really should be.Via The VergeGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}