{"id": "TechRadar proTim Cook praises GDPR, warns about \"weaponised data\"", "paragraph": "\nBy\nMike Moore\n2018-10-24T14:32:40Z\n\nInternet\n \n\nApple CEO Tim Cook has called for greater regulation and protection of how data is collected and utilised by organisations across the world.Speaking at an event in Brussels today, Cook praised the effect that GDPR is having since its introduction back in May, but warned that more still needs to be done in order to halt the effect of \"weaponised\" data.Hailing the \"successful implementation\" of GDPR, Cook said it was time for the rest of the world to follow the EU's lead in introducing similar legislation, noting that, \"we at Apple are in full support of a comprehensive federal privacy law in the United States.”In a later tweet expanding on his speech, Cook added that, \"GDPR has shown us all that good policy and political will can come together to protect the rights of everyone.\"The Apple chief also called for new digital privacy laws in the US to protect against such unsanctioned data collection, which he says is harming everyday society as we know it, creating a, \"data industrial complex\" where, \"our own information, from the everyday to the deeply personal, is being weaponized against us with military efficiency.\"“These scraps of data...each one harmless enough on its own...are carefully assembled, synthesized, traded, and sold,\" he noted.“Platforms and algorithms that promised to improve our lives can actually magnify our worst human tendencies,” Cook said.“Rogue actors and even governments have taken advantage of user trust to deepen divisions, incite violence, and even undermine our shared sense of what is true and what is false. This crisis is real. It is not imagined, or exaggerated, or crazy.”“Users should always know what data is being collected and what it is being collected for,” he added. “This is the only way to empower users to decide what collection is legitimate and what isn’t. Anything less is a sham.”Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}