{"id": "TechRadarBritish companies warned against implanting NFC chips in their staff", "paragraph": "\nBy\nCat Ellis\n2018-11-12T11:09:33Z\n\nFuture tech\n \n\nThe UK's main trade union body has warned employers against microchipping their staff to improve security. According to The Guardian, The Confederation of British Industry (CBI) has expressed alarm about a small but growing market selling contactless implants to employers in the name of security and convenience.\"While technology is changing the way we work, this makes for distinctly uncomfortable reading,\" a spokesperson said. \"Firms should be concentrating on rather more immediate priorities and focusing on engaging their employees.\"British company BioTeq sells and installs medical-grade NFC and RFID chips. According to CEO Steven Northam, BioTeq has already sold 150 implants in the UK. Most of these have been to individuals, but some financial and engineering companies have had their staff chipped.The chips are inserted in the flesh between the thumb and forefinger, and enable people to open doors and start cars with a wave of their hand. They can also be used to store important medical information. Northam himself has been fitted with a chip, as have all BioTeq's directors.Another similar firm, Biohax of Sweden, told The Sunday Telegraph that it's speaking to several British legal and financial firms about fitting employees with microchips, including one with hundreds of thousands of staff.\"These companies have sensitive documents they are dealing with,\" said Jowan Österlund, the founder of Biohax. \"[The chips] would allow them to set restrictions for whoever.\"Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}