{"id": "TechRadar proMicrosoft: The future of security is AI", "paragraph": "\nBy\nMike Moore\n2018-11-12T16:24:48Z\n\nSecurity software\n \n\nWith AI becoming an increasingly common presence in many areas of work and business, it’s perhaps unsurprising that the security industry is also getting on board.Both AI and Machine Learning technology can have a profound effect on the work of security experts, helping streamline processes and crunch huge mountains of data to help protect businesses of all sizes.But how do you ensure that your organisation is grasping the potential of AI-powered security, and select the correct provider?\"To make AI and machine learning work you need big data, computing at scale and the right sort of software - and we have all of that,” Microsoft’s UK chief security advisor Sian John told TechRadar Pro at the company’s recent Future Decoded event in London.\"Microsoft has the strongest security culture of anywhere I've worked...we're the outside-in organisation.”Microsoft has an enviable network of over a billion connected devices spread around the globe, feeding information and analysis to the company in order to help it stay abreast of all the latest threats.The company has offered its Secure Score tool for some time, allowing customers to analyse just how secure their protections are, all powered by the AI services with Office 365 and Azure.Microsoft also looks to work with its partners and customers to analyse specific needs which can then be addressed on a case-by-case basis, allowing users to tailor the company’s services into their company structure as needed.\"Across everything we're doing in security, machine learning and behavioural detection is at the absolute core,” John notes.TechRadar Pro spoke to John after Microsoft CEO Satya Nadella had given a passionate speech (pictured above) on the theme of “tech intensity” impacting the speed of digital transformation, and she agreed that security has a crucial part to play in this process.Nadella has said that AI will be “the defining technology of our time”, and that privacy is a human right, highlighting the heightened importance Microsoft is placing on its security practice.John notes that even for a company the size of Microsoft, the need to demonstrate what its platforms can do to help secure organisations of all sizes is paramount.“We have all this capability - now it's about helping organisations to make use of it,” she adds. “You see it in the organisations that are doing really well - you'll see that their security teams are really innovative and engaged.”“That's the really exciting thing about our industry as a cybersecurity person, the fact that  everyone's going through that change.”“That's one of our main challenges - you have the tech, you have the capability, but how do you make it easy to engage with and operate?\"Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}