{"id": "TechRadarOnePlus 6T India price announced a day after the global launch", "paragraph": "\nBy\nSudhanshu Singh\n2018-10-30T16:22:11Z\n\nMobile phones\n \n\nOnePlus has launched the OnePlus 6T in India. At the OnePlus 6T launch event in New Delhi, OnePlus announced that their latest smartphone will go on sale from November 1 and will be available exclusively on Amazon.in and OnePlus store. The smartphone was first unveiled yesterday in New York, and the OnePlus 6T starts at $549 for the 128GB/6GB variant in the US. OnePlus 6T, as the name suggests, is an upgrade to the OnePlus 6. For those unaware, it’s not the first time when the company has launched a ‘T’ variant of the phone. Soon after the OnePlus 3 launch, the company has been following a six-month cycle for every phone launch after. The company says the ‘T’ variant is to make sure that OnePlus phones are at par with the technological trends and in the best possible way. While the OnePlus 6 is still a great value for money, the OnePlus 6T brings some extras to offer with minor compromises. As the leaks suggested, it gets an in-display fingerprint sensor, a smaller notch, and a bigger battery. What’s missing this time is the headphone jack, that has to be dumped in favor of a bigger battery and “screen unlock”.The OnePlus 6T has a slightly bigger 6.41-inch full HD OLED display than the OnePlus 6. It’s also the first OnePlus phone to have an in-display fingerprint sensor touted as the ‘Screen Unlock’. OnePlus claims they’ve started testing the technology on the OnePlus 5T last year, but they waited for it to be in the best possible shape before putting them into their devices. They further claim that their version on screen unlock is the fastest performing implementation of the technology yet. Another welcome addition is a 3700mAh battery, which is a 23% bump over the 3300mAh on the predecessor. The OnePlus 6 offers a promising battery life already, so it’s fair to expect the 6T to last a day with ease. To accommodate a bigger battery, OnePlus has ditched the 3.5mm jack this time. Which also means that OnePlus 6 might be the last OnePlus phone to have a 3.5mm jack. The company is bundling a USB Type-C port to 3.5mm adapter in the box. Also, OnePlus sells their Type-C and Wireless Bullets headphones separately. The OnePlus 6T retains the optics of its predecessor, which is a 16MP and 20MP sensors and an aperture of f/1.7 for the primary lens. There’s also a new Nightscape mode in the camera for better low-light photography. The nightscape mode is preset of how we usually tune our cameras in the pro mode. It lowers the ISO and the shutter speed aided by AI for stability. Further, there’s a new Studio Lighting feature developed in collaboration with photographer Kevin Abosch to enhance portraits. The hardware inside the phone remains the same as on the OnePlus 6. However, the 6T ships with the latest Android 9.0 Pie running OxygenOS on top.The OnePlus 6T will be available in two color variants - Midnight Black and Mirror Black. It goes on sale from November 1 on Amazon.in and OnePlus store along with being available in Reliance Digital and Croma stores across India. .The 6GB RAM/128GB storage variant is priced at Rs 37,999, 8/128 variant for Rs 41,999 and the high-end 8/256 for Rs 45,999.The Type-C Bullets will cost Rs 1490. The OnePlus Explorer backpack will be available later on invite basis at Rs 4,990.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}