{"id": "TechRadar proEliminating work about work with team tools", "paragraph": "\nBy\nAnthony Spadafora\n2018-11-02T14:30:03Z\n\nSoftware\n \n\nIn today’s digital age, employees are finding it even easier to work together and collaborate on projects using the cloud and other online productivity tools. However, how do businesses effectively manage team projects and tasks in such a way that nothing falls through the cracks?The work management platform for teams, Asana is helping businesses get organised and stay on track so that all of their deadlines are met. The company recently announced a suite of new features, including Portfolios and Workload as part of its new product offering, Asana Business. TechRadar Pro sat down with Asana’s Head of Product Alex Hood to learn more about its latest offering and how the company is helping teams work together.40% of UK employees spend most of their day in meetings, tracking down or organising information, or updating others on status, as opposed to doing their actual work and moving projects forward -  we call this ‘work about work’. At Asana, we’re focused on eliminating work about work. We do this by acting as the GPS for your organization - ensuring that everyone knows the plan of record and is updated as each piece comes together. We know that the best teams have clarity of purpose, plan and responsibility. Work about work is what happens when these elements are absent and teams fail to achieve what they’re capable of. We believe Asana is the missing piece of the collaboration puzzle. Organizations that previously relied on email or messaging, along with documents and spreadsheets, discover new levels of efficiency and clarity when they add Asana to plan and execute projects. Teams using Asana report far fewer status meetings, email updates and outdated spreadsheet plans, and have much more time to perform actual work.We now have 50,000 paying customers including Spotify, Tesco, Sky News and London’s National Gallery, who use Asana to provide clarity on who is doing what by when – at every level of an organisation. It’s also used across every functional department in a company including marketing, design, product, operations, HR, IT and more.Just last week, we were recognized as a Leader in the “Work Management” category by Forrester Research. We see so many companies that are still using email and spreadsheets as the foundation for their planning and we think there’s an incredible opportunity for companies to invest in happier, more productive teams by eliminating the work about work.  Starting today, we’re introducing Asana Business, including our new Portfolios feature. In addition, we’ll be launching Asana Business’ Workload feature in early 2019. With the introductions of Portfolios and Workload in Asana Business, we’re enabling organizations to spend less time planning and executing multiple projects at once.Think of Portfolio as the mission control for your most important initiatives, from strategy to execution. The leaders we hear from need a seamless way to understand how execution is tracking at a high level. They also crave the ability to delve into more detail instantly. Portfolios in Asana satisfies both of these needs. After seeing the top-level health of your initiatives, you can drill down and re-prioritise work and then report on progress and resource needs to key audiences. Whether you’re a CEO setting company objectives or a marketer managing global campaigns, Portfolios helps to keep projects on track so you can achieve your goals.We’re all familiar with the problem of work not being optimally distributed across teams which can ultimately hinder productivity. Workload solves these problems by ensuring that tasks and assignments are balanced across your team, taking into account your organization’s own unique talent bench and a task’s complexity. This reimagined take on resource management connects actual work, skill sets and schedules, resulting in the right people working on the right project at the right time. Workload is currently in development and will be available early next year. Asana originated from the idea that working together should be effortless.  In just this year alone, we’ve introduced a number of innovations that are enabling companies of all sizes to be more agile, including a Timeline feature which gives teams new ways to visualize their work and product integrations with Slack and Outlook. We believe that we can be the GPS of an organization - particularly for companies moving through their own digital transformation. As we’ve seen from the accelerated growth of our category, and our own 90% year-over-year revenue growth rate, it’s an exciting time to reimagine how companies are orienting around collaboration and productivity, and I believe that the product we’re delivering at Asana place us at the forefront of the future of work. I’m most excited about what we can achieve with features like Workload. We know that each person has unique and variable skills, interests and schedules. Taking these factors into account, Workload allows team leads to see who is doing what and optimises resources based on human attributes. We envision a future where every team member is completing the work they’re best suited to based on the data that Workload provides. The outcome? Happier teams achieving their very best results.  Alex Hood, Head of Product at AsanaTechradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}