{"id": "TechRadarA redesigned VW Jetta now remembers everything about you", "paragraph": "\nBy\nJohn Brandon\n2018-11-12T14:29:50Z\n\nCar tech\n \n\nPhoto credit: Josiah BondyCars that remember who you are have been around for a while. The problem is, what they can remember is fairly limited, and they tend to have short memories.On most modern cars, there’s typically a setting to remember your seat position and, if you’re lucky, a few other options like the steering wheel position. It’s about as low-tech as you can get.There are often three buttons, and you can press and hold the Set button to remember the settings. Then, depending on the driver using the vehicle, you can quickly press one of the buttons to make those adjustments quickly. Sadly, anyone else can reprogram this.After testing the 2019 VW Jetta, a sporty and turbo-charged model called the R-Line that costs $22,995 (about £18,000, AU$32,000 - a more basic model costs $18,545, about £14,000, AU$26,000), it was obvious this rudimentary memory setting had seen better days. In fact, GMC also introduced similar personalization features in the 2019 Terrain, so more to come on that one. On the Jetta, the customizations are now tied to your individual key, and it’s quite impressive how many things you can tweak.For starters, you can save the seat position - that’s a no brainer, but it’s handy how it all works. When you make changes to the seat, the settings are saved when you lock the vehicle. The Jetta also remembers far more detailed settings, including the temperature you set and ventilation level, whether you have activated the Adaptive Cruise Control, and even seemingly minor things like where unlocking the doors unlocks only the driver's door or all doors.I was also impressed that the Jetta can remember your preference for driving mode. In my case, I always activate sport mode if every car to test out the suspension and handling, but knowing the key will save that setting means I don’t have to remember to do it.Photo credit: Josiah Bondy Surprisingly, it goes even deeper. One setting has to do with the turn signal. You can configure the personalization for your key to use a three-blink turn signal all in quick succession or one that just blinks normally. This gives you the sense that you have really made the Jetta 'your car' with all of the tweaks and customizations you like, rather than the ones an engineer likes.“Personalization helps the driver because they won’t be distracted by having to play with radio stations and other settings that are tailored to someone else,” says Daniel Shapiro, a product manager for the VW Jetta. “Everything is set up just the way the customer is used to, even if they are not the primary driver. It’s not always regarded as a driver assistance feature, but it does ease the process of getting from A to B.”As usual, I started thinking about how this could go even further. In the future, cars will know us even more, interpreting little things like how we like to drive. Say you normally slow down for corners on the highway.Some cars do this automatically with cruise control enabled, but maybe you’d like to slow down even more. Even minor driver preferences - that you like to pull away slowly from a stop sign, so resuming into cruise control will work the same way - will give us the impression we can adjust a car as much as we adjust our phones and laptops.Photo credit: Josiah Bondy AI in cars is still in an early stage, even if you believe everything Tesla reps tell you. Some day, cars will know which songs we like and offer to play them. They will understand things like how we usually like to drive on curvy routes, and suggest taking a specific route - whether we have GPS enabled or not. They will remember all of the settings we make, but also go the next step of watching how we drive, what we do when were driving, and much more.And, beyond that, autonomous cars will interpret our actions and preferences, knowing when to read an incoming message to us or suggest a nearby seafood restaurant, or to let us take a nap.It’s coming, and I’m impressed with how VW is helping to usher in these kinds of customizations, The more the car knows us know, the better it will be when the car starts driving us.On The Road is TechRadar's regular look at the futuristic tech in today's hottest cars. John Brandon, a journalist who's been writing about cars for 12 years, puts a new car and its cutting-edge tech through the paces every week. One goal: To find out which new technologies will lead us to fully driverless cars. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}