{"id": "TechRadar proApple 'searches' for wireless chip engineers in Qualcomm's San Diego ", "paragraph": "\nBy\nSteve McCaskill\n2018-11-16T14:57:31Z\n\nMobile phones\n \n\nApple is recruiting chip designers in the San Diego, fuelling speculation that the company is looking to snare talent away from Qualcomm whose headquarters are located in the city.Bloomberg reports that Apple has published 10 job listings on its website, seeking engineers with experience in standards such as LTE, Bluetooth and 5G. This would appear to suggest Apple is looking to produce its own wireless chips for the iPhone, rather than rely on external suppliers.In the decade since the original iPhone launched, Apple has produced more components in-house. It designs its own processors, giving more control over cost, development and timelines. This allows the firm to differentiate against Android manufacturers who source from a pool of suppliers.Earlier this year, Apple moved to bring power management chips under its own control with the $600 million acquisition of part of Dialog Semicondcutor’s business, a transaction which included staff and facilities.But although Apple has created its own wireless components for the Apple Watch and AirPods it has never done so for the iPhone.Qualcomm’s modem technology has been used in several iterations of the iPhone, but since the iPhone 7, Apple has diversified its supplier base, using Intel chips in some handsets. Qualcomm’s modems were not used at all in the iPhone XS, XS Max and XR.Adding further intrigue is the fact that Apple and Qualcomm are engaged in a wide-ranging legal battle. Qualcomm has claimed Apple has violated its patents, while Apple says Qualcomm is abusing its dominant position in the market and charging extortionate fees.If Apple was to open a new facility in San Diego, it would simultaneously boost its own wireless efforts whilst damaging Qualcomm’s chances of once again becoming a supplier to the iPhone.It is a tactic Apple has deployed in many parts of the world. For example, it has hired engineers in Oregon and in Israel, both of which are home to Intel chip-making operations.In 2017, Apple announced it planned to stop including UK chip manufacturer Imagination Technologies’ graphics technology in favour of an alternative developed in-house.As Apple was Imagination’s largest customer, accounting for half of its annual revenue, the company’s survival was called into question as its share price fell by 70 per cent. This made it an easy takeover target with some suggesting Apple might be interested.Instead, the chipmaker was sold to a Chinese private equity firm and Apple established an office just a few miles away from Imagination’s headquarters in St Albans.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}