{"id": "TechRadar proOnline SMBs aggressively targeted by fraudsters", "paragraph": "\nBy\nAnthony Spadafora\n2018-10-24T18:00:49Z\n\nInternet\n \n\nNew research from global payments provider Paysafe has revealed that more than half (52%) of online SMBs globally worry that the move to frictionless payments is leaving them more open to fraud.The firm's latest research report, entitled 'Lost in Transaction: The Future of Payments for SMBs', investigates the attitudes of online SMBs in the UK, US, Canada, Germany and Austria on the evolution of payment types. While global SMBs worry that frictionless payments could leave them open to fraud, these concerns are heightened in the UK where 66 per cent of SMBs believe they are being more aggressively targeted by fraudsters now then compared to the same time period last year and 43 per cent consider card fraud an interesting challenge.Growing concerns over fraud have led SMBs to now view security as the most important factor when considering their e-commerce setup. Security (59%) ranks above reliability (49%) globally and also comes ahead of cost (47%) and ease of transactions including refunds (40%).SMBs have become increasingly worried that these concerns could hamper the buyer journey for consumers. In the UK, 62 per cent of SMBs believe that longer verification processes during the payment stage could cause them to lose consumers with 65 per cent admitting they don't know how to balance security and an acceptable customer experience.Abandoned transactions are also posing a problem for online SMBs with 9 per cent of purchases not being completed. However, 28 per cent believe this reflects successful fraud checks while 33 per cent say that abandoned transactions have a major impact on business performance. It is also worth noting that 15 per cent believe that purchases are abandoned as a direct result of a lack of payment options during the checkout phase.In terms of payment options, 65 per cent of UK merchants believe offering multiple choices is essential and 79 per cent plan to introduce new payment methods in the next two years. Credit cards and debit cards remain the standard (offered by 87% and 93% of online merchants respectively) while 44 per cent currently accept digital wallets and 22 per cent are looking to adopt them over the next 24 months.At the same time 63 per cent believe accepting prepaid cards gives access to new customers and 28 per cent say they will offer online cash replacements in response to consumer demand and to service the unbanked in the next two years.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}