{"id": "TechRadarMobvoi TicWatch C2, the sequel to the company's first ever smartwatch, is here", "paragraph": "\nBy\nJames Peckham\n2018-10-24T18:00:00Z\n\nWearables\n \n\nThe TicWatch brand has expanded again with a new watch from Mobvoi called the TicWatch C2 that sports a stainless steel front, Wear OS software and Google Pay.Mobvoi's TicWatch C2 is intended as a follow-up to the original watch that launched in China as the TicWatch and the rest of the world as the TicWatch 2 back in 2016.The C2 comes in two different sizes with a 20mm version that's 13.1mm thick and a smaller 18mm watch that's 12.8mm thick. The smaller version comes in rose gold, while you've got the choice of black or silver for the larger watch.Both have stainless steel fronts and edges, but the rear of each watch is plastic. Each comes with a leather strap and you can swap out for your own 20mm or 18mm watch straps if you're not a fan of the design or material.There's a 1.3-inch AMOLED touchscreen display that sports a 360 x 360 resolution.Each design is also waterproof at IP68, but Mobvoi doesn't recommend taking these watches in a pool.  The latest version of Wear OS software will come preloaded, and it'll work with devices running Android 4.4 or iOS 9.3 and higher software.Fitness features include step tracking, heart rate tracking and it also comes with GPS too, plus there's Google Pay for when you need to grab a bottle of water mid-way through your run. The battery inside is a 400mAh cell, and Mobvoi believes this should give you two days of usage.The watch is powered by the Qualcomm Snapdragon Wear 2100 chipset, so you're not getting the most up to date power as there's already the Snapdragon Wear 3100 being used in some other smartwatches. You can pre-order the Mobvoi TicWatch C2 now from the manufacturers official website, but the watch won't be ready to launch until December 6. It's set to cost  $199.99 / £179.99 / AU$299. The company also just announced that you can buy the new TicPods Free headphones now. Be sure to read our full TicPods Free review if you're interested in a new pair of true wireless headphones.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}