{"id": "TechRadarNintendo and Sony tussle for top-selling console in 2018", "paragraph": "\nBy\nNick Pino\n2018-10-30T20:24:54Z\n\nGaming\n \n\nThe holiday sales period is always a tumultuous time for Sony, Microsoft and Nintendo - but, according to recent quarterly financial reports, it could be even more chaotic than we initially predicted, with Nintendo optimistically predicting that it will sell upwards of 15 million new Nintendo Switch consoles before March 2019. The reports put out by the pair of console purveyors put Nintendo Switch at 22 million consoles sold to date, with just over 5 million units sold in the last six months. Sony, on the other hand, approaching the 100 million unit mark with 86 million PS4 consoles (including the PS4 Pro) sold to date. Should Sony cross that 100 million mark, the PS4 will be one of the company’s best-selling systems - ahead of the PS3 (80 million consoles sold) and original PlayStation (102 million consoles old). That said, Nintendo Switch is already ahead of its predecessors, the Nintendo GameCube and Nintendo Wii U, which only sold 21 million and 13 million units, respectively.While Sony is holding the higher ground in terms of total consoles sold overall, it could be a competitive Black Friday and a dead-sprint to see who can sell more consoles before the end of the financial year that closes in March. While Sony expects to sell 17.5 million units before year's end, Nintendo is trying to be a bit more ambitious - selling 15 million consoles in the next three months is no small feat. For reference, Nintendo sold only 7 million units this time last year.This year, Nintendo is banking on a slew of upcoming titles and bundles will help push more consoles out the door: Pokemon Let's Go, Pikachu! and Let's Go, Eevee! will be available on November 16 and Super Smash Bros Ultimate is out on December 7 2018. The latter will miss out on the two biggest sale days of the year (Black Friday and Cyber Monday 2018) but the game's popularity might help Nintendo keep the momentum going strong into 2019.Will the Big N can be the number-one console seller in the world this year? We'll just have to wait to find out.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}