{"id": "TechRadar proThe death of net neutrality and the rise of VPNs", "paragraph": "\nBy\nAriel Hochstadt\n2018-10-24T14:30:32Z\n\nVPN\n \n\nWith the coroner officially declaring Net Neutrality dead back in June, (at least as far as the FCC is concerned), the average user is no longer protected from Internet throttling. ISP’s can now slow down consumers’ Internet access without restriction, meaning all users streaming Netflix or YouTube videos could suddenly find their Internet “throttled” by their ISP, impacting the speed of downloads or ability to watch in higher resolutions, to incentivize the paid prioritization models many are expecting.In the new Internet age ushered in by Ajit Pai and the FCC, consumers are at a severe disadvantage, and ultimately at the mercy of their providers. Under the new rules, consumers could find  their favorite content – especially videos– slow to a crawl, as slow as your cell phone internet after you’ve “run out of data” for the month. Of course, ISPs will offer to fix that – for a price. Which seems unfair, since they are already charging consumers for their services.While it has not happened yet, the potential for this type of reality is certainly possible as the repeal of net neutrality means ISPs are free to do whatever they wish with regards to our internet (and they don’t even owe us any explanations because it would be totally legal). Given this possibility, consumers need a way to balance the asymmetric relationship they now share with their service providers. Enter the VPN, the simple tool that could prove to be the solution to ISP throttling. By keeping the content a user is accessing away from the prying eyes of the ISP, users can practically guarantee themselves a smooth, satisfying – and even speedy – content experience at the their favorite sites.VPNs mask the online activity of those who use them by encrypting web traffic, thus preventing ISPs (or anyone else) from seeing where a user is connecting to. If ISPs don't recognize a user's activity to a site, they can't “regulate” their traffic to that site. Thus when they connect to the sites ISPs are targeting for throttling, they get in “under the wire,” and are able to surf, watch, and interact with any site without experiencing a slowdown.But won't ISPs still notice that a customer is still using a great deal of bandwidth? Even if they can't see that a user has connected to a specific “heavy content” site that would be on their list of “regulated sites” (Netflix, for example, is probably on that list), the large amount of bandwidth is likely to set off an alarm. Fortunately, many VPNs can compress data downloaded from a site, lowering data consumption rates – and better concealing from the ISP that a user is bypassing their throttling protocols. Other benefits of VPN-encrypted connections include blocking ads, and enabling users to get around geographic restrictions, which prevents content from being seen in certain countries.Of course, some VPNs are better than others; criteria for deciding on which ones to use depends on how many servers a service has, where the servers are located, how robust the servers are, etc. Good VPNs use high-security encryption tools, like Internet protocol security protocol (IPSec) and its associated tools, including Security associations (SA), Internet key exchange (IKE), Perfect forward secrecy (PFS), Authentication header (AH) and all the other backend security technologies that are deployed to keep consumers a step ahead ISPs, while the free VPN’s may simply provide the bare minimum and become less relevant fairly quickly as ISPs adapt.Consumers need to do some research before deciding (NordVPN, ExpressVPN and Hotspot Shield have been the market leaders over the past year). But the principle holds; ISPs do not provide their services for free, but consumers deserve choice in their surfing habits and should not let their providers slow down their surfing “for the greater good” of internet bandwidth. If users access their favorite sites via VPNs, they can avoid throttling issues – and get “full service” from the sites they want, not the ones ISPs want to direct them to.The repeal of net neutrality has indeed delivered consumers a new problem to contend with, and as usual, it is up to consumers to safeguard their own interests – to ensure they get what they want as the two forces duke it out. With VPNs, will be able to tip the balance of power in this now asymmetric relationship back in their favor and avoid getting caught up in the economics or politics of the players involved in this bandwidth battle.Ariel Hochstadt is cofounder of vpnMentor Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}