{"id": "TechRadarPNY GeForce RTX 2080 Ti XLR8 Gaming Overclocked Edition review", "paragraph": "\n\n \n \n \n \n\nBy\nKevin Lee\n2018-11-02T20:04:54ZGraphics cards \nThe PNY GeForce RTX 2080 Ti XLR8 Gaming Overclocked Edition is an overclockers dream, but this GPU is too expensive to just use at stock settings.With Nvidia’s Founders Edition graphics cards now featuring dual fans and factory overclocks of their own, it can be tough for third-party GPU to stand out. That's especially true of PNY GeForce RTX 2080 Ti XLR8 Gaming Overclocked Edition.  PNY’s premium version of the extremely capable GeForce RTX 2080 Ti undoubtedly runs cooler and a tick faster than Nvidia’s own version. Unfortunately, outside of incredibly overclocking potential, these small improvements make it hard to justify its noticeably higher price. If you thought the Founders Edition version of the GeForce RTX 2080 Ti was setting the high bar for pricing at $1,199 (£1,099, AU$1,899), the PNY GeForce RTX 2080 Ti XLR8 Gaming Overclocked Edition comes priced at an even higher $1,399 or £1,329 (about AU$1,950) price. At this point, we’re well above doubling the price of the last generation Nvidia GTX 1080 Ti Founders Edition that went for $699 (£669, AU$1,129) – and even higher than the $1,199 (£1,149, AU$1,950) Nvidia Titan Xp. What demands such a high price you might ask? Well not a lot on paper, unfortunately.  The PNY GeForce RTX 2080 Ti XLR8 Gaming Overclocked Edition specs are identical to that of the Founders Edition. Of course, we weren’t expecting more CUDA cores, ray tracing cores or Tensor cores, but even the smallest bump in Boost Clocks would make this GPU more unique.  This XLR8 Gaming Overclocked Edition at the very least introduces a much more significant cooling system with an extra fan over the Founders Edition. The two heatsinks on this card is also massive and extend nearly an inch and a half past the component’s printed circuit board. Taking a closer look at dual heatsink, you can’t but help to admire the array of overlapping copper heat pipes inside as well. All of this attention spent on thermals pays off with a cooler running and better performing card – even if only slightly so – as you’ll soon see. One other thing we’ll note about the look of the card is that it doesn’t feature any RGB lighting whatsoever. Those of you averse to making their PC glow with rainbow hues might be happy about it, but it seems odd to pay more card that doesn’t light up at, especially when other GPUs in this price bracket revel in being lit AF. CPU: 3.7Ghz Intel Core i7-8700K (hexa-core, 12MB cache, up to 4.7GHz)RAM: 32GB Vengeance LED DDR4 (3,200MHz) Motherboard: Asus ROG Strix Z370-E Gaming Power Supply: Corsair RM850x Storage: 512GB Samsung 960 Pro M.2 SSD (NVMe PCIe 3.0 x4) Cooling: Thermaltake Floe Riing 360 TT Premium Edition Case: Corsair Crystal Series 570X RGB Operating system: Windows 10 Despite being pretty much identical to the Founders Edition version of the RTX 2080 Ti, the PNY RTX 2080 Ti XLR8 Gaming Overclocked Edition makes a statement by outperforming the former. In almost every one of our benchmarks, this XLR8 Gaming Overclocked Edition comes out on top, even if only by a very slim lead. Undoubtedly, the heat sink helps to keep the PNY RTX 2080 Ti XLR8 Gaming Overclocked Edition performing in top shape as the card runs two-degrees cooler than the Founders Edition both at idle and full load. This greater cooling capacity really comes into play when you overclock it. Turning up the RTX 2080 Ti XLR8 OC with PNY’s VelocityX Overclocking Software is a bit challenging and tedious, but ultimately doable for most users.We nearly achieved a 1,850MHz overclock, but getting there requires a lot of teasing out voltage increases and tuning memory speed. By now we hoped to use Nvidia’s NV Scanner API, which introduces Tensor Core-driven and AI-powered overclocking. Unfortunately, the VelocityX Overclocking Software doesn’t feature that yet, but PNY tells us its software is always changing and it hopes to integrate all of Nvidia‘s tools soon. The PNY GeForce RTX 2080 Ti XLR8 Gaming Overclocked Edition is a graphics card all about taking Nvidia GeForce RTX to the edge. This is the best performing version of any GeForce RTX 2080 Ti we’ve tested so far, but it should only really be considered by overclockers looking for a card that keeps its cool. For users looking to buy a just buy a new graphics card to plug into their gaming PC, there are more affordable versions including Nvidia ‘s own Founders Edition. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}