{"id": "TechRadar proWannaCry still hitting thousands of users worldwide ", "paragraph": "\nBy\nAnthony Spadafora\n2018-11-12T17:38:38Z\n\nInternet\n \n\nNew research from Kaspersky Lab has revealed that the WannaCry ransomware is still active with almost 75,000 users infected during Q3 2018.A year and a half on from WannaCry's first appearance back in May 2017, the company that victims are still being hit by the devastating ransomware, with 74, 621 attacks in the last quarter of 2018 alone.Overall, WannaCry accounted for nearly a third (28.72 percent) of all cryptor attacks in the three months covering Q3 2018, a rise of nearly two thirds from the same period last year.WannaCry is still considered to be one of the biggest ransomware epidemics in history.Despite the fact that Microsoft released a patch for Windows 10 to close the vulnerability exploited by EternalBlue two months before the start of the attacks, WannaCry still managed to affect hundreds of thousands of devices around the globe.The attacks demonstrated the dangers that cryptors pose and while most PCs worldwide have been updated to resist the EternalBlue exploit, cybercriminals are still trying to exploit those computers that weren't patched.“It is concerning to see that WannaCry attacks have grown by almost two thirds compared to the third quarter of last year,\" said David Emm, Principal Security Researcher at Kaspersky Lab.\"This is yet another reminder that epidemics don’t cease as rapidly as they begin – the consequences of these attacks are unavoidably long-lasting. Cyber-attacks of this type can be so severe that it’s necessary for companies to take adequate preventive measures before a cyber-criminal acts – rather than focus on recovery.”To avoid falling victim to WannaCry and other cryptors, Kaspersky Lab recommends updating your operating system frequently and having fresh backup copies of your files on hand so that you don't give into ransom demands by cybercriminals. Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}