{"id": "TechRadarCall of Duty Black Ops 4 for Black Friday is $40 today at Amazon; Walmart price matches", "paragraph": "\nBy\nMatt Swider\n2018-11-17T01:52:33Z\n\nBlack Friday\n \n\nUpdate: More good news, in addition to the Call of Duty Black Ops 4 deal on Amazon, we're not seeing Walmart price match below. Here are the updated links to the deal.If you haven't played the multiplayer-focused Call of Duty Black Ops 4 this year, now is your chance to buy the game on sale thanks to one of the early Black Friday 2018 deals.\nIt's just $39.99 for Call of Duty: Black Ops 4 on PS4, and it's also $39.99 for Call of Duty: Black Ops 4 on Xbox One. That's not all, though, as the Call of Duty: Black Ops 4 for PC is $39.99 as well. That's $20 off the original MSRP of $59.99, according to Amazon. For a game that recently came out, this is a good price.This CoD Black Ops game eschews the single-player storyline experience in favor of battle royale multiplayer gameplay. That's become popular thanks to rival games like Fortnite. But here, you get Call of Duty zombies.There's also a Mystery Box edition of CoD Black Ops 4, but that costs $199.99 on either console. Only hardcore PS4 and Xbox One games need apply on that one.Here are the best Call of Duty Black Ops 4 prices we've found today (newly updated to include the Walmart deal):Call of Duty: Black Ops 4 down to $39.99$39.99 at Amazon$39.99 at WalmartIf you've yet to get into the latest Call of Duty (seriously, you have some catching up to do), get in for a lot less than anyone else through these slick discounts and bundles.View DealCall of Duty: Black Ops 4 down to $39.99$39.99 at Amazon$39.99 at Walmart\nIf your friends have CoD on Xbox One, this is the one to get, simply because multiplayer is what this game is all about, and gaming with friends on Xbox if ideal if that's what they have.View DealCall of Duty: Black Ops 4 down to $39.99 on Amazon$39.99 on Amazon$39.99 on WalmartEven the PC version of Black Ops 4 has gotten the discount treatment from Amazon and Walmart. So, keyboard and mouse lovers can get savings just like their console cousins.View DealGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}