{"id": "TechRadarNikon D3500 review", "paragraph": "\n\n \n \n \n \n\nBy\nPhil Hall\n2018-11-01T14:33:34ZCameras \nIf you're looking to get more creative with your photography, and looking for your first DSLR, the Nikon D3500 is hard to beat.Despite the growing popularity of mirrorless cameras, beginner DSLRs are still incredibly popular, and the D3500 is Nikon's latest entry-level offering in a competitive market.Nikon's D3xxx range of entry-level DSLRs have proved successful in the past, and the company will be looking to continue that run with the D3500.\nAimed at the cost-conscious buyer who's looking to take the next step in their photography journey, beginner DSLRs like the D3500 offer a blend of easy handling, solid performance and image quality far beyond what you can expect from a smartphone or most compact cameras.That's not forgetting the fact that you can change lenses, so while you'll likely buy the D3500 with a standard 18-55mm 'kit' lens, to make the most of any DSLR you'll want to add more lenses over time to suit the subjects or genres you like to shoot. The D3500 retains the same effective 24.2MP pixel count as the D3400 which it supersedes, but Nikon stresses this is a new sensor, and closer inspection of the specs shows that the total count on the D3500's sensor stands at 24.78MP, compared to 24.72MP on the D3400. The APS-C sized sensor (typical for an entry-level DSLR, and much larger than the sensors used in most compact cameras) in the D3500 also does away with an optical low-pass filter to help improve image quality. The D3500's ISO sensitivity range of 100-25,600 is also pretty wide, but doesn't improve on the D3400's range.Sensor: 24.2MP APS-C CMOSLens mount: Nikon FScreen: 3.0-inch fixed display, 921,000 dotsBurst shooting: 5fpsAutofocus: 11-point AFVideo: Full HD 1080pConnectivity: BluetoothBattery life: 1,550 shotsWeight: 415g (with battery and card)Given the trend towards 4K video in the last year or so, especially in rival mirrorless cameras, it's a little disappointing to see only Full HD capture on the D3500. It's not all bad news though, as the D3500 can shoot at a smooth 60/50p, as well as 30/25p and 24p, while there are lower-resolution recording options as well. There's also no microphone port, so you'll need to rely on the D3500's built-in monaural microphones – if you're looking to shoot video regularly, you're probably want to look elsewhere.Nikon has also opted to carry over the same 3.0-inch display, with a modest 921,000-dot resolution, from the D3400. The screen is fixed, and sits flush with the body – if you want a vari-angle display on a Nikon DSLR you'll need to look further up the range to the D5600 – while it's also disappointing to see no touchscreen functionality, a feature that would really lend itself to a entry-level DSLR, with touchscreens having become second nature for anyone using a smartphone. Complementing the rear display is an optical viewfinder. This is perhaps the most obvious feature that that distinguishes DSLRs from mirrorless cameras, with many similarly priced mirrorless cameras either relying solely on the rear screen for shooting, while others will feature electronic viewfinders (EVF) with pretty modest resolutions (at this price point). EVFs certainly have their advantages, especially as you can see the exposure 'live', meaning you don't get any nasty surprises when you fire the shutter, although many photographers prefer the cleaner view offered by an optical viewfinder. The optical viewfinder on the D3500 offers a coverage of 95%, which is typical for an entry-level DSLR, so you may need to be a bit careful when framing some shots to avoid unwanted elements creeping into the edges of the frame.As on the D3400 there's no Wi-Fi connectivity, but you do get Bluetooth, so it's possible to transfer images via Nikon's SnapBridge feature. Here, an always-on Bluetooth Low Energy connection is made between the camera and your smart device, and you can configure SnapBridge so that images are automatically transferred as you shoot, or later, so you can select particular images to transfer. While you can buy the Nikon D3500 as a standalone camera with no lens, most people looking at this beginner camera will choose to get the 18-55mm lens that's bundled with the camera for a few more dollars or pounds.Often referred to as a 'kit' lens as these lenses are sold as part of the kit with the camera, the focal range of 18-55mm offers a decent standard zoom range to get your started. This covers everything from wide-angle landscapes to moderate telephoto that's more suited for portraits.  It's worth paying close attention to the lens though when you're looking to buy a D3500 as there's two versions available. There's the AF-P DX 18-55mm f/3.5-5.6G and the AF-P DX 18-55mm f/3.5-5.6G VR. The VR designation is what you want to pay attention to as this denotes Nikon's image stabilization system (known as Vibration Reduction).The difference in cost between the two lenses is negligible, so our advice is to splash out a few dollars or pounds more for the VR version of the lens, as this will allow you to shoot at slower shutter speeds and still achieve sharp shots.Once you're ready to upgrade your lens, or want something to complement your 18-55mm lens, take a look at our best Nikon lenses buying guide. \nCurrent page:\n\nIntroduction and key features\n\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}