{"id": "TechRadar proBlueJeans review", "paragraph": "\n\n \n \n \n \n\n\nBy\nGabe Carey\n2018-11-12T11:30:58ZBusiness and finance software \nDespite presenting no standard pricing for its top-end My Company plan, BlueJeans is one of the better video conferencing services on the market today. For one, it differentiates itself with some less conventional features, such as real-time metrics, one touch connectivity and custom branding. On top of that, Dolby Voice makes for high quality audio unparalleled by competing services.As the internet reaches an age of maturity, so too do the ways we interact with one another. With the past behind us, long gone are the days where business meetings have to take place in person. Instead, everything from seminars to job interviews can be conducted using video conferencing software.  Similar to video chat services but with more enterprise-centric features and extra layers of security, these applications make it possible to roll out of bed at 9am, foregoing a lengthy commute in favor of much-needed beauty sleep.It’s futile to deny that the increasingly remote workforce is a result of advances in technology such as these. But once we’ve come close to perfecting the video conferencing application, what’s next?Services like RingCentral Meetings and Zoom have already demonstrated that businesses can schedule and conduct robust video conferences at a cost that undoubtedly beats flying everyone in by plane to a centralized location. Cisco WebEx has proven that meetings – no matter how high their capacity – can be held and recorded in a room employees can join by VoIP, phone or computer in a browser without compromising on video quality.Innovation in the video conferencing space has been largely stagnant. Throughout most of this software, you’ll find a lot of overlap in their features and pricing. Two areas that should be distinguishing factors instead complicate our criticisms since, put simply, they’re all pretty good at this point.  BlueJeans tries to make like Apple did 20 years ago and think different. The end result is a premium product with an equally premium price tag. While it skimps on a few features, BlueJeans excels at delivering high-quality video and audio to up to 150 participants joined in a single (virtual) room. What ultimately sets it back from greatness is a reluctance to disclose the pricing of its most compelling and high-end tier, paired with the fact that competing video conferencing services give you more features for less money than BlueJeans does. Still, it’s worth a look for companies that cherish quality over everything else. So without further ado, let’s get fitted for some BlueJeans.Like the bulk of its competition, BlueJeans comes in three different outfits, each with its own price and feature set. Unlike the bulk of its competition, BlueJeans doesn’t have a free plan. Rather, if you want to take it for a test drive, BlueJeans opts for the 30-day free trial route. As is the case with LogMeIn’s join.me and GoToMeeting, signing up for a trial doesn’t require your credit card information, thus you don’t have to worry about cancelling once your monthlong demo comes to an end.The most affordable BlueJeans plan is called Me, and it’s geared toward “individuals and small businesses” on the prowl for “an inexpensive start.” It supports up to 50 simultaneous participants, which is lower than RingCentral Meetings’ $14.99 (£11.49)-per-month Essentials package but the same as Cisco WebEx’s $13.50 (£10.52)-per-month Starter plan. That said, BlueJeans Me is cheaper than both of those at $12.49 (£9.62) per month. It also doesn’t appear as though you have to pay for BlueJeans annually, a perk when you consider that Cisco WebEx starts at $14.95 (£11.52) should you decide to pay for it from month to month as opposed to on a yearly basis. BlueJeans Me supports free phone audio in over 40 countries.The next step up from Me is My Team, which BlueJeans describes as the “perfect package for mid-sized businesses and teams.” Up to 75 people can join a meeting with BlueJeans My Team, and the free phone audio feature from BlueJeans Me remains present in My Team as well. Meetings can be recorded for up to 10 hours per license, plus BlueJeans promises integrations with messaging applications and a command center analytics dashboard with its My Team plan. BlueJeans My Team costs $16.65 (£12.77) per month, more than you would have to shell out for RingCentral’s 100-participant plan.The most premium tier of BlueJeans is My Company, which the firm alleges is the “ultimate solution, optimized for enterprises.” In addition to all of the aforementioned features found in the My Team package, My Company gives users unlimited recording, access to real-time metrics during live meetings, a “one touch connection from any conference room system,” IP VPN (MPLS) integration and custom branding. Of the video conferencing software we’ve reviewed so far, BlueJeans and Zoom are the only services to highlight custom branding. To find out the price of the My Company plan, you will have to contact BlueJeans’ customer service hotline at (800) 987-0237.Thanks to Dolby Voice, BlueJeans will appeal to those more concerned about the quality of their video conferences than the quantity of features they get within the application. Although its most enticing subscription package comes with an elusive price tag, it has a wide array of capabilities that either match or come close to matching those of Zoom and Cisco WebEx. And because you don’t have to download or install anything, not to mention you can get 30 whole days for free, it’s a lot easier to test out for yourself before buying than many of its rivals.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}