{"id": "TechRadarNew cheaper MacBook, Mac Mini, iMacs all leak through European agency listing", "paragraph": "\nBy\nJoe Osborne\n2018-10-24T19:47:14Z\n\nLaptops\n \n\nIf you had any worries that your most-wished-for Mac device wouldn't debut at Apple’s October 30 keynote event in New York City, consider them gone. A trio of new reportedly Mac products for 2018 was uncovered via a device registration filing published by the Eurasian Economic Commission (EEC).First reported by French Apple blog Consomac, these device filings make references to two new iMac 2018 desktop models as well as a new Mac Mini 2018 model. The latter of which hasn’t seen a meaningful update since late 2014.The third and last reference in the EEC filings is to a laptop device. However, it’s still up in the air whether this laptop will be an overhaul of the 12-inch MacBook 2018 with a cheaper price tag or a revival of Apple’s most beloved laptop in recent memory: the 13-inch MacBook Air 2018.This report is the culmination of several leaks throughout this year that have pointed to new Mac products coming in 2018. What was previously not much more than rumor via ‘anonymous’ sources is now much, much closer to fact with these filings with a government body.It’s likely that all of these products will be geared toward consumers (and ‘prosumers’), since Apple’s iMac Pro is already out in the wild for the professionals.After years of public clamoring for updates, this year looks like it could be a bit of a renaissance for the Mac, with what will likely end up being a whopping five brand new laptops and desktops launched in 2018. Of course, we’ll only know whether these potential products will please Apple’s fans after some hands-on time and a full review.Via Tom’s GuideGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}