{"id": "TechRadarLG B8 OLED (OLED55B8, OLED65B8) review", "paragraph": "\n\n \n \n \n \n\n\nBy\nJohn Archer\n2018-11-13T23:35:54ZTelevisions \nLG has finally stumbled on a way to make its OLED TV technology substantially cheaper by using a less powerful video processor. The B8 OLED range uses a so-called Alpha 7 chip similar in power and scope to the processors used in LG’s 2017 models rather than the swanky new Alpha 9 processor used in LG’s other 2018 OLED series. This does, inevitably, have performance repercussions - but it doesn’t stop the OLED55B8 and OLED65B8 from adding up to a serious bargain.For years now, LG has tended to give every OLED TV in any annual range refresh essentially the same picture quality, differentiating between separate ranges along purely design and/or sound quality lines. Which in turn has seemed to limit the extent of the price differences LG has been able to apply across its OLED ranges.Happily LG has finally broken out of this rather restrictive way of thinking with its new B8 OLED series. While every other OLED TV series in LG’s 2018 range uses the brand’s new - and impressive - Alpha 9 processor, the B8 models us an Alpha 7 processor that appears to deliver a picture performance and feature count similar to that of 2017’s LG OLED models. And thanks to this use of a step-down processor, the B8 models cost a cool $200/£200 less than any other 2018 LG OLED TV.[Update: Actually, you'll probably find an even better deal this week: the 55-inch OLED55B8 is available for $1,598/£1,479 while the 65-inch OLED65B8 is dropping down to just $2,496/£2,289. Read all about the LG Black Friday TV deals.]   From its sleek, beautifully built metallic back plate to its stunningly slim outer edges (we’re talking just a three or four millimetres here), totally flat screen and ‘barely there’ bezel, the LG B8 is a joy to behold. There’s no hint that this is the cheapest OLED TV LG has ever released.There are two design variations of the 55-inch OLED55B8 available in the UK: The OLED55B8PLA’s stand uses an angled metal sheet design, while the OLED55B8SLC embraces a more open, half-moon look. Both have their attractions, though for us the PLA edges it.The OLED55B8’s connections appear uncompromised by its ground-breaking price. There are still four 4K and HDR-capable HDMIs, three multimedia playback USBs, and the usual network (Wi-Fi and Bluetooth) options. This is in line with the connectivity you get on LG’s most expensive OLED TVs, too.Design TL;DR: OLED can usually be relied on to deliver a stunning TV design, and this holds good with the OLED55B8. Despite its uniquely affordable price. Screen sizes available: 55-inch, 65-inch | Tuner: Freeview HD | 4K: Yes | HDR: Yes (HDR10, HLG, Dolby Vision) | Panel technology: OLED | Smart TV: Yes/webOS | Curved: No | Dimensions: 1228(w) x 707(h) x 47(d) mm | 3D: No | Inputs: Four HDMIs (all 2.0), three USBs, RF tuner LG’s webOS platform has long blazed a trail in making smart TVs easier to use - and it still stands up on this year's OLEDs as arguably the slickest and most straightforward smart TV platform around today. Its graphics are easy to read, elegantly super-imposed over the picture you’re watching, and economical in terms of the screen space they consume. The layout of the webOS UI is easy to customize, too, and runs so slickly it never feels like it’s getting in the way of what you’re trying to achieve.WebOS’s horizontally scrolling list of content access icons along the bottom of the screen has started to become a bit unwieldy in today’s content-rich world. But you can, at least, easily adjust the running order of the apps in this scrolling bar, so that you always get to your favorite apps first.As well as being easy to use, webOS plays host to an impressive roll call of apps. All the big hitters are there: Amazon Prime Video, Netflix, YouTube, Now TV, Rakuten TV, and all the UK’s key terrestrial broadcaster catch up services. In fact, for those in the UK, the catch up services are provided within a Freeview Play app that makes it much easier and more fun to browse for shows you might have missed.It’s good to see, too, that services such as Netflix and Amazon Prime that provide 4K and high dynamic range streams have those features fully supported by the B8. Better, though, is that despite its affordability relative to LG’s other 2018 OLED TVs, the B8 can still play content in both Dolby Vision HDR and with Dolby Atmos sound from Netflix for a superior viewing experience.Wrapping up an excellent smart TV interface is LG’s ‘Magic Remote’. This innovative sidekick lets you point it at the part of the screen showing an option you want to select, as well as carrying a handy ‘wheel’ with which you can quickly spin up and down menus.Smart TV Features TL;DR: There are perhaps areas where webOS could do with a slight revamp, but it’s still overall the most friendly and attractive smart TV game in town.OLED screen technology is particularly well suited to standard dynamic range (SDR) images - and it turns out that this talent holds true even on the cheapest OLED TV LG's ever released.The gorgeously deep and even black levels that are OLED’s trademark provide a stellar foundation for the OLED55B8’s SDR images, for starters. There’s no grayness at all in dark scenes, making it easier to pick out subtle shadow detail, and providing an immaculate counterpoint for the screen’s colors that helps them look beautifully rich and bold.There’s a decent amount of subtlety in the the B8’s handling of SDR colors, too: Skin tones largely avoid the slightly plasticky look of some past OLED TVs, and you get a good sense of the actually very impressive finesse that high quality SDR sources are capable of providing. LG’s step-up OLED TVs for 2018, starting with the C8 series, deliver a touch more SDR punch and color subtlety thanks to their more powerful Alpha 9 processors. They also deliver rich dark colors with slightly less noise than the B8 - which help to make them the better choice overall. Rest assured, though, that the OLED55B8 is still a lovely SDR performer, and the step down in quality with SDR from the C8 is smaller than you might expect from the substantial price difference. Note that the OLED55B8 lets you watch SDR converted to HDR decently (rather than brilliantly) well, if you wish. In our opinion, however, OLED is so well suited to the native look of SDR content that this remains the best way to watch it.The B8’s playback of HD (or lower) resolution sources is fair to middling. Its upscaling engine is effective enough to retain natural looking colour tones, and does a respectable job of suppressing noise that might be in a low resolution source. It does not, though, deliver as much upscaled sharpness and detail as the Alpha 9 chipset inside LG’s step-up OLED models.HD/SDR Performance TL;DR: The OLED55B8 performs admirably with SDR content, managing its relatively limited brightness and color range brilliantly to remind you just how good SDR can look. It’s a little less assured when it comes to upscaling HD to 4K, but the results are still very watchable.HDR playback has tended to be a challenge for OLED TVs, as they struggle to deliver the sort of brightness that HDR thrives on. And actually, the OLED55B8 continues with this struggle slightly more than LG’s more expensive 2018 OLED sets.This is because, unexpectedly, its peak brightness measures around 680 nits, versus north of 800 nits on the more expensive C8 OLED. This may not sound like a big difference, but when it comes to making HDR ‘pop’, it really does matter. So while the OLED55B8’s HDR pictures still look gorgeously intense when the they contain mostly dark content with some very bright highlights, they don’t look as satisfyingly bright and vibrant with more consistently bright HDR images as those of LG’s more expensive OLED models. The lower brightness of the OLED55B8 means, too, that it’s not quite as good at reproducing the finest shading details in the brightest parts of HDR pictures. This relative lack of bright scene punch and peak toning are, for us, the most compelling reasons to consider trying to afford an OLED55C8 instead.One last picture difference between the OLED55B8 and its step-up siblings is that it exhibits a touch more noise in dark areas and subtle HDR/wide gamut color blends. Beyond failing to surpass the higher-end LG OLED models, the OLED55B8 inevitably does not look anywhere near as bright with HDR images as some of the best LCD TVs (some of which reach peak brightness levels of as much as 2000 nits). This limited brightness also restricts the color volumes it can hit with aggressive HDR content - the bright blues of Mad Max: Fury Road’s skies can look slightly cyan as the B8 can’t find quite enough brightness to give the really bright area of blueness exactly the right tone, for instance.The good news, however is that black levels remain immaculate with HDR scenes ... so long as you don’t try and push the brightness setting beyond its 52 level. Also mesmerizing is the way the brightest parts of an HDR picture can sit immediately alongside the darkest parts without so much as a hint of light leakage into the dark parts. And without any compromise to the brightness of the bright parts. This sort of immaculate co-existence of an HDR image’s bright and dark image elements just doesn’t happen on any LCD TV released to date.Another benefit the B8 has in comparison with its LCD-LED competitions is thanks to OLED’s massive viewing angle support: You can watch it from almost any angle without the picture losing contrast or color saturation. This, again, is something LCD TV technology can’t compete with. Even the new Sony ZF9 LCD, which feature a new optical screen design to combat LCD’s usual viewing angle weaknesses, still suffer with backlight blooming around bright objects when viewed off axis.Last but not least, you'll also find solid motion processing on the B8 as well. Again, there are TVs - including LG’s own more expensive 2018 OLEDs - that manage to reduce judder in action scenes slightly more convincingly, but the point is that the OLED55B8 still handles motion well enough, despite its cheaper price.In fact, it’s ultimately this price that helps us see our way through the complexities of trying to judge the OLED55B8’s pictures. For while its pictures are not as good as those of LG’s more expensive OLED TVs, or as punchy and sharp as those of some of the best LCD TVs, they still emphatically showcase the core strengths of OLED technology at a price likely to lure a whole new set of AV fans into the OLED fold.4K/HDR performance TL;DR: Although it’s not bright enough to deliver ‘full force’ HDR and 4K, the LG OLED55B8’s phenomenal contrast capabilities and rich, lustrous colors still make it a consistently lovely watch. Given how slim the OLED55B8 looks at its edges, and given the lack of any forward facing speakers, we hadn’t expected much from its audio. So it’s a pleasant surprise to find it capable of producing reasonably loud, dynamic and clean sound that travels far beyond the edges of the TV without sounding brittle or disjointed.This sense of projected sound is, of course, pretty important for a TV that carries built in Dolby Atmos decoding. In fact, the speakers even manage to create a hint of height beyond the TV’s top edge, and we could've sworn that, on occasion, we heard some sound effects coming from behind us. Impressive.Unfortunately, bass is limited in depth, but what there is of it feels nicely timed and crisp. This leaves as my only audio complaints some slight lip synch issues when attempting to use the TV’s ARC feature, and the fact that the Atmos audio system only works well at high volumes. (It can sound rather muffled and unbalanced if you try to run it quietly.)Sound TL;DR: The B8 OLED produces a surprisingly powerful and detailed sound performance for a TV that appears on its surface to be more interested in looking good than squeezing in serious speakers.The LG C8 OLED, a pricier (but better) alternative to the B8.While it's more expensive, LG's own C8 OLED is well-worth the extra cost if you have extra money in your AV budget this month: Its extra processing power makes it a better upscaler of HD sources, and its extra brightness is helpful to the HDR cause.If you just can't justify the extra cost, Sony’s LED-based XF90/X900F is also great, boasting some outstanding color, brightness and video processing. (Just watch out: though while its contrast performance is good by LCD TV standards, there is blooming around bright objects that you don’t get with the OLED55B8.)Finally, the Samsung Q9FN series is also an excellent, if slightly more expensive, option. This uses a superb direct LED backlighting system with hundreds of local dimming zones to combine high peak brightness with some of the darkest and most consistent black levels ever seen on an LCD TV. Its use of proprietary ‘QLED’ Quantum Dot technology helps it produce some huge color volumes too. Note, though, that this set does not support the Dolby Vision version of HDR.While it is not quite as refined in its picture performance as LG’s step-up OLED TV, the C8 OLED, LG's B8 series still delivers that distinctive contrast wow factor that has made OLED such a hit with AV fans. That, together with a strong feature count, should be more than enough to seduce potentially huge numbers of new cinephiles to join the impossibly contrast-rich 'dark side' of TV technology. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}