{"id": "TechRadar proHow to ensure a full live-streaming experience", "paragraph": "\nBy\nDr Stefan Birrer\n2018-11-12T14:18:18Z\n\nVPN\n \n\nNo live streaming service or technology can stream at full HD 1080p, in real-time and with synchronous viewing at broadcast scale. That all being an industry way of saying no one can deliver a real-time stream to users without at least sacrificing quality of the stream or number of viewers able to watch the stream. “Live” streams and real-time streams are often talked about synonymously, but that’s not the case.Live streams are what most consumers are experiencing today, but the goal should be to provide them with real-time streams, where there is no latency between what’s being broadcast and what the viewer sees. Once networks, franchises, hot trivia apps and everyone else in this space can make the transition from live to real-time streams they can start to capitalize on the benefits of an audience engaging one-to-one. With today’s streaming providers, however, it’s a challenge because they cannot support high quality and potentially infinite users at the same time while delivering a near zero latency stream.Additionally, there are a number of barriers live streaming services need to overcome as the world transitions from a linear viewing experience of traditional TV to the more mobile, stream-centric viewing experience from OTT services like Amazon, Netflix, and even places like Twitch and YouTube. Recent research Phenix commissioned actually showed the cost of all these services and content that are still tied to cable as just a few of the reasons consumers were resisting the move to more live or real-time content.And that’s a tall order for anyone in the streaming game right now – deliver high-quality real-time content and make sure it’s content that people want and are able to consume with ease.Currently, the ‘live’ streaming industry still suffers from 30-90 second delays. That’s an eternity in this day and age, where mobile and social media intersect every moment of the consumer’s life.  Who would be happy seeing a tweet about a touchdown before they even get to see it on their stream? With Amazon taking on the NFL broadcasts, for example, this is a real possibility that needs to be proactively addressed.Hulu Live and ESPN+ both recently held up hitting the 1M subscriber mark as a sign of success for their OTT offerings, but the way we see it is it’s not about the first million, it’s about the quality of the user experience which will ultimately drive the decision of whether they continue to sign-up. The ‘live’ experience has potential to be a significant differentiator for a service like Hulu or ESPN+ if they can make sure it’s up to par – in fact our recent research showed more than one in four consumers wouldn’t pay for live content yet because of poor quality.For ESPN in particular, they are still reporting drops in cable subscribers every year, so if they think the OTT product is ready to replace traditional TV, based on the quality of the streams, at this point we think it’s still unlikely. To overcome it they need to rethink the technology used to power the experience, particularly live content. If the technology remains as is for them, with 60 seconds or more of latency along with other shortcomings including buffering and platform crashes, then they aren’t even close to being where they need to be for an A+ product consumers are hungry for. If they want their OTT product to replace or even significantly supplement their linear offering, then the quality of the product must dramatically improve.Almost everyone we talk to has this conundrum – latency all around is terrible – and they need to figure out what they can do to mitigate. One of the major features we’re incorporating into our product to help get to that perfect real-time synchronous stream at scale is something called adaptive bitrate. The OTT services have been working in this realm for some time to make sure they’re delivering a high-quality stream, but it’s rare in real-time streams. Essentially a transcoding engine creates multiple bitrate renditions of the input stream and selects the appropriate rendition for each viewer based on their individual device and real-time network conditions. The result is minor buffering, faster start times and a high-quality experience regardless of the strength of the connection.The financial implications are considerable – both from a consumer subscription and advertising perspective.We found more than one in six consumers using a streaming service would be likely to switch to an alternative with a better ‘live’ option. At the end of the day, not every streaming service on the market today is going to survive the next decade; growth will plateau once consumers hit their max on price and services they want to deal with. Having the right ‘live’ experience not only gets subscribers, but helps you keep them once they’re signed-up.From an advertising perspective, it’s inevitable live streaming services are going to want to insert ads into the stream. Our research showed more than half of viewers would abandon a poor-quality stream in 90 seconds or less – not a statistic you want to parade in front of advertisers. If the stream is bad, the ads won’t be seen. It’s as simple as that. To get and keep those advertising dollars, a buttoned-up stream is a must.Again, consumer tolerance for a bad stream is not good – 90 seconds for many of us. Hesitancy to cut cord can be everything from price (multiple streaming subscriptions add up quickly!) to access to content, where major events like awards shows and sports events are still heavily tied to traditional broadcast deals, so their audiences stay tied too. Once a few folks figure out the benefits of real-time streaming the rest will follow – the new level of interactivity it can lead to are just too exciting to miss out on. It’s likely the sports industry gets there first.For example, in September Amazon somewhat quietly began testing out interactive features in the NFL games its streaming online. Imagine how exciting the potential for fan engagement is when they’re watching and interacting in real-time? Especially now that in-game betting is increasingly on the table – you can’t afford any delay between what’s on the screen and what’s being put up for a bet if you’re the NFL, Amazon or one of the many betting companies supporting behind the scenes. It’s a small taste of the endless possibilities for user engagement once the ‘live’ stream is actually operating in real-time. Dr. Stefan Birrer is CEO and cofounder of PhenixTechradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}