{"id": "TechRadarSony HT-ST5000 Dolby Atmos soundbar review", "paragraph": "\n\n \n \n \n \n \n\nBy\nSteve May\n2018-10-24T21:35:40ZHi-fi and AV speakers \nWith audiophile drivers and refined digital amplification, this high-end Dolby Atmos soundbar is as at home with High-Res Audio as it is with a film. The Sony HT-ST5000 appeared in 2017 with an impressive level of sound quality and a high price tag. Since then the market has only got more crowded, but what follows is our original review of the HT-ST5000 soundbar.Sony's first soundbar to launch with Dolby Atmos support, the HT-ST5000 is a beast. Stretching 1180mm wide alongside a wireless sub, the device boasts an engineering heritage that's more stereophile than TV audio, and has a finish commensurate with its wallet-wincing price tag. At first glance it may look like an over-dressed 2.1 package, but Sony describes the HT-ST5000 as a 7.1.2 proposition. The feature spec is certainly expansive – in addition to Dolby Atmos and DTS:X decoding, there’s High-Res Audio support, built-in Chromecast functionality, dual-band Wi-Fi and Bluetooth.The downside, of course, is that you'll play dearly for the pleasure. At $1,500 (£1,500 / around AU$2,436) the soundbar is certainly expensive, but for the money you're getting a very capable piece of equipment. The build quality of the Sony HT-ST5000 is fabulous, there's no debate about that. The bar comes with a fabric grille, but looks better uncovered, because the drivers are as pretty as a picture.Left and right are two matching coaxial speakers with gold-rimmed, high frequency tweeters, while a coaxial driver with mid-range cones handle the center channel.  This slight difference translates to a minor timbre mismatch, although it isn't really apparent when listening live to multi-channel mixes. Sony HT-ST5000 reviewEvidence of its Dolby Atmos credentials can be found up top. Behind fixed metal grilles are two upfiring Dolby-enabled speakers for Atmos and height-orientated audio. Unlike lesser bars, the HT-ST5000 offers full AV receiver versatility. There are four HDMIs (three inputs, plus one ARC output). All are HDCP 2.2 ready for your various 4K sources (UHD player, Xbox One X, Amazon Fire 4K) but need to be configured before being paired. Select Enhanced over Standard, in order to support 4K 60p and 4:4:4 (or incrementally lower) video settings. There are a number of additional display options, all of which are best left in Auto mode. Located right-side on the bar is a covered USB port, for handy local file playback.There’s also an optical digital audio input and stereo minijack on the HT-ST5000. An Ethernet LAN port enables wired networking, but there’s Wi-Fi and Bluetooth, the latter with NFC pairing and Sony's proprietary LDAC headroom extension. Sony HT-ST5000 reviewA clear display window reveals input selection and volume. A selection of on-body controls are also provided for those of us that don’t like the stubby IR remote control.The soundbar is easy to drive: there's a tiled interface on the HT-ST5000 which lists all the input options, plus any connected home network devices. In other words, there's nothing here which should alienate non-techies.The partnering subwoofer, which sits on a stylised plinth, is better looking than most LFE boom boxes. A forward-facing grille is topped with a stylish matte lid, and there are drivers front facing and downward firing. The sub connects to the bar automatically during set up, with an LED confirming the link is active.In full flight, the ST-HT5000 really does sound immense. It creates a wide, high soundstage, and spatial placement is excellent; the opening narration from Mad Max Fury Road (Blu-ray), with its familiar \"where are you?\" whispers, is atmospherically drawn. A specified power output of 800W indicates the system isn't short of slam or dynamics, and it certainly hits hard. When the War Boys rev their engines, the gutty roar will vibrate your popcorn.The HT-ST5000 isn't just about muscle though, because there's musical refinement here too. Christy Baron 'Ain't no sunshine', LPCM 96kHz 24-bit, reveals just how naturalistic the soundbar's vocal performance can be – rounded and rich, the presentation is almost three dimensional.Don’t come to the HT-ST5000 expecting pronounced Atmos overhead steerage though. The bar may well feature a barrage of drivers, but it doesn't convincingly create an encompassing audio canopy. Sony HT-ST5000 reviewThere's the inkling of a sprinkling, notable during the rain-soaked climax of John Wick (Blu-ray), but it's far from a full-on Atmos shower. The Sony HT-ST5000 listening experience isn't comparable to an AV receiver with speakers in a 5.1.2 configuration, say.Ultimately, much will depend on your room and your seating distance from the bar itself – around 1.5m worked best for me. Further back, the soundstage comes across as more stereophonic than Atmos-pheric.One aspect of this two-piece that really impresses is bass response. Sony's previous soundbar solutions have probably been too polite for their own good, but the HT-ST5000 can sound properly seismic. Those dragon grumbles in Game of Thrones (5.1, Sky Q) have deep, frightening heft. The wireless subwoofer murmurs from 31.5Hz, and has copious energy at 50Hz. The soundbar itself crosses over at 100Hz.Sony HT-ST5000 reviewIn addition to Dolby Atmos encoded software, the HT-ST5000 system does a fine job height-scaling regular multichannel audio. The Dolby Surround mode can be quite brilliant when it comes to identifying spatial elements in a 5.1 mix that it can distribute up high. This works particularly well with live events and concert material, where there's a greatly enhanced sense of ambiance. The soundbar is also a competent streamer. DLNA compliant, it immediately recognized our NAS devices and Twonky server. Audio file support covers all the usual lossy formats, as well as 24-bit 96kHz FLAC and DSD. A High-Res vinyl rip of Rust in Peace by Megadeth rips along, but the bar also has the precision to handle classical works too. Marianne Thorsen’s Mozart Violin Concerto in D Major, a High-Res Audio download from 2L, has entrancing depth. Have more MP3s than you'd like? Well the DSEE HX processor on the Sony HT-ST5000 goes some way to restoring the fidelity in compressed audio too.Sony's debut Dolby Atmos soundbar is a no-compromise solution for audiophiles looking to mix refined music with immersive movie audio. It's fabulously well finished and presents a soundstage that's wide and high. The provision of integrated Chromecast capabilities is a nice bonus.A Dolby Atmos decoder in itself is no guarantee of over-head audio effects, and this Sony system isn't as immersive as a conventional AV receiver with multiple speakers. The Sony HT-ST5000 may be expensive, but it justifies its price tag with knock-out good looks and a superior performance. Sony's first Dolby Atmos soundbar is gloriously over-engineered, and offers an audio performance that's rich and exciting, more than warranting its flagship status. If you want a top-flight sound system that doesn’t take over your room, then the Sony HT-ST5000 has few equals.  Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}