{"id": "TechRadarBest headphones 2018: Your definitive guide to the latest and greatest audio", "paragraph": "\nBy\nNick Pino\n2018-11-16T22:35:00Z\n\nPortable audio\n \n\nBest Headphones 2018: Welcome to TechRadar's comprehensive round-up of the best headphones in every style and at every price point in 2018.It's hard to imagine a world without headphones - a world where music can only be enjoyed in concert halls or on speaker systems, exclusively. Headphones have their limitations, of course, but there's a reason they've survived as long as they have.Yes, they've changed over the years - added fancy new features in the form of noise-cancellation of Hi-Res Audio playback over Bluetooth - but largely the pair of cans you bought 20 years ago could stand up to the ones made today. ...well, as long as you bought a quality pair of them they could.The reasoning behind buying one of the best headphones on the market today is to get the features of today, and a build quality that will last tomorrow. Sure, you could buy discount-bin headphones at the checkout line, but they're unlikely to make it through the year, let alone for the next decade or two. That said, it's our mission to hook you up with a pair of great-sounding headphones - the best headphones money can buy, even when you're on a budget. We've listened to hundreds of headphones over the years of every make, model and variety to create list-after-list of the best noise-cancelling headphones, the best wireless headphones, the best earbuds, etc...We encourage you to take a look at all the headphone lists here on TechRadar - but, if you're in a hurry and just want to see the best headphones, period, this is the place for you. What you'll find below is our selection of the best headphones for each form-factor, and we've even picked out a less-costly option for each so that a lack of finances won't stop you from finding a pair of headphones you'll truly love. Here's a quick look at the best headphones this year:The headphones that can do everythingAcoustic design: Closed | Weight: 254g | Cable length: 3.94 ft | Frequency response: 4 Hz-40,000 Hz | Drivers: 40mm | Driver type: Neodymium | Sensitivity: 104.5 dB / mW (1 kHz) | Impedance: 47 ohm | Battery life: 30 hours | Wireless range: 33 ft | NFC: YesIf there’s anything surprising about the new Sony WH-1000XM3 it’s that they’re so consistent with what Sony has released in the last two years in the form of the Sony WH-1000XM2 and Sony MDR-1000X. To wit, they’re a dominant noise-cancelling pair of headphones that can beat out anything Bose has with both arms behind its back. That’s because, while Bose has done a tremendous job working out its noise-cancellation algorithm over the years, Sony has spent that time perfecting audio playback while simultaneously creating an adaptability algorithm that doesn’t just create a single sterile sound barrier, but multiple kinds that can adapt to whatever situation you’re in. Beyond being exceptional at keeping external noises at bay, Sony's headphones are Hi-Res Audio-ready, sporting aptX, aptX HD and LDAC codecs, plus offer will offer Google Assistant support right on-board. If you need a headphone that can live up to any challenge and excel in any environment, these are them.Read the full review: Sony WH-1000XM3Your search for great sounding, good value headphones ends hereAcoustic design: Closed | Weight: N/A | Cable length: N/A | Frequency response: 20-40,000Hz | Drivers: N/A | Driver type: Dynamic | Sensitivity: 99 dB/mW | Impedance: 32 ohms | Battery life: N/A | Wireless range: N/A | NFC: N/AAfter spending a few weeks with both the 1MORE Triple Driver in-ear headphones and the 1MORE Quad Driver in-ear headphones we were blown away at just how much value each one gave in their prospective price ranges. For $100 (£100, about AU$168), it’s hard to think of a better sounding and built headphone than the 1MORE Triple Driver. (That said, if you want just that little extra refinement and luxury materials, the 1MORE Quad Drivers are still a bargain at twice the price.) There’s very little we can fault the Triple Drivers for. Its rubber cable is annoying and its remote control feels cheap but these are just nitpicks. But, for its price, it’s impossible to do better than 1MORE's Triple Driver in-ear headphones. Read the full review: 1More Triple Driver In-Ear HeadphoneGreat-sounding, incredibly cheap in-ear headphonesAcoustic design: Closed | Weight: 14 grams | Cable length: 1.35m, dual material | Frequency response: 16-22,000Hz | Drivers: Micro Dynamic | Driver type: Dynamic | Sensitivity: 100dB | Impedance: 16 ohms | Battery life: N/A | Wireless range: N/A | NFC: N/AIf you have a tendency to lose or break headphones but still value sound quality, it’s hard to think of a better value than the RHA S500u. These headphones have no business sounding so good for the price: Sound quality is balanced with a slight mid-bass bump. Bass is slightly emphasized but not egregiously and features good impact while maintaining good control. And highs, while sibilant at times, makes music sound more exciting.    Read the full review: RHA S500uTruly excellent sound performance for a stellar priceAcoustic design: Open | Weight: N/A | Cable length: N/A | Frequency response: 20Hz-20,000Hz | Drivers: N/A | Driver type: Dynamic | Sensitivity: 99db | Impedance: 32 ohm | Battery life: N/A | Wireless range: N/A | NFC: N/AFor your money, you can't do any better than Grado's SR60e. The third-generation of the Brooklyn, NY-based company's Prestige Series is its best and most refined yet. The SR60e in particular is a smart choice if you're looking for an entry-level set of headphones that sounds like it should cost you way more than it does. Its open-backed ear cup design makes them a more breathable experience than what most on-ear headphones can deliver. In a few words, it's our gold-standard when it comes to on-ears.(Our review is for the SR60i, but the newer SR60e headphones are largely similar in design and performance.)Read the full review: Grado SR60eA perfect value buy if you want headphones that are cheap and comfortableAcoustic design: Closed | Weight: N/A | Cable length: N/A | Frequency response: 20Hz-20,000Hz | Drivers: N/A | Driver type: Dynamic | Sensitivity: 99db | Impedance: 32 ohm | Battery life: N/A | Wireless range: N/A | NFC: N/AWhile the original Plattan headphones were just fine for a pair of on-ear headphones, Urbanears wasn’t satisfied with being mediocre. The company took customer feedback to heart and addressed many complaints about comfort, sound quality and isolation. For the most part, Urbanears succeeded, making the Plattan II a worthy sequel to the company’s most popular headphone.  In short, these are basic headphones without a ton of features. But, because they're feature-light, you get a good-sounding pair of wired headphones for significantly less than you would otherwise. Read the full review: Urbanears Plattan IIPremium cans that are all about the sound qualityAcoustic design: Closed | Weight: 413 g | Cable length: N/A | Frequency response: 2 – 30,000Hz | Drivers: 1.6 inch (40mm) Mylar/Titanium | Driver type: Dynamic | Sensitivity: 111dB SPL @ 1kHz – / 1Vrms | Impedance: 22 Ohms | Battery life: N/A | Wireless range: N/A | NFC: N/AThe Bowers & Wilkins P9 Signatures are simply some of the best-sounding headphones we’ve ever used. They have a tight, refined sound that offers an almost unmatched level of detail. That said, the fact remains that they’re a comparatively feature-light pair of cans. If you want to spend less then you can get a much more portable pair that’ll be better suited to the morning commute or a plane ride thanks to additional features like noise-cancellation and Bluetooth connectivity.But, if you’re looking to invest in a seriously high-quality pair of headphones to listen to a high-quality music collection, then there are few that can match the P9s at this price point. Read the full review: B&W P9 SignatureThese over-ear headphones bring both performance and valueAcoustic design: Closed | Weight: .64 pounds | Cable length: 3.9 feet | Frequency response: 5-40,000Hz | Drivers: Two 1.7\" drivers | Driver type: Dynamic | Sensitivity: 100 dB | Impedance: 35 ohm | Battery life: 40 hours | Wireless range: N/A | NFC: NoAudiophiles typically shun wireless headphones because of poor sound quality. However, Bluetooth audio has improved tremendously over the years. There are now plenty of wireless headphones that can please the music enthusiast, with Hi-Res Audio support being more and more prevalent.That said, the Audio-Technica ATH-SR5BT feature some of the best wired and wireless sound quality for a headphone under $200 (£150). They play well with all music genres and offer a near-flat response curve. They're extremely comfortable for long listening sessions and are well built. Battery life is equally impressive with nearly 40 hours of playback from a charge. And while they lack some features of more expensive wireless headphones like active noise cancelling and multi-device pairing, these are tradeoffs worth making for phenomenal sound.Read the full review: Audio-Technica ATH-SR5BTNoise-cancelling headphones for folks who don't want to hear a peepAcoustic design: Closed | Weight: 23g | Cable length: N/A | Frequency response: N/A | Drivers: N/A | Driver type: N/A | Sensitivity: N/A | Impedance: N/A | Battery life: 10 hours | Wireless range: 33 ft | NFC: YesDespite being nearly identical to the already-excellent Bose QuietComfort 35 teh Bose QuietComfort 35 II is updated for 2018 with Google Assistant. This means you still get the class-leading noise cancellation Bose is known for, good sound quality and incredible comfort, plus a convenient assistant to answer any inquiries you might have while traveling.  Taken as a whole, the Bose QC35 II NC is an excellent headphone for travelers and commuters. Bose has found a good balance of features that will satisfy most mainstream listeners. While we don't love them as much as the better-sounding Sony WH-1000XM3, they're still top of the class for noise cancellation.Read the full review: Bose QuietComfort 35 IIThe best-sounding wireless headphones you can buyAcoustic design: Closed | Weight: 380g | Cable length: 1.2 m, detachable | Frequency response: 5 - 40,000 Hz | Drivers: 50mm | Driver type: Dynamic, Tesla | Sensitivity: 100dB At 1KHz | Impedance: 32 ohms | Battery life: 30 hours | Wireless range: 10 meters (30+ feet) | NFC: NoThe Beyerdynamic Amiron Wireless are the best-sounding wireless headphones you can buy, period. Sound is spacious, detailed, and makes you want to rediscover your music library. Their bulky design and average noise isolation make them terrible for travel but if you’re looking for the best sound from a wireless headphone, this is it.Read the full review: Beyerdynamic Amiron WirelessA traveler’s best friendAcoustic design: Closed | Weight: 0.64 lbs (289g) | Cable length: N/A | Frequency response: N/A | Drivers: 40mm | Driver type: Dynamic | Sensitivity: N/A | Impedance: N/A | Battery life: 24 hours | Wireless range: 100 meters (330 feet) | NFC: NoIf you're a frequent traveler you're probably all too familiar with headphones that can't hold a charge and can't block out sound, let alone sound very good. Let us introduce you to the Plantronics BackBeat Pro 2, one of the few headphones on the market that can do all of the above and cost less than half as much as one of the bigger names like Beats, Bose and Sony. They also include a neat little feature that allows them to automatically turn off when you're not wearing them, meaning you're able to easily maximise their battery life without much effort. If we had to boil it down to its core, the BackBeat Pro 2 offers an excellent travel headphone with incredible battery life, supreme comfort, the ability to pair two device as once and, most importantly, good sound quality for the cost.Read the full review: Plantronics BackBeat Pro 2One of the best neckbuds for the priceAcoustic design: Closed | Weight: 18 grams | Frequency response: 20Hz - 20kHz | Drivers: 6mm | Driver type: Dynamic | Sensitivity: 92dB +/-3dB | Impedance: 32 Ohms | Battery life: 8 hours | Wireless range: 98 feet | NFC: NoAfter spending several weeks with the RHA MA390 Wireless, we came away extremely impressed with the package RHA has come up with. The headphones are built extremely well, have a fun sound signature, and can take a beating. And all at an affordable price. It’s main rival, the OnePlus Bullets Wireless, are also excellent, however we give the nod to the RHA MA390 for its more dynamic sound and better build quality. Read the full review: RHA MA390 WirelessOne of the best true wireless earbuds you can buyAcoustic design: Closed | Weight: N/A | Frequency response: 20Hz - 20kHz | Drivers: N/A | Driver type: N/A | Sensitivity: N/A | Impedance: N/A | Battery life: 4.5 hours (13.5 hours in charging case) | Wireless range: N/A | NFC: NoAll things considered, the Jabra Elite 65t are one of the best truly wireless headphones you can buy today. They cost slightly more than the Apple AirPods but they also offer better sound quality, noise isolation and adjustable ambient noise when you want it. And if you don’t like the design of the odd, alien-looking AirPods, the mature, understated look of the 65t may be to your liking. While the Jabra Elite 65t are easily one of the highest scoring true wireless headphones we've reviewed, there are a few others on the market worth considering: If you want a pair of exercise earbuds, there’s the Jabra Elite Sport which has a higher water resistance and handy sports-oriented features. For audiophiles who don’t mind stretching the budget, the active noise cancelling Sony WF-1000X are an excellent choice. Bassheads will want to try the SOL Republic Amps Air.  If you only have the budget for one of these, though, go for the Elite 65t.Read the full review: Jabra Elite 65tPress on to page two to see how to pick out a good pair of headphones along more of our recommendations.Check out our videos below for a roundup of the best headphones available.\nCurrent page:\n\nBest headphones 2018\n\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}