{"id": "TechRadarBest on-ear headphones 2018: our pick of the best supra-aural cans", "paragraph": "\nBy\nNick Pino\n2018-11-12T16:07:00Z\n\nPortable audio\n \n\nBest On-Ear (Supra-aural) Headphones: Welcome to TechRadar's guide to the best on-ear headphones you can buy in 2018. Remember the story of Goldilocks and the Three Bears? Our favorite part, and the one that's most applicable here, is the part about the beds being too small, too big and finally, after a lot of trial and error, the one that was just right.In the world of headphones, on-ear headphones (also called supra-aural headphones) are the middle child between bulky over-ear headphones and diminutive in-ear earphones. For most folks, they're just right. Their name comes from the fact that their cushions sit on, rather than over, your ears. This means they're more compact and can travel with you without taking up a ton of room in your bag. Conversely, they're bigger and more comfortable to wear for long periods than in-ear headphones. The reason you'd pick this form factor over the other two is that you're a traveler, a commuter or a home listener who needs a bit of noise-cancellation without the bulk of over-ears. It's a winning combination, honestly, and a form factor that we've tested extensively over the years.To that end, and to help you pick out a great pair of on-ear headphones, we've corralled our top-rated on-ear headphone reviews, so that you can do all your research and make a purchase in one place.[Update: Black Friday is coming up very soon, so if you're thinking of buying a new pair of over-ear headphones, we recommend that you hold off until November 23. To stay up to date with all the latest deals news, make sure you bookmark our Black Friday and Cyber Monday deals page.]Truly excellent sound performance for a stellar price Acoustic design: Open | Weight: N/A | Cable length: N/A | Frequency response: 20Hz-20,000Hz | Drivers: N/A | Driver type: Dynamic | Sensitivity: 99db | Impedance: 32 ohm | Battery life: N/A | Wireless range: N/A | NFC: N/AFor your money, you can't do any better than Grado's SR60e. The third-generation of the Brooklyn, NY-based company's Prestige Series is its best and most refined yet. The SR60e in particular is a smart choice if you're looking for an entry-level set of headphones that sounds like it should cost you way more than it does. Their open-backed ear cup design makes them a more breathable experience than what most on-ear headphones can deliver, although this does mean that they're not ideal for use in loud environments where sound can 'leak' in and disrupt your listening. That said, in terms of pure sound quality, they're our gold-standard when it comes to on-ears.(Our review is for the SR60i, but the newer SR60e headphones are largely similar in design and performance)Read the full review: Grado SR60eExecutive looks with great sound reproductionAcoustic design: Closed | Weight: 155g | Cable length: N/A | Frequency response: N/A | Drivers: 40mm | Driver type: Dynamic | Sensitivity: N/A | Impedance: N/A | Battery life: N/A | Wireless range: N/A | NFC: N/AThere is a lot to love about the Philips Fidelio NC1 headphones: Not only are they a joy to wear and offer up great sound reproduction, but they're also one of the lightest and most compact ANC headphones around. They're best suited for frequent travellers who don't want to lug massive cans around with them all of the time but also don't want to compromise on sound quality. To that end, they offer superb sound that's balanced and warm and while I would love to see a wireless range, the cable offered in the mix is dextrous enough to not worry about it. Read the full review: Philips Fidelio NC1Wireless noise-cancellation from the mid-range masterAcoustic design: Closed | Weight: 199.4g | Cable length: N/A | Frequency response: 10-22,000Hz | Drivers: N/A | Driver type: N/A | Sensitivity: 111dB SPL/V@1kHz | Impedance: 32 ohms | Battery life: 15 hours | Wireless range: N/A | NFC: NoIn recent years AKG has dominated the budget and mid-range headphone space. While most other headphones at these price points chase after the bass-addicts, AKG has been content to stick to what it knows best; namely headphones that offer a balanced, refined sound you'd normally find in more expensive cans. With the AKG N60NC Wireless headphones the company appears to be stepping out of its comfort zone a little. The aluminium accented design is more flashy than AKG’s usual fare, and the noise-cancellation combined with wireless operation pushes the N60NCs to the upper end of the company’s normal price points. Read the full review: AKG N60NC WirelessStreet-wise wireless headphones with smart features Acoustic design: Closed | Weight: 195g | Cable length: 32 inches | Frequency response: 5 - 30,000 Hz | Drivers: N/A | Driver type: Dynamic | Sensitivity: 105 dB | Impedance: 28.5 Ohms | Battery life: 18 hours | Wireless range: N/A | NFC: NoThe V-Moda XS are the perfect travel buddy for audiophiles. It’s balanced and detail-rich sound is a pleasure to listen to, plus, it’s built like a tank. While the bass could use a little more impact, we had little complain about the sound. However, that said, the XS has a loose fit on the head and barely blocks out any sound, which isn’t ideal for working out or for commuters. If you're a sedentary listener, however, these are great. In terms of competition, the Klipsch Reference On-Ear II are an excellent alternative that can block out more external sound. However, the trade off is the extended and exciting highs of the V-Moda XS as the Klipsch has more high frequency roll-off.  Read the full review: V-Moda XSLuxurious feeling – and sounding – headphones for discerning listenersAcoustic design: Closed | Weight: 240g | Cable length: N/A | Frequency response: 5-30,000Hz | Drivers: 40mm Beryllium Diaphragm | Driver type: N/A | Sensitivity: N/A | Impedance: 32 ohms | Battery life: 16 hours | Wireless range: 30 meters (98ft) | NFC: NoIf you can afford the steep price, the Master & Dynamic MW50 will not disappoint. These headphones are a simply work of art and feel every bit as expensive as their price commands. They sound great with all types of music and are one of the most comfortable on-ear headphones we’ve ever tested. Those looking for value, however, will want to look elsewhere.Read the full review: Master & Dynamic MW50An excellent-sounding pair of headphones without any frillsAcoustic design: Closed | Weight: .44 pounds | Cable length: N/A | Frequency response: 20HZ-20kHz | Drivers: Two 1.5\" drivers | Driver type: Dynamic | Sensitivity: 110db | Impedance: 32 ohms | Battery life: N/A | Wireless range: N/A | NFC: N/AThe Klipsch Reference On-Ear II is the follow up to the previous year’s excellent Reference On-Ear model, a previous resident of this list. Admittedly, this year's model doesn’t change much in terms of design or sound – but why fix something that’s not broken? That said, Klipsch kept it simple with the Reference On-Ear II, concentrating on sound, comfort and portability that will please audiophiles. Only diehard audiophiles will even consider this wired-only headphone after looking at the price tag, but those who value sound and comfort above all else will be happy with the Klipsch Reference On Ear II.Read the full review: Klipsch Reference On-Ear IISamsung crashes the wireless noise-cancelling party Acoustic design: Closed | Weight: .7 pounds | Cable length: 3.6 feet | Frequency response: 20Hz to 20kHz | Drivers: 40mm Dual-Layered Diaphragm | Driver type: Dynamic | Sensitivity: N/A | Impedance: N/A | Battery life: 8 hours | Wireless range: 30 meters (98ft) | NFC: YesThe Samsung Level On Pro Wireless are one of the few headphones we've tested that feel like they're meant as a package deal for another device. Yes they'll work with every Bluetooth and 3.5mm jack-equipped device on the market, but you're better off sticking to a Samsung device in order to squeeze every ounce of aural goodness from the UHQ audio codec.But it's one of the comfiest pair of cans on the market, and one of the best noise-canceling, too. If it had a better sound quality for the vast majority of cell phone users it would be an easy recommendation but it really makes the most sense at checkout when purchased alongside Samsung's Next Big Thing.Read the full review: Samsung Level On Pro Wireless HeadphonesThese raise the bar for design and performance Acoustic design: Closed | Weight: .42 pounds | Cable length: 3.9 feet | Frequency response: 10Hz-20kHz | Drivers: Two 1.5\" drivers | Driver type: N/A | Sensitivity: 108db | Impedance: 22 ohm | Battery life: N/A | Wireless range: N/A | NFC: N/AThe Bowers and Wilkins P5 Series 2 aren't the most feature-rich option, but in terms of sheer sound and build quality, they easily raise the bar for the competition to follow. They look fantastically stylish, and sound just as good. So long as you have the money, there's not much else in the on-ear market that can match this package.Read the full review: Bowers and Wilkins P5 Series 2On-ear headphones that are easy on the wallet, great on the earsAcoustic design: Closed-back Dynamic | Weight: 190 g (6.7 oz) | Cable length: N/A | Frequency response: 5 – 32,000 Hz | Drivers: 40mm | Driver type: Dynamic | Sensitivity: 102dB | Impedance: 32 ohms | Battery life: 40 hours | Wireless range: 30 feet (10 meters) | NFC: NoYou, like everyone else, probably wants a set of headphones that nails the tricky blend of design, useful features and incredible sound. You might think that you need to flush your savings to enjoy such a pair of cans. Protip: you don't.The Audio-Technica ATH-S200BT are a well-built, great-sounding, long-lasting pair of headphones. Their features constantly outweigh their modest price and we can’t get enough of that 40-hour battery life. While technological advancements usually mean a premium price, that's just not the case with the Audio-Technica ATH-S200BT. Read the full review: Audio-Technica ATH-S200BTFashion-focussed cans that cater to bass loversAcoustic design: Closed | Weight: 215g | Cable length: N/A | Frequency response: N/A | Drivers: N/A | Driver type: N/A | Sensitivity: N/A | Impedance: N/A | Battery life: 40 hours | Wireless range: 30+ feet | NFC: NoWhile the Samsung Level On Pro Wireless are best paired with a Samsung Phone, the Beats Solo 3 Wireless come into their own when paired with an iOS device thanks to its W1 chip that makes for excellent wireless connectivity. At first glance, the Solo 3 Wireless appear almost identical to the Solo 2 headphones that proceeded them. The majority of the changes Apple made to its class-leading cans come internally, baking its mobile phone know-how into these headphones to ramp-up their wireless skills and maximise battery life. In terms of wireless performance, these $299 (£249/AU$399.95) headphones are as reliable as any out there. However, you can get significantly better sound quality at the price. (See: entries one through nine.)Read the full review: Beats Solo 3 WirelessGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}