{"id": "TechRadarShould I buy a Surface Pro?", "paragraph": "\nBy\nNate Drake\n2018-11-12T16:02:30Z\n\nLaptops\n \n\nThe Surface Pro is part of the Microsoft series of touchscreen Windows 10 personal computers. It is a professional hybrid (also known as a 2-in-1) tablet which comes with detachable keyboard accessories and a stylus pen. The first Surface was launched in October 2012 with the Surface Pro arriving in February 2013. There have now been six Surface Pro models, with the latest Surface Pro 6 only released in October of this year. The Surface Pro 6 followed the Surface Pro LTE which was released in 2017. Microsoft refrained from calling this the 5th Surface Pro, as it felt that the next generation should only be numbered when it has made some truly huge advancements in relation to its features and components. However, while the 5th generation was actually a marked improvement on its predecessors, little progress has been made when it comes to the 6th.The guide below is not based on testing done by us but is determined by our expert tech take on online reviews and the listed specs.Meanwhile, don’t miss our guide on how to get the very best Black Friday laptop deals.While there are now six entries in the Surface Pro series, we will be focusing on the fifth generation, and the Surface Pro 6 when it comes to pricing.The fifth generation Surface Pro, released in 2017, starts at $799 (£599, AU$1,199) and includes Intel Core m3, 128GB SSD and 4GB RAM. For another $200 you can get the Intel Core i5 with 128GB SSD and 8GB RAM. For $1299 you can get the Intel Core i5 with 256GB SSD and 8GB of RAM.In the UK, a model with a Core i5 processor, 256GB SSD and 8GB RAM costs £779.The Surface Pro 6 starts at $899 (£879, AU$1,349) for Intel Core i5 with 128GB SSD and 8GB RAM. The price increases depending on the configurations you choose. The options available are up to 16GB RAM, Intel i5/i7 and up to 1TB of storage. If you select the most powerful specs available, 16GB RAM, the Intel Core i7 and 1TB of Storage, you’d pay $2,299 (£2,149. AU$3,200).This is a good deal more expensive than the Lenovo Yoga 730 which weighs in at $1099.99 (about £850, AU$1,500) with 16GB RAM and 512GB SSD. However, it does have nearly twice the storage space. The Surface Pro 6 with the same specs as the Yoga would cost you $1899 (about £1,400, AU$2,600). As impressive as these custom options are, the small screen and lack of graphics cards means the Surface Pro isn’t ideal for intensive processes such as video editing and recent PC games. This is a shame as for not much more you can buy the Dell XPS 15 2-in-1 with the same specs along with an integrated 15.6-inch 4K display and dedicated GPU.The latest Surface Pro models comes with Windows 10 pre-installed. Unlike some other competing devices, the system is mercifully free from bloatware.The most recent Surface devices support Microsoft Hello out of the box. This facial recognition feature works with the Surface’s built-in infrared camera, allowing you authenticate via ‘Faceprint’ instead of traditional passwords. Microsoft Hello is also supported by less expensive devices like Lenovo Yoga and HP Spectre but as the Surface’s hardware has been designed by the same company it stands to reason that compatibility will never be an issue.If you already own a Windows device, Microsoft offer a free training session with purchase of new Surface devices to transfer your old data across and tailor the device to your needs.If you chose to purchase directly from the Microsoft Store, then you will receive a one year limited hardware warranty.Both the Surface Pro and the Surface Pro 6 do not come with the attachable keyboard or the Surface Pen. These cost $160 (£124.99, AU$249) and $99.99 (£99.99, AU$139.95) respectively. However, discounts are offered when you bundle the keyboard and the pen with the device during purchase in the Microsoft Store. Both models weigh under 2lbs and offer a sleek design. Microsoft introduced a hinge for the fifth iteration that would tilt back even further than previously. This allowed users to view in ‘Studio’ style, and it's a design choice that carried over onto the Surface Pro 6.Battery life was also increased with the 2017 mode by 20%. The company claims up to 13.5 hours of video playback. The same has been promised with this year's model. This is two hours longer than the playback offered by the Lenovo Yoga.Despite its minuscule weight and width, the Surface Pro supports the kind of ports you’d expect to find on a regular laptop. The two latest versions come with a regular USB 3.0 port, which means unlike recent MacBook's no special adaptor is required. The devices also have a MicroSD card slot, mini display port and a standard 3.5mm headphone jack.Aside from offering a range of Surface keyboards and stylus pens, buyers can also purchase a number of colorful covers via the Microsoft Store. This is useful not only as a place to store your accessories but is also a way to brighten up the Surface Pro itself, which is only available in black or gray.The Microsoft Surface Pro is sleek, powerful and highly customizable. Its main selling point is that it has the convenience of a tablet while running the full Windows 10 operating system. Users are free to use the Surface Pro on its own as a touchscreen device or use the stylus and keyboard, making it a wonderfully versatile device.However, the Surface Pro range falls down on price when compared to similar 2-in-1 devices such as the Lenovo Yoga 730,  which has similar hardware specs and keyboard for a much lower price.Having criticized the Surface Pro for its smaller screen and graphics processing power compared to similar devices, the device is definitely suitable for day-to-day computing tasks such as word processing, video streaming and web browsing. Its miniscule size also means it will nestle comfortably in a student’s backpack or briefcase unlike more bulky laptops.It’s hard to overstate how much thought has been put into making the Surface Pro range as sleek as possible: it's over 1lb lighter than the similarly-sized HP Spectre.That said, buying a Surface Pro with the same specs as the HP Spectre costs a fair bit more, so you may prefer a device that’s lighter on your wallet if not your shoulders.If you have your heart set on a Surface Pro make sure to check out our guide to the very best Black Friday deals, to see if any discounts are available. You'll also see our pick of the best Surface Pro deals below.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}