{"id": "TechRadarSamsung The Frame TV (2018) review", "paragraph": "\n\n \n \n \n\n\nBy\nHenry St Leger\n2018-10-19T22:32:41ZTelevisions \nSamsung brings build quality to the forefront with its eye-catching The Frame 2018. It’s not a top-tier picture, and really comes into its own as a smart display for artworks rather than standard television use – but as a living room centrepiece, The Frame 2018 feels right at home.The essence of every picture is the frame, as the saying goes. That’s something Samsung have truly taken to heart for The Frame: a fashion-forward slab of sleek metal that doesn’t try to hide its frame so much as place it center-stage.We saw the first version back in 2017, and this year’s new iteration – The Frame 2018 – continues to offer a lifestyle take on a high-end 4K UHD TV. You’re buying this for its impact on a room, really, rather than any snazzy QLED display. But the craftsmanship and artistic sensibilities this backlit LCD panel is what makes The Frame truly stand out from the crowd.We sat down with Samsung’s new set to see if it really offers a premium experience – and what might have fallen by the wayside.The Frame 2018 is currently available to buy in three sizes, starting at £1,199 (or $1,299 / AU$1,799) for the 43-inch model.That figure goes up to £1,799 ($1,999 / AU$2,699) for the 55-inch set, or £2,499 ($2,799 / AU$3,899)  for the 65-inch. You can buy The Frame 2018 globally from a range of major retailers – or just Samsung’s online store.Those US prices are RRP – though, as we’re in the Black Friday and Cyber Monday season, Samsung is currently running an offer to knock $100, $500, and $600 off the respective models stateside on their online store.Samsung’s LCD set may have a QLED price point, but it’s clear from the build quality that the money’s still been well spent.The 55-inch model we reviewed came in a gorgeous, burnished metal frame, encasing the LCD panel and various vents along the sides. Available colors include black, white, walnut, or beige wood – though buyers at John Lewis can get an exclusive copper finish if they’d prefer.The casing is technically a magnetic bezel that can be attached or replaced from the main body of the television, allowing you to vary the look of the set with relative ease. Want to go for a different color scheme, or just something to match your new furniture? Just swap out the bezel.The Frame 2018 comes in at a chunky 18.6kg, and can be either wall-mounted or set up on two sturdy feet – which will lift it a couple of inches off a floor or counter. The former option will suit the set’s picture frame aspirations a lot more, though, and can be installed ‘flush’ to the wall, so it hangs without an unsightly gap between it and the wall.How much space the set takes up will depend on the size you go for and how you choose to display it, but this is a TV with no interest in a thin, flat screen, so it’s likely to dominate all but the largest rooms in your home.And even if the TV is weighty, it carries that weight in style. The Frame 2018 comes with the One Connect box of the Samsung QLED range, which outsources all the messy ports and cables away from the sightline of the TV. All that power, HDMI, and AV goodness is then linked up to the back of the television via a single, slim wire – which can then be tucked alongside the underside of the TV to keep out of view.Along the back of the One Connect box are (from left to right) a power port, ExLink – for Samsung technicians – satellite, AUX output, common interface, optical, ethernet, four HDMI 2.0, and the port that actually links all that up to the TV.In keeping with other 4K Samsung televisions, The Frame comes with both a standard button-laden remote and a sleeker, trimmed down version with a handful of the most used inputs – source, power, playback, channel, and volume. The latter isn’t quite as high-flying as the metal remote found with the Q900R, but is still a good deal better looking than the usual mess of a layout found on universal remotes. (Batteries are included for both).Design TL;DR This set is all about the looks, and it pays off. The Frame 2018 carries its weight and makes for an attractive hybrid of decor and hardware.Samsung’s own smart TV platform, Tizen OS, keeps things uncluttered with a tidy menu banner that runs along the bottom of the screen.Samsung doesn’t offer access to Freeview Play, though you’ll find integrated apps for the likes of BBC iPlayer, All 4, BBC News, Netflix, Youtube, Facebook, Spotify and Deezer along with numerous other catch-up apps on the smart hub’s app store. There’s also the free TVPlus service for all sorts of live streaming TV content alongside terrestrial channels.The main smart hub will show up films to purchase and channels to watch, and you can even customize the TV’s notification settings to be forewarned when a favorite TV show – or even a particular sports team – is due to make an appearance. It’s a feature that makes even more sense when you think the TV is likely to be on or in Art Mode for most the day. This is alongside an option to input your favorite genres – drama, sport, etc – and ensure they’re prioritized when listing titles and channels on the home page.But the real focus of The Frame isn’t the catch-up services or TV channels – despite it being, you know, a TV – it’s the Art Store.The Art Store is where you can access hundreds of artworks and paintings for display on your 4K panel screen. The selection is pieced together from collections at the V&A Museum, the Tate Gallery, and Van Gogh Museum, hosting a far wider collection than its original 100 picture offering, across various categories such as architecture, wildlife, landscape, and the like.You can then create your own ‘playlist’ of images to switch between at regular intervals, or just host your favorite Van Gogh painting 24/7. Not to mention the option to upload your own photos or images and stick them in the mix, turning your £1,299 television into what amounts to a massive digital picture frame.There’s a wide selection even without sourcing your own holiday snaps, and the thrill of seeing a digital recreation of classic paintings and curated watercolors in 4K detail is not to be underestimated. It certainly makes watching the TV feel like more of a worthwhile effort, and keeps the set fulfilling a useful function even when you’re not directly using it.That hits at the The Frame’s primary design focus: when most TVs tend to be left unused for hours on end, why not have a set that can blend in with the furnishings, or at least provide something nicer to look at that an empty black screen?Samsung has intriguingly re-positioned the television as a lifestyle furnishing, and  The Frame just about gets away with it. (That said, while the artwork is nice, we were sad not to see the blended wallpaper effect of Samsung’s Ambient Mode, which uses smartphone app to recreate the patterns around the TV on the screen itself.)Concerned The Frame will turn your living room into a 24-hour art gallery? Don't be. You can just turn the TV off completely if you want to – or set a timer so it knows when everyone in the house has likely gone to sleep.Smart TV TL;DR Samsung's Tizen OS does the job with an uncluttered interface and Bixby voice commands for those out-of-way apps. But the ability to display hundreds of classic, curated paintings are what makes this set truly stand out.For all our talk about the design and Art Store features, this is still, obviously, a television, and at some point you’ll be using to view televised content ... even if Samsung’s lifestyle television is less interested in the picture than its frame. So, how does it fare?To start, this is a 4K screen, so the HD and SDR content that makes up most of your TV and streaming services is having to work hard to upscale to fill all those extra little pixels.Thankfully, the result is a nice picture. While you’re not getting the high-end processing you would on a QLED model – or basically anything else at this price tag – there’s a good amount of visual detail and a generally good sense of color contrast.We had some small but consistent issues with artefacts and blocking when upscaling, especially from SDR, but not at the expense of a generally capable picture. More vivid colors on the end of the spectrum are however wont to cause trouble: the cyan and pink title screen of Killing Eve could lead to some disconcerting flashing and blocking around the letters.We could definitely see these issues being small enough for buyers wanting The Frame TV 2018 for the more decorative features it sells itself on and the upscaling will be less of an issue for the smaller 43-inch model, anyhow.We recommend keeping the set’s Movie Mode on as a general rule, as it does it good job of balancing the color contrast and keeping the picture looking somewhat natural. The Dynamic and Natural modes, however, really only served to throw those settings out of sync – not ideal for anything other than experimentation.HD/SDR TL;DR The Frame 2018 can struggle with vivid colors and upscaling from SDR, but the picture is enough to get by on for the price.The Frame 2018 settles in a lot more comfortably with 4K content more suited to its 3,840 x 2,160 pixel screen. The Frame comes in at just under 500 nits peak brightness, which is a bit low considering the vast swath of HDR1000 (HDRT TVs with 1000 nits peak brightness) on the market.Worse, despite Samsung’s ‘UHD Dimming’ zones, anything like a flash of bright light or even gleaming surfaces could somewhat ruin the action onscreen.The picture comes across best with darker scenes and moodier palettes, more in keeping with the pensive gallery atmosphere of contemplating the paintings in the TV’s Art Store. When watching Netflix’s German supernatural thriller Dark in Ultra HD, the show’s ominous landscapes and slow-moving action was perfectly suited to the set’s strengths, resulting in a sharp, reliable picture with minimal artefacts.As a television made for viewing throughout the day in some capacity or another, it shows through well even in well-lit rooms, and you won’t find yourself squinting to see the sharper details of what’s onscreen.That said, poor overall contrast – and lack of fancier QLED technology – means you won’t get very deep blacks here. There’s a lot of gray on display.When trying out Shadow of the Tomb Raider, the set was able to admirably display a huge amount of visual detail and environmental effects in the game’s large jungle vistas. We can’t say the same for the frame rate, however, which dropped repeatedly when running through more crowded areas or suddenly switching the camera angle. (Motion smoothing, we're looking in your direction.)There’s a dedicated Game Mode that switches on automatically when you switch over to a console input, aiming to minimize input lag by reducing some of the image processing techniques that go into maintaining a smooth picture. The problem was the set kept switching in and out of this setting throughout our play session, which was more disruptive than not having the option at all.That said, some small but consistent issues prevent this being a suitable gaming display, but that’s probably not what you’re buying it for in the first place.4K/UHD TL;DR Detailed 4K that's nonetheless let down by bright image blur and a suffering frame rate. Not one for gamers, either.The Frame TV 2018 features a pair of full-range downward-firing speakers, with a total 40W output. The sound’s certainly not disappointing, and packs in a decent amount of heft, though it won’t replace a dedicated hi-fi system or soundbar.There are naturally AUX ports to outsource the audio responsibility to some more capable speakers, though the accumulation of more boxes and kit around the TV might undermine its minimal, unobtrusive aesthetic.We did find some distortion at lower frequencies, though it was only really noticeable when playing tunes through the TV’s Spotify app. So The Frame’s speakers aren’t likely to replace your audio setup, but they’re more than enough to accompany day-to-day watching.The Optimized sound mode is a useful setting for emphasising bassier tones and SFX, though it does so at the expense of higher frequencies. The Amplify setting, meanwhile, works best for talking heads and drawing out vocals. In most cases you’re fine with the Standard mode the audio runs on automatically.Sound TL;DR It's not going to replace your hi-fi system, but the 40W speakers pack in all the volume you'll need right out of the box.The other panels you might want to consider alongside this one depends on what you’re looking for. If The Frame simply isn’t fancy enough, then Samsung have just released their first 8K television, the Samsung Q900R. It doesn’t have the overt styling of The Frame, and comes in at several times the price, but the picture quality itself is nothing short of magical.The real elephant in the room here is Samsung’s QLED range. For roughly the same price of The Frame, you can get your mitts on the Samsung Q7FN or Samsung Q8FN, both of which offer a far superior picture than The Frame’s back-lit LCD panel.You can check out a wider sample set in our round up of the best Samsung TVs.A boldly designed television fused with artistic sensibility, The Frame re-positions the goggle-box as aesthetic decor rather than an appliance.The 4K LCD display isn’t Samsung’s best, and watching anything too demanding in terms of onscreen motion or bright lights is likely to bring about some irritating blur and blocking effects. Much like a picture frame, Samsung’s gallery-minded television is best seen as a background feature, rather than something stared at directly. But for those looking for a lifestyle item and furnishing as much as a television, and who want their set to be contributing to the decor throughout the day rather than throwing a black box in the middle of your painstaking color scheme, The Frame 2018 is a beautifully-crafted piece of kit that manages to succeed on its own terms.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}