{"id": "TechRadarRed Dead Redemption 2 on PC: could it happen?", "paragraph": "\nBy\nHenry St Leger\n2018-11-06T12:07:36Z\n\nGaming\n \n\nCould Red Dead Redemption 2 come to PC? It looks likely.Rockstar's open-world Western game Red Dead Redemption 2 launched to huge acclaim in late October, albeit as a console exclusive for Xbox One and PS4. While that's not exactly a restrictive release, committed PC players have been left twiddling their thumbs in the vague hope of a PC port coming down the line. Players hungry for a high-spec or 4K experience can opt to play the game on the PS4 Pro or Xbox One X, but there's nothing quite like a souped-up PC rig to bring out the finer details and see what Rockstar's game engine can really do.So if you don't have a console from Sony or Microsoft, what are your prospects for getting your hands on Read Dead 2 any time soon? We've run through all the latest rumors pointing to a PC release, and made our best guesses for when we'd expect it to land.Rumors kicked off in mid-October after the online retailer MediaMarkt listed a PC version of the game on its website, with a placeholder date of December 31, 2019. The listing has since been pulled, however.Things heated up again after a LinkedIn profile for a Rockstar employee appeared to list credits as a programmer on the PC version of the game – though this, again, was amended after the media attention that attracted.The firmest clues we have appeared when Rockstar released a mobile / tablet companion app alongside the new Red Dead game, mainly as a hub for viewing in-game stats, journal entries, and map locations (see image below).Red Dead Redemption 2 companion appSome savvy data-mining, though, contained references to PC-quality graphics settings – shadow quality, grass rendering, and the like – as well as lines explicitly naming PC, such as 'PARAM_companionAutoConnectIpPC' or 'CommandIsPcVersion(void)'. You can see the full list on Rockstar Intel.There's also a reference to 'Oculus', which can only really refer to VR capability for the game. Given the option to play the entire game in an immersive first-person perspective, virtual reality would be a natural fit – and Red Dead 2 VR would be most at home on a dedicated Oculus or PC-bound headset.Red Dead Redemption 2: ripe for VR?So when could Red Dead Redemption 2 come to PC? At this point Rockstar is unlikely to make an announcement before the end of 2018. If anything, an announcement in January could be a savvy move to keep up interest in the new year.While 2010's Red Dead Redemption never came to PC, previous Rockstar games like GTA IV or GTA V both took around six months to make the jump to PC after their initial console launch. So that means we could be looking at an April/May 2019 launch date this time around.Given the scale of the the open-world game, it's not wholly surprising for a PC port to follow a few months after – it takes a lot of work to get the game running on different systems. But the longer PC gamers have to wait, the less likely they are to maintain their anticipation. And if the game gets delayed too long, it may end up competing with CD Projekt Red's similarly open-world Cyberpunk 2077, which is expected to release in early 2019. Sure, the open plains of Rockstar's Western seem a world away from a neon Blade Runner-esque dystopia – but gamers only have so much time on their hands, and both developers are unlikely to want to be competing directly.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}