{"id": "TechRadarBest over-ear headphones 2018: the best-sounding, most comfortable cans", "paragraph": "\nBy\nNick Pino\n2018-11-06T14:44:00Z\n\nPortable audio\n \n\nBest Over-Ear Headphones Buying Guide: Welcome to TechRadar's round-up of the best Hi-Fi over-ear headphones you can buy in 2018. When it comes to raw sound quality, nothing beats the sonic immersion that a pair of decent over-ear headphones can provide. If pristine audio performance is what you're after, you can simply do no better than the headphones you'll find here.Now, that does mean making a few trade-offs. That might mean buying a pair of wired headphones instead of wireless ones, or losing out on features like active noise cancellation so audio can sound as neutral as possible.If you're looking for the best wireless headphones and best noise-cancelling headphones guides specifically, we can help you out, but don't feel bad if you're specifically looking for Hi-Fi headphones and don't mind shaving off some of the non-essential features to get it. With that said, this guide will focus on sound quality above all else. There are a couple of wireless and noise-cancelling equipped choices in our list, but that's only because they sound great in addition to packing these features.  Has something changed since the last time you visited this page? That's completely normal. We're always updating this guide with the best headphones - which, as you can expect, changes frequently. That said, you can expect this guide to be as up-to-date as we can get it on any given day, ensuring that you're getting out top picks all year round. Without further ado, here's our guide to getting the most for your money, whatever your budget. BEST SOUND: Professional headphones that know how to have funAcoustic design: Open | Weight: 370 g | Cable length: 9.8 ft or 3.9 ft | Frequency response: 5-40,000Hz | Drivers: N/A | Driver type: N/A | Sensitivity: 102dB | Impedance: 250 ohms | Battery life: N/A | Wireless range: N/A | NFC: N/AWhile Beyerdynamic may not be as well known as its German brother, Sennheiser, the audio company has a history of creating some of the best sounding audio gear on the market – the company’s DT770, DT880 and DT990 were renown for their excellent build and sound quality. Above them all, however, stands the Beyerdynamic DT 1990 Pro, an open-back version of the Beyerdynamic DT 1770 Pro, a headphone which won our Editor’s Choice for its imaging, design and value for the money. Both headphones are priced the same ($599, £589, AU$1,159), so you won’t find a deal picking up one over the other. The difference here comes down to sound. As they’re open-back, the DT 1990 Pro are meant to be used at home or in the studio for serious analytical listening. Sound is able to get in and out but the good news is that the open-back design gives you the DT 1990 Pro a great sense of space. Soundstage is quite wide, too, allowing even the most lackadaisical listener to pinpoint the exact location of where each instrument is playing.  If you've been searching for a pair of Hi-Fi headphones that are used by some of the world's leading audio engineers, these are them.Read the full review: Beyerdynamic DT 1990 ProBEST VALUE: Brilliant headphones for a brilliant price Acoustic design: Open | Weight: .85 pounds | Cable length: 9.8 feet | Frequency response: 5-40,000Hz | Drivers: Two 1.9\" speakers | Driver type: Dynamic | Sensitivity: 100 dB @ 1mW | Impedance: 30 Ohm | Battery life: N/A | Wireless range: N/A | NFC: N/AThe Philips Fidelio X2's are a superb pair of headphones offering premium comfort and build quality with a sound that rivals even the most vaunted audiophile cans. Perhaps on sheer sound quality they're a notch off the likes of the top Oppo or Sennheiser offerings – but the fact that you'd be saving vast amounts of cash by opting for the Philips is just a no brainer.Read the full review: Philips Fidelio X2ENTRY-LEVEL AUDIOPHILES: Recording studio pedigree, DJ booth price Acoustic design: Closed | Weight: 1.5 pounds | Cable length: N/A | Frequency response: 5-40,000Hz | Drivers: N/A | Driver type: Dynamic | Sensitivity: N/A | Impedance: N/A | Battery life: N/A | Wireless range: N/A | NFC: N/AThe Beyerdynamic DT 1770 Pros are a stunning pair of headphones. Are they expensive? To some no, to most yes; but for the sheer listening experience they deliver you'd be hard pressed to take them off after putting them on, even using them with portable HRA players and mobile phones.That said, they really do push the boundaries of what you can do with a dynamic driver. All praise to Beyerdynamic for putting together such a wonderful product.Read the full review: Beyerdynamic DT 1770 ProGOLD STANDARD: The Sennheiser HD800 is the headphones fit for kingsAcoustic design: Open | Weight: 330g | Cable length: 3m | Frequency response: 14 – 44,100 Hz | Drivers: N/A | Driver type: N/A | Sensitivity: N/A | Impedance: 300 ohm | Battery life: N/A | Wireless range: N/A | NFC: N/AThe fourth entry on our list easily could've been the first if it didn't cost well over $1,000/£1,000. The Sennheiser HD 800 are, hands down, one of the best-sounding pairs of over-ear headphones on the planet, affectionately praised by inner circles of audiophiles the world over. When paired with the proper hardware, they sound absolutely excellent – balanced in every way. Unfortunately, they're supremely expensive and require more audio equipment than the average consumer is ready to buy. Should you find yourself in need – or, let's be honest, in want – of amazing over-ear headphones, these are them.Read the full review: Sennheiser HD 800BARGAIN AUDIOPHILE: Excellent sound at an affordable priceAcoustic design: Closed | Weight: 0.65lb (293g) | Cable length: 4.40ft (1.35m) | Frequency response: 20 – 40,000Hz | Drivers: 137/64“ (40mm) | Driver type: Dynamic | Sensitivity: 104dB SPL @ 1kHz | Impedance: 32 Ohms | Battery life: N/A | Wireless range: N/A | NFC: N/AIf you’re looking for a pair of audiophile headphones that won’t break the bank, the 1MORE Triple Driver over-ear is a great place to start. Its build quality and detailed sound really impress and we think bass-lovers will like the slight mid-bass emphasis and control in the lower registers while not sacrificing the mids or highs. The headphone reveals a good level of detail throughout the frequency range and never get harsh in the upper registers. To that end, it’s hard to fault the $250 (about £190, AU$338) 1MORE Triple Driver Over-Ear, making them an easy recommendation for the price. Read the full review: 1MORE Triple Driver Over-EarULTRA-PREMIUM: The B&W P9 Signature is all about the sound qualityAcoustic design: Closed | Weight: 413 g | Cable length: N/A | Frequency response: 2 – 30,000Hz | Drivers: 1.6 inch (40mm) Mylar/Titanium | Driver type: Dynamic | Sensitivity: 111dB SPL @ 1kHz – / 1Vrms | Impedance: 22 Ohms | Battery life: N/A | Wireless range: N/A | NFC: N/AThe B&W P9 Signatures are simply some of the best-sounding headphones we’ve ever used. They have a tight, refined sound that offers an almost unmatched level of detail. That said, the fact remains that they’re a comparatively feature-light pair of cans. If you want to spend less then you can get a much more portable pair that’ll be better suited to the morning commute or a plane ride thanks to additional features like noise-cancellation and Bluetooth connectivity.But, if you’re looking to invest in a seriously high-quality pair of headphones to listen to a high-quality music collection, then there are few that can match the P9s at this price point. Read the full review: B&W P9 SignatureFEATURE-PACKED: Cans that offer the whole packageAcoustic design: Closed | Weight: 23g | Cable length: N/A | Frequency response: N/A | Drivers: N/A | Driver type: N/A | Sensitivity: N/A | Impedance: N/A | Battery life: 10 hours | Wireless range: 33 ft | NFC: YesAn improvement on Sony's existing flagship, the Sony WH-1000XM2 sound great, pack excellent noise-cancellation, and manage to do this all wirelessly. Other headphones offer better sound quality, longer-range wireless connectivity, or better battery life, but the Sony WH-1000XM2 manage to offer the best balance of features and performance. It's also got a couple of interesting tricks up its sleeve like a selective noise-cancellation mode that lets in certain useful sounds, and a shortcut that allows you to quickly hear what's going on around you. Offering all of this without a serious price-premium over the competition means the Sony WH-1000XM2 are a great choice for on-the-go music listeners. Read the full review: Sony WH-1000XM2HEY GOOD LOOKING: These over-ear headphones bring both performance and value Acoustic design: Closed | Weight: .64 pounds | Cable length: 3.9 feet | Frequency response: 5-40,000Hz | Drivers: Two 1.7\" drivers | Driver type: Dynamic | Sensitivity: 100 dB | Impedance: 35 ohm | Battery life: 40 hours | Wireless range: N/A | NFC: NoAudiophiles typically shun wireless headphones because of poor sound quality. However, Bluetooth audio has improved tremendously over the years. There are now plenty of wireless headphones that can please the music enthusiast, with Hi-Res Audio support being more and more prevalent.That said, the Audio-Technica ATH-SR5BT feature some of the best wired and wireless sound quality for a headphone under $200 (£150). They play well with all music genres and offer a near-flat response curve. They're extremely comfortable for long listening sessions and are well built. Battery life is equally impressive with nearly 40 hours of playback from a charge. And while they lack some features of more expensive wireless headphones like active noise cancelling and multi-device pairing, these are tradeoffs worth making for phenomenal sound.Read the full review: Audio-Technica ATH-SR5BTWIRELESS CHAMP: Incredible audio fidelity backed by a serious price Acoustic design: Closed | Weight: N/A | Cable length: 4.6 feet | Frequency response: 16-22,000Hz | Drivers: N/A | Driver type: Dynamic | Sensitivity: N/A | Impedance: 28 ohms | Battery life: 25+ hours | Wireless range: 30+ feet | NFC: YesThe Beyerdynamic Amiron Wireless are the best-sounding wireless headphones you can buy, period. Sound is spacious, detailed, and makes you want to rediscover your music library. Their bulky design and average noise isolation make them terrible for travel but if you’re looking for the best sound from a wireless headphone, this is it.Read the full review: Beyerdynamic Amiron WirelessNOISE CANCELLING WONDERS: Bose cut the wires off its flagship cansAcoustic design: Closed | Weight: 0.68 pounds | Cable length: 3.94 feet | Frequency response: N/A | Drivers: N/A | Driver type: N/A | Sensitivity: N/A | Impedance: N/A | Battery life: 20+ hours | Wireless range: N/A | NFC: YesAfter cutting the wires off its flagship cans with the Bose QC35 headphones, Bose's QC35 II are a slightly more minor upgrade. This time the big addition is Google Assistant, which can be summoned with the press of a button. Otherwise these are more or less the same headphones that we enjoyed the first time around. The QC35s aren't the best sounding out there, but their noise-cancellation is class-leading and if that's your priority then they're a great choice. Read the full review: Bose QC35 IICheck out our videos below for a roundup of the best headphones available.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}