{"id": "TechRadar proExclusive security software deal: 35% off Avast Business Antivirus Pro Plus", "paragraph": "\nBy\nAdam Marshall\n2018-10-30T15:46:20Z\n\nSecurity software\n \n\nFirst thing's first...we really like Avast Business Antivirus Pro Plus. From all the testing we've done and reviews we've written of business antivirus, Avast's Pro product is right there at the top of our charts.So it's with great excitement that we greet the news that Avast is knocking 35% off the price off the security software package - and the discount is EXCLUSIVE to TechRadar Pro readers. You lucky things, you.\n- Click here for US and rest of the world pricing- Click here for UK pricingThe deal is that you get a mighty 35% off whatever Avast Business Antivirus Pro Plus plan best suits your business. So if you're a one man band just looking for one year's worth of protection on your Windows PC or Apple Mac, then you can get it for as cheap as $38.99/£26.12.But the savings grow exponentially if you oversee a bigger business. So just say you're a 20-strong office and want to think ahead to two years' worth of cover, the 35% discount means that you end up saving a meaty $500/£330. That's an exceptional saving on exceptional software, and gets even better the more workstations you add.Avast Business Antivirus Pro Plus | From $59.99 $38.99 (£40.19 £26.12)This is Avast's biggest and best business antivirus. That means the usual standard of protection, with a tonne more bells and whistles. It's an obvious choice f you want to be confident that your office infrastructure is as safe as possible. Hit that 'View Deal' button below to find out more - or click here if you're in the UKView DealWe rate Avast's Business Antivirus Pro as the best endpoint protection out there for businesses, so we're clearly pretty fond of the company's antivirus. It has all the usual tools and defences that you would expect from effective security software, so spam prevention, email protection, permanent data shredder and application sandboxing for particularly sensitive business data. Upgrading to Plus gets you even more features that should prove invaluable for the secure and efficient running of your business. So it adds Avast's SecureLine VPN to the package, a dedicated Webcam Shield and a tool to streamline and keep safe your company passwords.Most importantly, it has a fantastic reputation as a lean, mean virus preventing machine.Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}