{"id": "TechRadarPanasonic DMP-UB700 review", "paragraph": "\n\n \n \n \n \n \n\nBy\nSteve May\n2018-10-20T19:05:41ZBlu-ray players \nIf you want the best bang for buck 4K UHD Blu-ray performance, look no further than the DMP-UB700 – an irresistible combination of image quality, features and price.With millions of discs sold and a catalog of hundreds of titles, the UHD Blu-ray format has defied critics and appears to be finding an audience amongst keen 4Kphiles with an eye for quality. But if you want to jump on board, what UHD deck should you buy? We finally have a definitive answer: the Panasonic DMP-UB700. The second 4K Blu-ray player ever released by Panasonic, at £400 (approximately $500, AU$670) the DMP-UB700 is a good deal cheaper than its predecessor, the high falutin’ £600 DMP-UB900. But what has been sacrificed, if anything, to hit this new price point with the Panasonic DMP-UB700? Not much at all, at first glance, with the unit promising something close to content nirvana. In addition to 4K UHD compatibility, it'll spin regular Blu-rays (including 3D platters), plus DVDs and CDs. It doesn't support DVD-Audio or Super Audio CD, but it does offer High-Res Audio file support, and there's a decent selection of streaming apps on board too.Panasonic DMP-UB700 reviewDesign-wise, the Pana deck is similar to the UB900 – in a dark theatre you'd struggle to tell them apart. The chassis looks much the same, with its full-width drop down fascia, but the UB900 has a little more refinement. Look to the bottom and you’ll notice heavy-duty anti-resonance feet have been replaced by sorry-looking pads. Connectivity has also been stripped back: there's a single digital optical output, and no analog provision at all. And while the UB900 comes with a full-size remote control, the UB700 has a dumpy half-pint alternative. What you get in the box is still as functional, but it's slightly more awkward to use.Panasonic DMP-UB700 reviewSpin the Panasonic DMP-UB700 around and you'll find two HDMIs on the rear – one of which is audio only – in case your AV receiver isn't 4K UHD compatible. A typical setup would see 2160p video sent direct to your 4K telly from the main HDMI, while multichannel sound from the audio HDMI goes to a home cinema receiver. The deck also has an SD card reader and a slot for USB. Plus, in addition to a 10/100/1000 Base T Ethernet port, there's dual-band Wi-Fi here too.The Panasonic DMP-UB700 player itself is easy to use. The main menu, with buttons for Videos, Music, Photos, Home Network, Network Service (aka apps) and Setup, is clean and aesthetically pleasing to our eyes.Headline apps include Netflix, Amazon Video, YouTube, BBC iPlayer, BBC News and Sport, Netflix and My Space. Dig deeper and you’ll find some euro-specific news services, plus Aupeo! (which is owned by Panasonic but used by barely anyone).Significantly, the Netflix app is 4K HDR-enabled. The Amazon app supports UHD streams, but at the time of writing doesn't appear to be HDR-ready yet.Panasonic DMP-UB700 reviewThe deck's file playback talents are considerable. DSD, played from USB, sounds sensational. The deck reads 2.8MHz and 5.6MHZ DSD as well as 24-bit FLAC and for OCD media collectors, album art and metadata is all recognised. Video file support covers all popular file formats, including MKV.That said, while Panasonic may have downgraded the power supply and removed some of the more expensive audio components from the mix, its HRA performance makes a good argument that there's no reason why the UB700 shouldn’t find a role in a high-end AV system. Also good for audiophiles, the High Clarity Sound mode can be used to disable video when you're just listening to music.   Panasonic DMP-UB700 reviewImage quality of the Panasonic DMP-UB700 is outstanding – the player delivers an extraordinary level of fine detail, with superb color accuracy.The Times Square showdown in The Amazing Spider-Man 2 (UHD Blu-ray) is incredibly dynamic and vibrant. Side-by-side with the pricier UB900, there's no obvious visual shortfall. It also does a cracking job playing regular Blu-rays, offering images of nuance and depth.There's some clever processing beneath the bonnet too. The UB700 interpolates 4K Blu-ray content from 10-bit native to 12-bit with 4:4:4 colour sub sampling. Alternatively, it can output 4K at 8-bit 4:2:0, depending on your screen. In all probability, you won't need to route around in the HDMI sub menus to set things up. In Auto mode, the player selects the most appropriate resolution for your screen. If you have a non-HDR 4K TV, however, a Dynamic Range Conversion circuit is available for you to manually optimize image quality. Panasonic DMP-UB700 reviewNaturally, the UB700 player bitstreams out both Dolby Atmos and DTS:X 3D audio, too. Hook up a Dolby Atmos AV receiver for some delicious sonic immersion. We can confirm that when the remnants of the Russian spy satellite collide with George Clooney's space shuttle, and Sandra Bullock tries to disengage herself from the spinning arm in Gravity on Blu-ray, the Dolby Atmos soundtrack will send your viewing room into a dizzying spin. The Panasonic DMP-UB700 is a pleasingly fast loader too: a feature-heavy movie platter goes from tray to Blu-ray menu in just 41 seconds, and a simple Blu-ray concert disc does the same in 33 seconds. In the world of Blu-ray, this is a sprightly performance. Finally, in use, the deck is reassuringly quiet.\nCurrent page:\n\nIntroduction, design, content and performance\n\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}