{"id": "TechRadarBattlefield V review: an improved yet incomplete multiplayer shooter", "paragraph": "\nBy\nDom Reseigh-Lincoln\n2018-11-16T16:15:19Z\n\nGaming\n \n\nFollowing the rocky reception received by Star Wars: Battlefront 2 this time last year, and the ongoing conversation involving the use of microtransactions in the economy of a full-priced game, Battlefield V finds itself at a turning point for the franchise.First-person shooters in their traditional form just aren’t as popular as they once were. Battle royale has come along and changed the landscape of the industry, skyrocketing the likes of Fortnite and PUBG into the limelight. Even Call of Duty has had to upend its age-old formula for the recent release of Black Ops 4, just to find some level of relevance in 2018.As a result, Battlefield V enters the fray in something of a dual state. On one hand, EA’s nigh-on obnoxious approach to content and access shows how little the publisher has learned from the debacle of its previous titles. For instance, those willing to pay for the substantially more expensive Premium Edition get access to the game more than a week in advance, while the planned battle royale mode Firestorm won’t even arrive until March 2019.On the other hand, BFV represents the most enjoyable multiplayer experience since Bad Company 2 way back in 2010. From the speed and fluidity of respawns to the way every firefight and vehicular encounter is elevated by the scale of its destructible environments, the series has once again raised the bar on its unique brand of virtual war. It’s clearly a blueprint for where the franchise is likely to go next – but with so much content simply not present at launch BFV feels oddly incomplete.Unlike Black Ops 4, which dropped its traditional single-player campaign in favor of the arguably far more popular Blackout mode, DICE has stuck to its guns and included a new set of War Stories. This four-chapter anthology travels across the conflict and, for the most part, does an admirable job of shining a spotlight on corners of WW2 that haven’t yet been explored (which is impressive considering just how many games have trodden through the conflict).While the fourth chapter, the German-focused The Last Tiger, won’t arrive until December 4, the other three are included at launch. Nordlys, a tale of the Norwegian resistance and its attempts to stop Germany using the power of heavy water to develop an atomic bomb, is easily the highlight, with its focus on using darkness and snowfall to hide your movements and its enjoyable downhill skiing sections. It’s reminiscent of Call of Duty: Modern Warfare 2’s memorable opening sequence, and shows that DICE has come a long way since the forgettable campaigns of BF3 and 4.The AI, sadly, is rather predictable, but it's mostly aggressive in its attempts to seek you out, so expect a decent challenge of brute (if mostly dumb) force. Voiceover performances range from sincere and heartfelt to corny and middling, but with the power of the Frostbite engine at its disposal every inch of the game world is a visual wonder to behold. Volumetric lighting and particle effects are, as you might expect from a DICE production, on point throughout.But while the campaign serves as a taster for the wider mechanics and objective-based nature of BFV, the online multiplayer is what’s going to potentially keep you coming back for more in the long term, and the developer has made some key, if not entirely revolutionary changes to the formula this time around.While 2016’s Battlefield 1 was a real shake-up for the series, with its move from modern-day to the trenches of World War 1, BFV offers more of an iterative experience. The slower movement of BF1 – introduced to reflect the brutal attrition of trench warfare – has been dropped, and you can now maneuver through the titular battlefield with far more athleticism.Sprint speeds have been increased, and you can even sprint while crouching for a Gears of War-style ‘roadie run’. You can mantle almost anything, and transitions through windows and over scenery are now that little bit smoother. Even recoil overall has been taken down a notch. As a result, firefights unfold at a much faster pace, but with near instantaneous respawns (including the ability to spawn on a squadmate in real-time) and regularly cycling respawn points that are far more forgiving in how far they place you from the action.Following issues with a scarcity of bullets during the recent beta, ammunition is now far more plentiful, with every downed enemy and ally dropping countless amounts. There are even Attrition dumps that offer health and extra ammo every time you complete an objective. Together, all these small changes coalesce to create a large-scale FPS brimming with agency.The eight maps that launch with the game are some of the most diverse we’ve played in the series, and while they lack any of those iconic dynamic events (such as BF4’s ‘Levelutions’ and BF1’s ‘Behemoths’) the sheer amount of destructible environmental assets makes for some incredibly intense and systemic battles. Entire buildings can be leveled with a well-timed shell from a tank, bringing its entire structure down on the squad inside. Walls can also be blown out to create new ambushing opportunities, harking back to the good old days of Bad Company 2’s creative C4 renovations.There are a handful of modes to get your teeth into across the eight launch maps as well, ranging from the returning 64-player Conquest mode to the scaled-down Infantry mode (which shrinks the size of the map and reduces the number of vehicles, much like CQC mode in Battlefield 3) – but Grand Operations is by far BFV’s crown jewel.Upping the ante from BF1’s own Operations mode, Grand Operations is all-out war in virtual form. Spanning multiple game modes and maps, each mission is a narrative-driven event spanning four in-game days. How you perform during one day will actively affect how the war effort progresses on the next, enabling you to earn significant bonuses if you manage to repel or overwhelm the opposing team.It’s BFV at its most coherent and bombastic, offering a sense of scale and pace no other shooter can match in 2018. One moment you're parachuting behind enemy lines in order to blow up anti-aircraft guns, the next you're desperately defending a half-bombed cathedral where fallen masonry provides cover and ambush points. The final phase of a Grand Operation sees the map shrinking in size as both sides battle down to their last men, offering a taster of what’s likely to come when the Firestorm battle royal mode arrives next year.When combined with the ability to actively build defenses in order to fortify objectives and defensive positions, DICE has actively attempted to take a similar feature from Call of Duty: WW2 and expand it into a Fortnite-esque power that’s limited in application, but still incredibly useful when you’re desperately trying to hold off a tide of enemy soldiers pouring down a snowy mountainside.However, despite all the improvements to the ebb and flow of gameplay, EA’s approach to content access remains bizarre at best. Considering that you can only use microtransactions to buy cosmetics, the publisher has somehow managed to make a fiasco out of its now free Tides of War post-launch DLC plan. Locking early access behind premium versions of the game is an ugly tactic, especially considering how few maps and modes are available right now.And with one of its four War Stories locked out until the beginning of December, and Firestorm not due to arrive until March 2019 as a free update, you get the impression DICE needed longer than a month to get BFV’s full launch content plan ready for consumption. The Swedish studio has addressed a lot of issues encountered in the beta – including consistent menu crashes that have been completely rectified – but there are still occasional graphical hiccups and clipping issues, although nothing more than the usual launch jitters.While Battlefield V isn’t quite the big franchise pivot that was BF1, it does bring a series of small yet welcome changes to the flow of each grand firefight. From the speed of movement to the new fortifications ability, DICE has made a concerted effort to remedy many of the series’ previous issues (including having a free DLC content plan and cosmetics-only microtransactions). However, the sheer amount of modes that aren’t available at launch (including something as simple as the Practice Range) makes BFV an incomplete experience that’s a little too bear-bones for a full-price game. However, given a little more, it’s likely to make good on its impressive potential.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}