{"id": "TechRadarTicPods Free review", "paragraph": "\n\n \n \n \n\n\nBy\nOlivia Tambini\n2018-10-24T18:00:27Z \nThey may look like convincing AirPod clones, but the TicPods Free are a great product in their own right.When you think of true wireless headphones, chances are that the Apple AirPods spring to mind - and for good reason, with the popularity of Apple's buds paving the way for a multitude of new products to infiltrate the market. While we were fans of the Apple AirPods, one of the biggest downsides of the earphones is the fact that they are only compatible with Apple’s own voice assistant, Siri. That’s where the TicPods Free come in - from the minds behind the Ticwatch Pro, Ticwatch S and Tichome Mini , they’ve been cited as a more flexible alternative to the AirPods, coming in a range of colors, and enabled for Google Assistant and Amazon Alexa, as well as Siri.Following a successful crowdfunding campaign, the TicPods Free are available to buy now from the Mobvoi website for $129 (£119 / AU$199). Compared to the Apple AirPods, they are around $30 (£40 / AU$30) cheaper - not a huge saving, but based on the specs of the TicPods Free, you do get a lot for your money, with support for multiple voice assistants, active noise cancellation, and noise isolation.If you’re not looking to spend that much on earbuds, you can find pairs for under $100 like the Optoma NuForce BE Free5, but most retail between $100 - $200. With any true wireless headphones, it’s inevitable that comparisons with the Apple AirPods will be made, but the earbuds here are much bigger than Apple's alternative. We found they sit comfortably in the ear when you're listening to music and won't easily shake out - although it would be nice to see more than one other earbud size included in the box, as one size never fits all. The TicPods Free have stems that sit out of your ear that contain the battery and touch controls. You can run your finger along the one on the right to change the volume, plus you can double tap to skip a track or hold your finger for a few seconds to boot up your voice assistant and ask a question.Similar to the AirPods, the stems are pretty long - so if you’re not a fan of that look, you probably aren’t going to like these in-ears. Although having longer stems means that it’s easier to use swipe gestures, we felt that they did look a little unwieldy and that they could be designed to look more discreet.The case feels well-made with a snap-shut close, and small LED’s on the front that light up green when you open it and while charging.With an IPX5 water resistant rating, you'll find the earbuds will be resistant to both rain and sweat, but we wouldn't recommend dropping them in a puddle as it may cause some issues.You have the choice of three colors too with the headphones being sold in either white, dark blue or red (but we found the red shade to be more orange than you'd expect, which is worth bearing in mind if you’re thinking of buying them).All three of the colors look good, but we'd opt for the dark blue ones if you're looking for a more discreet look - and if you’re looking for a convincing AirPods dupe, stick with the white.One of the biggest benefits here is that the TicPods Free will work with whatever default voice assistant you have on your phone. They work with Siri, Google Assistant and Alexa, depending on what one you have up and running on your phone - we tried them out with both Android and iOS devices, and found that the Bluetooth connectivity worked well, and we had no problems communicating with voice assistants using the earphones. Making calls with the TicPods was fine, however the inbuilt mic isn’t the most powerful in the world, and they can make you sound slightly distant to the person on the other end of the line.We really like the touch controls on the sides of the stems, and found them to be really intuitive, with simple swipe and tap gestures designed to control music playback, Bluetooth, and voice assistant connectivity.Functionality such as in-ear detection is here too, so once you place them in your ear you’re automatically be greeted with what you were last listening to, which is handy. To pause your music, you just need to remove the right earbud, meaning you don’t need to fumble around for your phone if you want to stop listening.In terms of audio quality, we felt the TicPods Free performed pretty well, with a good balance across treble, mid, and bass frequencies, and a decent amount of sonic power behind them.However, we did notice a touch of distortion when using them at higher volumes, with guitar-based tracks in particular sounding slightly grainy - although bass guitars sounded warm and rounded. We tried them on Hazel English’s ‘More Like You’ and we were impressed by the clarity of the different sonic layers and frequencies. We also tested them with some synthy pop in the form of Bruno Mars’ ‘24K Magic’, and we were pleasantly surprised by the forcefulness of the bass - enough to make you want to tap your foot, but not so much that it overpowers the vocals and keys.There’s ambient noise cancellation at play as well as noise isolation, which we found to be quite effective at drowning out a fair level of environmental noise, in everywhere from the office to noisy trains.Although Mobvoi claims the earbuds themselves will last for four hours from a single charge, we found it was closer to three - and that was without music constantly playing.To get that much juice you'll have to charge them for 40 minutes, but the wireless charging case itself offers an extra 14 hours too and it comes with fast-charging built-in as well, which is great if you’re on the go. That's not as good as the AirPods, which we found last for five hours from a single charge, but it’s worth bearing in mind that the TicPods Free are cheaper.The TicPods Free offer everything that makes the rival true wireless headphones great, but here it's for a slightly lower price and the big benefit is its much wider compatibility.The audio quality was impressive, and although guitars sometimes sounded a little grainy, it’s a small price to pay for the amount of sonic power you get with these in-ears. Of course, in-ear headphones are unlikely to appeal to true audiophiles as they are rarely as good as high-end over-ears, but if you’re a casual listener, the TicPods Free will do just fine.It’s pretty clear that the TicPods Free were designed to look like the Apple AirPods, and if that’s a style you like, these earbuds will probably suit you down to the ground.We found they were fairly comfortable to wear - although if your ears are on the smaller side, you may find the casing digs into the conch part of your ear after a while. The fact you can still use these on your iPhone, as well as Android phones, makes the TicPods Free a great alternative to the Apple AirPods and the audio quality, design and battery life all add up to make a good product in its own right.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}