{"id": "TechRadarApple MacBook Air 2018 vs MacBook Air 2015: just how much has changed?", "paragraph": "\nBy\nJoe Osborne, \nKevin Lee\n2018-10-30T17:41:22Z\n\nLaptops\n \n\nApple has heard your cries for a MacBook Air refresh and the company has finally delivered. The MacBook Air 2018 is an interesting device in that it sticks to relatively the same design while completely overhauling the display, processor and inputs.For the most part, the MacBook Air 2018 is a better device than its three-year-old predecessor. However, Apple has made some interesting decisions in keeping certain specs in the past and considerably raising the price on its historically most affordable laptop.Apple seems to have taken the principle \"if it ain't broke don't fix it\" to heart with the design of the MacBook Air 2018, as it looks identical to previous models save for smaller and darker bezels. We can hardly blame Apple for sticking with the knife's edge design of the original MacBook Air.The MacBook Air 2015 and its forbearers are practically timeless products. They all share a design that competitors are still emulating years later – and only recently have done well. This sort of tear drop design is what spurred the entire Ultrabook movement in the Windows PC space. Even by today’s standards, the MacBook Air remains to be one of the thinnest, lightest and most stylish laptops in the market.Of course, beyond aesthetics, the MacBook Air 2018 heavily modernizes original's design. The display features significantly smaller black bezels compared to the thick gray edges you'll find around the 2015 model's screen. In fact, Apple claims it has 50% narrower bezels.The new MacBook Air 2018 is also 10% thinner measuring just 0.61-inches at its thickest point. Weighing in at 2.75 pounds, it's also a a quarter pound lighter than the previous edition.This drop in dimensions is largely thanks to the MacBook Air 2018 adopting a fanless Intel Y-series processor.That said, it's still impressive how Apple managed to make the MacBook Air 2015 so thin and light while still relying on fan-cooled, full-fat Intel processors. Of course, the ports on offer and the display were in dire need of an update.On this latest MacBook Air, you'll find two USB-C Thunderbolt 3 ports that both support charging, up to 5K display out and 40Gbps file transfers. Mercifully, you'll still be able to find a headphone jack on this laptop as well.Apple's other modern laptop reinventions have also made there way here including the company's latest-generation butterfly switch keyboard and Force Touch trackpad. Although we would have much rather preferred a touchpad that clicked, at least MacBook Air 2018 tracking surface is now 20% larger. On the top right side of that keyboard, you'll also find a Touch ID fingerprint reader.Last but not least, the MacBook Air 2018 now features dedicated speaker grills, like the MacBook Pro. Those perforations aren't just for show, either; they house speakers that are 25% louder and deliver two-times the amount of bass than that of the previous MacBook Air, according to Apple.All told, it's a better design in terms of portability, but it doesn't leave much room for power similar to that of what the MacBook Air held against contemporaries of the time.The higher resolution display is easily the biggest upgrade the 2018 MacBook Air has seen. Now featuring a 2,560 x 1,600 resolution that amounts to 4 million total pixels, the MacBook Pro 2018 screen is four times sharper than the previous 2015 model. Additionally, Apple claims its latest Retina Display renders 48% more color.Even when it first launched, the MacBook Air display was not nearly as sharp as competing rivals in its price bracket: a mere 13.3-inch panel at 1,440 x 900 resolution. At the time, laptops in its price range were already pushing 1080p resolutions. However, the previous MacBook Air may never have achieved its legendary battery life figures if not for that highly-tuned (if awfully muddled) display resolution. And, if you’re the type to simply write papers and read emails on a laptop, the display is completely passable.We'll have to see how the new MacBook Air fares in our battery tests with its vastly sharper display. It almost seems assured that we won't see run times hit double digits.Here's where the MacBook Air 2018 fails to impress. We were hoping this latest rendition would feature full fat Intel Core processors that go up to quad-core, instead what we got was a machine that only features dual-core Intel Core Y-series CPUs.As if that wasn't a bad enough blow, the MacBook Air 2018 only features (albeit faster) DDR3 2,133MHz memory – the same type found on the MacBook 2015 – when many laptops have since moved onto DDR4 memory, which supports larger capacities. The best news here is the new MacBook Air 2018 has increased the maximum memory capacity from 8GB to 16GB.From its inception to today, the MacBook Air was always billed as a lower-power device – it’s practically in the name. However, we were always surprised by what the laptop could do considering its limitations.That said, the MacBook Air internals are dated in some areas and (relatively speaking) lower-power than before in others, from the processor in use to the memory type on offer. You could still easily get by merely word processing and web browsing on this laptop.The original MacBook Air was lauded as the most affordable Mac you could possibly buy, with models starting at $999 (about £770, AU$1,410) in later versions following its 2008 launch.Unfortunately, the MacBook Air 2018 is quite a bit more expensive at a base $1,199 (£1,199, AU$1,849), thanks to all those display and port upgrades. The MacBook Air 2018 undoubtedly a better machine compared to its three-year old predecessor. But, it almost seems like a win by default.Of course, the MacBook Air 2018 is going to be the winning machine when it features a higher-resolution display, narrower screen bezels and newer processors. However, there are also a few upgrades MacBook Air 2015 users will have to begrudgingly accept with this new model, including the Force Touch Trackpad and higher starting price. If you ask us, the MacBook Air 2018 is less of a successor to the affordable Apple laptop of yore and more of a refreshed version of the 12-inch MacBook. Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}