{"id": "TechRadarTicPods Free true wireless earphones are on sale now", "paragraph": "\nBy\nOlivia Tambini\n2018-10-24T18:00:00Z\n\nAudio\n \n\nFollowing a successful Indiegogo crowdfunding campaign from AI company Mobvoi, the TicPods Free true wireless headphones are now available to buy from its website for $129 / £119.99 / AU$199.The new headphones look like a convincing dupe of the Apple AirPods, but with some crucial differences - although the design is similar, the TicPods come in a range of different colors and support Google Assistant and Amazon Alexa, as well as Apple’s Siri.Created by Mobvoi (the company behind some of our favorite smartwatches including the Ticwatch Pro and Ticwatch S), the in-ears come with a number of features including touch control and ambient noise cancelling technology. With a side touch panel on each earbud, you can control the TicPods using a number of gestures, including swiping up and down to adjust the volume, double tapping to answer and end calls, and long pressing to reject calls. A long press on the earbud should also activate your voice activated assistant of choice - whether you prefer Google Assistant, Siri, or Alexa, the TicPods should have you covered. You will of course need to be an iPhone user to enable Siri, but the headphones will automatically connect to whatever voice assistant you’ve set as your default on your iOS or Android device.They also have an IPX5 rating, which means they won’t break down at the sight of rain (or after a sweaty workout session), and are available in red, white, or blue. In terms of audio quality, the TicPods have a few tricks up their sleeve, with ambient noise cancellation and a noise isolating design, meaning you should be able to listen to your music free from environmental distraction - and with four hours battery life and a wireless charging case, these could be the perfect headphones for your commute.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}