{"id": "TechRadariPad Pro 11 review", "paragraph": "\n\n \n \n \n \n\n\nBy\nGareth Beavis\n2018-11-05T11:08:47ZTablets \nThe iPad Pro 11-inch is excellent, and easily the best tablet Apple has ever made – but you'll need to know how to get the best out of it. It's designed, as the name suggests, for the professional, and those in creative and other lines of work will love the power, precision and overall quality on offer. If you're a 'standard' user, then you'll be buying the iPad Pro as a luxury device and media powerhouse – and you'll be paying for the privilege.So here we are, with a new iPad Pro to check out – one that's insanely powerful, with an overhauled design, an improved screen, and a slew of added extras.Apple has needed to improve the iPad Pro since the launch of the original, and this is the tablet that it said it wanted to make. It's a smaller device with a larger screen, bags of power, and an Apple Pencil that it's not so darned easy to lose.These were all things the tablet needed in order to make it a true device for the professional user, and Apple has delivered. So here we are with the iPad Pro 11-inch (or iPad Pro 11, to you and us), which aims to fix the various issues the first Pros had.Indeed, Apple has called this new model ‘the iPad we wanted to make from the beginning’ – but while this is easily the best tablet Apple has ever made, there's a big question as to whether the 'average' user will get enough benefit out of the new iPad Pro to warrant the extra cost over the newest 'basic' iPad, launched earlier this year.The new, smaller, iPad Pro 11, which we're looking at here (there's also a new iPad Pro 12.9) will start at $799 / £769 / AU$1,229, and comes in variety of configurations. To start with you can get it in a Wi-Fi-only version, or with a cellular connection to allow you to access 4G data on the go.You’ve also got a variety of storage capacity options, so let’s break down the pricing. That starting price above is for the Wi-Fi-only version with 64GB of storage on board. The next storage size up is 256GB, which starts at $949 / £919 / AU$1,449, followed by 512GB for $1,149 / £1,119 / AU$1,749. Top of the heap is the 1TB version, which costs a whopping $1,549 / £1,519 / AU$2,349.Note that all the above prices are for the Wi-Fi-only version of the slate – if you want to add cellular connectivity you'll need to shell out an additional $150 / £150 / AU$200.The new iPad Pro 11 is available to pre-order now, and the release date is set for November 7. Usually with a new iPad there’s one new feature that stands out, but this time around there are several such features, as Apple overhauls its most powerful (and most expensive) tablet.The first thing that will grab the attention of anyone picking up the iPad Pro 11 is the new screen, as it’s stretched closer to the edges of the device, with the formerly thick bezels reduced in width.The 11-inch screen itself has been upgraded by Apple to a Liquid Retina display, something we first saw on the iPhone XR when it launched recently. It doesn't have the same stunning effect you get from an OLED display, such as you'll find on the Samsung Galaxy Tab S4, and given the high price the new iPad Pro commands, not having the best screen technology irks.That’s not to say it’s a bad screen in any way – Apple’s TrueTone technology and the 120Hz refresh rate both really do add something to the quality of the experience, while HDR content is rich in detail.Update: There's currently some confusion over whether this is a 'true' HDR screen from Apple - the brand has told us it 'can play back HDR content' but we're trying to verify if the output is, indeed, bright enough to support HDR. Given the iPhone XR can't do the same and uses the same screen tech, it would be interesting if the new iPad Pro could... although the previous iteration was capable of it.It doesn't have the rich color reproduction you can enjoy on OLED screens, though, erring more on the side of more natural-looking hues. If you're watching a period drama or gritty series, this is probably better – but for more visually powerful scenes you might find it a tad washed out, with the LCD backlight bleeding through the dark area more than on an OLED display.The overall effect of the larger screen is impressive when compared side by side with the older tablet, although you’ll probably be surprised by how much bezel there still is. You might have expected to see the display stretch right to the edges of the device, but there’s still a noticeable bar bordering the screen, which stops you accidentally pressing the screen when holding the device in landscape orientation, and which at the top edge houses the front-facing camera.Apple seems to like to go through phases when it comes to design, flipping from smooth curves to a more industrial, almost brutalist design – and the latter is what you’ve got on the new iPad Pro.The sides are more akin to the iPhone 4 or iPhone SE than to any other device we’ve seen from the brand, and it makes holding the iPad Pro 11 a slightly different experience.It’s not uncomfortable, and it makes the iPad a touch more grippy, but it lacks the premium feel a curved piece of metal offers in the hand. Sir Jony Ive claimed, in a recent interview, that this design tweak was due to the engineers finally enabling it through component miniaturization, but in reality it feels like the flat edges were only implemented to provide a flat edge to stick the Apple Pencil to.The overall design quality is definitely a step up, although there's no glass on the back here – a glass back would allow for wireless charging, although that's unlikely to be supported in a tablet just yet given how large the charging pads or docks would need to be.The speakers in the corners of the device are still present as a quartet, but they've been tooled to include a woofer and tweeter in each to improve the sound – that's a plus for fans of music and gaming, but the bad news is that Apple has removed the headphone jack from this device. With no headphones in the box, this is going to be a source of real annoyance for many users, who could run into issues pretty quickly.You may think \"It's fine, I'll just use the adaptor from my iPhone, after Apple dropped the headphone jack from the iPhone 7\". Well, firstly we'd ask you why you'd say something so oddly specific… but then we'd have to tell you: not happening, as Apple has transitioned the iPad Pro to a USB-C connection, as on the Macbook.So the upshot is: if you don't have a pair of Bluetooth headphones, or you have a lovely pair of wired cans you want to use, you're going to have to spend some more money on top of the purchase price of this tablet. Sure, you can buy some nice Bluetooth options, and you may already have some. Or you can spend $9 / £9 / AU$15 on an adaptor so that you can use your current wired headphones. Whatever your preference, this is a key thing to be aware of before you purchase the iPad Pro 11.\nCurrent page:\n\nNew design, better screen\n\nGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}