{"id": "TechRadar proSingles’ Day: a $30 billion opportunity still missed by many", "paragraph": "\nBy\nAnthony Capano\n2018-11-16T11:30:51Z\n\nInternet\n \n\nEstablished by Chinese University students in the early 90s as the anti-Valentine’s Day event, Singles’ Day has exploded to become the world’s largest retail event, with 2018 sales topping $30 billion over a 24-hour period.Across Europe, early insights from Rakuten Marketing Display advertisers indicate a 93% increase in orders year-on-year for Singles’ Day 2018. In the UK specifically, advertisers saw a staggering 199% increase in orders, driven by key retail sectors including apparel and accessories.It’s an astonishing opportunity for businesses around the world, not least those based in the UK. Pioneers such as Burberry have already realised huge growth in digital sales through the APAC region, with Chinese tourists contributing a significant lift in Hong Kong, Korea and Japan.Despite all this, recent research indicates UK businesses are missing out almost entirely, with 74% of marketing professionals focused on the local market. Rather than focus on Singles’ Day, which draws the attention of one in ten marketers, brands instead choose to keep campaigns constant through the year at the expense of any major seasonal peaks.‘Always on’ marketing, where teams are working consistently around the calendar year to offer online promotions and in-store discounts, is built around local consumer behaviour and a growing trend in early holiday shopping. According to the report, Guess Who...Unwrapping the Global Holiday Gift Shopper, two of the most dominant shopper profiles in the UK are the ‘Early Bird Shopper’ (18%), planning up to a year ahead, and the ‘Sporadic Shopper’ (23%) who buys gifts throughout the year. However, this approach leaves some of the fastest growing, most lucrative opportunities untapped. In Britain alone, as many as 35% of transactions driven for Rakuten Marketing clients are now taking place overseas. Marketing teams must start focusing on these demographics and carrying out thorough research into local consumer behaviour and trends to inform campaigns.China is home to the world’s largest retail market, generating nearly $5 trillion in total retail sales in 2017, representing 53.1% of sales in Asia-Pacific (APAC). On top of this, marketers have an overwhelmingly positive outlook on the potential for growth in overseas markets. Nearly two-thirds of UK marketers believe their target customers outside of the UK are wealthier, younger and more digitally savvy.This sentiment is highest among marketers targeting Asia-Pacific where 82% confirm they see their customer base in the region as ‘premium buyers’.Why then, have so few businesses made the leap? Put simply, just one in ten businesses have local marketing teams in overseas markets able to carry the responsibility for the international roll-out of campaigns. Tapping the APAC market certainly isn’t easy. There are plenty of nuances Western brands must get their heads around to launch products with any success. A great example is bulk buying; a phenomenon whereby an individual Chinese shopper will place multiple orders of the same products for friends who can’t get hold of a credit card – behaviour that could be misinterpreted as reseller activity.To reach customers in the lucrative Chinese market, many businesses will use this time of year as an opportunity to trial promotions and offers to see what best works for the brand. Among retailers that have previously participated in Singles’ Day, one of the most valuable assets at their disposal is their data. All businesses in this position must be reviewing the performance of previous years’ campaigns to get a sense of what worked and what didn’t, and use this information as a means for shaping Singles’ Day strategy.A large part of this involves working out the publishers and platforms most appropriate for the brand to use. Some UK marketers are increasingly using platforms such as the messaging app, WeChat: 36% have used the platform personally. Similarly, 30% have tried the microblogging website Weibo and 18% have tried the social network Renren. Similarly, concierge apps are among the most popular platforms used by consumers in China to make shopping from international sites simple. These apps make it easier for international retailers to engage and convert Chinese consumers by translating a brand’s website, working with third party logistic companies and allowing consumers to purchase with Alipay or WeChatPay.Withdrawal from seasonal marketing peaks doesn’t just mean missed APAC opportunities. Today, just 16% of UK businesses are focused on the international Western shopping peak that is Cyber Week – this is almost half of the proportion of businesses looking to leverage the peak in US.Instead of shying from the international stage, it’s time for UK brands to invest in seasonal marketing campaigns and Singles’ Day is no exception. Our research also shows APAC shoppers are actually far more likely to visit the brand site itself as part of the online journey than their Western counterparts, allowing teams the opportunity to start small, measure and evolve their strategy. Anthony Capano is Managing Director EMEA, Rakuten Marketing Techradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}