{"id": "TechRadarShould I buy a Polaroid TV? Our guide to the budget TV brand", "paragraph": "\nBy\nHenry St Leger\n2018-11-02T16:02:25Z\n\nBlack Friday\n \n\nOn Black Friday you may find yourself thinking should you buy a Polaroid TV? You might be confused about putting those words together – don't Polaroid make, you know, cameras?Yes, Polaroid pioneered instant photography several decades ago with the invention of the Polaroid camera. After the American brand's heyday, however – when digital cameras bankrupted the business – the Polaroid name is now licensed on a number of audio products, smartphone photography apps, and retro clothing.It's also now in the business of TVs. And these aren't televisions for budding photographers as much as they are for those on a tight budget.But with so many variations of TV sizes, smart TV platforms, and picture processing technologies between different sets out there, there are countless televisions you could be taking home. Why should you consider Polaroid?Polaroid occupies a similar place in the market to Hisense or Toshiba, manufacturing budget LED sets that offer big-screen panels at affordable prices. However, you'll often find Polaroid's TVs are even cheaper.In the UK, Polaroid sells a number of dirt-cheap displays through the supermarket chain Asda, with a 24-inch Polaroid Series 1 set available as low as £139 (around $180 / AU$250). In the US retailer Target, you can pick up a 32-inch 720p television for only $129 (around £99 / AU$180).Even Polaroid's 4K sets are very much the lower end of the market – American retailer Kmart sells 55-inch UHD displays for under $500 (£400 / AU$700).Some Polaroid sets aren't really fully-fledged smart TVs in their own right – watch out for this – but come with a basic Google OS, which relies on you casting content from a smartphone or tablet. Any handy USB port in the back should let you use an actual Chromecast or Amazon Fire TV stick though, which might be significantly more convenient.Polaroid also manufactures TVs in sizes some brands barely bother with anymore, like 24 and 32 inch. If you're looking for a more compact television to squeeze into a bedroom, or that can be tidied away in a cupboard more easily, these may be worth a look. The hardware design also tends to be straightforward, with light plastic casing and a stripped-back UI.When we reviewed the Polaroid P55D600, we praised the brand's first UHD television for its impressive picture quality right out of the box, both in native 4K and when upscaling HD/SDR content. There wasn't much optimization to be found in the set's picture settings, but there was also little need to fiddle.Polaroid P55D600 55-inch TV review: A capable 4K television for the cost, even if its budget price tag necessitates some compromises.At this price, corners will inevitably be cut, though – we found the P55D600's dimming zones and backlighting features disappointing and inexact when trying to vary the brightness in low-light content.But for these low prices you're likely to be getting a decent picture from a Polaroid TV, as long as you don't expect too much from it.We recommend sticking with Polaroid sets in smaller sizes though, where they don't have as fierce competition from big-name rivals such as Philips or Samsung – and are still cost-effective. The lower-cost panels are likely to show their flaws more clearly on larger screens too, where the processor needs to work a lot harder to get a consistent picture out of all those pixels. But if you want a dirt-cheap 4K TV, you could do a lot worse.Throughout November, Black Friday and Cyber Monday sales are going to see some tempting discounts on a wide range of consumer electronics – yes, and TVs. For all the latest info and deals we've scoured from across the net, keep an eye on TechRadar Deals on Twitter and make sure to check out the rest of the site.We'll let you know about all of the very best deals on the greatest tech products at the most popular retailers as they go live Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}