{"id": "TechRadarSpotify starts testing an official Apple Watch app", "paragraph": "\nBy\nDavid Nield\n2018-11-04T14:30:29Z\n\nWearables\n \n\nAn official Spotify app would probably be high on the wishlists of a lot of Apple Watch owners, and it looks as though we're setting the first steps towards that. A early, limited test is now underway, according to users with access to the Spotify beta iOS app.As per a Reddit thread, at the moment the app doesn't actually do much except control playback on your iPhone. It might be that syncing playlists to the watch – surely one of the key features of any wearable app – is going to be rolled out further down the line, possibly after the app gets its official launch.So far neither Spotify nor Apple have said anything publicly about the app or when we can expect to see it appear for the rest of us. Of course Apple would much rather you stuck with Apple Music, which might put a few bumps in the road.We've heard hints in the past that a Spotify app for the Apple Watch would eventually see the light of day, though rumors have been swirling for a long, long time now. An announcement was tipped for WWDC 2018 in June but never materialized.When pushed for comment by The Verge, Spotify refused to elaborate on its plans for an Apple Watch app, only noting that it tests out new features and functionality all the time. Considering you can use Spotify just about everywhere else – including Wear OS – it makes sense that the set would be completed with the Apple Watch.If you're not a part of the Spotify beta on iOS, you'll have to sit tight and wait for the time being. Once the app makes it to the full version of Spotify, we'll be sure to let you know – just don't expect too much to begin with.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}