{"id": "TechRadarMozilla launches Price Wise experiment for Firefox Test Pilot ahead of Black Friday", "paragraph": "\nBy\nCat Ellis\n2018-11-12T15:01:47Z\n\nSoftware\n \n\nMozilla has released two new experiments for Firefox Test Pilot: one that helps you find the best prices when shopping online over the Black Friday period, and another that makes it easier to share links via email.If you're thinking buying a product and want to make sure you get the best deal, add it to your Price Watcher list in Price Wise and you'll receive a desktop notification when the price drops. Price Wise is currently only available in the US, and works with Best Buy, Walmart, eBay, Amazon and The Home Depot.Here at TechRadar we'll be scouring all the biggest retailers over the Black Friday period and curating the very best deals by hand. To save time and ensure you're getting the lowest possible prices on truly great tech, keep an eye on our ultimate Black Friday deals guide.The second of Mozilla's new Test Pilot experiments, Email Tabs, is a tool that simplifies the process of sharing sites that catch your interest. To use it, click the Email Tabs icon at the top of your Firefox window, select the tabs you want to share, and choose whether you'd like to send just the links, a screenshot of each site, or the full text.Click 'Send' and the tabs will be sent to your Gmail inbox, where you can forward them to someone else, or just keep them on file so you can find them later.Firefox Test Pilot is an open program that lets you try experimental new features and give your feedback before they're integrated into the browser proper. To get started, simply sign up with your email address and choose which experiments you'd like to try. Previous options have included a color scheme designer, temporary tab snoozing, and a password manager for Firefox for AndroidGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}