{"id": "TechRadarIn-screen fingerprint reader? Samsung's working on in-screen everything", "paragraph": "\nBy\nJoe Osborne\n2018-10-19T15:22:20Z\n\nMobile phones\n \n\nThe fact that Samsung is working on an in-screen fingerprint reader for the Galaxy S10 has been well documented, but it’s clear now that Samsung has a gamut of in-screen features in the works.A photo posted to Twitter by user Ice Universe during Samsung Display’s ‘2018 Samsung OLED Forum’ event in China reveals the display division of Samsung’s entire 2019 product roadmap. Of course, the long-rumored in-screen fingerprint reader is shown clearly on the presentation slide, but so are three other exciting developments.Great news! Samsung established the direction of mobile phone design in 2019!On October 18th, Samsung Display invited about 20 customers to hold the \"2018 Samsung OLED Forum\" at the Shenzhen Marriott Hotel in China. At the meeting, Samsung showed a PPT pic.twitter.com/sYu0ORTd6VOctober 19, 2018The slide briefly describes an Under Panel Sensor, or UPS, that will likely house a camera (i.e. image sensor) in addition to other sensors. There are also plans to implement haptics beneath the screen, or HoD, which we imagine would work similar to Apple’s 3D Touch on iOS devices. Finally, the slide reveals plans for sound on display technology, or SoD, as in front-facing speakers and earphones beneath the display.This collection of features could be the key to truly bezel-less, 100% screen phones and tablets (perhaps even laptops). Up until now, these nearly all-screen smartphone designs have required ‘notches’ of various sizes.Now, it’s well known that the in-screen fingerprint reader is already available in smartphones, but those phones are currently exclusive to China and surrounding regions. This expansion of in-screen technologies, from a global technology firm, could allow for all sorts of new device form factors, especially if Samsung Display licenses out the technology to prospective buyers.As for when we can expect to see these developments in products on the shelves, it could be as early as 2019, especially the well-established fingerprint reader, but more likely to be 2020.Via MSPowerUserGet the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}