{"id": "TechRadarHow to watch the Breeders' Cup 2018: live stream the racing from anywhere", "paragraph": "\nBy\nWill Dalton\n2018-11-02T16:45:37Z\n\nVPN\n \n\nThe 2018 Breeders' Cup takes place at the famous Churchill Downs racecourse in Kentucky, Louisiana, across Friday, November 2 and Saturday, November 3. The main event, the Breeders' Cup classic, is scheduled on the Saturday for 5.44pm ET, which is 2.44pm PT and 9.44pm GMT for UK viewers. NBC's TV coverage of the big day's racing kicks off at 1pm ET – 10am PT and 4pm GMT. The 35th Breeders' Cup Classic comes to the famous Churchill Downs track in South Louisville, Kentucky, with racing fanatics and everyday punters alike tuning in from across the world. And you can tune into a live stream of the 2018 Breeders' Cup at Churchill Downs, no matter where you are in the world.Across the 14 races on the main day of this year's cup, a whopping $28 million prize money is up for grabs. The historic venue of Churchill Downs - home also to the Kentucky Derby - is sure to draw in huge crowds come the final race on Saturday afternoon, with the riders competing for a $6million purse.Aptly-named thoroughbred, Accelerate has installed himself as the favorite, though Hofburg, Good Magic and Catholic Boy are expected to put up a fierce challenge in an extremely competitive field. If you don't fancy braving the Kentucky crowds, risking the changeable weather, or even if you're not in the country, fear not, because here you'll find out how to watch the Breeders' Cup from anywhere in the world from the comfort of your own TV, mobile phone or tablet.If you're watching at home in the US, tune in to NBC for live coverage of the Breeders' Cup. The channel will be building up to race day throughout the week, before showing Future Stars Friday on November 2 and the main event on Championship Saturday, November 3. Tune in to NBCSN from 3.30pm ET / 12.30pm PT for live coverage of Saturday's key races. If you prefer to watch the race on your computer or laptop, remember that the whole event will be streamed live online at nbcsports.com/live.  For those on the go, NBC will also stream the race on mobile via the official NBC app. It's worth noting that with both of these options you will have to sign in using your cable provider’s information for full access.If you've got a cable subscription but happen to not be in the US when the Breeders' Cup takes place, the best way to get access to your feed is by using a VPN. Below you'll find all the information on how to download and use a VPN to watch the race.1. Download and install a VPNIf you don't have easy access to watch the 2018 Breeders' Cup in your country, the best way to watch it is to download and install a VPN. We've tested all of the major VPN services and we rate ExpressVPN as the absolute best. It's compatible with all of your devices, supports most streaming services and ranks amongst the fastest. You can even install it on devices like an Amazon Fire TV Stick, Apple TV, Xbox and PlayStation. So for a one-stop shop, you can't go wrong with Express - but there are more fantastic VPN options out there as well:The best 3 VPNs for streaming sports online1. ExpressVPN:  the best all-round VPN for streaming, comes with 30-day trial2. IPVanish supports up to 10 devices, so great on the go3. VyprVPN: blazing speeds make VyprVPN a great choice for 4K video2. Connect to the appropriate server locationSimply open the VPN app, hit 'choose location' and select the appropriate location - it's super easy to do. Choose US to stream the 2018 Breeders' Cup on NBC using the link below.3. Go to nbcsports.com/live\nThis year's Breeders' Cup will be streamed right on NBC's website and with a VPN you can watch it live from anywhere in the world - just so long as you have those crucial log in details.If you don't have a cable subscription, fear not, because there are other options that will allow you to watch NBC without having to subscribe to it. To make the entire process simple for you, we've listed three of our favorite options below:If you're wanting to tune in to the Breeders' Cup from Canada, you'll want to head over to TSN. Most of the card is on TSN 2 and 3, but for the main event on Saturday you have to tune in online at TSN.ca and through the official TSN app. Again, like your neighbors to the south, you'll need a subscription in order to watch this way.If you're in the UK and fancy a flutter on this huge US race, then you can watch with a Sky TV or Virgin Media subscription. You don't need to upgrade to a Sports package to enjoy the action, as it's on the At The Races channel, which is available to all Sky TV subscribers (for now at least).If you're a despairing non-Sky user who just wants to watch the racing without the hassle and cost of a full subscription, you can subscribe to the At The Races Player instead. It costs £9.99 per month, and let's you access the action on phone and tablet via its apps as well.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}