{"id": "TechRadar proAlibaba Singles Day sales break records ", "paragraph": "\nBy\nAnthony Spadafora\n2018-11-12T16:00:14Z\n\nBlack Friday\n \n\nInternet giant Alibaba has outdone itself this Singles Day by setting new record across the board.The Chinese giant revealed it had seen a record $1bn in sales within just 85 seconds, and almost $10bn in sales during the first 24-hours of its annual sales event.Singles Day, which takes place every November 11th, is a holiday created by the Chinese e-commerce company in 2009 to celebrate those who are single in a similar way to how Valentine's Day celebrates couples. However, the event has become the world's biggest online sales event with total sales exceeding Black Friday and Cyber Monday combined.Alibaba customers spent $30.8bn during Sunday's event with sales up by 27 per cent when compared to last year. The sales event kicked off on Saturday with a gala featuring Mariah Carey, a Japanese Beyonce impersonator and a Cirque du Soleil performance with the theme of shopping for shoes.Close to 180,000 brands are available during Alibaba's Singles Day sale including top technology companies Xaomi, Apple and Dyson.Last year the Chinese firm expanded the event by opening it to the Western market and downloads of its app AliExpress surged in both the US and UK.The event may have broken last year's record but many believe that as the event matures, its growth rate will slow down as well.This Singles Day is expected to be the last with the company's founder Jack Ma at the helm. He will depart from his role as chief executive and take over as chairman before next year's event.Via the BBCTechradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}