{"id": "TechRadar proTablet device sales struggle again", "paragraph": "\nBy\nAnthony Spadafora\n2018-11-02T16:03:33Z\n\nTablets\n \n\nThe tablet market continues to struggle as consumer demand for these once popular devices continues to drop.According to IDC's Worldwide Quarterly Tablet Tracker, the worldwide tablet market declined by 8.6 per cent as global shipments fell to 36.4m in the third quarter of 2018. The majority of the market was dominated by slate tablets with 31.6m units though their sales were down by 7.9 per cent from the previous year. Sales of detachable tablets also saw a significant decline, down 13.1 per cent from the previous year, accounting for 4.8m unit shipments.Senior Research Analyst with IDC's Worldwide Quarterly Mobile Device Trackers, Jitesh Ubrani explained how the tablet market is now beginning to resemble the traditional PC market, saying:\"The tablet market is more like the traditional PC market than ever before. Not only do these markets move in sync with each other, but the decreasing margins and overall decline, particularly in slate tablets, has led to the top 5 companies capturing a larger share as many small vendors have exited the space or simply treat the tablet market with a much lower priority. Even among the top 5, it is essentially Apple and to a lesser extent Samsung that continue to invest heavily in product innovation and marketing. This has helped the two companies to set themselves apart from the rest.\" According to IDC's sales data, the top five tablet companies are Apple, Samsung, Amazon, Huawei and Lenovo.Apple continued to lead the tablet market with almost double the shipments of its closest competitor. The refreshed iPad with Pencil support that launched in late March reinvigorated interest in tablets as it was the first time the Cupertino-based company brought a lower cost iPad to market. However, at the top of its line, the iPad Pro saw year-on-year declines as consumers waited eagerly for a refresh at the beginning of the fourth quarter.Samsung on the other hand, maintained its position as the second leading tablet manufacturer despite a year-on-year decline. The Korean tech giant modestly expanded its detachable portfolio but unfortunately this growth was overshadowed by a continued decline in sales of its slate tablets.Amazon rose to the position of third largest tablet manufacturer in the third quarter boosted by strong sales from Prime Day. Despite the e-commerce giant's rise in position, the company still saw a modest year-on year shipment decline.Huawei was the only company among the top five tablet manufacturers to deliver year-over-year tablet shipments growth during the third quarter of this year. Meanwhile, Lenovo rounded out the top five with 2.3m units shipped during the third quarter with a decline of almost 25 per cent when compared to a year ago.Via IDCTechradar Pro has teamed up with GoDaddy to produce a website-hosting tips eBook, looking at how to plan your website, picking the right domain name and great ways to promote your website.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}