{"id": "TechRadarGround-penetrating radar lets self-driving cars 'see' below the road", "paragraph": "\nBy\nCat Ellis\n2018-10-30T16:02:52Z\n\nCar tech\n \n\nWhen self-driving cars are tested, it's usually in very tightly controlled conditions in locations like California, where weather is predictable, and roads are straight and clearly marked. Tests happen during the daytime, where cameras can see clearly for miles, and obstacles are easy to spot.Rain, fog, darkness and worn-out road marking can all throw autonomous cars for a loop. Cameras and lidar both rely on light, and GPS and radar alone aren't enough to keep vehicles safely in lane.That's where WaveSense comes in, using ground-penetrating radar to create a 'map' of the unique geological feature. The radar uses soil layers, rocks and road bedding to build up a 'fingerprint' of the area directly beneath the asphalt, which a car can use to determine its exact location.Although above-ground sensors will still be necessary for hazard perception (detecting other road users, for example), this has the potential to make self-driving vehicles much safer in sub-optimal driving conditions.Mapping a road with sub-surface radar is surprisingly straightforward. \"The subterranean fingerprint, or map, is created by driving a vehicle equipped with WaveSense over a lane,\" Tarik Bolat, co-founder and CEO of WaveSense, told TechRadar. \"The map can then be immediately used, without post-processing, for localization.\"Of course, the subterranean world isn't completely static. Roadworks, installing cables and geological faults can all cause changes below the surface, but Bolat says maps created using ground-penetrating radar are generally stable over many years - unlike surface-level maps, which have to be updated frequently to stay reliable. Roads will need to be re-mapped after heavy utility works, but Bolat says regular resurfacing shouldn't be an issue.Perhaps most impressively, WaveSense expects the hardware to cost less than $100 (about £80, AU$140) at scale. It's still hard to define 'safe enough' when it comes to autonomous vehicles, but sub-surface radar has the potential to bring us closer to that standard and and WaveSense is already running pilots with some of the world's biggest automakers and suppliers to that end.Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\n\n\nFuture Publishing Limited \nQuay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "}