{"id": "\nJames Milner fired up Liverpool team-mates during Arsenal draw, says Klopp\nJürgen Klopp laughs off super league plans and rues disallowed goal", "paragraph": "• Midfielder scored in Saturday’s 1-1 draw at Emirates• ‘Milly is like wine. A very good red one. He’s getting better’\nNick Miller at the Emirates Stadium\n\nSun 4 Nov 2018 23.03 GMT\n\n\nFirst published on Sun 4 Nov 2018 22.30 GMT\n\nJames Milner was the man who scored Liverpool’s goal in their 1-1 draw with Arsenal on Saturday and, according to Jürgen Klopp, it was also the midfielder who offered some stern words to fire up his team at half-time.Milner gave Liverpool the lead just after the hour mark, only for Alexandre Lacazette to equalise in the latter stages. But while the game was a fun, intense contest for the neutral, the Liverpool manager spent much of the first half in a state of agitation, unhappy with what he deemed a substandard display from his team.“You have a compact formation, you force [Arsenal] to pass the ball somewhere – that’s pressing, it’s not that complicated,” said Klopp. “The best way is to do it right from the first moment and then you can build on that, but we didn’t do it right from the first moment. That means there’s a time that it’s not there and we all felt like, ‘What the heck is here?’“Milly was the one who saw it first and was quite – how can we say, was not happy – was animated. That’s good. That’s how it is in a dressing room, there is a lot of men, a lot of testosterone. One is talking – that’s me – and sometimes before I start talking the boys have a few words and that’s all. Milly is a proper leader.”Liverpool continued their record of never losing a game in which Milner scored, and while the summer arrivals of Naby Keïta and Fabinho might have suggested the 32-year-old’s days as a regular starter were numbered in the team, he has been among their best players this season. “Milly is like wine,” said Klopp. “A very good red one. I’m not sure if Leeds is famous for wine? He’s getting better. I think he should buy all of the newspapers and read this. I would like it if you write a story about James Milner.” Klopp then shifted from appreciation to heavy sarcasm. “Obviously someone might write that he [should] play for England again. That’s a really nice idea.”While Liverpool were eight minutes away from a valuable victory, Klopp agreed a draw was a fair result, but Milner admitted their failure to win was frustrating. “When you’re 1-0 up in a game like that you need to see it out and we didn’t do that,” he said. “There are positives. Coming away from Arsenal and being disappointed with a draw is a positive, and also the amount of chances we created. It’s always going to be tough against them.”The draw briefly took Liverpool to the top of the Premier League, before Manchester City’s victory over Southampton on Sunday moved Pep Guardiola’s side two points ahead. “Yes, and I do,” said Klopp, when asked if he has to ignore City’s relentless accumulation of points.“Actually, I’m not interested in how many points Man City gets. They have one from us [the 0-0 draw at Anfield], if they get 89 more I have no influence on that. I’m not interested, no.”"}