{"id": "\nThe Observer view on Brexit – the people must have a chance to give their verdict\n", "paragraph": "The deal unveiled by Theresa May reveals how dire our options are. We need to have a say\n\nSat 17 Nov 2018 21.00 GMT\n\n\nLast modified on Sat 17 Nov 2018 21.05 GMT\n\nIt is our fate, and arguably our misfortune, to live in an era of great change. Yet even by recent standards, the political upheavals of the past week have surpassed in intensity and gravity almost anything the British people have experienced in the postwar era. The long, often tedious and confusing struggle for Brexit suddenly crystallised into an all-consuming political drama of epic proportions, riveting, infuriating and alarming in equal measures. Bodies litter the stage. The plots and subplots thicken. On all sides the cry goes up of treason and betrayal. But still, if we are honest – and now is a time for honesty – nobody knows how or where this tragedy, this black farce in which we gamble with a nation’s life, will end.Line by line, clause by clause, the reality of Brexit was finally committed to dry, unforgiving paper. Every page of the withdrawal agreement negotiated by Theresa May demolished the stubborn fantasy to which she has clung over the past two years: that there is barely a trade-off to make in leaving the EU, and that we could painlessly slide out of the world’s largest, deepest trading bloc. Every sentence brought into sharp focus the colossal cost of embracing the Brexiters’ delusion of “taking back control”, measured not just in lost billions but in the damage to be inflicted on British citizens, on sovereignty and influence.The agreement is probably the best Britain could have achieved, given the twin constraints under which May has operated: the absolute necessity to safeguard the Northern Ireland peace process, and her insistence on ending free movement. Unless we reach a comprehensive trade deal that avoids the need for a hard border in Ireland – almost impossible to envisage, given that there are no workable solutions outside the customs union, and the government rightly will not countenance border checks in the Irish Sea – Britain will eventually enter the backstop arrangement outlined in the agreement, which can be exited only by mutual agreement.The Brexit foreshadowed in the deal unveiled last week will leave Britain vastly diminishedSo in all likelihood the backstop is what Brexit will look like in the long term: a UK-wide customs union with the EU, with deeper regulatory integration for Northern Ireland that could eventually see some checks in the Irish Sea. The claim that this is taking back control is a cruel joke. Britain will forfeit the influential role it has played in shaping EU law, and become a rule-taker, obliged to align to any new EU standards on, for instance, taxation, environmental protection, employment standards and competition policy. Our capacity to negotiate our own free trade deals – which the government’s own analysis says could only ever recover a small fraction of the cost of Brexit – would be severely constrained. Such an economic arrangement would inflict great economic pain: the customs union covers only goods, not services, which make up around 80% of the British economy, and 40% of our exports to the EU.This is the economics of the madhouse. But the Brexit foreshadowed in the deal unveiled last week will leave Britain vastly diminished in other significant ways. In arguing that leaving will boost British sovereignty, the Brexiters coddled themselves in 19th-century imperial fantasies. Here in the 21st century, virtually all the major challenges faced by developed nations are global: climate change, microbial resistance, regulating the tech giants, to name just some. They will be solved only through international collaboration, and while the EU is far from perfect it is by far the most successful model the world has seen. To leave at a time when the world is getting darker; when we have a fiercely nationalist, anti-global US president who is openly contemptuous of Britain; when trade wars are the new norm; when Russia is more insurgent than at any time since the cold war; is nothing short of lunacy, a terrible act of national self-immolation.While May’s negotiation can hardly be termed a success, the bigger failure is one of political leadership. The Boris Johnsons of this world may be the Tory party’s deluders-in-chief. But May herself has much to answer for. Where she should have taken on the hard Brexiters, she channelled their reactionary sentiments – not in the national interest but in the interests of holding together her divided party. Where we desperately needed unifying, consensual statesmanship, she unilaterally renounced Britain’s membership of the single market and customs union, thereby creating inflexible “red lines” despite the lack of any democratic mandate to do so.May’s chances of getting her deal through parliament look vanishingly smallThe withdrawal agreement should make abundantly clear that there is no such thing as a clean break from the EU that respects both the integrity of the UK and the Good Friday agreement. Therein lies the Brexit conundrum. The Brexiters refuse to confront it; they simply pretend it does not exist. They have abdicated all responsibility for achieving their dream, split between flouncing out of the top jobs and staying in the cabinet to pretend they can rewrite the agreement as they see fit. They remain defined by their futile oppositionalism, their inability to put forward a vision or a plan.May’s chances of getting her deal through parliament look vanishingly small. Not just because – despite genuflecting to them for months – she cannot carry her party’s Eurosceptics. Labour, bar a handful of rebels, looks certain to oppose the deal.It is right to do so. But Labour, too, has failed abysmally to give the country the political leadership it needs. The six tests Labour has said it will apply to any deal mirror the unreality of the Leave campaign, making no acknowledgement of the trade-offs Brexit forces us to confront, between controlling migration and having access to the single market. Labour has zeroed in on process, not substance. Its only firm Brexit position is to fight for a general election that would allow a future Labour government to renegotiate the terms of our withdrawal – an election that Tory and DUP MPs will certainly not grant under the Fixed Term Parliament Act. Given the incoherence of the tests, it is unclear on what basis it would be trying to renegotiate.This paper has long made the principled case for a referendum on any exit deal. Far from establishing the “will of the people”, the referendum created a democratic deficit: a narrow margin in favour of leaving the EU, but with no mandate dictating the terms and cost of such. The Leave campaigns – both of which we now know broke electoral law – fed the public misinformation and untruths: the idea we could somehow seize back control and get richer in the process, freeing up cash for the NHS, all without jeopardising the union. We cannot make sense of the 2016 result without a second-stage referendum on the terms of our exit.Now, given that we expect there to be no parliamentary majority for the deal, there is also an urgent practical need for a referendum. It is the only route through the political gridlock that is likely to ensue, the only way of resolving the damaging stasis we confront. Nor is there any space for a “no deal” option on the ballot: the choice must be between the status quo or a shambolic, lose-lose deal.Brexit will not quell the populist beast: it will feed itSupport for a referendum on the terms of our exit is gathering fast. But the most common argument against, from those who might otherwise lend their support, is that to open the way for a vote reversing the 2016 referendum would be to risk a popular backlash and a further deepening of political divisions.This is an abdication of leadership, from politicians too fearful to take on the populists at their own game. It’s a continuation of the argument deployed to bring us to the dreadful place we find ourselves in today, and if we continue to capitulate to populism, we will face worse. Populism festers when our political leaders concede to scapegoating without a fight. Populism festers when those leaders decide that those they represent are too stupid to grapple with real-world complexity.There is a watertight case for a referendum on the deal: we now know the terms of exit, there are huge unforeseen costs, and the public must have a say. We need our politicians to make that case. If they don’t, the popular backlash in years to come will be far worse than anything we have seen hitherto. Brexit will deepen inequalities, sharpen resentments and sabotage our chances of meeting the big challenges we face, from an ageing population to climate change, to the changing world of work. Brexit will not quell the populist beast: it will feed it.The stakes have never been higher. Now, more than ever, we need our politicians to step up. No more ultra-nationalist fantasising; no more Tory denial and lies. No more Labour hedging of bets, and hiding behind the political sofa. Don’t run scared of the populists who say a referendum would polarise the nation. Don’t give up, to the detriment of those who can least afford further economic pain. Now is the time for political bravery and a realistic vision of a workable, sustainable, unifying future for this country. The Brexit tragedy is not inevitable. Now is the time to give us, the people, a say."}