{"id": "\nPSG’s Angel Di María leaves it late to salvage a home draw against Napoli\nJordi Alba seals Barcelona win over Internazionale despite no Lionel Messi", "paragraph": "Press Association\n\nWed 24 Oct 2018 23.16 BST\n\n\nFirst published on Wed 24 Oct 2018 22.56 BST\n\nÁngel Di María curled in a stoppage-time equaliser as Paris Saint-Germain twice came from behind to force a 2-2 draw at home against Napoli in a pulsating Champions League tie on Wednesday.Napoli went ahead in the Group C game with a Lorenzo Insigne goal in the 29th minute before PSG, who have won their opening 10 games in Ligue 1, levelled when Mario Rui deflected into his own goal in the 61st minute.An opportunist goal by Dries Mertens put Napoli back in front in the 77th minute but they were denied a shock win when Di María collected the ball on the edge of the area and curled a delightful effort past David Ospina in the third minute of stoppage time.Napoli have five points from three games and PSG are on four with Liverpool top with six.In Dortmund, Real Madrid’s Achraf Hakimi helped Borussia Dortmund defeat his club’s city rival Atlético by setting up three goals in a 4-0 win.It was Atlético’s heaviest defeat of the season so far, and the worst in the Champions League with Diego Simeone as coach. The Europa League champions had conceded only five goals in nine Spanish League games.Hakimi, who joined Dortmund on loan for two seasons in the summer, pulled the ball back for Axel Witsel to break the deadlock for the home side in the 39th minute and sent it back into the centre for Raphael Guerreiro in the 73rd, 10 minutes before he set up England new-boy Jadon Sancho to seal the win with a tap-in. There was still time for Guerreiro to grab his second after a botched backpass from Filipe Luis in the 89th minute.Club Brugge drew 1-1 at home with Monaco in the other Group A game. Dortmund lead with nine points from three games, three ahead of Atlético before their return game in Madrid on 6 November.In Moscow, Porto recovered from a shaky start to beat Lokomotiv Moscow 3-1, opening up a gap at the top of Group D.A penalty save from Iker Casillas and a goal-line clearance kept Porto from going behind early on, before Moussa Marega scored from a 26th-minute penalty at the other end after a foul by Lokomotiv’s Eder. Jesus Corona then crossed for his fellow Mexican Hector Herrera to score with a header in the 35th minute to put Porto in charge. Lokomotiv hit back three minutes later when Alexei Miranchuk cut the ball back for his twin brother Anton to send the ball into the top corner. It was Lokomotiv’s first Champions League goal since February 2004.Yacine Brahimi’s pass made the third goal for Porto in the 47th minute, slicing through the Lokomotiv defence to Corona, who blasted the ball past the goalkeeper Guilherme.Lokomotiv finished with 10 men after the defender Solomon Kverkvelia’s last-ditch foul on Herrera in the 76th minute.Galatasaray drew 0-0 with Schalke in the other Group D game. Porto top the group on seven points, two ahead of Schalke and three ahead of Galatasaray."}