{"id": "\nTrafficking drama Joy wins best film award at London film festival\n", "paragraph": "Jury calls director Sudabeh Mortezai’s film a ‘devastating portrait of resilience’\nVanessa Thorpe Arts and media correspondent\n\nSat 20 Oct 2018 19.40 BST\n\n\nLast modified on Sat 20 Oct 2018 19.41 BST\n\nJoy, a “raw, fresh view” of sex trafficking across Europe, has scooped the London film festival’s award for best film. The drama, from the Austrian director Sudabeh Mortezai, follows the difficult life of a young Nigerian woman, Joy, who works on the street to pay off her debts and support her family back home.The winner, recipient of this year’s bronze Star of London award, was announced on Saturday night in Leicester Square in front of a crowd of cinema fans before a special surprise screening of the winning film was staged.“Joy is a provocative and unique film offering a devastating portrait of human resilience in the most inhuman of environments,” said the Irish director and writer Lenny Abrahamson, the president of the festival’s official competition jury.He went on to praise Mortezai, one of six female directors and co-directors in the running for the prize this year, for immersing her audience in the lives she depicts “with her documentarist approach”.Abrahamson’s jury included leading British acting talents Emilia Clarke, Dominic Cooper and Andrea Riseborough, who picked Joy over a wide selection of comedies, thrillers and dramas drawn from Italy, Hungary, Colombia, America, China and Chile. Two acclaimed British directors, Ben Wheatley and Peter Strickland, were also in the running.The festival closes on Sunday with the world premiere of Stan & Ollie, starring Steve Coogan and John C Reilly playing the classic Hollywood comedy duo Laurel and Hardy.The Sutherland award for the best first feature went to Girl, directed by Lukas Dhont, a Belgian film that also won the coveted Camera d’Or, as well as the Queer Palm, at the Cannes film festival this spring. It tells the story of a transgender teenager who dreams of becoming a ballet dancer.“There’s a complex balance between heartbreak and hope that keeps the audience absorbed,” said Francis Lee, head of the jury in this category. “This is an imaginative and original debut and my fellow jurors and I are excited to see what director Lukas Dhont does next.”The prestigious annual Grierson award for best documentary went to Roberto Minervini’s study of the aftermath of a string of police shootings of black men in the American south, What You Gonna Do When the World’s on Fire?The short film award went to Charlie Lyne’s Lasting Marks."}