{"id": "\nAustralia to relax working holiday visas for backpackers and Pacific Islanders\nDeath in the sun: Australia's 88-day law leaves backpackers exploited and exposed", "paragraph": "Pacific region observers have labeled the plan a “damaging decision” that will take work from Pacific Islanders\nHelen Davidson and agencies\n\nMon 5 Nov 2018 05.51 GMT\n\n\nFirst published on Sun 4 Nov 2018 21.01 GMT\n\nBackpackers and other visitors on working holidays will be able to stay in Australia longer under a federal government plan to help farmers fill job shortages.But Pacific region observers have labelled the plan a “damaging decision” that will take work from Pacific Islanders.Under the changes backpackers will no longer need to leave jobs every six months and will be able to triple the length of their stay if they do extra agricultural work.The prime minister, Scott Morrison, has flatly ruled out calls to scrap the backpacker tax to attract more foreign workers.Pacific Islanders taking up seasonal work will be able to stay three months longer and the age limit for working holiday visas for some countries will be lifted to 35.The changes come after the Nationals failed to deliver a promised agricultural visa and Morrison’s attempt to force unemployment benefits recipients to pick fruit was dismissed by the industry.On Monday, the prime minister insisted the stalled ideas were not dead and buried, framing the relaxed visa rules as an immediate fix to a pressing problem.“We need to ensure we get as many Australians into these jobs as we possibly can,” he told reporters at a strawberry farm in south-east Queensland. “But we’ve also got to make sure that we actually get the job done.”A rule that forced some backpackers to work in northern Australia is also being dumped, allowing them to work in a far wider range of regions.Some 419,000 backpackers visited Australia last year, spending $920m in regional towns. Morrison is hopeful the visa changes will push this figure above $1bn.“They don’t go home with any money in their pocket,” he said. “Everything they earn here, they spend here.”Morrison replied firmly “No” when asked whether he was considering eliminating the 15% tax on working holiday-makers.“When people come and they work, they pay tax,” he said. “We all pay tax when we work. If other people come here and they work, they pay tax too. And they pay it at a concessional rate, and I think it’s a pretty fair deal.”However the announcement was derided in some quarters as short-sighted and “damaging”, with fears it would hurt the prospects of Pacific Islanders under Australia’s six-year-old seasonal workers program.Fijian politician Biman Prasad, said it was a “very damaging decision for the Pacific Islands and the SWP”.A very damaging decision for the Pacific Islands and the SWP @MarisePayne @stephenrhowes https://t.co/UoeFEeVFdJMatthew Dornan, deputy director of the Development Policy Centre, said the announcement was just a “quick fix” as a reaction to lobbying by farmers, and the result was “an agricultural visa pushed through the back door”.People in Australia under the working holiday visas were effectively competition for Pacific Islanders seeking employment under the seasonal workers program, he said. The addition of a third year would only increase the competition.“The seasonal workers program is very important, in countries with very few other economic opportunities,” Dornan said.“It’s something that these countries pushed very hard for in negotiations with Australia with the [Pacific Agreement on Closer Economic Relations Plus trade agreement].”Dornan said there were many other changes that could have been made to the program, which would have helped employers as well as Pacific Islander workers, such as reducing red tape, allowing the sharing of workers between employers, and shortening the application process.This is pretty much the agricultural visa that farmers were asking for. But done by expanding the broken backpacker-farm-work visa. Will increase exploitation and take work from Pacific Islands @MarisePayne @Anne_Ruston @dfat @GrowcomRachel @ForumSEC https://t.co/nshGCaG7udDr Tess Newton Cain, principal of TNC Pacific Consulting and visiting fellow at the Development Policy Centre, said farmers already using the seasonal workers program had recognised that even with a higher degree of regulation, administration, and pastoral care duties, Pacific Island workers were returning annually and were worth the investment.“[But] for farmers who are not yet on board with the SWP and who are looking for the solution to these apparent problems… they’re going to go for the backpacker option,” she said.Newton Cain said the announcement also showed that Pacific Island leaders needed to keep a closer eye on domestic Australian politics, and take concerns to Australian representatives.“We see a number of foreign policy initiatives or actions which are portrayed in the Pac as progressing foreign policy and progressing relationships in the Pacific, but if you look at them from this side what they’re really doing is addressing domestic political issues,” she said.“This is not the only one but it’s a very clear example. This is the PM seeking to respond to a domestic lobby group … and what he has done has significant foreign policy implications.”The Labor frontbencher Andrew Leigh was also sceptical about what he described as a “short-sighted” announcement.A report published last week found backpackers in Australia, about a third of whom are paid less than $12 an hour, are owed billions of dollars in unpaid wages.“The government needs to be very clear about how it’s going to deal with those abuses and how it’s going to create more opportunities for Australians to work in agricultural work,” Leigh told Sky News.The deputy prime minister and Nationals leader, Michael McCormack, denied the changes were an admission his party’s push for an agricultural visa was dead in the water.“It was always going to be difficult to get a specific ag visa in time for this harvest but we are working towards making sure there are more permanent arrangements in place,” McCormack said. “At the end of the day, what needed to happen was we needed to have the workers on the ground to pick the fruit and pick the crops.“We will make sure good workers can come again. That’s all farmers want.”Australia’s agricultural sector has almost doubled in value into a $63.4bn industry over the past decade."}