{"id": "\nThe Fires That Foretold Grenfell review – five missed chances to stop a tragedy\n", "paragraph": "Through the stories of blazes that predated the 2017 disaster, Jamie Roberts’ documentary illustrated the terrible price of failing to learn from mistakes\nTim Dowling\n\nTue 30 Oct 2018 22.00 GMT\n\n\nLast modified on Tue 30 Oct 2018 22.14 GMT\n\nPeople around the world watched in horror in 2017 as Grenfell Tower went up in flames. The conflagration ultimately claimed the lives of 72 people. But there were some for whom the tragedy was sickeningly familiar, those whose first thoughts were, as the firefighter Godfrey Cain said: “Oh my God, not again.”The Fires That Foretold Grenfell (BBC Two) looked back at five fires across 45 years, the lessons of which could have, and should have, prevented Grenfell happening.Take Summerland. It looked like a vision of the future – a 1.4-hectare (3.5-acre), climate-controlled, indoor holiday park on the Douglas seafront on the Isle of Man. The innovative construction was partially wrapped in a translucent acrylic sheeting called Oroglas. “It was fantastic, in that you could get a tan inside even if it rained outside,” said Ruth McQuillan-Wilson, who visited aged five.On 2 August 1973, three boys smoking outside the leisure centre set fire to a crazy-golf kiosk. The kiosk ignited one of the complex’s outside walls, which was skinned in a not-very-fire-retardant material called Galbestos. The fire travelled undetected behind the skin until it reached the highly flammable Oroglas roof.Told by staff not to panic, 3,000 holidaymakers remained in the building as the fire took hold. Burning globules of acrylic rained down on them, spreading the flames. “We didn’t put this fire out,” said Cain. “This fire burned itself out.” Fifty-one people died, making it the worst fire disaster in the British Isles since the Blitz.A subsequent public inquiry produced two findings that would be echoed in other investigations for decades afterwards: large buildings should not be clad in flammable materials; and the “stay put” policy may have hindered the evacuation. The final report called for the installation of sprinklers in all large buildings. Regulations were tightened.In the mid-80s, the run-down Knowsley Heights estate in Merseyside became the first tower block in Britain to be clad. In 1991, it was the first such tower block to catch fire. The cladding turned the building into a giant chimney. “As I was coming down the stairwell, the windows were just melting away,” said Amanda Roberts, a resident. Fortunately, no one died. “Somebody took a decision to wrap a residential tower block in flammable material,” said Les Skarratt. “As a firefighter, that made me angry.”But the cladding was legal: the Thatcher government had reduced more than 300 pages of building regulations to just 56. This resulted in the production of a guidance document known as Approved Document B, which sets out recommended materials for construction, including external cladding. Often refined and updated, it morphed into an inconsistent and impenetrable mess that did more harm than good. Even after Knowsley, cladding was not legally required to be fireproof.The list of tragedies got more depressing as it went on, not least for the grim repetition of the main elements. Garnock Court in Irvine, North Ayrshire, 1999 – one dead. “The cladding was to blame,” read the local newspaper headline. Harrow Court in Stevenage, Hertfordshire, 2005 – three dead, including two firefighters. An investigation called for a review of the “stay put” policy, but it remained in place. Lakanal House in Camberwell, London, 2009 – six killed. Flames leapfrogged floors, climbing up the cladding on the outside of the building. Catherine Hickman, a dressmaker, died on the 11th floor while on the phone to the emergency services, who were telling her to stay where she was. After each of these tragedies, investigations were launched, reports completed – and key recommendations largely ignored.Filmed and directed by Jamie Roberts (who made the excellent Manchester: The Night of the Bomb), The Fires That Foretold Grenfell amounted to a shocking litany of measures not taken. It showed how the victims came to die, but it could not explain why. The collective irresponsibility is so widely spread over so many years that it is hard to divine the point at which basic safety came to be regarded as an extravagance.Roberts is most adept at letting the survivors – and victims’ loved ones – tell their stories. The stories here carry the additional weight of subsequent tragedy. The high cost they paid, they had hoped, would at least be invested in the future protection of others. But it was not."}