{"id": "\nAmerica to partner with Australia to develop naval base on Manus Island\nApec leaders at odds over globalisation and free tradeScott Morrison to take on backlash against trade deals at Apec'The China show': Xi Jinping arrives in PNG for start of Apec summit", "paragraph": "The joint facility, which will host more warships in the Pacific, comes at a time of concern about rising Chinese influence\nKatharine Murphy Political editor\n\nSat 17 Nov 2018 22.32 GMT\n\n\nLast modified on Sat 17 Nov 2018 22.39 GMT\n\nAmerica will partner with Australia to develop the Lombrum naval base on Manus Island, telegraphing a strategic commitment to the region at a time of concern about rising Chinese influence.The joint facility, which crowds out an aspiration by Beijing to develop the port, was first unveiled by Scott Morrison and his PNG counterpart, Peter O’Neill, at the beginning of the month.The US vice president, Mike Pence, used the Apec summit in Port Moresby over the weekend to confirm the US would also support the naval facility on Manus Island, which can host more warships in the Pacific.The American gesture at the weekend builds on a commitment by Japan, unveiled by Morrison and Shinzo Abe at the opening of the Apec summit, to boost infrastructure investment in the region.It is clear the positioning from Australia, Japan and the US is aimed to check China’s influence, which has been growing in the region partly in response to Australia cutting its aid budget, but Morrison told reporters American involvement on Manus was at PNG’s invitation.“It’s their sovereign territory, that’s why we’re working together under their leadership. It’s their initiative and we’re pleased to be part of it,” the Australian prime minister said.“We will be working with Pacific Island nations at their invitation wherever we have that opportunity consistent with the programs that we’re running. Those programs are cultural programs, they’re educational programs, they’re strategic defence programs, they’re communications and infrastructure and the cable and all of these sorts of measures. We’re looking to build up the Pacific.”Pence also used a speech to the summit to implicitly warn Pacific nations off accepting financial help from China. He said infrastructure loans, which have been deployed by Beijing with Pacific countries, had “opaque” terms, and threatened the sovereignty of small nations.“Projects they support are often unsustainable and poor quality. Do not accept foreign debt that could compromise your sovereignty,” Pence warned. “Protect your interests, preserve your independence and just like America, always put your country first.”Very few details are currently available about the costs of the Manus Island project, and how they will be balanced between the development partners.The American posture at Apec fuels tensions between Washington and Beijing, which have manifested in a tit-for-tat trade war since the middle of the year.China used a meeting with the new Australian prime minister at Asean earlier this week to signal a reset on relations after a period of tension sparked by an Australian crackdown on Chinese influence. Morrison met the Chinese premier, Li Keqiang, in Singapore but has not yet met the Chinese president.Morrison used his opening speech at Apec to push back on the US-China trade war, and implicitly criticise the protectionism of the Trump administration. He said open markets and trade liberalisation helped lift people out of poverty.While Australia is welcoming the Pacific pivot by the US and Japan over the past week as a win, Morrison’s first foray into summit season as prime minister has been overshadowed by a rolling diplomatic row about Australia moving its embassy in Israel.The controversy began with a public warning from the Indonesian trade minister that Jakarta would not sign off on a free trade deal with Canberra if the embassy move proceeded. That was followed by a suggestion from the Malaysian prime minister, Mahathir Mohamad, that relocating the embassy from Tel Aviv to Jerusalem would add to the cause of terrorism.Mahathir’s comments triggered strong pushback by Australian ministers on Friday. The deputy Liberal leader, Josh Frydenberg, accused Mahathir of having form in making “derogatory comments” about Jews in the past, including calling them “hook-nosed”, questioning the number of people killed in the Holocaust and banning the Holocaust film Schindler’s List.Government conservatives have lined up to declare Australia should move the embassy, and make its own foreign policy decisions as a sovereign nation regardless of any diplomatic blowback. Morrison said this week a final decision on the embassy relocation will be made by Christmas.As well as rolling controversy about the Israel shift, Morrison’s Pacific pivot has also been queried by Concetta Fierravanti-Wells, the former minister for international development and the Pacific.Ahead of this weekend’s Apec summit in Port Moresby, the prime minister unveiled a $2bn infrastructure financing facility for the Pacific as part of new measures designed to project Australia as the region’s principal security and development partner.But the former frontbencher, who lost her spot in the Liberal leadership convulsion, said the new Australian loan facility raises concerns, because it adds to debt in the region. “I don’t want to see a situation where one debtor is swapped for another.”Earlier in the year, when she still held the Pacific portfolio, Fierravanti-Wells blasted China for using using concessional loans to boost its influence, and for building useless infrastructure projects, like roads to nowhere.She said debt, and debt sustainability, was now a significant concern for Pacific countries, troubling the international community, multilateral banks and the Pacific Islands Forum grouping.“It’s all very well to look at infrastructure, and that’s very important – undersea cables and all those things – but at the village level, the things that really matter are the school, the community hall and the hospital. Because if they can’t stand the next cyclone or storm then, for that village or community, it’s really hard for them to pick themselves up again.”"}