{"id": "\nLuisa Omielan’s Politics for Bitches review – a truly refreshing voice\n", "paragraph": "The standup is hilarious and a joy to watch, but she is also a force to be reckoned with when it comes to tackling the absurdity of civic life in Britain\nLucy Mangan\n\nWed 24 Oct 2018 23.45 BST\n\n‘It took me ages to work out the difference between Tories and Conservatives,” ran one of Luisa Omielan’s lines in her standup show Politics for Bitches at Edinburgh this summer. “If you laughed at that,” she added, once the audience had done so, “you’re too advanced for this show.”Accessibility is allegedly the BBC’s holy grail. In practice, this has generally meant commissioning Russell Brand on the grounds that he pronounces hard words in a mockney accent, but occasionally the stars align and the denizens of W1A find someone who has a genuinely common touch. Stacey Dooley is the standard bearer, and we will see how Danny Dyer’s history documentary goes, but a new voice has been added to the mix, via Omielan’s adaptation of her fringe show into a part-documentary, part-standup exploration of politics as experienced by the man on the Clapham omnibus/faceless millennial in the gig economy (BBC One).The first of four episodes looks into housing, with Omielan asking a simple question (and ignoring the cries of those who would tell her that, oh no, it’s not so simple, surely!): why, at the age of 35 (she has since turned 36) and working full time, can neither she nor her peers buy a place to live?Wage stagnation, the broken property market, the maintenance of high rents by government policy that prefers to have people on housing benefit than piss off the rentier class by building more housing (I paraphrase, but not by much) are covered. The unwillingness of mortgage lenders to see anyone other than the holders of steady, old-fashioned jobs as viable vessels for their precious funds is also neatly explained.The effects of all this are deftly demonstrated, too. Omielan attends a speed-flatmating event (like speed-dating, but with many more ways to end up screwed) and meets an architect with visions of a pod-based future. “Thousands of young people just trying to live their best life and learn how to contour,” Omielan sighs as she inspects his plans for 10 sq metre living spaces squeezed into towers. It is a neat dig at the millennial stereotype cleaved to by older demographics as their real problems are literally stacked up.She also tours an office block under property guardianship, the practice by which a company takes over unused office space, makes it basically habitable (if you are lucky – Omielan spoke to inhabitants who had turned up to find carpetless, windowless rooms) and rents out rooms on rolling monthly “licences” to not-quite-tenants, who live five or six to each bathroom and kitchen and keep squatters out in return for below-market rent. “You’ve got the best deal out of all of them,” notes Omielan, sitting down with Scott, who manages one of these enterprises. His permanent smile did not entirely distract from his barracuda stare, the outward tell of the inner calculations being made by men working in the margins. “It does come with a lot of headaches,” he insists. “Yeah,” Omielan replies briskly. “But it also comes with a lot of money, so you’re fine.”In later episodes, Omielan tackles public spending and social mobility. “Boris Johnson got into Oxford?” she says, peering at evidence hanging in a hallway. “How?” This is a question that cannot be asked often enough, not because we do not know the answer, but because the answer is appalling, has a tentacular reach and we need to hear it to remind ourselves. The last episode covers the NHS and Omielan’s mother’s painful, undignified death within a system that her daughter feels failed her. The experience prompted Omielan to start investigating how politics got us here and to develop the original standup show.Viewers may or may not agree with her points of view, those of the experts to whom she speaks or the takes of the “ordinary” people she interviews. But the point is that she is saying it differently, starting at a dramatically and authentically less sophisticated point than usual and demanding to be informed. She is hilarious and a joy to watch – a force to be reckoned with in factual and comedy settings. It all feels so fresh that I find myself watching anxiously, hoping that the light of youth and hope does not vanish from her eyes as she learns about the world. Retreat to your pod and learn how to contour, babe, before it is too late."}