{"id": "\nMohamed Salah’s goals have silenced debate on his form, says Jürgen Klopp\nMohamed Salah hits double as Liverpool coast past Red Star Belgrade", "paragraph": "• Salah reaches his half century of Liverpool goals• Klopp: ‘It’s good that we can maybe stop talking about that’\nAndy Hunter at Anfield\n\nThu 25 Oct 2018 00.07 BST\n\n\nLast modified on Thu 25 Oct 2018 09.03 BST\n\nJürgen Klopp said Mohamed Salah had silenced debate over his form by reaching the 50-goal mark for Liverpool faster than any player in the club’s illustrious history.Salah hit the half century on his 65th appearance for Liverpool with two goals in the convincing Champions League defeat of Red Star Belgrade. Albert Stubbins, the previous quickest to 50 Liverpool goals, did so in 77 games between 1946-48. Roberto Firmino and Sadio Mané also scored against Serbia’s champions as Liverpool’s victory, combined with Paris Saint-Germain’s draw at home to Napoli, sent Klopp’s team top of Group C.The Egypt forward has come under intense scrutiny during the start of a season in which he had struggled to recapture last term’s phenomenal form. But after his sixth goal of the campaign, and latest Liverpool record, Klopp insisted Salah had delivered an emphatic response.“I think he would say thanks to his teammates because it’s quite difficult to score goals without these wonderful passes and crosses,” said the Liverpool manager on Salah’s half century. “Like tonight, I have to watch it back, but I think the first goal he scored was just genius little linkup play from Shaq [Xherdan Shaqiri]. I don’t know how he did that.“It’s good that we can maybe stop talking about that. That will help a little bit. I was not in doubt, he was not in doubt, but if you are constantly asked about it then you think something is obviously wrong or people are not happy. You shouldn’t be constantly be thinking about how you can score again. It only happens if you work hard, you are in the right spaces, if your team-mates see you in the right moments and if you make the right runs, then you can score. It’s an exceptional number and hopefully he can continue. What’s the next record he can reach?”Salah’s goal celebrations were restrained against the Serb side but Klopp said the forward’s only issue was being substituted in the 73rd minute. The manager added: “He is completely fine. If he’s not celebrating maybe he’s a bit annoyed about getting asked about it. I saw him celebrating but I couldn’t see his face from that distance. I know he is fine. I saw his face when I took him off. That was different.”The Liverpool manager also reserved praise for Fabinho, who impressed on only his second start since his summer arrival from Monaco. Klopp said: “The present for his birthday [on Tuesday] was not that he was in the lineup, it was that we played his favourite system with the double six. He played really well, good to see, very aggressive, everything was there. That was the start. Now he has to carry on.”"}