{"id": "\nRefusal to bow shows England ready for All Black ‘benchmark’\nLeader Owen Farrell the foundation of Eddie Jones’s new-look England | Andy Bull‘Bring it on’: Eddie Jones ready for All Blacks after England win ‘arm wrestle’Owen Farrell escapes being cited over André Esterhuizen tackle", "paragraph": "Second-half revival in narrow win over South Africa leaves Eddie Jones eager for Test against the best\nRobert Kitson at Twickenham\n\nSun 4 Nov 2018 22.00 GMT\n\n\nLast modified on Mon 5 Nov 2018 01.40 GMT\n\nThis time next year the Rugby World Cup will have just finished and Saturday’s opening match of the Quilter autumn series will mostly be forgotten. The majority will only recall South Africa literally throwing away a game they should have won and the dubious late decision not to penalise Owen Farrell for exactly the type of hit World Rugby wants to outlaw.Within the England camp, nevertheless, this may yet prove a small but pivotal breakthrough in terms of their 2019 prospects. Its value lay not in the quality of the rugby – neither side were anywhere close to outstanding – but in the red rose character it revealed. Sometimes it is slightly fortunate, against-the-grain success that gives teams more inner belief than days when victory is squeezed more smoothly from the tube.Of course, everything is relative: if New Zealand are allowed the same first-half ball and territory they will win by 25 points. When they analyse the match tape, even so, the All Blacks will also note England’s refusal to buckle and their doggedness in adversity. Given how many influential bodies are unavailable to Eddie Jones the confidence generated by their second-half revival will be substantial.Even the great Harry Houdini would not have relished the padlocked straitjacket in which the Springboks had their opponents imprisoned. If their great escape, secured by a nerveless Farrell penalty, owed much to Springbok profligacy and the erratic lineout throwing of Malcolm Marx it was also notable for England’s refusal to bow to the seemingly inevitable.With just about everyone expecting a New Zealand victory this weekend that is not the worst trait for Jones’s squad to be developing. Mark Wilson, George Kruis, Ben Moon and Harry Williams may not be starry names but the grit and character that confounded the Boks are precisely the qualities upon which consistent Test packs are built. With Courtney Lawes and Manu Tuilagi hoping to be fit to face the All Blacks, Jones’s post-match tone suggested the world’s best team can be made to stop and think. “I said to the boys after the game that I can’t wait. They are the benchmark for world rugby; the team you want to play against. You only know where you are in the world when you play against the All Blacks.”It is set to be a contrasting sort of contest; New Zealand will be smarter and more clinical than the Boks unless England cut them off at source. With a couple of tweaks – perhaps Sam Underhill for the injured Tom Curry on the openside flank and a front-row reshuffle – it is not a game Jones sees as unwinnable. “You’ve got to believe you can beat them. You’ve got to understand where they’re weak and strong and be disciplined in your gameplan. New Zealand are going to be different. They’re going to want to run the ball from everywhere and put air on the ball. We’re going to have to be a different team next week.”Given South Africa beat the All Blacks in Wellington and should also have toppled them in Pretoria, the long-awaited return of the silver fern to south-west London will certainly not lack for pre-match conjecture. Take your pick from England’s new defence coach, John Mitchell, up against his compatriots, Will Carling back in the England fold as a leadership adviser and Farrell looking to replicate last year’s Lions’ second Test success in Wellington.Underpinning it all, too, will be England’s rising sense they are not that far away from taking a giant leap. “The belief you get from winning those tight games is enormous,” said Jones. “It just makes everyone feel better and means we won’t have to pick them up this week. I didn’t need this result to make me believe we can beat the All Blacks – I thought we could beat the All Blacks back in 2016. Nothing has changed, mate.”Jones insists he still felt confident at half-time on Saturday, despite South Africa having enjoyed 78% territory and almost as much possession in the first 40 minutes. His rationale was that, psychologically, the Boks were under more pressure having not nailed their numerous chances. The most glaring came when England were down to 14 men, with Maro Itoje in the sin-bin, and defending a South Africa lineout five metres out which Marx proceeded to overthrow. “What I was really pleased about was that 10 minutes when Maro went to the bin,” said Jones. “I think we won it 3-0. To do that against a side that should’ve beaten New Zealand twice in a row is not bad.” With a few playful jabs at the media thrown in – “You guys love sacking coaches, that’s what you live for. I know what would make you guys happy” – Jones has rarely appeared more upbeat after any fixture since he took the England job. As far as he was concerned, the Farrell hit was just “a good solid tackle” and another apparent high challenge from Jonny May in the hectic closing moments was similarly glossed over.It was left to the former French national coach Philippe Saint-André, among others, to speculate on the reaction had Farrell’s hit been made by a Frenchman, a Fijian or a Samoan. If the game is serious about reducing tackle height a penalty should have been awarded but fortune, on this occasion, favoured the brave.England: Daly; Nowell (Ashton, 65), Slade, Te’o (Ford, 73), May; Farrell (co-capt), Youngs (Care, 65); Hepburn (Moon, h/t), Hartley (co-capt, George, 57), Sinckler (Williams, 65), Kruis, Itoje, Shields (Ewels, 77), Curry (Mercer, 42), Wilson.Pens: Farrell 4.Sin bin: Itoje (16)South Africa:¬†Willemse; Nkosi (Esterhuizen, 60), Kriel, De Allende (Jantjes, 77), Dyantyi; Pollard, Van Zyl (Papier, 75); Kitshoff (T Du Toit, 65), Marx (Mbonambi, 75), Malherbe (Louw, 65), Etzebeth (Snyman, 42), PS Du Toit, Kolisi (capt; De Jager, 65), Vermeulen, Whiteley.Try: Nkosi. Pens: Pollard 2.Referee: A Gardner (Australia). Att:¬†80,369. ENDS COPY"}