{"id": "\nNurse who treated Pittsburgh shooter: 'I'm sure he had no idea I was Jewish'\nPittsburgh shooter was fringe figure in online world of white supremacist rage", "paragraph": "Ari Mahler cared for Robert Bowers who was shot by police after he killed 11 people and wounded six at a synagogue\nMartin Pengelly\n\nSun 4 Nov 2018 20.17 GMT\n\n\nLast modified on Mon 5 Nov 2018 22.00 GMT\n\nA week after a gunman shouted antisemitic remarks as he killed 11 people and wounded six at a Pittsburgh synagogue, a nurse who treated his wounds said: “I’m sure he had no idea I was Jewish.”Robert Bowers, 46, was shot by police at the Tree of Life synagogue in Squirrel Hill. He was treated at Allegheny general hospital – during which he continued to shout antisemitic remarks, the hospital president said. Faced with a 44-count indictment that included charges of murder, hate crimes, obstructing the practice of religion and other crimes, Bowers pleaded not guilty. He faces the death penalty.The Washington Post reported that “at least three” of the doctors and nurses that saved the gunman’s life were Jewish, a fact that attracted worldwide attention throughout a week of debate and mourning.In a Facebook post on Saturday, Ari Mahler wrote: “So now, here I am, the Jewish nurse that cared for Robert Bowers.“I’ve watched them talk about me on CNN, Fox News, Anderson Cooper, PBS and the local news stations. I’ve read articles mentioning me in the [New York] Times and the Washington Post. The fact that I did my job, a job which requires compassion and empathy over everything, is newsworthy to people because I’m Jewish. Even more so because my dad’s a rabbi.”Why thank a Jewish nurse, when 15 minutes beforehand, you’d shoot me in the head with no remorse?Media outlets including the Pittsburgh Post-Gazette said Allegheny Health Network representatives confirmed the authenticity of the post and Mahler’s position as an emergency trauma room nurse.Mahler wrote extensively about his childhood and his experience of antisemitism in what he called “a different time … where bullying was not monitored like it is now”.“The fact that this shooting took place,” he continued, “doesn’t shock me. To be honest, it’s only a matter of time before the next one happens … the FBI and the Southern Poverty Law Center note that Jews only account for 2% of the US population, yet 60% of all religious hate crimes are committed against them. I don’t know why people hate us so much, but the underbelly of antisemitism seems to be thriving.”Bowers’ social media use linked him to streams of far-right opinion in which antisemitism mixes with anti-immigrant invective. In the aftermath of the shooting, debate raged over the relevance or even culpability of Donald Trump’s political rhetoric, including his equivocating response to far-right protesters who shouted antisemitic remarks in Charlottesville, Virginia, last year. The president visited Squirrel Hill, meeting protest and considerable controversy.Mahler did not directly address such questions, writing in his post of the “compassion” and “empathy” he tried to show the gunman.“To be honest,” he wrote, “I didn’t see evil when I looked into Robert Bowers’ eyes. All I saw was a clear lack of depth, intelligence, and palpable amounts of confusion.”He added, however, that he thought Bowers “probably had no friends, was easily influenced by propaganda, and wanted attention on a sociopathic level. He’s the kind of person that is easily manipulated by people with a microphone, a platform, and use fear for motivation.”Mahler said he would not go into great detail, because of privacy rules. But he wrote that the gunman “thanked me for saving him, for showing him kindness, and for treating him the same way I treat every other patient.“I’m sure he had no idea I was Jewish. Why thank a Jewish nurse, when 15 minutes beforehand, you’d shoot me in the head with no remorse?“I didn’t say a word to him about my religion. Besides, if he finds out I’m Jewish, does it really matter? The better question is, what does it mean to you?”In conclusion, Mahler wrote: “If my actions mean anything, love means everything.”"}