{"id": "World Series Game 2: Los Angeles Dodgers 2-4 Boston Red Sox – as it happened!David Price and bullpen star as Red Sox take 2-0 World Series lead over Dodgers", "paragraph": "\nDavid Lengel\n\nThu 25 Oct 2018 04.32 BST\n\n\n\nFirst published on Thu 25 Oct 2018 00.10 BST\n\n\n\n\n4.43am BST\n04:43\n\nYou can read the full report from tonight’s game below:\n\n4.28am BST\n04:28\n\nAlex Cora pushes every right button, which cannot be said for Dave Roberts. Yes, the Sox retired 16 straight Dodgers to end this game, but LA were up in this one. In a key fifth inning moment, Roberts lifted his starter on 69 pitches, in favor of a reliever who had a five plus ERA this season, and who had given up the lead on the previous night. It did not work out. Not even close. Yes, Roberts will have a lot to answer for. But don’t take anything away from Price and the bullpen, they were masterful. And then there’s the offense, which are relentless with two outs, using that magic once again to beat their playoff opponent. The good news for LA? You’re not in trouble until you lose a home game. We’ll be back on Friday night for Game 3 from Los Angeles, but for now, thanks for reading, and wherever you are, good morning, good afternoon and good night. Updated\nat 4.32am BST\n\n\n4.22am BST\n04:22\n\nKimbrel grounds out to short, and the Boston Red Sox have a 2-0 World Series lead!\n\n4.21am BST\n04:21\n\nDodgers 2-4 Red Sox, top 9thTaylor grounds out to second. Two down. It’s up to Matt Kemp. \n\n4.19am BST\n04:19\n\nDodgers 2-4 Red Sox, top 9thHere’s Craig Kimbrel, who looks like he’s trying to pull satan out of his opponent every time he throws from the windup.Machado skies to right and that’s one out. Fourteen Dodgers have been retired, in a. row, which is a lot. Now it’s Taylor who is set to be exorcised. \n\n4.16am BST\n04:16\n\nThat's a really funny way to spell \"Dave Roberts\"... pic.twitter.com/9psdPFRHEA\n\n4.16am BST\n04:16\n\nDodgers 2-4 Red Sox, bottom 8thDevers grounds out to second and he’s got a goose-egg on his 22nd birthday. I’m trying to remember if I was playing in a World Series when I was 22.Three outs left for the Dodgers. \n\n4.13am BST\n04:13\n\nDodgers 2-4 Red Sox, bottom 8thMartinez lifts a fly ball to center field but Bellinger is running to his right and makes a tremendous sliding catch on his knees. Fabulous defense there from LA. Now Bogaerts flies to CF, and this is considerably easier. Two down. \n\n4.11am BST\n04:11\n\nAnd one more Fenway discovery to share: The future is weird. @LengelDavid pic.twitter.com/4Qg65pq9zuThat Hunter does get around...\n\n4.09am BST\n04:09\n\nDodgers 2-4 Red Sox, top 8thPederson pops to left, inning over. For the record, Freese was 1-2 with a walk tonight, and tonight, the Dodgers have only three hits. Last night he was 2-3. Great move. \n\n4.07am BST\n04:07\n\nDodgers 2-4 Red Sox, top 8thTurner grounds out. Joc Pederson pinch hits for Freese, who is one of themost productive hitters for LA. \n\n4.05am BST\n04:05\n\nDodgers 2-4 Red Sox, top 8thIt’s a 99mph heater that swooshes past Bellinger. One down. Remember relievers who weren’t closers threw 90 if they were lucky? I know Eovaldi isn’t a reliever, but you get my point, don’t you?\n\n4.04am BST\n04:04\n\nDodgers 2-4 Red Sox, top 8thEovaldi is in, and he may start a game in LA. Cora doesn’t care, he just pushes all the right buttons. It’s a new era, and it’s working out better for some...1-2 to Bellinger. \n\n4.02am BST\n04:02\n\nEmailWillsie Scott says:“Dodgers manager makes same mistake twice. Dodgers pitcher Madison duplicates what he did last night. Gives up lead again.”That is correct. It has to be frustrating if you’re a Dodgers fan. \n\n4.00am BST\n04:00\n\nDodgers 2-4 Red Sox, bottom 7thBetts is running on a ball in the dirt! Aggressive base running by Boston who do everything right. So man on third before Alexander gets Moreland to strikeout. Inning over. Here comes the top of the Dodger order in the eighth. \n\n3.55am BST\n03:55\n\nHunter Is Terrible At Taking Ballpark Pictures #432354. This was my favorite find of my Fenway wanderings, I'd never been up this high. Somewhere down there are the bullpens. @LengelDavid pic.twitter.com/NSN6j1V8u5Hunter on tour!\n\n3.55am BST\n03:55\n\nDodgers 2-4 Red Sox, bottom 7thBenintendi strikes out. That’s the good news. Now there’s two outs, which means Betts will be coming home soon. Mitch Moreland will pinch hit for Steve Pearce. Roberts is out to get Maeda. Here comes...Scott Alexander. Updated\nat 3.57am BST\n\n\n3.51am BST\n03:51\n\nFOX TV in the US is talking about how Babe Ruth threw 13 shut out innings in the 1916 World Series.Roberts would have lifted him in the fifth. \n\n3.50am BST\n03:50\n\nDodgers 2-4 Red Sox, bottom 7thBetts lifts a fly ball, sky high into left. Does it have enough? We’re waiting for it to come down. And waiting. And waiting...it’s off the wall!It’s a double for Betts on a ball that bounces off the moon. That’s a runner in scoring position, but don’t worry Dodgers fans, there’s only one out. Here’s Benintendi. \n\n3.48am BST\n03:48\n\nDodgers 2-4 Red Sox, bottom 7thVazquez, who started it all with two outs in the sixth inning, is at the plate facing new Dodgers pitcher Kenta Maeda.The count is full: a ground ball sends Muncy to his left, he’s got it, and he fires over to the first for the first out. \n\n3.45am BST\n03:45\n\n\n\n3.43am BST\n03:43\n\n...well, you get it. He’s done a heack of a job since being lit up by NYC talkshow host Evan Roberts, that’s for sure. 6IP 3H 2R 2ER 3BB 5K 0HRGive the guy a lot of credit, especially because of the crap he’s taken up there since signing that big deal: he’s stepped up. \n\n3.41am BST\n03:41\n\nDodgers 2-4 Red Sox, top 7thGrandal is caught looking and the Dodgers are counting outs. Great inning from Kelly. \n\n3.40am BST\n03:40\n\nIs Dave Roberts gonna manage or just go by a fucking piece of paper. C'mon bro.\n\n3.39am BST\n03:39\n\nDodgers 2-4 Red Sox, top 7thPuig grounds to third, easy for Devers who rifles it to first to get Puig. Two down, here’s Barnes. \n\n3.38am BST\n03:38\n\nDodgers 2-4 Red Sox, top 7thHere’s Muncy, who hit over 30 home runs but isn’t good enough to play in Fenway Park. He strikes out swinging. \n\n3.33am BST\n03:33\n\nDodgers 2-4 Red Sox, bottom 6thBradley pops to third, inning over. \n\n3.31am BST\n03:31\n\nDodgers 2-4 Red Sox, bottom 6thThree Dodgers come together in left field but Bellinger finally takes charge and puts away a Kinsler fly ball. Jackie Bradley Jr is next. \n\n3.30am BST\n03:30\n\ns a. hard-luck line. He was way WAY better than this. 4.2IP 6H 4R 4ER 1BB 5K 0HRMaybe he was just cold...do you know how cold it is in Boston?\n\n3.29am BST\n03:29\n\nDodgers 2-4 Red Sox, bottom 6thUrias is on for LA, and Devers lifts a fly ball to center for out no1. \n\n3.25am BST\n03:25\n\nAnd by the way......that is why the Dodgers absolutely have to deliver with runners on the corners and two down in the fourth. You need to convert chances against these monsters. Two runs that inning was not nearly enough. Kemp is retired, 5-3. Inning over. \n\n3.23am BST\n03:23\n\nDodgers 2-4 Red Sox, top 6thMachado pops to left, Taylor lays down a bunt, which is gobbled up by Devers at third and handled for the second out. Two down. It’s left for Kemp. \n\n3.19am BST\n03:19\n\nDodgers 2-4 Red Sox, bottom 5thSo Roberts brings in a washed up reliever with multiple surgery scars, with a five plus ERA who pitched yesterday in favor of Ryu who was basically awesome tonight and was on 69 pitches. If you’re gonna make a move, why not Baez, who was removed last night after dealing in favor of Wood who gave up a three-run home run?Bogaerts strikes out. Inning over. You know, LA lost last season after some dubious Roberts reliever/pitching decisions in the WS v Houston. Just saying. \n\n3.15am BST\n03:15\n\nMartinez hits it to right and it drops in! Betts scores, Benintendi scores. It’s more two out theatrics from Fenway and considerably more egg on the face of Roberts, that is, if you ask me!\n\n3.13am BST\n03:13\n\nfour! Vazquez, who started all of this, scores and we’re tied!Yes, another great pitching move from Roberts. Madson gave up the lead last night as well. I just don’t get it. Updated\nat 4.14am BST\n\n\n3.12am BST\n03:12\n\nDodgers 2-1 Red Sox, bottom 5thMadson is up and in again! It’s 3-1!\n\n3.12am BST\n03:12\n\nDodgers 2-1 Red Sox, bottom 5thThe righty deals, a moving fastball over the plate for strike one. \n\n3.11am BST\n03:11\n\nDodgers 2-1 Red Sox, bottom 5thUp and even more in...2-0!\n\n3.11am BST\n03:11\n\nDodgers 2-1 Red Sox, bottom 5thHere we go...up and in for ball one. \n\n3.10am BST\n03:10\n\nDodgers 2-1 Red Sox, bottom 5thAnother foul ball. That’s seven pitches as Ryu approaches 70 on the night. Barnes is out to talk to Ryu again. That makes sense. This is an absolutely huge out and everything needs to be just right. It’s ball four! From two outs and nobody on to bases loaded!Here comes Roberts to get Ryu and that’s a shame. He should have a chance to face Pearce. I like his chances: he’s been excellent. Madson is coming in. \n\n3.06am BST\n03:06\n\nDodgers 2-1 Red Sox, bottom 5thRyu looks in and steps off. The tension is high, Fenway fans are up, waiting...\n\n3.05am BST\n03:05\n\nDodgers 2-1 Red Sox, bottom 5thBenintendi, who looks like he’s wearing a ripped t-shirt around his neck, waits, as Barnes goes out to talk with Ryu. Then time is called one more time and now we’re ready to go. Fastball up and in. It’s a full count, the runners will be going...\n\n3.04am BST\n03:04\n\nDodgers 2-1 Red Sox, bottom 5thBig curveball loops over the plate and it’s 2-2. Fantastic pitch. \n\n3.03am BST\n03:03\n\nDodgers 2-1 Red Sox, bottom 5thBenintendi is ahead in the count 2-0...\n\n3.03am BST\n03:03\n\nDodgers 2-1 Red Sox, bottom 5thBall in the dirt, it bounces off Barnes and the ball is loose! The runners stay put after the Dodgers catcher chases it down, quick like a cat to prevent the runners advancing. "}