{"id": "\n‘It doesn’t make sense’: Europe puzzled by UK Brexit meltdown\n", "paragraph": "\nKim Willsher in Paris, \nJosie Le Blond in Berlin and \nAngela Giuffrida in Rome\n\nSat 17 Nov 2018 20.59 GMT\n\n\nLast modified on Sat 17 Nov 2018 22.20 GMT\n\nAs Britain went into Brexit meltdown, French friends made the kind of comment usually reserved for the recently bereaved. “So sorry,” they said sympathetically. “Have you, you know … applied for French nationality?”.French TV presenters asked the same question – with a hint of glee – to British journalists invited to their studios to comment on Brexit. French officials report that applications for French nationality have rocketed as the Brexit deadline – now four months away – has approached.In bars and cafes, Brexit was not the main topic of conversation in France, which has problems of its own. Pushed to express an opinion, the most common response suggested Britain had “brought this upon itself”. “Most of all, I feel sorry for my British friends,” said Catherine in a cafe at Bastille in the centre of Paris.Across Europe people were genuinely perplexed about how the optimism of Wednesday, when it was announced the EU and UK had reached a deal, had turned to dust a few hours later.“Brextremist putsch attempt” the German tabloid Bild declared, as Theresa May struggled to maintain a grip on her government and her own political future.Writing on Spiegel Online, EU correspondent Peter Müller urged May to hold on, calling her “the lonely heroine of the Brexit theatre” and praising her for having made the best of a bad situation.The agreement was “of course not perfect”, he wrote, but was within the “realms of what was possible” and was the best both sides could have hoped for.In Italy, a country which also has plenty of its own concerns, namely a wrangle with the EU over the country’s 2019 budget, Brexit still made headlines. “Brexit, nightmare of a midsummer night,” wrote Enrico Franceschini, correspondent in London for La Repubblica.Many ordinary Italians were simply bewildered. Vezio Parpaglioni, an art dealer, said: “It’s bad. We should be united, not trying to build walls like Donald Trump is doing.”Goffredo Gattoni, a bar owner in Rome, said: “Everyone around here is saying the same thing: it doesn’t make sense for the UK to break away.“What about Scotland, that wants to remain? Theresa May seems a very weak leader – not like the other one, Margaret Thatcher.”That opinion of May was far from universally shared, however. France’s bestselling newspaper Ouest-France ran a leader sympathising with the prime minister, describing her decision to present the withdrawal agreement as “courageous and remarkable”.“In accepting the European Union withdrawal agreement, Theresa May has put the greater interest of her country before that of her party and perhaps even her own. No one can imagine that a United Kingdom isolated from the continent can work in the long term and everyone knows that Europe without the UK will no longer really be Europe,” it wrote.However it added the PM’s choice was “perilous … because it satisfies neither those who thought it was possible to break with 45 years of common life [with the EU] at the flick of a switch, nor those who hope for a second referendum.“Since 23 June 2016, our cousins across the Channel have sought ways to leave the European project, whose aims they say they never shared. Their mistake, however, has been to believe that it would be possible do so and still profit from the benefits of European integration,” ran the leader."}