{"id": "\nBritain's equality efforts overshadowed by 'backwards steps', EHRC warns\nSave for our pensions? We millennials can barely find the money to live | Poppy NoorOne in five Britons with disabilities have their rights violated, UN told", "paragraph": "Declining access to justice and rise in infant mortality among key issues raised in report\nRobert Booth Social affairs correspondent\n\nThu 25 Oct 2018 00.01 BST\n\n\nLast modified on Thu 25 Oct 2018 00.35 BST\n\nProgress on making Britain a more equal country has been overshadowed over the last three years by “alarming backward steps”, the government’s own equalities watchdog has warned.A rise in infant mortality for the first time since the 1990s, worsening prospects for disabled people, increasing child poverty and declining access to justice have outweighed progress in education, employment and political engagement, according to the statutory three-yearly report to parliament, assessing fairness in the UK, by the Equality and Human Rights Commission (EHRC).It predicts that without remedial action Britain is destined to become a “two-speed society” with its most at-risk groups trapped in disadvantage. However, it points out that educational attainment has improved across most groups, that the proportion of people holding degree-level qualifications has increased, that unemployment fell and the gender pay gap narrowed.It comes ahead of Monday’s budget which campaigners for the worst-off groups hope will deliver some relief to the squeeze they have felt from austerity.Disabled people are more likely to be in poverty, face poorer health and a lack of access to suitable housing, the report found. There has also been a sharp increase in recorded disability hate crimes, and the likelihood of disabled people being in low-pay occupations has increased.It is a “disturbing assessment”, according to Genevieve Edwards, director of external affairs at the Multiple Sclerosis Society.“Cuts to disability benefits and social care are pushing disabled people further into poverty,” she said, adding that over 100,000 people live with MS in the UK and it can cost them an extra £200 a week to manage their condition. Across the UK nearly 14 million people are disabled.The number of people not in employment, education or training continued to fall but there remains a gulf in attainment depending on wealth. 40% of pupils who were eligible for free school meals achieved 9–4 grades in English and maths GCSEs in 2016/17, compared to 67% of non-eligible pupils.A child living in one of England’s most disadvantaged areas is around six times more likely to go to a school rated as “inadequate” by Ofsted than a child in the least deprived. Exclusions are on the rise and bullying remains endemic with half of pupils suffering from it at some point.Gender bias remains strong among primary schoolchildren, with seven- to 11-year-old boys 20 times more likely than girls to aspire to be an engineer or architect. But more women are taking degrees than men and women get higher marks. The proportion of poor students is increasing too. White people are less likely to have a degree than people from ethnic minorities.Infant mortality is significantly higher in the most deprived areas (5.9 per 1,000 births as opposed to 3.8 on average). Black African and Pakistani families are most likely to experience the loss of an infant, with higher rates of obesity and diabetes contributing to the risk. David Isaac, chairman of the EHRC, said there had been “significant areas of progress, particularly in the improvement of opportunities in education and at work, as well as the fact that more people are now engaging in politics”.But he added: “Across many areas in life, [people] struggle to make headway in a society where significant barriers still remain. They are the forgotten and the left behind and, unless we take action, it will be at least a generation before we put things right.”A government spokesperson said the “burning injustices” would be tackled and that the UK has some of the strongest equalities legislation in the world.“We have introduced groundbreaking gender pay gap regulations, the race disparity audit which shines a light on how people of different ethnicities are treated across public services, the introduction of shared parental leave and £100m in funding committed between now and 2020 to strengthen support for victims.” They added that total welfare spending was rising for disabled people and a million people had been lifted out of absolute poverty."}