{"id": "\nFootball League: Leeds continue to slip, Macclesfield avoid unwanted history\nTammy Abraham’s goal gives Aston Villa’s Dean Smith the perfect start", "paragraph": "\nJohn Brewin\n\nSat 20 Oct 2018 19.41 BST\n\nLeeds’ recent slide continued with a 2-1 defeat to Blackburn in the lunchtime kick-off. Danny Graham opened the scoring against his former club before Mateusz Klich equalised on the stroke of half-time. Darragh Lenihan’s 70th-minute header won it for Rovers. Leeds have won just two of their last eight matches, and are back in fourth in the table after starting promisingly under Marcelo Bielsa. Derby climbed up into fifth place as second-placed Sheffield United missed the chance to go top following Jack Marriott’s winner in a 2-1 victory for Frank Lampard’s team. Chris Basham’s close-range finish on the stroke of half-time had levelled Craig Bryson’s goal for Derby, scored after just 19 seconds. Marriott’s flicked header took the three points.West Brom missed their own chance to lead when losing 1-0 at Wigan, for whom Josh Windass scored. The Baggies’ unbeaten run of seven matches in a row concluded amid Jake Livermore’s 84th minute dismissal for a second yellow card. Pressure resumes on the Stoke manager Gary Rowett, who was sent to the stands during a 1-0 home defeat to Birmingham that left his team in 17th place. Che Adams scored in the 81st minute to extend Blues’ unbeaten run to nine matches. The Norwich defender Timm Klose scored twice in a deserved comeback win against Nottingham Forest, who had opened the scoring through Lewis Grabban against his former club. Klose’s first goal was a header, the second a poacher’s finish that ended a Forest unbeaten run stretching back to 1 September. Thomas Frank’s first match since stepping into the role of Brentford boss ended in a 1-0 home loss to Bristol City. Niclas Eliasson scored a late volley for the visitors, down to 10 men after Chris Mepham had been dismissed for two bookable offences, one of them a foul on Eliasson. Hull stayed in the relegation zone after Preston’s Louis Moult equalised in the third minute of time added on. An 85th-minute penalty from Jarrod Bowen had seemed likely to hand Hull victory. Ipswich stayed rock bottom after a 2-0 home defeat to QPR, who took the lead through an own goal from Town goalkeeper Dean Gerken. Tomer Hemed slotted in from the penalty spot in first-half injury time. Millwall dropped into the bottom three after a 3-1 defeat at Reading, for whom Yakou Méïté scored twice, either side of a Sam Baldock penalty. Murray Wallace scored Millwall’s goal. Rotherham were denied a first win in six matches when Christopher Doidge notched a late equaliser for Bolton. A Will Vaulks free-kick had put Rotherham ahead, and Marek Rodak had saved a Josh Magennis penalty.Blackburn 2-1 Leeds, Aston Villa 1-0 Swansea, Brentford 0-1 Bristol City, Hull 1-1 Preston North End, Ipswich 0-2 QPR, Nottm Forest 1-2 Norwich, Reading 3-1 Millwall, Rotherham 1-1 Bolton, Stoke 0-1 Birmingham, Wigan 1-0 West Brom, Derby L-L Sheff UtdAccrington’s superlative season in the third tier continued with a 1-0 win at Peterborough. Having taken the lead through Sean McConville in the 11th minute, they clung on against second-placed Posh and jumped up to fourth with a fifth win in six. That allowed Portsmouth to extend their lead at the top of the table to six points after a hard-fought 1-0 defeat of Fleetwood, who had Nathan Sheron sent off in the late stages. Oliver Hawkins scored the winning goal for Pompey. Sunderland climbed to within a point of Peterborough in second with a 2-0 win at Shrewsbury after an own goal from Omar Beckles and a late strike from Luke O’Nien. Kyle McFadzean scored an 84th-minute winner, his second strike, for Burton in a 3-2 win at Plymouth, for whom Freddie Ladapo had scored twice. Plymouth stayed bottom.Blackpool 2-0 Wimbledon, Bradford City 0-2 Rochdale, Bristol Rovers 0-0 Oxford Utd, Charlton 2-0 Barnsley, Doncaster 3-3 Gillingham, Luton 2-0 Walsall, Peterborough 0-1 Accrington, Plymouth 2-3 Burton Albion, Portsmouth 1 Fleetwood 0, Shrewsbury 0-2 Sunderland, Southend 1-2 Coventry, Wycombe 3-2 Scunthorpe Macclesfield avoided the ignominy of a record-breaking 37 matches without a Football League win by staging late comeback against Carlisle. A Matthew Rose penalty in the 79th minute and Peter Vincenti’s strike four minutes later wiped out Ashley Nadesan’s disputed opener. Macc’s run of 36, spread over two spells in the league, is shared with Derby’s winless run of 2007 and 2008. That put Macclesfield within two points of second-bottom Cambridge, who drew 1-1 at leaders Lincoln, a man down after Ellis Chapman was sent off in the 21st minute. Exeter were unable to capitalise on Lincoln’s slip after drawing 0-0 at Grimsby, but MK Dons moved into third with a 1-0 defeat of Northampton.Bury 4-0 Notts County 0, Crawley 4-1 Newport, Forest Green 1-1 Cheltenham, Grimsby 0-0 Exeter, Lincoln 1-1 Cambridge 1, MK Dons 1-0 Northampton, Macclesfield 2-1 Carlisle 1, Morecambe 0-1 Colchester, Oldham 0-1 Port Vale, Stevenage 0-1 Crewe, Swindon 0-0 Mansfield, Yeovil 0-0 Tranmere"}