{"id": "\nFraser and Hesketh send Burton past Nottingham Forest and into last eight\nSteve Cook drives Bournemouth past Norwich into quarter-finals", "paragraph": "\nPaul Doyle\n\nTue 30 Oct 2018 21.47 GMT\n\n\nLast modified on Wed 31 Oct 2018 00.31 GMT\n\nNigel Clough has brewed up another heady upset, guiding Burton to the Carabao Cup quarter-finals at the expense of the club he and his father helped to worldwide fame. It was no fluke. This was a deserved triumph for Burton, secured thanks to a bold and accomplished performance and three second-half goals.“To get into the last 16 was a hell of an achievement but to reach the last eight as League One club – never mind as a very small League One club – is wonderful,” Clough said. “We’ve had our breaks in this competition but we’ve earned them.”Never before have Burton reached this stage of the competition, whereas Forest have lifted the trophy four times, all under the management of Brian Clough and two of them with Nigel in the team.Aitor Karanka may have made 10 changes to the Forest side who started Saturday’s game in the Championship, where they lie just outside the play-off places, but he had applied a similar policy earlier in the tournament so was entitled to be confident his team would prove too good for a side dwelling in the bottom half of League One. Then again, Aston Villa and Burnley had thought the same thing before being toppled at Burton in previous rounds.Clough made four changes to the team who lost at home to Peterborough on Saturday, one of the newcomers being a somewhat less celebrated former Forest player – the goalkeeper Dimitar Evtimov, who signed on a short-term deal last month after making two starts for Forest in six years. The visiting keeper, Luke Steele, was far busier throughout the tie and must have been relieved even to reach the interval with a clean sheet.Liam Boyce, a very useful targetman, forced a decent save from Steele in the 19th minute. The keeper had to outdo that on the half-hour to make up for his failure to hold a swerving shot from Boyce, spreading himself superbly to block David Templeton’s follow-up. But two minutes later Steele should have been soundly beaten as Burton were awarded a penalty when Liam Bridcutt upended Jamie Allen. The rashness of Bridcutt’s challenge reflected how flustered Forest were by Burton’s pressing. The visitors were given a surprising reprieve, however, when Boyce wafted the spotkick over the bar.Rather than wilt after that miss, Burton took heart from their ability to pester Forest into errors. “The manager told us at half-time just to go out and play the same way again,” Boyce said. Karanka, by contrast, demanded improvement from his team during the interval but made no personnel changes. He should have, even though Gil Dias nearly scored soon after the restart, waltzing past three defenders before seeing his shot saved by Evtimov, who also blocked the rebound from Hillal Soudai. That was contrary to the course of play, and Burton promptly switched back to the front foot and scored within seven minutes.Boyce was integral to the breakthrough, driving at the defence before feeding Fraser, whose shot from 20 yards deflected off Saidy Janko and looped into the net.For the second goal Burton dispossessed Forest near halfway and went for the jugular, Boyce forcing the ball through to Fraser, who finished neatly from 12 yards. An equally fine finish by a Forest substitute, Lewis Grabban, six minutes later, set the scene for a dramatic finale.Burton prevailed in style, however, Fraser teeing up Hesketh for a smashing volleyed finish from eight yards in the 82nd minute. Arvin Appiah, an exciting 17-year-old, was also sprung from the Forest bench and he soon scored from close range but that was not enough to deny Clough’s team."}