{"id": "\n'Pure joy': refugees fleeing conflict delighted by first snow in Canada\nWhat is Canada like for a refugee?Syrian refugees in Canada's north: 'It’s not warm in weather, but warm in emotions '", "paragraph": "Justin Trudeau, in stark contrast to Donald Trump, has publicly welcomed families fleeing conflict and supported by sponsors\nLeyland Cecco in Toronto\n\nMon 12 Nov 2018 22.19 GMT\n\n\nLast modified on Tue 13 Nov 2018 15.48 GMT\n\nClad in oversized coats, the two children twirl, giggle and whoop with joy as they experience a life milestone: their first snowfall.The brother and sister, who recently arrived in Toronto as refugees, had never before experienced an event most Canadians accept as an everyday part of life.A video capturing their delighted reaction was tweeted on Sunday by a Toronto resident Rebecca Davies, who is hosting the two Eritrean children and their family until they find permanent housing.Canada is one of the few countries in the world in which residents can pool money and resources together to help resettle and support refugees. Between 2015 and 2016, Canada resettled more than 25,000 refugees, many of them through private sponsorship programs.The prime minister, Justin Trudeau, has publicly welcomed families fleeing conflict – even helping to hand out winter jackets at the airport – in stark contrast to Donald Trump’s hostile attitude to refugees.On Monday, Trudeau retweeted Davies’ footage, with the comment: “Amazing – now convince them that shoveling is fun and you’re all set. Thank you for everything you do, Rebecca. #WelcomeToCanada.”Davies is a member of a group called Ripple Refugee Project, which has raised tens of thousands of dollars to help sponsor and resettle four refugee families from Syria and Eritrea in Toronto. “We were really touched by the video. We’re very moved,” said group member Andrew FitzGerald. “There seemed to be moments of pure joy coming from them.”For FitzGerald, the children’s reaction to the snow cemented for him the importance of sponsoring families. “If people spent time with these families, they quickly realize these are very good people who are in difficult circumstances and need a hand.”One Twitter user commented: “I hate snow. This makes me want to rethink my stance.”Davies replied: “I’m hoping it also makes others ‘rethink their stance’ on the topic of newcomers and immigration.”"}