{"id": "\nBBC still failing women over equal pay, report finds\n", "paragraph": "MPs demand end to ‘invidious’ culture as evidence shows failure to admit to problem\nMark Sweney\n\nThu 25 Oct 2018 00.01 BST\n\n\nLast modified on Thu 25 Oct 2018 09.23 BST\n\nThe BBC is still refusing to admit it has an equal pay issue despite female staff continuing to be paid substantially less than their male counterparts and not being given equal opportunities, according to the findings of an influential committee of MPs.The report into pay at the broadcaster, published by the digital, culture, media and sport select committee on Thursday, demanded an end to a culture of “invidious, opaque decision-making” on pay.Evidence from dozens of witnesses, including 40 BBC staff and the BBC Women campaign group, which represents more than 170 presenters and producers, including household names such as Mishal Husain and Jane Garvey, showed the corporation was still failing to admit it had a problem with equal pay, the report said.“Our evidence suggests women within the BBC are working in comparable jobs to men but earning far less,” it said. “The corporation was unable to give us a good reason for why or how pay discrimination has been left unchallenged for so long.”Many female BBC employees told the committee anonymously that they had been offered pay rises in response to equal pay complaints, while simultaneously being told there were no equal pay issues in their case. The BBC Women group said the handling of complaints had left some women “feeling worthless or diminished, ground down by an employer refusing to admit any equal pay liability even where it accepts there are unexplained and unjustified differences between men and women”.The report said: “Where staff come forward with complaints, management must refrain from using unhelpful terminology and talk about these cases in terms of ‘equal pay’, rather than using euphemisms such as ‘fair pay’, ‘oversights’ and pay ‘revisions’, in an attempt to avoid the issues at hand.”The committee highlighted “serious shortcomings” in its pay reform procedures, including a grievance process that can take more than a year to conclude, and an almost random approach to granting pay rises for some positions.“The grievance process – both formal and informal – at the BBC leaves much to be desired,” the report found. “The BBC pay structure lacks central oversight and allows for too much managerial discretion over salaries. Pay decisions for senior positions appear to be made on an ad hoc basis.”The report also criticised the “shocking” imbalance in the corporation’s list of top earners, which is led by Gary Lineker and Chris Evans. It has no women in the top 10 and only two in the top 20, Claudia Winkleman and Vanessa Feltz. “It is regrettable that it took the forced publication of this list and the resultant publicity to push the BBC into action on a longstanding problem,” the report said. “The BBC’s reluctance to tackle this issue has resulted in a loss of trust between staff and management. The BBC needs to commit to concrete targets to ensure that the pay of its high earners has absolutely no discriminatory element to it.”The report said the corporation needed to close a “loophole” whereby people employed by BBC Studios, its commercial arm, or paid through independent TV production companies are not currently covered by transparency rules forcing their salaries to be made public.As a result, the list still does not include big names such as Benedict Cumberbatch, David Dimbleby, Ian Hislop, David Attenborough or Alan Sugar.The report recommended that “to restore its credibility” the BBC should publish the salaries of BBC Studios staff and high-earning presenters on shows made for the broadcaster by independent companies in its 2018-19 annual report.It also recommended that the BBC offer compensation for financial loss to staff who were advised to set up personal service companies, instead of being employed directly, who had now found themselves at odds with tax rules and owing significant sums to HMRC.“As a direct result of the BBC’s policy … many [presenters] are now facing bills of hundreds of thousands of pounds in unpaid income tax,” said Damian Collins, the chair of the committee. “Where there is evidence that people were coerced into setting up these companies … the BBC should offer compensation to cover their losses.”The select committee launched its investigation following the allegations made by the former BBC China editor Carrie Gracie, who resigned in January accusing her employer of operating a “secretive and illegal” pay culture that discriminated against women.“The BBC acts as a beacon in public life,” Collins said. “As an employer it has an even higher level of duty than others to advance equality of opportunity – but this it has failed to do. The BBC must take urgent action now if it is to restore its reputation on equal pay and win back the trust of staff.”A BBC spokesman said: “While we still have more to do, much of this report is already out of date. Recent disclosures by other media organisations show that the BBC’s gender pay gap is amongst the smallest and well below the national average. But we do hold ourselves to a higher standard.“That is why our action on pay has seen the BBC make real progress in addressing equal pay cases; carry out an independent audit of equal pay overseen by a former court of appeal judge; introduce independent oversight so that that disputes can be resolved; take clear steps to rebalance top talent pay; reform our pay structure to ensure fairness and give an unprecedented level of transparency and information about pay ranges for all staff; and set up independent reviews to see what further steps should be taken on pay transparency.“That’s why so many colleagues have contributed to projects we’re doing – on gender, ethnicity, disability, LGBT and socio-economic diversity. We all want to make this a great place to work, where people are properly rewarded for their expertise and experience.”"}