{"id": "\nFFA chair election offers hope of imperfect compromise\nFootball Federation Australia AGM gears up for post-Lowy future", "paragraph": "AAFC’s forum laid bare an uncomfortable fact for all to see: there is no perfect candidate in this election\nRichard Parkin\n\nMon 12 Nov 2018 23.32 GMT\n\n\nLast modified on Tue 13 Nov 2018 05.33 GMT\n\n“This is not a game, it’s a mission.” Like a heat-seeking missile, Craig Foster’s entrance into Monday night’s community forum was as direct, as fervent and as unapologetic as the man himself. Cutting through the usual waffle of words about “consultative leadership” and the “headwinds” that were buffeting the game, the outspoken former Socceroo didn’t mince words – “it’s time to stop outsourcing our governance”, and it’s time to “build business around football, not the other way round”.On a night in which seven of the 11 would-be directors of the first post-Lowy Football Federation Australia board outlined their credentials (with statements from a further two unable to attend in person) it’s hard not to conclude that Foster, a man who almost radiates with his fervour for football, was the headline success.And yet of the 29 voters who will determine the four new board members and chair of FFA v2.0, only two were in attendance in the audience.In fact, up until last night the chances of Foster’s election – to the board, let alone as chair – appeared minimal. Behind the scenes, for the movers and shakers of the game – the various power groups that have agitated throughout a near-crippling three year battle over the governance of Australian footbal – Foster is a zealot, a man made inflexible through principle, a renegade.The member federations have their candidates. The A-League clubs have their candidates. Neither of these groups that hold 79% of the votes nominated or seconded Foster’s candidature – he is backed by the Professional Footballers’ Association and the newly formed Women’s Council.But the reportedly pre-determined consensus candidate – the respected Congress Review Working Group helmsperson who was meant to steer the various interest groups through the razor rocks of renewed civil war, Judith Griggs, has withdrawn.So who next?Facing any board of directors, be it in sports administration, public affairs or business, is a central thorny conundrum: how best to reconcile the responsibilities of public (or shareholder) representation, while also observing fiduciary obligation.Already, this increasingly public campaign has highlighted this core tension. In seeking to woo corporate Australia, the previous FFA board functioned as a business – decisions were made behind closed doors and transparency and consultation were jettisoned in the name of commercial in-confidence.The very group that hosted Monday’s community forum, the Association of Australian Football Clubs – an umbrella organisation founded in 2017 representing the base of the football pyramid outside the professional game – should never have needed to exist, if the previous administration hadn’t kept such a tight stranglehold on the reins of the game.And yet it was AAFC’s forum that has laid bare an uncomfortable fact for all to see: there is no perfect candidate in this election.With former Soccer Australia chairman Remo Nogarotto confirming last night he will not run for chair, it’s a field that’s been reduced to four.Mark Rendell, a sports administrator and former Football Federation Victoria CEO, appears a long-shot candidate – nominated by member state federations that opposed the CRWG reforms, he’s unlikely to find backing from the pro-reform federations or the clubs.Chris Nikou, a former FFV director and 2015 Asian Cup organiser, is a well-connected and experienced football administrator, but carries with him the taint of having served on the Stephen Lowy FFA board – a not insignificant stigma given the wider footballing public’s increasing expectation of change.So too, with his accounting background, cautious measured tone and lingering question marks over his pedigree as a “football person”, Joseph Carrozzi faces a difficult task in winning a PR-offensive that FFA has listened, learned and changed from the errors of the past, when it looks and sounds eerily similar.And then there’s Foster.If this was a US-style presidential election then phase one for the Obama from Lismore – convincing the public with an optimistic vision for change – has succeeded. But can he complete phase two – the transmutation into the conciliatory and inclusive statesman who unites the tribes – given his lengthy and very public history of railing against many of them? He’s got less than a week.Then there are the various machinations of who will come to constitute the new board. The political connections of Stephen Conroy make him a near-lock, as does Linda Norquay’s powerful business connections and the constitutional ambition for increased gender representation at board level.The election of Nogarotto would represent a significant olive branch to large sectors of the football community who have been shut out of the conversation during the FFA-era, so too veteran agitator-turned-administrator, Heather Reid. But does the former still carry too much taint from his days at Soccer Australia? More seasoned political operatives than Foster, do the two threaten to eat into the prominent commentator’s popular base, or do they represent less volatile alternatives to cautious factional interests?And despite the popular appetite for change, do figures like Danny Moulis or Nikou offer a continuity from the previous board, and the necessary ambergris to continue lubricating the chequebooks of corporate Australia?For those that railed against the closed-shop of the Lowy era, there’s the faintest whiff of transparency and opening creeping into this election process. But in laying bare the workings, you loosen control over the final outcome.Worst case scenario, the enduring tensions of the past few years will remain: the football public won’t accept business as usual, and business won’t accept the football public. But at its best, the new board could represent a beautiful ugliness. A complex jigsaw – a mix of business, passion and politics that brings marginalised sectors of the game back inside the tent.A messy, at-times fractious, new governing body attempting to harness and reconcile competing interests and self-interests. But then sometimes that what democracy looks like."}