{"id": "\nPittsburgh shooting: thousands march to remember victims and denounce Trump's visit\n", "paragraph": "Organizers accuse the president of emboldening ‘a growing white nationalist movement’ with hateful speechCarmen Gentile in Pittsburgh\n\nTue 30 Oct 2018 23.00 GMT\n\n\nLast modified on Tue 6 Nov 2018 23.07 GMT\n\nThousand have gathered in Squirrel Hill to remember those killed at a neighborhood synagogue and to oppose Donald Trump’s visit to Pittsburgh. Expressing their anger and sorrow, many blamed the president for the attack.Young and old from all walks of life marched on Tuesday to remember the 11 Jewish people who died in the Saturday morning shooting. A suspect appeared in court on Monday.Nearby, Trump reportedly met Jewish leaders – much to the consternation of those on hand to march. Over loudspeakers, organizers accused the president of emboldening “a growing white nationalist movement” with hateful speech towards Jews and other minorities including African Americans, the LGBTQ community and immigrants.Participants carried signs denouncing Trump and asserting the resilience of the community. Organizers led those on hand in songs sung in Hebrew and taken from Bible verse, translating in part: “ I will build this world from love …”Organizers asked participants to not speak to the sizeable throng of reporters on hand. One marcher, a physician at a children’s hospital, declined to give his name but in somber tones recalled his initial reaction to news of the killings.“As soon as I hear what happened, I cried,” he said, as he marched. Asked if such an attack would at least lead to a decrease in hateful rhetoric that has spiked in recent years, he said: “I don’t know, but I certainly hope so.”Not all demonstrators were reluctant to speak. Antoniette Hartsfeld, a 22-year-old dance major at a local university, said she had been immediately fearful for friends from Squirrel Hill.“I was terrified for friends living here,” said Hartsfeld. “Unfortunately, I wasn’t shocked.”A classmate, Cassidy McDermott Smith, was not so accustomed to mass killings: she hails from Australia, which banned assault weapons after the Port Arthur massacre of 1996.“It doesn’t make a lot of sense to me, nor should it to anyone,” she said.Trump ignored vocal appeals for him to stay away, from sources including city officials. Pittsburgh’s mayor, Bill Peduto, said Trump should postpone his visit at least until families of the dead could bury their loved ones. The first funerals for the 11 victims, among them a 97-year-old woman, were held on Tuesday. Several lawmakers from Washington were invited to join the president in Pittsburgh, and declined. Among them was Pennsylvania’s Republican senator, Pat Toomey, and other prominent lawmakers from the president’s own party. The state’s other senator, the Democrat Bob Casey, was not invited by the White House.Earlier this week, numerous members of the Jewish community in Pittsburgh voiced their opposition to Trump’s visit.“For the past three years your words and your policies have emboldened a growing white nationalist movement,” read a letter by local members of Bend the Arc, a national Jewish organization.“You yourself called the murderer evil, but yesterday’s violence is the direct culmination of your influence.”"}