{"id": "\nIndian couple fell to deaths from Yosemite cliff while taking selfie, brother says\nYosemite rangers recover bodies of pair who fell 800ft from popular overlook", "paragraph": "Vishnu Viswanath and Meenakshi Moorthy of India apparently set up their camera near popular overlook with no railingAssociated Press\n\nTue 30 Oct 2018 21.38 GMT\n\n\nLast modified on Wed 31 Oct 2018 13.50 GMT\n\nAn Indian husband and wife who fell to their deaths from a popular overlook at Yosemite national park in California were apparently taking a selfie, the man’s brother said on Tuesday.Park rangers recovered the bodies of Vishnu Viswanath, 29, and Meenakshi Moorthy, 30, on Thursday about 800ft (245 meters) below Taft Point, where visitors can walk to the edge of a vertigo-inducing granite ledge that doesn’t have a railing.Viswanath – who Cisco India said was a software engineer at the company’s headquarters in San Jose, California – and Moorthy had set up their tripod near the ledge on Tuesday evening, Viswanath’s brother, Jishnu Viswanath, told the Associated Press.Park visitors the next morning saw the camera and alerted rangers, who “used high-powered binoculars to find them and used helicopters to airlift the bodies”, he said.In an eerie coincidence, a man who had hiked to the same spot with his girlfriend captured pictures of Moorthy before her fall, saying she accidentally appeared in the background of two of their selfie photos.Sean Matteson said Moorthy stood out from the crowd enjoying the sunset atop Taft Point last week because her hair was dyed bright pink and that she made him a little nervous because he felt she was standing too close to the edge.“She was very close to the edge, but it looked like she was enjoying herself,” said Matteson, who lives in Oakland, California. “She gave me the willies. There aren’t any railings. I was not about to get that close to the edge. But she seemed comfortable. She didn’t seem like she was in distress or anything.”Matteson said his girlfriend, Drea Rose Laguillo, noticed that Moorthy had been captured in their images on Monday after pictures of the two victims were published.Matteson said he doesn’t recall noticing Viswanath when he and his girlfriend were at the overlook with less than a dozen other tourists. The couple left the overlook as darkness was approaching, Matteson said.The Indian couple’s funeral will take place in the US because the bodies were not in a condition to be flown back to India, Jishnu Viswanath said.The couple was “travel-obsessed”, Moorthy wrote on a blog called Holidays and HappilyEverAfters filled with photos of them in front of snowy peaks, the Eiffel Tower and tulip fields. Moorthy had wanted to work full time as a travel blogger, Viswanath said.“A lot of us including yours truly is a fan of daredevilry attempts of standing at the edge of cliffs and skyscrapers, but did you know that wind gusts can be FATAL???” Moorthy wrote on an Instagram post with a photo of her sitting on the edge of the Grand Canyon. “Is our life just worth one photo?”The couple graduated in 2010 from the College of Engineering, Chengannur, in the Alapuzha district of Kerala state, one of their professors, Dr Nisha Kuruvilla, told the AP.She said Moorthy and Viswanath were both good students who were fond of traveling and had married at a Hindu temple in Kerala in southern India four years ago.A Yosemite spokeswoman, Jamie Richards, said in a statement that park officials were investigating the deaths and that the investigation could take several days.In India, after a rash of selfie-related deaths, the tourism ministry in April asked state government officials to safeguard tourists by installing signs in areas where accidents had occurred declaring them “no-selfie zones”.﻿"}