{"id": "\nRoger Federer in line of fire over scheduling and Davis Cup claims\nRoger Federer slumps to straight-sets loss against Kei Nishikori at ATP FinalsNovak Djokovic beats John Isner at ATP Finals 2018 – as it happened", "paragraph": "• Veteran Julien Benneteau makes accusations against Swiss• Wins for Djokovic and Zverev at ATP World Tour finals\nKevin Mitchell\n\nMon 12 Nov 2018 22.19 GMT\n\n\nLast modified on Tue 13 Nov 2018 08.06 GMT\n\nRoger Federer, reaching for the 100th tournament win of his 20-year career in London this week, found himself at the centre of an awkward controversy on Monday over claims he has long benefited from preferential scheduling, and that he is undermining the integrity of the Davis Cup.Julien Benneteau, who came out of retirement this year to help France to reach the Davis Cup final, says Federer has put his financial involvement in the rival Laver Cup above the future of the oldest team event in international sport. The outspoken Benneteau told a French radio station: “With all that Federer is, OK. But it’s an exhibition, his thing [promoted by his company, Team8]. The Laver Cup has no sporting legitimacy. There are no sporting criteria with the selections. There are no ATP points. It’s just financial. Because he gives Nick Kyrgios $750,000 to come and play matches that don’t count, the guys say: ‘OK, those are the rates for the Laver Cup.’”The conflict has divided players, with many of the biggest names – several of whom are contesting the end-of-season ATP World Tour Finals at the O2 Arena – criticising the ITF’s plans to move the Davis Cup final to November next year, and in a new World Cup-style format over two weeks. But there is a feeling abroad that this is a rush to judgment, driven by self interest.Alexander Zverev has been among the most vocal opponents of the change. The third seed said after beating Marin Cilic 7-6 (5), 7-6 (1) in their first-round match on Monday: “I’m not going to play Davis Cup in November [2019]. I am going to play [qualifying] in February in Frankfurt, I’m going to do that. But the Davis Cup has some serious issues to think about.“One of them is the dates. I think the dates [are] very important and I think none of the top players will play, except Rafa [Nadal], because it’s in Spain. I’m very sure that a lot of top players will not play.”As for the perception that Federer gets to play when he wants to at big tournaments – invariably at night on the main court – Benneteau cites the Australian Open this year.“Over the last two Australian Opens, he played 14 matches, because he was champion and finalist,” Benneteau said. “And he played 12 or 13 of them in the night session. On the same day Federer played Jan-Lennard Struff, Novak Djokovic played Gaël Monfils. Any tournament director would put Djokovic-Monfils on the night session at 7:30pm, right? But no. They played at 2:30pm, in 104 degrees. And Federer-Struff played at night.”Cilic lost to Federer in that final, which moved under the roof on Rod Laver Court, and said here after losing to Zverev: “Roger is very popular. Night matches are always something the tournament wants him to play. I was just not happy at the end of the tournament in Australia because they changed the rules.”He added: “They were following one way of the rules during the tournament and they had different rules for the finals with closing the roof. I don’t think they were going one way or the other, for me or for Roger. I felt that they needed to be consistent.”Benneteau sees it differently. “It’s normal that he gets preferential treatment, with everything he’s done,” he told RMC Sport. “But, in some tournaments, there are big differences in the conditions. He has no idea what that’s like.”Certainly, Federer – who was unusually nervous losing in straight sets to Kei Nishikori on Sunday night – complained about having to hit on different surfaces this week, from Queen’s to the centre court at the O2, but he chose not to practise at all on Monday in preparation for his match on Tuesday night against the other first-round loser, Dominic Thiem. This raised concerns that a hand injury he has been nursing since the start of the grass season might still be troubling him.On Monday evening Djokovic, reinstalled as the world No 1, confirmed his favouritism for a sixth title when he took just 73 minutes to beat the 33-year-old American Finals debutant, John Isner, 6-4, 6-3. From start to finish, he cruised, soaking up 13 aces and winning three of nine break points."}