{"id": "\nAaron Finch bemoans 'horrific' Australia collapse in T20 defeat to Pakistan\nAustralia play part in cricket history even as UAE's World Cup dream fades | Geoff Lemon", "paragraph": "Australian Associated Press\n\nWed 24 Oct 2018 23.58 BST\n\nAustralian skipper Aaron Finch says he deserves plenty of blame for a woeful T20 loss to Pakistan that he likened to a slow-motion car crash. Set a gettable target of 156 in Abu Dhabi, the tourists lost six wickets in what Finch described as a “horrific” powerplay on the way to being skittled for 89.Each of Australia’s top four batsmen were bowled and Chris Lynn (14) was the only member of the top six to reach double digits in a 66-run defeat in which Australia posted their equal third-lowest total in a T20 international.Finch started the rot when he was clean-bowled by left-arm spinner Imad Wasim for a third-ball duck while leaning back into an attempted cut shot.“Opening the batting, it’s my responsibility to get us off to a good start and set up the chase there,” Finch said. “I take full responsibility for that. I think any time that you’re chasing a total like that it’s important you have a solid start and for me to get out in the first over and not give us that was not good enough. That powerplay was horrific ... it was like a car crash in slow motion.”Man of the match Imad also accounted for D’Arcy Short and Alex Carey, finishing with 3-20 in his first national outing in almost a year. Only a rearguard action led by tailender Nathan Coulter-Nile (34) saved Australia from what had threatened to be a record T20 loss.Test squad members Mitch Marsh, Nathan Lyon and Peter Siddle were all overlooked for the series-opener, along with Mitchell Starc who is nursing a tight hamstring and almost certain to miss the remainder of the series.Finch said changes had to be considered for Friday’s second T20 in Dubai, which will also host the third and final game on Sunday. However, Marsh may well be the only inclusion given Australia’s bowlers held up their end of the bargain in restricting Pakistan to 155-8.Ashton Agar went wicketless from two expensive overs and could be vulnerable should offspinner Lyon come into the frame for just his second T20 international.“Absolutely they’ll be looking at changes,” Finch said. “I think all in all, our bowling performance was pretty good. Our fielding was slightly sloppy, then the batting was awful. Definitely when that happens, when you lose a game so badly, you have to look at everything.”"}