{"id": "\nNFL wrap: Mahomes' offensive storm continues while Saints beat Rams\n", "paragraph": "Associated Press\n\nSun 4 Nov 2018 21.40 GMT\n\n\nLast modified on Mon 5 Nov 2018 01.05 GMT\n\nPatrick Mahomes passed for 375 yards, threw three touchdown passes two to Travis Kelce and continued the best start by an NFL quarterback in 68 years as Kansas City’s impossible-to-handle offense kept rolling with a 37-21 win on Sunday over the Cleveland Browns, who played their first game since coach Hue Jackson’s firing.Kareem Hunt had two scoring runs and one receiving for the Chiefs (8-1), who came in averaging 36.3 points per game with an offense overloaded with weapons for Mahomes. The 23-year-old used all of them in winning his first pro matchup against Baker Mayfield and the Browns (2-6-1).Mahomes and Mayfield didn’t match their epic college meeting in 2016, when they combined for more than 1,700 yards in offense. But the Chiefs put on another impressive offensive show with 499 total yards, averaging 8.6 per snap.In his second season, Mahomes, who made just one start as a rookie, already has 29 TD passes and 3,185 yards, the most by any QB through 10 games since 1950. He has passed for at least 300 yards in eight straight games.In the day’s later kick-offs, the Saints inflicted the Rams’ first loss of the season in a high-scoring shoot-out. The Rams were 35-17 down at half-time and staged a rally of sorts but still went down 45-35 to an offense led by the ageless Drew Brees, who threw for four touchdowns. Houston and the Los Angeles Chargers beat the Broncos and Seahawks respectively.Ben Roethlisberger threw two touchdown passes, ran for a score and put up an unexpected left-footed punt to help the Pittsburgh Steelers beat the Baltimore Ravens 23-16.James Conner rushed for 107 yards and caught a TD pass for the Steelers (5-2-1), who have won four straight since falling to the Ravens at home at the end of September.Roethlisberger went 28 for 47 for 270 yards. His one-yard run put Pittsburgh up 20-6 in the third quarter. The Ravens (4-5) scored only one touchdown in their third straight defeat. Joe Flacco was limited to 209 yards passing and sacked twice.Roethlisberger also contributed on special teams. With the Steelers facing a fourth down from the Baltimore 38, Roethlisberger lined up in shotgun formation and popped up a 27-yard punt, his seventh career kick.Danielle Hunter had 3.5 of Minnesota’s franchise-record 10 sacks and a fourth-quarter fumble return for a touchdown, making for a miserable afternoon for Matthew Stafford and the Detroit Lions in a 24-9 victory by the Vikings.Hunter, the fourth-year defensive end, also was credited with nine tackles and four quarterback hits as the Vikings (5-3-1) limited the Lions to 214 total yards. After Dalvin Cook dropped a pitch from Kirk Cousins and A’Shawn Robinson recovered at the Detroit 28 with Minnesota leading 17-6, the Lions had a chance to catch up. They converted a fake punt to keep the drive alive.Two plays later, Stafford ran right on the short side of the field and tried a dangerous flip to Kerryon Johnson. The ball fluttered to the turf, and Hunter scooped it up on his way to the easy score.Jordan Howard scored two touchdowns and the Chicago Bears’ defense had two others in a 41-9 win over the Bills in what proved to be another comedy of errors for Buffalo and their anemic offense.Eddie Jackson scored on a 65-yard fumble return and Leonard Floyd returned a tipped pass 19 yards in the second quarter. Howard, set up by Tarik Cohen’s 38-yard punt return, then scored on an 18-yard scamper to cap a run in which the Bears scored four touchdowns over a span of 12 minutes, 20 seconds in the second quarter.The Bears won their second in a row and improved to 5-3 to match their best start to a season through eight games since 2013. Chicago also matched their win total from last year.Cam Newton completed 19 of 25 passes for 247 yards and two touchdowns, Christian McCaffrey racked up 157 yards from scrimmage and scored twice and the Carolina Panthers built an early lead and held on to beat the Tampa Bay Buccaneers 42-28 for their 10th straight home win.Newton threw TD passes of 19 yards to Curtis Samuel and 17 yards to Greg Olsen, the seventh straight game he has thrown for at least two touchdowns. McCaffrey had 17 carries for 79 yards and five catches for 78 yards and turned in the play of the game when he leaped over a defender after a reception in the flat and kept going, turning it into a 32-yard gain.The Panthers (6-2) scored touchdowns on five straight possessions during the first half to build a commanding 35-7 lead before the Buccaneers battled back to within a touchdown early in the fourth quarter behind Ryan Fitzpatrick. But the return of “Fitzmagic” wasn’t enough as Newton made it a two-possession game when he found Samuel, who made a leaping grab in the end zone with 9:10 left in the game. It was the second-year wide receiver’s second TD of the game.Julio Jones ended his 12-game touchdown drought, Matt Ryan threw for 350 yards and four scores and the Atlanta Falcons flexed their offensive muscles with a 38-14 blowout of Washington that extended their winning streak to three games.Jones caught seven passes for 121 yards with the biggest coming on a 35-yard screen pass with just under four minutes left that sealed the victory. After Jones twisted away from new Washington defender Ha Ha Clinton-Dix and into the end zone, a swarm of teammates rushed over from the sideline to celebrate Jones’ first touchdown catch since November 2017.Ryan completed 26 of his 38 passes, including touchdown passes of 39 and 10 yards to running back Tevin Coleman and 40 to rookie receiver Calvin Ridley.Rookie linebacker Jerome Baker intercepted Sam Darnold and scored the only touchdown on a 25-yard return with 11 minutes left, and a resilient defense helped the Miami Dolphins beat the New York Jets 13-6.Darnold threw four interceptions and took four sacks, and the Jets went 2 for 13 on third down. The hobbled Dolphins endured another wave of injuries, but their defense was much improved after three consecutive poor games, with the quality of the opposition a factor.Darnold tried to rally his sputtering team from a 6-3 deficit, but following a punt he took a high snap and made an ill-advised throw to tight end Eric Tomlinson. Baker stepped in front for his first career interception and scored untouched. TJ McDonald and Walt Aikens made interceptions to end the Jets’ final two possessions."}