{"id": "\nCarlsen and Caruana play to third straight draw in World Chess Championship\nMagnus Carlsen turns tables on Fabiano Caruana in Game 3 draw – as it happened", "paragraph": "\nGuardian sport\n\nMon 12 Nov 2018 21.56 GMT\n\n\nLast modified on Fri 16 Nov 2018 22.34 GMT\n\nMagnus Carlsen and Fabiano Caruana played to a third straight draw on Monday in the third game of their world championship showdown in London, though the balance of the best-of-12-games match continues to tip slightly in the Norwegian champion’s favor.Caruana, playing with the white pieces, started with the same 1. e4 as Friday’s opening game and Carlsen again responded with the Rossolimo Variation of the Sicilian Defence.The American challenger earned a promising position out of the opening, playing with confidence and initiative. But they went level on position after Caruana’s inaccuracy following a rook exchange (17. Qb4) and the American was made to defend diligently for the remainder against the dogged Norwegian champion to escape with a draw after 49 moves and four and a quarter hours.Caruana and Carlsen are tied 1½-1½ with a slight advantage to the champion, who has five games with white remaining compared to four for the challenger. If the players are still tied after the 12 scheduled classical games, Carlsen, who is also the world’s top-rated rapid and blitz player, would be a heavy favorite to prevail in the tie-breaker, which consist of a series of games under shorter time controls.Carlsen, 27, has been ranked No 1 for eight years and was considered the world’s best player even before he defeated Viswanathan Anand for the title in 2013. He’s making his third defense of the world championship against the 26-year-old Caruana, the world No 2, who is the first American-born player to compete for the world title since Bobby Fischer in 1972.Norway's Magnus Carlsen is defending the world chess championship against Fabiano Caruana of the United States. The best-of-12-games match is taking place at the College in Holborn between 9 and 28 November, with the winner earning a 60% share of the €1m ($1.14m) prize fund if the match ends in regulation (or 55% if it's decided by tie-break games).Carlsen, 27, has been ranked No 1 for eight straight years and was considered the world’s best player even before he defeated Viswanathan Anand for the title in 2013. Caruana, 26, is ranked No 2, having earned his place at the table by winning the candidates tournament in March. No American-born player has won or even competed for the world title since Bobby Fischer in 1972. It marks the first title match between the world's top two players since 1990, when Garry Kasparov and Anatoly Karpov faced off for a fifth and final time. The match will consist of 12 classical games with each player awarded one point for a win and a half-point for a draw. Whoever reaches six and a half points first will be declared the champion.The time control for each game is 100 minutes for the first 40 moves, 50 minutes for the next 20 moves and then 15 minutes for the rest of the game plus an additional 30 seconds per move starting from move 1. Players cannot agree to a draw before Black's 30th move. If the match is tied after 12 games, tie-breaks will be played on the final day in the following order:  • Best of four rapid games with 25 minutes for each player with an increment of 10 seconds after each move.  • If still tied, they will play up to five mini-matches of two blitz games (five minutes for each player with a three-second increment). • If all five mini-matches are drawn, one sudden-death 'Armegeddon' match will be played where White receives five minutes and Black receives four minutes. Both players will receive a three-second increment after the 60th move. In the case of a draw, Black will be declared the winner.Thu 8 Nov – Opening ceremony Fri 9 Nov – Game 1 Sat 10 Nov – Game 2 Sun 11 Nov – Rest day Mon 12 Nov – Game 3 Tue 13 Nov – Game 4 Wed 14 Nov – Rest day Thu 15 Nov – Game 5 Fri 16 Nov – Game 6 Sat 17 Nov – Rest day Sun 18 Nov – Game 7 Mon 19 Nov – Game 8 Tue 20 Nov – Rest day Wed 21 Nov – Game 9 Thu 22 Nov – Game 10 Fri 23 Nov – Rest day Sat 24 Nov – Game 11 Sun 25 Nov – Rest day Mon 26 Nov – Game 12 Tue 27 Nov – Rest day Wed 28 Nov – Tie-break games/Awards and closingThe games commence each day at 3pm in London.It marks the first title match between the world’s top two players since 1990, when Garry Kasparov and Anatoly Karpov faced off for a fifth and final time.The match resumes on Tuesday at the College in Holborn with Game 4, in which Carlsen will play with white."}