{"id": "\nNorth Korea maintaining more than a dozen missile launch sites, photos show\nSouth Korea and US resume military drills ahead of nuclear talks", "paragraph": "Satellite images of ballistic missile base are a further sign that US diplomacy has not led to significant disarmament\nJulian Borger Washington\n\nTue 13 Nov 2018 03.09 GMT\n\n\nFirst published on Mon 12 Nov 2018 22.43 GMT\n\nNorth Korea is maintaining more than a dozen missile launch sites, according to new research, in a further sign that the summit diplomacy pursued by Kim Jong-un has not led to any significant disarmament.Donald Trump and his secretary of state, Mike Pompeo, have portrayed the US president’s June summit with Kim in Singapore as an unprecedented breakthrough, and pointed to the partial dismantling of a nuclear test site and a missile engine test area as signs of progress towards North Korean disarmament.The Centre for Strategic and International Studies (CSIS) thinktank in Washington, however, has published satellite photographs of a short-range ballistic missile operating base near the demilitarized zone (DMZ) capable of accommodating medium-range missiles and threatening US forces in the region. The CSIS researchers said the base was still being maintained and improved, and was one of 13 it had identified out of an estimated 20 in total.The existence of the bases does not represent a violation of the agreement Kim made with Trump at the summit, which involved vaguely worded pledges on the “denuclearisation of the Korean peninsula”, which Pyongyang interprets as a gradual, staged and reciprocal process of disarmament.“The CSIS report does a great job identifying missile operating bases that analysts have long suspected. The fact that they have been maintained and improved, however, does not mean North Korea is cheating or deceiving the United States – Kim said he would mass-produce ballistic missiles and nuclear warheads in his New Year’s Day speech this year, and that is exactly what he is doing,” said Vipin Narang, an expert on the North Korean nuclear programme at the Massachusetts Institute of Technology.Seoul’s presidential Blue House played down the latest research, according to Yonhap news agency. Spokesman Kim Eui-kyeom said information about the Sakkanmol missile base had come from a commercial satellite. “The intelligence authorities of South Korea and the US have far more detailed information from military satellites and are closely monitoring [the base],” Kim said.Trump used the nuclear agreement to promote himself as a peacemaker ahead of the US midterm elections earlier this month, pointing to the absence of nuclear and missile testing over the past year. He has said sanctions would stay in place until North Korea disarmed, but that he was “no rush” to force the pace of disarmament.For the time being, Pyongyang appears to sticking to a self-imposed moratorium on testing in return for a pause in US military exercises with South Korea which Trump ordered after the Singapore summit. But there are signs that bargain may be beginning to fray. The North Korean regime has warned it could resume its nuclear development work if sanctions are not lifted.On Monday, state-controlled media said that small-scale military drills by a few hundred US marines and South Korean forces represented a violation of a summit agreement between Kim and the South Korean president, Moon Jae-in.North Korea abruptly pulled out of planned talks with Pompeo in New York last week, and have so far not sent a delegation to talk to the newly appointed US envoy for North Korean talks, Stephen Biegun. Pyongyang said however that it is still interested in pursuing talks and describes Trump as being a more amenable interlocutor than other US officials.“I think Kim still wants to get to a second summit, and so does Trump, on the hope that Trump is more likely to provide relief and concessions than Pompeo is,” Narang said. “So I think they wait to see if they can get to a second summit before doing anything provocative like resuming testing or a space launch. If the second summit blows up, then maybe we see a resumption of testing and fire and fury.”"}