{"id": "\nDeparting Daily Mail editor Paul Dacre lashes out for final time\nDaily Mail – can the new editor keep Brexiters and remainers happy? | Jane Martinson", "paragraph": "Former editor defends paper’s ‘enemies of the people’ headline in speech at Society of Editors conference\nJim Waterson Media editor\n\nSun 4 Nov 2018 21.04 GMT\n\n\nLast modified on Mon 5 Nov 2018 08.29 GMT\n\nPaul Dacre has used his first major public appearance since stepping down as Daily Mail editor to defend his decision to describe high court judges as “enemies of the people”.Dacre, who left the job this summer, said the decision to run the front page after the judges ruled that parliament would have to vote on Brexit helped push the issue of judicial involvement in politics on to the national agenda – and that his critics missed the fact that the headline was a reference to a play by the Norwegian playwright Henrik Ibsen.He admitted the front page could perhaps have been phrased better, saying: “But what the hell. The point needed to be made.”The former Daily Mail editor was making the lecture at the Society of Editors conference in Salford, where he was awarded the society’s first lifetime achievement award.Dacre used a lengthy part of his valedictory speech to criticise the “liberal Brexit-hating media” who “almost always regard with contempt the mass-selling papers which have to appeal to large audiences to survive commercially”.Among other predictions, he said the UK would soon the see the rise of rightwing TV broadcasters to fill the gap left by the BBC, that Theresa May would lead the Conservatives into the next general election, that tech companies that provide “succour to terrorists and paedophiles” would soon be broken up, and that print newspapers would be here to stay for some time.Dacre said there was an ever-growing gap between London-based journalists and the views of the general public. He said: “They aren’t obsessing over #MeToo, or transgender rights, or equal pay for BBC journalists. And they do like Mrs May and think she’s doing a job in difficult circumstances.”He saved particular anger for the Guardian, spending 15 minutes of the speech criticising the organisation and its views. However, he later accepted that it was “still a great and important paper” and part of the tradition of a British free press, which ensures rival papers are allowed to make contradictory editorial calls, such as over the Edward Snowden leaks – which Dacre strongly opposed.Dacre said: “I don’t agree with the Guardian’s decision to publish Snowden, who now skulks in the murderous kleptocracy that is Russia. The man was a traitor who should have been arrested and not sanctified. But I also passionately believe the Guardian must have the freedom to carry such stories.”He criticised “leftwing” professors of journalism and said it was a ludicrous topic for academic study, with journalism degree programmes “churning out graduates for non-existent jobs”.Ian MacGregor, the Telegraph’s editor emeritus and president of the Society of Editors, said Dacre “has been, without doubt, one of the most successful and influential newspaper editors of his generation”.“The British media would be in an awful lot weaker position without him and his enormous contribution,” said MacGregor, presenting him with a cut-glass bowl.Dacre, who ended a 26-year stint as editor of the Daily Mail this summer, made no mention in the speech of his successor, Geordie Greig.Before leaving the editor’s chair, Dacre gave repeated public warnings to Greig about the risk of moving the Daily Mail’s editorial line away from a hard Brexit, advice that Greig has happily ignored – instead turning his newspaper’s anger on the likes of Iain Duncan Smith for attempting to disrupt Theresa May’s negotiations with the EU.Despite speculation that Dacre would continue to exert power over the paper, Greig has made it repeatedly clear that he answers directly to the Daily Mail owner, Viscount Rothermere. The new editor was not in Manchester to hear the advice from his predecessor.Dacre, who turns 70 next week, is understood to have signed with a literary agency and is working on his autobiography. Asked about this, he said: “Every editor thinks about writing his memoirs.”"}