{"id": "\nThe Little Drummer Girl recap: episode two – the cast assemble, the plot thickens\n", "paragraph": "Charlie is drawn in to Kurtz’s team as she and Becker work together to play their roles in foiling the bombers. But who is fooling who?\nGraeme Virtue\n\nSun 4 Nov 2018 22.00 GMT\n\n\nLast modified on Sun 4 Nov 2018 22.02 GMT\n\nSPOILER ALERT: This recap contains spoilers for episode two of The Little Drummer Girl. You can read the episode one recap here.Peter. Joseph. And now Becker. In a very short time, Alexander Skarsgård’s broad-shouldered but brooding agent has already picked up multiple aliases. As the stubbled yet slippery operative told his newest asset that her mission was to drive a dodgy red Mercedes stuffed with Russian plastic explosive across multiple borders, a pertinent question might seem to be: would you buy a used Le Carré from this man?That was where episode two of The Little Drummer Girl pulled on the handbrake for another week, with Florence Pugh’s pugnacious Charlie – so recently living out a moonlit romantic fantasy in front of the Parthenon – left weighing up her options against the backdrop of a very different kind of Greek ruin: a remote, rusty industrial mill. It looked like the sort of place you could safely discuss such covert business (or dump an uncooperative body, perhaps).The journey to get there was a rocky one, a twinned tale of non-voluntary auditions. Having been delivered to a Love Island-esque Athens villa (ocean views, lovely pool, discreet sliding doors), Charlie was apparently bullied into spilling all her shameful family secrets. Under the severe but self-amused gaze of plotter-in-chief Kurtz and his cadre of agents she opened up about fending for herself since she was 15. It involved a banged-up dad, booze and some unpleasant business with bailiffs. “They took it all: my childhood, my home, my happiness,” she said, gulping back tears. It all seemed like a plausible seed for her firebrand politics.Unfortunately, the fastidious snoopers of Mossad had only been doling out rope so Charlie could trip herself up. Her biographical claims were dismantled in front of her by a series of cold, barked facts: she came from a loving family and had workshopped that hardscrabble origin to add a tang of tragedy to her backstory, the sort of thing that casting agents and even fellow actors might devour. The glum Becker – to her, still prickly semi-amour Joseph – bluntly delivered the last wrecking balls that demolished her constructed personality. Charlie got one solid right hook in but then crumpled into a sobbing heap at her tormentor’s feet. “You did great, kid,” chirruped Kurtz. “You got the part!”Charlie, at least, got the chance to take the lead in her performance. “Michel”, AKA Salim, the playboy bomber relieved of his liberty and flashy red Merc last week, had no such agency. Renditioned to Kurtz’s safehouse in the Munich Olympic Village – a complex of brutalist apartments that, as some commentators noted, looked suspiciously like London’s Alexandra and Ainsworth estate – Salim was confined in a sturdy fake cell with concealed speakers piping in the muffled cries of prison life. This was the sort of thing they used to do on the vintage Mission: Impossible TV show, mounting an elaborate panto to disorientate a target.In the end, it took some heavily spiked orange segments and a campaign of misinformation – including a faked letter from his beloved sister Fatmeh – to squeeze some intel out of Salim. As he was drugged and deceived, there was the incongruous sight of his captors crowding round a map studying his recent movements while they thoughtfully sucked on what looked like Zoom rocket-ship ice lollies, an unsettling suggestion of how at ease these operatives were in their murky work. (In the end, it took some cruel questioning from Kurtz’s eager junior agent Shimon to get Salim to give up the vital info: that he was supposed to deliver a Merc-load of semtex to Salzburg station in Austria.)While Salim was unravelling, Charlie was being refashioned into an asset. To infiltrate Salim’s cell, she was required to build up a convincing cover as one of Michel’s girlfriends, plausible enough to convince his comrades-in-arms. Coached by Becker – constantly in character as “Michel”, even wearing Salim’s wide-collared red shirt from happier days in Munich – this involved refashioning her recent past and discussing their imagined sex life over grapes and neat vodka. For Charlie, this represents the personal and professional challenge of a 360-degree performance of constant improvisation (“There will be no cut, no curtain,” warns Kurtz), even if she mostly seems in it to try and decipher Becker and the secrets of his constantly furrowed brow. Or is it simply the thrill of the secret agent life that makes her agree so readily to something so demonstrably risky?When the central thread of your drama is about characters and their ability to convincingly play different parts, performances will obviously come under scrutiny. Some commentators were not entirely convinced by Michael Shannon’s dishevelled but crafty spymaster, but there was a moment here, when he was selecting which pair of glasses to wear before interrogating Charlie, that suggests Kurtz is perhaps the biggest actor of them all, and perhaps the only one truly enjoying all these false faces. “I’ve been kidnapped by an experimental theatre company,” muttered Charlie darkly. It may well turn out to be the truth.The Little Drummer Girl still looks lavish but with the odd queasy lurch. In the opening scenes, director Park Chan-wook played out a flashback at a Solidarity Against Imperialism forum in Dorset – where a masked Michel/Salim explained the roots of his militancy to an audience including Charlie – before rewinding the action on-screen along with the audio surveillance tape. These little unnerving moments of unexpected camera movement help maintain an undercurrent of unease, although Park seems equally interested in Charlie’s gorgeous, vivid summer wardrobe. After last week’s yellow La La Land number, tonight’s highlight was a gorgeous deep-blue hooded dress with more than a hint of Scottish Widows about it.The pre-credits sequence confirmed that Kurtz had been targeting Charlie for a while, revealing him as one of the off-screen casting agents from her screen test last week. We also saw Becker being re-recruited by Kurtz for this mission, sporting the clean-shaven chin, lank hair and severe side parting of a former spy trying to reinvent himself as a Berlin architecture student.If the Zoom lollies felt a bit I Love the 80s, that was nothing compared to Becker’s old-school Walkman headphones with classic orange pads.With Peter/Joseph revealed to be actually called Becker, and Salim being Michel’s real name, it can be a little hard to keep track of who’s who – no wonder Charlie tends to call people “love” (in a very charming way).I had assumed Becker had picked up Salim’s actual red Mercedes when he and Charlie arrived in Athens but Kurtz had obviously arranged for there to be a duplicate on standby, much like a theatre or TV company would ensure they had multiples of key props, vehicles and costumes to maintain continuity.Two episodes in and everything seems built around the attraction and/or connection between Becker and Charlie. Are you feeling it?"}