{"id": "\nThe next election is the Coalition's to lose – but that doesn't mean it'll win\nThe Wentworth byelection isn't just a loss for the Liberals. It's a disaster | Katharine MurphyIndonesia warns it will 'adjust' policies if Australia moves Israel embassy", "paragraph": "Such low unemployment should ensure re-election, but this clown-car government is anything but predictableContact author\n\nSat 20 Oct 2018 22.00 BST\n\n\nLast modified on Sat 20 Oct 2018 22.02 BST\n\nBefore Saturday’s Wentworth byelection, the Liberal party was letting it be known that it would require “a miracle” for it to hold the seat. It was a blatant case of expectation management – any loss would be explained as being in the too-hard basket; any victory would be championed as one of the greatest results in electoral history. Never mind that the Liberal party held the seat by 17.7% and it was the eighth-safest Coalition seat in the country. It turned out they were right to expect a thumping, although even the most pessimistic probably didn’t expect it to be so bad.So in light of that bit of expectations fluff, let me make my own election call – the next federal election is the Liberal party’s to lose. Incumbency and the economic situation should see the Coalition winning it (to borrow a favourite phrase of the prime minister) in a canter.This week came the news that the unemployment rate hit 5% – the best result for six years. Now with that figure comes a few provisos. We are talking the seasonally adjusted figures, which the ABS recommends not to use when comparing monthly changes (but the media does because it tends to bounce a bit, and bounces are more newsworthy than little change). The September figures also saw the second-biggest monthly fall in the past 15 years, so it wouldn’t be surprising if next month sees a rise.But all these are, to an extent, just nice, nerdy caveats. 5.0% unemployment! Just look at that number. Think that at the last two elections it was 5.7% – so the Coalition has a pretty easy story to tell.And don’t give me the “oh, the unemployment rate is a fraud because one hour of work is counted as being employed”. Full-time employment is growing well – up 2.2% over the past year. Sure, that’s not as good as the 3.9% growth at the end of 2017, but it is still much better than the 0.8% growth at the time of the 2016 election, let alone the -0.2% at the 2013 election.To not be in a supreme election-winning position with those kind of numbers, you would have to be an absolute clown car of a government.And, well ... yeah.Let’s be honest, this government is doing all it can to demonstrate it has no idea. Short-termism is a problem most politicians suffer from but bringing out the idea to move our embassy in Israel, despite advice from security agencies warning it may provoke reaction, and despite the impact it will have on our relationship with Indonesia, in a bid to secure votes in Wentworth, and then most likely dump the position afterwards, is a new level of idiocy.Throw in the allegations that the minister for the environment, Melissa Price, disparaged Pacific nations to the former President of Kiribati, and the miserable disgrace that was the government senators supporting a One Nation motion that used a white supremacist slogan, and the National party making noises about another leadership spill, and you have a government this week not so riven with incompetence as at a point where incompetence would seem an improvement.Yet it is not only the government’s wonderful accuracy at shooting themselves in the foot that has meant the current employment situation is not translating into an electoral sure thing. The employment conditions themselves are lending themselves to that end.We have a situation of low unemployment, strong full-time employment growth (especially for 35-44 year olds) and yet we still have interest rates at record lows and wages growth pretty much dribbling along at if not record lows not far above them.And we also have underemployment still at historically high levels.The last time the unemployment rate was 5.0% was in April 2012, but back then the underemployment rate was 7.3%. Now it is 8.3%.In the past four years, the unemployment rate has fallen 1.4% points, from 6.4% to the current 5.0%; in that same period the underemployment rate has risen from 8.2% to 8.3%.And this matters because over that period the driver of wages growth has been more the level of underemployment than unemployment. The drop in the underemployment rate over the past six months, from 8.5% to 8.3%, should see wages growth improve, but thus far it is more hope than reality.The government itself this week continues to show it is on the side of keeping wages down. The minister for jobs and industrial relations, Kelly O’Dwyer, announced the government would intervene in a case before the federal court challenging an earlier ruling that saw a truck driver – employed as a casual worker for two and half years through a labour-hire firm and paid around 30% less than full-time workers – being able to claim leave entitlements.It’s a good example of how the government remains very clearly on the side of employers, and has put full faith in the market delivering wages growth at some stage.It’s a position that opens itself up very much to charges of being ignorant of why, in the face of low unemployment, the voters are not giving them credit.But it is not just about the government. The ALP has sought to make the issue of flat real wages and incomes growth an issue – essentially arguing that all the good news is flowing to companies and owners and not to workers. That might be a winning political argument, but the disconnect of unemployment and wages will be their issue should they take government. And as governments around the world have found, it is a tough problem to solve.It means governments might no longer be able to rely on previous measures of economic strength to get re-elected. And it means the ALP will need to deliver on its promises of wages growth – while also keeping unemployment low.If they could do that without also becoming a clown car of a government, that would also be rather appreciated by voters, I suspect.• Greg Jericho is a Guardian Australia columnist"}