{"id": "\nFacebook growth slows as Zuckerberg says developed countries are saturated\nFacebook, listen to your users and stop tolerating hatred | Carys AfokoFacebook deletes Iran-linked pages over effort to sow discord among US voters", "paragraph": "Company announces 33% revenue growth over last year as CEO reports more than 2bn daily users\nGabrielle Canon in San Francisco\n\nTue 30 Oct 2018 22.02 GMT\n\n\nLast modified on Wed 31 Oct 2018 11.52 GMT\n\nMark Zuckerberg admitted that Facebook “may be close to saturated in developed countries” as the social media giant posted a 33% increase in revenue.Despite controversies including the Cambridge Analytica data privacy scandal, the quarterly results showed Facebook continuing to grow, although Zuckerberg cautioned that revenue could slow in the future.“Our community and business continue to grow quickly, and now more than 2 billion people use at least one of our services every day,” the founder and CEOsaid in a statement released with the earnings. “We’re building the best services for private messaging and stories, and there are huge opportunities ahead in video and commerce as well.”The growth in those services has largely been delivered through Facebook-owned apps, like WhatsApp and Instagram.While Facebook also reported continued growth in daily active users this quarter, use of the platform in the west may be waning – which may spell bad news for the company that’s been hit with several scandals and increases in government regulation.Between the second and third quarters, the company reported an increase of average users from 1.47 billion to 1.49 billion, and a decline in the growth rate from 11% to 9%.User rates in the US and Europe remained mostly static, and the small growth came in other areas of the world.On the call, Zuckerberg framed the numbers as a sign that Facebook had remained stable and was saturated in “developed countries”.He emphasized that the company was expanding its ability to deliver stories and video, and would increase efforts to build communities – replacing that as a priority above newsfeed – with new offers like dating connections that will be rolled out soon.“These are services that benefit from having everyone you know connected on a single platform,” he said, adding that it had been a tough but important year for the company.In July, the tech giant reported 42% growth in revenue over 2017, but despite the upswing in numbers, investors were told growth rates should be expected to decline in the coming months.That announcement put a chill on investors’ expectations and the company saw stock prices slide by more than 20% in the hours that followed. The company came out of the second quarter losing more than $100bn in market value as a result.Facebook has felt the fallout over data breaches and was held responsible for foreign intervention in elections and the spread of fake news, greatly affecting how users engage with the platform.Following the Cambridge Analytica scandal, in which 50m Facebook profiles were harvested for data and used to influence the results in the 2016 US election of Donald Trump and the Brexit campaign – widely seen as the largest data breach in history – Zuckerberg announced there would be big changes to the platform.“We have a responsibility to protect your data, and if we can’t then we don’t deserve to serve you,” Zuckerberg wrote in a statement, published five days after the Observer broke the story. “We also made mistakes, there’s more to do, and we need to step up and do it.”In the aftermath, the company tried to fix its privacy problems, along with its reputation. It tightened security on third-party app developers, updated privacy settings, required verification of identity from political ad-buyers, and teamed up with social science researchers. Facebook also announced the launch of a new “war room”, designed to mitigate the spread of misinformation, earlier this month.Last week, the company announced that the war room team had detected and deleted 82 pages, groups, and accounts, all found to be part of an Iranian disinformation campaign targeting voters in the US and UK.While the company could not prove the pages were linked to the Iranian government, it was clear they were intended to “sow discord”, addressing divisive topics, including race relations, support for Donald Trump, and immigration. The move followed a much larger take-down in the summer, when 684 fake accounts and pages with links to Russia and Iran were removed from Facebook and Instagram.But the moves may not be enough to quell the damage that has already been done –especially if user growth rates continue to fall.In response to concerns about data privacy, the EU enacted regulations in May requiring tech companies like Facebook to better-protect user data. Legislation in the US is expected to follow, with big states like California already drafting changes in the law. The regulations, along with company-led changes, have already had an impact on how advertisers use the platform.This month, Facebook was fined £500,000 by the UK’s Information Commissioner’s Office over the scandal, which affected at least 1 million users in the UK. While the fine is tiny compared with the billions in revenue the company rakes in, the continued scrutiny over the way Facebook failed to protect user privacy has affected users’ habits on the site – a much harder hit on the bottom line.In September, Pew Research Center reported that, over the past year, nearly half of Facebook users surveyed over the summer had taken weeks-long breaks from the platform after the Cambridge Analytica scandal. Twenty-six per cent said they had deleted the app from their cellphone altogether.“The reality is Facebook doesn’t have a PR crisis. It has a trust crisis,” Carys Afoko, founder of the feminist group Level Up, wrote in the Guardian this week, adding that she no longer uses the platform the way she once did. “Users like me don’t trust the company to protect their privacy. We don’t trust them to pay their fair share of tax. And we don’t trust them when they say there won’t be a repeat of the 2016 US presidential election.”Ahead of the call, the tech industry expert Beth Kindig anticipated that the hit on growth rates would be reflected in the company’s third-quarter earnings report.“Facebook’s growth rate trajectory was exponential because people found the network more rewarding when more people they knew joined the network,” Kindig wrote on her blog. “The same will be true for Facebook’s deceleration as well. As people start to spend less time on the social network, there’s viral deceleration.”"}