{"id": "\n'He can kiss my red ass': California fire evacuees give Trump visit short shrift\nDonald Trump visits California, again blaming fires on forest management", "paragraph": "Hundreds displaced by wildfires who are gathered in a parking lot have more pressing concerns than the president’s comments\nDani Anguiano in Chico, California\n\nSat 17 Nov 2018 22.06 GMT\n\n\nLast modified on Sat 17 Nov 2018 23.08 GMT\n\nAs Donald Trump landed in northern California on Saturday morning, hundreds of evacuees at a Walmart in Chico were frantically trying to figure out their next steps – which shelter they would go to, and if they should stay close to what’s left of their homesin the fire-ravaged town of Paradise.At the giant box store, which has become a refugee camp for those forced to flee their homes when the worst blaze in state history incinerated their town, people ate lunch and packed their belongings and worried about the future.There was little talk of Trump, even though his motorcade was just miles away.The president flew by helicopter to the city of Chico to meet first responders and victims after Air Force One arrived at Beale air force base, about an hour’s drive from the devastated town of Paradise.Trump was criticized for his initial response to the fire and threat to withhold funding, after he tweeted: “There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!”When asked about the president’s visit to the area, Kirk Ellsworth, whose adult children lost their homes in the fire, shook his head in disgust.“My kids lost everything. I voted for him – and now? He can kiss my red ass,” Ellsworth said. “What he said was ridiculous. It hurts my heart. A lot of us voted for him and he [talks] down to us?”Still, the hope for many evacuees was that Trump’s visit might draw attention to their plight and bring help for those who need it most. Nearly 10,000 homes were lost in the fire, which has killed 71, razed Paradise and caused severe damage to the smaller communities of Magalia and Stirling City.“The president of the United States to come here and meet the most vulnerable – that’s important whether you’re a Democrat or Republican,” Tammy Mezera said. “[He] has a responsibility to do that.”Mezera hadn’t given much thought to Trump’s visit, she said. She’s been “frantic” trying to pack up the tent that has been her home since 8 November, when the Camp fire first erupted.Meanwhile, Ryan Belcher and his wife Casey have been doing the same, preparing to leave Walmart and find a new home for their two children. They hope Trump better understands the struggles of evacuees after seeing the devastation and shows more sympathy.“We are not the ones to blame. We are not in charge of managing the forest,” Ryan said, frustrated, as he held two toys someone donated for his children.“I hope he sees how this community has come together,” he added, trailing off as someone asked if he and Casey were fire victims, and handed them gift cards.”People are still here helping us. it’s an amazing thing and I hope he sees that,” Casey said, wiping away tears."}