{"id": "\nKasper Schmeichel: Cardiff match was ‘like a cup final’ for Leicester\nHundreds attend Leicester City FC owner's funeral in BangkokDemarai Gray strike gives unified Leicester emotional win over Cardiff", "paragraph": "•City win 1-0 in first game since death of owner Vichai• Players and staff flew to Bangkok for funeral afterwards\nNick Ames at Cardiff City Stadium\n\nSun 4 Nov 2018 22.30 GMT\n\n\nLast modified on Mon 5 Nov 2018 15.39 GMT\n\nThe Leicester City goalkeeper Kasper Schmeichel says his team’s victory at Cardiff on Saturday was “like a cup final” and that the feeling was incomparable to anything else he has experienced in his career.Schmeichel kept a clean sheet on an emotional afternoon that served as a tribute to the late Leicester owner, Vichai Srivaddhanaprabha, and the four others who died with him in last weekend’s helicopter crash outside the King Power Stadium. The 31-year-old had received counselling during the week and was in tears during the pre-match minute’s silence, but responded with a performance full of guts and resilience.“We have had some great times,” Schmeichel said of his team’s exploits under Vichai’s eight-year ownership. “It felt like a cup final. I haven’t really known a feeling like it on the pitch. I am really glad to have won … I think everyone is relieved more than anything.“[The day was] emotional, yes, but that is not necessarily a bad thing. It gives you a certain strength. It is an emotional day and an emotional time but there was no question I was going to play.”Schmeichel confirmed he had witnessed the horrifying moment when the helicopter transporting Vichai fell to the ground shortly after taking off. Eyewitness reports suggested he sprinted out of the stadium in an attempt to assist and he said the experience is one that will never leave him.“I spoke to somebody [for support],” he said. “I was on the pitch, I waved him off, I saw it all happen. It was something that will stay with me, unfortunately. But the club have been great and everybody has received the support they need. It is not a nice memory but I have had all the support I need.”Leicester saw out the win with few alarms after Demarai Gray’s 55th-minute goal, defending resolutely amid spells of Cardiff pressure. Schmeichel explained it had not been an occasion for intricate strategies and that the emphasis had been on mastering the intense feelings that had occupied them.“There was no real need for gameplans or tactics,” he said. “It was just about controlling our emotions. We talked about having to just stick together and be what we have always been – a family. We talked about how proud we are of being here, of being part of what he has built.”The squad and staff travelled to Bangkok straight from Cardiff to attend Vichai’s funeral and their manager, Claude Puel, knows there will be difficult times after their return. Leicester host Burnley in what is likely to be another highly-charged occasion on Saturday and Puel believes the current experience will change them. “They are growing as people and it’s a good thing,” he said. “Afterwards we will not be the same men and I think together we have to move on, to manage this emotion, and to keep the right way.”"}