{"id": "\nMike Pompeo insists US sanctions will not hurt Iranian people\nIran sanctions: Khamenei says world opposes every Trump decision", "paragraph": "\nEd Pilkington\n\nSun 4 Nov 2018 21.25 GMT\n\n\nLast modified on Mon 5 Nov 2018 14.46 GMT\n\nUS secretary of state Mike Pompeo has defended the re-imposition of sanctions on Iran, saying the new tough controls on oil, shipping and banking that start on Sunday at midnight will force Tehran to stop sponsoring terrorism.Speaking to Fox News Sunday hours before the new sanctions went into effect, Pompeo said the move would cut off Iran from its oil market and target 600 individuals and companies in the finance sector. He insisted the penalties would not hurt the Iranian people.“These sanctions are the toughest ever put in place on the Republic of Iran,” he said. The top diplomat in the US said the new sanctions were designed to “alter Iran’s behavior” and protect Israel and other countries.The re-imposition of sanctions follows Donald Trump’s withdrawal from the 2015 nuclear deal, known as the Joint Comprehensive Plan of Action, which provided economic incentives in exchange for a verifiable end to Iran’s nuclear program. The unilateral rejection of the deal has gained very few supporters, though Pompeo claimed “we have built an enormous coalition to keep this world safe”.The European Union in particular is setting up a route to bypass US sanctions in return for persuading Iran to continue on its non-nuclear path.The assertion that renewed sanctions will not hurt ordinary Iranians has been questioned. There are signs the Iranian people are on tenterhooks about the impact on their daily lives. Medical groups have warned that the penalties will lead to severe shortages of essential medicines, endangering thousands of lives.Pompeo’s belligerent tone was matched by Trump, who announced the new sanctions on Friday with a tweeted picture in the style of Game of Thrones. It said: “Sanctions Are Coming November 5”.As he left the White House on Sunday for an election rally in Macon, Georgia, Trump said the sanctions would damage the Iranian regime.“They are not doing very well, let me tell you,” he told reporters. “It’s a big difference. When I came in office it looked like Iran would take over the Middle East, it was a question of literally less than years, very quickly, and now nobody is talking about that.”The Trump administration has agreed to grant eight nations exemptions to allow them temporarily to continue buying Iranian oil, without naming the countries. It is widely suspected that the list includes some of the biggest importers of Iranian crude, such as China and India.Asked to confirm the presence of those two nations on the list of exemptions, Pompeo sidestepped the question.“Watch what we do,” he said. “We have already taken more crude oil off the market than at any time … and the march to zero continues.”"}