{"id": "\nPeople Just Do Nothing review – Kurupt FM's original pirate material\n‘The joke is always on us’: how People Just Do Nothing struck comedy gold", "paragraph": "Idiotic hubris, crushing realisation and denial should be depressing, but in the fifth and final BBC series, these tragicomic characters transform it all into something joyousTim Dowling\n\nMon 12 Nov 2018 22.00 GMT\n\nMC Grindah, DJ Beats, Steves and Chabuddy G are back for a fifth and final series of People Just Do Nothing (BBC Two). As the franchise expands – Chabuddy has become a comic staple (he does the British Airways in-flight safety announcement), the fictional pirate DJs are currently touring live music venues, and there are plans for both a film version and a US remake – it’s remarkable just how strong the original product remains. It’s as funny, and as tragic, as ever. People Just Do Nothing may have earned its creators awards, critical acclaim and money, but success has not threatened Kurupt FM.In fact, as of the first episode, there is no Kurupt FM. Raided by the police during Grindah and Miche’s wedding reception/rave at the end of the last series, the station is still off-air a year later. DJ Steves took the rap – probation and community service – a sacrifice that Grindah views through his own particular prism. “Sometimes the king has to be able to chuck away one of the little prawns,” he says, “just so the whole team can eat, d’you know what I’m saying?”“Check mate,” says Beats.Actually, Steves seems to be taking community payback in his stride, planting flowers on a local roundabout while trying to interest his fellow parolees in jokes about hoes. It’s Grindah and Beats who are not faring so well: they have been reduced to paying to perform their sets on arch-rival station Kold FM, which, in their eyes, amounts to complete humiliation. Chabuddy G, meanwhile, is romantically entwined with Miche’s mum. “It’s been a kind of crash course in sex for me, really,” he says. “And when I say crash, I mean literally.”“He has got hurt a couple of times,” says Miche’s mum.On top of all this, Miche and Grindah’s tower block is being demolished, and, having adopted the canny strategy of Just Doing Nothing, the only housing option now available to them is far from their Brentford home turf. “What part of London is Essex in?” Miche asks.Despite the setbacks, the crew’s delusions of grandeur are still firmly in place, even as they resort to a car boot sale to try to raise enough money to buy new equipment. Grindah prices signed headshots of himself at £80 each. When they finally manage to get enough stuff together to resurrect Kurupt, Grindah makes what he hopes will be a triumphant visit to Kold FM to resign his position, but the DJ in charge is merely bewildered. “Is this because we caught you doin’ a sit-down piss, yeah?” he says.This cycle of idiotic hubris, crushing realisation and denial is the engine that drives People Just Do Nothing. All the main characters are deluded, wrongly believing themselves to be talented, sage and even honourable (excepting perhaps Chabuddy, who is proud to be thought of as “dodgy”). Cowardice stands in for cunning. Meanness masquerades as principle. Miche can’t bring herself to put the words “Sad to see you go” in the leaving card of a co-worker. “I really don’t want to lie on the card, cos it’s written down, isn’t it?” she says.In different hands, such characters could become exasperating over five series, but their faults – and their manifest transparencies – are actually endearing. Their hardships may be largely of their own making, but they remain indomitable, and somehow sympathetic, throughout. And it’s all achieved with magnificent subtlety: great explosions of overconfident bluster are undermined by a single sideways glance.In many ways People Just Do Nothing is more of a comedy for our age than it was when in first appeared in 2014. Back then it was bad enough that self-belief was considered the main ingredient of success. In the Trump era a more pernicious idea holds: that success can be conjured, like a mirage, from sufficient self-deception. This sort of thinking is at the centre of MC Grindah’s cracked philosophy. “If you’ve got goals,” he says, “you don’t need a job. If you know where your dreams are, then you don’t need to live in reality.”That message should be depressing, but People Just Do Nothing transforms it into something a little bit joyous. Maybe it’s just because it’s funny, and we’re all laughing at other people being so easily and so routinely deluded. Or maybe it’s because self-delusion is all we’ll have soon."}