{"id": "\nRock-solid John Stones shows quiet magnificence for Manchester City\nWhat Manchester United must do to end stagnation under José MourinhoKevin De Bruyne set to be back for Manchester City earlier than expectedDavid Silva sparks Manchester City’s precious derby victory over United", "paragraph": "The England defender, who has regularly been picked out for his mistakes in the past, often goes unnoticed when at his bestContact author\n\nMon 12 Nov 2018 22.15 GMT\n\n\nFirst published on Mon 12 Nov 2018 22.00 GMT\n\nJohn Stones didn’t make much of an impression in the Manchester derby: didn’t register on the headline stats, wasn’t singled out in the post-match montage, didn’t come steaming across to launch a heroic goal-bound siege-tackle, or head the ball away with a conical white bandage twined around his bloodstained brow.This is usually a good sign when it comes to Stones, a player who only ever seems to get picked out when he makes a mistake, and whose recent run of form in a reconfigured defence provides another convincing argument City may just be ready to reach down and hit a deeper gear this season.Stones when you don’t notice Stones: this is the best Stones, a player whose grace on the ball will always catch the eye but who is at his best when he blends into the players around him. There was a good example around the hour mark on Sunday, as United pressed and the weather briefly threatened to shift.City had dominated possession from the start, had scored two dreamy goals, and had spent the last hour oozing around the static red shirts like a sky blue surge tide. The introduction of Romelu Lukaku offered another challenge. It was his run in behind City’s defence that earned United a penalty. Lukaku had found space behind Stones as he pushed up, a small mistake transformed into a significant one by Ederson’s decision to hare out and clatter into the Belgian’s ankles.Moments later Lukaku dropped deep, flicking a high ball on beyond Stones. On this occasion, though, there was cover, Fernandinho sprinting back with neurotic caution to cover the space. A few moments later Lukaku again held the ball up in the centre circle. This time Stones came haring in with real aggression, so tight to the back of his man he seemed to be trying to form a rugby union-style rolling maul.And steadily things settled. City adjusted on the hoof, Stones, Fernandinho and Aymeric Laporte operating in those few minutes as a single compound brain, altering their positions, marking a little tighter in the clinches, covering Lukaku’s flicks with his back to goal.Stones even managed to avoid giving away a foul for that full body grapple in the centre circle – a significant moment in itself. Here is a good Stones stat: he is on a run of five Premier League games without committing a foul. And here is another good Stones stat. Since he returned to the starting XI against Liverpool in early October City have yet to concede a goal from open play.Oh wait, and here is another one. Right now Stones has the highest pass completion rate of any player in the Premier League, no small thing given the risks City take playing out from the back, not to mention …hang on. There is another one too. Chuck in that annihilating home derby win and two years into his City career Stones has never – repeat, never – lost a Premier League game when he has played a full match at the Etihad Stadium.What does it mean? Does it mean anything? There are of course caveats in any such run. City have become a steamrollering domestic force. This is above all a genuine team, to the extent you could prop up a stained-mahogany Victorian hatstand in the middle of that defence most weekends and it might have a fair chance of making the Premier League team of the season on the bare numbers alone.For all that, Stones was quietly magnificent against United – all long striding authority, aggressive when required, and with a familiar calmness on the ball. Twice in the second half he carried the ball out of defence and feinted and weaved past three United players, an ease in possession that instantly shifts the shape of the game, allows his team to re-gear itself, to take a breath, to retake its starting positions.It is a significant turn of form for a player whose career has been marked out by periods of turbulence, and whose style is by its very nature often a little close to the edge. Two years ago Stones was eviscerated by television pundits after an error-prone performance during the 4-0 defeat by Everton.In January this year he was singled out as a false note again after another rickety show in the Carabao Cup semi-final.Even at the end of a fine World Cup he was blamed for Croatia’s winning goal in the semi-final, failing to track Mario Mandzukic’s goal-bound run towards the end of extra time.This is the Stones equation, a balance of marginal gains and occasional setbacks; a divvying up between his ability to play the Guardiola style and the fact he is far from a pure marker, the traditional defensive leech for whom such mistakes would negate everything else they bring to the team.There is a reason Pep Guardiola gave that famous press conference praising the stones of Stones, insisting his man would continue to play fearlessly in possession. The system demands it, and the system will win games, even with the occasional rick at the back. Concede the odd goal from a mistake: but help make four times as many at the other end by drawing opponents on and preventing counterattacks by refusing to punt it long. This is the formula of profit and loss, a system that works beautifully when Stones performs as he has for the last few weeks.It is of course about more than one man. City’s resilience in their last few games is a function of the central three-man unit Guardiola has settled on in Nicolás Otamendi’s absence. As a defensive pairing Stones and Laporte look right: one left-footed, one right- footed; both tall and athletic; both quick enough to play to a high line; both good enough on the ball to step into midfield.The interaction with Fernandinho on Sunday confirmed this feeling of solidity, and of an agreeably Pep-style fluidity. Guardiola likes Otamendi because he wins “the duels” and he likes Vincent Kompany because, well, he’s Vincent Kompany. But if we assume the league looks fairly winnable whoever City play in defence, it is easy to feel encouraged by the more dynamic potential of Stones-Laporte, the possibility that when it comes to the Champions League City might go Full Guardiola from back to front, with a genuine ball-playing defensive pair.From here Stones and Raheem Sterling will join up with England, Guardiola’s gifts to the national team, and along with Harry Kane and Harry Maguire the most improved players in this new England generation. After which City have a run of ten winnable games, with a trip to Chelsea in the league sandwiched in the middle. What heights this team can reach in the process will depend to a degree on the fine form of Laporte; and on Stones retaining that light touch, a star defensive turn who is never quite as good as those times you barely notice him."}