{"id": "\nBullying claims at Oxford ‘medieval fiefdom’ take toll on reformist dean\n", "paragraph": "The dean of Christ Church is facing a tribunal – but Martyn Percy says he doesn’t know what the charges are or who’s behind them\nHarriet Sherwood\n\nSat 17 Nov 2018 22.29 GMT\n\n\nLast modified on Sat 17 Nov 2018 23.11 GMT\n\nIt is a quintessential institution of the establishment, producing 13 British prime ministers, 10 chancellors of the exchequer and 17 archbishops. Among its former students are King Edward VII, Albert Einstein, Lewis Carroll and WH Auden. One fictional alumnus, Lord Sebastian Flyte, came to personify its privileges in the pages of Evelyn Waugh’s Brideshead Revisited.But Christ Church, one of Oxford’s most venerable colleges, was plunged into turmoil last week when its dean was suspended from duties and barred from taking services at his own cathedral after being challenged under archaic and opaque rules.A formal complaint has been filed against the Very Rev Martyn Percy with the college’s governing body. Few people know details of what is being alleged, or who is behind the move. Even Percy is largely in the dark, according to his friends.The complaint is believed to centre on issues of governance; no one is suggesting improper personal conduct. It will be heard by a tribunal, which could dismiss Percy. A date for a hearing is yet to be set.The background, according to his supporters, is the dean’s efforts to modernise the arcane management of the college and reform its pay structures. They say his opponents want to oust him in order to preserve traditional hierarchies and privileges. One described Christ Church as a “medieval fiefdom”. Another said there was “no doubt” the dean was being bullied and intimidated.Percy, who has presided over the college and cathedral for four years, is said to be deeply distressed by the complaint. He took several weeks of sick leave, and has lost a significant amount of weight, according to friends.He has also been forced to spend thousands of pounds to hire lawyers for the tribunal and could face financial ruin. Last week Percy was suspended as dean of both college and cathedral, even though the complaint relates only to his college duties. The action means he is banned from presiding over services at the cathedral in the run-up to Christmas, one of the busiest and most important times of the year.In a statement, the college’s governing body said: “Ahead of an internal tribunal, which will review a formal complaint, the dean of Christ Church, the Very Rev Professor Martyn Percy, has been suspended from his duties pending the tribunal’s outcome.“The tribunal will be held with an independent chair. As this is now a matter of legal process, it would be inappropriate to comment further until the tribunal has reached its conclusion.”The university of Oxford said the dispute was internal to Christ Church, but in a statement it described Percy as a “widely respected member of the university community”. The situation “must be deeply regrettable for all concerned”, it added.The Church of England is not involved in the tribunal and there is no question of a clergy disciplinary measure. However, reflecting the level of concern, the bishop of Oxford, Steven Croft, briefed members of the diocesan synod on Saturday.Croft said he was monitoring the situation closely. Referring to claims that Percy had been hounded by his opponents, he added: “I also want to see that any allegations of bullying are properly investigated.”The substance of the complaint has not been discussed on or off the record by anyone involved, and Percy did not respond to a request for comment, and has not spoken to the media about the matter.His supporters, however, have rallied to his defence. Angela Tilby, the author and priest who is a canon emeritus of Christ Church, said Percy had sought to speed up reform at the college. “He wanted Christ Church to be more inclusive, more open to the outside world, and, perhaps, more aware of its wealth and vested interests,” she wrote in Church Times.“No institution can truly behave as a world unto itself,” she added. Christ Church’s structure “makes for an environment in which highly intelligent individuals are not always able to retain emotional insight, and are capable of extraordinary vehemence – even calculated deception.”According to one friend: “Christ Church is full of strong egos and difficult characters. Martyn really wanted to bring about change. This is a powerful institution, making its own rules. He doesn’t even know the details of the charges against him.”He wanted Christ Church to be more inclusive, more open, more aware of its wealth and vested interestsAnother said: “When a powerful group wants you out, they will manufacture whatever they have to in order to get you out. There’s a drip-drip of innuendo combined with bombarding you with legal letters. If they don’t get you psychologically, they’ll ruin you financially.”An online drive has raised more than £37,000 to help with Percy’s legal bills. In launching the online drive, Tom Keighley said: “It is clear to me as a friend, that proper processes of natural justice have not been followed and Martyn now faces a prohibitively expensive internal tribunal.”The complaint against Percy was made to the governing body of Christ Church, made up of 64 people, mostly cathedral canons and college faculty. The tribunal will be composed of members of the governing body presided over by an independent chair.In the past, Percy has irked the Church of England hierarchy by criticising its reform programme, which he said was “driven by mission-minded middle managers” who were alienating clergy, congregations and the general public.Last year, he intervened in a row over the newly appointed bishop of Sheffield, saying Philip North’s opposition to female priests would “cause significant pastoral and public damage to the church”. Two weeks later, North stood aside.Paul Bayes, bishop of Liverpool, described him in a tweet as “a decent, kind, infuriating, magnificently mistaken, splendidly articulate, rightfully and helpfully prophetic Christian theologian.”The Charity Commission, which has oversight of Christ Church as a charitable institution, said it was aware of “issues around the governance and leadership” at the college.“Allegations of bullying are taken extremely seriously by the Commission. We expect the trustees to take meaningful steps to address the issues and keep us updated on developments,” said a spokesperson."}