{"id": "\nEverton to launch public consultation over Bramley Moore stadium project\nDominic Calvert-Lewin sparks Everton’s late demolition of Crystal Palace", "paragraph": "• ‘The People’s Project’ will canvass opinion from next month• Planning application expected to be lodged in late 2019\nAndy Hunter\n\nWed 24 Oct 2018 22.30 BST\n\n\nLast modified on Wed 24 Oct 2018 23.55 BST\n\nEverton are launching a public consultation into plans to relocate to Bramley Moore dock, with the club unlikely to borrow money via Liverpool City Council for the proposed £500m stadium and its planning application delayed for another 12 months.Everton had hoped to submit an application to build a new home on Liverpool’s waterfront by the end of this year but, mindful of planning matters on a world heritage site and the redevelopment of Goodison Park, that will not happen until late 2019.Instead, a public consultation that is essential to the planning process and the next major step in the club’s relocation will begin next month. Entitled “The People’s Project”, it will seek views from the public, senior business figures and bodies such as English Heritage over the new stadium plus the future use of Goodison.The club intend to build community facilities at their historic home when they leave rather than sell the land and will submit an outline planning application for Goodison, together with a detailed plan for Bramley Moore, late next year.Despite securing a 200-year lease on the dock site in November last year, Everton have yet to reveal any stadium designs or confirm how the construction – which is expected to have a capacity of 50,000 to 55,000 – will be paid for.Liverpool’s council announced the creation of a special purpose vehicle in March 2017 that would secure a loan of around £280m for Everton’s plans and generate millions each year for the local authority in interest and security fees. However, the club – now majority owned by the billionaire Farhad Moshiri – are likely to raise the capital through private financial institutions.While the delayed planning application will almost certainly affect Everton’s aim to start the 2022-23 season at Bramley Moore – 2023-24 is more realistic – the club believe the wait necessary to improve the prospects of success. A rejection would leave them seeking yet another stadium site having spent millions preparing for Bramley Moore which, before Everton’s interest, would not have been redeveloped for another 30 years by its owner, Peel Land & Property Limited.Colin Chong, Everton’s stadium development director, said: “We know everyone is very keen to see images of what the stadium might look like and we look forward to sharing them next year. We will abide by a careful and considered process that respects all stakeholders’ interests. This is a multi-faceted project and it is important that we do everything required to ensure our planning application, when it’s made, stands the best chance of success.“The club has already carried out a huge amount of work to get us to our current position, making sure any scheme we develop is right for the club, the fans and for the city region as a whole. This is a long and methodical process and the public consultation forms an important part of this.”"}