{"id": "\nSteve Cook drives Bournemouth past Norwich into quarter-finals\nScott Fraser keeps cool to send Burton past Forest and into last eight", "paragraph": "Press Association\n\nTue 30 Oct 2018 22.17 GMT\n\n\nLast modified on Wed 31 Oct 2018 00.31 GMT\n\nSteve Cook scored a second-half winner as Bournemouth scraped into the Carabao Cup quarter-finals with an unconvincing 2-1 win against Norwich.Cook smashed home following a corner 18 minutes from time at the Vitality Stadium to see off the dogged Championship visitors. Norwich more than matched the hosts and looked like they might cause an upset when Onel Hernández cancelled out Junior Stanislas’s first-half opener.Victory for the Cherries, who are sixth in the Premier League, maintains their unbeaten home record and puts them in the last eight of the tournament for the second successive season.Eddie Howe’s much-changed side were almost ahead inside five minutes when Jermain Defoe lashed inches wide of the right post following Marc Pugh’s pullback.In-form Norwich, who also made eight changes for the tie, had the better of the first-half play and edged possession. The Canaries – fourth in the second tier following eight wins from 10 in all competitions – threatened an opener when Felix Passlack flashed an attempt across goal following Mario Vrancic’s superb crossfield pass.But Stanislas put the hosts in front six minutes before the break. Having received the ball wide on the left from Defoe, the forward advanced into the box, bamboozled Alex Tettey with a couple of stepovers and smashed his third goal of the campaign into the roof of Michael McGovern’s net.Daniel Farke, celebrating his 42nd birthday, would have been pleased with Norwich’s response to the setback. Dennis Srbeny immediately broke clear on goal from a Vrancic pass and saw his attempt blocked by the Bournemouth goalkeeper, Artur Boruc.The midfielder Vrancic then shot agonisingly wide after tricking his way past Dan Gosling while German forward Srbeny – who scored twice in the earlier rounds of the competition – rattled the inside of the right post.Norwich continued to cause their hosts problems after the break and levelled with 20 minutes remaining. Tom Trybull lifted the ball over the Bournemouth backline and Hernández, who had earlier tested Boruc with a low shot at the near post, bobbled a finish into the bottom-left corner.Parity lasted all of two minutes though as Bournemouth sealed their place in Wednesday evening’s quarter-final draw. City failed to clear a corner and, after Pugh’s initial effort was blocked, Cook blasted through a crowded penalty area to the relief of the home fans.The visitors were given seven minutes of added time to take the match to penalties but the substitute Jordan Rhodes headed wide from an excellent late opportunity."}