{"id": "\n'They're making their own kind of world': two Mona shows challenge the visitor\nBlinded by the light: James Turrell obliterates the senses in stunning new Mona wing", "paragraph": "The new commissions play with concept and craftsmanship – but don’t expect easy answers\nSteph Harmon\n\nSat 17 Nov 2018 23.57 GMT\n\n\nLast modified on Sat 17 Nov 2018 23.59 GMT\n\nFor 24 hours on 15 October, 12 adults, 11 children and a baby transformed a cavernous, sunken gallery at Hobart’s Museum of Old and New Art into a post-apocalyptic communist utopia, set on a Dyson sphere in the year 7231.The museum was shut to the public that day, meaning the only witnesses were eight cameras and two French artists, Fabien Giraud and Raphael Siboni, who watched as their subjects battled with the encroaching forces of time, mortality and capitalism.Dressed in ye olde costumes, the characters were directed by a computer algorithm, which determined, among other things, which of them would die each hour. Like New Australia before it, this utopia was doomed from the start.Titled 7231, the resulting film is about 16 hours long, set to hypnotic strings with eerie prose narration and projected on loop. This is part two of Giraud and Siboni’s The Unmanned: an epic, ongoing art program that continues this year at Mona.In the first season, exhibited in February, the artists grappled with a history of computation in reverse through eight films you can still watch snippets of online. With the second season, the Everted Capital – a series of films and sculptures that opened this month – they’re speculating on a history of capitalism in reverse.The sculptures are finely crafted, and the film hypnotic – but it’s a conceptually difficult show, made no more accessible by the exhibition description, which describes it using words like “peculiar”, “gruelling” and “more poetry than prose”. The artists prefer it that way.“We seem to always ask ‘why?’, and ‘what is the reasons for things?’,” Giraud says, when pressed. “More than ‘why?’, I’m interested in getting people to reflect on ‘why we ask why?’.”“Our main concern is how we can change the way we think of the future, in order to change ourselves in the present,” Giraud explains, when pressed again. “Late-stage capitalism is just working on its own eschatology. It hyperventilates on its own power to destroy.”Rather than trying to save the planet by abandoning capitalism and going backwards, the artists ask what would happen if we pushed everything further, and reclaimed the future instead. “Currency entirely changed our value system and our space. So what are we going to do to currency that will change it again?” Giraud asks. “Can we just mourn the earth, and then step forward into something else?”Each season of the Unmanned has a prologue or “axiom”, and for The Everted Capital it’s another film. For this one, the artists gathered a menagerie of non-human animals that had all, at one point, been traded (including a beetle, a snake, an ostrich, an eagle), placed them in a six-metre sphere-shaped enclosure (overseen by animal handlers, I’m assured), and filmed them with a military grade thermal imaging camera.Giraud refers to it as an “ecosystem of currency”; like the rest of the exhibition, it’s hypnotic, unsettling, and difficult to immediately wrap your head around.To get from the axiom to the main room, the visitor walks through a hole in the wall that looks like it’s been punched in by a giant. The 16-hour film is projected on the back wall, in front of which lies an enormous white plinth that holds two separate collections of sculptures; adding further complication, these sculptures comprise the “axiom” and first episode of the program’s third season, titled The Form of Not.The axiom is a set of “blades”, conceived of by artificial intelligence. The artists inputted thousands of images of man-made blades into a computer program, which used that information to design millions of its own – 24 of which were exquisitely crafted by a studio in Switzerland, who constructed the 3D versions from materials such as glass, obsidian, forged iron and prehistoric bone.The second group of sculptures, Face Value, seem to hang from a complex network of rope, and burst into (and in some cases, below) the plinth; some are props from the 16-hour film, and others have been moulded from 3D prints of ancient masks – the faces represent coinage – and cuneiforms from Mona’s own collection.The artists have incorporated wax, resin, salt and mildew into each: materials that are mined and traded in the film, as the society reverts to capitalism; and which, in real life, represent both preservation and decay. The effect is a cold one in the eerie, cavernous space, even though the sculptures are in some ways alive: some drip, others crystallise, and a few are growing over with mould. (Museums being sterile environments, the artists were only allowed to bring in spores if they sealed them with plastic. “In the end, [the gallery] won,” Giraud shrugs.)Curator Nicole During has been working with the artists on the project for “a long time”, but admits she only recently began to understand “parts of it”.“I’ll never truly understand it. That’s the thrilling thing … They’re not making work like [other artists]. They’re making their own kind of world.” (The next episode of The Everted Capital will be set in 1971, and will unfold in Japan next year.)The Unmanned launched on the same day as another Mona commission, Your Shadow Rising, from British painter and sculptor Toby Ziegler.It marks the first time six exhibitions have been held over one summer at the gallery, which is still basking in the literal glow of new wing, Pharos, and its series of astounding and immersive James Turrell installations. This flurry of activity, compounded by the major show Zero, is well-timed: a public showcase of the gallery’s tourism potential, as it attempts to win DA approval for a new on-site hotel.It’s easy to find common threads between The Unmanned and Your Shadow Rising. Ziegler’s work deals in themes of fire, trauma, time and transformation, and two of his major sculptures relied, like the sculptures in the Unmanned, on 3D modelling and printing for their creation; similarly, for his exquisite corpse video series It Will Soon Be Over, Ziegler input images into an AI – in this case, reverse image search engines – and left the technology to create its own art.He refers to his work as “a negotiation between figuration and abstraction … but ultimately you want people to have to negotiate it for themselves, as well.”Challenging the visitor, or leaving them with more questions than answers, seems to fit the ethos of Mona, which is known for its unconventional – or intentionally provocative – curation.But the idea that Mona sets out to poke the art world grates on curator Durling. “We’re not trying to do things ‘outside of the box’. … I can’t make shows any other way, we can’t work with artists any other way,” she says.And don’t get her started on the museum’s “terrible” unofficial slogan, the museum of sex and death.“It took us years to live that down,” she says, with a grimace. “I don’t know who said [it first]. We use shorthand a lot, internally … and somebody said it to somebody in the media once, and off it went.” (The slogan is not entirely un-earned: when I revisit the general collection later that day I discover two seperate pieces that depict skeletons copulating.)“[Walsh] is great at summarising, condensing, distilling [ideas] into these great grabs,” she says. “Is [Mona] a reaction to other museums that he’s seen? Possibly, yeah. But also, this is authentically him.”• Fabien Giraud and Raphaël Siboni’s The Unmanned, and Your Shadow Rising by Toby Ziegler, are open now at Mona in Hobart"}