{"id": "\nFilm fans see red over Netflix ‘targeted’ posters for black viewers\n", "paragraph": "\nNosheen Iqbal\n\nSat 20 Oct 2018 22.00 BST\n\n\nLast modified on Fri 16 Nov 2018 18.34 GMT\n\nFor anyone familiar with spending an unrelaxing hour scrolling through the Netflix menu trying to work out what to watch, the idea that one of the world’s biggest media companies would personalise your viewing choices might be welcome.Binged through Making a Murderer? Try The Staircase. Enjoyed Unbreakable Kimmy Schmidt? Make your way through The Good Place. So far, so algorithmic.But now the streaming giant stands accused of being “creepy”, “racist” and “insidious” by black users fed up with Netflix’s advertising of films and shows that they claim is targeting them by ethnicity.Take the Richard Curtis ensemble romcom Love Actually, which stars Hugh Grant, Emma Thompson and Colin Firth in the leading roles. Some Netflix users are seeing the image used to advertise the film reconfigured to look like it is primarily a love story between the British actor Chiwetel Ejiofor – who plays a less prominent part – and Keira Knightley.Similarly, the murder mystery series The Good Cop was shown with its minor black characters front and centre for some, but with its principal white cast for others.On Twitter, Stacia L Brown, a writer and creator of the podcast Hope Chest, asked: “Other Black @netflix users: does your queue do this? Generate posters with the Black cast members on them to try to compel you to watch? This film stars Kristen Bell/Kelsey Grammer and these actors had maaaaaybe a 10 cumulative minutes of screen time. 20 lines between them, tops.”Underneath she posted Netflix’s promotional artwork for the film Like Father, specifically presented to her with the black actors Leonard Ouzts and Blaire Brooks.“This feels like a step too far,” said Tobi Aremu, 26, a film-maker from Brooklyn. Recently he watched the film Set It Up, “which was made to look like a two-hander between Taye Diggs and Lucy Liu, but they were secondary characters in the love story of a young white couple!”To him, the misrepresentation of Netflix’s actual offer felt problematic. “It’s beyond feeling duped,” he said. “Because if something is black, I take no offence in being catered to. I am black, give me black entertainment, give me more – but don’t take something that isn’t and try to present like it is. I wonder what the makers of those shows and films think. If it was me, I would be very upset.”Londoner Tolani Shoneye, a host on The Receipts Podcast, said: “It’s intrusive. It’s the dark side of marketing. I noticed it a while ago with a Zac Efron film that I’d already seen, but Netflix kept showing me it as a Michael B Jordan movie.”She thought it was odd at first but then assumed that everyone must be shown the same posters. To her, Netflix’s ambition to satisfy its diverse membership is failing to match up to its content. “There was 30 minutes of a romcom I ended up watching last week because I thought it was about the black couple I was shown on the poster. I want to see those stories. They know I want to see those stories. Why don’t they just make more of them?”Last December, Netflix rolled out a new algorithm to begin serving up personalised images to its now 137 million subscriber-base. “Artwork personalisation” became a priority after the company’s own research proved that it was the biggest influencing factor on a viewer deciding what to watch, constituting 82% of their focus.Multiple images are now generated for each and every title and change regularly to lure audiences depending on their tastes and previous viewing history.In a company blogpost explaining the technology, Netflix showed how the 1997 Oscar-winner Good Will Hunting would be presented to different users: for heavy romcom watchers, the poster would show Matt Damon and Minnie Driver kissing. For comedy fans, it would be a solo image of Robin Williams. There was no mention that if you watched the Wayans brothers oeuvre or Dear White People, your homepage would convince you that The Crown is a more diverse show than it is.“Netflix’s recommendation engine is second to none, and works almost seamlessly in the background,” said Tim Harrington, a senior broadcast research analyst. “But the algorithm for targeted artwork is shown as downright clunky when, say, [some] users are offered artwork for ITV’s Lewis with black actors despite both leads and almost the entire cast being white. Netflix knows a lot about you, perhaps even race, but their understanding of what to do with this information is currently rudimentary.”Netflix said: “We don’t ask members for their race, gender or ethnicity so we cannot use this information to personalise their individual Netflix experience. The only information we use is a member’s viewing history.”On Twitter, the debate continued to perplex, amuse and anger. “I bet people at the company thought it would be a cool idea and drive engagement,” wrote the Chicagoan coder @bensayingthat. “But people generally don’t like knowing they’re being treated differently because of their race – especially not in the comfort of their own homes trying to watch a movie.”"}