{"id": "'Natural protein' could reverse obesity-related diabetes, fatty liver", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Scientists from Georgetown University School of Medicine in Washington, D.C., found that raising production of the protein caused obese mice to reduce the amount of fat in their bodies even though they were genetically engineered to overeat.They did this by increasing expression of the protein's associated gene.In a paper on their work that now appears in the journal Scientific Reports, the authors describe how fibroblast growth factor binding protein 3 (FGFBP3, or BP3), \"modulates fat and glucose metabolism in mouse models of metabolic syndrome.\"\"We found,\" says senior study author Anton Wellstein, who is a professor of oncology and pharmacology at Georgetown Lombardi Comprehensive Cancer Center, \"that eight BP3 treatments over 18 days [were] enough to reduce the fat in obese mice by over a third.\"Other conditions linked to obesity were also reduced. The animals' excessive levels of blood sugar — a hallmark of diabetes known as hyperglycemia — fell, and their livers, which had been fatty, lost their fat.The researchers note that because BP3 occurs naturally in the body, therapies based on it would not have to undergo the same lengthy testing as drugs based on synthetic compounds. Clinical trials using the human equivalent could start straight after the conclusion of preclinical studies, explain the authors.Therapies based on BP3 could also have the advantage of minimal, if any, unwanted side effects; the investigators found none in the treated mice, even when they examined their tissues under a microscope.The World Health Organization (WHO) estimate that obesity rates have almost tripled worldwide since 1975.Estimates for 2016 reveal that a third of adults (1.9 billion) are overweight and that of these, 650 million have obesity.There is a similar pattern of rising obesity in children. In 1975, around 4 percent of those aged 5–19 were overweight or obese, compared with 18 percent in 2016.Obesity — especially abdominal obesity — is one of the risk factors that make up metabolic syndrome, a cluster of conditions that increase the risk of developing health problems and diseases such as diabetes, heart disease, stroke, some cancers, and nonalcoholic fatty liver disease (fatty liver).Abdominal obesity, or having a large waistline, is an indicator of too much fat around the stomach, which raises heart risk more than carrying too much fat in the rest of the body, including the hips.As metabolic syndrome increases in line with obesity, experts predict that it will supplant smoking as the primary risk factor for heart disease.BP3 belongs to a family of \"chaperone\" proteins that enhance the activity of fibroblast growth factors (FGFs) by binding to them. FGFs are present in many species, where they help control vital biological processes ranging from cell growth to tissue repair.Prof. Wellstein has been investigating the role of BP3 for some time. Increased production of BP3 occurs in some types of cancer, so he and his team decided to take a closer look at it.They discovered that BP3 attaches to three FGFs whose signaling feature in cell metabolism. Two of the FGFs help regulate the use and storage of sugars and fats. The third FGF regulates the use of phosphate.Prof. Wellstein says that increasing BP3 helps increase the signaling of these FGFs, making the protein \"a strong driver of carbohydrate and lipid metabolism.\"\"It's like having a lot more taxis available in New York City to pick up all the people who need a ride,\" he adds.\"With metabolism revved up, sugar in the blood, and fat processed in the liver are used for energy and is not stored. And warehouses of fat are tapped as well.\"Prof. Anton WellsteinYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323516.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}