{"id": "Researchers may stop Parkinson's by 'cooling off' brain", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.According to the Centers for Disease Control and Prevention (CDC), Parkinson's disease \"is the second most common neurodegenerative disease after Alzheimer's disease.\"In the United States alone, doctors diagnose approximately 50,000 cases of Parkinson's disease each year.Although it is not clear exactly what causes this disease, scientists agree that an important characteristic of Parkinson's is chronic inflammation.For this reason, researchers from the University of Queensland in Brisbane, Australia have been thinking about ways in which to counteract inflammation in the brain as a means of stopping Parkinson's from progressing.In a recent study that they conducted in mice, the scientists identified the molecule MCC950 — which, they say, was effective in blocking the disease from advancing further.\"We have used this discovery to develop improved drug candidates and hope to carry out human clinical trials in 2020,\" notes study author Trent Woodruff, an associate professor at the University of Queensland Faculty of Medicine.\"Parkinson's disease,\" explains Woodruff, \"is the second most common neurodegenerative disease worldwide, with 10 million sufferers, whose control of body movements is affected.\"\"The disease,\" he says, \"is characterized by the loss of brain cells that produce dopamine, which is a chemical that coordinates motor control, and is accompanied by chronic inflammation in the brain.\"This is the mechanism that the scientists sought to attack. They report the results of their study in a paper that appears in the journal Science Translational Medicine.Woodruff and his team were able to identify a small molecule called MCC950 that targets a key inflammasome, which is a specialized sensor that helps regulate the immune response.The inflammasome, known as NLRP3, appears to be particularly active in the brain inflammation that occurs in Parkinson's disease.\"We found,\" reports Woodruff, \"[that] a key immune system target, called the NLRP3 inflammasome, lights up in Parkinson's patients, with signals found in the brain and even in the blood.\"When they tested MCC950 in mouse models of Parkinson disease, the researchers found that it was effective in preventing further degeneration.\"MCC950, given orally once a day, blocked NLRP3 activation in the brain and prevented the loss of brain cells, resulting in markedly improved motor function,\" explains Woodruff.This finding offers new hope for people with Parkinson's disease, as none of the currently available treatments are able to prevent the progressive loss of brain cells.Prof. Matt Cooper, at the University of Queensland Institute for Molecular Bioscience, explains that most other studies that have sought a treatment to tackle underlying mechanisms in Parkinson's have focused on a completely different element.So far, he says, researchers have been targeting the accumulation of toxic proteins in the brains of people with Parkinson's disease. The current project, however, has taken a fresh approach by focusing on the harms of excessive inflammation.\"We have taken an alternative approach by focusing on immune cells in the brain called microglia that can clear these toxic proteins,\" says Prof. Cooper.\"With diseases of aging such as Parkinson's,\" he adds, \"[the] immune system can become over-activated, with microglia causing inflammation and damage to the brain.\"\"MCC950 effectively 'cooled the brains on fire,' turning down microglial inflammatory activity, and allowing neurons to function normally.\"Prof. Matt CooperIn the future, the researchers aim to continue to investigate possible ways of attacking the harmful immune response in Parkinson's disease and effectively stop it from progressing.\"With continued funding support, we are exploring new treatment strategies including repurposing drugs to target mechanisms by which the immune system and the inflammasome contribute to disease progression,\" says Richard Gordon, one of the specialists involved in this study.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323560.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}