{"id": "Nature's 'kill code' may destroy cancer", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In a study published last year, scientists led by Marcus E. Peter — the Tomas D. Spies Professor of Cancer Metabolism at Northwestern University Feinberg School of Medicine in Chicago, IL — revealed not only that certain RNA molecules can kill cancer cells, but that they can also simultaneously prevent them from becoming resistant to treatment.As Prof. Peter explained at the time, the RNA molecules destroyed cancer cells but also eradicated several genes that cancer cells needed to survive.In the researcher's own words, \"It's like committing suicide by stabbing yourself, shooting yourself, and jumping off a building all at the same time. You cannot survive.\"However, the exact mechanism that made the cancer cells \"commit suicide\" remained unknown — until now. Two new studies, led by the same Prof. Peter, uncover a code that is embedded in the RNA and microRNAs of every individual cell. The mechanism may be responsible for the cancer cells' ability to self-destruct.Chemotherapy can also trigger the toxic RNA and microRNA molecules, explain the authors, but the scientists are hoping to use the mechanism in a way that avoids chemotherapy's side effects.The first of the two studies was published in the journal eLIfe. This paper details how large RNAs can be transformed into small, toxic RNAs.The second paper, which describes how these small microRNA molecules use the \"kill code\" to destroy cancer cells, was published in Nature Communications. In last year's paper, Prof. Peter and his team found a sequence of six nucleotides contained in small RNAs that made these molecules toxic to cancer cells. A nucleotide is \"the basic structural unit and building block for DNA\" and RNA.In the first recently published study, Prof. Peter found that about 3 percent of all the large RNAs can be \"cut\" into small pieces that then act as toxic microRNAs that can kill cancer.In the second recent study, Prof. Peter's team tested almost 4,100 different possible combinations of nucleotide bases from those six initial nucleotides in an attempt to find the deadliest, most toxic combination.\"Based on what we have learned in these two studies, we can now design artificial microRNAs that are much more powerful in killing cancer cells than even the ones developed by nature,\" Prof. Peter explains. \"We absolutely need to turn this into a novel form of therapy.\"\"Now that we know the kill code, we can trigger the mechanism without having to use chemotherapy and without messing with the genome. We can use these small RNAs directly, introduce them into cells and trigger the kill switch.\"Prof. Marcus E. PeterAlthough chemotherapy can also trigger the toxic RNAs, this may have side effects such as second cancers, because such an approach changes the genome, explains Prof. Peter.However, in the two new studies, the researchers \"found weapons that are downstream of chemotherapy,\" says the study's lead investigator. This may avoid these side effects.\"My goal was not to come up with a new artificial toxic substance,\" Prof. Peter says. \"I wanted to follow nature's lead. I want to utilize a mechanism that nature developed.\"Because the cancer cannot adapt to the toxic RNAs, the findings may one day lead to an unstoppable treatment against cancer.However, the researcher cautions that it may be many years before such a treatment is a reality.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323506.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}