{"id": "Why do we stay in relationships that make us unhappy?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Unfortunately, happy romantic relationships are very familiar and often the focus of books, movies, and agony aunt columns.But why do people find it so difficult to break free of situations that they are less than enthusiastic about?One intuitive answer may be that the relationship becomes the person's \"normal,\" something that they are used to and may be afraid to trade for the unknown of singlehood.Or, perhaps, the unhappy partner is afraid that, once they break up, they will be unable to find a better partner and build a stronger, improved relationship. A new study, however, suggests that the real answer may lie elsewhere.The research was led by Samantha Joel, who collaborates with both the University of Utah in Salt Lake City and Western University in Ontario, Canada.Joel and her team's findings, which appear in the Journal of Personality and Social Psychology, suggest that a person's decision to stay in an unfulfilling relationship may arise from a place of altruism, rather than one of selfishness or insecurity.Some existing research has suggested that people may find it hard to let go of partners who make them unhappy because they are afraid of being single.Other studies note that people are more likely to stay in a relationship if they perceive that the effort their partner puts into its success matches their own.All of these motivations indicate that individuals consider, first and foremost, whether and to what extent the relationship is meeting their own needs, or is likely to meet them, in the future.However, the current study suggests that a key factor in a person's decision to stay in an unhappy relationship may actually be an altruistic one.\"When people perceived that the partner was highly committed to the relationship they were less likely to initiate a breakup,\" Joel explains.\"This is true even for people who weren't really committed to the relationship themselves or who were personally unsatisfied with the relationship,\" she adds. \"Generally, we don't want to hurt our partners and we care about what they want.\"So, from where does this consideration stem? Joel believes that when we perceive our partner to be fully committed to our relationship, even though we, ourselves, are not, this may lead us to project hopes for the future.Thus, an unhappy partner may choose to give the relationship a second chance in the hope that they may be able to rekindle the romance at some point. However, this hope could well be unfounded.\"One thing we don't know is how accurate people's perceptions are,\" says Joel, adding:\"It could be the person is overestimating how committed the other partner is and how painful the breakup would be.\"Joel notes that while there is a chance that the relationship will improve, which may make it worth the gamble, the opposite may actually happen, and the couple's life together may further deteriorate, thus prolonging the agony.Furthermore, even if the other partner is truly loving and committed, the researchers ask if it is ever worth staying in a relationship when we have misgivings about its future.After all, \"[w]ho wants a partner who doesn't really want to be in the relationship?\" Joel emphasizes.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323437.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}