{"id": "What's the best way to get rid of a bunion?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Bunions can cause intense pain and may increase the risk of other foot problems. Research estimates that up to 23 percent of adults between the ages of 18 and 65 and 35 percent of people over 65 have bunions.Surgery aims to:This article describes what to expect before, during, and after the procedure. It also includes alternative treatments to bunion removal.A doctor will select the type of surgery, depending on a person's symptoms, the shape and size of their bunion, and other factors.Types of bunion repair involve:Repairing tendons and ligamentsIf tight or loose soft tissues are causing the bunion to form, a surgeon may loosen tight tendons and ligaments or tighten loose ones.This procedure is usually in addition to others.OsteotomyThe surgeon cuts into the bone and places pins, screws, or plates into the openings. These devices help to keep the toe straight and reduce misalignment.It may sometimes be necessary to remove a small portion of bone.ExostectomyPeople typically have an exostectomy in conjunction with other types of surgery, such as soft tissue removal and an osteotomy. Exostectomy involves removing the bony bump from the big toe.The bunion will often return if a doctor performs an exostectomy on its own because this surgery does not correct the underlying cause.ArthrodesisThe doctor will remove areas of arthritic joints before using plates, screws, or wires to hold the surfaces together. People with arthritis or severe bunions often undergo this type of surgery.Resection arthroplastyThe surgeon removes areas of damage from the joint to provide more space between the bones, during this type of bunion removal.A resection arthroplasty can reduce power in the big toe. It is, therefore, typically for older adults, people with arthritis that an arthrodesis may not treat, and people who have unsuccessfully had other forms of bunion surgery.Before surgery, a doctor may request the following tests:People should aim to be in good health before undergoing a bunion removal, or any other type of surgery. To maintain good health before surgery, people should:A doctor can advise patients about any medications they are taking. It may be necessary to stop taking some types of medication, such as aspirin or warfarin, before having surgery.The doctor will also explain how long to fast (avoid food or liquids) before surgery. This typically depends on the type of anesthesia a person will have, and the length of time the operation will take.A doctor will administer anesthesia, either local or general, before they begin. A general anesthetic means the person is unconscious for the procedure. Most people, however, have a local anesthetic, which numbs them below the ankle.Once the anesthetic has taken effect, the surgeon will perform the surgery. Individuals who are preparing for bunion surgery should ask their doctor for specific details on the type of surgery they will have.Afterward, the surgeon will then apply a bandage to the foot. Patients will go to the recovery room where staff will monitor them carefully. Until the anesthesia wears off, the team will observe the following :Most people can go home a few hours after their surgery. They will need to organize transport home before going to the hospital, as people should not drive themselves after general anesthesia.A doctor will provide instructions on recovery, and it is important to follow these steps carefully to speed up healing and avoid complications.People may need to:People can begin to place weight back on their foot over time, according to their doctor's instructions. They may be able to drive after 1 to 2 weeks.A doctor will typically remove the stitches after 2 weeks, but people may have to continue to wear dressings or a foot brace for 6 to 12 weeks. It can be up to a year before a person makes a full recovery and their foot returns to its regular size.During this time, individuals may have several follow-up appointments with their doctor, as well as one or more X-rays of the foot to check if the surgery was successful.It is essential that individuals wear supportive and appropriate footwear to prevent bunion recurrence and avoid complications.Some people may never be able to wear high heels or shoes with tight toe boxes again. A 2016 study in the Journals of Gerontology suggests that wearing constrictive footwear between the ages of 20 and 39 years old may be a risk factor for the development of bunions.During the recovery period, people should contact a doctor if any of the following occur:Doctors will usually only recommend surgery when the condition is severe or when other treatments do not work.People who are unable to undergo bunion removal, or those who do not wish to do so, may find relief from the following:According to the American Academy of Orthopedic Surgeons, most people who have bunion surgery will notice an improvement in their symptoms, including a reduction in pain and better alignment of the big toe.Some research from 2012 suggests that proper surgical treatment offers a good or very good outlook for 85 percent of people and a satisfactory outcome in another 10 percent of those who have the procedure. Article last reviewed by Fri 19 October 2018.Visit our Bones / Orthopedics category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Bones / Orthopedics.All references are available in the References tab.\t\t\nHaddad, S. L. (2016, February). Bunion surgery. Retrieved from https://orthoinfo.aaos.org/en/treatment/bunion-surgery/Menz, H. B., Roddy, E., Marshall, M., Thomas, M. J., Rathod, T., Peat, G. M., & Croft, P. R. (2016, December 14). Epidemiology of shoe wearing patterns over time in older women: Associations with foot pain and hallux valgus. Journals of Gerontology: Series A, 71(12), 1682–1687. Retrieved from https://academic.oup.com/biomedgerontology/article/71/12/1682/2513750Wülker, N., & Mittag, F. (2012, December 7). The treatment of hallux valgus. Deutsches Ärzteblatt International, 109(49), 857–868. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3528062/Please use one of the following formats to cite this article in your essay, paper or report:MLALeonard, Jayne. \"What's the best way to get rid of a bunion?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323391.php>APALeonard, J. (2018, October 19). \"What's the best way to get rid of a bunion?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323391.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323391.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}