{"id": "What to know about cardiac tamponade", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In people with cardiac tamponade, also known as pericardial tamponade, fluid or blood builds up between the heart and the sac that surrounds the heart. This sac is called the pericardium.The pericardium consists of two thin layers of tissue. This area usually contains a small amount of fluid to prevent friction between the layers.However, an abnormally high level of fluid puts pressure on the heart and affects its ability to pump blood around the body properly. If the level of fluid builds up quickly, it can be life-threatening.Doctors consider cardiac tamponade to be a medical emergency.In this article, we discuss the causes and symptoms of cardiac tamponade. We also describe the treatment options and the outlook for people with this condition.Cardiac tamponade results from the buildup of fluid between the layers of the pericardium. In acute cardiac tamponade, this fluid accumulation occurs quickly, while it happens slowly in subacute cardiac tamponade.The most common causes of cardiac tamponade are:Complications arising from heart surgery may also cause cardiac tamponade.According to some research, cardiac tamponade is the cause of surgical reintervention in 0.1–6.0 percent of cardiac surgery cases.Cardiac tamponade impairs the ability of the heart to pump blood around the body. As a result, blood does not circulate properly, which can lead to chest pains and lightheadedness.The three classic signs of cardiac tamponade, which doctors refer to as Beck's triad, are:People with cardiac tamponade may also experience the following symptoms:To diagnose cardiac tamponade, a doctor will look for Beck's triad of medical signs. They will do this by checking the individual's blood pressure, listening to their heart, and examining the appearance of their veins.The doctor is likely to carry out additional tests to support their diagnosis. These may include:The doctor may order blood tests to measure the levels of red and white blood cells too. Blood tests may also detect higher levels of specific enzymes that the body releases in response to damage to the heart muscle.Cardiac tamponade is not a common condition, but it can affect anyone.A 2018 study reports 5 cases of cardiac tamponade per 10,000 hospital admissions (0.05 percent) in the United States.People with certain medical conditions are more likely than the general population to experience cardiac tamponade, including people with:As cardiac tamponade can result in shock or death, it always requires emergency medical treatment. This treatment involves draining excess fluid from around the heart.A doctor may use the following methods to remove the fluid and reduce the pressure on the heart:According to some research, doctors should choose minimally invasive procedures, such as pericardiocentesis, as the first treatment option. Such options carry a less significant risk of complications and have lower mortality rates.However, more complicated cases of cardiac tamponade will often require surgery, including a thoracotomy.After surgery, the individual may receive the following as they stabilize:Once the person is stable, the doctor will need to determine and treat the underlying cause of the cardiac tamponade to prevent further complications.The outlook for people with cardiac tamponade depends on:People with a non-cancerous cause of cardiac tamponade have a mortality rate of less than 15 percent.Cases in which cancer is the underlying cause have an estimated mortality rate of 80 percent within 1 year.Mortality rates are also higher among those who have sepsis, acute kidney injury, or chest injury.Prompt diagnosis and early treatment significantly improve the outlook for people with cardiac tamponade. Without treatment, the condition is fatal.It is not possible to prevent all cases of cardiac tamponade. However, people can reduce their risk by doing the following:Cardiac tamponade is an uncommon but severe medical condition that can result in shock or death. It is vital that anyone who suspects that they have cardiac tamponade seeks emergency treatment.The treatment for cardiac tamponade involves draining the excess fluid from the pericardium, stabilizing blood pressure, and treating the underlying cause.People who receive prompt diagnosis and appropriate treatment generally have a better outlook.Although it is not possible to prevent all cases of cardiac tamponade, people should be aware of their risk factors and discuss preventive methods with their doctor. Article last reviewed by Tue 23 October 2018.Visit our Cardiovascular / Cardiology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Cardiovascular / Cardiology.All references are available in the References tab.\t\t\nAl-Ogaili, A., Ayoub, A., Fugar, S., Kolkailah, A., Rios, L. P., & Fuentes, H. (2018, March). Cardiac tamponade incidence, demographics and in-hospital outcomes: Analysis of the national inpatient sample database [Abstract]. Journal of the American College of Cardiology, 71(11 Suppl.). Retrieved from http://www.onlinejacc.org/content/71/11_Supplement/A1155Gumrukcuoglu, H. A., Odabasi, D., Akdag, S., & Ekim, H. (2011, September 20). Management of cardiac tamponade: A comperative study between echo-guided pericardiocentesis and surgery — a report of 100 patients. Cardiology Research and Practice, 2011. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3177087/Leiva, E. H., Carreño, M., Bucheli, F. R., Bonfanti, A. C., Umaña, J. P., & Dennis, R. J. (2018, April–June). Factors associated with delayed cardiac tamponade after cardiac surgery. Annals of Cardiac Anaesthesia, 21(2), 158–166. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5914216/Stashko, E., & Meer, J. M. (2018, September 25). Cardiac tamponade. Retrieved from https://www.ncbi.nlm.nih.gov/books/NBK431090/Please use one of the following formats to cite this article in your essay, paper or report:MLALeonard, Jayne. \"What to know about cardiac tamponade.\" Medical News Today. MediLexicon, Intl., 23 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323429.php>APALeonard, J. (2018, October 23). \"What to know about cardiac tamponade.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323429.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323429.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}