{"id": "What is melasma?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The most common areas for melasma to appear on the face include:Melasma may also appear on other areas of the body, especially those exposed to a lot of sunlight. These areas may include:According to the American Academy of Dermatology, only 10 percent of all cases of melasma occur in men. Women with darker complexions and who are pregnant are at greater risk of developing melasma.Doctors do not fully understand why melasma occurs. It may be due to the malfunction of the melanocytes (the color-making cells) in the skin, causing them to produce too much color.As a result, people with darker skin tones are more likely to develop melasma, as they have more melanocytes than people with lighter skin.Potential triggers for melasma include:Also, there may be a genetic component to melasma, as people whose close relatives have experienced melasma are more likely to develop it themselves.The primary symptom of melasma is the development of discolored patches of skin. While it does not cause any other physical symptoms, some people find the appearance of these patches bothersome.The most common area for patches of melasma to appear is the face. Common locations include the upper lips, bridge of the nose, cheeks, and forehead.Less commonly, a person may also have patches on their arms and neck.Dermatologists find most cases of melasma easy to diagnose during a visual examination. However, since melasma can resemble other skin conditions, a dermatologist may take a small biopsy during the initial visit.A biopsy involves removing a very small portion of the skin for further examination in a laboratory.A doctor may also use a device called a Wood's light to look more closely at the skin.Treatment is not always necessary for melasma.If hormonal changes, such as those that occur during pregnancy or while taking birth control pills, have caused melasma, it will fade after delivery or once a person stops taking the pills.For other people, melasma can last for years or even for the rest of their lives. If melasma does not fade over time, a person can seek treatment to help remove or fade the patches.However, not all treatments work for everyone, and melasma may come back even after successful treatment.Treatment options for melasma include:Doctors often use hydroquinone as the first line of treatment for melasma. Hydroquinone is available as a lotion, cream, or gel.A person can apply the hydroquinone product directly to the patches of skin that are discolored.Hydroquinone is available over the counter, but a doctor can also prescribe stronger creams. Hydroquinone works by lightening the color of the skin patches.Corticosteroids and tretinoin come in creams, lotions, or gels. Both corticosteroids and tretinoin can help lighten the color of the melasma patches.In some cases, a dermatologist may choose to prescribe combination creams that may contain hydroquinone, corticosteroids, and tretinoin in one. These are called triple creams.In addition to or instead of other medicated creams, a dermatologist may also prescribe azelaic acid or kojic acid. These acids work to lighten the dark areas of skin.If topical medications do not work, a dermatologist may recommend procedures such as:Some of these treatment options have side effects or may cause additional skin problems. It is best to speak with a doctor or dermatologist about all the possible risks.If a person has had melasma before, they can try to avoid triggers by:Melasma causes dark patches to form on the skin, most often on the face. While these skin changes are harmless, some people may find them bothersome.Treatment is effective for some people. Melasma that is due to hormonal changes may also fade over time, once hormone levels return to normal. Article last reviewed by Fri 16 November 2018.Visit our Dermatology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Dermatology.All references are available in the References tab.\t\t\nMelasma: Diagnosis and treatment. (n.d.). Retrieved from https://www.aad.org/public/diseases/color-problems/melasma#treatmentMelasma. (n.d.). Retrieved from https://www.asds.net/Skin-Experts/Skin-Conditions/MelasmaMelasma: Signs and symptoms. (n.d.). Retrieved from https://www.aad.org/public/diseases/color-problems/melasma#symptomsMelasma: Who gets and causes. (n.d.). Retrieved from https://www.aad.org/public/diseases/color-problems/melasma#causesPandya, A. G. (n.d.). Melasma. Retrieved from http://skinofcolorsociety.org/dermatology-education/1406-2/Please use one of the following formats to cite this article in your essay, paper or report:MLAFletcher, Jenna. \"What is melasma?.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323715.php>APAFletcher, J. (2018, November 16). \"What is melasma?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323715.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323715.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}