{"id": "Does the hCG diet work?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Furthermore, the United States Food and Drug Administration (FDA) advise that people avoid using hCG supplements for weight loss.In this article, we discuss the hCG diet and weigh up the evidence for and against its use.Human chorionic gonadotropin or hCG is a hormone that the female body produces during pregnancy to help the embryo and fetus develop. Doctors sometimes prescribe hCG injections for treating fertility issues in women and hormone problems, such as hypogonadism, in men.The hCG diet first became popular in the 1950s. Its promoters claim that taking hCG can reduce feelings of hunger and support weight loss by redistributing body fat from the thighs, stomach, and hips.According to the FDA, popular diet products containing hCG state that they reset the body's metabolism and fix \"abnormal eating habits.\"Manufacturers of these products also claim that the hCG diet promotes weight loss of up to a pound a day. However, there is no scientific evidence to back up these claims.According to a commentary published in the International Journal of Obesity, no research has shown that the hCG hormone has any effects on weight loss. Furthermore, it may be unsafe for some people and in certain doses.Experts say that the hCG diet is neither safe nor effective. The FDA advise people to avoid any over-the-counter (OTC) products that say they contain hCG.Although the FDA has approved hCG as a prescription medicine for treating fertility issues, they have not approved it as an aid for weight loss. Furthermore, the FDA have not approved hCG in any form for OTC sale.The use of hCG can cause a range of potential side effects, including:Another worrying aspect of the hCG diet is that its promoters often recommend people severely restrict their calorie intake to around 500 calories a day.Although a very-low-calorie diet (VLCD) may promote weight loss, it puts people at risk of potentially serious side effects, including:A 2015 review identified 12 studies that reported that weight loss was no greater in people on a VLCD who took hCG compared to those on a VLCD who took a placebo. The researchers concluded that hCG:People who follow the hCG diet typically limit their calorie intake to around 500 a day. They also take hCG shots, oral drops, or sprays. These diet products are available OTC and manufacturers market them as being \"homeopathic.\"Most people on the diet eat two meals a day, namely, lunch and dinner. Each meal includes:Examples of food options include:Those following the diet can drink unlimited amounts of water, tea, and coffee, and they may use sugar substitutes.Foods to avoid on the hCG diet include:There are several distinct phases to the hCG diet:In the U.S., it is illegal to sell OTC products containing hCG. This restriction also includes homeopathic hCG products.As a result of suppliers breaking this law, the FDA and Federal Trade Commission (FTC) have issued seven warning letters to companies that market products, claiming to contain the hormone.These companies are violating the Federal Food, Drug, and Cosmetic Act and the Federal Trade Commission Act.The hCG hormone is legal when a doctor prescribes it in injection form. The FDA approves hCG for female infertility and male hormone treatments.Sometimes, doctors may prescribe hCG for unapproved weight-loss purposes. There is no evidence to suggest this is effective, and it may cause several adverse reactions.There is no evidence to support taking hCG to promote weight loss, but using the hormone may cause side effects.According to research, reported side effects of hCG include:Taking hCG can also affect the result of pregnancy tests, which work by detecting hCG in a person's urine.Another potential risk can occur during a medical emergency if doctors are unaware of the person's hCG diet.If a doctor tests a female for pregnancy, the hCG may give a positive test result, but an ultrasound will reveal no fetus. Doctors may then assume it is an ectopic pregnancy, which is a surgical emergency.Severe calorie restriction can also cause adverse effects, such as:Those who experience side effects from following the hCG diet or using hCG supplements should see their doctor immediately.Also, the FDA recommend that people should only undertake a VLCD under proper medical supervision.The hCG diet combines the use of hormone supplements and severe calorie restriction to support weight loss. However, there is no research to support this diet being either safe or effective.In the U.S., hCG is a prescription-only drug and companies that market hCG products for weight loss are breaking the law.While people following the hCG diet may initially lose weight, this appears to be entirely due to the severe calorie restriction, rather than the effects of the hormone. Eating just 500 calories a day is neither healthy nor sustainable, and it can cause serious adverse effects.People who wish to lose weight should speak to a doctor or dietician for advice and information. Usually, healthcare professionals recommend reducing calorie intake to 1,200 to 1,800 calories a day while increasing physical activity.However, these measures may not be suitable for everyone, so it is essential that people speak to a professional before making significant dietary or lifestyle changes. Article last reviewed by Fri 19 October 2018.Visit our Nutrition / Diet category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Nutrition / Diet.All references are available in the References tab.\t\t\nHCG diet products are illegal. (2013, September 20). Retrieved from https://www.fda.gov/ForConsumers/ConsumerUpdates/ucm281333.htmJohansson, K., Sundström, J., Marcus, C., Hemmingsson, E., & Neovius, M. (2014). Risk of symptomatic gallstones and cholecystectomy after a very-low-calorie diet or low-calorie diet in a commercial weight loss program: 1-year matched cohort study. International Journal of Obesity, 38(2), 279–284. Retrieved from https://www.nature.com/articles/ijo201383.pdfKanter, J. R., Pollitzer, C., Rao, A. S., Servy, E. J., Massey, J., & Gavrilova-Jordan, L. (2017, November 1). Intrauterine injection of HCG to enhance embryo implantation. Fertility and Sterility, 108(3), e370–e371. Retrieved from https://www.fertstert.org/article/S0015-0282(17)31604-7/fulltextLovejoy, J. C., & Sasagawa, M. (2011, October 4). An unfortunate resurgence of human chorionic gonadotropin use for weight loss. International Journal of Obesity, 36(3), 385–386. Retrieved from https://www.nature.com/articles/ijo2011188Parikh, H., Thomas, L., English, R., Raguckas, C., & Shi, Q. (2015, December 3). Acute multiple deep venous thrombosis (DVTs) as a probable adverse event of the use of human chorionic gonadotropin (HCG) for weight loss. Blood, 126(23), 4725. Retrieved from http://www.bloodjournal.org/content/126/23/4725?sso-checked=trueQuestions and answers on HCG products for weight loss. (2016, May 4). Retrieved from https://www.fda.gov/drugs/resourcesforyou/consumers/buyingusingmedicinesafely/medicationhealthfraud/ucm281834.htmPlease use one of the following formats to cite this article in your essay, paper or report:MLALeonard, Jayne. \"Does the hCG diet work?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323390.php>APALeonard, J. (2018, October 19). \"Does the hCG diet work?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323390.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323390.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}