{"id": "Cancer ribbon colors: A guide", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.There are many different types of cancer ribbons, each with their own symbolic color. In this article, we list all the cancer ribbon colors and their purposes, as well as specific cancer awareness months.Color: White and burgundyHead and neck cancer incorporates a range of different cancers, including cancer of the:The Head and Neck Cancer Alliance note that alcohol and tobacco use are two of the most significant risk factors for these types of cancer.April is Head and Neck Cancer Awareness Month.Color: BurgundyMultiple myeloma is cancer that affects the plasma cells. The American Cancer Society estimate there will be over 30,000 new cases of multiple myeloma in 2018.March is Myeloma Awareness Month when people and organizations help spread the word and raise money for research.Color: OrangeLeukemia is a form of blood cancer that usually starts in the bone marrow. The Leukemia and Lymphoma Society state that the 5-year survival rate for leukemia has more than quadrupled since 1960. The improvement in the outlook may be due to increased awareness of the disease and advances in medication.September is Leukemia Awareness Month. Leukemia also shares the orange ribbon with kidney cancer.Color: OrangeKidney cancer is one of the 10 most common cancers in the United States. It is more common in older people, and more men than women tend to develop it. While it is not possible to prevent all cases of kidney cancer, obesity, and smoking increase a person's risk.March is Kidney Cancer Awareness Month.Color: PinkProbably, the most well-known cancer ribbon is the pink ribbon that indicates breast cancer. Researchers and organizations use or wear pink throughout their numerous campaigns to highlight their stand against breast cancer.October is Breast Cancer Awareness Month. Organizations, such as the Breast Cancer Research Foundation and the National Breast Cancer Foundation constantly work towards finding a cure for breast cancer and help support those going through treatment.Color: PeachEndometrial cancer most commonly affects women after menopause, with an average age of 60 at the time of diagnosis, according to the American Cancer Society.September is Gynecological Cancer Awareness Month. During that month, many campaigners come together to raise awareness for preventative testing and funds for research.Color: AmberAn amber ribbon is the sign of support for those battling appendix cancer. Appendix cancer is rarer than many other cancers.According to one study, there are only about 1.2 cases of appendix cancer per 100,000 people in the U.S.There is currently no specific awareness month for appendix cancer.Color: GoldA gold ribbon represents all cancers that occur during childhood.Organizations, such as the American Childhood Cancer Organization, campaign all year round to spread awareness and raise money to support children fighting cancer.September is Childhood Cancer Awareness Month.Color: YellowA yellow ribbon represents sarcoma or bone cancer. Bone cancer also affects the connective tissues of the body, such as the cartilage or myofascial tissue.Organizations, such as the Sarcoma Foundation of America, help fund research and increase awareness about the disease.July is Sarcoma Awareness Month.Color: Lime greenNon-Hodgkin lymphoma affects the lymphatic system. As the Leukemia & Lymphoma Society note, around 85 percent of cases start in B lymphocytes, which help produce the antibodies that fight infection.Lymphoma and leukemia are two separate forms of cancer that are commonly grouped together because they both affect the blood.September is World Lymphoma Awareness Month, which supports people with non-Hodgkin lymphoma and other forms of blood and lymph cancer.Color: Emerald greenAccording to the American Liver Foundation, about 30,000 people receive a liver cancer diagnosis each year. It affects nearly twice as many men as women.October is Liver Cancer Awareness Month when foundations and charities help raise awareness for testing and funds for research.Color: TealAccording to the National Ovarian Cancer Coalition, ovarian cancer is the fifth leading cause of cancer deaths in women aged 35–74. Researchers estimate that one in 75 women will experience ovarian cancer during their lifetimes.September is Ovarian Cancer Awareness Month. However, May 8th is also World Ovarian Cancer Day, when people around the globe spread awareness of ovarian cancer.Color: White and tealThanks to early preventive screenings, more people are surviving cervical cancer than ever before. According to the Foundation for Women's Cancer, regular tests, such as the Pap smear, have reduced deaths from the disease by more than 70 percent.January is Cervical Cancer Awareness Month.Color: Light blueThe Prostate Cancer Foundation estimate that 1 in nine men in the U.S. will receive a prostate cancer diagnosis in their lifetime.Routine screening beginning around 50 years old may help detect prostate cancer early and avoid serious complications.September is Prostate Cancer Awareness Month where organizations promote preventative testing and help raise funds for developing new treatments.Color: Dark blueColon cancer affects the large intestine. People with forms of irritable bowel disease, such as Crohn's or colitis, have a higher risk of developing this type of cancer.Regular screening for polyps and signs of cancer has led to an improvement in survival rates in recent years. When doctors treat colon cancer in its early stages, the 5-year survival rate is 90 percent.March is Colorectal Cancer Awareness Month.Color: Periwinkle blueA soft, powdery-blue ribbon is a sign of support for those living with stomach or gastric cancer. The organization No Stomach For Cancer note that stomach cancer still receives little attention, even though it is the third leading cause of cancer deaths globally.November is Stomach Cancer Awareness Month, which is vital for promoting greater public knowledge of the disease and raising funds for research.Color: Light purpleTesticular cancer is the most widespread cancer in males between 15 and 44 years old, according to the Testicular Cancer Awareness Foundation.An essential tool for catching this type of cancer in the early stages is regular self-examination.April is Testicular Cancer Awareness Month.Color: PurplePancreatic cancer is difficult to diagnose in the early stages, as there are no preventive screening tests available.Pancreatic cancer uses a purple ribbon as a tribute to one woman's love for her mother. A woman named Rose Schneider, whose favorite color was purple, died after battling pancreatic cancer. Her daughter, finding little formal support in her time of need, worked to found the Pancreatic Cancer Action Network (PanCan) to support people with pancreatic cancer.November is Pancreatic Cancer Awareness Month. During this month, PanCan and other organizations, such as the National Pancreatic Cancer Foundation, work together to raise awareness and funds for pancreatic cancer research.Color: LavenderA lavender ribbon is usually a sign of support for those living with all types of cancer. Sometimes, people wear a rainbow of ribbons or a ribbon with many different colors to symbolize the same thing.National Cancer Prevention Month and World Cancer Day take place in February each year.Color: VioletHodgkin lymphoma is a form of lymphoma or blood cancer where the cancer starts in the lymph nodes.As the Leukemia & Lymphoma Society note, Hodgkin lymphoma is one of the most curable forms of cancer.September is World Lymphoma Awareness Month.Color: BlackAccording to the Melanoma Research Foundation, skin cancer is the most common form of cancer in the U.S. Every hour, one person in America dies from melanoma, the deadliest form of skin cancer.May is Skin Cancer Awareness Month. People can also wear a black ribbon to promote regular skin checks and preventive screenings.Color: Zebra printCarcinoid cancer is not as well-known as other cancers. Carcinoid cancer grows very slowly, commonly appearing in the small intestines and bronchial system in the lungs, according to the American Association for Cancer Research.Some people experience little to no symptoms for a long time, though carcinoid cancer can still be life-threatening.November is Carcinoid Cancer Awareness Month.Color: GreyPossibly a reflection of a person's \"grey matter,\" a grey ribbon promotes brain cancer awareness.The National Brain Tumor Society estimate that approximately 688,000 people in the U.S. are living with a brain or central nervous system tumor. While the majority of these tumors are benign, about 37 percent are cancerous.May is Brain Cancer Awareness Month.Color: White or pearlLung cancer is by far the leading cause of cancer deaths. It is responsible for about 27 percent of all cancer-related deaths, according to the International Association for the Study of Lung Cancer (IASLC).November is Lung Cancer Awareness Month, though other organizations, such as the IASLC, work year-round to raise funds for lung cancer research.Color: Blue, yellow, and purpleCancer of the bladder uses a blue, yellow, and purple ribbon for recognition. The American Bladder Cancer Society state that bladder cancer accounts for up 5 percent of all cancer cases. Men are more likely to develop it than women.May is Bladder Cancer Awareness Month.Color: Blue, pink, and tealDoctors will diagnose an estimated 53,990 new cases of thyroid cancer in 2018, according to the American Cancer Society.September is Thyroid Cancer Awareness Month, when organizations, such as the American Thyroid Association, promote their work to spread awareness and support for people with thyroid cancer.Wearing a specific color or ribbon can help people show their support for a friend or loved one, or even help them discuss their own cancer diagnosis with others.Participating in awareness campaigns, just by wearing a ribbon, can help keep the public informed about cancer research and promote funding for new treatments. Article last reviewed by Wed 24 October 2018.Visit our Cancer / Oncology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Cancer / Oncology.All references are available in the References tab.\t\t\nA review of carcinoid cancer. (2012, July). Retrieved from https://www.carcinoid.org/for-patients/general-information/a-review-of-carcinoid-cancer/About BCRF. (n.d.). Retrieved from https://www.bcrf.org/aboutAbout World Ovarian Cancer Day. (n.d.). Retrieved from https://ovariancancerday.org/about/American Thyroid Association.(n.d.). Retrieved from https://www.thyroid.org/Bladder cancer statistics. (n.d.). Retrieved from https://www.bladdercancersupport.org/bladder-cancer-facts/statistics.htmlCervical cancer. (n.d.). Retrieved from https://www.foundationforwomenscancer.org/types-of-gynecologic-cancers/cervical/Childhood Cancer Awareness Month. (n.d.). Retrieved from https://www.acco.org/childhood-cancer-awareness-month/Determine your risk — and practice prevention. (n.d.). Retrieved from https://www.ccalliance.org/colorectal-cancer-information/statistics-risk-factorsFacts and statistics. (n.d.). Retrieved from https://www.lls.org/http%3A/llsorg.prod.acquia-sites.com/facts-and-statistics/facts-and-statistics-overview/facts-and-statistics?Kelly, K. J. (2015, December). Management of appendix cancer. Clinics in Colon and Rectal Surgery, 28(4), 247–255. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4655112/Key statistics about kidney cancer. (2018, January 4). Retrieved from https://www.cancer.org/cancer/kidney-cancer/about/key-statistics.htmlKey statistics about multiple myeloma. (2018, February 28). Retrieved from https://www.cancer.org/cancer/multiple-myeloma/about/key-statistics.htmlKey statistics for endometrial cancer. (2018, January 4). Retrieved from https://www.cancer.org/cancer/endometrial-cancer/about/key-statistics.htmlKey statistics for thyroid cancer. (2018, January 4). Retrieved from https://www.cancer.org/cancer/thyroid-cancer/about/key-statistics.htmlLiver cancer. (n.d.). Retrieved from https://liverfoundation.org/for-patients/about-the-liver/diseases-of-the-liver/liver-cancer/Lung Cancer Awareness Month. (n.d.). Retrieved from https://www.iaslc.org/lcamLymphoma. (n.d.). Retrieved from https://www.lls.org/lymphomaMelanoma facts and stats. (n.d.). Retrieved from https://www.melanoma.org/understand-melanoma/what-melanoma/melanoma-facts-and-statsNational Brain Tumor Society. (n.d.). Retrieved from https://braintumor.org/brain-tumor-information/National Breast Cancer Foundation, Inc. (n.d.). Retrieved from https://www.nationalbreastcancer.org/National Pancreatic Cancer Foundation. (n.d.). Retrieved from https://www.npcf.us/Non-Hodgkin lymphoma. (n.d.). Retrieved from https://www.lls.org/lymphoma/non-hodgkin-lymphoma?src1=20045&src2=Oral, head and neck cancer awareness week. (n.d.). Retrieved from https://www.entnet.org/OHANCAWPancreatic Cancer Action Network. (n.d.). Retrieved from https://www.pancan.org/Periwinkle Global. (n.d.). Retrieved from https://www.nostomachforcancer.org/who-we-are/what-we-do/periwinkle-globalSarcoma Foundation of America. (n.d.). Retrieved from https://www.curesarcoma.org/Shedding light on carcinoid cancer. (n.d.). Retrieved from https://www.aacrfoundation.org/Pages/Carcinoid-Cancer-Awareness-Month.aspxStatistics and risk factors. (2018, February 14) Retrieved from https://www.testicularcancerawarenessfoundation.org/statistics-risk-factors/Understanding pancreatic cancer.(n.d.). Retrieved from https://www.npcf.us/about-pc/understanding-pancreatic-cancer/What causes cancers of the head and neck. (n.d.). Retrieved from https://www.headandneck.org/risk-factors/What is ovarian cancer? (n.d.). Retrieved from https://ovarian.org/about-ovarian-cancer/what-is-ovarian-cancerWhat is prostate cancer? (n.d.). Retrieved from https://www.pcf.org/about-prostate-cancer/what-is-prostate-cancer/Please use one of the following formats to cite this article in your essay, paper or report:MLAJohnson, Jon. \"Cancer ribbon colors: A guide.\" Medical News Today. MediLexicon, Intl., 24 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323448.php>APAJohnson, J. (2018, October 24). \"Cancer ribbon colors: A guide.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323448.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323448.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}