{"id": "What is medicine?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Medicine aims to promote and maintain health and wellbeing.Conventional modern medicine is sometimes called allopathic medicine. It involves the use of drugs or surgery, often supported by counseling and lifestyle measures.Alternative and complementary types of medicine include acupuncture, homeopathy, herbal medicine, art therapy, traditional Chinese medicine, and many more.Modern medicine has many fields and aspects. Here are some of them.A clinician is a health worker who works directly with patients in a hospital or other healthcare setting. Nurses, doctors, psychotherapists, and other specialists are all clinicians.Not all medical specialists are clinicians. Researchers and laboratory workers are not clinicians because they do not work with patients.The physician assesses the individual, with the aim of diagnosing, treating, and preventing disease using knowledge learned from training, research, and experiences, and clinical judgment.This area of science seeks ways to prevent and treat diseases that lead to illness or death.Biomedical scientists use biotechnology techniques to study biological processes and diseases. They aim to develop successful treatments and cures.Biomedical research requires careful experimentation, development, and evaluation. It involves biologists, chemists, doctors, pharmacologists, and others.This field looks at drugs or medicines and how to use them.Doctors and other health professionals use medications in the medical diagnosis, treatment, cure, and prevention of disease.Surgical procedures are necessary for diagnosing and treating some types of disease, malfomation, and injury. They use instrumental and manual means rather than medication.A surgeon may carry out a surgical procedure to remove or replace diseased tissue or organs, or they may use surgery to remove tissue for biopsy. Sometimes, they remove unwanted tissue and then send it for diagnosis.Health professionals use a wide range of instruments to diagnose and treat a disease or other condition, to prevent a worsening of symptoms, to replace a damaged part — such as a hip or a knee — and so on.Medical devices range from test tubes to sophisticated scanning machines.This includes any practice that aims to heal but is not part of conventional medicine. Techniques range widely. They include the use of herbs, manipulation of \"channels\" in the body, relaxation, and so on.Alternative and complementary do not have the same meaning:Alternative medicine: People use a different option from the conventional one, such as using relaxation measures to improve headaches, rather than pain relief medication.Complementary medicine: People add another treatment option to a main treatment. For example, they may use relaxation as well as pain relief medication for a headache.Alternative and complementary therapies are often based on traditional knowledge, rather than scientific evidence or clinical trials.Examples include homeopathy, acupuncture, ayurveda, naturopathic medicine, and traditional Chinese medicine.Researchers carry out investigations to find out which diseases are present, why they occur, what can treat or prevent them, what makes them more likely to happen, and many other aspects of health.Clinical trials are one aspect of clinical research. They aim to find out if a therapy — often a drug — is safe and effective to use when treating a specific condition.The most effective way to demonstrate the effectiveness of a drug or technique is to carry out a double-blind, random, long-term, large clinical human study.In this type of study, researchers compare the effect of a therapy or drug in with either a placebo, no treatment, or another therapy or drug.Counseling, cognitive behavioral therapy (CBT), and other forms of \"talking cure\" can be helpful for people with conditions that affect their mental health, ranging from depression to stress to chronic pain.These treatments do not involve medication, although a person may use medication alongside them.Physical therapy can help improve strength and flexibility in people who have a condition that affects their musculoskeletal system.Occupational therapy can teach people new and better ways to do things physically. A person who has had a stroke, for example, may benefit from learning again how to walk, using techniques that perhaps they did not use before.Other fields of medicine include pharmacology and pharmacy, nursing, speech therapy, medical practice management, and many more.There are many branches in medicine. Here are some of them.Anatomy: This is the study of the physical structure of the body.Biochemistry: A biochemist studies chemical components and how they affect the body.Biomechanics: This focuses on the structure of biological systems in the body and how they work, using a mechanical approach.Biostatistics: Researchers apply statistics to biological fields. This is crucial for successful medical research and many areas of medical practice.Biophysics: This uses physics, mathematics, chemistry, and biology to model and understand the workings of biological systems.Cytology: This is a branch of pathology that involves the medical and scientific microscopic study of cells.Embryology: This branch of biology studies the formation, early growth, and development of organisms.Endocrinology: Scientists investigate hormones and their impact on the body.Epidemiology: Researchers track the causes, distribution, and control of diseases in populations.Genetics: This is the study of genes and their impact on health and the body.Histology: This involves looking at the form of structures under the microscope. It is also known as microscopic anatomy.Microbiology: This is the study of organisms that are too small to see with the naked eye, known as microorganisms. Aspects of microbiology include bacteriology, virology, mycology (the study of fungi), and parasitology.Neuroscience: Neuroscientists study the nervous system and the brain and investigate diseases of the nervous system. Aspects of neuroscience include computational modeling and psychophysics. Some types of neuroscience are cognitive neuroscience, cellular neuroscience, and molecular neuroscience.Nutrition: Nutritionists study how food and drink influence health, and how they can help treat, cure, and prevent different diseases and conditions.Pathology: This is the study of disease. A pathologist often works in a laboratory, where they do tests — usually on a sample of blood, urine, or body tissue — to help diagnose diseases and conditions.Pharmacology: This involves the study of pharmaceutical medications, or drugs, where they come from, how they work, how the body responds to them, and what they consist of.Radiology: Radiologists use X-rays and scanning equipment during the diagnostic procedure, and sometimes as part of treatment, too.Toxicology: A toxicologist studies poisons, what they are, what effects they have on the body, and how to detect them.These are not all the aspects and fields of medicine. Many people work in patient transportation, dentistry, not to mention the many different specialties that physicians can choose to follow, such as emergency medicine.\nFor anyone who is considering medicine as a career, there are a wide variety of options.Qualifications, aptitude, and preference will make a particular field more attractive or suitable to an individual. Article last reviewed by Tue 13 November 2018.Visit our Medical Students / Training category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Medical Students / Training.All references are available in the References tab.\t\t\n\t\tClinician. (nd.). Merriam-Webster dictionary. Retrieved from https://www.merriam-webster.com/dictionary/clinician Please use one of the following formats to cite this article in your essay, paper or report:MLAThe MNT Editorial Team. \"What is medicine?.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323679.php>APAThe MNT Editorial Team. (2018, November 16). \"What is medicine?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323679.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323679.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}