{"id": "Ulcerative colitis stool: A visual guide", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In people with ulcerative colitis (UC), the large intestine, or colon, becomes inflamed and develops small, pus-producing ulcers. These ulcers can also develop in the rectum.The type of stool symptoms people experience will depend on the location of inflammation and ulceration within the colon.This article outlines the various stool symptoms of UC, along with the possible treatment optionsDoctors may use a Bristol Stool Chart to help a person recognize healthy bowel movements or identify possible problems.The stool changes that occur in UC are due to inflammation. Over time, inflammation can damage the lining of the large intestine.People with UC may experience painful abdominal cramps and a frequent need to empty the bowels.According to the Crohn's and Colitis Foundation (CFF), a person with UC may also experience the following symptoms:According to another organization, 75 percent of people with an inflammatory bowel disease (IBD) have also experienced bowel incontinence — the unintended passing of stools, or \"having an accident.\"Also, some people with IBD experience constipation instead of diarrhea.Learn more about the common stool changes below:Diarrhea occurs when intestinal damage becomes so extensive that the colon loses its ability to absorb water from waste.When waste retains too much water, it results in loose stools.Often, the ulcers that form within the lining of the colon can bleed, resulting in bloody stools.A person who regularly loses a lot of blood in their stools may develop anemia.Although the majority of people with UC will have loose stools, some may also experience constipation.However, constipation is more common among people with proctitis, in which inflammation and ulceration affect only the rectum.Symptoms of constipation include:Most people with UC tend to experience bowel incontinence during a flare-up of the disease.However, around 1 in 10 people with IBD who experience bowel incontinence will do so during a period of disease remission.The following factors may cause bowel incontinence:\nIncreased sensitivity of the rectumAs the rectum becomes inflamed, it will also become more sensitive. Heightened sensitivity in the rectum can cause it to become more active, pushing out stools as soon as they arrive.IBD surgeryPeople with severe UC may have surgery to remove all or part of the large intestine.In \"pouch surgery,\" the surgeon replaces the colon with an internal pouch. Some people who undergo this procedure may develop bowel incontinence.Severe constipationA buildup of stools can irritate the lining of the rectum, causing an overproduction of mucus.If the rectum constantly contains stools, the muscles of the anus relax, allowing the mucus to leak out.The following treatments for UC reduce inflammation that leads to stool symptoms:People with IBD should avoid taking antidiarrheal medications.Antidiarrheal drugs can increase the risk of a complication called megacolon, in which digestive gases become trapped in the colon, causing it to swell. In some cases, this can be fatal.The safest way to treat diarrhea is to make dietary changes. Many people with UC experience diarrhea after eating specific foods.Keeping a food diary along with a daily record of stool symptoms can help people identify and eliminate these trigger foods.A recent study suggests that a prebiotic supplement may help reduce bloody stools and other symptoms of UC.Participants taking the prebiotics supplement experienced significantly decreased abdominal pain and cramping. They also reported reduced nausea, vomiting, diarrhea, and blood in stools, although these effects were not statistically significant.The study was small, so more research is needed to determine the best way to reduce blood in stools.If a person frequently has bloody stools, a doctor may prescribe iron supplements to help prevent anemia.The International Foundation for Gastrointestinal Disorders (IFFGG) recommend the following treatments for mild constipation:However, many people with UC find that fibrous foods and whole grains trigger other symptoms, so keeping a food diary can help people identify which foods cause which symptoms.Other methods for relieving constipation include:However, people with UC should talk to a doctor before taking laxatives, as these medications can increase wind and stomach cramps.Many people who experience bowel incontinence find it difficult to discuss the issue with a doctor.However, a doctor may be able to identify the underlying cause of a leaky bowel and can offer advice on how to control and manage this symptom.Some suggestions for managing bowel incontinence include:Bowel retrainingPeople who experience a sense of urgency may benefit from delaying bowel movements. This technique is called bowel retraining.Although bowel retraining may be difficult at first. Over time, however, it will help build up strength and control over the rectum and sphincter muscles.Pelvic floor exercisesThe pelvic floor muscles support the pelvic organs, which include the bladder and bowel, as well as the uterus in women.Pelvic floor exercises can help strengthen the muscles around the anus, reducing incontinence. To find the pelvic floor muscles, imagine stopping a urine stream or practice while urinating.To perform pelvic floor exercises, contract and hold the pelvic floor muscles for a count of 3, and then relax the muscles, while slowly counting to 3. Avoid pushing out the muscle during the relaxation stage.Repeat this 15 times to complete one set of exercises. Aim to complete three sets each day.People with UC may experience uncomfortable, inconvenient, and sometimes distressing stool symptoms. These can greatly affect a person's quality of life.However, there is a range of treatments that can help those with UC to experience fewer and less severe symptoms.A person should discuss the options with their doctor to establish the most effective treatment plan. Article last reviewed by Wed 24 October 2018.Visit our Ulcerative Colitis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Ulcerative Colitis.All references are available in the References tab.\t\t\nDiarrhea and constipation. (n.d). Retrieved from http://s3-eu-west-1.amazonaws.com/files.crohnsandcolitis.org.uk/Publications/diarrhoea-and-constipation.pdfFaghfoori, Z., Shakerhosseini, R., Navai, L., Somi, M. H., Nikniaz, Z., & Abadi, A. (2014, July 12). Effects of an oral supplementation of germinated barley foodstuff on serum CRP level and clinical signs in patients with ulcerative colitis. Health Promotion Perspectives, 4(1), 116–121. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4122037/James, S. L., van Langenberg, D. R., Taylor, K. M., & Gibson, P. R. (2018, August 5). Characterization of ulcerative colitis‐associated constipation syndrome (proximal constipation). Journal of Gastroenterology and Hepatology Open. Retrieved from https://onlinelibrary.wiley.com/doi/full/10.1002/jgh3.12076Living with ulcerative colitis. (n.d.). Retrieved from http://www.crohnscolitisfoundation.org/assets/pdfs/living_with_uc_brochure_final.pdfManaging bowel incontinence in IBD. (n.d.). Retrieved from http://s3-eu-west-1.amazonaws.com/files.crohnsandcolitis.org.uk/Publications/managing-bowel-incontinence-in-IBD.pdfOverview of constipation treatments. (2017, September 29). Retrieved from https://aboutconstipation.org/treatment-overview.htmlPelvic muscle exercises. (n.d.). Retrieved from https://www.ucsfhealth.org/education/pelvic_muscle_exercises/Physical activity guidelines: Adults. (2018, October 23) Retrieved from https://health.gov/paguidelines/guidelines/adults.aspxWhat is ulcerative colitis? (n.d.). Retrieved from http://www.crohnscolitisfoundation.org/what-are-crohns-and-colitis/what-is-ulcerative-colitis/What should I eat? (n.d.). Retrieved from http://www.crohnscolitisfoundation.org/what-are-crohns-and-colitis/diet-and-nutrition/what-should-i-eat.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLALillis, Charlotte. \"Ulcerative colitis stool: A visual guide.\" Medical News Today. MediLexicon, Intl., 24 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323436.php>APALillis, C. (2018, October 24). \"Ulcerative colitis stool: A visual guide.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323436.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323436.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}