{"id": "What was medicine like in prehistoric times?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Prehistoric medicine refers to medicine before humans were able to read and write. It covers a vast period and varies, according to regions of the world and cultures.Anthropologists study the history of humanity and have yet to discover exactly how people practiced medicine in prehistoric times. However, they can make guesses based on human remains and artifacts that they find and on the way of life we see in some remote communities today.We can be fairly sure, however, that people in prehistoric times would have believed in a combination of natural and supernatural causes and treatments for conditions and diseases.Trial and error would have played a role in medicine in prehistory, but there was no research, as such.People did not compare new or existing treatments with a placebo or control when carrying out experiments, and they did not take into account factors such as coincidence, lifestyle, and family history.Nobody knows precisely what prehistoric peoples knew about how the human body works, but we can base some guesses on limited evidence that anthropologists have found.Prehistoric burial practices, for example, suggest that people knew something about bone structure. Scientists have found bones that were stripped of the flesh, bleached, and piled together, according to what part of the body they came from.There is also archeological evidence that some prehistoric communities practiced cannibalism. These people must have known about the inner organs and where there is most lean tissue or fat in the human body.Most likely, prehistoric people believed that spirits determined their lives. Some people around the world today still consider illness as losing or compromising one's soul.Colonists found that people in Australia were able to stitch up wounds and encase broken bones in mud to set them right. Medical historians believe these skills probably existed in prehistory.Most of the evidence that archeologists have found in prehistoric graves shows healthy but badly set bones. This indicates that people in most communities did not know how to set broken bones.Some of the priorities of public health today are:In contrast, medical historians are fairly sure that prehistoric peoples had no concept of public health. Instead, individuals tended to move around a lot and did not remain in one place for long, so the idea of a public health infrastructure was probably not relevant.Throughout prehistory, people had health problems, just as we do today. However, because they had different lifestyles and lifespans, the diseases would have varied from those we have now.Below are some diseases and conditions that may have been common in prehistoric times:Osteoarthritis: Many people had to lift and carry large and heavy objects frequently. This might have put a strain on the knee joints because archeological remains suggest that osteoarthritis was common.Micro-fractures of the spine and spondylolysis: These conditions that affect the vertebrae could have resulted from dragging large rocks over long distances.Hyperextension and torque of the lower back: The transportation and raising of large boulders and stones, such as huge Latte Stones, could have caused these problems.Infections and complications: People lived as hunter-gatherers, and cuts, bruises, and bone fractures probably occurred frequently. There were no antibiotics, vaccines, or antiseptics, and people probably knew little about bacteria, viruses, fungi, or other potential pathogens.They were probably unaware of how good hygiene practices can prevent infections and their complications. As a result, infections were more likely to become serious and life-threatening, and contagious diseases may have spread rapidly and become epidemics.Rickets: Anthropologists have evidence that rickets was widespread throughout most prehistoric communities, probably due to low vitamin D or C levels.Environmental exposure: There was little protection from natural disasters, such as cold periods lasting 10 years or longer, droughts, floods, and diseases that destroyed large food sources.Sex: Men lived longer than women, probably because males were the hunters. They would have had access to their kills before the women, and so, possibly less chance of malnutrition. Also, mortality associated with childbirth shortened the average lifespan of women.It is difficult to assess life expectancy in prehistoric times. However, archaeologists who have studied remains of adults from two prehistoric eras note that remains of those aged 20 to 40 years are more common than those aged over 40 years.This suggests that most people did not live to be over 40 years old, although this would depend on when and where the person lived.People used medicinal herbs in prehistoric times, say anthropologists.There is some limited evidence that they used herbs and substances from natural sources as medicines.However, it is hard to be sure what the full range might have been because plants rot rapidly.We can speculate that many medicinal herbs or plants would have been local ones, although this was not necessarily always the case. Nomadic tribes traveled long distances and may have had access to a wider range of materials.There is some evidence from present-day archeological sites in Iraq that people used mallow and yarrow about 60,000 years ago.Yarrow (Achillea millefolium): This is said to be an astringent, a diaphoretic, an aromatic, and a stimulant.An astringent causes tissues to contract and so helps reduce bleeding. People probably applied astringents to wounds, cuts, and abrasions.A diaphoretic promotes sweating and is a mild aromatic. It may also have anti-inflammatory, anti-ulcer, and antipathogenic properties, among others.Nowadays, people still use yarrow around the world to treat wounds, respiratory infections, digestive problems, skin conditions, and liver disease.Mallow (Malva neglecta): People may have prepared this as an herbal infusion for its colon-cleansing properties.Rosemary Rosmarinus officinalis: There is evidence from several areas of the world that people used rosemary as a medicinal herb. Globally, people attribute many different medicinal qualities to rosemary. As a result, it is hard to be sure what they used it for in ancient times.Birch Polypore (Piptoporus betulinus): Birch is common in the European Alps, and people may have used it as a laxative. Archeologists found traces of birch in a mummified man. Botanists say the plant can cause diarrhea when swallowed.Women would have gathered and administered herbal remedies, and they were probably in charge of treating sickness and keeping their families healthy.As people did not read or write in those days, people would have passed down their knowledge of the benefits and harm of various herbs they used for medicines by word-of-mouth.Three practices that are no longer common in medicine are geophagy, trepanning, and shamanism.This practice refers to eating soil-like or earthy substances, such as chalk and clay. Animals and humans have done this for hundreds of thousands of years. In Western and industrialized societies geophagy is related to an eating disorder known as pica.Prehistoric humans probably had their first medicinal experiences through eating earth and clays.They may have copied animals, observing how some clays had healing qualities, when animals ingested them.Similarly, some clays are useful for treating wounds. In some communities around the world, people still use clay externally and internally to heal cuts and wounds.This practice involves treating health problems by drilling a hole into the human skull.There is evidence that humans have been boring holes into people's heads since Neolithic times to try to cure diseases or free the victim of demons and evil spirits.From studying cave paintings, anthropologists believe that prehistoric peoples used trepanning in an attempt to rid their fellows of mental disorders, migraines, and epileptic seizures.The individual, if they survived, may have kept the extracted bone as a good luck charm.There is also evidence that trepanning was used in prehistoric times to treat fractured skulls.Medicine men, also known as witch doctors or shamans, existed in some prehistoric communities. They were in charge of their tribe's health and gathered plant-based medications, mainly herbs and roots, carried out rudimentary surgery, and cast spells and charms.Tribespeople would also seek out a shaman for medical advice when they needed it for sickness, injury, or disease.The health challenges in prehistoric times were somewhat different from those that exist today, although a number of diseases and conditions remain common now, such as arthritis and back problems.While people no longer have holes drilled in their skulls to free them from demons, herbs such as rosemary still play a role in herbal medicine and aromatherapy. Article last reviewed by Thu  1 November 2018.Visit our Medical Students / Training category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Medical Students / Training.All references are available in the References tab.\t\t\nApplequest, W. L., & Moerman, D. E. (2011, June 15). Yarrow (Achillea millefolium L.): A neglected panacea? A review of ethnobotany, bioactivity, and biomedical research. Economic Botany, 65(2), 209–225. Retrieved from https://www.jstor.org/stable/41242932?seq=1#page_scan_tab_contentsHajar, R. (2012, July–September). The air of history: Early medicine to Galen (part I). Heart Views, 13(3), 120–128. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3503359/Prehistoric knowledge about the body and disease. (n.d.). Retrieved from https://www.bbc.com/bitesize/guides/zc2yhv4/revision/2Trinkaus, E. (2011, January 25). Late Pleistocene adult mortality patterns and modern human establishment. PNAS, 108(4) 1267-1271. Retrieved from http://www.pnas.org/content/108/4/1267Viegas, J. (2012, November 27). Prehistoric people ate each other, bones show. Retrieved from https://www.seeker.com/prehistoric-people-ate-each-other-bones-show-1766074936.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What was medicine like in prehistoric times?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323556.php>APABrazier, Y. (2018, November 2). \"What was medicine like in prehistoric times?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323556.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323556.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}