{"id": "What are the possible complications of psoriasis?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Not only are there are different types of psoriasis, but it is also a complex condition.As scientists learn more about inflammatory conditions and how they affect people, they are also establishing more links between conditions that have different diagnoses.In addition, psoriasis poses lifestyle challenges that can be difficult to cope with. This can lead to additional symptoms, such as depression.Read on to find out more about some of the problems that may occur alongside this condition.People with psoriasis are more likely to have antibodies for celiac disease, suggesting that there may be a link between the two.Celiac disease affects around 1 percent of the general population, but it may be present in up to 4.3 percent of those with psoriasis.People with celiac disease can experience a severe reaction when they consume gluten.Both celiac disease and psoriasis appear to stem from dysfunction in the immune system. Some people find that avoiding gluten helps to reduce the symptoms of psoriasis.Researchers who published a review of studies in the Archives of Dermatology in 2017 suggested a number of conditions that are common in people with psoriasis may indicate a link with the gastrointestinal system.In 2014, authors of a meta-analysis published in the Journal of the American Academy of Dermatology concluded that a gluten-free diet may help some people with psoriasis. However, they called for more research to confirm a link.People with psoriasis who are considering giving up gluten should speak to a doctor first, as whole grains can contain valuable nutrients, and a gluten-free diet may not be suitable for everyone.Some studies have suggested that people with psoriasis are more likely to develop problems with mucous membranes in the oral cavity, such as fissures in the tongue and lesions in the gums and cheeks.Scientists have not established a specific link between psoriasis and oral problems, but research suggests that tongue fissures, for example, appear to be more common in those with psoriasis. Why they occur together also remains unclear.Psoriasis and mouth problems could stem from similar genetic factors, or they might result from exposure to similar triggers, such as stress and alcohol.Scientists have looked at possible links between psoriasis and inflammatory bowel disease (IBD), Crohn's disease, and ulcerative colitis.Studies have suggested that people with psoriasis and their family members may be more susceptible to these conditions.Psoriasis and IBD have various genetic factors in common.Studies have found that vitamin D deficiency is often present at the onset of some autoimmune diseases.Some experts recommend taking vitamin D supplements to improve the symptoms of psoriasis.One observational study involving 561 people, of whom 170 had psoriasis, found that people with psoriasis had significantly lower levels of vitamin D than those without the condition. The researchers suggested that vitamin D levels could impact the length of time symptoms last.However, they note that the association between vitamin D and psoriasis is \"controversial.\"Another study, also published in 2018, looked at 61 people with psoriasis and 61 people without. The researchers found no correlation between vitamin D levels and the severity of psoriasis symptoms in the two groups.The results were published in the Indian Journal of Dermatology in 2018.Some studies have indicated that psoriasis may increase the risk of cancer overall and some specific types of cancer, including oral, esophageal, liver, and pancreatic cancer.One reason may be the use of systemic medications in treatment. These drugs affect the whole body.Other underlying reasons may include genetic factors and the impact of psoriasis on the individual's lifestyle. More research is necessary to confirm a link.Among people with psoriasis, there is a higher risk of some of the symptoms of metabolic syndrome, including heart problems, diabetes, fatty liver disease, and obesity.Experts do not know what might link these conditions with psoriasis. There may be common genetic factors, they may share similar environmental triggers, or there may be a combination of reasons.People with moderate-to-severe psoriasis should undergo testing for these conditions, so that they can receive preventive treatment if necessary.Some types of psoriasis can affect body temperature regulation, and this can have an impact on internal organs, such as the heart and the kidneys, according to the National Psoriasis Foundation.The skin is important for keeping the body temperature stable, and problems that affect the skin can also affect temperature, especially with more severe forms, such as erythrodermic and pustular psoriasis.Pustular psoriasis is a severe form of psoriasis that can appear in people who already have psoriasis.One type, known as Zumbusch psoriasis, can lead to severe erythroderma and skin scaling.In a case study of a patient with pustular psoriasis, published in 2015, researchers noted that the condition can increase the risk of the following life-threatening complications:The patient who was the focus of the study had the following symptoms:The person may need to spend time in the hospital until treatment normalizes their fluid, chemical balances, heart function, and skin condition.Between 10 and 30 percent of people with psoriasis may develop psoriatic arthritis (PsA).It usually appears between the ages of 30 and 50 years.While 85 percent of people with this condition first have skin symptoms, it can occur before or without dermatological symptoms.Symptoms include:There are also different types of PsA, including:Anyone with psoriasis who has joint pain or stiffness should speak to their doctor. Early treatment can reduce the risk of permanent joint damage.Eye problems: Around 7 percent of people with PsA are more likely to develop uveitis, an inflammatory eye disease, according to the National Psoriasis Foundation.Hearing loss: A Spanish study of 60 people with PsA and 60 people without PsA, published in 2014, looked at the risk of hearing loss.The researchers found that 60 percent of those with PsA had some degree of hearing loss, compared with only 8.3 percent of those without the condition. They concluded that PsA may lead to damage in the inner ear.Chronic kidney disease appears to be more common among people with psoriasis.Scientists reporting in 2016 described this as \"logical,\" because psoriasis has links with cardiovascular disease, and kidney disease shares the same risk factors.In addition, the treatments people use for psoriasis are likely to have a toxic effect on the kidneys.Living with psoriasis can be difficult, and it can have emotional and social consequences.In a review published in Dermatology and Therapy in 2013, researchers describe psoriasis as a \"common, long-term skin condition associated with high levels of psychological distress and considerable life impact.\"People who have visible lesions may feel embarrassed by their appearance. This can lead to isolation, depression. and anxiety.This can affect areas of life such as:However, there may also be physiological reasons for the psychological impact of psoriasis.Scientists have found evidence of adrenal and pituitary involvement, which could lead to a hormonal imbalance. This imbalance could impact both the skin changes and the psychological well-being of a person with psoriasis.Stress and worry, in turn, can make symptoms worse.Anyone with psoriasis who is experiencing signs of depression or low mood should speak to a doctor about their concerns.As doctors increasingly come to understand the mental health challenges that people with psoriasis face, more effective treatment will hopefully become available.Psoriasis is a complex condition with a wide range of possible complications and comorbidities.When a person is familiar with the possible problems that can arise, it will be easier for them to explain to their doctor how they feel and to seek help.Treatment is available that can help to reduce many of the symptoms and complications of psoriasis and to improve a person's quality of life. Article last reviewed by Fri  9 November 2018.Visit our Psoriasis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Psoriasis.All references are available in the References tab.\t\t\nAbout psoriatic arthritis. (n.d.). Retrieved from https://www.psoriasis.org/about-psoriatic-arthritisAmor-Dorado, J. C., Barreira-Fernandez, M. P., Pia, T., Vazquez-Rodriguez-T. R., Llorca, J., & Gonzalez-Gay, M. A. (2014, October). Investigations into audiovestibular manifestations in patients with psoriatic arthritis [Abstract]. The Journal of Rheumatology, 41(10), 2018–2026. Retrieved from http://www.jrheum.org/content/41/10/2018.longBahnvit, K., Bhatia, B.A., Millsop, J. W., Debbaneh, M., Koo, J., Linos, E., & Liao, W. (2014, August). Diet and psoriasis: Part 2. celiac disease and role of a gluten-free diet.Journal of the American Academy of Dermatology, 71(2), 350–358. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4104239/Comorbidities associated with psoriatic disease. (n.d.). Retrieved from https://www.psoriasis.org/about-psoriasis/related-conditionsDe Moura, C. A. G. G., de Assis, L. H., Goes, P., Rosa, F., Nunes, V., Gusmao, I. M., & Cruz, C. M. S. (2015, September–December). A case of acute generalized pustular psoriasis of von Zumbusch triggered by hypocalcemia. Case Reports in Dermatology, 7(3), 345–351. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4777907/FAQS: Questions about complications and other diseases. (n.d.). Retrieved from https://www.psoriasis.org/about-psoriasis/faqs/health-concernsFiloni, A., Vestita, M., Congedo, M., Guidice, G., Tafuri, S., & Bonamonte, D. (2018, June 22). Association between psoriasis and vitamin D: Duration of disease correlates with decreased vitamin D serum levels: An observational case-control study. Medicine, 97(25), e11185. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6023690/Gonzalez-Parra, E., Dauden, E., Carrascosa, J. M., Olveira, A., Botella, R., Bonanad, C., & Rivera, R. (2016, December). Kidney disease and psoriasis: A new comorbidity? [Abstract]. Advances in Dermatology, 107(10), 799–878. Retrieved from http://www.actasdermo.org/en-kidney-disease-psoriasis-a-new-articulo-S1578219016302384Moon, H.-S., Mizara, A., & McBride, S. R. (2013, December). Psoriasis and psycho-dermatology. Dermatology and Therapy, 3(2), 117–130. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3889305/Nayak, P. B., Girisha, B. S., Noronha, T. M., & Sripathi, H. (2018, May–June). Low vitamin D in psoriasis: Reality or Myth? Indian Journal of Dermatology, 63(3), 255–260. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5996630/Pietrzak, D., Pietrzak, A., Krasowska, D., Borzecki, A., Franciszkiewicz-Pietrzak, K., Polkowska-Pruzynska, B., … Reich, K. (2017, September 13). Digestive system in psoriasis: An update. Archives of Dermatological Research, 309(9), 679–693. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5648743/Please use one of the following formats to cite this article in your essay, paper or report:MLAn.p. \"What are the possible complications of psoriasis?.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323641.php>APAn.p. (2018, November 16). \"What are the possible complications of psoriasis?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323641.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323641.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}