{"id": "Methotrexate and folic acid for rheumatoid arthritis", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.However, methotrexate drains the body of folic acid, which may lead to folic acid deficiencies.The body needs folic acid to maintain a healthy gastrointestinal (GI) tract and liver, as well as healthy bones and hair.Methotrexate can also cause side effects, such as nausea, vomiting, and stomach pain. A person taking the medication for rheumatoid arthritis (RA) can take a folic acid supplement to help reduce these unwanted side effects.In this article, learn more about how methotrexate affects folic acid, as well as about the other possible side effects.Folic acid is a B vitamin. An enzyme in the liver converts folic acid into folate, which plays many essential roles in the body, including helping with cell division and DNA replication.Methotrexate works by reducing the amount of folic acid in the body, which means that harmful cells cannot replicate. This is the reason why some people with cancer take the medication.Doctors do not know exactly how methotrexate works to reduce RA symptoms.However, according to the U.S. Food and Drug Administration (FDA) drug information document, methotrexate might affect immune system function, reducing the body's immune response that causes RA symptoms.The FDA information document also notes that methotrexate can reduce swelling, inflammation, and tenderness caused by RA within 3 to 6 weeks of starting to take the medication.Because methotrexate also depletes folic acid levels, it can cause a variety of side effects, including, mouth ulcers, headaches, and fatigue. Taking a folic acid supplement can reduce the risk of these side effects.Taking a folic acid supplement does not seem to change methotrexate's effectiveness in treating RA.A doctor will make recommendations on how much folic acid to take and when to take it.According to the Arthritis Foundation, some doctors suggest taking 1 milligram (mg) of folic acid a day. Other doctors may recommend taking a single 5-mg dose weekly.Some people will take the folic acid supplement 24 hours after taking a methotrexate dose.In a multi-study review of placebo-controlled clinical trials on the effects of folic acid supplementation, the authors made several conclusions:Also, the researchers did not find a link between taking folic acid and the effectiveness of methotrexate for treating RA.In addition to taking folic acid supplements, a person can also reduce the side effects of methotrexate by:A person can also ask their doctor about other ways to reduce methotrexate-related side effects.Pregnant women should not take methotrexate because of the potential risks that a folic acid deficiency and other side effects can have on a developing fetus.Those with alcohol use disorder should also avoid methotrexate because it increases liver enzymes and can be toxic to the liver.Other side effects that can occur as a result of taking methotrexate include:It is a good idea to discuss possible side effects with a doctor before taking methotrexate.A person should call a doctor right away if they experience any of the following side effects:While some of these side effects are relatively widespread among people who take methotrexate, anyone experiencing them should let their doctor know. A doctor can recommend other interventions for these side effects.If anyone experiences severe side effects, such as bleeding, they may require hospitalization to check blood levels and for other treatments.While methotrexate can help treat RA, it can lead to folate deficiency and cause other side effects, such as an upset stomach.Taking a folic acid supplement can help reduce some of these side effects.People should talk to a doctor about how much folic acid to take and when to take it for RA. Article last reviewed by Mon 29 October 2018.Visit our Rheumatoid Arthritis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Rheumatoid Arthritis.All references are available in the References tab.\t\t\nDhir, V., Sandhu, A., Kaur, J., Pinto, B., Kumar, P., Kaur, P., … Sharma, S. (2015, June 11). Comparison of two different folic acid doses with methotrexate — a randomized controlled trial (FOLVARI Study). Arthritis Research & Therapy, 17, 156. Retrieved from https://arthritis-research.biomedcentral.com/articles/10.1186/s13075-015-0668-4Gower, T. (n.d.). Methotrexate: Managing side effects. Retrieved from https://www.arthritis.org/living-with-arthritis/treatments/medication/drug-types/disease-modifying-drugs/methotrexate-side-effects.phpMethotrexate tablets, USP. (n.d.). Retrieved from https://www.accessdata.fda.gov/drugsatfda_docs/label/2016/008085s066lbl.pdfShea, B., Swinden, M. V., Tanjong Ghogomu, E., Ortiz, Z., Katchamart, W., Rader, T., … Tugwell, P. (2013, May 31). Folic acid and folinic acid for reducing side effects in patients receiving methotrexate for rheumatoid arthritis. Cochrane Database of Systematic Reviews, 2013(5). Retrieved from https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD000951.pub2/fullPlease use one of the following formats to cite this article in your essay, paper or report:MLANall, Rachel. \"Methotrexate and folic acid for rheumatoid arthritis.\" Medical News Today. MediLexicon, Intl., 29 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323500.php>APANall, R. (2018, October 29). \"Methotrexate and folic acid for rheumatoid arthritis.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323500.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323500.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}