{"id": "What are the limitations of BMI?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.BMI alone cannot show whether a person's weight is healthful, but using it in combination with other indicators can provide a more complete picture.For adults ages 20 years and older, BMI incorporates weight and height, but it does not take age or sex into account.A woman tends to have more body fat than a man with the same BMI. Likewise, an older person tends to have more body fat than a younger person with an equal BMI.For these reasons, BMI may not give the detail necessary to determine whether a person's weight is healthful.BMI does not reflect the location or amount of body fat, and these factors can impact health.For example, studies have indicated that people who have fat around the waist and surrounding the abdominal organs may be more at risk of health problems than those with fat in other areas.A 5-year investigation of 1,964 people, published in Scientific Reports in 2017, was one study that confirmed these findings.If a person has a high BMI, they are likely to have a high proportion of body fat, especially if their BMI falls in the obesity category.However, it is possible to be \"overweight\" according to BMI, but have healthful levels of fat.For extremely muscular people, such as athletes and bodybuilders, height and weight measurements alone may not accurately indicate health, because muscle weighs more than fat.A healthy, muscular person may have a BMI in a very high range. Meanwhile, a frail, inactive person may have a low BMI, but more body fat and less lean tissue than is healthful.Regular BMI cannot accurately indicate the state of a person's health at some stages in life.These include:For this reason, BMI calculations are different for children and teens. These measurements take age and sex into account.Norm can also vary among people of certain races and ethnicities.The National Heart, Lung, and Blood Institute (NHLBI) suggest that an assessment of weight and health risks should incorporate three key measures:If fat accumulates around the waist rather than the hips, a person may have a higher risk of heart disease and type 2 diabetes.This risk increases with a waist size greater than 35 inches for non-pregnant women or greater than 40 inches for men, according to the Centers for Disease Control and Prevention (CDC).To measure their waist, a person should:The following information, adapted from the NHLBI, may help indicate the risks associated with BMI and waist circumference.The chart shows weight categories according to BMI, and the effects of higher waist circumference on the risks of type 2 diabetes, hypertension, and cardiovascular disease.WaistWaistMen 40 inches or lessWomen 35 inches or lessMen: 40 inches or moreWomen: 35 inches or moreA doctor may also measure body fat composition.\nBeing overweight or having obesity can increase the risk to the heart.The following issues can also increase the risk of developing heart disease, for example.A doctor will recommend that a person consider losing weight if they:If a person has obesity or excess weight plus two or more risk factors, they may be at risk of a number of obesity-related health problems in the future.Losing 5–10 percent of their current weight can reduce the risk of developing these health problems.Some people are overweight but have no other risk factors, such as high cholesterol or high blood pressure. They should follow a healthful and varied diet, and get regular exercise to prevent additional weight gain. Article last reviewed by Wed 31 October 2018.Visit our Obesity / Weight Loss / Fitness category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Obesity / Weight Loss / Fitness.All references are available in the References tab.\t\t\nAssessing your weight. (2015, May 15). Retrieved from https://www.cdc.gov/healthyweight/assessing/index.htmlAssessing your weight and health risk. (n.d.). Retrieved from https://www.nhlbi.nih.gov/health/educational/lose_wt/risk.htm Classification of overweight and obesity by BMI, waist circumference, and associated disease risks. (n.d.). Retrieved from https://www.nhlbi.nih.gov/health/educational/lose_wt/BMI/bmi_dis.htmKwon, H., Kim, D., & Kim, J. S. (2017, September 8). Body fat distribution and the risk of incident metabolic syndrome: A longitudinal cohort study. Scientific Reports, 7, 10955. Retrieved from https://www.nature.com/articles/s41598-017-09723-yPlease use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What are the limitations of BMI?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323543.php>APABrazier, Y. (2018, November 2). \"What are the limitations of BMI?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323543.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323543.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}