{"id": "How does gasoline exposure affect a person's health?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Gasoline is a human-made substance that people use primarily to fuel vehicles and other machines that use an engine.If a person gets exposure to gasoline or gasoline vapors in large amounts or over an extended period, it can cause serious health complications. Ingesting even a small quantity of gasoline can be fatal.If someone in the United States suspects gasoline exposure or poisoning, they should immediately call Poison Control on 1-800-222-1222, and an expert will provide care instructions. If symptoms are severe, they should also call 911 or visit the nearest hospital.In this article, we look at how gasoline can affect a person's health, including the symptoms and causes of gasoline poisoning.Gasoline is a toxic and extremely flammable liquid. At room temperature, gasoline is usually colorless or pale brown or pink.Gasoline contains approximately 150 different chemicals, but it primarily comprises compounds called hydrocarbons, which include alkenes, benzene, toluene, and xylenes.When even small quantities of hydrocarbons enter the bloodstream, this can reduce the functioning of the central nervous system (CNS) and cause organ damage.Gasoline is not just toxic when people ingest it. It can also cause damage to the skin, eyes, and lungs when a person comes into contact with gasoline liquid or the fumes or vapors of gasoline.Burning gasoline releases several harmful chemicals, one of which is carbon monoxide. Carbon monoxide is a colorless, odorless gas that can be deadly when people inhale it in high concentrations or for a prolonged time.For this reason, it is never safe to run a car or use gas-fuelled machines or tools in an enclosed area.Gasoline exposure can reduce the functioning of the CNS and damage organs. The symptoms of gasoline poisoning depend on a few factors, such as:Inhaling gasoline vapors can irritate the sensitive lung tissues, and a number of the chemicals can enter the bloodstream.Once in the bloodstream, some of these chemicals can make it difficult for the body to move oxygen around the body tissues, causing healthy tissue to die.Symptoms that commonly occur following gasoline vapor exposure include:Symptoms of skin exposure to gasolineGetting a small amount of gasoline on the skin for a short period is usually harmless. The skin does not readily absorb the chemicals in gasoline. However, if gasoline remains on the skin or clothing for a few hours, it can enter the skin.Symptoms of skin and eye exposure to gasoline include:The gastrointestinal tract does not absorb gasoline as easily as the lungs do, but ingesting gasoline can be fatal.In adults, 20–50 grams (g) of gasoline, which is fewer than 2 ounces (oz), can cause severe intoxication, and around 350 g (12 oz) can kill a person who weighs 70 kilograms. In children, ingesting 10–15 g (up to half an ounce) of gasoline can be fatal.Symptoms of ingesting gasoline include:When someone swallows gasoline, they may also experience lung damage if the gasoline in their stomach travels to the lung while they are vomiting.Most people only come into contact with gasoline and gasoline vapors at the gas station or while using their lawnmower.People who work with machinery have a higher risk of health problems because they have daily exposure to gasoline, gasoline vapors, or other fuels, such as diesel and kerosene.Examples of these jobs include:Over time, gas pipelines and tanks may leak small amounts of gasoline into the groundwater.Normal purification processes typically remove these trace levels of gasoline, but some people may occasionally come into contact with contaminated water. These people include those who use water from wells to drink, bathe, or both.Children are more likely to experience serious side effects from gasoline because they:If very severe, exposure to gasoline or gasoline vapors can cause permanent organ damage, coma, or death.Scientists have linked continuous exposure to gasoline vapors for 2 years to liver and kidney cancer in animal studies. However, there is not currently enough scientific evidence to prove that gasoline vapour exposure causes these cancers in humans.Chronic inhalation of gasoline, such as inhaling gasoline vapors, can cause a wide range of symptoms, including sudden death.Symptoms of chronic gasoline abuse include:Over time, chronic gasoline abuse can cause more severe and sometimes permanent health problems, such as:Prolonged skin contact with gasoline can affect the skin's natural protective layers. This damage can result in skin peeling and cracking, which can cause scarring in severe cases.Chronic or severe exposure to fuel products made from gasoline, such as diesel and benzenes, may also cause severe health complications, including several types of cancer and organ damage.If a person suspects gasoline poisoning, regardless of the exposure route, they should immediately call Poison Control on 1-800-222-1222. If symptoms are severe, they should also call 911.There is no antidote for gasoline exposure or poisoning. Once someone is in the hospital, doctors can provide medications and supportive therapy to ensure that a person's heart and lungs function correctly and that they are hydrated.People should never attempt to treat themselves or others at home.There are, however, a few general steps that people can follow to help reduce the risk of developing more serious symptoms:With proper medical attention, minor CNS symptoms go away after the body has cleared the toxins, although it can take a few weeks for the kidneys to heal.If a person washes it off quickly, gasoline usually does not cause significant skin complications.Severe gasoline exposure of any kind can be fatal. The long-term consequences of this exposure can be significant. They include:People can usually prevent exposure to gasoline vapors by avoiding places where they might encounter gasoline fumes.People with jobs that expose them to gasoline regularly should always follow proper precautions, such as wearing protective clothing or masks.Those who work around gasoline can practice good safety habits on site and when handling or storing gasoline, such as:Many people do not know if they have gasoline pipelines running through their property. People can access a national pipeline mapping system through the Pipeline and Hazardous Materials Safety Administration website.People who work around gasoline should talk with a doctor about ways to reduce the risk of long-term health consequences. People should also tell their doctor about any symptoms of overexposure as soon as they develop.Limited gasoline exposure should not cause significant health problems. However, gasoline and gasoline vapors are toxic, and too much exposure to them can be deadly.There are no home remedies or medical treatments for gasoline poisoning. There are only supportive therapies.If someone suspects gasoline poisoning, they should always call Poison Control, which people in the U.S. can reach by calling 1-800-222-1222.It is vital to call for help immediately if someone is unconscious or having a seizure. Article last reviewed by Tue 23 October 2018.Visit our Public Health category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Public Health.All references are available in the References tab.\t\t\nCarbon monoxide. (2012, June 5). Retrieved from https://www.cdc.gov/niosh/topics/co/Diesel exhaust and cancer. (2015, July 27). Retrieved from https://www.cancer.org/cancer/cancer-causes/diesel-exhaust-and-cancer.html?_ga=2.114711623.1170105275.1537805309-1102398121.1537805309First aid for poisons. (n.d.). Retrieved from https://www.poison.org/first-aid-for-poisoningsMedical management guidelines for gasoline (mixture). (2014, October 21). Retrieved from https://www.atsdr.cdc.gov/MMG/MMG.asp?id=465&tid=83Public health statement for automotive gasoline. (2015, January 21). Retrieved from https://www.atsdr.cdc.gov/PHS/PHS.asp?id=466&tid=83Please use one of the following formats to cite this article in your essay, paper or report:MLAHuizen, Jennifer. \"How does gasoline exposure affect a person's health?.\" Medical News Today. MediLexicon, Intl., 23 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323426.php>APAHuizen, J. (2018, October 23). \"How does gasoline exposure affect a person's health?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323426.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323426.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}