{"id": "What are the treatments for asthma?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Treatment focuses on a person keeping their chronic symptoms in check and avoiding triggers while receiving quick relief during severe flare-ups.Doctors call a flare-up of asthma symptoms an asthma attack, and the treatment they prescribe tries to limit further attacks and reduce the need for rapid medication.Also, treatment aims to restore and maintain a person's lung function, activity levels, and sleep patterns.As the disease has a variety of causes and people of all ages can have it, most individuals will have a different action plan and course of treatment.In this article, we explore the management options for asthma.Asthma care places responsibility for treatment with both the doctor and the individual with the condition.Working with a doctor and following the suggested action plan to the letter is vital for reducing the impact of asthma.Avoiding asthma triggers is a primary way to reduce the risk of a severe attack and chronic symptoms.Exercise is a potential trigger but maintaining an active physical regimen is an essential part of healthful living. People can ask their doctor about medications that might improve their asthma symptoms during physical activity.When a doctor diagnoses asthma, they will take into account the causes. Nevertheless, adapting asthma treatment into an existing lifestyle is necessary for keeping symptoms in check.An asthma action plan will guide a person through the following:The doctor will personalize the action plan to the individual's specific needs and take them through how they must actively participate.When a child receives an asthma action plan, they must share it with any caregivers, such as babysitters and supervisors at daycare, schools, and recreational activities, as well as relatives and friends who may supervise them.Making sure all necessary people receive the action plan means that the individual with asthma can ensure these other people will enforce the necessary actions. Consequently, they reduce their risk of having a severe asthma attack.\nTypically, people should attend asthma consultations every 2 to 6 weeks after first receiving a diagnosis. However, using a peak flow meter at home to monitor the progress of their treatment can help them manage the disease in between doctor's visits.A peak flow meter is a simple, handheld tool that can help a person maintain control of their asthma by allowing them to measure the effectiveness of air movement from their lungs.The meter reveals a \"peak flow\" number after a person blows into the device. A doctor will indicate how often a person should use the test, how to interpret the results, and how to judge how much medication they need to take.The doctor may request that a person either records their scores every morning or uses the peak flow meter intermittently.The monitoring aims to find and maintain a \"personal best\"peak flow number by recording the scores for 2 to 3 weeks after diagnosis.The personal best score will dictate the dosage and delivery method of medications. By comparing future scores with the individual's best score, a doctor can measure whether their treatment is working.Peak flow can also warn of an oncoming asthma attack before symptoms are apparent.A person is applying treatment effectively if the following apply:Good control also means people need to be avoiding asthma triggers and allergens as well.Two types of medication are common in asthma treatment.One type usually provides immediate relief from asthma attacks and episodes.The other type supports long-term control of the disease, including reduced airway inflammation and prevention of asthma symptoms.The primary forms of quick-relief asthma medications are beta2-agonists, a class of drugs that includes:Most asthma medication is available in the form of a powder or mist for oral administration with an inhaler. An inhaler is a device that \"mists\" the medicine, promoting more efficient and direct delivery to the lungs.Asthma medicines can sometimes take the form of a pill, as well.A person with asthma should use these drugs daily to reduce flare-ups and ongoing symptoms.The most effective drugs for long-term asthma control are known as inhaled corticosteroids. These provide inflammation relief and reduce a person's sensitivity to allergens and triggers.However, the medicines do have side effects, such as thrush that causes a fungal infection of the mouth. When corticosteroids reach the mouth or throat, the risk of thrush increases.Manufacturers of inhaler devices have developed spacers or holding chambers to help prevent thrush. Rinsing the mouth after inhalation can have a similar protective effect.Inhaled corticosteroids also increase the risk of cataracts and osteoporosis when a person takes them for a long time.Doctors may prescribe the following medicines on a long-term basis for people with asthma:People should use a quick-relief inhaler for no more than 2 days a week. Most people carry the quick-relief inhaler with them at all times and administer the medication when they first notice symptoms.Usually, quick-relief medicines do not reduce inflammation, so a person should avoid using them for long-term control of their condition.While researchers have explored nonmedical remedies for asthma symptoms, no research is currently available to confirm the effectiveness of anything other than conventional treatment for managing asthma.Nonmedical treatments, as yet unconfirmed, include acupuncture, breathing exercises, and placebo medications.Also, complementary techniques and supplements can interact with conventional medications with potentially harmful effects. They are not a replacement for conventional, medically supervised management of asthma.People should seek urgent medical attention if their medication does not reduce the effects of an asthma attack, or their peak flow measurement is less than half of their personal best.They must call the emergency services or seek treatment at an emergency room if being out of breath means that walking becomes extremely difficult or impossible, or if the lips or fingernails start turning blue. These signs show the person is experiencing a lack of oxygen.A hospital will provide direct oxygen to bring the person's oxygen supply to a safe level and temporarily increase the dosage of medicines.Emergency staff will likely administer a combination of the following:The doctor may also insert a breathing tube into the throat and provide machine-assisted ventilation if they think a person's breathing may stop, known as respiratory arrest.Some people with asthma have specific requirements to reduce their risk of complications and to manage underlying conditions.Although quick-relief medicines can relieve wheezing in young children, a doctor might prescribe long-term control medicines to treat infants and young children if symptoms seem likely to continue after 6 years of age.The treating doctor will often attempt asthma treatment for 4 to 6 weeks in younger children and stop if a substantial improvement in symptoms does not occur.Inhaled corticosteroids carry the side effect of slowing growth, but the effect is generally small and is only apparent for the first few months of treatment.Asthma care for older adults may require adjustments to prevent interactions between asthma medication and any existing drug regimen.Several medications can prevent the effective function of asthma drugs, including:Older adults may also experience difficulties in holding their breath for 10 seconds after inhaling a medication. However, a person can fit a spacer to their inhaler to address these difficulties.The increased risk of osteoporosis, to which inhaled corticosteroids can contribute, may be more pronounced in older adults with weak bones. Calcium and vitamin D supplements can help promote bone strength.It is essential for women to control their asthma symptoms during pregnancy to ensure enough oxygen reaches the developing fetus.Asthma in a woman who is pregnant increases the risk of premature birth, lower birth weight, reduced growth, and mortality for the fetus.The risks of an asthma attack during pregnancy outweigh any risks of taking asthma medication.Asthma treatment centers on long-term control of airway inflammation and quick relief when someone experiences an asthma attack.Many people use an inhaler or nebulizer device to disperse asthma medications directly into the lungs as a mist. For quick relief, people use short-acting beta2-agonist medications, such as epinephrine and albuterol.Longer-term management uses anti-inflammatory medications, leukotriene modifiers, and immunomodulators, among other drugs, to reduce swelling in the airways and the risk of attacks from immune reactions.People must urgently seek emergency treatment if an asthma attack removes their ability to walk or speak, or if their extremities and lips start to turn blue. An emergency team will combine several intensive medications to administer treatment and return people's breathing to a normal rate.Young children and older adults with the condition often need specialized management, and women who are pregnant should seek treatment if they have asthma to reduce the risk of fetal complications.A person can live a full and active life if they manage asthma symptoms correctly.What happens if I have a severe attack with no access to emergency medicine?Typically, the person experiencing the attack will begin to panic, which in turn will make the attack even worse. The first thing to do is remain calm, sit upright and take deep, long breaths.If your symptoms do not subside within 5 minutes or become worse, inform anyone around you or, if possible, call an emergency line and tell them that you are having an attack and need immediate medical attention. Article last reviewed by Thu  1 November 2018.Visit our Asthma category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Asthma.All references are available in the References tab.\t\t\nAsthma. (n.d.). Retrieved from https://www.nhlbi.nih.gov/health-topics/asthmaAsthma: In depth. (2017, September 24). Retrieved from https://nccih.nih.gov/health/asthma/facts#useAsthma medications. (n.d.). Retrieved from https://getasthmahelp.org/medications-list.aspxGoya, S., & Agrawal, A, (2013, May–June). Ketamine in status asthmaticus: A review. Indian Journal of  Critical Care Medicine, 17(3), 154–161. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3777369/Kemppainen, M., Lahesmaa-Korpinen, A-M., Kauppi, P., Virtanen, M., Virtanen, S. M., Karikoski, R., … Kirjavainen, T. (2018, May 18). Maternal asthma is associated with increased risk of perinatal mortality. PLoS One, 13(5). Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/29775476Please use one of the following formats to cite this article in your essay, paper or report:MLAFelman, Adam. \"What are the treatments for asthma?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323524.php>APAFelman, A. (2018, November 2). \"What are the treatments for asthma?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323524.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323524.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}