{"id": "Could blue light reduce blood pressure?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The results of an investigation into the effects of blue light on high blood pressure were recently published in the European Journal of Preventative Cardiology.High blood pressure, or hypertension, is widespread in the United States and many other Western countries.According to the Centers for Disease Control and Prevention (CDC), high blood pressure is a primary or contributing cause of almost 1,000 deaths every day in the U.S.Hypertension is also a risk factor for more serious conditions, such as heart attack, stroke, and kidney disease. For these reasons, managing blood pressure effectively is a high priority.Currently, doctors usually prescribe medications such as angiotensin converting enzyme inhibitors and calcium channel blockers to help manage hypertension. Although these can be effective, side effects are common and include a persistent dry cough and dizziness.Because high blood pressure is so prevalent, a great deal of research has investigated its causes. The importance of lifestyle, including diet and exercise, cannot be overstated, while other risk factors play smaller roles.For instance, studies have demonstrated that exposure to sunlight influences hypertension. Blood pressure is, on average, lower during the summer months, and some research has linked high levels of long-term sunlight exposure to a reduced risk of dying from cardiovascular disease.Exposure to excessive levels of sunlight damages the skin, causing premature aging. Research has also established that ultraviolet (UV) light is a carcinogen — excessive exposure increases the risk of developing skin cancer.On the other hand, as sunlight hits our skin, it drives a chemical reaction that produces vitamin D, which plays a range of essential roles in the body.UV light also affects nitric oxide (NO) levels, and NO is an important signaling molecule in humans and virtually all other organisms.The inner lining of blood vessels — called the endothelium — releases NO. This causes the smooth muscles around the blood vessels to relax, thereby lowering blood pressure.When sunlight hits the skin, compounds such as nitrites break down to produce NO, which then diffuses into the deeper tissues and, finally, enters the blood vessels.The interaction between sunlight, NO, and the smooth muscles of the blood vessels may explain why sunlight has a hypertension-minimizing effect.Finding a way to harness the benefits of UV light while removing the negative effects would be a significant discovery. Enter: blue light.Recently, researchers from the University of Surrey in the United Kingdom and Heinrich Heine University Dusseldorf in Germany joined forces to investigate whether blue light without UV wavelengths has the potential to ease hypertension.Earlier studies demonstrated that visible blue light, in a range of 420–453 nanometers in wavelength, can induce the production of NO without damaging DNA.The latest study goes one step further. For the first time, researchers assessed whether blue light exposure could produce enough NO to significantly reduce high blood pressure.Their proof-of-concept study involved 14 male participants aged 30–60, none of whom had preexisting cardiovascular issues, hypertension, or diabetes.Each participant visited the testing facility twice, with 1 week between sessions. During one visit, they were exposed to 30 minutes of whole-body blue light. At the other, they received 30 minutes of \"control light.\"Most importantly, the scientists looked for changes in blood pressure. They also assessed other parameters, including heart rate, blood flow in the forearm, circulating levels of NO, and pulse wave velocity, a measure of how stiff the arteries are.Members of the team took measurements before, during, and after the light exposure. They found that 30 minutes of whole-body blue light significantly lowered systolic blood pressure — the pressure in blood vessels as the heart contracts — by 8 millimeters of mercury.According to the authors, this reduction was equivalent to, or more significant than, \"the blood pressure-lowering effect sizes observed by typical blood pressure-lowering medications.\"The other parameters also improved significantly under blue light, including pulse wave velocity. As expected, serum NO levels also increased. The authors conclude:\"Our present study demonstrates for the first time that whole-body blue light exposure at doses that are comparable to daily sunlight exposure decreases systolic blood pressure [...] in young, healthy male volunteers.\"Of course, this pilot study included a very small number of participants, and it will need to be replicated on a much larger scale.If the findings are duplicated, however, this could be a game-changer for the management of hypertension in some populations.As one of the study's authors, Christian Heiss, a doctor and a professor at the University of Surrey, explains, \"Exposure to blue light provides an innovative method to precisely control blood pressure without drugs. Wearable blue light sources could make continued exposure to light possible and practical.\"Although blue light therapy could never replace changes in diet and lifestyle, it may provide additional benefits for certain people. As Dr. Heiss notes, \"This would be particularly helpful to those whose blood pressure is not easily controlled by medication, such as older people.\"Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323636.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}