{"id": "Could the appendix trigger Parkinson's?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Parkinson's disease is a long-term degenerative condition that affects the central nervous system.In the United States, medical professionals tend to diagnose around 60,000 new cases each year.Symptoms include tremor, slow movement, stiff muscles, and changes in speech.Because Parkinson's almost exclusively appears in older adults, as the population ages, the number of cases is also set to rise.In fact, by 2030, there may be as many as 1.2 million people in the U.S. with Parkinson's disease. To date, treatments only help manage the symptoms; there is no cure.Because of its growing prevalence, it is more important than ever to discover clues about how and why it develops in certain people.A recent study dipped into the data of almost 1.6 million Swedish adults and followed them for an average of 52 years. The findings, published this week in the journal Science, add a new and intriguing insight into Parkinson's.Led by Bryan Killinger, the researchers focused on the appendix. This might seem like an odd starting point, but there is solid reasoning behind it.In many Parkinson's cases, gastrointestinal symptoms present themselves long before neurological symptoms appear. In some cases, these symptoms can precede motor symptoms by 20 years.Moreover, alpha-synuclein is present in the nerves of the digestive system; this protein is the major component of Lewy bodies — clumps of protein in the brain — that are a hallmark of Parkinson's.Alpha-synuclein plays a significant role in the pathology of the disease, and its presence in the gut may account for the early digestive symptoms.Researchers believe that misfolded alpha-synuclein in the gut might spread from cell to cell before eventually reaching the brain. There is evidence that once the protein has become misfolded, it causes a chain reaction, spreading its new, misshapen form to its neighbors.This is similar to how prion diseases such as Creutzfeldt-Jakob disease can spread throughout the body.As with other parts of the gastrointestinal system, the appendix also contains high levels of alpha-synuclein, making it an appealing target to study.The team's analysis showed that an appendectomy reduced the risk of developing Parkinson's by 19.3 percent.When they delved deeper into the details, they found that the effect was strongest for people living in rural areas. This infers that there is some interaction with the environment. The authors theorize that this might be connected to pesticides, which have been linked to the development of Parkinson's disease.In a further analysis on 849 people with Parkinson's, they found that those who had undergone an appendectomy decades earlier developed Parkinson's an average of 3.6 years later. The authors write:\"The presence of pathogenic alpha-synuclein species in the appendix indicates a mechanism by which the appendix may contribute to, and possibly trigger, the development of [Parkinson's disease].\"To investigate further, the scientists examined the appendixes of healthy participants. As expected, within the neurons and mucous membranes of the appendix, they found forms of alpha-synuclein that are prone to aggregate.They also reveal that this form of the protein was more prevalent in the appendixes of people with Parkinson's disease.The authors of the study believe that targeting the buildup of alpha-synuclein in the appendix may be an exciting new avenue of research. With the worrying projected figures of Parkinson's disease, new research into this is likely to follow swiftly.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323549.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}