{"id": "What to know about psoriasis and keratosis pilaris", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The causes and treatments of psoriasis and keratosis pilaris are different. Psoriasis may require medical attention, while keratosis pilaris usually goes away on its own.People may confuse the two conditions, as some forms of psoriasis can have similar symptoms to keratosis pilaris. In this article, we take a closer look at these two conditions.Psoriasis is an autoimmune disease, which is when something goes wrong with the body's immune system. Psoriasis occurs when the body produces skin cells faster than usual, causing thick, scaly patches of skin to appear.Keratosis pilaris is a harmless skin condition. It occurs when there is a buildup of keratin in the skin. Keratin is the protein found in hair, skin, and nails.The extra keratin builds up in the hair follicles, causing small bumps to form. The bumps are usually red, white, or skin-colored, and resemble goose bumps.Doctors are unsure what causes the excess keratin to form. One study suggests that coiled hair shafts under the skin could be what causes keratosis pilaris.People can have both psoriasis and keratosis pilaris, but researchers do not know whether the two skin conditions are linked.Both psoriasis and keratosis pilaris tend to run in families. People who inherit certain genes are more likely to get psoriasis or keratosis pilaris. However, people can get either condition without having a family history.Scientists have discovered that psoriasis usually appears after a person experiences a trigger, such as:Both psoriasis and keratosis pilaris appear in patches on the skin and can cause itchiness. Neither skin condition is contagious or infectious.Apart from these similarities, psoriasis and keratosis are different skin conditions.Plaque psoriasis is the most common type of psoriasis. An estimated 80–90 percent of people with psoriasis will get plaques.This table compares the symptoms of plaque psoriasis and keratosis pilaris:Psoriasis is usually a lifelong condition. People with psoriasis should discuss a treatment plan with their doctor or a dermatologist who specializes in skin conditions.What treatment a person receives for psoriasis will depend on the type and severity of their condition.A doctor will usually prescribe topical medications for psoriasis. These may include:People can use over-the-counter creams and ointments to treat mild psoriasis. These may contain:People can also use moisturizers to help treat their psoriasis, as these can reduce dryness and help to heal the skin.Keratosis pilaris is completely harmless and does not require any treatment.People may want to treat keratosis pilaris if it causes dry, itchy skin, or if they dislike the appearance.People can use a moisturizer to help soothe the skin. Among the most effective moisturizers for keratosis pilaris are ones that contain urea or lactic acid.People can develop different types of psoriasis, which all have different symptoms. On the other hand, keratosis pilaris always appears as small bumps on the surface of the skin.Sometimes, people may confuse keratosis pilaris for guttate psoriasis or pustular psoriasis, which also cause small bumps on the skin.This type of psoriasis usually appears very suddenly and is usually linked to people having an infection, such as strep throat.Symptoms of guttate psoriasis include:Guttate psoriasis is usually temporary and can disappear within weeks or months without any treatment.Pustular psoriasis causes patches of skin redness with small, pus-filled bumps. It usually appears on the hands and feet. This condition is not contagious.These areas of skin tend to be very painful and swollen. Brown dots and scale may appear as the bumps dry out.Severe cases of pustular psoriasis happen when pus-filled bumps cover most of the skin and break open. Medical attention is necessary in these cases, as severe pustular psoriasis can be life-threatening.Inverse psoriasis, also called intertriginous or flexural psoriasis, develops in areas where skin touches skin, such as armpits, buttocks, and genitals.This form of psoriasis causes smooth, painful patches of red, raw-looking skin and does not always involve a silvery-white skin coating, as in plaque psoriasis.If people have psoriasis, they should check their fingernails and toenails for the following symptoms of nail psoriasis:People with nail psoriasis should see their dermatologist for treatment, which can help prevent the condition from worsening.A dermatologist will be able to diagnose psoriasis and keratosis pilaris. They will examine the skin, scalp, and nails for any signs of psoriasis.A dermatologist may also suggest a skin biopsy, where they remove a small sample of skin and look at it under a microscope to diagnose psoriasis.Likewise, a dermatologist will be able to diagnose keratosis pilaris by examining the skin.Psoriasis can increase a person's risk of developing other medical conditions. People with psoriasis can discuss this with their dermatologist, who will help assess the risks.In contrast, keratosis pilaris has no risk factors.Around 30 percent of people with psoriasis can develop psoriatic arthritis. People with psoriasis should see their dermatologist if they notice:If people notice symptoms of psoriasis, they should see their doctor for advice on how to manage the condition.Keratosis pilaris is a harmless skin condition and does not require treatment. If people want to improve the appearance of keratosis pilaris for cosmetic reasons, they can see a dermatologist for advice.Psoriasis and keratosis pilaris are both common skin conditions, which can affect a wide range of people.Keratosis pilaris is a harmless condition that people can treat for cosmetic reasons or to soothe patches that feel dry or itchy.People with psoriasis should see a dermatologist who will be able to create a treatment plan to manage the condition.Are people with psoriasis more likely to get keratosis pilaris?At this time there is no link between keratosis pilaris and psoriasis. They are two very different skin conditions. Keratosis pilaris appears when dead skin cells clog our pores, and psoriasis is when our skin overproduces skin cells. You are at a higher risk of getting keratosis pilaris if you have close relatives who have keratosis pilaris, asthma, dry skin, eczema, excess body weight, hay fever, ichthysosis vulgaris, or melanoma, and taking vemurafenib. Article last reviewed by Mon 12 November 2018.Visit our Psoriasis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Psoriasis.All references are available in the References tab.\t\t\nAbout psoriasis. (2018, October 23). Retrieved from https://www.psoriasis.org/About psoriatic arthritis. (n.d.). Retrieved from https://www.psoriasis.org/about-psoriatic-arthritisKeratosis pilaris. (n.d.). Retrieved from https://www.aad.org/public/diseases/bumps-and-growths/keratosis-pilaris#overviewPsoriasis resource center. (n.d.). Retrieved from https://www.aad.org/public/diseases/scaly-skin/psoriasisThomas, M., & Khopkar, U. S. (2012, October–December). Keratosis pilaris revisited: Is it more than just a follicular keratosis? International Journal of Trichology, 4(4), 255–258. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3681106/What is psoriasis? (n.d.). Retrieved from https://www.aad.org/public/diseases/scaly-skin/psoriasis/what-is-psoriasisPlease use one of the following formats to cite this article in your essay, paper or report:MLASissons, Beth. \"What to know about psoriasis and keratosis pilaris.\" Medical News Today. MediLexicon, Intl., 12 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323650.php>APASissons, B. (2018, November 12). \"What to know about psoriasis and keratosis pilaris.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323650.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323650.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}