{"id": "Does baby powder cause cancer? What to know", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Talc is one of the softest minerals in the world. As a powder, it can absorb oils, moisture, and odor, and reduce friction.\"Baby Powder\" is also the product name of one popular talcum powder.While talcum powder helps prevent diaper rash and infections in babies, adults use it as well. Some people use it on their genital areas, such as around their underwear to keep it dry.Talcum powder is also an ingredient of various makeup products, such as setting powder and foundation.Talc became popular as a cosmetic product when Johnson & Johnson started selling it in the late 1800s.Manufacturers have to mine for talc. The mineral naturally tends to occur near asbestos in the earth. Asbestos is a naturally occurring mineral with known carcinogenic (cancer-causing) effects. Because of their proximity in the ground, many people claim that talcum powder also causes cancer. In this article, learn about these claims, as well as how to reduce any risk.While manufacturers should take responsibility to select talc mining sites carefully to prevent asbestos contamination, there is no federal mandate to test the contents of cosmetic products.Over 6,600 consumers have filed baby powder lawsuits against Johnson & Johnson. Most of these consumers are women who have ovarian cancer. According to their claims, they believe that their cancer developed due to using talcum powder on their genitals.These women back their claims with a variety of studies that have found that long-term use of talcum powder on female genitals may increase the risk of ovarian cancer.Another concern regards asbestos contamination. In April 2018, Johnson & Johnson and another company were found guilty of selling products contaminated with asbestos.There is no clear scientific evidence suggesting that talcum powder causes cancer. At best, there is only a weak link.The issue was first investigated in 1971 when researchers found talc particles in ovarian tumors. A later study in 1982 saw a possible connection between ovarian cancer and using talc on genitals.More recently, a 2014 study found no link between talc and ovarian cancer.However, research from 2016 found that using talc on the genitals could increase the risk of ovarian cancer by 33 percent in participants. However, the study relied on personal interviews based on participants' memories, which may not be accurate.According to a 2018 review, there is a weak but statistically significant association between ovarian cancer and talcum powder used on genitals.However, given this conflicting evidence, as well as many other risk factors of ovarian cancer, such as older age, long-term hormone therapy, family history, and genetics, scientists are unable to say for sure that talcum powder causes cancer.According to the International Agency for Research on Cancer (IARC), talc-based powders are generally not carcinogenic. However, there is a small risk that talcum powder may be carcinogenic for humans when used on genitals.According to the Centers for Disease Control and Prevention (CDC) repeatedly inhaling talc might harm the lungs.The United States Food and Drug Administration (FDA) does not have a stand on the issue due to the ongoing scientific debate.The European Union, however, has banned talc in beauty and health products, so people cannot purchase it in certain European countries.While talcum powder remains popular, there are no medical reasons to use it. The choice is up to the individual whether they wish to use talcum powder or not.According to some reports, talcum powder may cause respiratory problems in babies if inhaled.Alternatives to talc-based baby powders include:Baby powder is a common name for talcum powder, as well as the name of the leading brand. Many people use talcum powder to absorb moisture and reduce friction to help prevent rashes and skin irritation.While some studies suggest that talcum powder may cause ovarian cancer, many of them are poorly designed, small, or rely on personal recollections. There is no clear scientific evidence that talcum powder causes cancer.However, the lawsuits against Johnson & Johnson may produce new research.While U.S. health authorities do not have a clear stance on the use of talcum powders, many countries in Europe have banned its use in cosmetics.To reduce the possible risk of cancer from talc products, people can use alternatives and talk to their doctor about their concerns. Article last reviewed by Tue 30 October 2018.Visit our Cancer / Oncology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Cancer / Oncology.All references are available in the References tab.\t\t\nBerge, W., Mundt, K., Luu, H., & Boffetta, P. (2018, May). Genital use of talc and risk of ovarian cancer: A meta-analysis [Abstract].European Journal of Cancer Prevention,27(3), 248–257. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/28079603Cramer, D. W., Welch, W. R., Scully, R. E., & Wojciechowski, C. A. (1982, July 15). Ovarian cancer and talc: A case-control study. Cancer, 50(2), 372–376. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/7083145Cramer, D. W., Vitonis, A. F., Terry, K. L., Welch, W. R., & Titus, L. J. (2016, May). The association between talc use and ovarian cancer: A retrospective case-control study in two US states. Epidemiology, 27(3), 334–346. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/26689397Henderson, W. J., Joslin, C. A. F., Griffiths, K., & Turnbull, A. C. (1971, March). Talc and carcinoma of the ovary and cervix [Abstract]. BJOG. An International Journal of Obstetrics and Gynaecology ,78(3), 266–272. Retrieved from https://obgyn.onlinelibrary.wiley.com/doi/abs/10.1111/j.1471-0528.1971.tb00267.xHoughton, S. C., Reeves, K. W., Hankinson, S. E., Crawford, L., Lane, D., Wactawski-Wende, J., Thomson, C. A., Ockene, J. K., … Sturgeon, S. R. (2014, September 10). Perineal powder use and risk of ovarian cancer. Journal of the National Cancer Institute, 106(9). Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/25214560IARC monographs on the evaluation of carcinogenic risks to humans: Carbon black, titanium dioxide, and talc. (2010). Retrieved from https://monographs.iarc.fr/wp-content/uploads/2018/06/mono93.pdfRaymond, N. (2018, April 5). J&J loses trial over claims linking cancer to asbestos in talc. Retrieved from https://www.reuters.com/article/us-johnson-johnson-cancer-lawsuit/jj-loses-trial-over-claims-linking-cancer-to-asbestos-in-talc-idUSKCN1HC2PLSchildkraut, T. M. , Abbott, S. E., Alberg, A. J., Bandera, E. V., Barnholtz-Sloan, J., Bondy, M. L., …Moorman, P. G.,(2017, October 1). Association between body powder use and ovarian cancer: The African American cancer epidemiology study (AACES). Cancer Epidemiology Biomarkers Preview,25(10), 1411–1417. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/pmid/27197282/Talc. (2018, August 21). Retrieved from https://www.fda.gov/cosmetics/productsingredients/ingredients/ucm293184.htmTalc and pyrophyllite. (2017, January). Retrieved from https://minerals.usgs.gov/minerals/pubs/commodity/talc/mcs-2017-talc.pdfTalcum powder and cancer. (2017, November 13). Retrieved from https://www.cancer.org/cancer/cancer-causes/talcum-powder-and-cancer.html#referencesWeyant, C. (n. d.). Talcum powder and cancer. Retrieved from https://www.consumersafety.org/health/talcum-powder-cancer/Please use one of the following formats to cite this article in your essay, paper or report:MLAGal, Kat. \"Does baby powder cause cancer? What to know.\" Medical News Today. MediLexicon, Intl., 30 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323525.php>APAGal, K. (2018, October 30). \"Does baby powder cause cancer? What to know.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323525.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323525.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}