{"id": "A simple type of daily meditation may alter the course of Alzheimer's", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The researchers behind the new study assessed a group of older adults experiencing memory difficulties who practiced 12 minutes per day of music listening or simple yoga meditation for 12 weeks.Samples of their blood from before and after the 3 months of therapy revealed changes in levels of certain markers with associations to cell aging and Alzheimer's disease.These changes also linked directly to improvements in subjective assessments of cognitive function, mood, sleep, and quality of life.Dr. Kim Innes, a professor at West Virginia University School of Public Health in Morgantown, led the study and is first author of the study paper, which features in the Journal of Alzheimer's Disease.The team chose to measure a number of blood markers that \"have emerged as possible predictors of cognitive decline and dementia.\" These included telomere length, telomerase activity, and levels of certain beta-amyloid peptides with links to Alzheimer's disease.Telomeres are \"protective caps\" that work to prevent the ends of chromosomes from deteriorating. Telomerase is an enzyme that helps preserve telomere length. Reduction in telomere length and telomerase activity are both \"markers of cellular aging.\"Symptoms of Alzheimer's disease, such as a gradual decline in the ability to remember, think, and make decisions, emerge long after the changes in the brain that cause them have already taken hold.For this reason, and because of the difficulties of diagnosing this form of dementia from symptoms, researchers are pushing for a model that \"defines Alzheimer's by brain changes, not symptoms.\"They argue that this would help clinicians diagnose Alzheimer's much earlier and give therapies a chance to make a real difference in delaying, if not averting, the debilitating symptoms.One change that often occurs in the brains of people with Alzheimer's disease is clumps of beta-amyloid protein. Whether these beta-amyloid clumps in the brain cause the disease or just accompany it, and how they relate to blood levels of the protein, is not entirely clear.Scientists are, however, becoming increasingly confident that a blood test based on beta-amyloid markers will one day be able to predict Alzheimer's long before symptoms such as memory loss and confusion emerge.In the new study, the scientists randomized 60 older adults to undertake a 12-minute daily practice of either a simple yoga meditation called Kirtan Kriya or a music-listening program for 12 weeks. All had undergone assessments that indicated that they had \"subjective cognitive decline.\"The researchers assessed blood markers from samples drawn at the start and end of the 3 months of practice. At these times, and also after another 3 months, they also assessed memory, cognitive function, quality of life, sleep, stress, and mood.After 12 weeks of practice, the yoga meditation group had higher levels of beta-amyloid 40 than the music-listening group.Beta-amyloid 40 is one of the biomarkers that scientists are focusing on as the basis of a potential predictive blood test for Alzheimer's disease.This result does not mean that those with higher levels of beta-amyloid 40 have a higher risk of Alzheimer's; the relationship between higher blood beta-amyloid 40 and amyloid clumps in the brain is not that straightforward.Where scientists are working on a blood test for predicting the disease, for example, they are thinking about using a ratio between beta-amyloid 40 and another beta-amyloid.What is significant about this result, however, is that a change in blood beta-amyloid occurred.The analysis also revealed links between increasing levels of beta-amyloid and improvements in memory, cognitive function, quality of life, mood, and sleep for the 3- and 6-month measuring points. The links were much stronger, however, in the group that did the yoga meditation.Markers of cellular aging also changed in both groups as a result of practice. Telomerase activity went up in both groups, but the increase was only significant in those with lower telomerase activity at the start and who practiced more often. A similar pattern occurred with telomere length.The results also showed links between increases in these two markers and improvements in some of the cognitive and \"psychosocial\" measures.Stress, mood, sleep, quality of life, and other symptoms improved in both groups, but the biggest improvements occurred in the meditation group. These improvements lasted or even strengthened during the 3 months following the intervention.The authors conclude:Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323722.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}