{"id": "Does eating organic food protect against cancer?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Organic food started as a niche product only a few decades ago but is now present in most grocery stores across the United States.In brief, for regulators to class food as organic, farmers and manufacturers must produce it without using synthetic fertilizers, genetically modified organisms, or pesticides.Many consumers assume that it is more healthful to eat organic food than nonorganic food.It may seem sensible to assume that consuming fewer pesticides is beneficial. However, scientists have so far found it challenging to discover ways to prove health benefits that they can associate with organic food.Researchers know that certain pesticides are potentially carcinogenic at higher levels of exposure, but they have yet to understand clearly the impact of long-term, low-level exposure.We all face exposure to a cocktail of chemicals throughout our lives — in food, the water we drink, and the air that we breathe — and this exposure makes their impact on our health even more difficult to dissect.Because organic food contains significantly fewer pesticides than nonorganic food, proponents have long suggested that it might have associated health benefits.Scientists have investigated exposure to pesticides in relation to several health outcomes, such as Alzheimer's disease, Parkinson's disease, infertility, and asthma.To date, only one study has investigated cancer risk and the consumption of organic food. The authors of this 2014 paper concluded that \"there was little or no decrease in the incidence of cancer associated with consumption of organic food, except possibly for non-Hodgkin lymphoma.\"The link with non-Hodgkin lymphoma is important because research has previously linked three pesticides — glyphosate, malathion, and diazinon — to this type of cancer.Recently, researchers set out to put this theory to the test once more. They published their results in JAMA Internal Medicine earlier this week.The scientists drew their data from the French NutriNet-Santé cohort, a large-scale, ongoing study examining various associations between health and nutrition. Their data were sampled from 2009 to 2016 and included 68,946 adults.The research team collected information on diet plus a large number of additional factors. These other observations included the age, sex, occupational status, and educational level of the individuals.The scientists also recorded the amount of sun exposure the participants had, their use of dietary supplements, marital status, monthly income, weight, height, general health, and lifestyle factors.Two months after enrollment in the study, the researchers asked the participants how frequently they ate food from 16 different groups of organic products. Depending on how many of these they consumed, and how often they did so, the researchers gave each person a score out of 32.Every participant also filled out a 24-hour food survey for 3 randomly selected days, and the study followed each participant for an average of 4.5 years. During this time, there were 1,340 new diagnoses of cancer.Even after adjusting for other dietary factors, the results were as expected, and the authors conclude:\"A higher frequency of organic food consumption was associated with a reduced risk of cancer.\"Individuals who ate the most organic produce had a 25 percent lower risk of receiving a cancer diagnosis, during the follow-up, when compared with those eating the least amount of organic produce.Specifically, there was a reduction in non-Hodgkin lymphoma and postmenopausal breast cancer. The authors write that \"no association was detected for other types of cancer.\"The authors are clear that more work will be needed before they can confirm their conclusions. However, if organic food truly does reduce cancer risk, it would be a relatively simple intervention for doctors to recommend — especially to those who are most at risk.Assessing the impact of any food type on health is riddled with difficulties, but measuring the effect of organic food poses even more problems.The main issue is that individuals who choose to eat organic food tend to share traits that go hand in hand with better health outcomes.For instance, people who eat the most organic food are also likely to be more physically active, less likely to smoke, have higher incomes, and be more likely to follow a relatively healthful diet than those who do not. All of these factors may reduce a person's cancer risk.To muddy the waters further, organic produce covers a wealth of food groups: from fish to bacon to Swiss chard. Consequently, researchers may class someone who ate organic beef every day as eating a lot of organic produce.However, people now know that consuming high levels of red meat is a risk factor for colon cancer. Although this is an extreme example, it is easy to see how making sense of this type of data can be a minefield.Although the current research took as many factors into account as possible, it will take many larger and more extended studies before people can conclusively say that organic food reduces the risk of developing cancer.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323407.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}