{"id": "How do you treat a droopy eyelid?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Treatment may not be necessary in cases where there is no impact on vision. However, a droopy eyelid can cover the pupil and reduce vision in some cases.Ptosis can be present at birth, but people can also acquire it later in life due to:Ptosis does not lead to any health issues, in most cases, and is easily manageable.Congenital ptosis is present from birth and may have genetic causes. It can affect one or both eyelids.Congenital ptosis can impair vision and cause amblyopia, sometimes known as lazy eye.In a 2013 study of 107 children with ptosis, researchers noted lazy eye in around 1 in 7 of the participants.People can also acquire ptosis later in life.A common cause is accidental stretching or tearing of the levator aponeurosis, which is a tendon-like sheathe that allows the eyelid to move.Damage may occur from:The eyes and eyelids are delicate, and there are many other potential causes of acquired ptosis, including:Potential risk factors for ptosis include:It is hard to stop the development of ptosis, particularly if it is congenital. Acquired ptosis may have causes that are not preventable.An example of acquired ptosis is when the natural aging processes weaken the eyelid muscles.Other factors, such as eye trauma, surgery, or the development of muscular and nerve damage, can also be difficult to avoid.A 2015 study from the Aesthetic Surgery Journal notes that there is no link to lifestyle factors including smoking, alcohol use, or body mass index.Avoiding the use of contact lenses and excessive eye rubbing, however, can reduce the risk of acquired ptosis.A 2016 paper, in the Journal of Clinical and Aesthetic Dermatology, notes that Botox injections, often by inexperienced injectors, are mostly connected to ptosis in aesthetic medicine.Choosing a Botox injector with good experience will usually decrease the chances of eyelid ptosis when a person is receiving an injection for lines between the eyebrows.The main symptom of ptosis is the droopy eyelid itself.This droop is unnoticeable in many cases and does not cause pain. In other cases, a person may consider the condition has a negative impact on their appearance, and it may impact psychological well-being.The eyelid may cover enough of the eye to impair vision in some cases, which may be worse when reading or looking downwards.It can also cause the eyebrow to raise to compensate for the visual block, which can tire the muscles in the face.Treatment for ptosis will depend on its severity.Ptosis rarely causes discomfort or other health issues, so treatment is often not required. Treatment may be desirable for cosmetic purposes or to fix visual impairments.Surgery may be used to treat ptosis in specific cases. The aim of this surgery is typically to tighten the levator muscle or repair the levator aponeurosis, which can help raise the eyelid.The procedure is safe, but complications are possible. In some cases, the surgery can undercorrect the problem.Overcorrecting is also a potential complication. This leaves the eyelid either too high or too low and requires further surgery.In a 2018 study, researchers examining revision rates for ptosis surgery among 1,519 patients found that 8.7 percent of cases required further surgery.Treating eyelid ptosis caused by Botox injections can include stimulation of the muscle with the back of an electric toothbrush, application of eye drops, or merely allowing time to take its course, as this ptosis will usually correct itself in 3 to 4 weeks.Ptosis is unlikely to have a significant impact on health. Ptosis is barely noticeable in most cases and does not have a major effect on daily life.It may disrupt vision or have a more noticeable impact on appearance in other cases. Treatment, including surgery, is available in such cases.It is not possible to cure ptosis unless the cause is a Botox injection, but treatment can easily manage the condition. Article last reviewed by Thu 18 October 2018.Visit our Eye Health / Blindness category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Eye Health / Blindness.All references are available in the References tab.\t\t\nAhmad, K., Wright, M., & Lueck, C. J. (2011, December). Ptosis. Practical Neurology, 11(6), 332–340. Retrieved from https://www.researchgate.net/profile/Kate_Ahmad/publication/51815184_Ptosis/links/02e7e528b468591592000000/Ptosis.pdfBoyd, K. (2018, August 22). What is ptosis? Retrieved from https://www.aao.org/eye-health/diseases/what-is-ptosisChou, E., Liu, J., Seaworth, C., Furst, M., Amato, M., Blaydon, S., … Shore, J. W. (2018, May–June). Comparison of revision rates of anterior- and posterior-approach ptosis surgery: A retrospective review of 1519 cases [Abstract]. Ophthalmic Plastic and Reconstructive Surgery, 34(3), 246–253. Retrieved from https://journals.lww.com/op-rs/Abstract/2018/05000/Comparison_of_Revision_Rates_of_Anterior__and.12.aspxGriepentrog, G. J., Diehl, N., & Mohney, B. G. (2014, June 1). Amblyopia in childhood eyelid ptosis. American Journal of Ophthalmology, 155(6), 1125–1128. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3905803/King, M. (2016, December). Management of ptosis. The Journal of Clinical and Aesthetic Dermatology, 9(12), E1–E4. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5300727/Satariano, N., Brown, M. S., Zwiebel, S., & Guyuron, B. (2015, March 20). Environmental factors that contribute to upper eyelid ptosis: A study of identical twins. Aesthetic Surgery Journal, 35(3), 235–241. Retrieved from https://academic.oup.com/asj/article/35/3/235/200993SooHoo, J. R., Davies, B. W., Allard, F. D., & Durairaj, V. D. (2014, September–October). Congenital ptosis [Abstract]. Survey of Ophthalmology, 59(5), 483–492. Retrieved from https://www.sciencedirect.com/science/article/pii/S0039625714000277Please use one of the following formats to cite this article in your essay, paper or report:MLAKandola, Aaron. \"How do you treat a droopy eyelid?.\" Medical News Today. MediLexicon, Intl., 18 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323386.php>APAKandola, A. (2018, October 18). \"How do you treat a droopy eyelid?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323386.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323386.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}