{"id": "Spinal stimulation helps men with paraplegia walk again", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Many years previously, the three men sustained injuries in the cervical area, or neck region, of their spinal cords that had left them paralyzed in their lower bodies.The new \"therapeutic framework\" responsible for their rehabilitation is called Stimulation Movement Overground (STIMO).It is the result of a collaboration between Ecole Polytechnique Fédérale de Lausanne (EPFL) and the Lausanne University Hospital (CHUV), both in Switzerland.Two journals, Nature and Nature Neuroscience, have now published study papers about the new stimulation approach.What is remarkable about the new method — and distinguishes it from two recently published studies from the United States on a similar topic — is that the men could move their legs when the electrical stimulation to the spinal cord was switched off.In one of the study papers, the researchers explain the importance of \"preserving proprioception\" in order to restore movement control in humans with spinal cord injury.Proprioception is the ability to sense bodily position and movement by processing signals that come from the body itself, as opposed to its environment. Scientists often describe it as a \"sixth sense.\"Some who have written about it have cited the example of a man who, despite being able to make his muscles contract, was effectively immobile after an \"infection deprived him of the sense of position, movement, and touch in his body\" — or his proprioception.The researchers in Switzerland maintain that if electrical stimulation of the spinal cord does not have the right combination of precise location targeting and timing of pulses, it can interfere with proprioception.The STIMO method can overcome this by using \"burst stimulation and spatiotemporal stimulation profiles.\" Using simulations, the researchers showed that it enabled \"robust control over motor neuron activity.\"\"The exact timing and location of the electrical stimulation,\" explains co-author Jocelyne Bloch, a professor and neurosurgeon at CHUV, who carried out the implant surgery, \"are crucial to a patient's ability to produce an intended movement.\"Senior study author Prof. Grégoire Courtine, a neuroscientist at EPFL, notes that, following years of researching animal models, they \"were able to mimic in real time how the brain naturally activates the spinal cord.\"He suggests that the precise combination of location and timing of the impulses is what helped generate new nerve connections.Prof. Bloch says that it has to be \"as precise as a Swiss watch.\" The implants consist of a series of electrodes that target specific groups of leg muscles.\"Selected configurations of electrodes are activating specific regions of the spinal cord, mimicking the signals that the brain would deliver to produce walking,\" she adds.The three men had to learn how to time their intention to walk with the stimulation pulses. After only 1 week of this \"calibration\" phase, all three were walking with \"body-weight support.\"\"All the patients could walk using body-weight support within 1 week. I knew immediately that we were on the right path.\"Prof. Jocelyne BlochWithin 5 months, their \"voluntary muscle control improved tremendously,\" says Prof. Courtine. \"The human nervous system responded even more profoundly to the treatment than we expected.\"The men showed no fatigue in their leg muscles and were walking hands-free for more than a kilometer during their rehabilitation sessions.The intense and lengthy sessions helped the men's nervous systems to trigger \"activity-dependent plasticity\" and reorganize nerve fibers. This is what led to improved movement ability, even in the absence of stimulation.The team now wants to translate the findings into tailored treatments that can be used in hospitals and clinics.The scientists are also now developing \"next-generation neurotechnology,\" which they hope to test soon after injury when there is a greater chance of recovery because the affected tissue has not started to die off.According to estimates from the National Spinal Cord Injury Statistical Center at the University of Alabama at Birmingham, there are about 288,000 people living with spinal cord injury in the U.S. Every year, medical professionals diagnose around 17,700 new cases, of which 78 percent are in males.Injury incurred during vehicle crashes account for most (38 percent) cases of spinal cord damage in the U.S., followed by falls (32 percent). Other relatively common causes include wounding from gunshots and other violent acts (14 percent), together with injuries that occur during sports or recreation (8 percent).The following video from EPFL summarizes the research and illustrates the progress that the three men made during their rehabilitation.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323567.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}