{"id": "What's the difference between inverse psoriasis and intertrigo?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.People can easily confuse inverse psoriasis with intertrigo, as the symptoms and areas affected are similar. However, their causes and treatments are different.In this article, we look at what distinguishes the two conditions, including the differences between their causes and symptoms.Inverse psoriasis, also known as intertriginous or flexural psoriasis, is a type of psoriasis that affects the skin folds of the body. Between 3 and 7 percent of people with psoriasis experience inverse psoriasis.Psoriasis is an autoimmune condition, which means that it results from an immune reaction by a person's body against their own cells or tissues.Intertrigo is not an autoimmune condition. It is a skin disorder caused by skin-on-skin friction in moist and warm body areas.In contrast to intertrigo, inverse psoriasis is a persistent or chronic condition. This means that, although treatment can reduce and even eliminate its symptoms for a period, which doctors call remission, they eventually return, which known as a relapse.There are several similarities and differences in the symptoms and body parts affected by the two conditions:Inverse psoriasis causes inflammation and smooth patches of redness on the skin, which become worse with sweat and friction. These skin patches are often moist and shiny.Inverse psoriasis typically affects the skin folds:Intertrigo mainly affects the top layers of the skin in warm and moist body areas. The skin usually becomes pink, red, or brown and may start to break down if it is very moist. The area may have an unpleasant smell.Intertrigo affects many of the same areas as inverse psoriasis.In inverse psoriasis, a person's immune system triggers chronic inflammation. This inflammation causes the skin cells to grow too fast and to accumulate on the skin surface. This causes the smooth, shiny, reddish patches that are characteristic of the condition.Frequently, Candida fungus or bacteria accumulate in the areas of the body that are affected.Intertrigo is not related to the immune system but caused by the friction of skin folds against each other. Skin infections due to bacteria or fungus can contribute to the condition.Doctors can diagnose inverse psoriasis and intertrigo by examining a person's skin and skin lesions. They may also perform one or more of the following tests:A skin biopsy, where they collect a small sample of the person's skin to examine under a microscope.A simple test called a KOH exam to check if a fungus is causing the symptoms. For this test, the doctor scrapes a small portion of skin with a needle or a blade and examines it under a microscope.A Wood lamp skin examination to check if a bacterium is causing the symptoms. For this test, the doctor looks at the affected skin area under ultraviolet light.People who are overweight and those with deep skin folds have a higher risk of developing inverse psoriasis than others. People who are overweight are also more likely to develop intertrigo.People are more likely to develop inverse psoriasis if they have:The following are risk factors for developing intertrigo:To treat inverse psoriasis, doctors may prescribe the following medications:Doctors may also prescribe medications to treat intertrigo, such as:People may use lifestyle changes and home care to relieve the symptoms of both inverse psoriasis and intertrigo, including:People may wish to talk to their doctor in the following circumstances:Inverse psoriasis and intertrigo are two skin conditions that affect areas where the skin folds, such as the armpits, groin, and abdomen, causing an itchy, red rash.Although their symptoms are similar, inverse psoriasis and intertrigo are separate conditions with different causes and treatments. Psoriasis is an autoimmune condition, while skin-on-skin friction causes intertrigo.While there is no cure for inverse psoriasis, treatments can relieve or clear up a person's symptoms. People can easily manage intertrigo with home care and use lifestyle measures and medications to control the symptoms of both conditions. Article last reviewed by Mon 12 November 2018.Visit our Psoriasis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Psoriasis.All references are available in the References tab.\t\t\nGuglielmetti, A., Conlledo, R., Bedoya, J., Ianiszewski, F., & Correa, J. (2012, December). Inverse psoriasis involving genital skin folds: Successful therapy with dapsone. Dermatology and Therapy, 2(1), 15. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3510394/Inverse psoriasis (n.d.). Retrieved from https://www.psoriasis.org/about-psoriasis/types/inverseMetin, A., Dilek, N., & Bilgili, S. G. (2018, April 17). Recurrent candidal intertrigo: Challenges and solutions. Clinical, Cosmetic and Investigational Dermatology, 11, 175−185. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5909782/Nobles, T., & Miller, R. A. (2018, October 3). Intertrigo. Retrieved from https://www.ncbi.nlm.nih.gov/books/NBK531489/Torsekar, R., & Gautam, M. M. (2017, July−August). Topical therapies in psoriasis. Indian Dermatology Online Journal, 8(4), 235−245. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/28761838Please use one of the following formats to cite this article in your essay, paper or report:MLASilva, Joana Cavaco. \"What's the difference between inverse psoriasis and intertrigo?.\" Medical News Today. MediLexicon, Intl., 12 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323660.php>APASilva, J. (2018, November 12). \"What's the difference between inverse psoriasis and intertrigo?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323660.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323660.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}