{"id": "Drug resistance: Does antibiotic use in animals affect human health?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Antibiotic resistance poses a serious threat to public health, both in the United States and globally.According to the Centers for Disease Control and Prevention (CDC), antibiotic resistance is responsible for 25,000 annual deaths in the European Union and 23,000 annual deaths in the U.S. As many as 2 million U.S. individuals develop a drug-resistant infection each year.By the year 2050, some researchers predict that antibiotic resistance will cause 10 million deaths every year, surpassing cancer as the leading cause of mortality worldwide.Some of the factors that have led to this crisis include the overprescription of antibiotics, poor sanitation and hygiene practices in hospitals, and insufficient laboratory tests that can detect an infection quickly and accurately.An additional factor that may contribute to drug resistance in humans is the overuse of antibiotics in farming and agriculture. Using antibiotics in animals may raise the risk of transmitting drug-resistant bacteria to humans either by direct infection or by transferring \"resistance genes from agriculture into human pathogens,\" researchers caution.So, how are antibiotics currently being used in animals, and what might be the implications for human health? At the London Microbiome Meeting, which took place in the United Kingdom, Nicola Evans — a doctoral researcher in structural biology at King's College London — shared some of her insights on these issues.In her presentation, Evans drew from the work she conducted at the U.K. Parliament, which can be read in full here. In this Spotlight feature, we report on the key findings from her talk.On a global scale, the U.S. and China are the largest users of antibiotics for food production. According to the Food and Drug Administration (FDA), 80 percent of the total antibiotic use in the U.S. is in agriculture, with pigs and poultry receiving five to 10 times more antibiotics than cows and sheep.Why are antibiotics used so widely in these animals, however? One answer comes from the demands of the meat industry, which place a strain on the animals' health.Farming animals for meat is a particularly intense process, with pig sows, for instance, not being given enough time to recover in-between births. This compromises their immune system.Also, pigs and chickens live in confined, crowded spaces, which increases their stress and the risk of disease transmission.Additionally, antibiotics are sometimes used to make the animals grow faster. In humans, studies have shown that antibiotics raise the risk of weight gain and obesity, as they wipe out beneficial gut bacteria that help regulate weight.In animals, however, this phenomenon has been seen as a positive, with several countries still using antibiotics as growth promoters.Until a year ago, U.S. farmers used antibiotics as growth promoters, but the practice has since been banned. China and the E.U. have also outlawed this practice, but many other countries continue to use antibiotics to promote growth in animals, Evans explained.Finally, the prophylactic, or preventive, use of antibiotics also adds to the problem. Many farms give chicks antibiotics as soon as they are born, regardless of whether they are ill or not.The weaning practices that take place in farms influence the animals' microbiome and create a false need for antibiotics. As Evans explained in her talk, piglets are taken away from their mothers too early — that is, before they've had a chance to develop a strong immune system or a healthy, fully matured gastrointestinal tract.For example, piglets would naturally wean when they are around 3–4 months of age.In the U.S., however, piglets are weaned when they are 17–28 days old.Evans explained that not having access to the natural antibodies present in the mothers' milk impacts the animals' immune system. \"Abrupt\" weaning has also been found to raise the risk of gastrointestinal disease in calves and lambs.In turn, these diseases call for the use of antibiotics, sometimes prophylactically. For instance, piglets, calves, and lambs can have post-weaning diarrhea and associated infections, so farmers give them antibiotics to prevent such infections.Also, Evans explained in her talk, a pig's microbiome \"is colonized at birth and subsequently modified during the suckling period\" and the weaning period. During this time, the gut microbiome diversifies.However, research has shown that abrupt weaning, which involves a drastic change in diet and environment, can cause a loss of microbial diversity and an imbalance between beneficial and harmful bacteria in the gut.Furthermore, genomic studies cited by Evans have found a dramatic increase in Escherichia coli in the pigs' small intestines after receiving antibiotics. E. coli is responsible for half of all piglet deaths worldwide.An animal's environment also plays a critical role in developing a diverse and healthy microbiome. Past studies, for example, found that a pig's microbiome can be influenced by something as simple as the presence of straw.Having straw in the environment led to a different ratio of gut bacteria in pigs, and straw has been associated with a lower risk of developing porcine reproductive and respiratory syndrome.As Evans noted in her talk, the poultry microbiome is even more affected by intensive farming practices than that of the pig.The main reason for this is that in birds, the early gut colonization occurs during the development of the egg in the mother's oviduct. The chicks absorb microorganisms from the mother at this stage, as well as through the pores of the eggs during brooding.Once the chicks have hatched, they continue to enrich their microbiome by exposure to feces. However, in modern farming systems, the eggs are taken away from the mother and cleaned on the surface, which removes the beneficial bacteria.Also, when the eggs hatch, the chicks do not get access to an outdoor space where they would have access to feces and other sources of beneficial bacteria. They also do not interact with adult chickens.Finally, the crowded conditions that chickens often live in can cause heat stress. This, in turn, is a fertile ground for the development of E. coli and Salmonella infections. This is yet another example of how the environment can affect the birds' microbiome.So, what does this use of antibiotics in animals mean for human health? We spoke to Evans about the potential implications for antibiotic resistance in humans.\"The most important thing to consider,\" she said, \"is that any single time antibiotics are used, whether in animals or humans, you risk selecting for drug-resistant bacteria. We need to safeguard [antibiotics] for the use in both animals and humans, to ensure they can be used for the treatment of infection in the future.\"There are a few main ways in which antibiotics in animals can affect humans, Evans explained. Firstly, direct contact between animals and humans can cause disease. \"For example,\" said the researcher, \"farmers are at risk of being colonized by the Livestock-Associated MRSA (LA-MRSA).\"\"LA-MRSA isn't as dangerous as [Hospital-Associated]-MRSA,\" she explained, \"as it is adapted for animals and does not spread as easily from person to person. However, there is a risk that bacteria could change and adapt to humans,\" Evans cautioned.She went on to quote a Danish study that found that 40 percent of commercially sold pork meat contained methicillin-resistant Staphylococcus aureus (MRSA).A review of existing studies on the pork production chain found that \"the slaughter process plays a decisive role in MRSA transmission from farm to fork.\"A second way in which animal antibiotic use can affect humans is through the consumption of antibiotic residues in meat, which then \"provide a selection pressure in favor of [antibiotic-resistant] bugs in humans,\" Evans explained.However, \"the risk [of] this is considered to be very low in the E.U. and America,\" she continued.\"In these areas, there is something called a withdrawal period, [in which] antibiotic treatment of an animal is stopped so that antibiotics can clear the system before the animal is culled for meat or milked.\"This applies to both organic and nonorganic farming practices, Evans noted. After the withdrawal period, she said, \"[t]he levels of antibiotic in the food are considered to be several hundred times below the levels [that] should affect bacteria in any way.\"Finally, the antibiotic-resistant bacteria present in meat may transfer antimicrobial resistance into human bacteria. However, the risk of this occurring is very low due to high cooking temperatures.Also, \"because of the withdrawal period,\" Evans said, \"it is very unlikely that antibiotic residues in meat would affect the [human] microbiome.\"Overall, the researcher told Medical News Today, \"I think that all use of antibiotics poses a risk to human health, and that reducing unnecessary antibiotic use in animals should be part of the overall solution. \"\"Antibiotics are needed [...] to safeguard animal health and welfare, but should only be used when the animals are sick and not used for growth promoters or to prevent animals getting sick in the first place. However, animal use shouldn't detract from the fact that the vast majority of antibiotic resistance in humans is caused by overuse in humans.\"\"[C]urrent evidence indicates that there is no direct impact of antibiotic residues in meat on human health, but the risk of generating antibiotic-resistant bacteria in animals poses a potential risk to humans. However, human antibiotic use is far more damaging in both respects.\"Nicola EvansYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323639.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}