{"id": "What to know about baby acne", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The causes and treatments of baby acne, also called neonatal acne, are different from those of adult acne.This article will take a look at the prevalence and symptoms of baby acne. It will also list other skin conditions that people may mistake for baby acne and offer some practical management tips.About 20 percent of newborn babies will have neonatal acne. This tends to develop when the baby is around 2 weeks old, but it can occur at any time in the first 6 weeks of life. Occasionally, babies are born with neonatal acne.Infantile acne is less common. It refers to acne that develops after 6 weeks of age. It typically occurs between 3 and 6 months. While it usually clears up within 6 months to a year, some children will have acne for longer, possibly through to their teenage years.Baby acne is more common in males than females.Doctors are unsure as to what causes neonatal acne. Testosterone causing overactivity in the skin's oil glands may contribute to the development of infantile acne.Neonatal acne will look like red spots or white pimples, rather than blackheads. These spots usually affect a baby's cheeks and nose, but they can also develop on the:Infantile acne usually involves blackheads and whiteheads, along with the red spots and pimples. It can also cause cysts, which can lead to scarring. It tends to affect the cheeks, chin, and forehead. It can also develop on the body, though this is less common.There are several skin conditions that people may mistake for baby acne. These include:Erythema toxicum neonatorum is a common but harmless skin condition that can affect some newborns. Small spots and pimples of 1–4 millimeters across appear on the body, arms, and legs, but not on the palms of the hands or soles of the feet.The rash will either be present when the baby is born or appear within 1–2 days of life. It will usually get better by itself within 5–14 days.Chickenpox, which the varicella-zoster virus causes, is a contagious skin disease. It causes a rash of blister-like spots and pimples, as well as itching, tiredness, and fever.A chickenpox rash tends to start on the stomach, back, and face, but it can spread across the whole body. Baby acne, on the other hand, does not usually spread below the upper chest or back.In babies, chickenpox can lead to serious complications, such as skin, brain, and bloodstream infections, dehydration, or pneumonia. Anyone who suspects that a baby has chickenpox should talk to a doctor.Eczema is a group of conditions that includes atopic dermatitis, contact dermatitis, and dyshidrotic eczema. Sometimes, it also includes seborrheic dermatitis, or cradle cap. However, this condition does not itch as other types of eczema do.Eczema usually appears in the first 6 months to 5 years of life, and it looks like a rash.If eczema develops when a baby is 6 months old or younger, it usually appears on the face, cheeks, chin, forehead, and scalp. The skin may appear red and weepy.For babies between 6 months and 1 year old, eczema usually appears on the elbows or knees. If the rash becomes infected, a yellow crust or small, pus-filled lumps may develop.Certain triggers can make a baby's eczema worse. Such triggers may include:Bacterial folliculitis is the medical name for an inflamed hair follicle. Infection and injury can cause bacterial folliculitis. Irritating substances, such as ingredients in creams or ointments, can also lead to folliculitis. Folliculitis is uncommon in babies.This skin condition tends to look very similar to an acne breakout, but each spot may have a red ring around it. It can appear anywhere on the body, except on the palms of the hands and soles of the feet.Neonatal herpes is rare, affecting just 10 in every 100,000 births worldwide. It may cause a rash over the body, and babies with neonatal herpes can be very ill. Occasionally, though, it causes only cold sores or blisters around the lips and mouth, which caregivers may mistake for acne.Antiviral medications are the most effective methods of treating the cold sores. However, these do not cure the infection itself. Cold sores will develop periodically for the rest of the child's life.Anybody concerned that a newborn has any type of herpes or cold sores should seek medical care right away.Neonatal acne does not usually require treatment.According to the American Academy of Dermatology (AAD), baby acne tends to go away on its own within a few weeks to months. They advise caregivers never to use acne wash or treatment on a baby's skin unless a doctor recommends certain treatments.The AAD's other tips for treating baby acne are to:A healthcare professional will usually diagnosis infantile acne after carrying out a physical examination. In many cases, infantile acne will not require treatment and will resolve by itself.The healthcare professional may recommend a cream to treat infantile acne. Sometimes, they may prescribe antibiotics. In severe cases, where the acne may scar, they may recommend other pills or topical treatments.Neonatal acne occurs when the baby is in the first 6 weeks of life. It is usually nothing to worry about and will go away on its own.If a baby develops acne when they are older than 6 weeks, or infantile acne, a doctor should rule out other skin conditions.Anyone concerned about their baby's skin, or who suspects a condition such as chickenpox or eczema, should speak to a doctor.Neonatal acne is not usually a cause for concern, and it tends to go away on its own in a few weeks or months. It does not tend to cause any scarring.Caregivers may confuse baby acne with other skin conditions, such as eczema or erythema toxicum neonatorum. If in doubt about the diagnosis, a person should speak to their doctor.Most cases of neonatal acne do not require treatment, though a doctor may prescribe creams where necessary.Infantile acne also tends to clear up by itself, though severe cases may lead to scaring. Article last reviewed by Mon 12 November 2018.Visit our Pediatrics / Children's Health category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Pediatrics / Children's Health.All references are available in the References tab.\t\t\nAbout chickenpox. (2016, July 1). Retrieved from https://www.cdc.gov/chickenpox/about/index.htmlAcne-like breakouts could be folliculitis. (n.d.). Retrieved from https://www.aad.org/public/diseases/bumps-and-growths/folliculitisComplications. (2016, July 1). Retrieved from https://www.cdc.gov/chickenpox/about/complications.htmlErythema toxicum neonatorum. (n.d.). Retrieved from https://www.aocd.org/page/ETNHerpes simplex virus. (2017, 31 January). Retrieved from http://www.who.int/news-room/fact-sheets/detail/herpes-simplex-virusIs that acne on my baby's face? (n.d.). Retrieved from https://www.aad.org/public/diseases/acne-and-rosacea/newborn-acneNeonatal and infantile acne. (2015, August 10). Retrieved from https://www.dermcoll.edu.au/atoz/neonatal-infantile-acne/Serna-Tamayo, C., Janniger, C. K., Micali, G., & Schwartz, R. A. (2014, July). Neonatal and infantile acne vulgaris: An update. , 94(1), 13–16. Retrieved from https://www.mdedge.com/cutis/article/84377/pediatrics/neonatal-and-infantile-acne-vulgaris-updateSigns & Symptoms. (2016, July 1). Retrieved from https://www.cdc.gov/chickenpox/about/symptoms.htmlUnderstanding your child's eczema. (n.d.). Retrieved from https://nationaleczema.org/eczema/children/Please use one of the following formats to cite this article in your essay, paper or report:MLABarrell, Amanda. \"What to know about baby acne.\" Medical News Today. MediLexicon, Intl., 12 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323656.php>APABarrell, A. (2018, November 12). \"What to know about baby acne.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323656.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323656.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}