{"id": "What to know about lung cancer", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.According to the Centers for Disease Control, 218,527 people in the United States received a lung cancer diagnosis in 2015. Early diagnosis can help a person seek treatment, as early as possible, in the disease's course.Identifying lung cancer in its earliest stages can be difficult, however, because the symptoms may be similar to those of a respiratory infection, or there may be no symptoms at all.In this article, we explain the nature of lung cancer, how to recognize the symptoms, and the ways doctors treat lung cancer before it becomes life-threatening.Cancer causes certain mutations in otherwise healthy cells.Typically, the body programs cells to die at a certain stage in their life cycle to avoid overgrowth. Cancer overrides this instruction, causing cells to grow and multiply when they should not.The overgrowth of cells leads to the development of tumors and the harmful effects of cancer.In lung cancer, this pattern of cell overgrowth occurs in the lungs, which are vital organs for breathing and gas exchange.Doctors typically diagnose two lung cancer types, small cell and non-small cell, depending on how they appear under a microscope. A person is more likely to have non-small cell lung cancer than small cell.While anyone can develop lung cancer, cigarette smoking and exposure to smoke can increase the likelihood that a person will experience the condition. Lung cancer can develop if a person has a history of exposure to inhaled chemicals or other toxins.\nEven if this exposure to chemicals and other toxins was a long time ago, it could cause changes in lung cells that lead to cancer.In people with lung cancer, symptoms do not always occur until the condition has reached a later stage.However, some people may notice symptoms, which they may think are related to a less serious, acute illness.Examples of these symptoms include:A person may also experience more severe symptoms associated with lung cancer. These include severe chest or bone pain or coughing up blood.If a doctor identifies a suspicious lesion on a lung cancer screening, or a person is experiencing symptoms that could indicate lung cancer, several diagnostic tests are available to confirm the next steps.Examples of these include:Imaging studies: Computed tomography (CT) and positron emission tomography (PET) scans might reveal areas of lung tissue with cancer. Bone scans can also indicate cancerous growths. Doctors may also use these scans to track the progress of treatment or to ensure cancer has not returned, following a course of treatment.Tissue sampling: If a doctor identifies a suspicious lesion on an imaging study, they may recommend taking a sample of lung tissue to test for potentially cancerous cells.There are different ways to take a tissue sample, and the method often depends on the location of the lesion.One example is when a doctor performs a bronchoscopy, which involves inserting a special thin, lighted scope with a camera on the end. This helps the doctor to see the lesion and then to obtain samples.Less accessible lesions in the lungs may require a more invasive surgical procedure to remove lung tissue, such as thoracoscopy or video-assisted thoracic surgery.Lab testing: A doctor may also order sputum testing or blood testing to check for the presence of lung cancer.A doctor will use this information to determine what type of lung cancer may be present, and how advanced the disease has become.Early diagnosis of lung cancer can be lifesaving. This is because lung cancer cells can travel to other areas of the body before a doctor detects them in the lungs. If this spread or metastasis has taken place, it makes treating the disease much more difficult.Sometimes, a doctor will recommend a person have lung cancer screenings. These are performed using a low-dose CT scanner. Not everyone is a candidate for this screening, but it can help doctors identify lung cancer earlier in some individuals.According to the American Lung Association, people who may be candidates for lung cancer screenings are those who:Insurance will often cover this screening if a person meets all these criteria. However, people should always check with their insurance company before signing up for lung cancer screening.\nThe staging of cancer indicates how far it has spread through the body and its severity. This classification helps clinicians support and direct treatment for the best results.Each stage determines whether cancer has or has not spread or has spread to nearby lymph nodes. It may also take into account the number and size of the tumors.The lymph nodes are part of the lymphatic system, which connects to the rest of the body. If cancer reaches these, it can metastasize, or spread further, becoming more dangerous.Staging for lung cancer is extremely complex and extensive with several sub-groups within each stage.Initially, clinicians divide it into small cell and non-small cell classifications.Staging definitions may vary, but doctors typically stage non-small cell lung cancer using the tumor size and the spread to guide them in the following way:Small cell lung cancer has its own categories, limited and extensive, referring to whether cancer has spread within or outside the lungs.Treatments for lung cancer depend on its location and stage, as well as the overall health of the individual.Surgery and radiation are the most common approaches to treating lung cancer, but other treatments are available. For example, doctors often treat small cell lung cancer with chemotherapy.Possible treatments include:Surgery: A doctor may operate to remove cancerous lung tissue and tissue in the surrounding areas where cancer may have spread. This sometimes involves removing a lobe or large segment of the lung in a procedure called a lobectomy.In severe cases, the surgeon may remove a lung in its entirety. A person can live without a lung, but being in good health prior to surgery helps to improve outcomes after lung removal.Chemotherapy: This treatment uses drugs to shrink or eradicate cancer cells. These medications target rapidly dividing cells, which makes them ideal for treating cancer.Chemotherapy treatment has a more significant impact on cancers that have spread to different parts of the body and require a body-wide attack.However, chemotherapy is a powerful intervention and can have side effects including extreme nausea and weight loss.Radiation therapy: This approach uses high-energy rays to kill cancerous cells. A doctor may also use radiation to shrink a tumor before removing it surgically.Radiation therapy is mainly useful on cancers that occur in one location and have not spread.Targeted therapy: This is the use of particular medications that specifically target a particular behavior in cancer cells. Examples include medicines that stop cancer cells from multiplying.Lung cancer treatment often involves the collaboration of medical experts in many areas. These specialists may include:Lung cancer is the leading cause of cancer death, according to the American Cancer Society. An estimated 154,050 people are expected to die from lung cancer in 2018.The disease carries a higher risk of death than breast, colon, and prostate cancer combined. It is also largely preventable through not smoking. Lung cancer is more treatable if diagnosed in its early stages.The prognosis and outlook for lung cancer depend upon the cancer type and the spread. People should talk to their doctor who can provide a more accurate prognosis, taking into account the individual's overall health and the extent of their cancer.Lung cancer is a serious and potentially deadly disease that affects a person's ability to breath.However, early diagnostic screening of individuals who are at high risk for lung cancer can help them receive treatment in earlier and more treatable stages. The size and spread of cancer determine people's outlook.Treatment options include surgery to remove sections or all of the lung, chemotherapy, and radiation therapy, as well as targeted drug therapy.If a person has concerns that they could be at risk for lung cancer, they should talk to their doctor.What is the best way to prevent lung cancer?The best way to prevent lung cancer is not to smoke cigarettes or to quit smoking if you are a smoker. Article last reviewed by Thu 15 November 2018.Visit our Lung Cancer category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Lung Cancer.All references are available in the References tab.\t\t\nHow is lung cancer diagnosed and treated? (2018, July 19). Retrieved from https://www.cdc.gov/cancer/lung/basic_info/diagnosis_treatment.htmIs lung cancer screening right for me? (2018, March 13). Retrieved from https://www.lung.org/lung-health-and-diseases/lung-disease-lookup/lung-cancer/learn-about-lung-cancer/lung-cancer-screening/is-lung-cancer-screening-right.htmlKey statistics for lung cancer. (2018, January 4). Retrieved from https://www.cancer.org/cancer/non-small-cell-lung-cancer/about/key-statistics.htmlLung cancer basics. (2018, July 13). Retrieved from https://www.lung.org/lung-health-and-diseases/lung-disease-lookup/lung-cancer/learn-about-lung-cancer/what-is-lung-cancer/lung-cancer-basics.htmlLung cancer symptoms. (2018, March 26). Retrieved from https://www.lung.org/lung-health-and-diseases/lung-disease-lookup/lung-cancer/learn-about-lung-cancer/symptoms/NCI Dictionary of Cancer Terms: Occult stage non-small cell lung cancer. (n.d.). Retrieved from https://www.cancer.gov/publications/dictionaries/cancer-terms/def/occult-stage-non-small-cell-lung-cancerNCI Dictionary of Cancer Terms: Stage 0 non-small cell lung carcinoma in situ. (n.d.). Retrieved from https://www.cancer.gov/publications/dictionaries/cancer-terms/def/stage-0-non-small-cell-lung-carcinoma-in-situNon-small cell lung cancer stages. (2017, December 18). Retrieved from https://www.cancer.org/cancer/non-small-cell-lung-cancer/detection-diagnosis-staging/staging.htmlStaging lung cancer. (2015, March 31). Retrieved from https://www.macmillan.org.uk/information-and-support/lung-cancer/non-small-cell-lung-cancer/treating/treatment-decisions/understanding-your-diagnosis/staging-and-grading.htmlWhat is lung cancer? (2018, July 19). Retrieved from https://www.cdc.gov/cancer/lung/basic_info/what-is-lung-cancer.htmPlease use one of the following formats to cite this article in your essay, paper or report:MLANall, Rachel. \"What to know about lung cancer.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323701.php>APANall, R. (2018, November 16). \"What to know about lung cancer.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323701.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323701.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}