{"id": "What was medieval and Renaissance medicine?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In southern Spain, North Africa, and the Middle East, Islamic scholars were translating Greek and Roman medical records and literature.In Europe, however, scientific advances were limited.Read on to find out more about medicine in the Middle Ages and the Renaissance.The Early Middle Ages, or Dark Ages, started when invasions broke up Western Europe into small territories run by feudal lords.Most people lived in rural servitude. Even by 1350, the average life expectancy was 30–35 years, and 1 in 5 children died at birth.There were no services for public health or education at this time, and communication was poor. Scientific theories had little chance to develop or spread.People were also superstitious. They did not read or write, and there was no schooling.Only in the monasteries was there a chance for learning and science to continue. Often, monks were the only people who could read and write.Around 1066 C.E., things began to change.The Universities of Oxford and Paris were established. Monarchs became owners of more territory, their wealth grew, and their courts became centers of culture. Learning started to take root. Trade grew rapidly after 1100 C. E., and towns formed.However, with them came new public health problems.Across Europe, the quality of medical practitioners was poor, and people rarely saw a doctor, although they might visit a local wise woman, or witch, who would provide herbs or incantations. Midwives, too, helped with childbirth.The Church was an important institution, and people started to mix or replace their spells and incantations with prayers and requests to saints, together with herbal remedies.In the hope that repentance for sins might help, people practiced penance and went on pilgrimages, for example, to touch the relics of a saint, as a way of finding a cure.Some monks, such as the Benedictines, cared for the sick and devoted their lives to that. Others felt that medicine was not in keeping with faith.During the Crusades, many people traveled to the Middle East and learnt about scientific medicine from Arabic texts. These explained discoveries that Islamic doctors and scholars had made, based on Greek and Roman theories.In the Islamic World, Avicenna was writing \"The Canon of Medicine.\" This included details on Greek, Indian, and Muslim medicine. Scholars translated it and, in time, it became essential reading throughout Western European centers of learning. It remained an important text for several centuries.Other major texts that were translated explained the theories of Hippocrates and Galen.The ancient Egyptians developed the theory of humorism, Greek scholars and physicians reviewed it, and then Roman, medieval Islamic, and European doctors adopted it.Each humor was linked to a season, an organ, a temper, and an element.The theory held that four different bodily fluids — humors — influenced human health. They had to be in perfect balance, or a person would become sick, either physically or in terms of personality.An imbalance could result from inhaling or absorbing vapors. Medical establishments believed that levels of these humors would fluctuate in the body, depending on what people ate, drank, inhaled, and what they had been doing.Lung problems, for example, happened when there was too much phlegm in the body. The body's natural reaction was to cough it up.To restore the right balance, a doctor would recommend:The theory lasted for 2,000 years, until scientists discredited it.\nHerbs were very important, and monasteries had extensive herb gardens to produce herbs to resolve each imbalance humor. The local apothecary or witch, too, might provide herbs.The Christian Doctrine of Signature said that God would provide some kind of relief for every disease, and that each substance had a signature which indicated how effective it might be.For this reason, they used seeds that looked like miniature skulls, such as the skullcap, to treat headache, for example.The most famous medieval book on herbs is probably the \"Red Book of Hergest,\" which was written in Welsh around 1390 C.E.Hospitals during the Middle Ages were more like the hospices of today, or homes for the aged and needy.They housed people who were sick, poor, and blind, as well as pilgrims, travelers, orphans, people with mental illness, and individuals who had nowhere else to go.Christian teaching held that people should provide hospitality for those in desperate need, including food, shelter, and medical care if necessary.During the Early Middle Ages, people did not use hospitals much for treating sick people, unless they had particular spiritual needs or nowhere to live.Monasteries throughout Europe had several hospitals. These provided medical care and spiritual guidance, for example, the Hotel-Dieu, founded in Lyons in 542 C. E. and the Hotel-Dieu of Paris, founded in 652 C. E.The Saxons built the first hospital in England in 937 C. E, and many more followed after the Norman Conquest in 1066, including St. Bartholomew's of London, built in 1123 C.E., which remains a major hospital today.A hospitium was a hospital or hospice for pilgrims. In time, the hospitium developed and became more like today's hospitals, with monks providing the expert medical care and lay people helping them.In time, public health needs, such as wars and the plagues of the 14th century, led to more hospitals.One area in which doctors made advances was in surgery.Barber-surgeons carried out surgery. Their skill was important on the battlefield, where they also learnt useful skills tending to wounded soldiers.Tasks included removing arrowheads and setting bones.Monks and scientists discovered some valuable plants with powerful anesthetic and antiseptic qualities.People used wine as an antiseptic for washing out wounds and preventing further infection.This would have been an empirical observation, because at that time people had no idea that infections were caused by germs.As well as wine, surgeons used using ointments and cauterization when treating wounds.Many saw pus as a good sign that the body was ridding itself of toxins in the blood.There was little understanding of how infection works. People did not link a lack of hygiene with the risk of infection, and many wounds became fatal for this reason.The following natural substances were used by medieval surgeons as anesthetics:Medieval surgeons became experts in external surgery, but they did not operate deep inside the body.They treated eye cataracts, ulcers, and various types of wounds.Records show they were even able to surgically remove bladder stones.Some patients with neurological disorders, such as epilepsy, would have a hole drilled into their skulls \"to let the demons out.\" The name of this is trepanning.At this time, Europe started trading with nations from all over the world. This improved wealth and and living standards, but it also exposed people to pathogens from faraway lands.The plague of Justinian was the first recorded pandemic. Lasting from 541 into the 700s, historians believe it killed half the population of Europe.The Black Death started in Asia and reached in Europe in the 1340s, killing 25 million.Medical historians believe Italian merchants brought it to Europe when they fled the fighting in Crimea.Historians say the Mongols catapulted dead bodies over the walls of Kaffa, in the Crimea, to infect enemy soldiers. This is probably the first example of biological warfare. This may have triggered the spread of infection into Europe.The Plague continued to resurface until the 17th century.From the 1450s onwards, as the Middle Ages gave way to the Renaissance, the Age of Discovery. This brought new challenges and solutions.Girolamo Fracastoro (1478–1553), an Italian doctor and scholar, suggested that epidemics may come from pathogens outside the body. He proposed that these might pass from human-to-human by direct or indirect contact.He introduced the term \"fomites,\" meaning tinder, for items, such as clothing, that could harbor pathogens from which another person could catch them.He also suggested using mercury and \"guaiaco\" as a cure for syphilis. Guiaiaco is the oil from the Palo Santo tree, a fragrance used in soaps.Andreas Vesalius (1514–1564), a Flemish anatomist and physician, wrote one of the most influential books on human anatomy \"De Humani Corporis Fabrica\" (\"On the Structure of the Human Body\").He dissected a corpse, examined it, and detailed the structure of the human body.Technical and printing developments of the time meant that he was able to publish the book.William Harvey (1578–1657), an English doctor, was the first person to properly describe the systemic circulation and properties of blood, and how the heart pumps it around the body.Avicenna had begun this work in 1242 C. E., but he had not fully understood the pumping action of the heart and how it was responsible for sending blood to every part of the body.Paracelsus (1493–1541), a German-Swiss doctor, scholar, and occultist, pioneered the use of minerals and chemicals in the body.He believed that illness and health relied on the harmony of man with nature. Rather than soul purification for healing, he proposed that a healthy body needed certain chemical and mineral balances. He added that chemical remedies could treat some illnesses.Paracelsus wrote about the treatment and prevention strategies for metalworkers and detailed their occupational hazards.Leonardo Da Vinci (1452–1519), from Italy, was skilled in several different fields. He became an expert in anatomy and made studies of tendons, muscles, bones, and other features of the human body.He had permission to dissect human corpses in some hospitals. Working with doctor Marcantonio della Torre, he created over 200 pages of illustrations with notes about the human anatomy.Da Vinci also studied the mechanical functions of bones and how the muscles made them move. He was one of the first researchers of biomechanics.Ambroise Paré (1510–1590), from France, helped lay the foundations for modern forensic pathology and surgery.He was the royal surgeon for four French kings and an expert in battlefield medicine, particularly wound treatment and surgery. He invented several surgical instruments.Paré once treated a group of wounded patients in two ways: cauterization and boiled elderberry oil. However, he ran out of oil and treated the rest of the second group with turpentine, oil of roses, and egg yolk.The following day, he noticed that those he had treated with turpentine had recovered, while those who received the boiling oil were still in severe pain. He realized how effective turpentine was in treating wounds, and virtually abandoned cauterization from then on.Paré also revived the Greek method of ligature of the arteries during amputation, instead of cauterization.This method significantly improved survival rates. This an important breakthrough in surgical practice, despite the risk of infection.Paré also believed that phantom pains, sometimes experienced by amputees, were related to the brain, and not something mysterious within the amputated limb.Common problems at this time included smallpox, leprosy, and the Black Death, which continued to reappear from time to time. In 1665–1666, the Black Death killed 20 percent of the population of London.While the Black Death came from Asia, people traveling from Europe to other parts of the world also exported some deadly pathogens.Before the Spanish explorers landed in the Americas, deadly influenza, measles and smallpox did not occur there.Native Americans had no immunity against such diseases, making them particularly deadly.Within 60 years of Columbus arriving in 1492 C.E., the population of the island of Hispaniola, for example, fell from at least 60,000 to fewer than 600, according to one source, due to smallpox and other infections.In mainland South and Central America, the smallpox virus and other infections killed millions of people within 100 years of Columbus' arrival.Methods of diagnosis did not improve much from as the Middle Ages turned into the early Renaissance.Physicians still did not know how to cure infectious diseases. When faced with the plague or syphilis, they often turned to superstitious rites and magic.At one time, doctors asked King Charles II to help by touching sick people in an attempt to cure them of scrofula, a type of tuberculosis (TB). Another name for scofula was \"The King's Evil.\"Explorers discovered quinine in the New World and used it to treat malaria.Edward Anthony Jenner (1749-1823) was an English doctor and scientist, known as the pioneer of vaccinations. He created the smallpox vaccine.As early as 430 B.C.E., history shows that people who had recovered from smallpox used to help treat those with the disease, because they appeared to be immune.In the same way, Jenner noticed that milkmaids tended to be immune to smallpox. He wondered whether the pus in the cowpox blisters protected them from smallpox. Cowpox is similar to smallpox but milder.In 1796, Jenner inserted pus taken from a cowpox pustule into the arm of James Phipps, an 8-year old boy. He then proved that Phipps was immune to smallpox because of the cowpox \"vaccine.\"Others were sceptical, but Jenner's successful experiments were finally published in 1798. Jenner coined the term \"vaccine\" from vacca, which in Latin means \"cow.\"In the early Middle Ages, medical care was very basic and largely depended on herbs and superstition.In time, and especially during the Renaissance, scientist learned more about how the human body works, and new discoveries, such as vaccination, came into being. Article last reviewed by Wed 31 October 2018.Visit our Medical Students / Training category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Medical Students / Training.All references are available in the References tab.\t\t\nHajar, R. (2013, January 9). The Air of History (Part II) Medicine in the Middle Ages. Heart Views, 13(4):158-62. Retrieved from http://www.heartviews.org/article.asp?issn=1995-705X;year=2012;volume=13;issue=4;spage=158;epage=162;aulast=HajarMedicine in the Middle Ages. (n.d.). Retrieved from https://www.metmuseum.org/toah/hd/medm/hd_medm.htmMedicine in the Middle Ages. (n.d.) Retrieved from https://www.bbc.com/bitesize/guides/zxg6wxs/revision/2Plague. (n.d.). Retrieved from https://www.nationalgeographic.com/science/health-and-human-body/human-diseases/the-plague/Pringle, H. (2015, June 4). How Europeans brought sickness to the New World. Science. Retrieved from https://www.sciencemag.org/news/2015/06/how-europeans-brought-sickness-new-worldRiedel, S. (2005, January . Edward Jenner and the history of smallpox and vaccination. Baylor University Medical Center Proceedings, 18(1), 21–25. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1200696/Renaissance medicine. (n.d.). Retrieved from https://www.bbc.com/bitesize/guides/z8pdcwx/revision/3What kind of medicines did people use in the Middle Ages? (n.d.). Retrieved from https://www.abdn.ac.uk/sll/disciplines/english/lion/medicine.shtmlPlease use one of the following formats to cite this article in your essay, paper or report:MLAMedical News Today Editorial Team. \"What was medieval and Renaissance medicine?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323533.php>APAMedical News Today Editorial Team. (2018, November 2). \"What was medieval and Renaissance medicine?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323533.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323533.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}