{"id": "Medicines and devices for treating asthma", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Managing asthma requires two main approaches. The first is to control the chronic inflammation on an on-going basis, and the second is to be prepared for the effects of asthma attacks.These are severe flare-ups of symptoms that might lead to emergency treatment.This article explores in detail the different medications and devices available for people with asthma.A range of both quick-relief medications for attacks and long-term control drugs are available for the treatment of asthma.Take quick-relief medications called bronchodilators at the first sign of asthma symptoms to provide a rapid response.A doctor prescribes bronchodilators to expand the airway passageways and help clear mucus from the lungs. These drugs can relieve symptoms but do not control the inflammation that drives asthma.Beta2-agonists are a class of drug that also relieves asthma symptoms quickly. They reduce allergic reactions and form the basis of many allergy medications. As the asthmatic reaction in the airways has links to the mechanisms that cause allergy, they can be helpful in reducing the effects of acute flare-ups.Do not take these drugs more than twice a week. Taking them more often is a sign of poorly controlled asthma, so visit a doctor to discuss better ways to control the condition. It is important to carry a quick-relief inhaler at all times for urgent relief when the symptoms of an attack first occur.Using quick-relief medicines to control asthma symptoms long-term is not effective, as they usually do not reduce inflammationThe following medications are effective beta2-agonists for people with asthma:The daily use of long-term asthma control drugs is the best way to reduce the risk of a severe attack.Inhaled corticosteroids are extremely effective for long-term asthma relief. These relieve inflammation and limit sensitivity to allergens that could set off a reaction in the airways.However, the medicines might lead to certain side effects, including a fungal infection of the mouth known as thrush.The risk of thrush increases if corticosteroids come into contact with the mouth and throat. Spacers or holding chambers are available as attachments to an inhaler. They can reduce corticosteroid contact with the area and reduce the risk of thrush.Rinsing the mouth can similarly help to prevent the side effects of corticosteroids.Inhaling corticosteroids over an extended period can increase the risk of cataracts and osteoporosis.People with asthma might use the following long-term medications:People will often use devices to effectively deliver asthma medication to the airways. Inhalers and nebulizers are the most common devices for administering asthma drugs.A peak flow meter is another device that can help a person with asthma monitor how their lungs are working.Peak flow is a measurement of lung function that records the speed and force of expelled air. A person with asthma can use a peak flow meter at home to monitor the progress of asthma treatment and the risk of an upcoming attack.Keeping a peak flow diary can help a doctor understand how to adapt doses of medication and management techniques to best suit the person with the disease.An inhaler is a handheld device that turns asthma medicine into a spray, similar to that of an aerosol can, making it more efficient at reaching the airways.There are two different types: Metered dose inhalers and dry powder inhalers.Metered dose inhalers (MDIs)These released a pre-measured puff of medicine to ensure that a person with asthma gets the exact dose they need. Some machines have a counter that displays the remaining number of doses, but people with those that do not should keep track of how many they use.Younger inhaler users might also benefit from a spacer attachment. Aside from reducing the risk of side effects from corticosteroids, they can reduce the need to squeeze the inhaler while inhaling. The user can inhale the medication when they are ready.A spacer can make using an inhaler more effective. The spacer will help the medicine reach the lower airways where it can have the most powerful impact in treating asthma.Infants and very young children will place a plastic cup called a facemask over the mouth and nose to receive inhaled medicine. Older children may use a smaller mouthpiece.Taking a dose of asthma medication through an inhaler should take between 2 and 3 minutes.Dry powder inhalersA dry powder inhaler delivers asthma medication in the form of a powder, not a spray.This requires more force when inhaling the medication. Many children can supply enough force by the age of 5 or 6 years.These are electronic devices that transform asthma drugs into a fine mist and do not require forceful inhalation.They are generally bulkier than inhalers and sometimes require a power supply. They may also be battery-powered.An individual takes the mouthpiece and breathes in and out for around 10 minutes.If a child is distressed or crying during a dose, the nebulizer may reduce in effectiveness, as the child will absorb less medicine.Using an inhaler or nebulizer in the correct way is vital, as an accurate dose can greatly reduce the frequency and impact of attacks.There are many different brands of inhaler. Read instructions thoroughly for efficient use.Apply the following tips:As inhalers can save lives during respiratory distress, make sure using one becomes second nature. Speak to a doctor if the type of inhaler is causing difficulties.To obtain an accurate peak flow reading, take the following steps:Be sure to take peak flow measurements at the same time each day for consistency. The highest peak flow at this time will indicate the personal best. This will be the target peak flow, and the further the peak flow falls from this figure, the higher the risk becomes of an attack.When a person replaces their peak flow meter, they should find a new personal best, as different meters might show different readings. Allowing for growth in children is also essential, so find a new personal best every 6 months to represent this change.This will also come with instructions, which anyone using a nebulizer should read closely.Wash the hands, medicine cup, and mouthpiece or mask well after use, but do not wash the tubing. Shake off any remaining moisture, and air-dry the components on a tissue or paper towel.Disinfect the different parts of the nebulizer once a week to sterilize the device. The packaging should provide precise instructions.Store the nebulizer in a clean, dry plastic bag, and keep mouthpieces or masks separate if more than one person in the house uses the machine to treat asthma. Replace any broken or malfunctioning parts as soon as possible.A variety of medications are in involved in the long-term management of asthma and the treatment of attacks.Quick-relief medications, such as bronchodilators, help to address respiratory distress during an asthma attack. Long-term control drugs, such as corticosteroids, help to moderate asthma and reduce airway inflammation.A variety of devices can help deliver these medications to the lungs. Inhalers turn the medication into a spray or deliver a powder. Some inhalers deliver a specific amount and keep track of remaining doses. Be sure to follow the tips on using each for the most accurate doses and the most efficient delivery.Nebulizers turn the medications into a fine mist and require less effort on behalf of the person taking the drugs. However, they often require a power a source and are less portable than inhalers. Speak to a doctor about which delivery method would be best.Monitor the progress of asthma using a peak flow meter and record the highest value in a diary to show the target lung function after asthma treatment.How do I decide which device is best for me?The type of medication being delivered dictates the types of device. The device will also depend on the reason for taking the medication.Your doctor will provide you with a prescription for the type of device needed for administering the medication you are prescribed. For example, they might prescribe a quick-acting bronchodilator for times when you need quick relief. A metered dose inhaler will usually deliver this medication.For long-term treatment, you may need to attach a spacer to your inhaler for more effective delivery of the medication as part of a daily routine.The bottom line is that your doctor will provide you with information about the available devices based on the type of medication they are prescribing. Article last reviewed by Thu  1 November 2018.Visit our Asthma category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Asthma.All references are available in the References tab.\t\t\nAsthma: In depth. (2013, April). Retrieved from https://nccih.nih.gov/health/asthma/facts#useAsthma medications. (n.d.). Retrieved from https://getasthmahelp.org/medications-list.aspxAsthma tipsheets. (2013, March). Retrieved from https://www.nhlbi.nih.gov/files/docs/public/lung/asthma_tipsheets.pdfHow to use in inhaler – with spacer. (2018, October). Retrieved from https://medlineplus.gov/ency/patientinstructions/000042.htmPeak flow test. (2016, October). Retrieved from https://www.asthma.org.uk/advice/manage-your-asthma/peak-flow/#scorePlease use one of the following formats to cite this article in your essay, paper or report:MLAFelman, Adam. \"Medicines and devices for treating asthma.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323531.php>APAFelman, A. (2018, November 2). \"Medicines and devices for treating asthma.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323531.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323531.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}