{"id": "How do dogs process words? Brain study investigates", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.When science sets out to explore the connection that humans have with their dogs, the results are bound to be fascinating.For instance, a study Medical News Today reported on last year found that dogs prefer to ignore danger and look at their owners' smiling faces instead. Oxytocin, the \"love hormone\" that boosts attachment between humans and between humans and their pets mediates this effect.On a similar note, another study found that talking to your dog in the same way as you would to your baby increases attachment and bonding.But what happens inside your dog's brain when you \"baby talk\" to him? Can dogs tell the meaning of different words apart, and could they tell the difference if you said, \"Who's a good banana cake?\" instead of, \"Who's a good boy?\"In an effort to elucidate some of these mysteries, scientists led by neuroscientist Gregory S. Berns, from the Department of Psychology at Emory University in Atlanta, GA, set out to investigate word processing in the canine brain.Ashley Prichard, a doctoral candidate in Emory's Department of Psychology, is the first author of the paper, which was published in the journal Frontiers in Neuroscience. Prichard explains the motivation for the study, saying \"Many dog owners think that their dogs know what some words mean, but there really isn't much scientific evidence to support that.\"\"We wanted to get data from the dogs themselves — not just owner reports,\" the first author adds.Senior author Berns continues, \"We know that dogs have the capacity to process at least some aspects of human language since they can learn to follow verbal commands.\"\"Previous research, however, suggests dogs may rely on many other cues to follow a verbal command, such as gaze, gestures, and even emotional expressions from their owners,\" says the researcher.\nThis new study was part of the Dog Project — a neuroscientific endeavor founded by Berns in which researchers trained dogs, for the first time, to enter and sit still inside a functional magnetic resonance imaging (fMRI) scanner, without being restrained or sedated.For the experiment, researchers taught 12 dogs of different breeds two different words and trained them to distinguish between the corresponding toys that the words denoted.At the end of the training period, which lasted for months, the dogs demonstrated that they could discern between the two objects by choosing and fetching the right one when prompted by the owner.Then, inside the fMRI scanner, the dogs heard both the words they had been trained to recognize and new pseudowords. For instance, the owner would say the words \"piggy\" or \"monkey\" several times and then hold up the corresponding toys.Then, the owner would use control pseudo-words like \"bobbu\" and \"bodmick\" and hold up new, random objects, such as a hat or a doll.When comparing the neural response to the known words and the reaction to new words, the results showed a greater bilateral activation in the brain's parietotemporal cortex in response to pseudo-words.Prichard and colleagues believe that the parietotemporal cortex may be the canine equivalent to the angular gyrus in humans, a brain area that processes lexical differences.However, the researchers also identified \"a subset\" of dogs for which the new pseudo-words activated other brain areas, such as the left temporal cortex and amygdala, the left caudate nucleus, and the thalamus.The scientists explain the significance of the findings. Prichard says, \"We expected to see that dogs neurally discriminate between words that they know and words that they don't.\"\"What's surprising, is that the result is opposite to that of research on humans — people typically show greater neural activation for known words than novel words.\"\n\nFirst author, Ashley PrichardThe researchers point out that dogs of different breeds may have different cognitive skills, and that this could be a limitation of the study. Also, mapping the neural circuitry in dogs, in general, is challenging because of varying brain sizes and potentially different levels of intelligence, add the authors.\"Dogs may have varying capacity and motivation for learning and understanding human words,\" Berns says, \"but they appear to have a neural representation for the meaning of words they have been taught, beyond just a low-level Pavlovian response.\"However, the researchers point out that the findings do not necessarily imply that spoken words are the best way of communicating with a dog.In fact, another study carried out by Prichard and Berns earlier this year suggests that the canine brain circuitry responsible for processing reward and facilitating learning is connected to and depends more on visual and olfactory information than it does on verbal cues.Therefore, \"verbal commands may be the least efficient way to train dogs,\" concluded the previous study.\"When people want to teach their dog a trick, they often use a verbal command because that's what we humans prefer,\" Prichard says.\"From the dog's perspective, however, a visual command might be more effective, helping the dog learn the trick faster.\"Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323381.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}