{"id": "What to know about bradypnea (slow breathing)", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.There are many possible causes of bradypnea, or bradypnoea, including cardiac problems, medications or drugs, and hormonal imbalances.In this article, we take a close look at bradypnea, including the breathing rate for it, the causes, and treatment options.Bradypnea means that a person takes fewer breaths per minute than is usual for their age and activity level.According to experts, the normal and abnormal breathing rates for an adult, in breaths per minute, are as follows:When a person has a breathing rate of below 12 breaths per minute for more than 2 minutes, this suggests bradypnea. The average rate of breathing differs between individuals and can change depending on a person's age and activity levels.Bradypnea can cause:Bradypnea can occur when a person is awake or asleep. It is different from apnea, which is a temporary halt in breathing that is most common when a person is sleeping.Bradypnea is also not the same as heavy or labored breathing, the medical term for which is dyspnea.Tachypnea is another separate term that refers to an abnormally fast breathing rate. The symptoms and causes of bradypnea and tachypnea are different.Bradypnea is a symptom rather than a condition in itself. It can signify an underlying physical problem or health condition, or it may indicate over-medication.There are many causes of bradypnea, which include:Various drugs, including alcohol and opioids, can cause an abnormally slow rate of breathing.Bradypnea is one symptom of a drug overdose.Exposure to poisonous industrial chemicals or dangerous levels of carbon monoxide can also slow a person's breathing rate.Various medications that doctors use during surgery can cause bradypnea, including:People with a condition called hypothyroidism have an underactive thyroid gland that may not produce enough hormones to keep the body's metabolism at optimal levels. A slower breathing rate can develop as a result.The process of breathing begins in the brain. The respiratory centers in the lower brain stem and spinal cord send signals that stimulate the lungs, breathing muscles, and the rest of the body.Problems with the brain, such as blood clots, tumors, and brain injuries, can interfere with the brain's ability to send these signals. This interference may slow down the rate of breathing.Due to a connection between heart rhythm and breathing rates, anything that interferes with the function of the heart, such as heart failure or heart infection, can affect the activity of the respiratory system too.Minerals with an electrical charge, called electrolytes, play a role in keeping the body's systems in balance.Electrolytes include potassium, sodium, magnesium, calcium, phosphate, and chloride.If the proportions of these electrolytes in the blood and tissue are out of balance, the body does not function as it should, which could result in abnormally slow breathing. Too much or too little water can cause electrolyte imbalances.Slow breathing can result in low oxygen levels in the body. The most noticeable symptoms of bradypnea are similar to those of oxygen deprivation.The symptoms of bradypnea include:A person's breathing rate is one of their vital signs, along with their blood pressure, body temperature, and pulse.Medical professionals measure these vital signs regularly as the results provide a quick overview of the status of a person's basic bodily functions.The outlook for people with bradypnea depends primarily on the circumstances or physical conditions responsible for it.For example, when an underactive thyroid is the cause, thyroid medication can help restore regular breathing rates and other metabolic functions.When slow breathing is due to a complex cause, such as heart disease, doctors may give a person a breathing mask and supplemental oxygen to ensure that their body tissues are getting sufficient oxygen.Heart problems are a leading cause of death. When bradypnea is related to heart problems, a person usually requires comprehensive treatment for the underlying cause.Fortunately, the same medications that doctors prescribe to treat heart failure can lead to improvements in lung function.When an opiate or alcohol overdose causes bradypnea, medical treatment can usually allow people to recover from the immediate effects.Ongoing research on the health impacts of conscious breathing, a practice in which people try to be fully aware of their breaths in and out, could yield valuable health benefits for many respiratory conditions, including bradypnea.For example, some people try to slow their breathing on purpose. As part of some yoga, meditation, and biofeedback techniques, people deliberately slow down and expand their breath as a relaxation method. Recent studies suggest that this may improve autonomic nervous system function and also benefit the cardiovascular and respiratory systems.Bradypnea is when a person's breathing is slower than usual for their age and activity levels. For an adult, this will be under 12 breaths per minute.Slow breathing can have many causes, including heart problems, brain stem problems, and drug overdose. The best treatment and the outlook for bradypnea depend on its cause. Article last reviewed by Mon 12 November 2018.Visit our Respiratory category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Respiratory.All references are available in the References tab.\t\t\nApostolo, A., Giusti, G., Gargiulo, P., Bussotti, M., & Agostoni, P. (2012). Lungs in heart failure. Pulmonary Medicine, 2012. Retrieved from https://www.hindawi.com/journals/pm/2012/952741/Fluid and electrolyte balance. (2018, October 23). Retrieved from https://medlineplus.gov/fluidandelectrolytebalance.htmlHow thyroid dysfunction can cause breathing problems. (2018, March 8). Retrieved from https://www.nahypothyroidism.org/how-thyroid-dysfunction-can-cause-breathing-problems/Ikeda, K., Kawakami, K., Onimaru, H., Okada, Y., Yokota, S., Koshiya, N. … Koizumi, H. (2017). The respiratory control mechanisms in the brainstem and spinal cord: Integrative views of the neuroanatomy and neurophysiology. The Journal of Physiological Sciences, 67(1), 45–62. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5368202/Lewis, III, J. L. (2018, March). Respiratory acidosis. Retrieved from https://www.merckmanuals.com/professional/endocrine-and-metabolic-disorders/acid-base-regulation-and-disorders/respiratory-acidosisRusso, M. A., Santarelli, D. M., & O'Rourke, D. (2017, December). The physiological effects of slow breathing in the healthy human. Breathe, 13(4), 298–309. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5709795/Shiota, T., Kawanishi, H., Inoue, S., Egawa, J., & Kawaguchi, M. (2018, December). Risk factors for bradypnea in a historical cohort of surgical patients receiving fentanyl-based intravenous analgesia. JA Clinical Reports, 4(46). Retrieved from https://link.springer.com/article/10.1186/s40981-018-0186-xVital signs (2014, April 22). Retrieved from https://my.clevelandclinic.org/health/articles/10881-vital-signsWhited, L., & Graham, D. D. (2017, December 13). Abnormal respirations. Retrieved from https://www.ncbi.nlm.nih.gov/books/NBK470309/Please use one of the following formats to cite this article in your essay, paper or report:MLADresden, Danielle. \"What to know about bradypnea (slow breathing).\" Medical News Today. MediLexicon, Intl., 12 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323647.php>APADresden, D. (2018, November 12). \"What to know about bradypnea (slow breathing).\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323647.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323647.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}