{"id": "Using light to destroy metastatic breast cancer", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Due to modern advances in medicine and the spread of public awareness campaigns, the outlook for people who develop breast cancer is currently very promising.According to the American Cancer Society (ACS), the 5-year survival rate for people with stage 0 or stage I breast cancer is almost 100 percent, and for those with stage II breast cancer, it is approximately 93 percent.However, the outlook is less favorable for people with breast cancer whose tumors have spread to other parts of the body. Specifically, the ACS estimate that the 5-year survival rate for people who have metastatic breast cancer is about 22 percent.The three main ways of tackling cancer are surgery, radiation, and chemotherapy. However, the side effects of these therapies are significant, and when the tumors have spread, the risk of toxicity is even higher.For these reasons, scientists have been hard at work devising novel, non-toxic therapies. One such form of treatment uses light to activate cancer-fighting drugs.Dr. Nalinikanth Kotagiri, assistant professor in the James L. Winkle College of Pharmacy and a cluster hire for the Cincinnati Cancer Center in Ohio, set out to investigate ways in which light could be used to activate photosensitive drugs that could kill off cancer cells, leaving healthy cells intact.Dr. Kotagiri has just received the Department of Defense Breast Cancer Breakthrough Award, which offers more than $600,000 for 3 years of research.The researcher explains the need for alternative breast cancer therapies, especially when cancer has spread to the bone marrow.\"Metastatic breast cancer can be a devastating diagnosis with high rates of relapse and death, and there are currently no effective therapies,\" he says. \"Despite newer treatments, many patients still succumb to the disease.\"\"Major limitations include acquired resistance to therapies and serious side effects from treatment,\" Dr. Kotagiri continues. \"Due to the widespread location of breast cancer cells, particularly in the bone marrow, which harbors the tumor cells as well as vital stem cells, the risk of toxicity is even higher with conventional therapies.\"The researcher goes on to detail the mechanisms and benefits of light therapy. \"Therapies such as photodynamic therapy (PDT), involving light and a photosensitizing chemical substance, which used in conjunction with molecular oxygen can cause cell death, offer a high degree of control that is effectively used to manage cancer in early to advanced stages.\"\"It operates on a simple principle where a light-sensitive drug, which is otherwise nontoxic, introduced into certain tissues can cause cell death when activated by light.\" However, Dr. Kotagiri explains, there are current limitations to light therapy as well.\"Despite the promise of PDT, it can't penetrate tissue deeply, so its use is limited. Also, current light-sensitive drugs require oxygen to be effective, but many tumors, including breast tumors, have pockets of low oxygen or grow in regions where oxygen is either low or absent, which could prevent [an] effective application of PDT in cancer treatment.\"However, Dr. Kotagiri and team may have found a way to overcome these problems.\"We've been using ultraviolet (UV) light from radionuclides (radioactive nuclide or atom),\" the researcher explains, \"which are already used to image tumors and tissues, and tried to solve oxygen dependence by using metal-based light-sensitive drugs for depth- and oxygen-independent PDT.\"\"By replacing the external light source, such as lasers and lamps, with light from radionuclides as an 'internal' light source, we've been able to better control therapy in the body.\"\"This could mean more effective therapies with minimal toxicity to vital organs and tissues. Since radionuclides are used in imaging and locating tumors, we can now simultaneously image and treat breast cancer metastasis using the same radionuclide,\" says the researcher.Over the next few years, Dr. Kotagiri and colleagues will test whether using radionuclide light to activate light-sensitive anti-cancer drugs in animals will effectively kill off metastatic and treatment-resistant cancer cells.If proven successful, this light-based treatment \"could tremendously benefit patients, as it could potentially improve therapeutic outcomes in addition to setting a precedent to tailor other FDA-approved light-sensitive drugs as radionuclide activated therapies, expanding the scope and range of the diseases these drugs currently treat.\"\"If proven beneficial, this treatment could be ready for a patient population in 5 to 10 years, since all the materials involved have already been used in humans — this could be an exciting breakthrough.\"Dr. Nalinikanth KotagiriYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323394.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}