{"id": "How does a doctor diagnose addiction?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The diagnosis of addiction caused controversy in previous editions of the Diagnosis and Statistical Manual for Mental Disorders (DSM). The newest edition has combined substance abuse and dependence into a new category, substance use disorder.DSM-V was the first edition to include gambling addiction in the definition, as the behavior triggers similar reward circuits.The first step in diagnosis relies on a friend, family member, or the person with addiction themselves acknowledging a need for treatment.This can often be the most difficult step and might sometimes involve a personal or group intervention if an individual with substance use disorder is not aware of the extent of the problem.The person with suspected substance use disorder visits a family doctor or primary care physician, who may then refer them to an addiction or rehabilitation specialist.The doctor will ask questions about frequency of use, impairment of daily living, and whether the use of a substance is increasing and how the pattern of use is impacting important social, occupational, educational or other functional areas.They will also ask about withdrawal symptoms which may have occurred at times when the person attempted to decrease or stop use.The doctor will complete a physical examination and run some blood work to assess overall health. This helps to determine if medical treatment is needed.The DSM-5 separates substance use disorder into nine different categories:DSM-V lists varying criteria for each of these categories, and many dependencies have different withdrawal symptoms that occur when an individual does not have access to the substance.To receive a diagnosis of substance use disorder, a person must demonstrate two of the following criteria within a 12-month period:The number of criteria a person demonstrates defines the severity of the dependence. If a person regularly fulfills two of three of these criteria, the DSM advises that they have mild substance use disorder.A person with four or five of these criteria would have moderate substance use disorder. Six criteria would denote a severe addiction.As new evidence emerges around addictive disorders, researchers attempt to determine whether or not they can develop reliable diagnostic criteria.Some addictive disorders appear in the International Classification of Disease, Tenth Edition (ICD-10), such as sex addiction, which the ICD-10 classes under the category of \"other sexual dysfunction not due to a substance or known physiological condition\".The DSM-5, however, does not acknowledge sex addiction as a diagnosis.One study from 2016 suggests that smartphone addiction is a developing condition and fits within the criteria of addiction.The concept of video game addiction and the validity of the phenomenon as a diagnosable condition is currently controversial, as it involves the same brain circuitry as other addictions. In some parts of East Asia, clinics already exist to treat gaming addiction.However, no accepted set of criteria exists in the DSM-5 at present.The DSM-V uses a category called \"substance use disorder\" to group addictive disorders.Diagnosing substance use disorder involves an important first step from either the person with the condition or someone close to them: Acknowledging and accepting the fact that a health problem exists. The person with must first want help, otherwise treatment is unlikely to have a lasting effect.A doctor will ask about patterns of use to determine whether a person fits the criteria for addiction. They will also assess the impact of any physical damage already present as a result of the disorder.To fit the criteria, a person must show two or more signs of addiction over the previous 12 months, including consuming ever-larger quantities, continued use despite severe consequences, and a reducing interest in activities and socializing.A person who fits a high number of criteria has a severe substance use disorder.The doctor will then refer the individual for specialized care.What signs can I pick up on to identify a friend or family member as having an addiction?This depends on the addictive disorder. For instance, with alcohol use disorder, you may notice that your friend or family member is using more and more alcohol with the passage of time. You might notice that the bulk of their free-time activities center around alcohol use.You may see that the person is having problems fulfilling major obligations, such as showing up for work on time or missing school.They may also give up or significantly reduce their participation in recreational or social activities that they once enjoyed in favor of drinking. The individual in question might be having problems with relationships.If you notice these signs, try to connect them with support. Article last reviewed by Thu  1 November 2018.Visit our Alcohol / Addiction / Illegal Drugs category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Alcohol / Addiction / Illegal Drugs.All references are available in the References tab.\t\t\nDiagnostic and statistical manual of mental disorders, fifth edition. (2013, May 18). Retrieved from https://dsm.psychiatryonline.org/doi/book/10.1176/appi.books.9780890425596Hasin, D. S., O’Brien, C. P., Auriacombe, M., Borges, G., Bucholz, K., Budney, A., Compton, W. M., … Grant, B. F. (2014, August 1). DSM-5 criteria for substance use disorders: Recommendations and rationale. American Journal of Psychiatry, 170(8), 834-851. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3767415/Lin, Y.-H., Chiang, C.-L., Lin, P.-H., Chang, L.-R., Ko, C.-H., … Shang-Hsuan, L. (2016). Proposed diagnostic criteria for smartphone addiction. PLoS, 11(11), e0163010. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5112893/Zastrow, M. (2017, April 25). News feature: Is video game addiction really an addiction? PNAS, 114(17), 4268-4272. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5410811/Please use one of the following formats to cite this article in your essay, paper or report:MLAFelman, Adam. \"How does a doctor diagnose addiction?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323487.php>APAFelman, A. (2018, November 2). \"How does a doctor diagnose addiction?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323487.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323487.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}