{"id": "Depression: Three new subtypes identified", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.According to recent estimates, depression affects over 300 million people worldwide, and at least 16 million people in the United States.Over 60 percent of U.S. individuals living with depression have experienced severe impairment as a result, and up to 30 percent of people living with depression do not find relief in existing treatments.Selective serotonin reuptake inhibitors (SSRIs) are the most commonly prescribed drugs for depression. They work by boosting levels of the \"happiness hormone\" in the brain: serotonin.New research may help explain why SSRIs are unable to fully tackle some types of depression. A team led by Prof. Kenji Doya, of the Neural Computation Unit at the Okinawa Institute of Science and Technology Graduate University (OIST) in Japan, has now identified three new subtypes of depression.Prof. Doya explains the motivation for the recent study, saying, \"It has always been speculated that different types of depression exist, and they influence the effectiveness of the drug. But there has been no consensus.\"To shed some light on this, the researchers examined the clinical data of 134 study participants, half of whom doctors had recently diagnosed with depression. Using questionnaires and blood tests, the scientists collected information about the participants' life histories, mental health, sleep patterns, and other potential causes of stress in their lives.The scientists also used functional MRI scanners to study the participants' brain activity, enabling them to map 78 brain regions and examine the connections between these areas.\"The major challenge in this study,\" explains first study author Tomoki Tokuda, who is a statistician at OIST, \"was to develop a statistical tool that could extract relevant information for clustering similar subjects together.\"Tokuda developed a new statistical method that allowed the researchers to break down more than 3,000 measurable features into five data clusters. The measurable features included the incidence of childhood trauma and the initial severity of the depressive episode.Of those five data clusters, three corresponded with different subtypes of depression. The brain imaging revealed that the functional connectivity of different brain areas that were connected to the angular gyrus predicted whether SSRIs effectively treated depression.The angular gyrus is a brain region involved in processing language, numbers, spatial cognition, and attention.The study found that one of the subtypes identified, which did not respond to SSRIs, correlated with high functional connectivity as well as with childhood trauma.The other two subtypes of depression, which responded well to drugs, were characterized by low brain connectivity and the absence of childhood trauma.These findings may help physicians predict how effective depression treatment will be based on functional brain connectivity and the incidence of childhood trauma, explain the authors.\"This is the first study to identify depression subtypes from life history and MRI data,\" says Prof. Doya.\"It provides scientists studying neurobiological aspects of depression a promising direction in which to pursue their research,\" adds the scientist.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323559.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}