{"id": "Anticholinergic drugs: What to know", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.There are many different types of anticholinergic drug, but they all work by blocking the action of acetylcholine, a type of neurotransmitter. Blocking this neurotransmitter inhibits involuntary muscle movements and various bodily functions.Only a doctor can determine which anticholinergics are right for a person and how long the treatment should last.In this article, learn more about anticholinergic drugs, their uses, and the possible side effects.Anticholinergics are a type of medication that blocks the action of a neurotransmitter, a chemical messenger in the brain, called acetylcholine. Acetylcholine is responsible for transferring signals between certain cells that affect specific bodily functions.The medication blocks acetylcholine from causing involuntary muscle movements in the lungs, gastrointestinal tract, urinary tract, and other areas of the body.As anticholinergics can affect a variety of functions, including digestion, urination, salivation, and movement, they can help treat many conditions.Anticholinergics can help treat various health conditions, including:Doctors may also prescribe anticholinergics as muscle relaxants. These drugs can be useful during surgeries too, as they aid relaxation, keep the heartbeat normal, and lower salivation.Some people use anticholinergics off-label for excessive sweating.Different types of anticholinergic drug can treat different conditions or symptoms. These medications are only available with a doctor's prescription.Anticholinergics include:With a suitable prescription, anticholinergics are usually safe, but some people do experience side effects.The potential side effects depend on the individual's medical history, as well as the dosage and specific type of anticholinergics that they take.Possible side effects include:Some research has linked the long-term use of anticholinergics in older people to an increased risk of dementia. A doctor should consider a person's age, health conditions, and other medications before prescribing these drugs.It is essential to remain hydrated when taking anticholinergics because they decrease sweating, which may increase the risk of heatstroke.Taking anticholinergics with alcohol or taking too many anticholinergics can result in overdose symptoms, such as:An overdose may also result in death.If anyone notices these signs in themselves or another person, they should seek emergency medical attention.Anticholinergics are medications that block the action of acetylcholine, a type of neurotransmitter. As a result, they stop involuntary muscle movements and various bodily functions.Anticholinergic drugs can help treat a variety of conditions, including COPD, an overactive bladder, gastrointestinal disorders, and symptoms of Parkinson's disease.Anticholinergics are only available via prescription, so it is best to speak to a doctor about which type can help treat specific conditions. A doctor can also explain the risks and side effects. Article last reviewed by Tue 30 October 2018.Visit our Pharmacy / Pharmacist category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Pharmacy / Pharmacist.All references are available in the References tab.\t\t\nAnticholinergics. (n.d.). Retrieved from https://www.sciencedirect.com/topics/neuroscience/anticholinergicsAnticholinergic drugs. (n.d.). Retrieved from https://www.parkinson.org/Understanding-Parkinsons/Treatment/Prescription-Medications/Anticholinergic-DrugsGray, S. L., Anderson, M. L., Dublin, S., Hanlon, J. T., Hubbard, R., Walker, R., … Larson, E. B. (2015, March). Cumulative use of strong anticholinergics and incident dementia: A prospective cohort study. JAMA Internal Medicine, 175(3), 401–407. Retrieved from https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2091745Yayla, E. M., Yavuz, E., Bilge, U., & Binen, E. (2015, January). Drugs with anticholinergic side-effects in primary care [Abstract]. Nigerian Journal of Clinical Practice, 18(1), 18–21. Retrieved from https://www.researchgate.net/publication/269714844_Drugs_with_anticholinergic_side-effects_in_primary_carePlease use one of the following formats to cite this article in your essay, paper or report:MLAGal, Kat. \"Anticholinergic drugs: What to know.\" Medical News Today. MediLexicon, Intl., 30 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323514.php>APAGal, K. (2018, October 30). \"Anticholinergic drugs: What to know.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323514.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323514.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}