{"id": "Can cottonseed oil help lower your 'bad' cholesterol?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Generally speaking, there are two types of cholesterol: high-density lipoprotein (HDL) cholesterol, also known as \"good\" cholesterol, and low-density lipoprotein (LDL) cholesterol, which people describe as \"bad\" cholesterol.Healthcare professionals often refer to LDL cholesterol as \"bad\" because the overaccumulation of this fatty substance can interfere with blood circulation and increase a person's risk of heart attack or stroke.Conversely, they tend to say that HDL cholesterol is \"good\" because it helps remove LDL cholesterol from the body. It does this by taking the LDL cholesterol to the liver, which will break it down and process the resulting waste.In order to prevent LDL cholesterol from reaching high levels in the blood, specialists advise people to adhere to diets that promote high HDL and low LDL cholesterol.However, researchers from the University of Georgia in Athens have found that adding cottonseed oil to a high-fat diet can actually decrease a person's LDL cholesterol levels.The study paper reporting these results appears in the journal Nutrition Research.The researchers worked with a group of 15 male participants aged 18–45 who were within healthy weight ranges. They asked the participants to follow one of two versions of a high-fat diet, each of which included a particular component.In one version of the diet, the researchers used olive oil to enrich the meals. In the other, they used cottonseed oil instead. All of the participants adhered to their assigned diet for a period of 5 days.After comparing the effects of the two diet regimens on the participants, the investigators found that those who had followed the cottonseed oil-enriched diet had lower LDL cholesterol and triglyceride levels.Conversely, the participants who had followed the olive oil-enriched diet saw no significant changes.\"One of the reasons these results were so surprising is because of the magnitude of change observed with the cottonseed oil diet,\" says study author Jamie Cooper, an associate professor at the University of Georgia.\"To see this amount of change in such a short period of time is exciting,\" she adds.The individuals on the cottonseed oil-enriched diet saw, on average, a decrease of approximately 8 percent in total cholesterol levels. Their LDL cholesterol levels decreased by 15 percent on average, and their triglyceride levels decreased by 30 percent.As for the levels of HDL cholesterol, these actually increased by about 8 percent for individuals on the cottonseed oil-enriched diet.The researchers speculate that a specific type of fatty acid called dihydrosterculic acid, which is present in cottonseed oil but not in olive oil, may prevent triglyceride accumulation.\"By doing that,\" Cooper explains, \"it pushes the body to burn more of that fat because it can't store it properly, so you have less lipid and cholesterol accumulation.\"Cooper also suggests that the polyunsatured fats and omega-6 that are abundant in cottonseed oil may have beneficial effects.The authors explain that several sponsors — including the nonprofit company Cotton Incorporated, the University of Georgia Clinical and Translational Research Unit, and the Augusta University and University of Georgia Medical Partnership — financially supported the recent study.In the future, the investigators aim to learn more about the effects of cottonseed oil on health by recruiting older participants who already have high cholesterol levels and extending the dietary intervention period.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323564.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}