{"id": "Autism: What is the link with zinc?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.A new study, published in Frontiers in Molecular Neuroscience, suggests that a zinc deficiency in early childhood may contribute to autism.Autism, or autism spectrum disorder, tends to cause difficulties in communication and social interaction.Although every case is different, symptoms can include repetitive actions, reduced eye contact, and trouble recognizing emotions in others.According to the Centers for Disease Control and Prevention (CDC), around 1 in 59 children have autism. It appears to be four times more common in boys than girls.Despite years of research, the medical community has yet to fully understand the mechanisms of autism, and theories about its origins abound.Autism tends to appear in the first 3 years of life. During this time, synapses — the communication points between neurons — are forming and changing at a rapid rate.Research has linked certain genes to autism, including some that code for proteins that build synapses, such as the Shank family of proteins.The link between synapse formation and autism has provided the basis for some of the most recent research into the condition's mechanisms.In recent years, researchers discovered a link between zinc deficiency and autism. Zinc performs a number of functions, including helping to build proteins and DNA.Although the researchers demonstrated a connection between zinc deficiency and autism, it has been unclear whether the deficiency causes the condition, or whether it develops in response to changes that result from autism.In the new study, the authors attempt to clarify these points by investigating how developing synapses and zinc may interact to cause autism.The senior author, Dr. Sally Kim of Stanford University School of Medicine in California, explains the team's findings:\"Autism is associated with specific variants of genes involved in the formation, maturation, and stabilization of synapses during early development. Our findings link zinc levels in neurons — via interactions with the proteins encoded by these genes — to the development of autism.\"AMPARs are a common type of glutamate receptor in the central nervous system, and developing AMPARs are particularly sensitive to the type of gene changes related to autism.The researchers found that when a message transmits from one neuron to another, zinc enters the second neuron.There, it can bind to Shank 2 and Shank 3 proteins. These proteins then interact with AMPARs on the second synapse.This interaction causes the structure of the synapse to change, in a process that the medical community calls \"maturation.\"In a complex series of experiments, the study's authors showed that Shank 2 and 3 accumulate in synapses as AMPARs reach maturation. Adding zinc to the equation sped up the maturation of AMPARs, but only if Shank 2 and 3 were present.In other words, the researchers demonstrated that Shank 2 and 3 proteins work with zinc to ensure the correct and timely maturation of AMPARs. Without zinc, AMPARs cannot develop correctly.\n\"This suggests that a lack of zinc during early development might contribute to autism through impaired synaptic maturation and neuronal circuit formation.\"Co-senior author, Prof. John Huguenard\"Understanding the interaction between zinc and Shank proteins could, therefore, lead to diagnostic, treatment, and prevention strategies for autism,\" Prof. Huguenard concludes.The authors make clear that we still do not know enough to answer this question. Co-senior author Prof. Craig Garner, of the German Center for Neurodegenerative Diseases in Berlin, spells it out:\"Currently, there are no controlled studies of autism risk with zinc supplementation in pregnant women or babies, so the jury is still out.\"The researchers also note that a zinc deficiency does not necessarily show that a person is consuming too little of the essential mineral. For instance, the gut may not be absorbing the nutrient correctly.On the other hand, consuming excess zinc can be harmful. Too much can prevent the body from absorbing copper, leading to anemia and weak bones.Overall, the study gives a fascinating new insight into a potential mechanism for the development of autism. Exploring the interaction between zinc and developing neurons could hold promise for future treatments and, possibly, the prevention of autism.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323646.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}