{"id": "Humidity levels and COPD", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Chronic obstructive pulmonary disease (COPD) is a term for several conditions that damage the lungs and make breathing difficult. These issues tend to grow worse over time.When symptoms suddenly become more pronounced, a person is experiencing a COPD flare-up.If a person does not receive treatment, a flare-up can require hospitalization, and it may even be life-threatening.Symptoms of a COPD flare-up can include:In this article, we discuss the effects of humidity on COPD and how managing indoor humidity levels may prevent flare-ups. Also, we describe other COPD triggers and when to see a doctor.Certain factors can trigger COPD flare-ups, including lung irritants, changes in weather, and infections.Extremes in humidity can also cause COPD symptoms to worsen.High humidity levels may exacerbate symptoms for a variety of reasons. The body must work harder to breathe when humidity levels are high, especially when the air is hot.Humid air is dense, due to the high water content. This density can increase airway resistance in the body. As a result, breathing may require more effort, which can worsen COPD symptoms, including shortness of breath and fatigue.Humid, hot weather also requires the body to work harder to stay cool. Expending this energy requires more oxygen, which can contribute to feelings of breathlessness.In a 2017 study, which included 82 people with COPD, researchers asked participants to record symptoms and indoor temperature and humidity levels every day for 18 months.The results indicate that high humidity levels may contribute to exacerbated COPD symptoms.Increased humidity may also encourage the growth of mold in the home or workplace, and mold is another common COPD trigger.The disease causes the airways to become more sensitive. Common allergens, such as mold, can further irritate the lungs, prompting coughing, wheezing, and excess mucus production.According to the United States Environmental Protection Agency (EPA), keeping indoor humidity levels below 60 percent can help prevent mold.Very low humidity levels can also trigger or worsen symptoms of COPD. Dry air, especially if it is cold, can cause the airways to narrow, in an effect called a bronchospasm.The following are some steps a person can take to reduce the effects of humidity on COPD symptoms:Local weather reports often include a humidity index. Some news outlets even issue a humidity advisory when conditions are extreme.A combination of heat and high humidity can make breathing more difficult. The U.S. National Weather Service publish a heat index, which takes humidity levels into account and gives a sense of how uncomfortable the temperature may feel.When the heat index is high, or the air feels very humid, it may be best to stay indoors as much as possible.When humidity is very low, and the air is dry and cold, wearing a scarf over the mouth and nose can help warm the air before it enters the lungs.When humidity levels are extreme, it is essential for people with COPD to slow down and not overexert themselves.Maintaining a gentle pace is always a good idea for a person with COPD, but is it especially important on hot and humid days. It can help, for example, to divide chores into smaller tasks and rest as needed.High temperatures and increased humidity levels cause the body to work harder, which results in more sweating and lost fluid. Avoid dehydration by keeping the body hydrated.It is often possible to control indoor humidity levels, particularly at home.The EPA recommend keeping indoor humidity levels between 30 and 50 percent. A person can check levels using a small device called a humidistat.To decrease indoor humidity:High humidity levels are not the only COPD trigger. There several other factors can cause symptoms to flare up.Although everyone is different, some common triggers include:When a person with COPD inhales hot air, it can increase airway inflammation and make breathing more difficult.Breathing in cold air can cause a narrowing of the airways that may lead to increased wheezing and shortness of breath.Allergies affect about 50 million people in the U.S. Hay fever is a common seasonal allergy that results from breathing in pollen.Even in people with COPD who do not have hay fever, inhaling potential irritants, such as pollen, may worsen or trigger symptoms of COPD.Outdoor air pollutants can include smoke, dust, and chemical fumes.In a 2016 study involving 168 people with COPD, researchers found that even short-term exposure to air pollutants may increase the likelihood COPD flare-ups.Respiratory infections, such as a cold or flu, can lead to an increase in COPD symptoms.In people with the disease, these illnesses can further increase mucus production and inflammation in the airways, which can make breathing more challenging.An increase in COPD symptoms can be serious and even potentially life-threatening. Consider seeing a doctor if symptoms include:A person may require emergency care if they experience:Humidity, especially if it very high, can worsen COPD symptoms. Other common triggers include pollution, infection, and pollen.A person can reduce indoor humidity by using an air conditioner or dehumidifier. Checking local weather reports can help determine when conditions are suitable.Recognizing and treating a COPD flare-up, possibly with medical aid, can prevent symptoms from becoming life-threatening. Article last reviewed by Mon 12 November 2018.Visit our COPD category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on COPD.All references are available in the References tab.\t\t\nAllergy facts and figures. (n.d.). Retrieved from http://www.aafa.org/allergy-facts/DeVries, R., Kriebel, D., & Sama, S. (2016, October 18). Low level air pollution and exacerbation of existing copd: A case crossover analysis. Environmental Health, 15(1), 98. Retrieved from https://ehjournal.biomedcentral.com/articles/10.1186/s12940-016-0179-zLareau, S., Moseson, E., & Slatore, C. G. (2014, March 15). Exacerbation of COPD [Fact sheet]. American Journal of Respiratory and Critical Care Medicine, 189(6). Retrieved from https://www.thoracic.org/patients/patient-resources/resources/copd-exacerbation-ecopd.pdfMold course chapter 2: Why and where mold grows. (n.d.). Retrieved from https://www.epa.gov/mold/mold-course-chapter-2Mu, Z., Chen, P.-L., Geng, F.-H., Ren, L., Gu, W.-C., Ma, J.-Y., ... Li, Q.-Y. (2017, November). Synergistic effects of temperature and humidity on the symptoms of COPD patients [Abstract]. International Journal of Biometeorology, 61(11), 1919–1925. Retrieved from https://link.springer.com/article/10.1007/s00484-017-1379-0Rappaport, S. (2016, February 16). Weather and your lungs. Retrieved from https://www.lung.org/about-us/blog/2016/02/weather-and-your-lungs.htmlWhat is the heat index? (n.d.). Retrieved from https://www.weather.gov/ama/heatindexPlease use one of the following formats to cite this article in your essay, paper or report:MLAde Pietro, MaryAnn. \"Humidity levels and COPD.\" Medical News Today. MediLexicon, Intl., 12 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323657.php>APAde Pietro, M. (2018, November 12). \"Humidity levels and COPD.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323657.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323657.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}