{"id": "Why a low-carb diet can help you lose weight and keep it off", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Cara Ebbeling, Ph.D., together with Dr. David Ludwig — both at Boston Children's Hospital in Massachusetts — led the new study, which now appears in the BMJ.As they explain, when we lose weight, the body adapts by lowering its energy expenditure. In other words, it burns fewer calories.This way, the metabolism protects itself against long-term weight changes.However, when the weight loss is intentional, this adaptive response can be frustrating for dieters, as it leads to weight regain.Although weight gain after dieting is a well-known phenomenon, researchers do not know much about how different diets affect the way the metabolism responds to them.The so-called carbohydrate-insulin model, however, suggests one such mechanism. It posits that highly processed foods high in sugar drive hormonal changes that increase the appetite and lead to weight gain.\"According to this model,\" explains Dr. Ludwig, \"the processed carbohydrates that flooded our diets during the low-fat era have raised insulin levels, driving fat cells to store excessive calories. With fewer calories available to the rest of the body, hunger increases and metabolism slows — a recipe for weight gain.\"In this context, Ebbeling, Dr. Ludwig, and their colleagues decided to investigate the effects that different diets had on the metabolism. Specifically, they looked at the carb-to-fat ratio in varying diets over a 20-week period.The researchers examined the effect of different diets on 234 adults aged 18–65 whose body mass index (BMI) was at least 25. As part of the study, the participants had also adhered to a weight loss plan for 10 weeks.By the end of the trial, 164 participants had achieved their weight loss goal of around 12 percent of their total weight. Then, they adhered to either a high-, moderate-, or low-carb diet for 20 weeks, allowing the researchers to examine if they managed to maintain the weight loss.The high-carb diet was composed of 60 percent high-quality carbs, the moderate-carb one had 40 percent carbs, and the low-carb diet had 20 percent carbs. The diets also minimized sugar intake and used whole grains.During this time, the scientists measured the participants' weight and tracked the number of calories they burned. They also examined the participants' insulin secretion and metabolic hormones.At the end of the study period, people in the low-carb group burned significantly more calories than those who had been on a high-carb diet.Specifically, participants who were on a low-carb diet burned around 250 kilocalories more per day than those who were on a high-carb diet.Ebbeling explains, \"If this difference persists — and we saw no drop-off during the 20 weeks of our study — the effect would translate into about a 20-pound weight loss after 3 years, with no change in calorie intake.\"The results also indicated that for participants who had the highest insulin secretion, the impact of a low-carb diet was even more significant: low-carb dieters burned 400 calories more per day than high-carb dieters.\"A low glycemic load, high-fat diet,\" explain the authors, \"might facilitate weight loss maintenance beyond the conventional focus on restricting energy intake and encouraging physical activity.\"Ebbeling says, \"Our observations challenge the belief that all calories are the same to the body.\"\"This is the largest and longest feeding study to test the 'carbohydrate-insulin model,' which provides a new way to think about and treat obesity.\"Dr. David LudwigYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323711.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}