{"id": "Why does diabetes cause fatigue?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Fatigue is different from being tired. When a person is merely tired, they usually feel better with rest. When a person has persistent fatigue, rest may not relieve their feelings of exhaustion and lethargy.According to the American Diabetes Association, research shows that 61 percent of people with newly diagnosed type 2 diabetes report fatigue as a symptom. Also, the same study found that fatigue is the second most common symptom in this group.In this article, we look at the reasons why diabetes can cause fatigue and how to manage fatigue. We also cover other possible cause of fatigue and when to see a doctor.There are many reasons why diabetes can cause fatigue, including:We discuss each of these possible causes of fatigue below.Diabetes affects the way the body regulates and uses blood sugar.When a person eats, the body breaks down the food into simple sugars. In people with diabetes, these sugars can accumulate in the blood instead of moving into the cells. The cells need the sugar to provide energy.When the body's cells are not getting enough sugar, it can cause symptoms, including fatigue and weakness. Diabetes medications, such as insulin or metformin, help more of this sugar to move into the cells and prevent sugar from accumulating in the blood.A potential side effect of diabetes medications is low blood sugar or hypoglycemia.Low blood sugar can also cause fatigue, especially in people who do not get enough warning that their blood sugars levels are about to drop. A person can also feel fatigued after treatment of low blood sugar.Other symptoms of diabetes can also contribute to a person having to face excess fatigue. These symptoms can include:While not all of those symptoms can account for feelings of fatigue, many of them may contribute to an overall sense of being unwell. This unwell feeling may take a mental and physical toll on a person that can lead them to experience fatigue.Also, some of the symptoms of diabetes may disrupt a person's sleep. For example, with diabetes, they may find themselves waking up several times a night to use the bathroom or get a drink.Similarly, discomfort in the extremities may make it difficult for a person with diabetes to fall asleep and stay asleep.These sleep disruptions can cause a person to feel increasing fatigue.People with diabetes can develop complications that can also contribute to feelings of fatigue. These complications typically develop when a person's blood sugar levels remain too high and can include:These complications, as well as the medications a person uses to treat them, may contribute to feelings of fatigue in people with diabetes.Living with diabetes can often impact a person's mental and emotional health. According to 2016 research, people with diabetes may be around two to three times more likely to experience depression than people without the condition.Depression can also adversely affect a person's blood sugar control and lead to fatigue.In fact, many of the symptoms of depression relate directly to fatigue, including:Aside from depression, many people with diabetes may also experience increased anxiety related to their health. Similarly to depression, anxiety can also cause increased feelings of fatigue due to disrupted sleep.Many people with diabetes, especially those with type 2 diabetes, are overweight or obese, which can also contribute to fatigue. Reasons for the association between being overweight and fatigue may include:Lifestyle changes can help a person manage both diabetes and symptoms of fatigue. Helpful lifestyle changes may include:To reduce fatigue, it is also essential for a person to properly manage their diabetes and any coexisting conditions. This may include:There may be other reasons a person with diabetes experiences fatigue that is not directly related to their condition. These might include:A person with diabetes should see their doctor regularly to monitor and manage their diabetes. Also, they may wish to speak to a doctor for fatigue that interferes with daily life or is a new or worsening symptom, as this could be a sign of a potential complication or side effect of medication.People should seek medical attention for fatigue that occurs alongside other symptoms, such as fever, chills, or malaise, as this could indicate an infection.People with diabetes commonly experience persistent fatigue. Causes of fatigue can include high or low blood sugar levels, depression, being overweight, and coinciding medical conditions.While fatigue can interfere with a person's daily life, controlling blood sugar levels and lifestyle changes can improve energy levels and reduce tiredness and lethargy. Article last reviewed by Fri 19 October 2018.Visit our Diabetes category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Diabetes.All references are available in the References tab.\t\t\nBădescu, S. V., Tătaru, C., Kobylinska, L., Georgescu, E. L., Zahiu, D. M., Zăgrean, A. M., & Zăgrean, L. (2016, April–June). The association between diabetes mellitus and depression. Journal of Medicine and Life, 9(2), 120–125. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4863499/Depression. (2014, May 14). Retrieved from http://www.diabetes.org/living-with-diabetes/complications/mental-health/depression.htmlDiabetes and sleep problems. (n.d.). Retrieved from https://www.joslin.org/info/sleep_problems_and_diabetes.htmlDiabetes symptoms. (2018, August 29). Retrieved from http://www.diabetes.org/diabetes-basics/symptoms/Fritschi, C., & Quinn, L. (2011, July 1). Fatigue in patients with diabetes: A review. Journal of Psychosomatic Research, 69(1), 33–41. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2905388/Goedendorp, M. M., Tack, C. J., Steggink, E., Bloot, L., Bazelmans, E., & Knoop, H. (2014, January 1). Chronic fatigue in type 1 diabetes: Highly prevalent but not explained by hyperglycemia or glucose variability. Diabetes Care, 37(1), 73–80. Retrieved from http://care.diabetesjournals.org/content/37/1/73Griggs, S., & Morris, N. S. (2018, June 26). Fatigue among adults with type 1 diabetes mellitus and implications for self-management: An Integrative Review [Abstract]. The Diabetes Educator, 44(4), 325–339. Retrieved from http://journals.sagepub.com/doi/abs/10.1177/0145721718782148Kalra, S., & Sahay, R. (2018, August). Diabetes fatigue syndrome. Diabetes Therapy, 9(4), 1421–1429. Retrieved from https://link.springer.com/article/10.1007/s13300-018-0453-xSingh, R., Teel, C., Sabus, C., McGinnis, P., & Kluding, P. (2016, November 8). Fatigue in type 2 diabetes: Impact on quality of life and predictors. PloS one, 11(11), e0165652. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5100935/Please use one of the following formats to cite this article in your essay, paper or report:MLAFletcher, Jenna. \"Why does diabetes cause fatigue?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323398.php>APAFletcher, J. (2018, October 19). \"Why does diabetes cause fatigue?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323398.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323398.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}