{"id": "What is orthopnea?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.For people with orthopnea, the breathing difficulty typically disappears quickly after they get up from a horizontal position. In a related condition known as paroxysmal nocturnal dyspnea, the shortness of breath wakes the person up a couple of hours after they fall asleep.In this article, we look at the symptoms, causes, diagnosis, and treatment of orthopnea.Orthopnea is a symptom rather than a condition in itself. The medical term for shortness of breath is dyspnea. Orthopnea is a type of dyspnea that only occurs when a person is lying down.People often describe orthopnea as a sensation of tightness in the chest that makes breathing difficult or uncomfortable. Some individuals may also experience chest pain.Orthopnea can be mild or severe. Some people may barely notice this symptom when they use one or two pillows to prop up their upper body. For others, it can cause significant breathing difficulties that they can only relieve by sitting upright or standing.Other symptoms can also occur, which will depend on the underlying cause. For example, a common cause of orthopnea is heart failure, which can also cause the following symptoms:Orthopnea is often a symptom of conditions that affect the normal functioning of the lungs. These can include heart conditions.Heart disease may result in the heart being unable to redistribute blood and other bodily fluids effectively while a person is lying down. The increased pressure in the blood vessels in the lungs can push fluid into the alveoli, causing a condition known as pulmonary edema.The alveoli are small air sacs in the lungs. Here, oxygen passes from the lungs into the bloodstream, while carbon dioxide moves from the blood into the lungs. Fluid in the alveoli can interfere with this gaseous exchange, preventing a person from getting enough oxygen around their body.Several other conditions can also cause orthopnea, including:As orthopnea is usually a symptom of another condition, such as heart failure, a doctor will focus on trying to identify the underlying cause.The doctor may begin with a physical examination to check the severity and timing of the breathing difficulties. They will also ask about other symptoms and review the person's medical history.Depending on the suspected cause, the doctor may recommend one or more of the following tests:The purpose of orthopnea treatment is to lessen the symptoms and address the underlying cause.Some people may be able to relieve symptoms temporarily by sleeping in a more elevated position. A simple way to do this is to prop up the upper body using pillows. Alternatively, a person could try placing foam wedges underneath the mattress or raising the head of the bed using wooden blocks.If the individual is overweight or obese, losing weight may also help reduce orthopnea. A doctor or dietician can advise on an exercise or diet plan for losing weight.Depending on the underlying cause of a person's orthopnea, a doctor may prescribe medications, such as:Orthopnea is often a symptom of an underlying heart condition. The treatment of this condition may involve ongoing care and lifestyle changes. Depending on the severity of the heart condition, a person may sometimes require surgery.Orthopnea is a shortness of breath that occurs when lying down but usually resolves on sitting or standing up. Orthopnea is often a symptom of heart failure, but it can develop due to other conditions that affect the normal functioning of the lungs, such as COPD.Anyone who experiences orthopnea should see a doctor for an evaluation. The treatment of orthopnea will depend on its underlying cause. However, a person may find temporary relief by raising their head and chest with some pillows when lying in bed. Article last reviewed by Fri 19 October 2018.Visit our Respiratory category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Respiratory.All references are available in the References tab.\t\t\nAshton, R., & Raman, D. (2015, July). Dyspnea. Retrieved from http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/pulmonary/dyspnea/Mesiha, N., Mazhar, N., Tieku, S., Hasan, S., & Goldsmith, D. (2017, May 23). Not every orthopnea means heart failure. American Journal of Respiratory and Critical Care Medicine, 195, A5517. Retrieved from https://www.atsjournals.org/doi/abs/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A5517Rossi, G. P., Calò, L. A., Maiolino, G., & Zoccali, C. (2014, July). Ultrafiltration for the treatment of congestion: A window into the lung for a better caress to the heart. Nephrology Dialysis Transplantation, 29(7), 1335–1341. Retrieved from https://academic.oup.com/ndt/article-pdf/29/7/1335/7638367/gft371.pdfWarning signs of heart failure. (2017, May 31). Retrieved from http://www.heart.org/en/health-topics/heart-failure/warning-signs-of-heart-failurePlease use one of the following formats to cite this article in your essay, paper or report:MLAKandola, Aaron. \"What is orthopnea?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323389.php>APAKandola, A. (2018, October 19). \"What is orthopnea?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323389.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323389.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}