{"id": "Breast cancer screening: How does it truly impact survival?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Breast cancer is the most common type of cancer diagnosed in women, and the National Cancer Institute estimate that 266,120 new cases will have been diagnosed in the United States by the end of 2018.According to the World Health Organization (WHO), more than 508,000 women may have died in 2011 alone due to causes related to breast cancer.However, most forms of breast cancer are highly treatable, and the assumption usually is that the sooner it is diagnosed, the more effective the treatment will be.Recently, specialists from Queen Mary University of London in the United Kingdom, the Falun Central Hospital in Sweden, and numerous other research institutions worldwide set out to establish just how important breast screening is in increasing survival rates following diagnosis.The research, which took into account the medical information of over 50,000 women, found that breast screening is highly beneficial. The study paper is now available in Cancer, a journal of the American Cancer Society (ACS).In their study, the research team analyzed data collected from 52,438 women with ages between 40 and 69. Some of these participants opted to receive breast cancer screening over a 39-year period, in 1977–2015, in Dalarna, Sweden.To improve the assessment of how organized breast screening initiatives would impact health outcomes, the experts who conducted the recent study used a new method that involved calculating the annual incidence of breast cancers leading to death within 10 years and within 20 years following diagnosis.The investigators found that the women who had joined an organized breast cancer screening program had a 60 percent lower risk of death within 10 years following breast cancer diagnosis. They also had a 47 percent lower risk of death within 20 years after breast cancer diagnosis.All the participants who were diagnosed with breast cancer, the investigators note, received the appropriate treatment for the cancer stage they were experiencing, in line with the most recent national guidelines at that time.The researchers believe that screening allows specialists to detect cancer tumors at an early stage, which means the tumors can be treated sooner, and they will respond better to therapy.\"Recent improvements in treatments have led to reduced deaths from breast cancer,\" says senior study author Prof. Stephen Duffy, from Queen Mary University of London.\"However, these new results demonstrate the vital role that screening also has to play, giving women a much greater benefit from modern treatments. We need to ensure that participation in breast screening programs improves, especially in socio-economically deprived areas.\"\nProf. Stephen Duffy\"Our results, from precise, individual‐based data covering 6 decades, should provide women and their physicians with reassurance that participating in regular, high‐quality mammography screening is the best way to reduce the risk of a premature death from breast cancer,\" the study authors conclude in the published paper.They also note that the research received support from the ACS.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323643.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}