{"id": "What causes addiction?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.These circuits provide rushes of positive feeling and feel-good chemicals to \"reward\" substance use.The areas of the brain responsible for stress and self-control also undergo long-term changes during an addictive disorder. This contributes to on-going difficulties in abstaining from the addictive substance.Drug use is often voluntary in the first instance. The development of a full addiction occurs through a variety of circumstances.However, the brain changes during a substance-related disorder in ways that can take a long time to bring back to a healthy state.A person whose brain's reward circuitry has not altered as a result of addiction experiences positive feelings in relation to generally rewarding behaviors, such as exercising, being with family, or consuming delicious food. These should all make a person feel good.This might motivate a person to repeat these behaviors and regain that positive feeling.Substances produce a euphoric feeling by triggering large amounts of dopamine in certain regions of the brain responsible for the feeling of reward. Addiction occurs when the act of using a substance takes over these circuits and increases the urge to consume more and more of the substance in order to achieve the same rewarding effect.A substance use disorder eventually no longer causes the same rewarding feelings that it once caused. However, if the person abstains from using the substance, they begin to feel symptoms of withdrawal, which can be extremely unpleasant.The person often finds themselves using the substance just to feel \"normal\" — which generally means preventing the discomfort of withdrawal symptoms.Using drugs and alcohol to moderate mood can also impair the functioning of the prefrontal cortex, a section of the brain that manages executive decision-making. This part of the brain should alert a person to the harmful consequences of such behavior, but addiction impairs its ability to carry out this function.A combination of these three mechanisms and the risk factors for addiction can lead to the development of an addictive disorder.Another clear contributor to addiction is the type of substance a person takes. For example, opioids are highly addictive as they target receptors in the brain directly.Many maintain that marijuana is less addictive in terms of its chemical content, but, instead, targets the pleasure and reward centers of the brain. Further research is necessary to support these claims.\nMany people metabolize drugs in different ways.Some people, for example, do not require much alcohol to reach the point of intoxication. Others can seemingly drink vast quantities without feeling intoxicated.This often relates to a combination of age, gender, body weight, and other factors.As part of regularly consuming large amounts of a substance, the body may become accustomed to its effects and metabolize it more efficiently. The person may require increased amounts of the substance to achieve the same effect that smaller amounts of the substance used to create.Medicine generally refers to this phenomenon as tolerance.When tolerance increases alongside the need to take a substance to avoid withdrawal symptoms, it often indicates the onset of an addictive disorder. If a person does not receive treatment, it can lead to dangerous consequences.Addiction develops when the urge to take a substance hijacks parts of the brain that reward behavior and provides benefits for the body.Substance-related disorders also impact the area of the brain responsible for emotions and decision-making. Eventually, people end up taking a substance not to feel good, but to feel \"normal\" by prevention of withdrawal symptoms.These can combine with existing risk factors, such as extreme stress, to produce the behaviors and physical effects of addiction.Does addiction always involve changes in the brain?Generally, if a person meets the diagnostic criteria of the DSM-5 for a particular substance use disorder, it is most likely that brain changes have probably already occurred.We do know that the sooner a person receives treatment for a substance use disorder, the better the chance of recovery may be.Brain changes that occur as a result of a substance use disorder may be permanent, but some improvement may occur with extended abstinence.Research in this area is ongoing. Article last reviewed by Thu  1 November 2018.Visit our Alcohol / Addiction / Illegal Drugs category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Alcohol / Addiction / Illegal Drugs.All references are available in the References tab.\t\t\nBiology of addiction: Drugs and alcohol can hijack your brain. (2015, October). Retrieved from https://newsinhealth.nih.gov/2015/10/biology-addictionDrugs, brains, and behaviour: The science of addiction. (2018, July). Retrieved from https://www.drugabuse.gov/publications/drugs-brains-behavior-science-addiction/drug-misuse-addictionPlease use one of the following formats to cite this article in your essay, paper or report:MLAFelman, Adam. \"What causes addiction?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323483.php>APAFelman, A. (2018, November 2). \"What causes addiction?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323483.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323483.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}