{"id": "Is a bleeding belly button normal in newborns?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The umbilical cord supplies a fetus with nutrients from the mother. Once the baby is born, it no longer needs the umbilical cord to provide its nutrients, and so doctors cut the cord. Eventually, the cord dries out and falls off, leaving behind a belly button in its place.Read on to find out why a newborn's belly button may bleed, how to take care of the area, and when bleeding from a newborn's belly button may need medical attention.Most cases of belly button bleeding are natural.Many parents and caregivers may notice a small area of bleeding at the point where the newborn's umbilical cord begins to separate from the body.Sometimes a newborn's diaper or even a piece of clothing may rub against the umbilical cord. This can irritate the area and cause bleeding as well.To stop a newborn baby's belly button bleeding, hold a piece of clean gauze gently but firmly over the belly button area. A doctor should evaluate any bleeding that does not stop with gentle pressure.Caring for the umbilical cord stump properly can help prevent or reduce belly button bleeding. A new parent or caregiver can care for a newborn's umbilical cord stump by:While the stump is healing, avoid:According to the American Academy of Pediatrics, most babies will lose their cord stumps in 10 to 14 days.However, it is not unusual for a baby's umbilical cord to fall off as early as 1 week after birth or as late as 3 weeks after birth.It is typical for a baby's umbilical cord to fall off before or after this time frame as well.Most of the time, newborn belly button bleeding is normal. However, if the bleeding is hard to stop or if there is more than just a few drops of blood, take the baby to see a pediatrician.Also, a doctor needs to examine a newborn's belly button if there are any signs of infection, including:While a bleeding belly button can cause alarm to new parents, some newborn belly button bleeding is nothing to worry about.Slight bleeding from the umbilical cord stump is generally not serious and usually resolves within the first few weeks after birth.In rare cases, newborn belly button bleeding can indicate the baby has an infection at the site of the umbilical cord stump. If a newborn shows any signs of infection, take the baby to the pediatrician immediately. Article last reviewed by Tue 30 October 2018.Visit our Pediatrics / Children's Health category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Pediatrics / Children's Health.All references are available in the References tab.\t\t\nFever in a newborn. (n.d.). Retrieved from https://www.chop.edu/conditions-diseases/fever-newbornSchmitt, B. (n.d.). Umbilical cord symptoms. Retrieved from https://www.healthychildren.org/English/tips-tools/symptom-checker/Pages/symptomviewer.aspx?symptom=Umbilical+Cord+SymptomsUmbilical cord bleeding (newborn). (n.d.). Retrieved from https://www.fairview.org/sitecore/content/Fairview/Home/Patient-Education/Articles/English/u/m/b/i/l/Umbilical_Cord_Bleeding_Newborn_512087enUmbilical cord symptoms. (2018, March 31). Retrieved from https://www.seattlechildrens.org/conditions/a-z/umbilical-cord-symptoms/Please use one of the following formats to cite this article in your essay, paper or report:MLAFletcher, Jenna. \"Is a bleeding belly button normal in newborns?.\" Medical News Today. MediLexicon, Intl., 30 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323513.php>APAFletcher, J. (2018, October 30). \"Is a bleeding belly button normal in newborns?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323513.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323513.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}