{"id": "5 strange, rare, and fascinating medical conditions", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Previously, Medical News Today have covered a range of medical conditions so unusual that, at first glance, you may even question if they were even real.In our past Spotlight feature, we looked at the Alice in Wonderland syndrome, water allergy, the so-called walking corpse syndrome (Cotard's syndrome), the \"stone man\" syndrome (fibrodysplasia ossificans progressiva ), and alien hand syndrome.Now, we add five more fascinating conditions to our list — from a syndrome that causes an individual to spontaneously produce pure alcohol in the gut, to one in which various body tissues grow out of proportion, severely altering a person's appearance, and potentially leading to numerous other health problems.\"The human body is strange and flawed and unpredictable,\" writes novelist Paul Auster in Sunset Park. In this Spotlight, we look at some of the most unusual ways in which the human body can be unpredictable.Most of us only experience drunkenness — and the ensuing \"rough morning\" — after having had a few stiff drinks. While the alcohol may give us a pleasant \"high\" at first, the hangover is a harsh reminder that our bodies do not appreciate heavy partying all that much.There are, however, people who experience intoxication and hangovers without drinking a significant amount of alcohol, or even without ingesting alcohol at all.These people have a rare condition called auto-brewery syndrome or gut fermentation syndrome, in which pure alcohol (ethanol) is produced in a person's gut after they have eaten carbohydrate-rich foods.An excess of Saccharomyces cerevisiae — a type of yeast — in the gut is the main culprit, which leads to the fermentation process that produces ethanol.However, researchers note that the spontaneously-produced alcohol would not be enough to land someone a drink-driving charge since it would not lead to high enough levels of blood alcohol.However, a variation of this condition may have more severe effects.Since the liver typically processes ethanol, people whose liver does not function properly may experience a form of auto-brewery syndrome in which the alcohol accumulates and lingers in the system for longer.Some symptoms that accompany this condition include belching, chronic fatigue syndrome, dizziness, disorientation, hangovers, and irritable bowel syndrome (IBS).All of these symptoms can further impact a person's mental health and physical well-being. In an interview for the BBC in the United Kingdom, a person with auto-brewery syndrome explained how the condition affected them before they received a diagnosis:\"It was weird; I'd eat some carbs and all of a sudden I was goofy, vulgar. Every day for a year I would wake up and vomit. Sometimes it would come on over the course of a few days; sometimes it was just like 'bam! I'm drunk'.\"Fortunately, most people can manage auto-brewery syndrome through dietary changes; by switching to foods with low carbohydrate and high protein content. A further step in treating this condition involves taking antibiotics and antifungal therapies.Imagine this: you were born and grew up in New York, and you have a stereotypically metropolitan American accent. One day, however, as you are engaged in one of your favorite sports, you receive a heavy blow to the head, and you pass out.When you wake up in the emergency room and call out to the nurse, you realize something shocking has happened to you — your New-Yorkese accent is gone, and it has been replaced by what sounds like a strong British English accent.What happened? This thought experiment illustrates an extremely rare condition: the foreign accent syndrome. This is a speech impediment, which results from damage to the parts of the brain responsible for coordinating speech.Such damage to the brain can be the result of a stroke or a traumatic brain injury, and the speech impediment that develops makes the person sound like they have suddenly acquired a foreign accent.Researchers note that recorded occurrences of accent \"changes\" related to this syndrome include Japanese to Korean, British English to French, American English to British English, and Spanish to Hungarian.Below, you can watch an interview with a British woman who, following what seemed to be a heavy migraine, suddenly acquired a \"French\" accent:However, some studies suggest that while most cases of foreign accent syndrome may be due to brain injuries, in certain instances, this condition may have a psychogenic origin.In a review of the literature published in the journal Frontiers in Human Neuroscience in 2016, the investigators conclude that psychogenic foreign accent syndrome is a subtype of this condition.\"[P]sychogenic [foreign accent syndrome] is related to the presence of a psychiatric or psychological disturbance in the absence of demonstrable neurological damage or an organic condition that might explain the accent,\" the authors write.This subtype, they add, appears to occur more often in women than in men, usually between the age range of 25-49 years.When a person has trimethylaminuria, colloquially known as fish odor syndrome, they emit an unpleasant body odor, reminiscent of the smell of rotting fish, through their sweat, exhaled breath, and urine.This occurs when the body is unable to break down the organic compound trimethylamine, which produces this strong \"fishy\" smell.It seems that fish odor syndrome occurs in people who have specific mutations of the FMO3 gene. This gene instructs the body to produce the enzymes that break down organic compounds, such as trimethylamine.The strength of the unpleasant odor can vary in time, and also between individuals. However, the nature of this condition usually has a severe impact on the person's day-to-day life and their mental health.In a review on trimethylaminuria published in The Journal of Clinical and Aesthetic Dermatology in 2013, the authors write:\"Patients with [fish odor syndrome] are often ridiculed and suffer from low self-esteem. Withdrawing from their peers, they become lonely, which may negatively impact their academic performance. Anxiety can also be an issue [...], especially if they are unable to detect their [own] odor.\"\"Patients also admit to experiencing shame and distress over their condition, and cases of attempted suicide have been noted,\" the researchers add.Strategies for the management of trimethylaminuria may include dietary changes to remove or reduce the presence of trimethylamine precursors (substances from which this compound derives).Such precursors include trimethylamine N-oxide, found in marine fish, and choline, found in eggs, mustard seeds, chicken and beef liver, as well as raw soybeans.However, researchers also note that exceedingly low levels of choline (choline deficiency), can result in further health complications, such as liver problems, neurological diseases, and a higher risk of cancer.We all know that insufficient or poor quality sleep can affect all aspects of a person's life and well-being, from their physical health to their mental health.While most of us can make appropriate lifestyle changes to improve our sleep hygiene and avoid the impact of sleep deprivation, a few people, unfortunately, deal with a rare condition known as fatal familial insomnia.This condition is a genetic degenerative brain disorder in which a person will experience increasingly severe forms of insomnia, which will eventually lead to \"significant physical and mental deterioration.\"Moreover, fatal familial insomnia may impact the autonomic nervous system, our \"autopilot,\" which regulates processes, such as breathing, heart rate, and body temperature.A variation of the prion-related protein gene, which regulates the expression of the prion protein, usually causes this condition. Abnormalities of the protein may have associations with neurodegenerative diseases.In fatal familial insomnia, damaged proteins accumulate in the thalamus, a region of the brain that plays a crucial role in a person's ability to move and feel. This causes damage to brain cells and leads to the severe physical and mental symptoms that this condition causes.Despite the hope that antipsychotic medication and drugs used to fight malaria could treat this disease, the approach proved unsuccessful. Currently, there is no cure for fatal familial insomnia, and research around this condition is ongoing.One of the strangest rare diseases on record to date is the Proteus syndrome, a condition in which different types of tissue — bones, skin, but also the tissue of organs or arteries — grow disproportionately.This condition has genetic causes, although it is not genetically inherited.Instead, it arises from a mutation in the AKT1 gene, which occurs randomly in the womb.There may be no visible signs of the presence of Proteus syndrome at birth, as tissue overgrowth typically appears at the age of 6 to 18 months. The condition becomes progressively worse with time.The syndrome can cause a range of other health problems, including intellectual disability, poor eyesight, seizures, as well as noncancerous tumors, and deep venous thrombosis, a condition characterized by the abnormal formation of blood clots.Historically, the most famous case of Proteus syndrome was that of Joseph Carey Merrick (1862-1890), cruelly named \"the Elephant Man,\" in 19th-century Britain.At that time in history, rare conditions, such as this one, often meant that a person became a public exhibit as an oddity of nature.Merrick himself reported that the way in which others treated him, including medical doctors, made him feel \"like an animal in a cattle market.\"Fortunately, times and mentalities have changed, and we now understand that any given medical condition does not make up a person's identity. Nowadays, medical care and medical research acknowledge that the welfare of each individual should be a priority.Last year, at the Universal Health Coverage Forum in Tokyo, Japan, the co-organizers issued a joint declaration in which they stated:\"We acknowledge that health is a human right and that [universal health coverage] is essential to health for all and to human security. We adhere to the principle of Leaving No One Behind, which requires special effort to design and deliver health services informed by the voices and needs of people.\"Going forward, there is hope that such principles will eventually allow medical researchers to devise better treatments for people dealing with all health problems, from the common cold to the Proteus syndrome.We picked linked items based on the quality of products, and list the pros and cons of each to help you determine which will work best for you. We partner with some of the companies that sell these products, which means Healthline UK and our partners may receive a portion of revenues if you make a purchase using a link(s) above.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323395.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}