{"id": "What is rheumatoid arthritis?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Rheumatoid arthritis (RA) usually affects the hands and feet first, but it can occur in any joint. It usually involves the same joints on both sides of the body.Common symptoms include stiff joints, especially upon getting up in the mornings or after sitting down for a while. Some people often experience fatigue and a general feeling of being unwell.The Rheumatoid Arthritis Support Network estimate that RA affects up to 1 percent of the world's population and over 1.3 million people in America.RA is an autoimmune disease. It is also a systemic disease, which means it affects the whole body.It occurs when a person's immune system mistakes the body's healthy tissues for foreign invaders.As the immune system responds, inflammation occurs in the target tissue or organ.In the case of RA, this can be the joints, lungs, eyes, and heart.Symptoms of RA include:According to the Centers for Disease Control and Prevention (CDC), the symptoms usually affect the same joints on both sides of the bodySymptoms tend to come and go. During a remission, they can disappear, or they can be mild. However, during a flare, they can be severe.Nobody knows what causes the immune system to malfunction.Some people appear to have genetic factors that make it more likely. One theory is that bacteria or a virus triggers RA in people who have this genetic feature.In RA, the immune system's antibodies attack the synovium, which is the smooth lining of a joint. When this happens, pain and inflammation result.Inflammation causes the synovium to thicken. Eventually, if left untreated, it can invade and destroy cartilage — the connective tissue that cushions the ends of the bones.The tendons and ligaments that hold the joint together can also weaken and stretch. The joint eventually loses its shape and configuration. The damage can be severe.The CDC note that people with a higher risk of developing RA may include those who:People with RA have a higher risk of some other conditions, including:People who have obesity with RA also have a higher risk of diabetes and high blood pressure.The joint damage that occurs with RA can make it difficult to perform daily activities. RA can also be unpredictable. Often, a person does not know when a flare will happen.This uncertainty can lead to:There is also a higher risk of developing the following conditions:Carpal tunnel syndrome: This is a type of nerve damage that stems from compression and irritation of a nerve in the wrist. Symptoms include aching, numbness, and tingling in the fingers, thumb, and part of the hand.Inflammation: This can affect the lungs, heart, blood vessels, eyes and other parts of the body.Tendon rupture: Inflammation in the tendons can lead to rupture, especially on the backs of the fingers.Cervical myelopathy: Dislocation of the joints in the neck or cervical spine can add pressure to the spinal cord. This can result in decreased mobility and pain on movement. As RA progresses, the risk of cervical myelopathy increases.Vasculitis: Inflammation of the blood vessels can cause them to weaken, thicken, narrow and scar. This can affect blood flow to tissues and organ function may be affected.Susceptibility to infections: There is a higher risk of developing colds, flu, pneumonia, and other diseases, especially if the person is taking immunosuppressant medications to manage RA. People with RA should ensure their vaccinations, such as flu jabs, are up-to-date.In its early stages, it may be difficult for a doctor to diagnose RA as it can resemble other conditions. However, early diagnosis and treatment are essential to slow the progression of the disease.The CDC recommend diagnosis and an effective treatment strategy to begin within 6 months of the onset of symptoms.A doctor will look at the person's clinical signs of inflammation and ask how long they have been there and how severe the symptoms are. They will also carry out a physical examination to check for any swelling, or functional limitations, or deformity.They may recommend some tests.Erythrocyte sedimentation rate (ESR or sed rate): This test assesses levels of inflammation in the body. It measures how fast red blood cells in a test tube separate from blood serum over a set period. If the red blood cells settle quickly as sediment, inflammation levels are high. This test is not specific for RA and is a useful test for other inflammatory conditions or infections.C-reactive protein (CRP): The liver produces CRP. A higher CRP level suggests that there is inflammation in the body. This test is not specific for RA and CRP can occur in other inflammatory conditions or infection.Anemia: Many people with RA also have anemia. Anemia happens when there are too few red blood cells in the blood. Red blood cells carry oxygen to the tissues and organs of the body.Rheumatoid factor: If an antibody known as rheumatoid factor is present in the blood, it can indicate that RA is present. However, not everyone with RA tests positive for this factor.An X-ray or MRI of a joint can help a doctor identify what type of arthritis is present and monitor the progress of RA over time.In 2010, the American College of Rheumatology recommended the following criteria for diagnosing RA:The doctor will need to distinguish RA from other conditions with similar symptoms, such as:If a person receives a diagnosis of RA, the doctor may refer them to a specialist known as a rheumatologist, who will advise on treatment options.There is currently no cure for RA, but treatment can help to:Options include medications, physical therapy, occupational therapy, counseling, and surgery.Some drugs can help to relieve symptoms and slow disease progression.Nonsteroidal anti-inflammatory drugs (NSAIDs): These are available over-the-counter from pharmacies. Examples include Advil, Motrin, and Aleve. Long-term use and high doses can lead to side effects, such as bruising, gastric ulcers, high blood pressure, and kidney and liver problems.Corticosteroids: These medications reduce pain and inflammation and may play a role in slowing down joint damage, but they cannot cure RA. If NSAIDs do not work, a doctor may inject a steroid into the joint. Relief is usually rapid, but the effect is variable. It can last a few weeks or months, depending on the severity of symptoms.Corticosteroids can help with acute symptoms or short-term flare-ups. Long-term use of corticosteroids can have serious side effects. These include cataracts, osteoporosis, glaucoma, diabetes mellitus, and obesity.DMARDs can slow the progression of the RA and prevent permanent damage to the joints and other tissues by interfering with the overactive immune system. A person usually takes a DMARD for life.It is most effective if a person uses it in the early stages, but it can take from 4 to 6 months to fully experience the benefits.Some people may have to try different types of DMARD before finding the most suitable one.Examples include leflunomide (Arava), methotrexate (Rheumatrex, Trexall), sulfasalazine (Azulfidine), minocycline (Dynacin, Minocin), and hydroxychloroquine (Plaquenil).Side effects can include liver damage and immune-related problems, such as bone marrow suppression, and a higher risk of severe lung infections.Other types of immunosuppressants include cyclosporine (Neoral, Sandimmune, Gengraf), azathioprine (Imuran, Azasan), and cyclophosphamide (Cytoxan).The human body produces tumor necrosis factor-alpha (TNF-alpha), an inflammatory substance.TNF-alpha inhibitors prevent inflammation. They can reduce pain, morning stiffness, and swollen or tender joints. People usually notice an improvement 2 weeks after starting treatment.Examples include (Enbrel), infliximab (Remicade) and adalimumab (Humira).Possible side effects include:An occupational therapist can help the individual learn new and effective ways of carrying out daily tasks. This can minimize stress to painful joints.For example, a person with painful fingers might learn to use a specially devised gripping and grabbing tool.If medication and physical therapy do not help, a doctor may recommend surgery to:The following procedures are possible:A number of strategies can help a person to manage RA.When a flare-up occurs, the person should rest as much as possible. Over-exerting swollen and painful joints can make the symptoms worse.During times of remission, when symptoms are mild, the individual should exercise regularly to boost their general health and mobility and to strengthen the muscles around the joint.The best exercises are those that do not strain the joints, such as swimming.Following a varied diet with plenty of fresh fruits and vegetable can help a person to feel better and maintain a healthy weight.Tense and painful muscles may benefit from the application of heat.Try:Cold treatment can dull pain and reduce muscle spasms, but people with poor circulation or numbness should not use cold remedies.Examples include:Some might prefer to do both:Finding ways to relieve mental stress may help control pain. Examples include meditation, guided imagery, deep breathing, and muscle relaxation.Some people with RA use the following, but there is little scientific evidence to confirm that they work:It may not be possible to prevent RA, but the CDC suggest the following:RA is a painful and chronic condition that can cause joint damage and make it difficult for a person to carry out their daily tasks.Anyone who experiences pain and swelling in two or more joints should see a doctor, as early treatment can reduce the risk of long-term problems. Article last reviewed by Tue 16 October 2018.Visit our Rheumatoid Arthritis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Rheumatoid Arthritis.All references are available in the References tab.\t\t\nComplications: Rheumatoid Arthritis. (2016, August 12). Retrieved from https://www.nhs.uk/conditions/rheumatoid-arthritis/complications/Freeman, J. (2018, October 7). RA facts: What is rheumatoid arthritis and who does it affect? Retrieved from https://www.rheumatoidarthritis.org/ra/facts-and-statistics/How to prevent arthritis. (n.d.). Retrieved from https://www.arthritis.org/about-arthritis/understanding-arthritis/arthritis-prevention.phpRheumatoid arthritis (RA). (2017, July 7). Retrieved from https://www.cdc.gov/arthritis/basics/rheumatoid-arthritis.htmlWasserman, A. M. (2011, Decmeber 1). Diagnosis and management of rheumatoid arthritis. American Family Physician, 84(11), 1245–1252. Retrieved from https://www.aafp.org/afp/2011/1201/p1245.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What is rheumatoid arthritis?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323361.php>APABrazier, Y. (2018, October 19). \"What is rheumatoid arthritis?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323361.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323361.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}