{"id": "Natural home remedies for COPD", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Chronic obstructive pulmonary disease (COPD) restricts airflow into and out of the lungs. People with the condition tend to experience shortness of breath and may therefore have difficulty exercising and performing everyday activities.Although there is currently no cure for COPD, various home remedies can help open up the airways and improve a person's quality of life.This article discusses which home remedies, including lifestyle changes, supplements, and essential oils, can help people manage COPD.The following home remedies and natural treatments can help people with COPD manage their symptoms and slow disease progression:Smoking is the leading cause of COPD in the United States and is responsible for around 90 percent of COPD-related deaths.Tobacco smoke irritates the airways within the lungs. Inflammation and obstruction of the airways causes them to narrow, making it difficult for air to pass in and out.According to a recent review, people with COPD who smoke have a more rapid decline in lung function, more complications, and an increased risk of mortality.Smoking may also reduce the effectiveness of inhaled steroid medications that doctors use to treat severe COPD.Quitting smoking is the most effective action that someone who smokes and has COPD can take to slow disease progression. People can see a doctor for advice on how to quit smoking, or they may visit smokefree.gov for step-by-step guidance.Certain irritants inside the home can make breathing more difficult for people with COPD. Common irritants include:People can improve air quality in their home by:Practicing breathing exercises aim to improve the symptoms of COPD by improving the muscles a person uses to take breaths and improve their ability to exercise.A 2012 Cochrane systematic review compared groups of people with COPD who used breathing exercises with people who did not for 4–15 weeks.Breathing exercises included:The researchers found no differences in symptoms such as shortness of breath and quality of life, but people who used breathing exercises experienced improved exercise tolerance. Breathing exercises may help people with COPD who have difficulty exercising.COPD can cause sudden symptom flare-ups, or exacerbations. Anxiety and depression may increase the risk of flare-ups. Engaging in stress management strategies will improve general health.One study found that people with COPD who also had anxiety or depression were more likely to be readmitted to the hospital within 30 days of leaving. Emotional stress may weaken the immune system, increasing the risk of respiratory infections.Mindfulness meditation may help reduce emotional distress. A small-scale 2015 study found that an 8-week mindfulness meditation course improved respiratory rate in people with COPD compared with the control group. People also reported improved emotional function after six classes.People with COPD who are underweight have a higher risk of mortality than people with COPD who are overweight. Researchers are still investigating the impact of obesity on COPD outlook.People with COPD who are underweight are more likely to experience:According to a recent review, a balanced diet can help people with COPD by improving lung function. A balanced diet also has metabolic and heart benefits. People who are underweight may especially benefit from a nutritional diet high in calories, protein, and unsaturated fats.This type of diet increases a person's energy and helps build muscle when combined with exercise. However, more large-scale studies are needed before researchers understand the benefits of this diet for people with COPD.Many people with COPD have difficulty exercising because breathing is harder. However, avoiding exercise can worsen symptoms such as muscle weakness and fatigue.The following exercises may help people with COPD improve muscle strength and increase exercise capacity:Once a person begins to lose fitness, exercise becomes increasingly difficult, and lung function may worsen. People should therefore start an exercise regime at an early stage for the best benefits.People with COPD may have muscle or bone conditions that make it more difficult to exercise. Water exercises place less stress on the body, which can make them easier and more manageable for people with COPD.A 2013 study found that water-based exercises might increase a person's exercise capacity and quality of life. In people with COPD and physical disabilities, water-based exercises were more effective than both land-based exercise and no exercise.The researchers suggested that these effects might be due to the unique properties of water, which support body weight through buoyancy and provide resistance to increase exercise intensity.A range of supplements can help improve the symptoms of COPD by controlling inflammation and reducing symptoms. Supplements for COPD include:Vitamin D deficiency may increase inflammation of the airways and reduce the body's ability to clear bacteria.A 2015 review found that people with severe COPD tended to have low levels of vitamin D. Vitamin D supplements may improve some symptoms of COPD and improve flare-ups.People can buy vitamin D supplements in drug stores or online.Co-enzyme Q10 (CoQ10) and creatine are natural chemicals that are involved in supplying energy to the body's cells.A 2013 study looked at whether a combination of creatine and CoQ10 supplements would improve COPD symptoms in people with chronic respiratory failure.After 2 months, people who took both creatine and CoQ10 supplements had improved exercise tolerance, less shortness of breath, improved flare-ups, and an improved quality of life.People can buy CoQ10 in drug stores or online.People can also use essential oils to open up the airways and clear mucus from the lungs. People can use essential oils in a diffuser or dilute them in a carrier oil and apply to the skin. Essential oils for COPD include:Eucalyptus oil contains a natural compound called eucalyptol. Eucalyptol may have the following benefits for people with COPD:The results of one study suggest adding 12 drops of eucalyptus oil to 150 milliliters of boiling water and inhaling up to three times per day.There is a wide range of eucalyptus oils to choose from online.Myrtol standardized is an essential oil derived from pine, lime, and eucalyptus.A recent review of 15 randomized controlled trials (RCTs) found that myrtol standardized is a safe and effective treatment for both chronic bronchitis and COPD. However, more large-scale, high-quality RCTs are needed.A person should see a doctor if they have the following symptoms of a COPD exacerbation:Certain signs and symptoms indicate a severe COPD exacerbation. People should call the emergency services right away if they have the following:Treating COPD exacerbations early can reduce the likelihood of developing further complications.COPD is a chronic condition that can be difficult to manage. People can reduce their symptoms at home using certain home remedies, including exercises, breathing techniques, dietary supplements, and essential oils.If the symptoms of COPD get worse, a person should see their doctor.We picked linked items based on the quality of products, and list the pros and cons of each to help you determine which will work best for you. We partner with some of the companies that sell these products, which means Healthline UK and our partners may receive a portion of revenues if you make a purchase using a link(s) above. Article last reviewed by Mon 12 November 2018.Visit our COPD category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on COPD.All references are available in the References tab.\t\t\nAtlantis, E., Fahey, P., Cochrane, B., & Smith, S. (2013, September). Bidirectional associations between clinically relevant depression or anxiety and COPD: A systematic review and meta-analysis. Chest, 144(3), 766–777. Retrieved from https://www.sciencedirect.com/science/article/pii/S0012369213605929Basics about COPD. (2018, June 5). Retrieved from https://www.cdc.gov/copd/basics-about.htmlChan, R. R., Giardino, N., & Larson, J. L. (2015, March 2). A pilot study: Mindfulness meditation intervention in COPD. International Journal of Chronic Obstructive Pulmonary Disease, 10, 445–454. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4354397/Chronic obstructive pulmonary disease (COPD). (2018, January 22). Retrieved from https://www.lung.ca/lung-health/lung-disease/copd/flare-upsCOPD. (n.d.). Retrieved from https://www.nhlbi.nih.gov/health-topics/copdCOPD statistics across America. (n.d.). Retrieved from https://www.copdfoundation.org/What-is-COPD/Understanding-COPD/Statistics.aspxExercise for someone with COPD. (n.d.). Retrieved from https://www.copdfoundation.org/Learn-More/I-am-a-Person-with-COPD/Exercise.aspxFerreira, I. M., Brooks, D., White, J., & Goldstein, R. (2012, December 12). Nutritional supplementation for stable chronic obstructive pulmonary disease. Cochrane Database of Systematic Reviews (12). Retrieved from https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD000998.pub3/abstractGloeckl, R., Marinov, B., & Pitta, F. (2013). Practical recommendations for exercise training in patients with COPD. European Respiratory Review, 22(128), 178–186. Retrieved from http://err.ersjournals.com/content/errev/22/128/178.full.pdfGuo, Y., Zhang, T., Wang, Z., Yu, F., Xu, Q., Guo, W., ... He, J. (2016, July 18). Body mass index and mortality in chronic obstructive pulmonary disease: A dose-response meta-analysis. Medicine, 95(28). Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4956822/Holland, A. E., Hill, C. J., Jones, A. Y., & McDonald, C. F. (2012, October 17). Breathing exercises for chronic obstructive pulmonary disease. Cochrane Database of Systematic Reviews, (10). Retrieved from https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD008250.pub2/abstractHorváth, G., & Ács, K. (2015, May 26). Essential oils in the treatment of respiratory tract diseases highlighting their role in bacterial infections and their anti‐inflammatory action: A review. Flavour and Fragrance Journal, 30(5), 331–341. Retrieved from https://onlinelibrary.wiley.com/doi/epdf/10.1002/ffj.3252Juergens, U. R. (2014, May). Anti-inflammatory properties of the monoterpene 1.8-cineole: Current evidence for co-medication in inflammatory airway diseases. Drug Research, 64(12), 1–9. Retrieved from https://www.researchgate.net/publication/262385819_Anti-inflammatory_Properties_of_the_Monoterpene_18-cineole_Current_Evidence_for_Co-medication_in_Inflammatory_Airway_DiseasesLehouck, A., Mathieu, C., Carremans, C., Baeke, F., Verhaegen, J., Van Eldere, J., ... Janssens, W. (2012, January 17). High doses of vitamin D to reduce exacerbations in chronic obstructive pulmonary disease: A randomized trial. Annals of Internal Medicine, 156(2), 105–114. Retrieved from http://annals.org/aim/fullarticle/1033290Liu, L. L., Chen, L.-J., Hu,-Z. B., Lu, H.-B., & Zhan, M. (2012). Standard myrtol in the treatment of chronic bronchitis and COPD: A systematic review. [Abstract]. China Pharmacy, 16, 27. Retrieved from http://en.cnki.com.cn/Article_en/CJFDTotal-ZGYA201216027.htmMarinari, S., Manigrasso, M. R., & De Benedetto, F. (2013, June 21). Effects of nutraceutical diet integration, with coenzyme Q 10 (Q-Ter multicomposite) and creatine, on dyspnea, exercise tolerance, and quality of life in COPD patients with chronic respiratory failure. Multidisciplinary Respiratory Medicine, 8(1), 40. Retrieved from https://mrmjournal.biomedcentral.com/articles/10.1186/2049-6958-8-40McNamara, R. J., McKeough, Z. J., McKenzie, D. K., & Alison, J. A. (2013). Water-based exercise in COPD with physical comorbidities: A randomised controlled trial. European Respiratory Journal, 41(6), 1284–1291. Retrieved from http://erj.ersjournals.com/content/erj/41/6/1284.full.pdfSchols, A. M., Ferreira, I. M., Franssen, F. M., Gosker, H. R., Janssens, W., Muscaritoli, M., ... Singh, S. J. (2014, September 18). Nutritional assessment and therapy in COPD: A European Respiratory Society statement. European Respiratory Journal, 52(3). Retrieved from http://erj.ersjournals.com/content/erj/early/2014/09/18/09031936.00070914.full.pdfSingh, G., Zhang, W., Kuo, Y.-F., & Sharma, G. (2016, April). Association of psychological disorders with 30-day readmission rates in patients with COPD. Chest, 149(4), 905–915. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4944783/Tamimi, A., Serdarevic, D., & Hanania, N. A. (2012, March). The effects of cigarette smoke on airway inflammation in asthma and COPD: Therapeutic implications. Respiratory Medicine, 106(3), 319–328. Retrieved from https://www.sciencedirect.com/science/article/pii/S0954611111003908Tønnesen, P. (2013). Smoking cessation and COPD. European Respiratory Review 2013, 22(127), 37–43. Retrieved from http://err.ersjournals.com/content/errev/22/127/37.full.pdfWhat is a COPD exacerbation? (n.d.). Retrieved from https://www.copdfoundation.org/Learn-More/I-am-a-Person-with-COPD/Avoiding-Exacerbations-and-Pneumonia.aspxZhu, B., Zhu, B., Xiao, C., & Zheng, Z. (2015, September 11). Vitamin D deficiency is associated with the severity of COPD: A systematic review and meta-analysis. International Journal of Chronic Obstructive Pulmonary Disease, 10, 1907–1916. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4574800/Please use one of the following formats to cite this article in your essay, paper or report:MLALillis, Charlotte. \"Natural home remedies for COPD.\" Medical News Today. MediLexicon, Intl., 12 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323649.php>APALillis, C. (2018, November 12). \"Natural home remedies for COPD.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323649.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323649.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}