{"id": "What to know about focal (partial) seizures", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.There are two types of focal seizure: Partial and complex. In this article, we look at the types, causes, symptoms, and treatment of focal seizures.The human brain contains neurons, or brain cells, that use electrical signals to communicate with each other.During a seizure, a person has an abnormal surge of electrical activity in their brain. People can experience physical symptoms before, during, and after the seizure. A seizure is temporary.Unlike generalized seizures, focal seizures originate in only one part of the brain.Generalized seizures originate from the entire brain rather than one area of the brain. However, some focal seizures change to become generalized seizures.There are two types of focal seizures: simple focal seizures and complex focal seizures.Doctors also refer to simple focal seizures as focal aware seizures.During a simple focal seizure, a person remains conscious throughout the event and remembers it when it is over. The episode lasts less than a minute.Doctors also refer to complex partial seizures as focal impaired awareness seizures.When a person has a complex partial seizure, they lose consciousness during the episode and do not remember the seizure after it is over. The seizure may last for more than a minute.Because focal seizures begin in one part of the brain, the symptoms vary from seizure-to-seizure, depending on the part of the brain affected. Also, usually a person will have symptoms on only one side of the body.However, if the focal seizure becomes a generalized seizure, they may begin to experience convulsions on both sides of the body.Symptoms that may occur during a focal seizure include:People who remember having a seizure often describe an aura at the beginning of the seizure.An aura is when a person has a confusing feeling or perceives a light or smell, just before a seizure begins. The aura is the start of the abnormal electrical activity of the seizure in the brain.Following the aura, the individual may then have odd sensations, changes in motor abilities, or visual disturbances, usually on just one side of the body.Bystanders may notice different symptoms, such as staring, rapid eye blinking, or body-stiffening, followed by confusion and tiredness after the event.Seizures can have many different causes and triggers, some of which doctors still do not know.Potential causes of focal seizures include:Potential triggers of focal seizures include:Doctors classify seizures into two types, depending on their cause:Doctors can diagnose a seizure based on a person's account of the event. However, a bystander's report can be more reliable than the person's report, so clinicians prefer to hear both accounts when possible.A doctor will try to figure out whether the seizure was focal or generalized. They will also attempt to distinguish the seizure episode from other events that look like seizures.Doctors will take note of any potential triggers for a seizure. If they are unable to identify any, they will then assess how likely the person is to have another seizure.If there are risk factors for another seizure, a doctor might decide if a person would benefit from medication.During the physical examination, a doctor will look for signs that a person may have a condition that causes seizures, such as a brain infection or chronic syndromes, such as neurofibromatosis or tuberous sclerosis.Doctors may also order blood tests, imaging scans, and spinal taps. Options for neuroimaging include CT scans or MRI scans.Finally, they may recommend electroencephalography, which is a procedure that monitors the activity in the brain.Doctors prescribe medications to treat focal seizures during the event as well as to prevent future seizures. When possible, they will try to treat the underlying cause.Doctors use antiepileptic medications to prevent seizure.Several options are available for focal seizures. They come in two categories: broad-spectrum antiepileptic medications and narrow-spectrum antiepileptic medications.Examples of broad-spectrum antiepileptic medications include:Examples of narrow-spectrum antiepileptic medications include:A person can discuss these options with their doctor. They should mention whether they take any other medications or are pregnant, as these factors may impact which medication the doctor recommends.The outlook for someone who has had a focal seizure depends on its underlying cause. However, effective treatments are available no matter what the situation to ensure a person has a good quality of life.Sleep, eating a healthful diet, exercising regularly, and taking medication as prescribed can improve how a person feels.Focal seizures, also called partial seizures, occur when there is a disruption of electrical impulses in one part of the brain.A person may be aware that they are having a seizure, in this case, a simple focal seizure, or they may not be aware, which is a complex focal seizure.Some focal seizures occur after a person is exposed to a trigger, but some may happen without a known cause. Treatment often involves antiepileptic medication, and the outlook depends on the underlying cause of the seizure. Article last reviewed by Fri  9 November 2018.Visit our Neurology / Neuroscience category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Neurology / Neuroscience.All references are available in the References tab.\t\t\nGavvala, J. R., & Schuele, S. U. (2016, December 27). New-onset seizure in adults and adolescents: A review. Journal of American Medical Association, 316(24), 2657–2668. Retrieved from http://www.ncbi.nlm.nih.gov/pubmed/28027373Italiano, D., Ferlazzo, E., Gasparini, S., Spina, E., Mondello, S., Labate, A., … Aguglia, U. (2014, August). Generalized versus partial reflex seizures: A review. Seizure, 23(7), 512–520. Retrieved from https://www.seizure-journal.com/article/S1059-1311(14)00096-X/fulltextStafstrom, C. E., & Carmant, L. (2015, June). Seizures and epilepsy: An overview for neuroscientists. Cold Spring Harbor Perspectives in Medicine, 5(6). Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4448698/Please use one of the following formats to cite this article in your essay, paper or report:MLAWadehra, Sunali. \"What to know about focal (partial) seizures.\" Medical News Today. MediLexicon, Intl., 9 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323642.php>APAWadehra, S. (2018, November 9). \"What to know about focal (partial) seizures.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323642.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323642.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}