{"id": "How a 150-year old drug might help battle cancer", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.There are a number of ways to attack cancer; one of the most commonly used is radiation therapy.Radiation works on tumors in two ways; firstly, it damages DNA and, secondly, it produces oxygen radicals that also harm cancer cells.However, when oxygen levels are low (hypoxia), the body produces fewer oxygen radicals, meaning that radiation therapy is less effective.Because cancer cells divide so quickly, they require more oxygen than healthy tissue. At the same time, blood vessels within tumors are often poorly constructed, making them less efficient.This means that cancer cells often run out of oxygen, making radiation therapy less deadly to cancer.Similarly, these dead, hypoxic zones in the tissue, where blood supply is limited, are difficult for drugs carried in the blood to reach. In this way, hypoxia can reduce the impact of both radiation therapy and chemotherapy.The author of the current study, Dr. Nicholas Denko, Ph.D., explains why hypoxia is such a problem in cancer treatment: \"We know that hypoxia limits the effectiveness of radiation therapy, and that's a serious clinical problem because more than half of all people with cancer receive radiation therapy at some point in their care.\"Dr. Denko continues, \"If malignant cells in hypoxic areas of a tumor survive radiation therapy, they can become a source of tumor recurrence. It's critical that we find ways to overcome this form of treatment resistance.\"In his search for ways to improve radiation therapy, Dr. Denko and his team came across a drug called papaverine. Currently, papaverine has a variety of uses, none of which have direct links to cancer.For instance, papaverine can be used to reduce muscle spasms and to treat erectile dysfunction.Papaverine works by inhibiting respiration in mitochondria, the fabled powerhouses of the cell. Dr. Denko and his team found that by blocking the activity of oxygen-consuming mitochondria, they could make tumors more sensitive to radiation therapy.They showed that one dose of papaverine before radiation therapy reduced mitochondrial activity, thereby limiting hypoxia and enhancing the destruction of tumor cells.Earlier attempts to address the hypoxia problem have focused on adding more oxygen to the tumor. This study takes the opposite approach, by reducing the oxygen demand.Importantly, the drug did not make healthy tissue more sensitive to radiation therapy.These findings were published recently in the Proceedings of the National Academy of Sciences. In an associated commentary in the same issue of the journal, the authors write:\"It is well established that hypoxic cells are two to three times more resistant to radiation than aerobic cells [...] [This research] represents a potential landmark in the 6-decade-old quest to eliminate hypoxia as a cause for radiotherapy treatment failure.\"This is far from the end of the road, though. The researchers hope that by adjusting the structure of papaverine, they might be able to enhance its benefits further. By tinkering with its makeup, they might potentially reduce side effects, too.Although a great deal more work will be needed before this intervention comes into wider usage, it is an exciting finding. It is a relatively simple process, using a well-tested drug that might help boost the performance of existing cancer treatments.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323384.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}