{"id": "Antibiotic resistance: Breakthrough study offers solution", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.When a team at Case Western Reserve University School of Medicine in Cleveland, OH, treated mice with specific small molecules that stop bacteria from producing toxins, all the animals survived an MRSA sepsis infection, compared with less than a third of untreated mice.The finding is significant because if the same is true of humans, then it shows that it may not be necessary to use antibiotics to cure sepsis.The study, which features in the journal Scientific Reports, also suggests that these small molecules can increase the effectiveness of antibiotics. Mice treated with both had much lower levels of bloodborne bacteria than mice treated only with antibiotics.\"For relatively healthy patients,\" says senior author Menachem Shoham, who is an associate professor of biochemistry at Case Western, \"such as athletes suffering from a MRSA infection, these molecules may be enough to clear an infection.\"For those with weaker immune systems, then a combination of the small molecules with a low-dose antibiotic might be more effective. Dr. Shoham suggests that this could work in cases where the antibiotic used in the combination is one to which the bacteria have become resistant.He explains that the \"small molecules enhance the activity of conventional antibiotics, such as penicillin.\" This could open a route through which antibiotics that have become obsolete can once again be effective in the clinic.A global review that ended in 2016 estimated that 10 million lives per year could be at risk due to the growing worldwide threat of antimicrobial resistance.It states that if antibiotics are rendered ineffective, then many types of medical procedure and treatments — such as joint replacement, cesarean delivery, bowel surgery, and chemotherapy — \"could become too dangerous to perform.\"Resistance to antibiotics develops because every time someone uses them a small number of microbes survive due to having a natural resistance to the drugs.Eventually, the resistance spreads, not only because the microbes with natural resistance grow, but also because they share their resistance with others.The situation has now developed to the point where there are no effective antibiotics left to treat some infections.In the United States, infections due to antibiotic-resistant bacteria affect around 2 million people per year and account for 23,000 deaths.The small molecules that Dr. Shoham and his team have developed can attach themselves to toxin-producing proteins in bacteria belonging to Gram-positive species.The species include Staphylococcus aureus, the bacterium behind staph infections, and its highly resistant version methicillin-resistant Staphylococcus aureus (MRSA).The effect is to stop the bacteria in these strains from being able to make toxins that kill immune cells.The team treated mice with sepsis caused by S. aureus with the small molecules and found that they all survived, whereas 70 percent of untreated mice died.The small molecules also appeared to increase the effectiveness of antibiotics.Mice with S. aureus sepsis that were treated both with antibiotics and the small molecules had ten times lower levels of bacteria in their blood than infected mice that only received antibiotics.The researchers also carried out some preliminary tests that showed that the small molecules had a similar effect in several other strains of Gram-positive bacteria. They stopped them from being able to kill immune cells.One of the species is well-known for causing catheter infections, and another for causing strep throat.\"These results,\" conclude the authors, \"indicate broad-spectrum efficacy against Gram-positive pathogens.\"The team is in the process of commercializing two of the small molecules as drugs. Both have shown the ability to boost the effectiveness of antibiotics in mouse models of infection.The plan is to start clinical trials in people with multidrug-resistant infections.\"This could provide a partial solution to the looming, global threat of antibiotic resistance.\"Dr. Menachem ShohamYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323388.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}