{"id": "How you breathe may affect your memory", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Recently, neuroscientists have been scrutinizing the link between smell and memory.Some have suggested that a damaged sense of smell can predict dementia, and others have zoomed in on why that may be.Along the way to unraveling the Proustian mysteries of smells and memory, scientists have picked up several clues.The amygdala, which is a small brain region that processes sensory information, is close to the memory-storing hippocampus.Also, newer research shows that people with a good spatial memory may be better at identifying smells. Information related to time and space is present in the anterior olfactory nucleus, studies have shown. This is a brain area that is involved in the development of Alzheimer's.New research now adds breathing into the mix. A study carried out by scientists at the Karolinska Institutet in Stockholm, Sweden, finds that breathing through the nose, rather than the mouth, improves olfactory memory.Artin Arshamian, a researcher at the Department of Clinical Neuroscience with the Karolinska Institutet, is the first author of the paper.Arshamian and team asked male and female participants to learn 12 new smells on two occasions. After each \"sniffing session,\" they asked the participants to breathe either through their noses or through their mouths for 1 hour.When the hour was up, the participants smelled the old 12 scents along with the dozen new ones. The participants then decided which smells were old and which were new.Overall, when the people breathed through their noses, they memorized the smells better than when they breathed through their mouths.\"Our study shows that we remember smells better if we breathe through the nose when the memory is being consolidated — the process that takes place between learning and memory retrieval [...] This is the first time someone has demonstrated this.\"Artin ArshamianAs the scientists explain, previous research has shown that olfactory brain receptors can pick up not only smell but also small variations in airflow, with different parts of the brain being activated upon inhalation and exhalation.However, scientists do not currently know how different breathing patterns affect human behavior.\"The idea that breathing affects our behavior is actually not new,\" says Arshamian. \"In fact, the knowledge has been around for thousands of years in such areas as meditation.\"\"But no one has managed to prove scientifically what actually goes on in the brain,\" he explains. \"We now have tools that can reveal new clinical knowledge.\"Using these new tools, Arshamian and his colleagues plan to discover the exact mechanism responsible for the effect that breathing has on olfactory memory.\"The next step is to measure what actually happens in the brain during breathing and how this is linked to memory,\" says the study's lead author.\"This was previously a practical impossibility as electrodes had to be inserted directly into the brain. We've managed to get round this problem and now we're developing, with my colleague Johan Lundström, a new means of measuring activity in the olfactory bulb and brain without having to insert electrodes.\"Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323427.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}