{"id": "How does income actually affect life expectancy?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.An influential study published in 2016 in JAMA Network found that there was a significant difference in the life expectancy of people living in different areas of the United States.The difference, the researchers argued, was down to the variation in the populations' income levels. Their results suggested that among U.S. men aged 40 years and older, those with the lowest income were expected to live 14.6 years less than men with the highest income.In the case of U.S. women at the same age, life expectancy was 10.1 years shorter for those with the lowest incomes compared with those with the highest incomes.However, researchers from the University of Copenhagen in Denmark now argue that these calculations did not take into account an important factor — namely, income mobility.The Danish team — comprising economists Claus Thustrup Kreiner, Torben Heien Nielsen, and Benjamin Ly Serena — note that their American colleagues treated income levels as constant throughout a person's lifetime.However, they argue, that is not how things work. In reality, people who have low incomes at one point in their lives can transition to higher income levels, while people with high incomes can slide down the income scale over the course of their lives.In a new study, the findings of which appear in the journal PNAS, Kreiner's team devised a method of taking such changes into account when calculating differences in life expectancy.The Danish economists note that, over a period of 10 years, approximately half of the people with the lowest incomes tend to climb up the economic scale, while about half of those who are very well-off initially will transition to lower incomes.In order to understand how this economic mobility — both upward and downward — might affect the life expectancy gap, the team developed a specialized method based on a preexisting model of social mobility.The researchers then used this method to calculate life expectancy in Denmark for people at the age of 40. In their analysis, they used official income data and mortality records from between 1980 and 2013.In doing so, they found that the gaps in life expectancy between people who move to different income levels are very distinct in comparison with those between people who maintain their income levels.Thus, when taking income mobility into consideration, Kreiner and colleagues observed that a 40-year-old man in the upper-income groups had a life expectancy of 77.6 years, while a man of the same age but with a low income would have a life expectancy of 75.2 years.This means that there is a 2.4-year gap in the life expectancy of men with different income levels. For women, the gap is 2.2 years.\"Our results reveal that inequality in life expectancy is significantly exaggerated when not accounting for mobility,\" notes Kreiner.\"This result is quintessential not only for our understanding of one of the most important measures of inequality in a society, namely, how long different groups can expect to live,\" he continues, \"but also by mis-measuring this type of inequality, we get to misleading conclusions about the cost and benefits of public health programs such as Medicare and social security policies.\"Despite the fact that the discrepancy does not appear to be as large as specialists had anticipated, the Danish team warn that people should not take it lightly. This is especially true, they note, because the life expectancy gap has been widening over the past 30 years.The Danish researchers did not look into the reasons behind this ever-widening gap as part of their project. However, they believe that socioeconomic and educational inequalities may be behind it all.Individuals from high-income and well-educated groups, they say, may find it easier to take advantage of new technologies that allow them to safeguard their own health and well-being.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323517.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}