{"id": "What are the side effects of insulin therapy?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In this article, we look at what insulin is and who needs to take it. We also cover the side effects, risks, and myths of insulin therapy and provide tips for taking insulin safely.Insulin is a hormone that helps regulate the amount of sugar in the blood.When a person eats, their digestive system breaks down the food into a simple sugar known as glucose, which raises blood sugar levels. The pancreas responds to this by releasing insulin, which causes sugar to move from the bloodstream into the body's cells, which need it as an energy source. The body also stores some of the excess sugar in the liver.Insulin has a counterpart called glucagon, which is a hormone that works in the opposite way. When blood sugar is too low, the pancreas secretes glucagon, which causes the liver to release glucose into the bloodstream.The body uses insulin and glucagon to ensure that blood sugar levels do not get too high or too low and that cells are getting enough glucose.Scientists can make synthetic insulin, which doctors use to treat some people with diabetes.Diabetes is a condition that causes high blood sugar levels. There are three main types of diabetes:Type 1 and type 2 diabetes are usually lifelong conditions. According to the Centers for Disease Control and Prevention (CDC), more than 30 million people in the United States have diabetes, with type 2 diabetes responsible for around 90 to 95 percent of cases.People with type 1 diabetes require some form of daily insulin therapy to remain healthy, but the treatment regimen will vary from person to person. Some individuals may need to inject themselves with insulin two to four times a day. Other people may need to use an insulin pump, which is a wearable device that automatically provides insulin throughout the day.A doctor can help a person with type 1 diabetes find an insulin therapy regimen that suits their needs. According to the American Academy of Family Physicians, there are several different types of insulin that people may use separately or in combination. These include:People with type 2 diabetes can often manage their condition without insulin therapy. Alternative treatment options include lifestyle and dietary changes and non-insulin medications, such as metformin. However, if a person is unable to control their blood sugar levels in this way, a doctor may recommend insulin therapy.Women with gestational diabetes typically receive insulin, but they can also manage their diabetes with metformin.Many different types and brands of insulin are available for use in the U.S. The side effects that a person may experience will depend on the type of insulin that they are taking.However, some common side effects include:If a person's blood sugar drops too low, they may experience symptoms such as:There is also the possibility that taking insulin will cause more severe side effects, although these are less common.A 2013 review compared metformin treatment with insulin therapy in people with type 2 diabetes. The researchers found that the insulin therapy group had an increased risk of a range of complications, including:Another review concluded that the risks of insulin therapy might outweigh the benefits for people with type 2 diabetes. The authors highlighted the following downsides of the therapy:According to the American Diabetes Association (ADA), several common myths surround the use of insulin therapy for people with type 2 diabetes. People may sometimes hear others make the following statements, but they are all untrue:Insulin is a prescription medication. A person should speak to their doctor about:People with type 2 or gestational diabetes should discuss with their doctor whether insulin therapy is the best choice for them. They may be able to use other treatment options to control their blood sugar levels, such as non-insulin medications and lifestyle and dietary changes.It is essential that people who are taking insulin monitor their blood sugar levels regularly. Taking too much or too little insulin can lead to side effects or complications. It is also vital that a person follows the treatment schedule that they agreed with their doctor and avoids missing doses.Anyone who experiences side effects from insulin therapy should speak to a doctor. It is possible that another treatment plan or a different type of insulin may be more suitable for their needs and lifestyle. A doctor can also advise on how to prevent or reduce certain side effects.People with type 1 diabetes need to take insulin daily to control their blood sugar levels and remain healthy. Many individuals with type 2 diabetes and gestational diabetes can use non-insulin medications and dietary and lifestyle changes instead to manage their condition.When taking insulin, it is vital that people follow their treatment plan. Anyone experiencing side effects or complications from insulin therapy should speak to their doctor, who can recommend other treatment plans or different types of insulin. A doctor can also provide advice on how to prevent or reduce certain side effects. Article last reviewed by Thu 18 October 2018.Visit our Diabetes category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Diabetes.All references are available in the References tab.\t\t\nCurrie, C. J., Poole, C. D., Evans, M., Peters, J. R., & Morgan, C. L. (2013, February 1). Mortality and other important diabetes-related outcomes with insulin vs other antihyperglycemic therapies in type 2 diabetes. The Journal of Clinical Endocrinology & Metabolism, 98(2), 668–677. Retrieved from https://academic.oup.com/jcem/article/98/2/668/2833166Insulin basics. (2015, July 16). Retrieved from http://www.diabetes.org/living-with-diabetes/treatment-and-care/medication/insulin/insulin-basics.htmlInsulin myths and facts [Fact sheet]. (2007, January). Retrieved from http://clinical.diabetesjournals.org/content/diaclin/25/1/39.full.pdfInsulin therapy. (2018, February 8). Retrieved from https://familydoctor.org/insulin-therapy/Lebovitz, H. E. (2011, May). Insulin: Potential negative consequences of early routine use in patients with type 2 diabetes. Diabetes Care, 34(Suppl. 2), S225–S230. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3632184/Type 2 diabetes. (2018, August 15). Retrieved from https://www.cdc.gov/diabetes/basics/type2.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLAFletcher, Jenna. \"What are the side effects of insulin therapy?.\" Medical News Today. MediLexicon, Intl., 18 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323387.php>APAFletcher, J. (2018, October 18). \"What are the side effects of insulin therapy?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323387.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323387.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}