{"id": "How to manage a polyester allergy", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In this article, we look at the symptoms, treatment, and prevention of a polyester allergy.A person with a polyester allergy may experience a skin reaction when they come into direct contact with fabrics containing polyester. Polyester is a widespread synthetic fiber that is common in:A polyester allergy is a type of contact dermatitis. There are two main types of contact dermatitis:Polyester allergies are more likely to be due to irritant contact dermatitis.Polyester allergies typically affect the area of skin that the fabric comes into contact with. Symptoms can include:These symptoms may develop within minutes or hours of coming into contact with polyester, or they may take 1–2 days to appear.Correctly identifying a polyester allergy is challenging. The polyester-based material sometimes contains a range of other potential irritants, such as detergents, dyes, or fragrances.Before undergoing any form of treatment, it is important to identify the source of the allergy with the help of a doctor.The most effective way to treat a polyester allergy is to avoid coming into contact with polyester. Replacing household products and items of clothing with polyester-free versions can help reduce the risk of experiencing a reaction.However, it will not always be easy or possible to avoid all polyester, particularly at work or in other public places. There are a range of over-the-counter (OTC) and prescription medications available to relieve the symptoms of a polyester allergy, including:A doctor can provide guidance on how to use these medications.If a person's symptoms do not respond to treatment, a doctor may recommend light therapy, or phototherapy. This therapy uses a special type of light to slow cell growth and inflammation in the skin. Doctors use it to treat a range of skin conditions, including polyester allergies.A person can prevent reactions to polyester by avoiding direct contact with fabric that contains polyester. This may require finding alternatives to clothing or furnishings made from polyester. Alternative fabrics include:Fabrics often contain a mix of different fibers, so it is essential to check the label before buying. For example, many cotton-based materials also contain polyester.Many carpets also contain polyester, but it may not always be practical or affordable to replace these. However, a person can avoid direct contact with a polyester carpet by:Informing an employer can also help reduce the risk of coming into contact with polyester. A person's employer may take measures to replace polyester-based products with suitable alternatives. A doctor can provide written confirmation of a polyester allergy.There are certain factors that can increase the likelihood of having a polyester allergy, such as:Polyester is a common synthetic fiber that manufacturers use in a range of fabrics, including clothing and home furnishings. For some people, coming into direct contact with polyester can cause a skin reaction.The best prevention method for a polyester allergy is to avoid all skin contact with fabrics that contain polyester. This may not always be possible, but OTC and prescriptions medications are available to help manage symptoms. Article last reviewed by Fri  2 November 2018.Visit our Allergy category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Allergy.All references are available in the References tab.\t\t\nAllergies. (n.d.). Retrieved from https://www.aaaai.org/conditions-and-treatments/allergiesContact dermatitis. (n.d.). Retrieved from https://www.aad.org/public/diseases/eczema/contact-dermatitisContact dermatitis. (n.d.). Retrieved from https://acaai.org/allergies/types/skin-allergies/contact-dermatitisContact dermatitis. (n.d.). Retrieved from https://nationaleczema.org/eczema/types-of-eczema/contact-dermatitis/Fonacier, L., Bernstein, D. I., Pacheco, K., Holness, D. L., Blessing-Moore, J., Khan, D., ... Wallace, D. (2015, February 26). Contact dermatitis: A practice parameter — Update 2015. The Journal of Allergy and Clinical Immunology: In Practice, 3(3), S1–S39. Retrieved from https://www.aaaai.org/Aaaai/media/MediaLibrary/PDF%20Documents/Practice%20and%20Parameters/Contact-dermatitis-2015.pdfPlease use one of the following formats to cite this article in your essay, paper or report:MLAKandola, Aaron. \"How to manage a polyester allergy.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323566.php>APAKandola, A. (2018, November 2). \"How to manage a polyester allergy.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323566.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323566.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}