{"id": "Does Emergen-C Work?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Emergen-C may be worth taking as a general immune booster, but the jury is still out on whether it can help prevent or treat conditions like the common cold.Here's what you should know about its ingredients, purported uses, potential side effects, and more.As the name suggests, Emergen-C's main ingredient is vitamin C. Each serving (one 9.1 g packet) contains 1,000 milligrams (mg), or 1,667 percent of your recommended daily allowance (RDA).Emergen-C also contains:The ingredients are said to:Although there's some evidence to suggest that Emergen-C can help minimize the duration of your cold, research is limited.One 2013 review of placebo-controlled trials found that taking vitamin C supplements regularly didn't stop most people getting the cold.However, the risk of getting the cold was halved in people exposed to short periods of extreme physical stress, such as marathon runners and skiers.Researchers also found that regularly taking vitamin C supplements slightly reduced the duration of cold symptoms in the ordinary population.One 2017 review of seven randomized trials found that using zinc lozenges may shorten cold duration by approximately 33 percent.It's important to note that these studies were done on specific ingredients found in Emergen-C, not the drink mix itself. More research is needed to determine whether Emergen-C offers the same benefits.As for the flu, the National Center for Complementary and Integrative Health states that there isn't strong evidence that any natural product can help treat or prevent the illness. Instead, they recommend the annual flu vaccine as the best means of prevention.Although there's reason to believe vitamin C supplements may have slight benefit, more research is needed to fully assess Emergen-C's potential effects on sore throat, fatigue, and other health claims.Taking vitamin C supplements regularly may slightly reduce the duration of cold symptoms, like a sore throat.However, there isn't any evidence that vitamin C supplements can help treat sore throat conditions like strep throat, tonsillitis, pharyngitis, and laryngitis.One 2012 study analyzed the effects of intravenous vitamin C on fatigue in 141 office workers. Researchers found that intravenous vitamin C reduced fatigue within two hours of treatment, with the effect lasting for one day.Research on vitamin C supplementation and related weight loss has produced inconsistent results.One 2006 small study of just 22 participants found that during a 60-minute walk on a treadmill, participants with low-blood concentrations of vitamin C burned 25 percent less fat than participants with adequate amounts of vitamin C.However, researchers in a 2014 study found no sufficient evidence that vitamin C is linked to general changes in body weight.Taking an increased amount of vitamin C for a short period of time is generally considered safe.Vitamin C's tolerable upper intake level (UL) is 2,000 mg per day for adults ages 19 and older.Emergen-C packets contain 1,000 mg each. This means that you can probably still consume vitamin C through your diet without hitting the max UL.Consuming 2,000 mg or more may cause:Emergen-C contains far lower levels of all of the other vitamins and minerals on its ingredient list. No other ingredient comes this close to the respective UL for adults.Talk to a doctor or other healthcare provider before use if you:You shouldn't use Emergen-C as your primary line of defense against the common cold, flu, or other conditions.Emergen-C may be helpful as a temporary immune booster, but it shouldn't be used long term. Instead, look to your diet.If you eat the five recommended servings of fruits and vegetables each day, you should get more than 200 mg of vitamin C — well above your RDA. This can help keep your immune system in tip-top shape and help prevent illness in the long-run.Medically reviewed by Dena Westphalen, PharmD on October 10, 2018 — Written by Claire Gillespie and Ana Gotter Article last reviewed by Thu  1 November 2018.Visit our Pharmacy / Pharmacist category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Pharmacy / Pharmacist.All references are available in the References tab.\t\t\n5 Tips: Natural products for the flu and colds: What does the science say? (2017). Retrieved from https://nccih.nih.gov/health/tips/flucold.htm%EF%BB%BFCan vitamin C prevent a cold? (2017). Retrieved from https://www.health.harvard.edu/cold-and-flu/can-vitamin-c-prevent-a-coldEmergen-C 1,000 mg Vitamin C — Super Orange. (n.d.). Retrieved from https://www.labeling.pfizer.com/ShowLabeling.aspx?id=3178Hemilä, H., & Chalker, E. (2013). Vitamin C for preventing and treating the common cold. Cochrane Database Systematic Review, 1. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/23440782Hemilä, H. (2017). Zinc lozenges and the common cold: a meta-analysis comparing zinc acetate and zinc gluconate, and the role of zinc dosage. JRSM Open, 8(5). Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/28515951Ingredients. (n.d.). https://www.emergenc.com/our-ingredientsJohnston, C.S., Corte, C., & Swan, P. D. (2006). Marginal vitamin C status is associated with reduced fat oxidation during submaximal exercise in young adults. Nutritional Metabolism. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/16945143Larsen, S. C., Angquist, L., Ahluwalia, T. S., Skaaby, T., Roswall, N., Tjønneland, A., ... Sørensen, T. I. (2014). Dietary ascorbic acid and subsequent change in body weight and waist circumference: associations may depend on genetic predisposition to obesity--a prospective study of three independent cohorts. Nutritional Journal, 13(43). Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/24886192Lee, D. H., Folsom, A. R., Harnackm, L., Halliwell, B., Jacobs, D. R. Jr. (2004). Does supplemental vitamin C increase cardiovascular disease risk in women with diabetes? American Journal of Clinical Nutrition, 80(5). Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/15531665Multivitamin/mineral supplements: Fact sheet for health professionals. (2015). Retrieved from https://ods.od.nih.gov/factsheets/MVMS-HealthProfessional/Suh, S. Y., Bae, W. K., Ahn, H. Y., Choi, S. E., Jung, G. C., & Yeom, C. H. (2012). Intravenous Vitamin C administration reduces fatigue in office workers: a double-blind randomized controlled trial. Nutritional Journal, 11(17). Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/22264303Vitamin B12: Fact sheet for health professionals. (2018). Retrieved from https://ods.od.nih.gov/factsheets/VitaminB12-HealthProfessional/Vitamin B6: Dietary supplement fact sheet. (2018). Retrieved from https://ods.od.nih.gov/factsheets/VitaminB6-HealthProfessional/Vitamin C: Fact sheet for health professionals. (2018). Retrieved from https://ods.od.nih.gov/factsheets/VitaminC%20-HealthProfessional/Please use one of the following formats to cite this article in your essay, paper or report:MLAClaire Gillespie and Ana Gotter. \"Does Emergen-C Work?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323550.php>APAClaire Gillespie and Ana Gotter. (2018, November 2). \"Does Emergen-C Work?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323550.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323550.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}