{"id": "Does lavender really help with anxiety?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Investigators at Kagoshima University in Japan studied the effect of linalool, a sweet-smelling alcohol that is present in essential oils of lavender and other scented plants, in mice.They showed that exposure to linalool vapor affects the brain through smell and not by being absorbed into the bloodstream via the lungs.Another key finding was that unlike anxiolytic, or anti-anxiety, drugs (such as benzodiazepines), linalool works without impairing movement.The researchers suggest that their study paves the way for further investigations into how to use linalool's calming properties in humans, citing a need for \"safer alternatives\" to benzodiazepines and other anti-anxiety medications.One application that they foresee is to help people about to undergo surgery to relax before receiving general anesthesia.A paper on the study now features in the journal Frontiers in Behavioral Neuroscience.Anxiety can range from short-lived worry or fear about a problem, decision, or stressful situation such as doing an exam, to a lasting, or chronic, condition that does not go away.When anxiety is chronic, the symptoms can progressively worsen and disrupt daily life, work, relationships, and school.There are several forms of the condition, which are collectively termed anxiety disorders. These include panic disorder, generalized anxiety disorder, and phobia-related conditions.Estimates for 2015 from the World Health Organization (WHO) suggest that anxiety disorders affect 3.6 percent of the global population and that this figure varies among countries. In the United States, the prevalence is around 6.3 percent.The recent study is not the first to investigate the calming effects of linalool, notes co-author Dr. Hideki Kashiwadani, of the Graduate School of Medical and Dental Sciences at Kagoshima University.\"However,\" Dr. Kashiwadani reports, \"the sites of action of linalool were usually not addressed in these studies.\"The prevailing assumption was that inhaling linalool led to it being absorbed through the lungs into the bloodstream. From the bloodstream, it could then reach signal-sensing proteins called gamma-aminobutyric acid type A (GABAA) receptors in nerve cells, or neurons, in the brain. Benzodiazepines also target these receptors.Dr. Kashiwadani and his colleagues used various experiments involving, for example, a \"light/dark box\" and an \"elevated plus maze,\" to test the effect of exposure to linalool vapor in normal mice.They saw that the compound exerted \"an anxiolytic effect without motor impairment.\" This is in contrast to benzodiazepines and injected linalool, which impair movement in a similar way to consumed alcohol.Exposing mice that lacked a sense of smell to the compound did not produce the same effect, thus confirming that \"olfactory input\" was the route to the brain.In addition, when the scientists pretreated the normal mice with the drug flumazenil before allowing them to smell the linalool vapor, the animals showed no reduction in anxiety. Flumazenil blocks the GABAA receptors that respond to benzodiazepine.\"When combined,\" Dr. Kashiwadani notes, \"these results suggest that linalool does not act directly on GABAA receptors like benzodiazepines do — but must activate them via olfactory neurons in the nose in order to produce its relaxing effects.\"He says that further research is now needed to test the safety and effectiveness of linalool, and to find out the exact sites in the brain that the compound targets.As well as being a potential relaxant for people about to undergo surgery, the compound could also offer an alternative for those who struggle with \"oral or suppository administration of anxiolytics, such as infants or confused elders,\" Dr. Kashiwadani adds.\"Our study also opens the possibility that relaxation seen in mice fed or injected with linalool could in fact be due to the smell of the compound emitted in their exhaled breath.\"Dr. Hideki KashiwadaniYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323422.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}