{"id": "Can Crohn's disease be fatal?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Crohn's is a long-term inflammatory bowel disease (IBD). It most commonly affects the ileum, which is the end section of the small intestine, and the first section of the large intestine, or colon.However, Crohn's can affect any part of the gastrointestinal tract, from the mouth to the anus.As many as 780,000 people in the United States may have Crohn's disease.Depending on the location and extent of the disease, a person with Crohn's may develop serious complications.In this article, we identify some life-threatening complications of Crohn's disease and describe associated symptoms.According to the Crohn's & Colitis Foundation, a person with Crohn's is unlikely to die from the disease.Crohn's can, however, cause life-threatening complications, such as severe infections and colorectal cancer.Being aware of these complications' symptoms is essential so a person can talk to a doctor as soon as possible.Prompt treatment can increase the likelihood of a good recovery. A person can also take preventative measures to reduce their risk of these complications.Below are some severe complications of Crohn's disease:People with IBD have an increased risk of developing dysplasia. This occurs when abnormal cells form in the lining of the colon or rectum. Over time, these cells can become cancerous.When Crohn's disease affects the colon, a person may have an increased risk of colorectal cancer, compared to the general population.This risk is higher for people who have had Crohn's for 8–10 years or more.To help a doctor detect dysplasia early and possibly prevent colorectal cancer:SymptomsDespite the increased risk, the vast majority of people with Crohn's disease never develop colorectal cancer.Nonetheless, people should be familiar with the symptoms of this type of cancer and report any to a doctor. The disease is highly treatable in the early stages.Symptoms of colorectal cancer include:Inflammation from Crohn's disease can spread through the intestinal wall, creating an abscess.As the abscess grows, it forms a small hole in the wall, and this hole can develop into a fistula. A fistula is an abnormal passageway that connects one organ to another.Around 1 in 4 people with Crohn's develop fistulas. In most cases, fistulas originate in the bowel. They may connect to other parts of the bowel or other internal organs.Sometimes, a fistula forms a tunnel from the intestine to the outer surface of the skin. The medical term for this is an enterocutaneous fistula (ECF).Most people with ECFs experience at least one complication, such as malnutrition or sepsis. Sepsis is a whole-body inflammatory response to infection. Without treatment, malnutrition and sepsis can result in death.Fistulas usually contain intestinal bacteria and other infectious material, so doctors will use antibiotics to treat them.Large, numerous, or persistent fistulas usually require surgery.SymptomsThe symptoms of a fistula differ, depending on the location. However, some common symptoms include:Fistulas that do not respond to medications increase the risk of sepsis and may require emergency surgery.Sepsis constitutes a medical emergency, and it can be fatal.Symptoms of sepsis include:An intestinal obstruction is the most common complication of Crohn's disease.An obstruction usually results when a buildup of scar tissue narrows a section of the colon, making it difficult for the stool to pass. Doctors call these narrowed passages \"strictures.\"The medical community generally does not consider strictures to be life-threatening. However, the narrowing of the passage can lead to a tear, or perforation, in the colon.A perforated colon can be life-threatening, so strictures and other forms of intestinal obstruction usually require immediate surgery.SymptomsSymptoms of an intestinal stricture include:Chronic inflammation, abscesses, fistulas, and strictures can weaken points in the intestinal wall.Over time, the wall can tear, or perforate, allowing bacteria and other infectious substances to leak from the intestine into the abdomen. The medical term for this is peritonitis.Peritonitis can cause more severe complications, such as blood poisoning and sepsis.SymptomsA perforated colon is a medical emergency. A person needs surgery to repair the hole in the intestine.Symptoms of a perforated colon include:Toxic megacolon is a rare but life-threatening complication of IBD. Although it is more common among people with ulcerative colitis, it can also occur in people with Crohn's disease.Toxic megacolon occurs when inflammation causes the colon to expand to such an extent that it cannot contract. The result is a buildup of gas.The buildup can cause the colon to burst, leaking harmful bacteria and toxins into the bloodstream.This can lead to a range of life-threatening complications, including:SymptomsRecognizing indications of toxic megacolon and receiving prompt treatment can reduce the risk of life-threatening complications.Symptoms of toxic megacolon include:Crohn's disease can cause several life-threatening complications. However, for most people with the disease, the risk of developing these problems is very small.Spotting the symptoms early and receiving prompt treatment can increase the likelihood of recovery. Article last reviewed by Wed 24 October 2018.Visit our Crohn's / IBD category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Crohn's / IBD.All references are available in the References tab.\t\t\nAutenrieth, D. M., & Baumgart, D. C. (2012, March). Toxic megacolon. Inflammatory Bowel Diseases, 18(3), 584–591. Retrieved from https://onlinelibrary.wiley.com/doi/full/10.1002/ibd.21847Bringing to the light the risk of colorectal cancer among Crohn's & ulcerative colitis patients. (2016, February 26). Retrieved from http://www.crohnscolitisfoundation.org/resources/colorectal-cancer.htmlColorectal cancer signs and symptoms. (2018, February 21). Retrieved from https://www.cancer.org/cancer/colon-rectal-cancer/detection-diagnosis-staging/signs-and-symptoms.htmlCrohn's disease: Your guide. (2018, February). Retrieved from http://s3-eu-west-1.amazonaws.com/files.crohnsandcolitis.org.uk/Publications/crohns-disease.pdfFacts about inflammatory bowel diseases. (2011, May 1). Retrieved from http://www.crohnscolitisfoundation.org/resources/facts-about-inflammatory.htmlIntestinal complications. (2012, May 1). Retrieved from http://www.crohnscolitisfoundation.org/resources/intestinal-complications.htmlLiving with a fistula. (2016, December). Retrieved from http://s3-eu-west-1.amazonaws.com/files.crohnsandcolitis.org.uk/Publications/fistula.pdfMartinez, J. L., Luque-de-León, E., Ballinas-Oseguera, G., Mendez, J. D., Juárez-Oropeza, M. A., & Román-Ramos, R. (2012, January). Factors predictive of recurrence and mortality after surgical repair of enterocutaneous fistula. Journal of Gastrointestinal Surgery, 16(1), 156–164. Retrieved from https://link.springer.com/article/10.1007/s11605-011-1703-7Surgery for Crohn's disease & ulcerative colitis. (2010, August 31). Retrieved from http://www.crohnscolitisfoundation.org/resources/surgery-for-crohns-uc.htmlSymptoms. (n.d.). Retrieved from https://www.sepsis.org/sepsis/symptoms/Toxic megacolon. (n.d.). Retrieved from https://www.hopkinsmedicine.org/healthlibrary/conditions/digestive_disorders/toxic_megacolon_134,180What is a fistula? (n.d.). Retrieved from https://www.nafc.org/fistula/What is Crohn's disease? (n.d). Retrieved from http://www.crohnscolitisfoundation.org/what-are-crohns-and-colitis/what-is-crohns-disease/Please use one of the following formats to cite this article in your essay, paper or report:MLALillis, Charlotte. \"Can Crohn's disease be fatal?.\" Medical News Today. MediLexicon, Intl., 24 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323438.php>APALillis, C. (2018, October 24). \"Can Crohn's disease be fatal?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323438.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323438.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}