{"id": "What to know about cancer", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In the United States, an estimated 15.5 million people with a history of cancer were living as of January 1, 2016, according to a 2018 report from the American Cancer Society.In this article, we examine types of cancer, how the disease develops, and the many treatments that help improve the quality of life and survival rates.Cancer is a broad term. It describes the disease that results when cellular changes cause the uncontrolled growth and division of cells.Some types of cancer cause rapid cell growth, while others cause cells to grow and divide at a slower rate.Certain forms of cancer result in visible growths called tumors, while others, such as leukemia, do not.Most of the body's cells have specific functions and fixed lifespans. While it may sound like a bad thing, cell death is part of a natural and beneficial phenomenon called apoptosis.A cell receives instructions to die so that the body can replace it with a newer cell that functions better. Cancerous cells lack the components that instruct them to stop dividing and to die.As a result, they build up in the body, using oxygen and nutrients that would usually nourish other cells. Cancerous cells can form tumors, impair the immune system and cause other changes that prevent the body from functioning regularly.Cancerous cells may appear in one area, then spread via the lymph nodes. These are clusters of immune cells located throughout the body.There are many causes of cancer, and some are preventable.For example, over 480,000 people die in the U.S. each year from smoking cigarettes, according to data reported in 2014.In addition to smoking, risk factors for cancer include:Other causes of cancer are not preventable. Currently, the most significant unpreventable risk factor is age. According to the American Cancer Society, doctors in the U.S. diagnose 87 percent of cancer cases in people ages 50 years or older.Genetic factors can contribute to the development of cancer.A person's genetic code tells their cells when to divide and expire. Changes in the genes can lead to faulty instructions, and cancer can result.Genes also influence the cells' production of proteins, and proteins carry many of the instructions for cellular growth and division.Some genes change proteins that would usually repair damaged cells. This can lead to cancer. If a parent has these genes, they may pass on the altered instructions to their offspring.Some genetic changes occur after birth, and factors such as smoking and sun exposure can increase the risk.Other changes that can result in cancer take place in the chemical signals that determine how the body deploys, or \"expresses\" specific genes.Finally, a person can inherit a predisposition for a type of cancer. A doctor may refer to this as having a hereditary cancer syndrome. Inherited genetic mutations significantly contribute to the development of 5–10 percent of cancer cases.Innovative research has fueled the development of new medications and treatment technologies.Doctors usually prescribe treatments based on the type of cancer, its stage at diagnosis, and the person's overall health.Below are examples of approaches to cancer treatment:Doctors will often employ more than one type of treatment to maximize effectiveness.The most common type of cancer in the U.S. is breast cancer, followed by lung and prostate cancers, according to the National Cancer Institute, which excluded nonmelanoma skin cancers from these findings.Each year, more than 40,000 people in the country receive a diagnosis of one of the following types of cancer:Other forms are less common. According to the National Cancer Institute, there are over 100 types of cancer.Doctors classify cancer by:For example, sarcomas develop in bones or soft tissues, while carcinomas form in cells that cover internal or external surfaces in the body. Basal cell carcinomas develop in the skin, while adenocarcinomas can form in the breast.When cancerous cells spread to other parts of the body, the medical term for this is metastasis.A person can also have more than one type of cancer at a time.Improvements in cancer detection, increased awareness of the risks of smoking, and a drop in tobacco use have all contributed to a year-on-year decrease in the number of cancer diagnoses and deaths.According to the American Cancer Society, the overall cancer death rate declined by 26 percent between 1991 and 2015.When a person has cancer, the outlook will depend on whether the disease has spread and on its type, severity, and location.Cancer causes cells to divide uncontrollably. It also prevents them from dying at the natural point in their life cycle.Genetic factors and lifestyle choices, such as smoking, can contribute to the development of the disease. Several elements affect the ways that DNA communicates with cells and directs their division and death.After nonmelanoma skin cancer, breast cancer is the most common type in the U.S. However, lung cancer is the leading cause of cancer-related death.Treatments are constantly improving. Examples of current methods include chemotherapy, radiation therapy, and surgery. Some people benefit from newer options, such as stem cell transplantation and precision medicine.The diagnosis and death rates of cancer are dropping yearly.How do I recognize cancer before it starts to cause serious health problems?Some cancers cause early symptoms, but others do not exhibit symptoms until they are more advanced. Many of these symptoms are often from causes unrelated to cancer.The best way to identify cancer early is to report any unusual, persistent symptoms to your doctor so they can advise you on any further testing that may be needed.Some symptoms of cancer can be found here.  Article last reviewed by Mon 12 November 2018.Visit our Cancer / Oncology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Cancer / Oncology.All references are available in the References tab.\t\t\nCancer facts & figures 2017. (2017). Retrieved from https://www.cancer.org/content/dam/cancer-org/research/cancer-facts-and-statistics/annual-cancer-facts-and-figures/2017/cancer-facts-and-figures-2017.pdf  Cancer facts & figures 2018. (2018). Retrieved from https://www.cancer.org/content/dam/cancer-org/research/cancer-facts-and-statistics/annual-cancer-facts-and-figures/2018/cancer-facts-and-figures-2018.pdf Common cancer types. (2018, February 26). Retrieved from https://www.cancer.gov/types/common-cancers The genetics of cancer. (2017, October 12). Retrieved from https://www.cancer.gov/about-cancer/causes-prevention/genetics What is cancer? (2015, December 8). Retrieved from https://www.cancer.org/cancer/cancer-basics/what-is-cancer.html What is cancer? (2015, February 9). Retrieved from https://www.cancer.gov/about-cancer/understanding/what-is-cancerPlease use one of the following formats to cite this article in your essay, paper or report:MLANall, Rachel. \"What to know about cancer.\" Medical News Today. MediLexicon, Intl., 12 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323648.php>APANall, R. (2018, November 12). \"What to know about cancer.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323648.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323648.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}