{"id": "What is obesity and what causes it?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Body mass index (BMI) is a tool that doctors use to assess if a person is at an appropriate weight for their age, sex, and height. The measurement combines height and weight.A BMI between 25 and 29.9 indicates that a person is carrying excess weight. A BMI of 30 or over suggests that a person may have obesity.Other factors, such as the ratio of waist-to-hip size (WHR), waist-to-height ratio (WtHR), and the amount and distribution of fat on the body also play a role in determining how healthy a person's weight and body shape are.If a person does have obesity and excess weight, this can increase their risk of developing a number of health conditions, including metabolic syndrome, arthritis, and some types of cancer.Metabolic syndrome involves a collection of issues, such as high blood pressure, type 2 diabetes, and cardiovascular disease.Maintaining a healthy weight or losing through diet and exercise is one way to prevent or reduce obesity. In some cases, a person may need surgery.Now read on to find out why obesity happens.\n\nWhen a person consumes more calories than they use as energy, their body will store the extra calories as fat. This can lead to excess weight and obesity.Also, some types of foods are more likely to lead to weight gain, especially those that are high in fats and sugars.Foods that tend to increase the risk of weight gain include:Some processed food products contain high-fructose corn syrup as a sweetener, including savory items, such as ketchup.Eating too much of these foods and doing too little exercise can result in weight gain and obesity.A person who consumes a diet that consists mainly of fruits, vegetables, whole grains, and water is still at risk of gaining excess weight if they overeat, or if genetic factors, for example, increase their risk.However, they are more likely to enjoy a varied diet while maintaining a healthy weight. Fresh foods and whole grains contain fiber, which makes a person feel full for longer and encourages healthy digestion.Many people lead a much more sedentary lifestyle than their parents and grandparents did.Examples of sedentary habits include:The less a person moves around, the fewer calories they burn.Also, physical activity affects how a person's hormones work, and hormones have an impact on how the body processes food.Several studies have shown that physical activity can help to keep insulin levels stable and that unstable insulin levels may lead to weight gain.Researchers who published a review in BMJ Open Sport and Exercise Medicine in 2017 noted that, while the designs of some studies make it hard to draw exact conclusions, \"A lifestyle incorporating regular [physical activity] has been identified as a key factor for maintaining and improving many aspects of health, including insulin sensitivity.\"Physical activity need not be training in the gym. Physical work, walking or cycling, climbing stairs, and household tasks all contribute.However, the type and intensity of activity may affect the degree to which it benefits the body in the short- and long-term.Research has suggested that missing sleep increases the risk of gaining weight and developing obesity.Researchers reviewed evidence for over 28,000 children and 15,000 adults in the United Kingdom from 1977 to 2012. In 2012, they concluded that sleep deprivation significantly increased obesity risk in both adults and children.The changes affected children as young as 5 years of age.The team suggested that sleep deprivation may lead to obesity because it can lead to hormonal changes that increase the appetite.When a person does not sleep enough, their body produces ghrelin, a hormone that stimulates appetite. At the same time, a lack of sleep also results in a lower production of leptin, a hormone that suppresses the appetite.A team from the University of Barcelona published a study in the World Journal of Gastroenterology that provides clues as to how liquid fructose — a type of sugar — in beverages may alter lipid energy metabolism and lead to fatty liver and metabolic syndrome.Features of metabolic syndrome include diabetes, cardiovascular disease, and high blood pressure. People with obesity are more likely to have metabolic syndrome.After feeding rats a 10-percent fructose solution for 14 days, the scientists noted that their metabolism was starting to change.Scientists believe there is a link between high consumption of fructose and obesity and metabolic syndrome. Authorities have raised concerns about the use of high-fructose corn syrup to sweeten drinks and other food products.Animal studies have found that when obesity occurs due to fructose consumption, there is also a close link with type 2 diabetes.In 2018, researchers published the results of investigations involving young rats. They, too experienced metabolic changes, oxidative stress, and inflammation after consuming fructose syrup.The researchers note that \"increased fructose intake may be an important predictor of metabolic risk in young people.\"They call for changes in the diets of young people to prevent these problems.Foods that contain high-fructose corn syrup include:To reduce your intake of corn syrup and other additives:Some foods contain other sweeteners, but these can also have adverse effects.Some medications can also lead to weight gain.Results of a review and meta-analysis published in The Journal of Clinical Endocrinology and Metabolism in 2015 found that some medicines caused people to gain weight over a period of months.However, some medications may lead to weight loss. Anyone who is starting a new medication and is concerned about their weight should ask their doctor whether the drug is likely to have any effect on weight.The longer a person is overweight, the harder it may be for them to lose weight.Findings of a mouse study, published in the journal Nature Communications in 2015, suggested that the more fat a person carries, the less likely the body is to burn fat, because of a protein, or gene, known as sLR11.It seems that the more fat a person has, the more sLR11 their body will produce. The protein blocks the body's ability to burn fat, making it harder to shed the extra weight.A faulty gene called the fat-mass and obesity-associated gene (FTO) is responsible for some cases of obesity.A study published in 2013 points to a link between this gene and:The hormone ghrelin plays a crucial role in eating behavior. Ghrelin also affects the release of growth hormones and how the body accumulates fat, among other functions.The activity of the FTO gene might impact a person's chances of having obesity because it affects the amounts of ghrelin a person has.In a study involving 250 people with eating disorders, published in Plos One in 2017, researchers suggested that aspects of FTO might also play a role in conditions, such as binge eating and emotional eating.Many factors play a role in the development of obesity. Genetic traits can increase the risk in some people.A healthful diet that contains plenty of fresh food, together with regular exercise, will reduce the risk of obesity in most people.However, those that have a genetic predisposition may find it harder to maintain a healthy weight. Article last reviewed by Fri  2 November 2018.Visit our Obesity / Weight Loss / Fitness category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Obesity / Weight Loss / Fitness.All references are available in the References tab.\t\t\nBird, S. R., & Hawley, J. A. (2017, March 1).  Update on the effects of physical activity on insulin sensitivity in humans. BMJ Open Sport and Exercise Medicine, 2(1). Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5569266/Castellini, G., Franzago, M., Bagnoli, S., Lelli, L., Balsamo, M., Mancini, M. … Stanghellini, G. (2017, March 10).  Fat mass and obesity-associated gene (FTO) is associated to eating disorders susceptibility and moderates the expression of psychopathological traits. Plos One. Retrieved from https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0173560Crescenzo, R., Cigliano, L., Mazzoli, A., Cancelliere, R., Carotenuto, R., Tussellino, M., … Iossa, S. (2018, April 26). Early effects of a low fat, fructose-rich diet on liver metabolism, insulin signaling, and oxidative stress in young and adult rats. Frontiers in Physiology. Retrieved from https://www.frontiersin.org/articles/10.3389/fphys.2018.00411/fullDomecq, J. P., Prutsky, G., Leppin, A., Sonbol, M. B., Altayar, O., Undavalli, C., … Murad, M. H. (2015, February). Drugs commonly associated with weight change: A systematic review and meta-analysis. Journal of Endocrinology and Metabolism, 100(2), 363–370. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5393509/Karra, E., O’Daly, O. G., Choudhury, A. I., Yousseif, A., Millership, S., Neary, M. T., … Batterham, R. L. (2013, July 15). A link between FTO, ghrelin, and impaired brain food-cue responsivity. The Journal of Clinical Investigation. Retrieved from https://www.jci.org/articles/view/44403Pradhan, G., Samson, S. L., & Sun, Y. (2014, June 9). Ghrelin: Much more than a hunger hormone. Current Opinion in Clinical Nutrition and Metabolic Care, 16(6), 619–624. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4049314/Rebollo, A., Roglans, N., Alegret, M., & Laguna, J. C. (2012, December 7). Way back for fructose and liver metabolism: Bench side to molecular insights. World Journal of Gastroenterology, 18(45), 6552–6559. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3516224/School management of students with a lack of sleep. (2012). Education and Health, 30(3), 56–59. Retrieved from http://sheu.org.uk/sites/sheu.org.uk/files/images/eh303sleep.pdfWhittle, A. J., Jiang, M., Peirce, V., Relat, J., Virtue, S., Ebinuma, H., … Bujo, H. (2015, November 20). Soluble LR11/SorLA represses thermogenesis in adipose tissue and correlates with BMI in humans. Nature Communications, 2015, 6, 8951. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4673879/Please use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What is obesity and what causes it?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323551.php>APABrazier, Y. (2018, November 2). \"What is obesity and what causes it?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323551.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323551.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}