{"id": "Natural antibiotic strips bacteria of their defenses", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In the United States, antibiotic resistance causes over 2 million illnesses and 23,000 deaths each year.The World Health Organization (WHO) surveyed half a million people and found that the five most common drug-resistant bacteria are:With the exception of S. pneumoniae, all the above are Gram-negative bacteria. The name comes from Hans Christian Gram, a physician who developed the Gram test. This is a chemical stain test that divides bacteria into Gram-positive and Gram-negative.Finding new ways of destroying Gram-negative bacteria is a major challenge, with some important implications for the growing public health crisis that is antimicrobial resistance.New research may have found a way to penetrate these bacteria's defenses. Scientists at the University of Zurich (UZH) in Switzerland found that thanatin, a naturally occurring antibiotic produced by an insect called the spined soldier bug, can attack the external membranes of Gram-negative bacteria.John A. Robinson, from the Department of Chemistry at UZH, is the corresponding and last author of the new paper, which was recently published in the journal Science Advances. Robinson explains the motivation for the recent study, saying, \"Despite huge efforts from academic researchers and pharmaceutical companies, it has proven very difficult to identify effective new bacterial targets for antibiotic discovery.\"\"One of the major challenges is identifying new mechanisms of antibiotic action against dangerous Gram-negative bacteria.\"As Robinson and colleagues explain in their paper, an asymmetric outer membrane protects Gram-negative bacteria. This double layer is made up of lipopolysaccharide (LPS) molecules on the outside and membrane glycerophospholipids in the inner layer.The researchers used a model of E. coli and in vitro binding studies to test whether the antibiotic thanatin can bind to certain proteins called \"Lpt proteins,\" which create a bridge from the inner membrane to the outer membrane of the double layer that protects Gram-negative bacteria.This bridge is then used to transport LPS molecules to the outer side of the membrane, creating a defensive barrier.Laboratory analyses found that thanatin blocks the interactions between proteins that are required to form the bridge. This means that LPS molecules cannot reach their destination, preventing the entire protective asymmetric outer membrane from forming. Without its defenses, the bacterium succumbs to the antibiotic.\"These results,\" say the authors, \"highlight a new paradigm for an antibiotic action, targeting a dynamic network of protein-protein interactions required for assembly of the Lpt complex in E. coli.\"\"The results also identify one naturally occurring peptide as a starting point for the development of potential clinical candidates that target dangerous Gram-negative bacterial pathogens,\" they add.Robinson comments on the results, saying, \"This finding shows us a way to develop substances that specifically inhibit protein-protein interactions in bacterial cells.\"\"This is an unprecedented mechanism of action for an antibiotic and immediately suggests ways to develop new molecules as antibiotics targeting dangerous pathogens.\"John A. RobinsonYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323720.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}