{"id": "12 natural muscle relaxers", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.There are many possible causes of muscle tightness, pain, and reduced range of motion, including:People who wish to avoid synthetic drugs, such as ibuprofen, may find some natural muscle relaxers beneficial.These include the following foods, supplements, and techniques:Cherries are rich in antioxidants and anti-inflammatory compounds.A 2018 review found that cherries could reduce pain and muscle damage resulting from exercise.However, some of the studies used strong cherry concentrate rather than whole fruits, which is important to bear in mind when evaluating the evidence.Tart cherry juice is available for purchase online.Blueberries are an excellent source of antioxidants and polyphenols, which have anti-inflammatory effects.A small study found that blueberry supplementation may improve exercise performance and decrease inflammatory markers.Reducing inflammation can help the muscles relax and recover after exercise.Adequate protein intake after exercise could help reduce muscle inflammation.A review looking at exercise-induced muscle damage in women found that supplementing with whey and casein, two types of protein, reduced muscle damage.Another small study looked at 16 novice marathon runners. Runners who received a combination of protein and carbohydrate during the race felt less muscle soreness 72 hours after the marathon than those who had consumed carbohydrate only.Various protein powders are available for purchase online.Magnesium is vital for nearly all bodily functions. It is especially important for proper muscle contractions.Foods that are high in magnesium include:People can also take magnesium supplements, although older adults and infants should only take these if a doctor prescribes them. High doses of magnesium may cause stomach cramps and diarrhea.People can buy magnesium supplements in health food stores, drug stores, or online.Turmeric, cinnamon, and ginger all contain curcumin, which has anti-inflammatory properties.Some research has shown that curcumin may decrease inflammatory markers after exercise.Taking a curcumin supplement or incorporating turmeric, cinnamon, or ginger into a healthful diet may help relax the muscles.Women who are breastfeeding or pregnant should avoid consuming too much curcumin.People can purchase curcumin online.Pomegranates contain large amounts of polyphenols. The antioxidant capacity of their juice is potentially three times higher than that of green tea.One study on elite weightlifters found that pomegranate juice may help speed up muscle recovery.Pomegranate juice is available for purchase online.Arnica is a common ingredient in creams and oils for reducing bruising. People should only use arnica topically because ingesting high doses can be life-threatening.While some people use arnica as a muscle relaxer, researchers have yet to prove its effectiveness.Some older studies on marathon runners found that the use of arnica might reduce muscle soreness. However, another study cited in the same review found that it had no effect.Capsaicin occurs naturally in the pith or fleshy part of chili peppers, and it may provide effective pain relief for people with fibromyalgia.Some research has shown that applying capsaicin to the skin could have a positive effect on muscle soreness. Capsaicin cream is available for purchase online.However, capsaicin may be more appropriate as a treatment for nerve pain rather than inflammatory muscle pain. Researchers believe that capsaicin reduces the density of nerve fibers underneath the skin.Some people use CBD oil to help treat chronic pain, including muscle pain.Research suggests that it may work as a muscle relaxer, and some people use it for this purpose.Cannabis plants contain two particular anti-inflammatory agents that act as muscle relaxers:CBD oil is not legal in all areas, and it may react with other medications. As a result, it is best to speak with a doctor before trying it.Peppermint oil is a popular home remedy for muscle pain. The authors of a 2018 review suggest that taking peppermint orally may effectively relieve pain.There is also some evidence to support the topical use of peppermint oil for sprains, as it may provide a cooling effect, pain relief, and muscular relaxation.Peppermint oil is unsuitable for some people, including those with problems affecting the bile duct, liver, or gallbladder.Peppermint oil is available in health food stores and online.Some people use lemongrass oil or tea to treat arthritic joint pain and inflammation.Some evidence suggests that lemongrass may be effective in treating inflammation and nerve pain.Lemongrass oil is available for purchase online.A deep tissue massage from a qualified massage therapist is a great way to relieve tense muscles.The massage should be firm but not painful. If a person is experiencing muscle spasms, they should see a physiotherapist who can help determine the underlying problem.Muscle aches can be uncomfortable, but they are common after exercise, especially if the type of activity is unfamiliar.Anyone who is experiencing sudden, sharp pain or reduced range of motion should see a doctor or physiotherapist.Before trying new methods to relax their muscles, people should discuss the possible side effects with their doctor.We picked linked items based on the quality of products, and list the pros and cons of each to help you determine which will work best for you. We partner with some of the companies that sell these products, which means Healthline UK and our partners may receive a portion of revenues if you make a purchase using a link(s) above. Article last reviewed by Fri 19 October 2018.Visit our Complementary Medicine / Alternative Medicine category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Complementary Medicine / Alternative Medicine.All references are available in the References tab.\t\t\nAmmar, A., Turki, M., Chtourou, H., Hammouda, O., Trabelsi, K., Kallel, C., … Souissi, N. (2016, October 20). Pomegranate supplementation accelerates recovery of muscle damage and soreness and inflammatory markers after a weightlifting training session. PLoS ONE, 11(10). Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5072630/Baron, E. P., Lucas, P., Eades, J., & Hogue, O. (2018, May 24). Patterns of medicinal cannabis use, strain analysis, and substitution effect among patients with migraine, headache, arthritis, and chronic pain in a medicinal cannabis cohort. The Journal of Headache and Pain, 19(1), 37. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5968020/de Cássia da Silveira e Sá., R., Lima, T. C., de Nóbrega, F. R., de Brito, A. E. M., & de Sousa, D. P. (2017, December 9). Analgesic-like activity of essential oil constituents: An update. International Journal of Molecular Sciences, 18(12), 2392. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5751100/Kelley, D. S., Adkins, Y., & Laugero, K. D. (2018, March 17). A review of the health benefits of cherries. Nutrients, 10(3), 368. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5872786/Köhne, J. L., Ormsbee, M. J., & McKune, A. J. (2016, December). Supplementation strategies to reduce muscle damage and improve recovery following exercise in females: A systematic review. Sports, 4(4), 51. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5968901/Magnesium [Fact sheet]. (2018, September 26). Retrieved from https://ods.od.nih.gov/factsheets/Magnesium-HealthProfessional/Meamarbashi, A. (2017, January–February). Herbs and natural supplements in the prevention and treatment of delayed-onset muscle soreness. Avicenna Journal of Phytomedicine, 7(1), 16–26. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5329173/Park, C. H., Kwak, Y. S., Seo, H. K., & Kim, H. Y. (2018, July). Assessing the values of blueberries intake on exercise performance, TAS, and inflammatory factors. Iranian Journal of Public Health, 47(Suppl. 1), 27–32. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6124147/Peppin, J. F., Albrecht, P. J., Argoff, C., Gustorff, B., Pappagallo, M., Rice, F. L., & Wallace, M. S. (2015, June). Skin matters: A review of topical treatments for chronic pain. Part two: Treatments and applications. Pain and Therapy, 4(1), 33–50. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4470969/Perry, R., Leach, V., Davies, P., Penfold, C., Ness, A., & Churchill, R. (2017, May 15). An overview of systematic reviews of complementary and alternative therapies for fibromyalgia using both AMSTAR and ROBIS as quality assessment tools. Systematic Reviews, 6, 97. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5433031/Salmalian, H., Saghebi, R., Moghadamnia, A. A., Bijani, A., Faramarzi, M., Amiri, F. N., … Bekhradi, R. (2014, Spring). Comparative effect of thymus vulgaris and ibuprofen on primary dysmenorrhea: A triple-blind clinical study. Caspian Journal of Internal Medicine, 5(2), 82–88. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3992233/Saunders, M. J., Luden, N. D., DeWitt, C. R., Gross, M. C., & Rios, A. D. (2018, March 10). Protein supplementation during or following a marathon run influences post-exercise recovery. Nutrients, 10(3), 333. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5872751/Sellami, M., Slimeni, O., Pokrywka, A., Kuvačić, G., Hayes, L. D., Milic, M., & Padulo, J. (2018, March 15). Herbal medicine for sports: A review. Journal of the International Society of Sports Nutrition, 15, 14. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5856322/Uritu, C. M., Mihai, C. T., Stanciu, G.-D., Dodi, G., Alexa-Stratulat, T., Luca, A., … Tamba, B. I. (2018, May 8). Medicinal plants of the family Lamiaceae in pain therapy: A review. 2018. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5964621/Please use one of the following formats to cite this article in your essay, paper or report:MLACrichton-Stuart, Cathleen. \"12 natural muscle relaxers.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323393.php>APACrichton-Stuart, C. (2018, October 19). \"12 natural muscle relaxers.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323393.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323393.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}