{"id": "How and why our bodies starve gut bacteria", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.According to recent research, our bodies may house more bacteria than we may have imagined.In fact, at least half of the cells in the body are microbial, and a significant number of these populate our guts.We have a symbiotic relationship with our bacteria. These microorganisms have a strong influence on the state of our overall health — both physical and mental.However, the bacteria also depend on our bodies in order to feed, live, and grow, and it turns out that our bodies are rather adept at keeping these microorganisms in check.How does this happen? By controlling how many nutrients the microbes are able to able to access. This is what a new study conducted by scientists from the Duke University School of Medicine in Durham, NC, has found.\"There appears to be a natural pecking order to the bacteria and us. In a way it's not surprising that we, the host, should hold more of the cards,\" says study co-author Lawrence A. David, Ph.D.This contradicts previous ideas about the human gut microbiome, which view it as an environment \"where there's abundant food and resources flooding in, like Willy Wonka's Chocolate Factory,\" as David puts it.David and colleagues report their findings in the study paper that appears in the journal Nature Microbiology.The premise for this study originated with Aspen Reese, who is now based at Harvard University in Cambridge, MA, while she was enrolled as a Ph.D. candidate at Duke University.Thanks to her background in ecology, Reece thought of gut bacteria in the context of the natural competition for resources. In virtually all ecosystems, she considered, the inhabitants tend to compete over the limited resources.So, she wondered whether it may be the same for the microbial gut inhabitants. Bacteria in bodies of water, she further reasoned, are restricted by limited access to nutrients such as nitrogen or phosphorus. Could nitrogen be available in limited amounts in the gut, too?To find the answer to this question, Reese and colleagues studied stool samples that they collected from numerous animals and humans. They studied the feces of zebras, giraffes, elephants, sheep, and horses, to name but a few. The human stool samples came from volunteers based in North Carolina.The results of Reese and colleagues' analysis revealed that bacteria are kept on a short leash in the human gut: they have access to around 1 nitrogen atom per every 10 carbon atoms. This is much less than what free-living microbes get: 1 nitrogen atom to every 4 carbon atoms, on average.In order to confirm that limited nitrogen levels in the environment did, in fact, control the bacteria's \"freedom,\" the researchers conducted an experiment in mice. They fed the mice food high in proteins, as these have high levels of nitrogen.The more protein the researchers gave the mice, the more the number of gut bacteria increased. Moreover, when Reese injected the animals with nitrogen, she noticed that part of the nitrogen reached the gut bacteria.This, she explains, suggests that a host mammal is able to secrete nitrogen via the cells lining its gut in order to feed the bacteria.\"Our findings,\" says David, \"support the idea that we've evolved a way to keep our bacteria on a leash by leaving them starving for nitrogen.\"David explains that this \"also explains why the Western diet might be bad for us. When people eat too much protein, it swamps the host's ability to take up that nitrogen in the small intestine, and more of it ends up making its way to the large intestine, eliminating our ability to control our microbial communities.\"\"It might be easier,\" says Reese, \"to imagine that the gut is less 'red in tooth and claw' than other parts of nature, because the microbiota can be so beneficial to humans,\" commenting on the previous idea suggesting that the gut is a haven for bacteria.\"But the bacteria are individual organisms, just trying to get by — and there is only so much food to go around,\" she notes.The scientists, however, also delved into the dangers of trying to control bacteria by fighting them with antibiotics. To do so, they again conducted an experiment in mice, the results of which they published in the journal eLife earlier this year.As part of that study, the scientists administered antibiotics to 10 mice over a period of 5 days, and they collected stool samples — which they analyzed — on a daily basis from the animals.This experiment demonstrated that, in the absence of bacteria to \"eat\" them, substances such as nitrate or sulfate overaccumulated in the gut.When they stopped feeding the mice antibiotics, their guts re-established the microbial balance; although, Reese explains, \"We don't really have a sense of what the 'right' number of bacteria to have in the gut is.\"\"Certainly zero is too few, and being full of only bacteria would be too many,\" she goes on. Also, while mice may be able to recover fairly easily even after an aggressive exposure to bacteria-wiping drugs, it is not the same for humans, David explains.That is because, in part, the rodents reacquire certain bacteria by eating each other's feces. David notes, \"People probably won't want to do that.\"When a person's microbiome is destabilized, this can actually allow pathogens to take hold more easily, the researchers caution.\"Normally, pathogens are going to have a hard time colonizing the gut. There are trillions of other bacteria they have to beat out to survive. But if we suddenly take away the microbial competition for resources, we lose control, and the bad bacteria that cause nasty illnesses [...] have a clearer path.\"Lawrence A David, Ph.D.There may be a way to help maintain the delicate bacterial balance, the authors note. Currently, the team is looking into how diet — particularly the presence of prebiotics and probiotics — can contribute to gut health.\"Over evolutionary history, our bodies had a chance to figure this all out, and build systems to keep the microbiota in check,\" says Reese.\"But as researchers living in the modern era, I think we are still trying to get a handle on what the right in-between value is, and how to keep us there,\" she adds.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323509.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}