{"id": "What are the signs and symptoms of psoriasis?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.However, other types can cause different lesions, and symptoms do not affect only the skin.For most people, symptoms are cyclical. They appear for a few weeks during a flare and then ease or disappear for a while.There are many different types of psoriasis, including plaque psoriasis, nail, scalp, guttate, inverse, erythrodermic, and pustular psoriasis. Psoriasis can also lead to a number of complications.Read on to find out more about how to recognize some of the types of psoriasis.A person with plaque psoriasis is likely to experience the following:Inverse psoriasis tends to appear in skin folds, and it is more common among people who have excess weight.Nail psoriasis affects the finger and toenails. It may happen with plaque or another type of psoriasis.If symptoms are severe, it can become hard to use the hands and feet, according to the American Academy of Dermatology.Here are some of the features.People with psoriatic arthritis can experience nail changes if the arthritis affects their fingers.The changes can look like the signs of a fungal infection. Sometimes there is a fungal infection, known as onychomycosis, but this is not always the case. Sometimes a bacterial infection can result in the skin folds around the nail.This is sometimes known as teardrop psoriasis or raindrop psoriasis. Lesions appear on the skin, but they look different from those in plaque psoriasis.Guttate psoriasis usually occurs after a strep throat infection, and it is more common among teenagers and children. It may disappear and not come back, but some people eventually develop plaque psoriasis.Scalp psoriasis can occur alone or together with plaque psoriasis.This is less common than the other kinds of psoriasis.There are three main types, and they affect different areas of the body. In pustular psoriasis, the lesions contain pus, which is made up of white blood cells.This type affects the hands and feet. It may happen alone or alongside another type of psoriasis.The following can happen:This is the least common form of psoriasis, but it can be life-threatening if the person does not receive treatment.Other symptoms include:If a person develops a red, fiery rash across the skin, it is important to seek urgent medical treatment. The complications of erythrodermic psoriasis can be serious.Some people with psoriasis also develop a type of arthritis, known as psoriatic arthritis (PsA).Most people develop psoriasis first, but sometimes the arthritis develops before the skin lesions appear.The symptoms of PsA include:PsA can affect the eyes:Iritis, or inflammation of the iris, can occur. The eye becomes red, and there may be sensitivity to light.Uveitis is an inflammation of the uvea, which includes the iris and other parts of the eye. Symptoms include redness of the eye, blurred vision, unusual sensitivity to light, and eye pain.Apart from the joints, PsA can sometimes affect the spine. Also known as spondylitis, this involves:Symptoms may include pain and stiffness in the lower back, upper buttock area, neck, and the rest of the spine.Symptoms are usually worse on waking up or after long periods of inactivity.\nPsoriasis is a condition that probably affects between 2 and 2.6 percent of people in the United States. It is not a contagious disease, but it can be uncomfortable. It can also lead to depression, anxiety, stress, and a reduced quality of life.As it is a systemic condition, a number of complications can also develop.However, treatment can relieve symptoms and reduce the chance of a flare.Anyone who experiences unusual skin, nail, or joint changes should see a doctor, who will be able to prescribe medication and offer advice. Article last reviewed by Fri  9 November 2018.Visit our Psoriasis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Psoriasis.All references are available in the References tab.\t\t\nErythrodermic psoriasis. (n.d.). Retrieved from https://www.psoriasis.org/about-psoriasis/types/erythrodermicMicelli, A. & Schmieder, G. (2017, October 16). Palmoplantar psoriasis. StatPearls [internet]. Retrieved from https://www.ncbi.nlm.nih.gov/books/NBK448142/ Psoriasis. (2018, June 30). Retrieved from https://report.nih.gov/nihfactsheets/ViewFactSheet.aspx?csid=61Psoriatic arthritis. (n.d.). Retrieved from https://www.aad.org/public/diseases/painful-skin-joints/psoriatic-arthritis#symptomsPsoriasis: Signs and symptoms. (n.d.). Retrieved from https://www.aad.org/public/diseases/scaly-skin/psoriasis/psoriasis-signs-and-symptoms/psoriasis-signs-and-symptomsWhat is nail psoriasis and how can I treat it? (n.d.). Retrieved from https://www.aad.org/public/diseases/scaly-skin/psoriasis/diagnosis-and-treatment-of-psoriasis/what-is-nail-psoriasis-and-how-can-i-treat-itPlease use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What are the signs and symptoms of psoriasis?.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323638.php>APABrazier, Y. (2018, November 16). \"What are the signs and symptoms of psoriasis?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323638.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323638.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}