{"id": "What causes lightheadedness?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Experiencing some episodes of lightheadedness is normal. In most cases, these episodes will pass quickly, especially if a person sits or lies down to rest.In this article, learn about the common causes of lightheadedness. We also cover possible underlying medical conditions and treatment options.The most common cause of lightheadedness is orthostatic hypotension, which is a sudden drop in blood pressure when a person stands up.Positional changes, especially quick ones, divert blood flow temporarily from the brain to the body. It is more likely that this will result in lightheadedness when a person is dehydrated or ill.The feeling usually passes quickly, especially if a person sits down again.Other common causes of lightheadedness include:Sometimes, lightheadedness may have a more severe underlying cause, such as:If lightheadedness is due to a more serious underlying condition, a person will usually experience additional symptoms.Most of the time, a person experiencing an episode of lightheadedness can manage their symptoms with home remedies and lifestyle changes.A person who is prone to experiencing dizziness or lightheadedness should use the following tips to reduce their risk of falling or fainting:Anyone who thinks that their medication may be causing lightheadedness should speak to a doctor.While lightheadedness does not usually require medical care, a doctor may sometimes recommend one of the following treatments, depending on the underlying cause:Medications could include:If a doctor recommends physical therapy for lightheadedness, a physical therapist is likely to teach a person exercises to improve their balance.In people who have lightheadedness due to anxiety, a doctor may recommend psychotherapy or cognitive behavioral therapy (CBT) to help them manage this condition. A therapist may provide other coping mechanisms to reduce a person's stress levels.In very rare cases, a doctor may advise surgery for repeated episodes of lightheadedness and vertigo. A surgeon will perform a labyrinthectomy, which is the removal of part or all of the inner ear.Most people do not need to seek medical attention for an occasional episode of lightheadedness.However, it is essential to seek emergency medical attention for lightheadedness or dizziness when one or more of the following symptoms accompany it:A person should also see a doctor immediately if lightheadedness occurs following a head injury.Lightheadedness is a common experience, and it usually resolves very quickly with no lasting effects. People who frequently experience lightheadedness can usually manage the symptoms at home.In some cases, lightheadedness may occur as a result of an underlying medical cause, in which case a person is likely to experience additional symptoms.Anyone who has concerns about lightheadedness should speak to a doctor. Article last reviewed by Fri 16 November 2018.Visit our Cardiovascular / Cardiology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Cardiovascular / Cardiology.All references are available in the References tab.\t\t\nAlarcón, A. V., Hidalgo, L. O. V., Arévalo, R. J., & Diaz, M. P. (2017, April). Labyrinthectomy and vestibular neurectomy for intractable vertiginous symptoms. International Archives of Otorhinolaryngology, 21(2), 184–190. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5375706/Dizziness: Lightheadedness and vertigo. (2017, November 20). Retrieved from https://www.uofmhealth.org/health-library/dizziFarrell, L. (n.d.). Vestibular rehabilitation therapy (VRT). Retrieved from https://vestibular.org/understanding-vestibular-disorder/treatment/treatment-detail-pageLanier, J. B., Mote, M. B., & Clay, E. C. (2011, September 1). Evaluation and management of orthostatic hypotension. American Family Physician, 84(5), 527–536. Retrieved from https://www.aafp.org/afp/2011/0901/p527.htmlOrthostatic hypotension information page. (2018, June 20). Retrieved from https://www.ninds.nih.gov/Disorders/All-Disorders/Orthostatic-Hypotension-Information-PagePlease use one of the following formats to cite this article in your essay, paper or report:MLAFletcher, Jenna. \"What causes lightheadedness?.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323717.php>APAFletcher, J. (2018, November 16). \"What causes lightheadedness?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323717.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323717.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}