{"id": "Nux vomica: Uses and risks", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.This natural remedy uses the seeds of the tree as its main ingredient. However, the seeds contain both strychnine and brucine, which are both toxic in large doses.People use nux vomica for a variety of issues. In this article, learn about the possible benefits and risks of nux vomica.Few large-scale studies exist on the possible benefits of nux vomica.Of the research that is available, it is essential to note that the studies may focus on one specific part of the plant, such as the flower, seed, or leaf.Therefore, the results may not be the same for all parts of the plant.Possible benefits of nux vomica include:A Chinese study noted that there are many different compounds in nux vomica that make it a potent antioxidant.This research may show that nux vomica could have some potential benefits. However, the same study also confirms that the two major active compounds, brucine and strychnine, are poisonous at high doses.A 2015 study found that the extract from nux vomica leaves has a promising analgesic, or pain-relieving, effect. The researchers said this could be due to the antioxidants in the plant.However, the homeopathic treatment comes from the seeds, not the leaves.Other researchers studied the effects of removing much of the strychnine from the seed. Their research found that removing this compound improved the analgesic and anti-inflammatory effects of nux vomica.The researchers said that this was probably due to the presence of brucine. Brucine reduced swelling and markers of pain in an animal model. More research is needed to determine if it has the same effect in humans.A 2012 study tried to determine if nux vomica could help treat diabetes. Using an animal model for their test, researchers found that an extract from the seeds was better at controlling blood sugar than the control substance.Research in 2015 tested a variety of plants for their potential effect on the influenza, or flu, virus. An extract from the stem bark of the nux vomica plant showed the highest potential to fight against the flu.Some practitioners of homeopathic medicine claim that nux vomica can help treat a range of conditions, including:However, there is little evidence to back up these claims. Additionally, the United States Centers for Disease Control and Protection (CDC) list nux vomica under the chemical hazard strychnine, which is a pesticide and poison.Current research into the use of nux vomica is limited and inconclusive.Some research finds beneficial compounds in some parts of the plants, but these results may not apply to the seeds or extracts that are available on the market.While certain parts of the plant may show promise, the current evidence suggests it may be too soon to recommend nux vomica to treat any health condition.Side effects of nox vomica can be severe. The compound may harm the central nervous system, leading to symptoms, such as:People may be more likely to experience side effects after taking higher doses or when taking nux vomica over a more extended period.Women who are pregnant or breastfeeding should not use nux vomica because researchers do not know the possible effects it may have on the developing fetus or baby.People with liver problems should also avoid nux vomica as it may cause liver damage.Anyone who is considering using nux vomica should contact their doctor before doing so.While some people recommend nux vomica to help treat certain health conditions, there is no direct evidence about the safety or effectiveness of this compound.For most people, however, the toxicity and possibility of harmful side effects or complications from taking nux vomica outweigh the potential benefits.Always speak to a doctor before taking new supplements or natural remedies. Article last reviewed by Wed 24 October 2018.Visit our Complementary Medicine / Alternative Medicine category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Complementary Medicine / Alternative Medicine.All references are available in the References tab.\t\t\nBhati, R., Singh, A., Saharan, V. A., Ram, V., & Bhandari, A. (2012, April–June). Strychnos nux-vomica seeds: Pharmacognostical standardization, extraction, and antidiabetic activity. Journal of Ayurveda and Integrative Medicine, 3(2), 80–84.Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3371563/Chen, J., Wang, X., Qu, Y., Chen, Z., Cai, H., Liu, X., ... Cai, B. (2012, January 6). Analgesic and anti-inflammatory activity and pharmacokinetics of alkaloids from seeds of Strychnos nux-vomica after transdermal administration: Effect of changes in alkaloid composition [Abstract]. Journal of Ethnopharmacology, 139(1), 181–188. Retrieved from https://www.sciencedirect.com/science/article/pii/S0378874111007914Eldahshan, O. A., & Abdel-Daim, M. M. (2015, October). Phytochemical study, cytotoxic, analgesic, antipyretic and anti-inflammatory activities of Strychnos nux-vomica. Cytotechnology, 67(5), 831–844. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4545432/Enkhtaivan, G., John, K. M. M., Ayyanar, M., Sekar, T., Jin, K.-J., & Kim, D. H. (2015, September). Anti-influenza (H1N1) potential of leaf and stem bark extracts of selected medicinal plants of South India. Saudi Journal of Biological Sciences, 22(5), 532–538.Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4537874/Kandhavelu, M., & Senthilkumar, P. K. (2015, October 20). Research article to analysis the antioxidant potential of Strychnos nux-vomica. International Journal of Current Research, 7(10), 21046–21048. Retrieved from http://www.journalcra.com/sites/default/files/10919.pdfPatel, K., Laloo, D., Singh, G. K., Gadewar, M., & Patel, D. K. (2017, January 24). A review on medicinal uses, analytical techniques and pharmacological activities of Strychnos nux-vomica Linn.: A concise report [Abstract]. Chinese Journal of Integrative Medicine, 1–13. Retrieved from https://link.springer.com/article/10.1007%2Fs11655-016-2514-1Strychnine. (2016, April 11). Retrieved from https://www.cdc.gov/niosh/npg/npgd0570.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLAJohnson, Jon. \"Nux vomica: Uses and risks.\" Medical News Today. MediLexicon, Intl., 24 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323447.php>APAJohnson, J. (2018, October 24). \"Nux vomica: Uses and risks.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323447.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323447.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}