{"id": "Can people with COPD get better?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.According to the Centers for Disease Control and Prevention (CDC), chronic obstructive pulmonary disease (COPD) affects around 16 million people in the United States. It is possible that many people who experience COPD symptoms mistake them for a normal sign of aging.The disease can progress for years without shortness of breath or the person being aware of the condition.Symptoms of COPD may include:Doctors tend to use a spirometric test for diagnosis. It is a simple, noninvasive breathing test to examine lung function.Though they cannot cure the COPD, lifestyle choices can slow progress and reduce symptoms. This article takes a look at some choices that can help with COPD, along with how best to slow the progress of the disease.Although there is currently no cure for COPD, there are many ways that a person can reduce their symptoms and slow disease progression. They include:The main causes and risk factors for COPD include:Smoking causes 85–90 percent of COPD cases. The best thing that a person who smokes and has COPD can do is stop smoking cigarettes altogether.Quitting smoking cannot completely reverse COPD, but it can help slow the progression of the disease and may improve the body's response to treatment.As well as preventing any further damage to the lungs, quitting smoking can improve the immune system.Also, those with COPD will benefit from avoiding any environmental factors that may irritate their lungs, including secondhand smoke, air pollution, and dust.A person with COPD should also try to manage any allergies that may contribute to their breathing difficulties.Exercise cannot cure or reverse COPD, but it may improve some of the symptoms.One of the symptoms of COPD is shortness of breath. This symptom can make exercise and everyday physical tasks difficult. A lack of exercise may also weaken the muscles and make a person's heart and lungs even less tolerant to physical activity. As a result, exercise is important to keep the muscles strong.Pulmonary rehabilitation programs can be useful in improving a person's ability to tolerate exercise. People who have COPD should start slow and gradually increase their exercise with the guidance of a doctor.It is important that a person's exercise routine includes:According to the CDC, the benefits of exercise include:Getting regular exercise and following a healthful diet can also boost the immune system and improve COPD symptoms, as well as general health.In particular, a person should limit their intake of simple carbohydrates, instead opting for complex carbohydrates, and consume 20–30 grams of fiber per day.COPD is a chronic and progressive disease. While it is possible to slow progress and reduce symptoms, it is impossible to cure the disease, and it will gradually worsen over time. Early diagnosis is key to finding the right treatment and slowing the disease before it starts to progress.Making lifestyle changes such as quitting smoking and avoiding environmental pollutants can help slow progress and reduce symptoms.COPD is a chronic and progressive disease that can make it difficult for people to breathe. The condition currently has no cure, but people can take steps to reduce its impact.If symptoms get worse, it is important to talk to a doctor to evaluate the current treatment plan and make adjustments accordingly. Article last reviewed by Thu 15 November 2018.Visit our COPD category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on COPD.All references are available in the References tab.\t\t\nBenefits of quitting. (n.d.). Retrieved from https://smokefree.gov/quit-smoking/why-you-should-quit/benefits-of-quittingChronic obstructive pulmonary disease (COPD). (n.d.). Retrieved from https://acaai.org/asthma/chronic-obstructive-pulmonary-disease-copdCOPD and seasonal allergies. (n.d.). Retrieved from https://lunginstitute.com/lung-diseases/copd/copd-and-seasonal-allergies/Nutrition and COPD. (2018, March 13). Retrieved from https://www.lung.org/lung-health-and-diseases/lung-disease-lookup/copd/living-with-copd/nutrition.htmlPhysical activity. (2009, October 15). Retrived from https://www.cdc.gov/healthyplaces/healthtopics/physactivity.htmPhysical activity and COPD. (2018, March 13). Retrieved from https://www.lung.org/lung-health-and-diseases/lung-disease-lookup/copd/living-with-copd/physical-activity.htmlPreventing COPD. (2018, March 13). Retrieved from https://www.lung.org/lung-health-and-diseases/lung-disease-lookup/copd/symptoms-causes-risk-factors/preventing-copd.htmlWhat causes COPD (2018, March 13). Retrieved from http://www.lung.org/lung-health-and-diseases/lung-disease-lookup/copd/symptoms-causes-risk-factors/what-causes-copd.htmlWhat is COPD? (2018, June 6). Retrieved from https://www.cdc.gov/copd/index.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLAGal, Kat. \"Can people with COPD get better?.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323714.php>APAGal, K. (2018, November 16). \"Can people with COPD get better?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323714.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323714.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}