{"id": "What are stem cells, and what do they do?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Stem cells are undifferentiated cells that can turn into specific cells, as the body needs them.Scientists and doctors are interested in stem cells as they help to explain how some functions of the body work, and how they sometimes go wrong.Stem cells also show promise for treating some diseases that currently have no cure.Stem cells originate from two main sources: adult body tissues and embryos. Scientists are also working on ways to develop stem cells from other cells, using genetic \"reprogramming\" techniques.A person's body contains stem cells throughout their life. The body can use these stem cells whenever it needs them.Also called tissue-specific or somatic stem cells, adult stem cells exist throughout the body from the time an embryo develops.The cells are in a non-specific state, but they are more specialized than embryonic stem cells. They remain in this state until the body needs them for a specific purpose, say, as skin or muscle cells.Day-to-day living means the body is constantly renewing its tissues. In some parts of the body, such as the gut and bone marrow, stem cells regularly divide to produce new body tissues for maintenance and repair.Stem cells are present inside different types of tissue. Scientists have found stem cells in tissues, including:However, stem cells can be difficult to find. They can stay non-dividing and non-specific for years until the body summons them to repair or grow new tissue.Adult stem cells can divide or self-renew indefinitely. This means they can generate various cell types from the originating organ or even regenerate the original organ, entirely.This division and regeneration are how a skin wound heals, or how an organ such as the liver, for example, can repair itself after damage.In the past, scientists believed adult stem cells could only differentiate based on their tissue of origin. However, some evidence now suggests that they can differentiate to become other cell types, as well.From the very earliest stage of pregnancy, after the sperm fertilizes the egg, an embryo forms.Around 3–5 days after a sperm fertilizes an egg, the embryo takes the form of a blastocyst or ball of cells.The blastocyst contains stem cells and will later implant in the womb. Embryonic stem cells come from a blastocyst that is 4–5 days old.When scientists take stem cells from embryos, these are usually extra embryos that result from in vitro fertilization (IVF).In IVF clinics, the doctors fertilize several eggs in a test tube, to ensure that at least one survives. They will then implant a limited number of eggs to start a pregnancy.When a sperm fertilizes an egg, these cells combine to form a single cell called a zygote.This single-celled zygote then starts to divide, forming 2, 4, 8, 16 cells, and so on. Now it is an embryo.Soon, and before the embryo implants in the uterus, this mass of around 150–200 cells is the blastocyst. The blastocyst consists of two parts:The inner cell mass is where embryonic stem cells are found. Scientists call these totipotent cells. The term totipotent refer to the fact that they have total potential to develop into any cell in the body.With the right stimulation, the cells can become blood cells, skin cells, and all the other cell types that a body needs.In early pregnancy, the blastocyst stage continues for about 5 days before the embryo implants in the uterus, or womb. At this stage, stem cells begin to differentiate.Embryonic stem cells can differentiate into more cell types than adult stem cells.MSCs come from the connective tissue or stroma that surrounds the body's organs and other tissues.Scientists have used MSCs to create new body tissues, such as bone, cartilage, and fat cells. They may one day play a role in solving a wide range of health problems.Scientists create these in a lab, using skin cells and other tissue-specific cells. These cells behave in a similar way to embryonic stem cells, so they could be useful for developing a range of therapies.However, more research and development is necessary.To grow stem cells, scientists first extract samples from adult tissue or an embryo. They then place these cells in a controlled culture where they will divide and reproduce but not specialize further.Stem cells that are dividing and reproducing in a controlled culture are called a stem-cell line.Researchers manage and share stem-cell lines for different purposes. They can stimulate the stem cells to specialize in a particular way. This process is known as directed differentiation.Until now, it has been easier to grow large numbers of embryonic stem cells than adult stem cells. However, scientists are making progress with both cell types.Researchers categorize stem cells, according to their potential to differentiate into other types of cells.Embryonic stem cells are the most potent, as their job is to become every type of cell in the body.The full classification includes:Totipotent: These stem cells can differentiate into all possible cell types. The first few cells that appear as the zygote starts to divide are totipotent.Pluripotent: These cells can turn into almost any cell. Cells from the early embryo are pluripotent.Multipotent: These cells can differentiate into a closely related family of cells. Adult hematopoietic stem cells, for example, can become red and white blood cells or platelets.Oligopotent: These can differentiate into a few different cell types. Adult lymphoid or myeloid stem cells can do this.Unipotent: These can only produce cells of one kind, which is their own type. However, they are still stem cells because they can renew themselves. Examples include adult muscle stem cells.Embryonic stem cells are considered pluripotent instead of totipotent because they cannot become part of the extra-embryonic membranes or the placenta.Stem cells themselves do not serve any single purpose but are important for several reasons.First, with the right stimulation, many stem cells can take on the role of any type of cell, and they can regenerate damaged tissue, under the right conditions.This potential could save lives or repair wounds and tissue damage in people after an illness or injury. Scientists see many possible uses for stem cells.Tissue regeneration is probably the most important use of stem cells.Until now, a person who needed a new kidney, for example, had to wait for a donor and then undergo a transplant.There is a shortage of donor organs but, by instructing stem cells to differentiate in a certain way, scientists could use them to grow a specific tissue type or organ.As an example, doctors have already used stem cells from just beneath the skin's surface to make new skin tissue. They can then repair a severe burn or another injury by grafting this tissue onto the damaged skin, and new skin will grow back.In 2013, a team of researchers from Massachusetts General Hospital reported in PNAS Early Edition that they had created blood vessels in laboratory mice, using human stem cells.Within 2 weeks of implanting the stem cells, networks of blood-perfused vessels had formed. The quality of these new blood vessels was as good as the nearby natural ones.The authors hoped that this type of technique could eventually help to treat people with cardiovascular and vascular diseases.Doctors may one day be able to use replacement cells and tissues to treat brain diseases, such as Parkinson's and Alzheimer's.In Parkinson's, for example, damage to brain cells leads to uncontrolled muscle movements. Scientists could use stem cells to replenish the damaged brain tissue. This could bring back the specialized brain cells that stop the uncontrolled muscle movements.Researchers have already tried differentiating embryonic stem cells into these types of cells, so treatments are promising.Scientists hope one day to be able to develop healthy heart cells in a laboratory that they can transplant into people with heart disease.These new cells could repair heart damage by repopulating the heart with healthy tissue.Similarly, people with type I diabetes could receive pancreatic cells to replace the insulin-producing cells that their own immune systems have lost or destroyed.The only current therapy is a pancreatic transplant, and very few pancreases are available for transplant.Doctors now routinely use adult hematopoietic stem cells to treat diseases, such as leukemia, sickle cell anemia, and other immunodeficiency problems.Hematopoietic stem cells occur in blood and bone marrow and can produce all blood cell types, including red blood cells that carry oxygen and white blood cells that fight disease.\n\nPeople can donate stem cells to help a loved one, or possibly for their own use in the future.Donations can come from the following sources:Bone marrow: These cells are taken under a general anesthetic, usually from the hip or pelvic bone. Technicians then isolate the stem cells from the bone marrow for storage or donation.Peripheral stem cells: A person receives several injections that cause their bone marrow to release stem cells into the blood. Next, blood is removed from the body, a machine separates out the stem cells, and doctors return the blood to the body.Umbilical cord blood: Stem cells can be harvested from the umbilical cord after delivery, with no harm to the baby. Some people donate the cord blood, and others store it.This harvesting of stem cells can be expensive, but the advantages for future needs include:\nStem cells are useful not only as potential therapies but also for research purposes.For example, scientists have found that switching a particular gene on or off can cause it to differentiate. Knowing this is helping them to investigate which genes and mutations cause which effects.Armed with this knowledge, they may be able to discover what causes a wide range of illnesses and conditions, some of which do not yet have a cure.Abnormal cell division and differentiation are responsible for conditions that include cancer and congenital disabilities that stem from birth. Knowing what causes the cells to divide in the wrong way could lead to a cure.Stem cells can also help in the development of new drugs. Instead of testing drugs on human volunteers, scientists can assess how a drug affects normal, healthy tissue by testing it on tissue grown from stem cells.Watch the video to find out more about stem cells.There has been some controversy about stem cell research. This mainly relates to work on embryonic stem cells.The argument against using embryonic stem cells is that it destroys a human blastocyst, and the fertilized egg cannot develop into a person.Nowadays, researchers are looking for ways to create or use stem cells that do not involve embryos.Stem cell research often involves inserting human cells into animals, such as mice or rats. Some people argue that this could create an organism that is part human.In some countries, it is illegal to produce embryonic stem cell lines. In the United States, scientists can create or work with embryonic stem cell lines, but it is illegal to use federal funds to research stem cell lines that were created after August 2001.Some people are already offering \"stem-cells therapies\" for a range of purposes, such as anti-aging treatments.However, most of these uses do not have approval from the U.S. Food and Drug Administration (FDA). Some of them may be illegal, and some can be dangerous.Anyone who is considering stem-cell treatment should check with the provider or with the FDA that the product has approval, and that it was made in a way that meets with FDA standards for safety and effectiveness. Article last reviewed by Mon 15 October 2018.Visit our Stem Cell Research category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Stem Cell Research.All references are available in the References tab.\t\t\nFDA warns about stem cell therapies. (2017, November 16). Retrieved from https://www.fda.gov/ForConsumers/ConsumerUpdates/ucm286155.htmKusuma, S., Shen, Y.- I., Hanjaya-Putra, D., Mali, P., Cheng, L., & Gerecht, S. (2013, July 15). Self-organized vascular networks from human pluripotent stem cells in a synthetic matrix. PNAS. Retrieved from http://www.pnas.org/content/pnas/early/2013/07/10/1306562110.full.pdfStem cell basics I. (2016). Retrieved from https://stemcells.nih.gov/info/basics/1.htmStem cell basics V. (2016). Retrieved from https://stemcells.nih.gov/info/basics/5.htmStem cells basics VII. (2016). Retrieved from https://stemcells.nih.gov/info/basics/7.htmStem cells. (March 29, 2016). Retrieved from https://medlineplus.gov/stemcells.htmlTypes of stem cells. (n.d.). Retrieved from http://www.closerlookatstemcells.org/learn-about-stem-cells/types-of-stem-cellsWhat’s it like to donate stem cells? (2016, May 11). Retrieved from https://www.cancer.org/treatment/treatments-and-side-effects/treatment-types/stem-cell-transplant/donors.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What are stem cells, and what do they do?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323343.php>APABrazier, Y. (2018, October 19). \"What are stem cells, and what do they do?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323343.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323343.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}