{"id": "Which muscles do pushups work?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In this article, we look at which muscles pushups work and some of the benefits of doing pushups. We also provide a guide to eight different types of pushup.The muscles in the upper body do most of the work when a person does pushups. These muscles are:However, pushups require many other muscles in the body to work to keep the body in a rigid plank position. These muscles may include:There are many benefits to regularly doing pushups, including:Doing pushups can be a powerful full-body workout. They use up a large amount of energy in a short period because the movements require large muscle groups to lift and hold much of the body's weight.The more pushups a person does, the more calories they burn.Doing pushups uses large muscle groups to alternately lift and lower much of the body's weight, which increases the heart rate. Raising the heart rate during exercise helps strengthen the heart muscle, enabling it to pump more oxygenated blood to the lungs and throughout the body.Tiny blood vessels called capillaries, which supply blood from arteries to tissues and organs, also widen to allow for better blood flow.Doing exercise that raises the heart rate can help:When people use the correct technique, pushups can help build up strength in the muscles around the shoulder joint. The muscles and tendons in the shoulder hold the upper arm bone in the socket.When the muscles are weak, stress or injury to the shoulder can result in damage to the muscles and tendons.Pushups are a simple exercise that requires very little or even no equipment, so a person can easily do them as part of an at-home workout. There are also many pushups variations to suit people of different strengths and abilities.Below is a guide to eight different types of pushup. The exercises are in order of difficulty from the easiest to the most challenging.Wall pushups are suitable for beginners or anyone with a shoulder injury. This type of pushup helps build shoulder and chest strength but places a reduced load on the muscles.Muscles worked: arms, shoulders, and chest.Try to do 3 sets of 12 repetitions, reaching a total of 36 pushups. Take a short break between sets.The modified pushup is for people who want a more challenging exercise than the wall pushup but are not quite ready for a standard pushup. When doing this pushup, focus on tightening all the muscles to maintain a stiff, straight body.Muscles worked: arms, shoulders, chest, and serratus anterior.Repeat the exercise 12 times and then do an additional 2 sets, with short breaks between them. This will make a total of 36 pushups.The standard pushup requires more work than the modified pushup because it does not involve using the knees to help support the body weight.Muscles worked: arms, shoulders, chest, and serratus anterior.Try to do 3 sets of 12 pushups.The wide pushup is only slightly different to the standard pushup. It involves widening the distance between the hands, which places more focus on the chest muscles.Muscles worked: chest, shoulders, and back muscles.Try to do a total of 36 pushups, dividing them into 3 sets with short breaks between.The narrow pushup is another variation of the standard pushup, but it is usually more difficult. It reduces the distance between the hands, which means that the arm muscles have to work harder.Muscles worked: triceps and chest muscles.Do 3 sets of 12 repetitions to reach a total of 36 pushups.The elevated pushup position raises the feet above the body, meaning that a person needs more strength to get back into a plank position. A person can increase the elevation over time as their strength improves.Muscles worked: shoulders, upper back, and triceps.Again, aim for a total of 36 pushups, dividing them into 3 sets of 12 repetitions with a short rest before each new set.The clap pushup, which is a type of plyometric pushup, is one of the most demanding types of pushup. A person can try this once they are very confident in their upper body strength.The clap pushup can help increase muscle strength, power, and body awareness.Muscles worked: shoulder, chest, and arms.This type of pushup requires a lot of strength, but a person will find that they build up endurance over time.For this exercise, it is best to start with 5 to 10 repetitions over 3 to 5 sets. Rest sufficiently between sets to allow the body to recover.The pike pushup is another demanding pushup variation that loads more weight onto the shoulders and triceps when pushing back up.Muscles worked: shoulder, serratus anterior, upper back, and triceps.A person can try using a yoga block or something similar if they are unable to touch the floor with their head. For this pushup, it is best to begin with short sets of 1 to 5 repetitions and then work up to larger sets of 8 to 12 repetitions.Pushups are a type of exercise that uses the weight of the body to work the large muscle groups and raise the heart rate. As these simple exercises do not require any special equipment, a person can easily incorporate them into their home exercise routine.There are also many pushup variations to suit different strengths, fitness levels, and needs. As a person becomes stronger and increases their endurance, they can progress to more advanced types of pushup. Article last reviewed by Fri  9 November 2018.Visit our Sports Medicine / Fitness category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Sports Medicine / Fitness.All references are available in the References tab.\t\t\nMarcolin, G., Petrone, N., Moro, T., Battaglia, G., Bianco, A., & Paoli, A. (2015, November). Selective activation of shoulder, trunk, and arm muscles: A comparative analysis of different push-up variants. Journal of Athletic Training, 50(11), 1126–1132. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4732391/Mazurek, K., Zmijewski, P., Makaruk, H., Mróz, A., Czajkowska, A., Witek, K., … Lipińska, P. (2018, August 31). Effects of short-term plyometric training on physical performance in male handball players. Journal of Human Kinetics, 63, 137–148. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6162976/Physical activity and your heart. (n.d.). Retrieved from https://www.nhlbi.nih.gov/health-topics/physical-activity-and-your-heartPlease use one of the following formats to cite this article in your essay, paper or report:MLACrichton-Stuart, Cathleen. \"Which muscles do pushups work?.\" Medical News Today. MediLexicon, Intl., 9 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323640.php>APACrichton-Stuart, C. (2018, November 9). \"Which muscles do pushups work?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323640.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323640.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}