{"id": "What is lupus?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Due to its complex nature, people sometimes call lupus the \"disease of 1,000 faces.\"In the United States, people report around 16,000 new cases of lupus each year, and up to 1.5 million people may be living with the condition, according to the Lupus Foundation of America.The Foundation say that lupus affects women in particular, and it is most likely to appear between the ages of 15 and 44 years.Lupus gained public attention in 2015 after the singer Selena Gomez announced she received a diagnosis in her late teens and underwent treatment for the condition.Lupus is not a contagious disease. A person cannot transmit it sexually or in any other way to another person.However, in rare cases, women with lupus may give birth to children who develop a form of lupus. This is called neonatal lupus.There are different kinds of lupus. This article will focus mainly on systemic lupus erythematosus (SLE), but other types include discoid, drug-induced, and neonatal lupus.SLE is the most familiar type of lupus. It is a systemic condition. This means it has an impact throughout the body. The symptoms can range from mild to severe.It is more severe than other types of lupus, such as discoid lupus, because it can affect any of the body's organs or organ systems. It can cause inflammation in the skin, joints, lungs, kidneys, blood, heart, or a combination of these.This condition typically goes through cycles. At times of remission, the person will have no symptoms. During a flare-up, the disease is active, and symptoms appear.In discoid lupus erythematosus (DLE) — or cutaneous lupus — symptoms affect only the skin. A rash appears on the face, neck, and scalp.The raised areas may become thick and scaly, and scarring may result. The rash may last from a number of days to several years, and it may recur.DLE does not affect the internal organs, but around 10 percent of people with DLE will go on to develop SLE, according to the Lupus Foundation of America. It is not clear, however, if these individuals already had SLE and just showed clinical signs on the skin or if there is a progression from DLE or SLE.Subacute cutaneous lupus erythematosus refers to skin lesions that appear on parts of the body that are exposed to the sun. The lesions do not cause scarring.In around 10 percent of people with SLE, symptoms occur because of a reaction to certain prescription drugs. According to Genetics Home Reference, some 80 drugs may cause the condition.These include some of the drugs that people use to treat seizures and high blood pressure. They also include some thyroid medications, antibiotics, antifungals, and oral contraceptive pills.Drugs that are commonly associated with this form of lupus are:Drug-induced lupus typically goes away after the person stops taking the medication.Most babies born to mothers with SLE are healthy. However, around 1 percent of women with autoantibodies relating to lupus will have a baby with neonatal lupus.The woman may have SLE, Sjögren's syndrome, or no disease symptoms at all.Sjögren's syndrome is another autoimmune condition that often occurs with lupus. Key symptoms include dry eyes and a dry mouth.At birth, babies with neonatal lupus may have a skin rash, liver problems, and low blood counts. Around 10 percent of them will have anemia.The lesions usually go away after a few weeks. However, some infants have a congenital heart block, in which the heart cannot regulate a normal and rhythmic pumping action. The infant may need a pacemaker. This can be a life-threatening condition.It is important for women with SLE or other related autoimmune disorders to be under a doctor's care during pregnancy.Lupus is an autoimmune condition, but the exact cause is unclear.The immune system protects the body and fights off antigens, such as viruses, bacteria, and germs.It does this by producing proteins called antibodies. White blood cells, or B lymphocytes, produce these antibodies.When a person has an autoimmune condition, such as lupus, the immune system cannot differentiate between unwanted substances, or antigens, and healthy tissue.As a result, the immune system directs antibodies against both the healthy tissue and the antigens. This causes swelling, pain, and tissue damage.The most common type of autoantibody that develops in people with lupus is an antinuclear antibody (ANA). The ANA reacts with parts of the cell's nucleus, the command center of the cell.These autoantibodies circulate in the blood, but some of the body's cells have walls permeable enough to let some autoantibodies through.The autoantibodies can then attack the DNA in the nucleus of these cells. This is why lupus affects some organs and not others.Several genetic factors probably influence the development of SLE.Some genes in the body help the immune system to function. In people with SLE, changes in these genes may stop the immune system from working properly.One possible theory relates to cell death, a natural process that occurs as the body renews its cells, according to Genetics Home Reference.Some scientists believe that, due to genetic factors, the body does not get rid of cells that have died.These dead cells that remain may release substances that cause the immune system to malfunction.Lupus may develop in response to a number of factors. These may be hormonal, genetic, environmental, or a combination of these.Hormones are chemical substances that the body produces. They control and regulate the activity of certain cells or organs.Hormonal activity could explain the following risk factors:Sex: The U.S. National Institutes of Health note that females are nine times more likely to have lupus than males.Age: Symptoms and diagnosis often occur between the ages of 15 and 45 years, during the childbearing years. However, 20 percent of cases appear after the age of 50 years, according to Genetics Home Reference.As 9 out of 10 occurrences of lupus affect females, researchers have looked at a possible link between estrogen and lupus. Both men and women produce estrogen, but women produce more.In a review published in 2016, scientists observed that estrogen can affect immune activity and induce lupus antibodies in mice that are susceptible to lupus.This may explain why autoimmune diseases are more likely to affect women than men.In 2010, researchers who published a study on self-reported flares in the journal Rheumatology found that women with lupus report more severe pain and fatigue during menstruation. This suggests that flares may be more likely at this time.There is not enough evidence to confirm that estrogen causes lupus. If there is a link, estrogen-based treatment could regulate the severity of lupus. However, more research is necessary before doctors can offer it as a treatment.Researchers have not proved that any specific genetic factor causes lupus, although it is more common in some families.Genetic factors may be the reason why the following are risk factors for lupus:Race: People of any background can develop lupus, but it is two to three times more common in people of color, compared with the white population. It is also more common in Hispanic, Asian, and Native American women.Family history: A person who has a first- or second-degree relative with lupus will have a higher risk of developing it.Scientists have identified certain genes that may contribute to the development of lupus, but there is not enough evidence to prove that they cause the disease.In studies of identical twins, one twin may develop lupus while the other does not, even if they grow up together and have the same environmental exposures.If one member of a twin pair has lupus, the other has a 25-percent chance of developing the disease, according to a study published in Seminars in Arthritis and Rheumatism in 2017. Identical twins are more likely to both have the condition.Lupus can happen in people with no family history of the disease, but there may be other autoimmune diseases in the family. Examples include thyroiditis, hemolytic anemia, and idiopathic thrombocytopenia purpura.Some have proposed that changes in the x-chromosomes might affect the risk.Environmental agents — such as chemicals or viruses — may contribute to triggering lupus in people who are already genetically susceptible.Possible environmental triggers include:Smoking: A rise in the number of cases in recent decades may be due to higher tobacco exposure.Exposure to sunlight: Some suggest that this may be a trigger.Medication: Around 10 percent of cases may be drug-related, according to Genetics Home ReferenceViral infections: These may trigger symptoms in people who are prone to SLE.Lupus is not contagious, and a person cannot transmit it sexually.Recently, scientists have been looking at gut microbiota as a possible factor in the development of lupus.Scientists who published research in Applied and Environmental Microbiology in 2018 noted that specific changes in gut microbiota feature in both people and mice with lupus.They call for more research into this area.Lupus is rare in children under the age of 15 years unless their birth mother has it. In this case, a child may have lupus-related heart, liver, or skin problems.Infants with neonatal lupus may have a higher chance of developing another autoimmune disease later in life.The symptoms of lupus occur in times of flare-ups. Between flare-ups, people usually experience times of remission, when there are few or no symptoms.Lupus has a wide range of symptoms, including:Lupus can also affect the following systems:Kidneys: Inflammation of the kidneys (nephritis) can make it difficult for the body to remove waste products and other toxins effectively. Around 1 in 3 people with lupus will have kidney problems.Lungs: Some people develop pleuritis, an inflammation of the lining of the chest cavity that causes chest pain, particularly with breathing. Pneumonia may develop.Central nervous system: Lupus can sometimes affect the brain or central nervous system. Symptoms include headaches, dizziness, depression, memory disturbances, vision problems, seizures, stroke, or changes in behavior.Blood vessels: Vasculitis, or inflammation of the blood vessels, can occur. This can affect circulation.Blood: Lupus can cause anemia, leukopenia (a decreased number of white blood cells) or thrombocytopenia (a decrease in the number of platelets in the blood, which assist in clotting).Heart: If inflammation affects the heart, it can result in myocarditis and endocarditis. It can also affect the membrane that surrounds the heart, causing pericarditis. Chest pain or other symptoms may result. Endocarditis can damage the heart valves, causing the valve surface to thicken and develop. This can result in growths that can lead to heart murmurs.Having lupus increases the risk of a number of health problems.:Infection: Infection becomes more likely because both lupus and its treatments weaken the immune system. Common infections include urinary tract infections, respiratory infections, yeast infections, salmonella, herpes, and shingles.Bone tissue death: This occurs when there is low blood supply to a bone. Tiny breaks can develop in the bone. Eventually, the bone may collapse. It most commonly affects the hip joint.Pregnancy complications: Women with lupus have a higher risk of pregnancy loss, preterm birth, and preeclampsia, a condition that includes high blood pressure. To reduce the risk of these complications, doctors often recommend delaying pregnancy until lupus has been under control for at least 6 months.The following video explains how lupus causes symptoms.The American College of Rheumatology use a standard classification scheme to confirm a diagnosis.If a person meets 4 out of 11 criteria, a doctor will consider that they may have lupus.The 11 criteria are:However, even this system sometimes misses early and mild cases.Underdiagnosis can occur because the signs and symptoms of lupus are not specific.On the other hand, some blood tests can lead to overdiagnosis, because people without lupus can have the same antibodies as those with the condition.\n\nDiagnosis can be difficult because of the varied symptoms that may resemble symptoms of other illnesses.The doctor will ask about symptoms, carry out a physical examination, and take a personal and family medical history. They will also consider the 11 criteria mentioned above.The doctor may request some blood tests and other laboratory investigations.Biomarkers are antibodies, proteins, genetic, and other factors that can show a doctor what is happening in the body or how the body is responding to treatment.They are useful because they can indicate if a person has a condition even when there are no symptoms.Lupus affects individuals in different ways. This makes it difficult to find reliable biomarkers.However, a combination of blood tests and other investigations can help a doctor to confirm a diagnosis.Blood tests can show whether certain biomarkers are present, and biomarkers can give information about which autoimmune disease, if any, a person has.1) Antinuclear antibodyAround 95 percent of people with lupus will have a positive result in the ANA test. However, some people test positive for ANA, but they do not have lupus. Other tests must confirm the diagnosis.2) Antiphospholipid antibodies Antiphospholipid antibodies (APLs) are a type of antibody directed against phospholipids. APLs are present in up to 50 percent of people with lupus. People without lupus can also have APLs.A person with APLs may have a higher risk of blood clots, stroke, and pulmonary hypertension. There is also a higher risk of pregnancy complications, including a loss of pregnancy.3) Anti-DNA antibody testAround 70 percent of people with lupus have an antibody known as the anti-DNA antibody. The result is more likely to be positive during a flare-up.4) Anti-dsDNA antibodyThe anti-double-stranded DNA antibody (anti-dsDNA) is a specific type of ANA antibody that occurs about 30 percent of people with lupus. Fewer than 1 percent of people without lupus have this antibody.If the test is positive, it may mean that a person has a more serious form of lupus, such as lupus nephritis, or kidney lupus.5) Anti-Smith antibodyAround 20 percent of people with lupus have an antibody to Sm, a ribonucleoprotein that is present in the nucleus of a cell.It is present in fewer than 1 percent of people without lupus, and it is rare in those with other rheumatic diseases. For this reason, a person with anti-sm antibodies is likely to have lupus. It is not usually present with kidney lupus.6) Anti-U1RNP antibodyAround 25 percent of people with lupus have anti-U1RNP antibodies, and fewer than 1 percent of people without lupus have them.This antibody may be present in people who have Raynaud's phenomenon, and Jaccoud's arthropathy, a deformity of the hand due to arthritis.7) Anti-Ro/SSA and anti-La/SSB antibodiesBetween 30 and 40 percent of people with lupus have anti-Ro/SSA and anti-La/SSB antibodies. These also occur with primary Sjögren's syndrome and in people with lupus who test negative for ANA.They are present in small amount in about 15 percent of people without lupus, and they can occur with other rheumatic conditions, such as rheumatoid arthritis.If a mother has anti-Ro and anti-La antibodies, there is a higher chance that a baby born to her will have neonatal lupus.A person with lupus who wishes to become pregnant have tests for these antibodies.8) Anti-histone antibodiesAntibodies to histones are proteins that play a role in the structure of DNA. People with drug-induced lupus usually have them, and people with SLE may have them.\nHowever, they do not necessarily confirm a diagnosis of lupus.Serum (blood) complement testA serum complement test measures the levels of proteins that the body consumes when inflammation takes place.If a person has low complement levels, this suggests that inflammation is present in the body and that SLE is active.Urine tests can help to diagnose and monitor the effects of lupus on the kidneys.The presence of protein, red blood cells, white blood cells, and cellular casts can all help to show how well the kidneys are working.For some tests, only one sample is necessary. For others, the person may need to collect samples over 24 hours.The doctor may also request biopsies, usually of the skin or kidneys, to check for any damage or inflammation.X-rays and other imaging tests can help doctors see the organs affected by lupus.Ongoing tests can show how lupus continues to affect a person or how well their body is responding to treatment.There is currently no cure for lupus, but people can manage their symptoms and flares with lifestyle changes and medication.Treatment aims to:Medication can help to:The exact treatment will depend on how lupus affects the individual. Without treatment, flares can occur that may have life-threatening consequences.Apart from medication, the following may help to relieve pain or reduce the risk of a flare:Some people use the supplement thunder-god vine. However, the National Center for Complementary and Integrative Health (NCCIH) warn that this can be poisonous. It is important to speak to a doctor before using it.\n\nIn the past, people who had a diagnosis of lupus would not usually survive for more than 5 years.Now, however treatment can significantly increase a person's lifespan, according to the National Institutes of Health.Effective therapy also makes it possible to manage lupus, so that a person can live an active, healthy life.As scientists learn more about genetics, doctors hope that one day they will be able to identify lupus at an earlier stage. This will make it easier to prevent complications before they occur.Sometimes people choose to join a clinical trial, as this can give access to new medications. To find out more about clinical trials click here. Article last reviewed by Mon 12 November 2018.Visit our Lupus category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Lupus.All references are available in the References tab.\t\t\n824 studies found for lupus. (n.d.). Retrieved from https://www.clinicaltrials.gov/ct2/results?Search=Search&cntry1=&cond=&state1=&term=LupusAntiphospholipid antibodies. (n.d.). Retrieved from https://www.hopkinslupus.org/lupus-tests/antiphospholipid-antibodies/Colangelo, K., Haig, S., Bonner, A., Zelenietz, C., & Pope, J. (2011, April 1). Self-reported flaring varies during the menstrual cycle in systemic lupus erythematosus compared with rheumatoid arthritis and fibromyalgia. Rheumatology, 50(4), 703–708. Retrieved from https://academic.oup.com/rheumatology/article/50/4/703/1777760Complementary treatments for pain. (2013, July 20). Retrieved from https://resources.lupus.org/entry/complementary-and-alternative-treatments-for-pain Different types of lupus. (2013, July 20). Retrieved from https://resources.lupus.org/entry/types-of-lupusHeart block. (n.d.). Retrieved from https://www.chop.edu/conditions-diseases/heart-blockKhan, D., & Ahmed, S. A. (2016, January 16). The immune system is a natural target for estrogen action: Opposing effects of estrogen in two prototypical autoimmune diseases. Frontiers in Immunology. Retrieved from https://www.frontiersin.org/articles/10.3389/fimmu.2015.00635/fullLab tests for lupus. (2013, July 8). Retrieved from https://resources.lupus.org/entry/lab-testsLee, L. A. (2004). Neonatal lupus: Clinical features and management [Abstract]. Paediatric drugs, 6(2), 71–78. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/15035648Luo, X. M., Edwards, M. R., Mu, Q., Yu, Y., Vieson, M. D., Reilly, C. M., … Bankole, A. A. (2018, January 31). Gut microbiota in human systemic lupus erythematosus and a mouse model of lupus. Applied Environmental Microbiology, 84(4), e02288–17. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/29196292 Lupus. (2018, August 10). Retrieved from https://medlineplus.gov/lupus.htmlLupus. (2018, June 30). Retrieved from https://report.nih.gov/nihfactsheets/ViewFactSheet.aspx?csid=47Lupus blood tests. (n.d.). Retrieved from https://www.hopkinslupus.org/lupus-tests/lupus-blood-tests/Lupus: Diagnosis. (2018, May 1). Retrieved from https://www.nhsinform.scot/illnesses-and-conditions/immune-system/lupus#diagnosisOther clinical tests. (n.d.). Retrieved from https://www.hopkinslupus.org/lupus-tests/clinical-tests/SLE pathology and the role of the female estrogen hormone spotlighted. (2016, January 21). Retrieved from https://lupusnewstoday.com/2016/01/21/the-immune-system-is-a-natural-target-for-estrogen-action-opposing-effects-of-estrogen-in-two-prototypical-autoimmune-diseases/Systemic lupus erythematosus. (2018, October 30). Retrieved from https://ghr.nlm.nih.gov/condition/systemic-lupus-erythematosus?_ga=2.154019256.1682543888.1540977931-1911867496.1484152012Thunder god vine. (2016, December 1). Retrieved from https://nccih.nih.gov/health/tgvineUlff-Møller, C. J., Svenden, A. J., Norgaard Viemose, L., & Jacobsen, S. (2018, February).  Concordance of autoimmune disease in a nationwide Danish systemic lupus erythematosus twin cohort [Abstract]. Seminars in Arthritis and Rheumatism, 47(4), 538–544. Retrieved from https://www.sciencedirect.com/science/article/pii/S0049017217300677What doctors look for to confirm a diagnosis. (n.d.). Retrieved from https://resources.lupus.org/entry/what-doctors-look-forWhat is lupus? (n.d.). Retrieved from https://resources.lupus.org/entry/what-is-lupusPlease use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What is lupus?.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323653.php>APABrazier, Y. (2018, November 16). \"What is lupus?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323653.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323653.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}