{"id": "Chronic noise can impact heart health", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The leader of the study was Dr. Azar Radfar, Ph.D., a research fellow at the Massachusetts General Hospital in Boston. The findings will be presented at Scientific Sessions 2018, held by the American Heart Association (AHA) in Chicago, IL.Dr. Radfar's team found that noise exposure causes an elevated stress response in the human brain.This can lead to inflammation in the blood vessels, which can cause serious health problems, including a heart attack or stroke.The research included 499 participants, who were free from cardiovascular disease and cancer at the study's start.The participants underwent positron emission tomography (PET) and CT scans of their brains and blood vessels. The researchers also looked at the activity of the amygdala, a region of the brain that regulates stress and emotional response.The team estimated participants' regular exposure to noise by comparing their home addresses with data from the United States Department of Transportation's National Transportation Noise Map, which includes information about levels of roadway and aviation noise.Years later, the researchers examined the participants' medical records for evidence of cardiovascular events. Of the 499 original participants, 40 had experienced a heart attack or stroke in the 5 years that followed the initial testing.After analyzing the data, the team discovered that participants with the highest levels of noise exposure also had the most noticeable stress-related brain activity. In addition, they had more inflammation in their arteries.\nIncreased blood vessel inflammation is a well-established risk factor for heart disease, so finding a link between this inflammation and cardiovascular events was no surprise.However, participants with the most stress-related brain activity were more than three times as likely to experience a major cardiovascular event, such as a heart attack or stroke.Even after accounting for other risk factors, such as air pollution, smoking, and diabetes, the team concluded that participants exposed to higher levels of noise pollution had an increased risk of cardiovascular events.\"A growing body of research reveals an association between ambient noise and cardiovascular disease, but the physiological mechanisms behind it have remained unclear,\" explains Dr. Radfar, adding, \"We believe our findings offer an important insight into the biology behind this phenomenon.\"Cardiovascular health is an extremely important topic of study. According to the Centers for Disease Control and Prevention (CDC), heart disease is responsible for around 1 in 4 deaths in the U.S., or about 610,000 deaths each year.Many elements can increase the likelihood of developing heart disease. While we cannot control some risk factors, such as age, we can influence our overall risk to a certain extent.Tobacco smoke, physical inactivity, and being overweight are three risk factors that a person can avoid. By following a healthful diet, quitting smoking, and exercising, it is possible to reduce the chances of developing heart disease.Stress can also increase cardiovascular risk, as can alcohol consumption. In addition, people with diabetes or high blood pressure have a higher risk.Determining whether decreasing noise exposure can reduce the risk of heart disease will require further research. The study's authors urge doctors to consider high noise levels as an independent risk factor for cardiovascular events.While simply moving away from an area with noise pollution is usually not an option, the authors urge their readers to consider ways to decrease high levels of ambient noise.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323604.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}