{"id": "How to eat healthfully: Double your portion size", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.If somebody gives us a huge bowl of candy, we are likely to eat more of it than if someone gives us a smaller bowl of candy.Scientists have studied the so-called portion size effect in some depth.One review of the research found that when a portion size is doubled, people consume an average of 35 percent more.Food outlets often advertise larger portion sizes to attract customers, and many health professionals believe that this tactic might play a role in the rise of obesity in the United States.For this reason, health-conscious people around the world make sure to only give themselves small portions of foods that some may call unhealthful.Despite a great deal of research into the negative consequences of portion size, very few studies have focused on the potential benefits. Could increasing portion size of healthful snacks increase their consumption?With this in mind, researchers from Deakin University in Australia recently set out to see whether the effect would work in reverse.The study, which Prof. Chris Dubelaar led, was a coordinated effort between scientists in Australia and France. Their findings now appear in the journal Food Quality and Preference.In order to investigate, the team designed two complementary experiments. The first involved 153 university students in a laboratory setting. The scientists gave them large or small portions of healthful apple chips or unhealthful potato chips.As expected, the participants to whom the team gave the larger portions of snacks — even the healthful versions — ate significantly more than the group with the smaller portions.The second phase took place at a film festival. In total, the researchers gave 77 participants a small or a large bag of baby carrots. They watched either a film about a restaurant, which included many scenes involving food, or a romantic comedy with no particular food references.Again, those with the larger bag ate more of the healthful snack. Interestingly, the effect was less pronounced in the group that watched the film about the restaurant; this demonstrates the significant impact that the environment can have on our eating behavior.Prof. Dubelaar thinks that this could provide an \"opportunity for those seeking to control intake to consider their environment when they're eating to help reduce the effects of portion size.\"Overall, the study's results give an interesting insight into the convoluted world of food psychology. They might also offer some new ways to improve our eating habits.\"The results of our current study tell us that this portion size effect also holds true with healthy foods, which opens up the potential for adjusting portion size when trying to encourage healthier eating habits.\"Prof. Chris DubelaarHe continues, \"For example, parents trying to get their children to eat more veggies could serve up larger portions. This would also work for healthy snacks such as fruit or any food you want someone to eat more of.\"The authors suggest that beginning a meal with a large portion of healthful food before a smaller plate of unhealthful food might be a useful approach.Because obesity is a growing concern in the U.S. and elsewhere, understanding the nuances of our relationship with food is more important than ever. Though this study used a relatively low number of participants, it offers fresh insight and is likely to spur future investigations in a similar vein.There is a myriad of variables that scientists could analyze in follow-up work. For instance, healthful and unhealthful snacks often have very different flavor and texture profiles, so understanding how each of these subtle differences impacts the portion size effect will be interesting.Until more studies are carried out, the take-home message is: Don't worry how large the portion is, worry about what you are apportioning.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323563.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}