{"id": "Eye scan may detect Alzheimer's disease in seconds", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The world's population is aging rapidly and the prevalence of Alzheimer's disease is on the rise.For this reason, the need for efficient dementia screening methods that can be applied to millions of people is dire.Current diagnostic practices are either invasive or ineffective.For instance, brain scans are costly, and spinal taps — or lumbar punctures — are invasive and potentially harmful.Specialists currently diagnose Alzheimer's disease using memory tests and by tracking behavioral changes. However, by the time that the symptoms appear, the disease has already progressed.For these reasons, researchers are hard at work trying to devise newer and better diagnostic tools for Alzheimer's. For instance, some scientists are trying to use a \"sniff test\" as a way of assessing whether someone has dementia.Now, researchers at Duke University in Durham, NC, say that Alzheimer's could be diagnosed in seconds just by looking at a person's eyes, and scientists at the Sheba Medical Center in Israel concur.Two new studies presented at AAO 2018 — the 122nd Annual Meeting of the American Academy of Ophthalmology, held in Chicago, IL — show that Alzheimer's alters the fine blood vessels in the retina at the back of the eye.Using an innovative and noninvasive eye imaging technique, the scientists maintain that they can distinguish between signs of Alzheimer's and signs of mild cognitive impairment (MCI), which is a condition that raises the risk of Alzheimer's but is not harmful in itself.Dr. Sharon Fekrat, a professor of ophthalmology at Duke University, co-led the first study together with colleague Dr. Dilraj Grewal, an associate professor of ophthalmology at Duke University.The second study was conducted by researchers at the Sheba Medical Center, and it was led by Dr. Ygal Rotenstreich, an ophthalmologist at the Goldschleger Eye Institute.Drs. Fekrat, Grewal, and colleagues explain that they used a technique called optical coherence tomography angiography (OCTA) to examine the link between the eyes' retinas and Alzheimer's disease.OCTA lets ophthalmologists examine each of the retina's layers, mapping them and measuring their thickness noninvasively. The technique uses light waves to take photos of the retina.Researchers have used OCTA to study how dementia affects the retina because it enables them to examine the finest veins and red blood cells that are present at the back of the eye.In the first study, scientists compared the retinas of people with Alzheimer's with those of people who had only MCI, and with the retinas of those who had neither of these conditions.Drs. Fekrat, Grewal, and team found that people with Alzheimer's had lost small blood vessels in the retina at the back of the eye. Also, a certain layer of the retina was thinner in people with Alzheimer's than in those with MCI or people who did not have any form of cognitive impairment.The scientists speculate that the changes in the retina reflect the disruptions in the brain's blood vessels that Alzheimer's causes. This is a valid hypothesis, they say, given that the optic nerve connects the brain with the retina.\"This project meets a huge unmet need. It's not possible for current techniques like a brain scan or lumbar puncture (spinal tap) to screen the number of patients with this disease. Almost everyone has a family member or extended family affected by Alzheimer's. We need to detect the disease earlier and introduce treatments earlier.\" \nDr. Sharon FekratIn the second study, Dr. Rotenstreich and his team examined 400 people who were at high genetic risk of developing Alzheimer's. The scientists compared brain scans and retina images from these people with the retinas and brains of those without a family history of Alzheimer's.The study revealed that the retina is thinner in people with a higher genetic risk of Alzheimer's. Additionally, the hippocampus was smaller in these people. Both of these dementia signs correlated with a poor score on the cognitive impairment test.The hippocampus is a key brain area for learning and memorizing. It is among the first regions that Alzheimer's disease affects, with studies demonstrating that dementia affects neurogenesis — that is, the formation of new neurons — in the hippocampus, and that Alzheimer's disease reduces the size of this brain region altogether.Dr. Rotenstreich comments on the significance of these findings, saying, \"A brain scan can detect Alzheimer's when the disease is well beyond a treatable phase.\"He says that an eye-scanning diagnostic tool would improve the lives of people predisposed to developing Alzheimer's, saying, \"We need treatment intervention sooner. These patients are at such high risk.\"Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323515.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}