{"id": "New way to manipulate immune cells may treat cancer, autoimmune disease", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The discovery concerns a molecule called tetrahydrobiopterin (BH4), which is already well-known to those who study the biology of the brain and nervous system.However, new research reveals that BH4 has a previously unknown role — it helps to control the growth of T cells in the immune system.T cells are white blood cells that seek out and attack potentially harmful pathogens, such as viruses, bacteria, and rogue cells, including those that can trigger cancer.The leaders of the study are researchers at the Institute of Molecular Biotechnology of the Austrian Academy of Sciences (IMBA) in Vienna and others at the Boston Children's Hospital in Massachusetts. The journal Nature recently published the findings.\"One fascinating feature of our discovery is that a system that is actually known in neurobiology for decades can play such a key role in T cell biology,\" says co-senior author Josef M. Penninger, the scientific and founding director of IMBA.He explains that the finding \"links two completely different systems in our body\" and that it \"was truly amazing to find such a critical new player in T cell biology.\"What is particularly interesting, he adds, is that the discovery concerns the control of T cell growth, as opposed to the cells' activation.The finding should lead to a wide variety of medical uses, ranging \"from controlling autoimmune diseases, asthma, and allergies to having a new way to trigger anticancer immunity,\" Penninger concludes.Harnessing the body's own healing mechanisms to fight disease is a fast-growing field in medical research.Two scientists won the 2018 Nobel Prize in Physiology or Medicine after developing an approach to cancer therapy that stimulates the immune system's inherent ability to destroy tumor cells.Such discoveries are driving a revolution in the way that we treat cancer, a disease that affects millions of people worldwide and has a significant impact on society.The National Cancer Institute estimate that in 2018, doctors will diagnose 1,735,350 new cases of cancer and that 609,640 people will die from the disease in the United States.Diseases can also result from an overactive or misdirected immune system. There are more than 80 types of autoimmune disease, and these arise because the immune system attacks healthy tissue, mistaking it for a threat.Common autoimmune diseases include inflammatory bowel disease, type 1 diabetes, systemic lupus erythematosus, and rheumatoid arthritis.A 2005 report from the National Institutes of Health (NIH) estimated that up to 23.5 million people in the U.S. have an autoimmune disease and that the \"prevalence is rising.\"The American Autoimmune Related Diseases Association, however, say that the NIH figures only take into account 24 autoimmune diseases and that the actual figure is more likely to be about 50 million.The body uses BH4 to make serotonin and dopamine, two hormones that send signals between cells in the brain and the nervous system.The authors of the new study showed that the molecule is also crucial for T cell biology. They demonstrated that reducing cell production of BH4 \"severely\" limits the \"proliferation of mature mouse and human T cells.\"It seems that T cells need BH4 to help them regulate iron and produce energy. This is consistent with findings from much older research, which linked iron deficiency to problems with the immune system.In mouse models of cancer, the team found that increasing BH4 caused more T cells to grow and tumors to shrink. It appears that BH4 does this by overcoming a molecule called kynurenine that normally suppresses T cell growth in tumors.Co-senior author Clifford J. Woolf, director of the F.M. Kirby Neurobiology Center at Boston Children's Hospital, marvels that \"a molecule recognized as essential for many functions in neurobiology is now identified as key for completely novel therapies.\"Describing the effects of altering the amount of BH4, Woolf explains, \"When we dial it down, we block T cell proliferation in autoimmune diseases or asthma. When we dial it up, we can trigger T cells to grow and attack tumor cells, even under adverse conditions.\"The researchers tested some BH4 blockers on mouse models of allergies and autoimmune diseases. The drugs \"calmed\" auto-aggressive T cells, stopped allergic inflammation, and prevented T cells from causing autoimmune attacks in the gut and brain.They hope to test a drug based on the approach in humans soon.\n\"The beauty of the approach is that instead of targeting a single cytokine or class of T cells, we halt proliferation in all disease-related T cells, and this could translate into activity across multiple diverse clinical conditions.\"Clifford J. WoolfYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323655.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}