{"id": "Prone to binge drinking? This might be why", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.According to the most recent estimates, over 15 million adults in the United States — or over 6 percent of the population — have alcohol use disorder.Approximately 88,000 people die from alcohol-related problems every year, making alcohol the \"third leading preventable cause of death\" in the United States.In addition to alcohol dependence, alcohol brings about a number of other disorders, including liver cirrhosis and various forms of cancer.However, what makes some of us crave alcohol so much, even when it's bad for us? One answer is dopamine, the so-called sex, drugs, and rock 'n' roll neurotransmitter.Dopamine helps the brain learn new things, but it may also lead us down the path of addiction.Dopamine earned its nickname because it is a feel-good chemical that is released as a reward for the brain when we learn new things or during pleasurable activities such as sex. It is also the substance that \"tells\" us to prolong the pleasure and continue to \"chase the high.\"In the case of alcohol dependence, when alcohol reaches the brain, it causes the neurons in a region called the ventral tegmental area (VTA) to release dopamine.Until now, the precise molecular steps through which this occurred weren't clear. So, researchers at the Center for Alcohol Research in Epigenetics at the University of Illinois at Chicago (UIC) set out to investigate, and their findings shed new light on binge drinking and alcohol use disorder.Mark Brodie, a professor of physiology and biophysics in the UIC College of Medicine, is the lead author of the study, which was published in the journal Neuropharmacology.Prof. Brodie and his team started from the hypothesis that alcohol may inhibit a potassium channel called KCNK13. This channel can be found inside the membrane of dopamine neurons in the VTA. So, when this pathway is blocked, neurons release more dopamine than usual.To verify their hypothesis, the researchers performed a range of experiments. In one of them, the scientists created a mouse model in which KCNK13 was genetically reduced by 15 percent.The KCNK13-deprived mice drank 20–30 percent more alcohol than their normal counterparts.Prof. Brodie explains the findings, saying, \"We believe that mice with less KCNK13 in the VTA drank more alcohol in order to achieve the same 'reward' from alcohol as normal mice, presumably because alcohol was triggering the release of less dopamine in their brains.\"Another experiment focused on the neuronal response to alcohol in the VTA region for mice with less KCNK13.These neurons were 50 percent less excited in response to ethanol when compared with normal VTA neurons that were exposed to ethanol.The study's lead author says that the findings may help explain why some people are more prone to binge drinking than others.\"If someone has naturally lower levels of this channel, then in order to produce the pleasurable effects of alcohol, that person would have to drink much more, and may be at higher risk for binge drinking disorder.\"Prof. Mark BrodieIn the future, Prof. Brodie and team plan to study how tweaking the KCNK13 channel in other brain regions and cells may change alcohol dependence and alcohol-related behavior.\"Without the channel, alcohol can't stimulate the release of dopamine, and so drinking is likely less rewarding. We think that the KCNK13 channel presents an extremely exciting new target for drugs that could potentially help people with alcohol use disorder to stop drinking.\"\"This channel,\" Prof. Brodie goes on to say, \"seems to be specific to alcohol effects in the VTA, so targeting it with a drug would dampen the effects of alcohol only.\" In other words, a drug that targets KCNK13 would not dampen the brain's response to pleasure in general; only to pleasure derived from alcohol.\"Currently available drugs reduce the impact of alcohol on the brain that is akin to turning down the volume on a stereo,\" he says. \"A drug that would target KCNK13 would be different in that it would be like an on/off switch. If it's turned off, alcohol just wouldn't trigger increased dopamine release.\"Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323432.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}