{"id": "What is health insurance?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Insurers use the term \"provider\" to describe a clinic, hospital, doctor, laboratory, healthcare practitioner, or pharmacy that treats an individual. The \"insured\" is the owner of the health insurance policy or the person with the health insurance coverage.Depending on the type of health insurance coverage, either the insured pays costs out of pocket and receives reimbursement, or the insurer makes payments directly to the provider.In countries without universal healthcare coverage, such as the United States, health insurance is commonly included in employer benefit packages.In the U.S., the number of people with insurance decreased from 44 million in 2013 to fewer than 28 million in 2016, according to the Kaiser Family Foundation. The researchers put this down to recent changes in legislation.A Commonwealth Fund 2011 report informed that one-fourth of all U.S. citizens of working age experienced a gap in health insurance coverage. Many people in the survey lost their health insurance when they either became unemployed or changed jobs.The level of treatment in emergency departments varies significantly depending on what type of health insurance a person has.There are two main types of health insurance:Private health insurance: The Centers for Disease Control and Prevention (CDC) say that the U.S. healthcare system relies heavily on private health insurance. In the National Health Interview Survey, researchers found that 65.4 percent of people under the age of 65 years in the U.S. have a type of private health insurance coverage.Public or government health insurance: In this type of insurance, the state subsidizes healthcare in exchange for a premium. Medicare, Medicaid, the Veteran's Health Administration, and the Indian Health Service are examples of public health insurance in the U.S.People also define an insurer by the way they administer their plans and connect with healthcare providers.Managed care plans: In this type of plan, the insurer will have contracts with a network of healthcare providers to give lower-cost medical care to their policyholders. There will be penalties and additional costs added to out-of-network hospitals and clinics, but they will provide some treatment.The more expensive the policy, the more flexible it is likely to be with the network of hospitals.Indemnity, or fee-for-service plans: A fee-for-service plan covers treatment equally among all healthcare providers, allowing the insured to choose their preferred place of treatment. The insurer will typically pay for at least 80 percent of costs on an indemnity plan, while the patient pays the remaining costs as a co-insurance.Health maintenance organizations (HMOs): These are organizations that provide medical care directly to the insured. The policy will usually have a dedicated primary care physician that will coordinate all necessary care.HMOs will normally only fund treatment that is referred by this GP and will have negotiated fees for each medical service to minimize costs. This is usually the cheapest type of plan.Preferred provider organizations (PPOs): A PPO is similar to an indemnity plan, in that they allow the insured to visit any doctor they prefer.The PPO also has a network of approved providers with which they have negotiated costs.The insurer will pay less for treatment with out-of-network providers. However, people on a PPO plan can self-refer to specialists without having to visit a primary care physician.Point-of-service (POS) plans: A POS plan functions as a mix of an HMO and PPO. The insured can choose between coordinating all treatment through a primary care physician, receiving treatment within the insurer's provider network, or using non-network providers. The type of plan will dictate the progress of treatment.\nThe type of plan dictates how an individual will approach getting the treatment they need and how much money they will need to pay on the day.In 2003, the U.S. Congress introduced a new option, the Health Savings Account (HSA). It is a combination of an HMO, PPO, indemnity plan, and savings account with tax benefits. However, a policyholder must pair this type with an existing health plan that has a deductible of over $1,100 for individuals and $2,200 for families.HSAs can top up coverage, extending existing plans to cover a wider range of treatments. If an HSA is paid for by an employer on behalf of their employees, the payments are tax-free. An individual can build up funds in the HSA while they are healthy and save for instances of poor health later in life.However, people with chronic conditions, such as diabetes, might not be able to save a large amount in their HSA as they regularly have to pay high medical costs for the management of their health concern.These plans often carry a very high deductible, meaning that although premiums can be lower, people often end up paying the full expenses of any required medical treatment.There is more overlap as plan types evolve. The distinctions between types of policy are becoming more and more blurred.The majority of indemnity plans use managed care techniques to control costs and ensure that there are enough resources to pay for appropriate care. Similarly, many managed care plans have adopted some characteristics of fee-for-service plans.In the U.S., having some degree of insurance is currently legally necessary as part of the Affordable Care Act (ACA) 2010. A person without health insurance has to pay a fine.However, the Individual Mandate in the ACA has been removed from the legislation, meaning that insurance will no longer be a legal requirement in the U.S. as of 2019.If the policy also covers the children in the family, a person is allowed to be on their parents' insurance until the age of 26 years, even if they are:Insurance is regulated at a state level, meaning that buying a policy in one state is different from doing so in another.While state legislation can affect the price of a policy, the important decisions about a person's cover and reimbursements rest with the insurer. People should be sure to have their broker or customer services representative discuss the impact of any changing legislation on their particular policy. Article last reviewed by Thu 18 October 2018.Visit our Health Insurance / Medical Insurance category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Health Insurance / Medical Insurance.All references are available in the References tab.\t\t\nCollins, S. R. Robertson, R, Garber, T. and Doty, M. M. (2012, April 19). Gaps in health insurance: Why so many Americans experience breaks in coverage and how the Affordable Care Act will help. Retrieved from https://www.commonwealthfund.org/publications/issue-briefs/2012/apr/gaps-health-insurance-why-so-many-americans-experience-breakseHealth data: Premiums 47% higher for individual health insurance plans with comprehensive health benefits. (2013, March 18). Retrieved from https://news.ehealthinsurance.com/news/ehealth-data:-premiums-47-higher-for-individual-health-insurance-plans-with-comprehensive-health-benefitsHealth insurance coverage. (2017, March 31). Retrieved from https://www.cdc.gov/nchs/fastats/health-insurance.htmKey facts about the uninsured population. (2017, November 29). Retrieved from https://www.kff.org/uninsured/fact-sheet/key-facts-about-the-uninsured-population/Pulling it together. (2011, September 23). Retrieved from https://www.kff.org/health-costs/perspective/pulling-it-together-rising-health-costs-are/Questions and answers about health insurance. (2007, August). Retrieved from https://www.in.gov/idoi/files/Questions_and_Answers_About_Health_Insurance.pdfYoung Adult Coverage. (n.d.). Retrieved from https://www.hhs.gov/healthcare/about-the-aca/young-adult-coverage/index.htmlPlease use one of the following formats to cite this article in your essay, paper or report:MLAFelman, Adam. \"What is health insurance?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323367.php>APAFelman, A. (2018, October 19). \"What is health insurance?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323367.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323367.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}