{"id": "Acute myeloid leukemia: New treatment overcomes chemo resistance", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Investigators from the Ottawa Hospital and the University of Ottawa, both in Canada, saw that lack of a protein called MTF2 helps alter gene expression in acute myeloid leukemia (AML) cells in such a way that they will develop resistance to chemotherapy.MTF2-deficient AML cells, the scientists found, overexpress a cancer-promoting gene called MDM2. It blocks the tumor-suppressor protein p53 and disrupts the cell-cycle process that leads to cell death when chemotherapy damages cells.They then tested the effect of blocking MDM2 in a mouse model of chemoresistant AML. All the mice that received the treatment alongside chemotherapy survived and showed \"complete remission,\" while those that only received chemotherapy died.A report on the study — together with a detailed account of the underlying gene expression mechanisms involved — now features in the journal Cancer Discovery.Co-senior study author William Stanford, who is a professor at the University of Ottawa and also works as a senior scientist at the Ottawa Hospital, says that the team was \"blown away\" by the results.\"If these findings,\" he continues, \"hold up in clinical trials, we could have a new treatment for people who would almost certainly die of their disease today.\"AML is a blood cancer that starts in bone marrow, which is where the body makes new blood cells. The cancer soon spreads into the bloodstream. In some cases, it can also spread to other parts of the body, such as the liver, spleen, lymph system, testicles, brain, and spinal cord.Though rare, AML is the most common blood cancer in adults. It usually strikes after the age of 45, but it can also affect younger people, including children. The average risk of developing AML during one's lifetime in the United States is about 0.5 percent.According to the American Cancer Society (ACS), there will be around 19,520 new cases of AML in the U.S. in 2018 and about 10,670 deaths to the disease.Overcoming resistance to chemotherapy is a major challenge in treating AML. Most people who die of the disease succumb because of chemoresistance. Around one third of people do not respond at all, while 40–50 percent might respond at first, but then their cancer returns.In previous work, Prof. Stanford and his team had discovered that MTF2 was important for making blood. They set up this new investigation to explore the protein's role in cancer.Using samples taken from people with AML, the team discovered that the chance of still being alive 5 years after chemotherapy started was three times higher in those who had \"normal MTF2 activity\" in their AML cells compared with those with low activity.At first, they thought about using MTF2 as a biomarker for identifying which people with AML might benefit most from experimental treatments.\"But then,\" Prof. Stanford explains, \"we started thinking that if we could understand what MTF2 was doing, maybe we could use this information to develop a new treatment.\"They then delved deeper into the activities of MTF2 and revealed that the protein changed gene expression by enabling chemical tags to be placed near the cancer-promoting gene MDM2. The tags reduce expression of the gene.When the team exposed AML cells with normal MTF2 activity to chemotherapy, they experienced the normal destiny of damaged cells: a type of programmed cell death called apoptosis. This was because the presence of MTF2 enabled the chemical tag that inhibits MDM2.AML cells with low MTF2 activity, however, did not have the facility to place tags near MDM2 and reduce its expression. Therefore, they did not enter the cell death pathway and continued to live and divide, even when the team exposed them to high amounts of chemotherapy.The researchers then tested drugs that block MDM2 on mouse models of AML. They designed the models using chemoresistant AML cells from humans.All the mice that received both the MDM2 blockers and chemotherapy survived the 4-month study, whereas those that only received chemotherapy died.Co-senior study author Dr. Caryn Y. Ito, a senior investigator at the Ottawa Hospital, says that they are very encouraged by the preclinical data from the animal study.There is still a lot of work to do, such as finding the right drugs for a trial and developing a test for identifying patients most likely to respond to the experimental treatment.\"We were totally surprised by the findings, which we hope to translate to the clinic soon.\"\n\nDr. Caryn Y. ItoYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323444.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}