{"id": "New genetic culprit found for early progressive hair loss", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Individuals with hypotrichosis simplex have a normal amount of hair after birth, but they start losing it in early childhood. This loss continues to progress with age.Although researchers know that this is a hereditary condition, so far, they have only identified few of the potential genetic culprits.One of these is a mutation in the APCDD1 gene, which interferes with a signaling pathway that influences cell function and regeneration.Now, researchers from the University Hospital of Bonn in Germany, in collaboration with colleagues from other institutions in Germany and Switzerland, have closed in on another gene that plays a crucial role in this rare type of hair loss.Their study, the findings of which appear in The American Journal of Human Genetics, indicate that mutations in the LSS gene drive the mechanisms that characterize hypotrichosis simplex.The scientists analyzed the genetic information of people from three families that were not related in any way. In total, eight relatives experienced hair loss symptoms.Looking at their genetic makeup, the investigators found that they all had mutations in the LSS gene, which normally encodes a specialized enzyme.\"This gene encodes lanosterol synthase — LSS for short,\" notes study author Prof. Regina C. Betz. \"The enzyme,\" she adds \"plays a key role in cholesterol metabolism.\"However, this has nothing to do with blood cholesterol levels. Instead, LSS influences a metabolic pathway that impacts the health of hair follicles.\"There is an alternative metabolic pathway for cholesterol, which plays an important role in the hair follicle and is not related to blood cholesterol levels,\" says Prof. Betz.However, the researchers did not stop at this finding. Instead, they collected tissue samples, which they analyzed in an effort to find out where exactly in hair follicle cells LSS appears.The team was able to confirm that, if a person carries the regular LSS gene, the enzyme appears in the endoplasmic reticulum. This is a set of tiny channels within the follicle cells.In the case of people with mutated LSS, the investigators found that the enzyme actually spreads outside of the endoplasmic reticulum and into the cytosol, the intracellular fluid.\"We are not yet able to say why the hair is falling out,\" admits lead study author Maria-Teresa Romano, a doctoral student. However, she notes that they do have a theory.\"It is likely that the displacement of LSS from the endoplasmic reticulum results in a malfunction.\"Maria-Teresa RomanoThe scientists are, nevertheless, excited about what they have been able to find out so far. These discoveries will allow them to get a fuller picture of the causes behind hypotrichosis simplex.\"A better understanding of the causes of the disease may in future enable new approaches to the treatment of hair loss,\" says Prof. Betz.It may still be a long time until they actually find an effective treatment for this type of progressive hair loss, however.Still, Prof Betz. tries to focus on the silver lining, saying, \"Those affected by hypotrichosis simplex only have to deal with hair loss. This is upsetting, but other organs are not affected.\"Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323635.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}