{"id": "What are the signs and symptoms of rheumatoid arthritis?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Some people can have long periods of remission, when the rheumatoid arthritis (RA) is inactive, and there are few or no symptoms. Others may have symptoms nearly all the time for long periods.Remission is more likely if a person is receiving effective treatment. If symptoms are ongoing, this may be a sign that treatment is not working.RA usually begins gradually, with signs and symptoms developing over several weeks or months.The first sign may be stiffness, tenderness, and pain in at least one joint, especially when the person tries to move the joint.Symptoms usually appear first in the small joints, such as the ones in the fingers and toes.The number of joints RA affects varies considerably, but for most people, it eventually affects at least five joints at the same time.Unlike systemic lupus or gout, RA is an additive polyarthritis. This means that it affects more joints as time passes.A person with sudden onset RA may go to bed healthy one night and wake up the next morning in a great deal of pain. They may be unable to get out of bed.RA usually affects both sides of the body, for example, both knees or both hands.\nRA causes joint pain and swelling because of inflammation in the lining of the affected joint.The skin over the joint becomes warm, red, and swollen. The area is painful and tender to the touch.It most commonly affects the following joints:It does not affect the spine, but problems can occur in a joint in the neck known as the C1–C2 joint, which has a synovial lining. Nowadays, however, this is less common, because effective treatment prevents it.The hands may become red and puffy.Morning stiffness is a hallmark symptom of RA, especially if it lasts more than 30 minutes, according to the Arthritis Foundation.Experts say that the duration of morning stiffness is usually a good indication of the inflammatory activity of the disease. Stiffness tends to last longer than it does with osteoarthritis and other types of degenerative arthritis.There may be stiffness after long periods of inactivity.RA causes inflammation not only in the joints but throughout the body. This can lead to a wide range of flu-like symptoms.These may occur for some weeks or months before other symptoms appear, and they can continue with the other symptoms.They include:A higher fever may indicate another type of illness.In the past, iron-deficiency anemia was common with RA. Now, however, the newer drugs that are available for treating the condition help to reduce this risk.Some people experience a loss of appetite. Weight loss can result.A significant number of people with RA also have secondary Sjögren's syndrome. Symptoms of this condition include dry eyes and a dry mouth, which can lead to tooth decay. Sometimes a loss of vision is possible.A doctor should check for the presence of these symptoms, as treatment can prevent further complications.RA symptoms tend to be intermittent, which means they come and go.During a flare-up, the symptoms will be more intense and severe. During a time of remission, there may be no symptoms.Flare-ups can occur at any time, but they tend to be more painful in the morning, when the person wakes up. As the day progresses, symptoms usually start to ease. Applying heat, such as a warm shower, may help.RA can cause inflammation in other parts of the body.The lungs: Inflammation may occur in the lungs or the pleura, which is the membrane around the lungs. There may be no symptoms, or the person may feel short of breath. If this occurs, a doctor can prescribe medications to reduce inflammation in the lungs. Lung changes affect up to 80 percent of people with RA, but most do not have symptoms.The pericardium: This is a double-walled sac that contains the heart and the roots of the major blood vessels. Inflammation can lead to chest pain.The eyes: Inflammation affects the tough, white outer coat over the eyeball, known as the sclera. Symptoms may include red, painful, and possibly dry eyes. Dry eyes may be a sign of secondary Sjögren's syndrome.There may also be inflammation of the tear glands.Nodular lesions: Some people with RA develop lumps under the skin, known as rheumatoid nodules. These are common around the elbows and forearms. They tend to form on pressure points, for example, where the arms rest on a table. They are not usually painful, but sometimes there may be pain. Nowadays, effective treatment makes nodules less likely.The voice box: RA can affect the cricoarytenoid joint, which is in the larynx, or voice box. Inflammation can lead to hoarseness. Hoarseness can also happen if a person has secondary Sjögren's syndrome.Salivary glands: This can lead to a dry mouth and irritation or infection of the gums. A dry mouth can increase the risk of severe dental decay and tooth loss. If a health professional identifies this, they can help the individual to manage it.Sore tongue: Having a dry mouth increases the chance of a yeast overgrowth in the mouth. A yeast infection normally causes the tongue to be white, but with dryness, the tongue can become tender, red, and cracked. People should speak to their doctor if they have a sore tongue.Blood vessels: Inflammation can affect many parts of the body, resulting in damage to the nerves, skin, and other organs.Systemic inflammation can have a wide-ranging impact.The Centers for Disease Control and Prevention (CDC) note that people with RA also have a higher risk of:People with both obesity and RA have a higher risk of conditions that commonly occur with obesity, such as high blood pressure and high cholesterol.\nRA can lead to a wide range of symptoms and complications.Following a healthful diet that contains plenty of fresh fruit and vegetables can help relieve symptoms.Raw or lightly cooked green vegetables and spices such as ginger and turmeric may help reduce inflammation and the symptoms it causes.Cigarette smoking can trigger the development of RA. Avoiding smoking can help to stop the symptoms from becoming worse.In addition, being physically active during times of remission can help to strengthen the body and the immune system and promote a feeling of well-being. Article last reviewed by Wed 17 October 2018.Visit our Rheumatoid Arthritis category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Rheumatoid Arthritis.All references are available in the References tab.\t\t\nMartí-Carvajal, A. J., Agreda-Pérez, L. H., & Solà, I. (2013, February 28). Erythropoiesis-stimulating agents for anemia in rheumatoid arthritis. Cochrane Systematic Review. Retrieved from https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD000332.pub3/full Dunkin, M. A. (2015, April). More than just joints: How rheumatoid arthritis affects the rest of your body. Retrieved from https://www.arthritis.org/about-arthritis/types/rheumatoid-arthritis/articles/rhemuatoid-arthritis-affects-body.phpRheumatoid arthritis. (2017, July 17). Retrieved from https://www.cdc.gov/arthritis/basics/rheumatoid-arthritis.htmlRheumatoid arthritis symptoms. (n.d.). Retrieved from https://www.arthritis.org/about-arthritis/types/rheumatoid-arthritis/symptoms.phpPlease use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"What are the signs and symptoms of rheumatoid arthritis?.\" Medical News Today. MediLexicon, Intl., 19 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323374.php>APABrazier, Y. (2018, October 19). \"What are the signs and symptoms of rheumatoid arthritis?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323374.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323374.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}