{"id": "What to know about microdermabrasion", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Microdermabrasion can exfoliate the skin, reduce signs of aging, and make the skin appear more even. The procedure is safe a person with any skin color.A healthcare professional usually performs the procedure, but some stores sell at-home kits.In this article, we will take a detailed look at microdermabrasion and its effects. We will also describe how to prepare, the possible side effects, and the differences between this procedure and dermabrasion.Microdermabrasion is a noninvasive cosmetic procedure. The specialist sprays or rubs fine crystals onto the skin with a wand that gently exfoliates the surface, removing the top layer. The aim is to make the skin appear younger.The procedure should not be painful. The American Academy of Dermatology (AAD) estimate that it takes 30–40 minutes for the face and 20 minutes for the neck. Afterward, there may be slight swelling or sunburn-like symptoms for a few days.Before seeing reduced signs of aging, a person may require between 5 and 16 treatments from a skin care specialist.People can have treatments weekly, every 2 weeks, or monthly, depending on their skin type and the reason for treatment.Most people request microdermabrasion to rejuvenate the complexion of the face and neck, but a specialist can perform the procedure on any area of skin.The results are not permanent.The goal of microdermabrasion is to make a person's complexion smoother, brighter, and more even in color.People often request microdermabrasion to address:Dermatologists may also use microdermabrasion to enhance the results of anti-aging or skin-bleaching products. The procedure can help these products penetrate the skin.Microdermabrasion is less invasive than dermabrasion.Dermabrasion uses more intensive methods to remove the top layer of skin. A dermatologist may recommend dermabrasion for acne scars, scars from accidents or surgery, or to remove tattoos.Dermabrasion is only suitable for people with fair skin. Microdermabrasion can be suitable for people with any skin color.Speak to a healthcare professional before undergoing microdermabrasion. Dermatologists usually offer prior consultations.The AAD recommend that people ask about the following before committing to the procedure:People can also ask to see before-and-after photos and to speak with someone who has undergone microdermabrasion at the clinic.A dermatologist will usually examine a person's skin during the consultation to ensure that microdermabrasion is appropriate.People who have taken the acne medicine isotretinoin in the past 6 months may need to wait before having microdermabrasion. They have an increased risk of complications such as scarring.Speak to a doctor about any spot or patch of skin that is growing, bleeding, or changing in any way. These issues can indicate skin cancer.For a few days after microdermabrasion, a person may notice:After the procedure, use sun protection. This will help to ensure the best results and reduce the risk of side effects. Microdermabrasion may not be suitable for people who scar easily or have cold sore breakouts.Most people do not need time to recover after microdermabrasion. If a person does experience side effects, they tend to disappear after a few days.In the majority of people, the skin will recover enough for another microdermabrasion session within a week.According to statistics from the American Society of Plastic Surgeons, the average cost of microdermabrasion in 2017 was $137.Prices vary, depending on:Even if a dermatologist performs the procedure, an insurance provider does not usually cover the cost.Many home microdermabrasion kits are available in stores or online. Spas and salons also offer the procedure.The AAD advise people to speak to a dermatologist before undergoing the procedure outside a clinical setting.This is to ensure that the person's skin is suitable for microdermabrasion and that they are not likely to experience complications. They will also tell the person how to deal with any side effects that may arise.Microdermabrasion is a cosmetic procedure. The aim is to make a person's complexion more even and smooth in texture and color.It usually requires a series of sessions, during which a specialist removes the top layer of skin with a small hand-held device.Many people use microdermabrasion to reduce the visible effects of aging or to eliminate patches left by acne.The procedure is noninvasive, but it can cause side effects. These include burning, stinging and swelling, as well as increased sensitivity to sunlight.A dermatologist or skin care specialist usually performs microdermabrasion, though home kits are available. Always speak to a dermatologist before undergoing microdermabrasion outside a clinic. Article last reviewed by Wed 24 October 2018.Visit our Dermatology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Dermatology.All references are available in the References tab.\t\t\nAgarwal, J., Kadakia, S., & Saman, M. (2016, September 19). Current concepts in dermabrasion therapy. The American Journal of Cosmetic Surgery, 33(3), 140–144. Retrieved from http://journals.sagepub.com/doi/abs/10.1177/0748806816656619?journalCode=acsaMicrodermabrasion: FAQs. (n.d.). Retrieved from https://www.aad.org/public/diseases/cosmetic-treatments/microdermabrasion#faqsMicrodermabrasion: Overview. (n.d.). Retrieved from https://www.aad.org/public/diseases/cosmetic-treatments/microdermabrasionMicrodermabrasion: Preparation. (n.d.). Retrieved from https://www.aad.org/public/diseases/cosmetic-treatments/microdermabrasion#preparationWhat is the cost of microdermabrasion? (n.d.). Retrieved from https://www.plasticsurgery.org/cosmetic-procedures/microdermabrasion/costPlease use one of the following formats to cite this article in your essay, paper or report:MLABarrell, Amanda. \"What to know about microdermabrasion.\" Medical News Today. MediLexicon, Intl., 24 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323443.php>APABarrell, A. (2018, October 24). \"What to know about microdermabrasion.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323443.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323443.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}