{"id": "Cannabis withdrawal can be 'highly disabling'", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.A recent study — led by the Columbia University Mailman School of Public Health and Columbia University Irving Medical Center, both in New York City, NY — set out to investigate what percentage of people who frequently use cannabis may experience cannabis withdrawal syndrome.This condition is included in the latest edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-5), which was published in 2013.According to the DSM-5, a formerly frequent user of the drug has cannabis withdrawal syndrome when they experience at least three of the following symptoms within a week from cessation:\"In a rapidly changing landscape of marijuana laws and attitudes,\" notes study author Prof. Deborah Hasin, \"cannabis use continues to increase among American adults.\"\"As a result,\" she adds, \"more information on the prevalence and correlates of clinical withdrawal in the general population is of critical importance.\"The researchers started from interviews with 36,309 participants who registered for the 2012–2013 National Epidemiologic Survey on Alcohol and Related Conditions-III, a national survey that takes into consideration clinically diagnosed cannabis withdrawal syndrome.For the study analysis, the investigators used data collected from 1,527 participants who identified as frequent cannabis users. This means that they used cannabis at least three times per week for 12 months before they took part in the interview.In their study paper, which appears in the journal Drug and Alcohol Dependence, the researchers report that, according to their analysis, 12 percent of people who frequently smoke marijuana experience cannabis withdrawal syndrome.The researchers also note that cannabis withdrawal symptoms appeared to be linked with mental disability and a family history of depression.Also, these symptoms were associated with a number of psychiatric disorders, including mood disorders, anxiety disorders (social phobia, agoraphobia, and panic disorder), personality disorders, and post-traumatic stress disorder.Of all the possible withdrawal symptoms, most frequently, the participants reported experiencing nervousness or anxiety (76 percent of the respondents), hostility (72 percent), sleep problems (68 percent), and depressed mood (59 percent of the respondents).Fewer participants reported having physical symptoms of cannabis withdrawal. In cases wherein physical symptoms did appear, the most commonly encountered were headaches, tremors, and sweating.The researchers came up with a \"profile\" of the person who uses cannabis frequently. Typically, they are male (66 percent of the participants), white (59 percent), young adults ages 18–29 (50 percent of the participants), college-educated (49 percent), never married (54 percent), and residing in a low-income household (45 percent).Cannabis withdrawal syndrome was not significantly associated with how often the volunteers used cannabis over the course of a week, but the investigators found that it was significantly associated with how many joints somebody smoked per day.A family history of drug or alcohol misuse did not appear to be linked with a person's likelihood of developing withdrawal symptoms. A family history of depression, however, was linked with cannabis withdrawal syndrome.\"Cannabis withdrawal syndrome is a highly disabling condition.\"Prof. Deborah HasinShe goes on to explain, \"The syndrome's shared symptoms with depressive and anxiety disorders call for clinician awareness of cannabis withdrawal symptoms and the factors associated with it to promote more effective treatment among frequent cannabis users.\"She is also particularly worried by the fact that new ways of using cannabis, such as in electronic cigarettes, may mean that users are not fully aware of just how much they are actually ingesting.\"Most users of the newer modes of administration — vaping and edibles — also smoke cannabis,\" Prof. Hasin notes. \"Therefore, for users in modes other than smoking, the amount of consumption could be underestimated,\" she warns.For this reason, Prof. Hasin suggests that specialists should aim to come up with a solid strategy that will allow them to better judge the impact of cannabis on an individual, depending on the concentration at which it is consumed.\"Given the increase in cannabis potency in recent decades,\" she continues, \"developing reliable measures to investigate the effect of cannabis concentration and mode of administration will be important in advancing our understanding of cannabis withdrawal syndrome.\"We picked linked items based on the quality of products, and list the pros and cons of each to help you determine which will work best for you. We partner with some of the companies that sell these products, which means Healthline UK and our partners may receive a portion of revenues if you make a purchase using a link(s) above.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323425.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}