{"id": "Treatments for anxiety", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Alcohol dependence, depression, and other conditions can sometimes have such a strong link to anxiety in some people that treating an anxiety disorder must wait until an individual manages any underlying conditions.Recognizing the developing symptoms of anxious feelings and taking steps to manage the condition without medical assistance should be the first port of call.However, if this does not reduce the impact of anxiety symptoms, or if the onset is particularly sudden or severe, other treatments are available.In some cases, a person can manage anxiety at home without clinical supervision. However, this may be limited to shorter and less severe periods of anxiety.Doctors recommend several exercises and techniques to cope with brief or focused bouts of anxiety, including:Standard treatment for anxiety involves psychological counseling and therapy.This might include psychotherapy, such as cognitive behavioral therapy (CBT) or a combination of therapy and counseling.CBT aims to recognize and alter the harmful thought patterns that can trigger an anxiety disorder and troublesome feelings, limit distorted thinking, and change the scale and intensity of reactions to stressors.This helps people manage the way their body and mind react to certain triggers.Psychotherapy is another treatment that involves talking with a trained mental health professional and working to the root of an anxiety disorder.Sessions might explore the triggers of anxiety and possible coping mechanisms.Several types of medication can support the treatment of an anxiety disorder.Other medicines might help control some of the physical and mental symptoms. These include:Tricyclics: This is a class of drugs that have demonstrated helpful effects on most anxiety disorders other than obsessive-compulsive disorder (OCD). These drugs are known to cause side effects, such as drowsiness, dizziness, and weight gain. Two examples of tricyclics are imipramine and clomipramine.Benzodiazepines: These are only available on prescription, but they can be highly addictive and would rarely be a first-line medication. These drugs tend not to cause many side effects, except for drowsiness and possible dependency. Diazepam, or Valium, is an example of a common benzodiazepine for people with anxiety.\nAnti-depressants: While people most commonly use anti-depressants to manage depression, they also feature in the treatment of many anxiety disorders. Serotonin reuptake inhibitors (SSRI) are one option, and they have fewer side effects than older anti-depressants. They are still likely to cause nausea and sexual dysfunction at the outset of treatment. Some types include fluoxetine and citalopram.Other medications that can reduce anxiety include:Stopping some medications, especially anti-depressants, can cause withdrawal symptoms, including brain zaps. These are painful jolts in the head that feel like shocks of electricity.An individual planning to adjust their approach to treating anxiety disorders after a long period of taking anti-depressants should consult their doctor about how best to move away from medications.If severe, adverse, or unexpected effects occur after taking any prescribed medications, be sure to update a physician.Although anxious feelings will always be present in daily life, there are ways to reduce the risk of a full-blown anxiety disorder.Taking the following steps will help keep anxious emotions in check and prevent the development of a disorder, including:Treating an anxiety disorder focuses on psychological therapy, medication, and lifestyle adjustments. Treatment will be different for each person depending on the type of anxiety disorder they have and the presence of any underlying conditions.Self-management is the first step for managing anxious feelings and often involves relaxation techniques, an active lifestyle, and effective time management. If these measures do not bring anxious reactions under control, visit a doctor and seek other avenues of treatment.If anxious reactions are severe from the outset, for example taking the form of panic attacks, seek treatment.Psychological therapies, including CBT, can help a person adjust the way they react to stressful life events and triggers, as well as the scale of the reaction. They can also help to limit distorted thinking and replace negative thoughts.Medications that can support treatment include tricyclic medications, anti-depressants, beta-blockers, and benzodiazepines. Speak to a doctor about any severe side effects or withdrawal symptoms after stopping. Article last reviewed by Thu  1 November 2018.Visit our Anxiety / Stress category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Anxiety / Stress.All references are available in the References tab.\t\t\nAnxiety disorders: Treatments and therapies. (n.d.). Retrieved from https://www.nimh.nih.gov/health/topics/anxiety-disorders/index.shtml#part_145338Please use one of the following formats to cite this article in your essay, paper or report:MLAFelman, Adam. \"Treatments for anxiety.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323494.php>APAFelman, A. (2018, November 2). \"Treatments for anxiety.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323494.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323494.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}