{"id": "What to know about aortic dissection", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Aortic dissection is a medical emergency. The condition can quickly become fatal if the blood breaks through the aorta's outer lining.Aortic dissection is not common. It affects between 5 and 30 people out of every 1 million each year, and it is most likely to affect older men.In this article, we describe the two types of aortic dissection, their symptoms and treatment options, and the outlook for people with this condition.Due to its symptoms, aortic dissection can resemble other high-risk conditions that are more common, so it can be challenging to diagnose.People with risk factors for aortic dissection, such as high blood pressure or a family history of aortic dissection, should have regular heart checkups with their doctor.Aortic dissection symptoms usually appear quickly after the tear occurs. They often resemble the symptoms of other heart problems and may include:Medical professionals may classify aortic dissection in other ways, including the following:Aortic dissection occurs when a weak section of the aorta wall rips or tears.Factors that increase a person's risk of aortic dissection include:Age and sexMost cases occur in men between the ages of 50 and 65 years, but both men and women of any age can develop the condition.Approximately two-thirds of people who experience aortic dissection are male. However, females tend to have worse outcomes.High blood pressureLong-term hypertension places greater pressure on the artery walls, making them more likely to tear.Certain genetic disordersPeople with specific genetic conditions have a higher risk of aortic dissection. These conditions include:An infectious or inflammatory conditionA syphilis infection or inflammation of the arteries, which can occur as a result of giant cell arteritis or Takayasu's arteritis, can increase the risk of aortic dissection.Other artery problemsHaving a preexisting aortic issue may increase the risk of the artery separating. These issues include:Trauma to the chestLess commonly, a severe chest injury may contribute to a tear in the aorta.PregnancyAortic dissections can occur during pregnancy in rare cases.Cocaine useCocaine raises blood pressure, which increases a person's risk of aortic dissection.High-intensity weightliftingIntense resistance training increases blood pressure, which may result in an aortic tear.People who develop any of the symptoms of aortic dissection or experience another cardiac event should call 911 immediately. Aortic dissection can have severe consequences, including organ failure or death, especially if a person does not receive urgent treatment.To diagnose aortic dissection, a doctor will take a medical history and carry out a physical examination. The signs and symptoms that will help them make a diagnosis include:Doctors will typically also carry out imaging tests to confirm or rule out a diagnosis of aortic dissection. These include:Additional tests, such as blood tests, may help the doctor rule out the possibility of other conditions and events with similar symptoms, including heart attack.Immediate medical treatment is necessary for aortic dissection to prevent complications or death. This treatment typically involves medications, surgery, or both.A doctor may give people with a type B aortic dissection beta-blockers and nitroprusside to lower their heart rate and blood pressure and to prevent the tear from getting worse.People with a type A aortic dissection might also take these medications to help stabilize their condition, but they typically require surgery as well to correct the tear.Most people who have an aortic dissection will need to take medications to reduce blood pressure for the rest of their lives.People with a type A aortic dissection will usually undergo surgery to remove the damaged section of the aorta and replace it with a tube. This procedure prevents blood from flowing into the aortic wall.The surgeon will also replace the aortic valve if it is leaking.People with type B aortic dissection may undergo a similar procedure, but their surgery may also include the use of stents, which are small mesh tubes, to repair the aorta.In addition to taking hypertension medications for life, people may need to have regular imaging scans to allow the doctor to monitor their condition.People who are at risk of developing aortic dissection, including those with a family history of the condition, can use lifestyle methods to reduce their risk. These include:Aortic dissection has a high rate of mortality. According to some sources, approximately 40 percent of people die after getting to the emergency department, and 20 to 30 percent of people die after surgery.The highest mortality rates occur within the first 10 days of aortic dissection.The likelihood of fatality increases by 1 percent for every hour a person goes without treatment.The condition can cause complications, such as:For the best chance of recovery, individuals should call 911 or go directly to the emergency department if they experience any of the symptoms of an aortic dissection. Early treatment can be life-saving. Article last reviewed by Tue 23 October 2018.Visit our Cardiovascular / Cardiology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Cardiovascular / Cardiology.All references are available in the References tab.\t\t\nLevy, D., & Le, J. K. (2018, August 24). Aortic, dissection. Retrieved from https://www.ncbi.nlm.nih.gov/books/NBK441963/Safi, H. J. (2018, September). Aortic dissection. Retrieved from https://bestpractice.bmj.com/topics/en-gb/445Strayer, R. J., Shearer, P. L., & Hermann, L. K. (2012, May). Screening, evaluation, and early management of acute aortic dissection in the ED. Current Cardiology Reviews, 8(2), 152–157. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3406274/Your aorta: The pulse of life. (2015, June 1). Retrieved from http://www.heart.org/en/health-topics/aortic-aneurysm/your-aorta-the-pulse-of-lifePlease use one of the following formats to cite this article in your essay, paper or report:MLALeonard, Jayne. \"What to know about aortic dissection.\" Medical News Today. MediLexicon, Intl., 24 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323435.php>APALeonard, J. (2018, October 24). \"What to know about aortic dissection.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323435.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323435.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}