{"id": "What's the link between cold weather and the common cold?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In this article, we examine the relationship between cold and wet weather and the common cold. We also cover some tips for preventing colds.According to the Centers for Disease Control and Prevention (CDC), millions of people develop the common cold each year in the United States alone. On average, adults get two or three colds a year.Many viruses can cause the common cold. Rhinoviruses are the most common cause and are responsible for more than half of all colds and cold-like illnesses.Rhinovirus infections typically result in mild cold-like symptoms. However, rhinoviruses can also cause more severe illnesses, such as bronchitis and pneumonia, in people with weakened immune systems.Rhinoviruses typically spread through:Once inhaled, the rhinovirus attaches itself to the cells inside the nasal passages. It then begins to replicate itself, spreading more virus particles throughout the upper respiratory tract.Some research suggests that rhinoviruses may replicate more efficiently at temperatures lower than 37°C, or 98.6°F, which is the average core body temperature in humans. The temperature inside the nasal cavity is approximately 33°C (91.4°F), which may make it an ideal breeding ground for rhinoviruses.Most research on rhinoviruses has primarily focused on examining how differences in body temperature affect the virus's ability to reproduce. However, more recent research is focusing on environmental factors that may increase a person's risk of developing a rhinovirus infection.One study examined whether or not variations in temperatures and humidity led to a higher risk of rhinovirus infection. The researchers found that decreases in both temperature and humidity over a 3-day period increased the risk of rhinovirus infections in participants.In the same study, researchers found that the majority of infections occurred in temperatures at zero (32°F) and below.Influenza viruses, which cause the flu, may also survive and spread more easily in cold and dry air. One study in guinea pigs suggests that the ideal temperature for the influenza virus to spread is 5°C (41°F).Many researchers believe that exposure to cold weather can adversely affect a person's immune response, making it harder for the body to fight off infections. Reasons for this may include:Some ways to avoid getting sick during the winter include:Viruses, such as rhinoviruses and influenza, cause colds and the flu, not the weather. However, exposure to cold weather can increase a person's risk of contracting a virus.Research suggests that these viruses may survive and reproduce more effectively at colder temperatures, making it easier for them to spread and infect more people. Cold weather may also reduce the immune response and make it harder for the body to fight off germs. Article last reviewed by Tue 23 October 2018.Visit our Flu / Cold / SARS category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Flu / Cold / SARS.All references are available in the References tab.\t\t\nAranow, C. (2011, August). Vitamin D and the immune system. Journal of Investigative Medicine, 59(6), 881–886. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3166406/#idm139736676964112titleCommon colds: Protect yourself and others. (2018, February, 12). Retrieved from https://www.cdc.gov/features/rhinoviruses/index.htmlFoxman, E. F., Storer, J. A., Fitzgerald, M. E., Wasik, B. R., Hou, L., Zhao, H., … Iwasaki, A. (2015, January, 5). Temperature-dependent innate defense against the common cold virus limits viral replication at warm temperature in mouse airway cells. Proceedings of the National Academy of Sciences of the United States of America, 112 (3), 827–832. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4311828/Ikäheimo, T. M., Jaakkola, K., Jokelainen, J., Saukkoriipi, A., Roivainen, M., Juvonen, R., … Jaakkola, J. J. K. (2016, September 2). A Decrease in Temperature and humidity precedes human rhinovirus infections in a cold climate. Viruses, 8 (9), 244. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5035958/Jacobs, S. E., Lamson, D. M., St. George, K., & Walsh, T. J. (2013, January, 26). Human Rhinoviruses. Clinical Microbiology Reviews, 26 (1), 135–162. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3553670/Lowen, A. C., & Steel, J. (2014, April, 30). Roles of Humidity and Temperature in Shaping Influenza Seasonality. Journal of Virology. 88, (14), 7692–7695. Retrieved from https://jvi.asm.org/content/jvi/88/14/7692.full.pdfMole, B. (2013, May 20). Cold viruses thrive in frosty conditions. Nature. Retrieved from https://www.nature.com/news/cold-viruses-thrive-in-frosty-conditions-1.13025Prietl, B., Treiber, G., Pieber, T. R., & Amrein, K. (2013, July, 5). Vitamin D and Immune Function. Nutrients, 5(7), 2502–2521. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3738984/Please use one of the following formats to cite this article in your essay, paper or report:MLAEske, Jamie. \"What's the link between cold weather and the common cold?.\" Medical News Today. MediLexicon, Intl., 23 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323431.php>APAEske, J. (2018, October 23). \"What's the link between cold weather and the common cold?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323431.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323431.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}