{"id": "Treating and managing lupus and preventing flares", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The cause remains unclear, and there is currently no cure, but some therapies can help to relieve symptoms, and lifestyle measure can improve a person's quality of life.There is no way to prevent lupus, but knowing what causes a flare can mean that a person with the condition can be better prepared when they occur.People should see a doctor if they often experience joint pain and stiffness, skin rashes, especially over the nose and cheeks, and fatigue. Weight loss, swollen glands, sensitivity to light, and poor circulation in the fingers are also signs that may indicate lupus.\nTreatment is available for lupus, but understanding how to prevent flares of this disease is very important to improve a person's overall quality of life.Here are some things that may reduce the risk of both the onset of lupus, in those who are at risk, and a flare-up.Exposure to sunlight can lead to rashes and other symptoms in some people with lupus, including fatigue, and joint pain.According to research published in 2014, photosensitivity is a common factor in cutaneous lupus erythematosus, and the American College of Rheumatology includes it in its diagnostic criteria for systemic lupus erythematosus (SLE).Not everyone with lupus has this sensitivity, but it is more common in people with lupus than those without the condition.For people who have a sensitivity to ultraviolet (UV) light, staying out of the sun can help reduce the risk of a flare-up.If this is unavoidable, people should use a high-factor sunscreen of 50+ that protects from both UVA and UVB, and wear clothes that cover the body.A number of prescription drugs can trigger symptoms, including:Genetics Home Reference note that in 10 percent of people with lupus, symptoms result from the use of medications. At least 80 medications can cause symptoms.An individual should always check with their doctor if any new medications are likely to cause a problem.For a person with an autoimmune condition, enhancing the immune system can be a problem. Foods such as garlic and alfalfa sprouts and supplements such as echinacea may have this property.People sometimes use such foods and supplements to prevent colds, for example, but people with lupus might find that they make symptoms worse, according to the Johns Hopkins Lupus Center.Researchers have found that cigarette smoke, alcohol, and some work-related and other chemicals appear to trigger genetic changes that can lead to lupus.People should avoid these as far as possible.Once a person has a diagnosis of lupus, the doctor or rheumatologist will develop a treatment plan based on the severity and location of their symptoms, as well as their age, sex, health, symptoms, and lifestyle.Lupus has many facets, and it affects individuals in different ways. For this reason, the doctor will tailor the treatment plan to the individual's needs. The plan may change over time as the condition develops.In developing a treatment plan, the doctor will aim to:Types of medications that people may use to treat lupus include:Some researchers have suggested that, since estrogen levels appear to fluctuate with lupus flares, estrogen therapy might one day be an option. However, more research is necessary before this can happen safely and effectively.Scientists published findings on a link between lupus and features of the gut microbiota in Applied Environmental Microbiology in 2018. These have led some scientists to predict that, in time, treatment might include fecal transplantation, dietary changes, and the use of live biotherapeutics.In fecal transplantation, a doctor applies a solution of feces — or poop — from a donor to the gut of another person, to try and change that person's gut flora, or the species in the gut that may be causing a health problem.A study in mice, published in 2017, indicated that changes in gut microbiota might alter the immune response in people with lupus nephritis.Live biotherapeutics refer to a type of treatment that contains a live microorganism. A person could use it, for example, to alter the balance of their gut microbiota.However, there is still some way to go until this happens.Specific medications may include:Hydroxychloroquine (Plaquenil): This is an antimalarial drug. It can help to keep mild lupus-related symptoms — such as fatigues, skin, and joint problems — under control.Cyclophosphamide (Cytoxan): This is a chemotherapy drug with powerful effects that can reduce the activity of the immune system. It can treat severe forms of lupus.Azathioprine (Imuran): This medication reduces the action of the immune system, for example, in people who have undergone an organ transplant, where there is a risk that the body may reject the transplanted organ. A doctor may prescribe it to treat the severe features of lupus.Methotrexate (Rheumatrex): This is another chemotherapy medication that can suppress the immune system. Doctors increasingly prescribe it for skin disease, arthritis, and other conditions that have not responded to other drugs.Cyclophosphamide (Cytoxan) and mycophenolate mofetil (CellCept): These are powerful chemotherapy drugs that can reduce the activity of the immune system. They treat more severe forms of lupus, especially lupus that affects the kidneys.Belimumab (Benlysta): This is a monoclonal antibody that reduces the activity of white blood cells (lymphocytes) that make autoantibodies.Rituximab (Rituxan): This is another monoclonal antibody that reduces the activity of white blood cells (lymphocytes) that make autoantibodies.Lupus is a complex condition. A team of specialists may provide treatment.At first, a person will probably see their family physician. The physician may then refer them to a rheumatologist. The rheumatologist can deal with inflammation that occurs in the joints due to the immune system not working properly.Other people who may play a role include:Dietitians, social workers, and other therapists may also be part of the team.Physical medicine and rehabilitation for lupus may involve:No research to date has confirmed that any specific alternative and complementary therapies can help relieve the symptoms of lupus, slow the disease process, or prevent organ damage.However, some people recommend:In a review of complementary therapies for lupus, published in 2014 in Current Rheumatology Reports, scientists noted that the following have shown promise in the treatment of systemic lupus erythematosus (SLE):They added that cognitive behavioral therapy (CBT) and some types of counseling may help to improve a person's mood and quality of life.Lifestyle approaches may help a person to cope with symptoms or reduce some of the stress associated with living with a chronic illness.Examples include:Anyone with lupus who is pregnant or planning to become pregnant should speak to a doctor as soon as possible. There is a risk of pregnancy loss or early delivery if symptoms are active.Rarely, a mother with lupus-related antibodies can pass these on to an unborn child, who may then be born with neonatal lupus.Seeking medical advice and support can help to reduce the risk of problems during pregnancy.In this video, Samantha, who has lupus, discusses how this affects her life.In the past, lupus was often deadly, but current treatment can relieve symptoms and delay the start of complications, increasing the chance for a normal lifespan.The United States National Institutes of Health note that, in the future, new ways of diagnosing lupus will mean that treatment can start earlier in the process, increasing the chances of reducing the long-term impact.The individual may find it helpful to join a local support group. A health worker may be able to advise on facilities.A doctor may also be able to advise on any clinical trials that are available. These can give access to new and experimental medications, for people who would like to try them.Find out more about lupus in our main article: What is lupus? Article last reviewed by Mon 12 November 2018.Visit our Lupus category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Lupus.All references are available in the References tab.\t\t\n825 studies found for lupus. (n.d.). Retrieved from https://www.clinicaltrials.gov/ct2/results?Search=Search&cntry1=&cond=&state1=&term=LupusGreco, C. M., Nakajima, C., & Manzi, S. (2014, November 1). Updated review of complementary and alternative medicine treatments for systemic lupus erythematosus. Current Rheumatology Reports, 5(11), 378. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3898893/Gupta, S., Allen-Vercoe, E., & Petrof, E. O. (2016, March). Fecal microbiota transplant: In perspective. Therapeutic Advances in Gastroenterology, 9(2), 229–239. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4749851/Kim, A., & Chong, B. F. (2013, February 1). Photosensitivity in cutaneous lupus erythematosus. Photodermatology, photoimmunology, and photomedicine, 29(1), 4–11. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3539182/ Luo, X. M., Edwards, M. R., Mu, Q., Yu, Y., Vieson, M. D., Reilly, C. M., … Bankole, A. A. (2018, January 31). Gut microbiota in human systemic lupus erythematosus and a mouse model of lupus [Abstract]. Applied Environmental Microbiology, 84(4), e02288–17. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/29196292Lupus. (2018, June 30). Retrieved from https://report.nih.gov/nihfactsheets/ViewFactSheet.aspx?csid=47Lupus. (2017, August 30). Retrieved from https://www.nhs.uk/conditions/lupus/Mak, A., & Tay, S. H. (2014, September). Environmental factors, toxicants, and systemic erythematosus. International Journal of Molecular Science, 15(9), 16043–16056. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4200809/Microbiome and live biotherapeutics explained. (2018, April 9). Retrieved from https://www.listlabs.com/blog/microbiome-and-live-biotherapeutics-explained/Mu, Q., Zhang, H., Liao, X., Lin, K., Liu, H., Edwards, M. R. ... Luo, X. M. (2017, July 11). Control of lupus nephritis by changes of gut microbiota Microbiome, 5, 73. Retrieved from https://microbiomejournal.biomedcentral.com/articles/10.1186/s40168-017-0300-8 Ruiz, L., López, P., Suárez, A., Sánchez, B., & Margolles, A. (2018, September 8). The role of gut microbiota in lupus: What we know in 2018? [Abstract]. Expert Review of Clinical Immunology, 14(10). Retrieved from https://www.tandfonline.com/doi/abs/10.1080/1744666X.2018.1519395?journalCode=ierm20SLE pathology and the role of the female estrogen hormone spotlighted. (2016, January 21). Retrieved from https://lupusnewstoday.com/2016/01/21/the-immune-system-is-a-natural-target-for-estrogen-action-opposing-effects-of-estrogen-in-two-prototypical-autoimmune-diseases/Systemic lupus erythematosus. (2018, October 30). Retrieved from https://ghr.nlm.nih.gov/condition/systemic-lupus-erythematosus?_ga=2.154019256.1682543888.1540977931-1911867496.1484152012Things to avoid. (n.d.). Retrieved from https://www.hopkinslupus.org/lupus-info/lifestyle-additional-information/avoid/Please use one of the following formats to cite this article in your essay, paper or report:MLABrazier, Yvette. \"Treating and managing lupus and preventing flares.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323665.php>APABrazier, Y. (2018, November 16). \"Treating and managing lupus and preventing flares.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323665.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323665.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}