{"id": "Vitamin D, fish oil supplements of little benefit to heart health", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The results of the first and second trial were presented at Scientific Sessions, held by the American Heart Institute (AHA) in Chicago, IL, and published in the New England Journal of Medicine.Vitamin D and fish oil supplements have lately been the subject of much hype in the medical research community, mass media, and among the general public, due to their alleged benefits in combatting cancer and heart disease.For example, recent studies in mice found that vitamin D benefits heart cells and suggested that the vitamin may prevent cardiovascular blockages.Other studies identified persistent links between a lack of vitamin D and the development of breast cancer and bowel cancer.Experts also believe that omega-3 fatty acids — which are in seafood, some nuts, and seeds — benefit the heart. The AHA, for example, recommend an intake of at least 2 servings of fish every week for optimal cardiovascular health.As a result, many Americans have turned to omega-3 fish oil supplements to stave off heart disease. A survey carried out by the National Institutes of Health (NIH) found that almost 19 million Americans are taking fish oil supplements.But do vitamin D and fish oil supplements really work?The two new studies were randomized, placebo-controlled trials led by Dr. JoAnn E. Manson, the chief of the division of preventive medicine at the Brigham and Women's Hospital in Boston, MA.The trials examined the effect of a daily intake of vitamin D and omega-3-containing fish oils on the prevention of heart disease and cancer.The studies involved almost 26,000 healthy adult participants, 20 percent of whom were African-American. None had a history of heart disease or cancer. The men in the study were at least 50 years old, and the women were at least 55.\nSome participants took a daily dosage of 2,000 international units of vitamin D and 1 gram of fish oil.Other participants received the same dosage of vitamin D plus a placebo, and others took the same daily dosage of fish oil with a placebo. The final group received two dosages of placebos.Dr. Manson and the team followed the participants for 5 years. By the end of the study period, they had found no overall benefits.In the first trial, they conclude:\"Supplementation with [omega-3] fatty acids did not result in a lower incidence of major cardiovascular events or cancer than placebo.\"In the second trial, they surmise that \"Supplementation with vitamin D did not result in a lower incidence of invasive cancer or cardiovascular events than placebo.\"Dr. Manson and the team did find a link between fish oil and a lower risk of heart attacks, particularly among people who did not eat fish regularly, as well as among African-Americans.Overall, fish oil supplements reduced the risk of a heart attack by approximately 28 percent. Among African-Americans, fish oil supplements lowered this risk by 77 percent, compared with participants who took only a placebo.Finally, the researchers found that no supplement involved in the trial led to severe side effects, such as bleeding, excessive calcium, or gastrointestinal problems.The New England Journal of Medicine also published an editorial related to the trials. In it, authors Dr. John F. Keaney and Dr. Clifford J. Rosen warn that the trials' \"positive\" results regarding fish oil supplementation and heart attack risk \"need to be interpreted with caution.\"They continue, noting that other large randomized trials of omega-3 fatty acids do not support these findings.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323652.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}