{"id": "Scientists confirm the role of 'molecular switch' in Parkinson's disease", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In the past week, the journal Open Biology published a report on the recent findings.Parkinson's is a brain disease that worsens over time. As it progresses, it makes talking and walking more difficult, and it can also affect behavior, sleep, thinking, and memory. Other symptoms include fatigue and depression.The disease arises from the loss of dopamine-producing cells in the brain.Dopamine is a brain chemical that, among other things, helps control motor function. This is why movement becomes increasingly disrupted as more dopamine cells stop working or die.Symptoms rarely appear in people younger than 60. However, in 5–10 percent of individuals with Parkinson's, symptoms occur before the age of 50.Most forms of early-onset Parkinson's disease tend to be inherited, and some are associated with gene mutations.In the United States, about 60,000 people learn that they have Parkinson's every year, and almost 1 million people in the country will be living with the disease by 2020.There is no cure for Parkinson's disease, and scientists do not know exactly what causes the loss or impairment of dopamine cells.The disease likely results from a combination of genetic and environmental factors.Research has already shown that when an enzyme called PINK1 detects defective mitochondria in cells, it switches on another enzyme, called Parkin. This results in the disposal of faulty mitochondria, and it protects the cells.Some people with early-onset Parkinson's disease have mutations in the genes that code for PINK1 and Parkin.Before the recent study, it was unclear whether the PINK1-Parkin switch occurred in the brain. Also, scientists were unsure whether the switch was disrupted in people with Parkinson's disease.Using genetically modified mice, researchers at the University of Dundee in the United Kingdom, together with colleagues at other European centers, confirmed that the PINK1-Parkin switch operates in the brain.The researchers then identified two people who had developed an early-onset form of Parkinson's disease. By testing their cells, the team confirmed that these individuals had a defective version of the PINK1-Parkin switch.The two participants also had the same rare genetic mutation that produces the faulty molecular switch.Study co-author Miratul Muqit, a professor in the School of Life Sciences at the University of Dundee, is grateful to the collaborators who \"helped identify these rare patients who have helped us finally answer this question.\"Researchers at the University of Helsinki in Finland tracked down one individual, and the other was identified in a study organized by the Michael J. Fox Foundation in the U.S.\"The probability of finding rare patients with the critical mutation to test in the lab was as low as 1 in 3 billion,\" Prof. Muqit explains.The mutation occurs in a precise location of the gene that codes for Parkin, and it prevents PINK1 from being able to switch Parkin on.The team expects that the study will spur further research into the molecular switch and the development of drugs to activate it.\n\"There is currently great interest to directly target PINK1 and Parkin as a potential therapy against Parkinson's, and this study strongly backs the rationale of this approach.\"Prof. Miratul MuqitYour privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323634.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}