{"id": "Herpes may account for 50 percent of Alzheimer's cases", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.The new paper, published in the Frontiers in Ageing Neuroscience journal, also suggests that antiviral drugs may reduce the risk of senile dementia — which is mostly caused by Alzheimer's disease — among people who have severe cases of herpes.Herpes simplex virus 1 (HSV1) is the type of herpes that results in cold sores.HSV1 is a common virus, and the majority of people will have contracted it by the time they reach old age.However, the virus remains permanently in the body and cannot be decisively removed either by the body's natural defense mechanisms or by drugs.The virus is inactive most of the time, but when a person has HSV1, they may find that flare-ups occur when they are stressed or sick, resulting in characteristic blisters.Medical News Today have reported on several studies this year alone that have provided evidence of a connection between Alzheimer's and herpes.In June, we looked at a study in which postmortem tests on brain tissue support a mechanistic link between Alzheimer's and the herpes viruses HHV-6A and HHV-7.And in July, we brought you news on a study that found the use of antiherpetic medication may dramatically reduce dementia risk.Study author Professor Ruth Itzhaki, from the University of Manchester in the United Kingdom, found in previous studies that cold sores caused by HSV1 are more prevalent among people that carry a gene variant called APOE-e4, which may increase a person's risk of developing Alzheimer's.\"HSV1 could account for 50 percent or more of Alzheimer's disease cases,\" she states.\n\"Our theory is that in APOE-e4 carriers, reactivation is more frequent or more harmful in HSV1-infected brain cells, which as a result accumulate damage that culminates in development of Alzheimer's.\"\n\nProf. Ruth Itzhaki\nFor this review, she looked at three recent studies on the relationship between Alzheimer's and herpes or chickenpox that analyzed population data from Taiwan, a country which enrolls almost all citizens in the National Health Insurance Research Database.Because this database is so comprehensive in collecting health data from the Taiwanese population, it has become an important resource for researchers who are interested in examining the relationships between microbial infections and diseases.Itzhaki says that these studies provide \"striking\" evidence that people who have herpes viruses are at a much higher risk of developing senile dementia.Also, the results of these studies suggest that the use of antiviral medication may result in \"a dramatic decrease\" in dementia risk.However, researchers need to conduct further studies to confirm that HSV1 causes Alzheimer's. So far, these studies can only show that there is a relationship between the two conditions.Despite this, Itzhaki believes that the data so far supports the case of using antiviral drugs to deter Alzheimer's.\"Considering that over 150 publications strongly support an HSV1 role in Alzheimer's,\" she says, \"these Taiwan findings greatly justify usage of antiherpes antivirals — which are safe and well-tolerated — to treat Alzheimer's disease.\"\"They also incentivize the development of an HSV1 vaccine, which would likely be the most effective treatment,\" the researcher adds.Itzhaki says she would like to now study dementia rates among people who have mild HSV1 or mild genital herpes because the findings from the studies based on the Taiwanese data only examine the link between dementia and severe HSV1 and chickenpox infections.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323383.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}