{"id": "Cancer: Could a 'universal' blood test make detection easier?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Cancer is one of the leading causes of death worldwide. According to the American Institute for Cancer Research, there were about 18 million cancer cases diagnosed around the world in 2018.The number of new cancer cases per year is expected to reach more than 23 million by 2030. The most common cancers globally are lung cancer, breast cancer, and colorectal cancer.Lung and breast cancers contributed to 12.3 percent of the 18 million cases diagnosed in 2018, with more than 2 million cases, respectively. Colorectal cancer is in third place with almost 2 million new cases diagnosed in 2018.Doctors can diagnose cancers in a variety of ways. The most common methods include laboratory tests (blood, urine, and others), biopsy, endoscopy, genetic tests, and imaging tests, such as X-ray, MRI, and ultrasound.Cancer data are alarming, and it is imperative to find new methods to detect cancer in the early stages.In the past years, researchers at the University of Bradford in the United Kingdom, have focused on a new \"universal\" blood test for earlier diagnosis of cancer.They believe that this new test could help detect cancer in people who doctors think may have the disease. The research team partnered with a tech company to bring this revolutionary blood test to market.\"This test is different from other universal cancer tests being developed because it is not looking for a specific biomarker or mutation. This is a generic test for cancer in an individual, regardless of the underlying mechanism that's causing their cancer.\"Lead researcher, Prof. Diana AndersonThe test measures the damage to the DNA of white blood cells after exposure to ultraviolet light. This process reveals the cells' susceptibility to damage and the presence of cancer.The damage takes the form of a \"comet tail\" of DNA pieces. If the tail is long, it means that cancer may be present. In other words, the DNA of people who have cancer is more easily damaged by ultraviolet light.In 2014, the Bradford team showed that they were able to identify samples from patients with three different types of cancer and they were successful in the identification of 93 percent of the cases.The researchers published their results in the FASEB BioAdvances journal.The problem came later when they tested 700 blood samples from people with colorectal and prostate cancer. They were unable to separate the samples with cancer from healthy samples in 60 cases.Professor Diana Anderson asked IMSTAR, a Paris-based tech company, to analyze the results to find out why the team had failed to detect cancer in these 60 cases.The researchers discovered that the system used in the inconclusive study was responsible for the failure. The IMSTAR Pathfinder system successfully separated all the samples with cancer from the healthy control group.\"I'm now convinced that if we used the powerful IMSTAR system to look at thousands of cells on all the slide samples in the trials, we would see a significant increase in the overall predictability beyond the 93 percent of the original 2014 study,\" declares Prof. Anderson.With the help of the IMSTAR advanced Pathfinder cell reader-analyzer, the Bradford team aims to create TumorScan, a powerful and highly effective test to detect cancer.The researchers are optimistic, and they believe that this test could change the future of cancer detection.\"We feel that we've taken it as far as we can in proving that the test works with high predictability for cancer outcome, and IMSTAR are the right partners to improve it still further,\" says co-first author Dr. Mojgan Najafzadeh.The IMSTAR team is excited to participate in the creation of this revolutionary method to diagnose cancer.IMSTAR's vice-president for medical applications Dr. Michel Soussaline confirmed that the company is working alongside the Bradford team, and they are planning to \"automate the full test workflow further\" to launch the product on the market.\"To bring a universal 'liquid biopsy' blood test for cancer to market, it must achieve a number of criteria, including high sensitivity and specificity and be fully automated with high throughput for a medical routine use. In addition, test results must be available in 24 hours and at an affordable cost,\" says IMSTAR's president, Dr. Françoise Soussaline.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323385.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}