{"id": "What to know about ferritin blood tests for anemia", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In this article, we discuss the ferritin blood test procedure and how to interpret the results.We also explain how people can raise or lower their blood ferritin levels.Doctors use ferritin blood tests to check the levels of iron in a person's blood and help diagnose many health conditions. These conditions include:People who have one of these conditions may require regular ferritin blood tests to monitor their health.A doctor may also order other blood tests to discover more about a person's iron stores. They may test for:After a doctor takes the blood sample, they will send it to a laboratory for testing. Once the laboratory technicians analyze the blood, they will typically send the results back within a few days of the test.Ferritin blood test results may come back as normal, low, or high. The following sections discuss what these results mean.Results will be given in nanograms per milliliter (ng/mL) of blood and can vary slightly from one laboratory to another.According to some sources, the normal ranges for ferritin in the blood are as follows:Other sources provide slightly different levels, with some research from 2008 suggesting that some laboratories consider ferritin levels over 200 ng/mL in women and 300 ng/mL in men to be abnormal.It is important that people confirm normal levels with their doctor or the laboratory that tested them.A result of low ferritin is strong evidence of an iron deficiency. The body requires iron to make hemoglobin, which is a protein in red blood cells that transfers oxygen from the lungs around the body.Without enough iron, a person may develop anemia.Iron is also necessary for:Iron-deficiency anemia can cause the following:Mild anemia may not produce any symptoms.Higher-than-normal ferritin levels may result from:People who have had several blood transfusions may also display high ferritin levels.A result of above-normal ferritin levels will require further testing to discover the underlying cause and help doctors determine the best course of treatment.Doctors treat low ferritin levels with oral iron supplements. For severe cases of anemia, a person may require treatment with intravenous iron.For the best results, people should take oral iron supplements with a source of vitamin C to increase iron absorption. They should avoid antacids, calcium supplements, and tea or coffee within 2 hours of an iron supplement.Typically, people will require follow-up blood tests to check that their ferritin levels and iron levels have returned to normal.If ferritin and blood iron levels do not return to normal following iron supplementation, a doctor may carry out additional testing to determine the cause of the deficiency and treat it accordingly.Potential causes of an iron deficiency include:The treatment for high ferritin levels depends on the underlying cause.For hereditary hemochromatosis, doctors typically recommend a person have their blood removed from their body, in a process called phlebotomy, on a regular basis.The amount of blood that the doctor removes, and how frequently they remove it, will vary depending on a person's age, health, and ferritin levels. At first, the person may require the removal of around 500 ml of blood weekly until their ferritin levels return to normal.These people will need treatment on an ongoing basis to maintain normal blood ferritin levels.Those with other conditions causing high ferritin levels may require additional treatments, such as medications or procedures, depending on the cause.A ferritin blood test follows a similar procedure to other types of blood test.Typically, a medical professional will begin by cleaning the skin around the puncture site using an alcohol-based solution. Usually, they will take the blood from a vein on the inside of the elbow.They may first wrap an elastic band around the upper arm to make the vein more prominent. They will then insert the needle, which is connected to a vacuum collection device, into the vein. People may feel a slight pinch as the needle enters the skin.Once they have collected the blood, the doctor will withdraw the needle and remove the elastic band if one is present.They will sometimes use some cotton wool or a bandage to stop any bleeding, before labeling the blood sample and sending it to a laboratory to be analyzed.The blood collection process only takes a few minutes. It is unlikely for a person to experience side effects, and when they do occur, they are typically mild. For example, some people may experience:People may wish to let the doctor know before the test if they are feeling anxious or uncomfortable.People do not usually need to make any special preparations for a ferritin blood test. However, if a person is also having other blood tests, they may need to fast for a certain period of time beforehand.Individuals should confirm these details with their doctor in the days leading up to the blood test.A ferritin blood test is a simple blood test to measure the levels of ferritin in a person's body. It is a very safe procedure that does not usually require any special preparations.Abnormal results may indicate an underlying issue, such as iron deficiency, hemochromatosis, or some types of cancer. Further testing is typically necessary to confirm a diagnosis and help formulate a treatment plan.If people are confused about the results of their ferritin blood test, they should follow up with their doctor, who can explain the results and their implications. Article last reviewed by Thu 15 November 2018.Visit our Blood / Hematology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Blood / Hematology.All references are available in the References tab.\t\t\nAdams, P. (2008, May). Management of elevated serum ferritin levels. Gastroenterology & Hepatology, 4(5), 333–334. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3093720/Ferritin (blood). (n.d.). Retrieved from https://www.urmc.rochester.edu/encyclopedia/content.aspx?contenttypeid=167&contentid=ferritin_bloodKoperdanova, M., & Cullis, J. O. (2015, August 3). Interpreting raised serum ferritin levels [Abstract]. BMJ, 351, h3692. Retrieved from https://www.bmj.com/content/351/bmj.h3692Please use one of the following formats to cite this article in your essay, paper or report:MLALeonard, Jayne. \"What to know about ferritin blood tests for anemia.\" Medical News Today. MediLexicon, Intl., 16 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323713.php>APALeonard, J. (2018, November 16). \"What to know about ferritin blood tests for anemia.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323713.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323713.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}