{"id": "What can cause red skin?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.In this article, we discuss several possible reasons for skin redness and when a person should see a doctor.Sunburn is a common cause of red skin and typically results from spending too much time in the sun without adequate protection. The ultraviolet rays from the sun damage the skin, which turns red as the body directs more blood to the affected area to repair the damage.Other symptoms can include:Learn more about sunburn here.There are many other ways, aside from sunburn, that a person's skin can become burned. Examples include:Any of these types of burns can cause the skin to turn red.Doctors class burns according to their severity:Learn more about first-degree burns here.Dermatitis, or eczema, refers to a group of inflammatory skin conditions. These conditions typically cause red, itchy patches of skin where inflammation has happened.Some common types of dermatitis are:Dermatitis can cause a range of other symptoms, including:Learn more about the different types of dermatitis here.Heat rash is when the skin becomes irritated from hot or humid conditions. The outbreak consists of red, itchy patches of skin with clusters of small, raised pimples. These patches can be uncomfortable and may cause a stinging or prickly sensation.Heat rashes often develop in areas where the skin folds and so skin-on-skin contact occurs, such as in the groin area or elbow creases.Learn more about heat rash here.Folliculitis is a common condition where hair follicles in the skin become inflamed. The inflammation is often the result of a bacterial or fungal infection.Folliculitis causes small clusters of red bumps to appear around the affected follicles, which may be itchy. The area can become tender, and pus-filled blisters may develop.Learn more about folliculitis here.Rosacea is a common condition that causes long-term redness of the skin, typically on the face. The condition usually begins with flushing, which is when the skin temporarily appears red.These episodes of flushing may last for longer periods of time as rosacea progresses and can become permanent. Others symptoms can include spots and burning or stinging sensations in the affected areas.Learn more about rosacea here.Psoriasis is a long-term condition that causes an overproduction of new skin cells, resulting in red, dry, crusty patches of skin with silvery scales.These patches tend to develop on the elbows, knees, or scalp but can appear anywhere on the body. The symptoms of psoriasis tend to come and go in cycles.Learn more about psoriasis here.Shingles is a viral infection that causes a red rash or blisters on the skin. The rash typically appears on the trunk but can affect any part of the body, including the face and eyes.Shingles usually begins with a burning or tingling sensation, which can be very painful in some cases. Fluid-filled blisters can also appear, often on just one side of the body.Only people who have previously had chicken pox can develop shingles.Learn more about shingles here.Lupus is a chronic condition where the immune system mistakenly attacks the body's organs and tissues.The condition can affect any part of the body, including the skin. Some people with lupus develop rashes on the face, neck, and scalp. These are typically butterfly-shaped areas of reddened, swollen skin.Learn more about lupus here.Some people can experience an allergic reaction after taking certain medications, such as:Drug allergies can cause:In severe cases, a drug allergy can cause anaphylaxis, which is a life-threatening condition.Symptoms of anaphylaxis may include:Call the emergency services or seek immediate medical attention for any signs of anaphylaxis.Cellulitis is a skin infection that can become severe if a person does not receive rapid treatment.Cellulitis occurs when bacteria infect deep layers of the skin and causes the area to become red, swollen, tender, and often warm to touch.Cellulitis can also cause fever-like symptoms, sometimes before the skin becomes affected. These symptoms can include:If left untreated, cellulitis can lead to severe complications, such as a blood infection.Learn more about cellulitis here.Scarlet fever is a contagious bacterial infection that typically affects infants and children. The infection causes a pinky-red rash that can feel rough. The rash usually starts on the chest but can spread to other areas of the body.Other symptoms of scarlet fever include:Learn more about scarlet fever here.It is not always necessary to see a doctor for skin redness. For example, a person can treat mild cases of sunburn at home by applying moisturizers and drinking plenty of fluids.However, some causes of red skin do require medical attention. Contact a doctor if the rash:There are many possible causes of skin redness, ranging from burns to allergic reactions and infections.People should see a doctor for red skin that lasts more than a few days or keeps reoccurring. Also, they should seek medical advice for rashes that are extremely painful or occur alongside more severe symptoms.Some skin conditions are long-term with symptoms returning in cycles. Treatment for these conditions may be lifelong and can involve both medications and lifestyle changes. Article last reviewed by Tue 30 October 2018.Visit our Dermatology category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Dermatology.All references are available in the References tab.\t\t\nAbout psoriasis. (2018, October 23). Retrieved from https://www.psoriasis.org/about-psoriasisAtopic dermatitis. (n.d.). Retrieved from https://www.aad.org/public/diseases/eczema/atopic-dermatitisCellulitis. (n.d.). Retrieved from https://www.aad.org/public/diseases/rashes/cellulitisDrug allergies. (2018, February 28). Retrieved from https://acaai.org/allergies/types/drug-allergiesFolliculitis. (2018, June). Retrieved from https://bestpractice.bmj.com/topics/en-gb/282Heat rash. (2017, June 27). Retrieved from https://familydoctor.org/condition/heat-rash/?adfree=trueHow to tell if a rash needs medical attention. (2015, August 13). Retrieved from https://www.aad.org/media/news-releases/how-to-tell-if-a-rash-needs-medical-attentionRosacea. (n.d.). Retrieved from https://www.aad.org/public/diseases/acne-and-rosacea/rosaceaScarlet fever: A group A streptococcal infection. (2018, January 22). Retrieved from https://www.cdc.gov/features/scarletfever/index.htmlSeborrheic dermatitis. (n.d.). Retrieved from https://nationaleczema.org/eczema/types-of-eczema/seborrheic-dermatitis/Shingles information page. (2018, June 27). Retrieved from https://www.ninds.nih.gov/Disorders/All-Disorders/Shingles-Information-PageSun exposure — sunburn. (2018, May 31). Retrieved from https://www.cdc.gov/niosh/topics/sunexposure/sunburn.htmlWhat is lupus? (2013, July 31). Retrieved from https://resources.lupus.org/entry/what-is-lupusPlease use one of the following formats to cite this article in your essay, paper or report:MLAKandola, Aaron. \"What can cause red skin?.\" Medical News Today. MediLexicon, Intl., 30 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323521.php>APAKandola, A. (2018, October 30). \"What can cause red skin?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323521.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323521.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}