{"id": "What to know about laparoscopy for infertility", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Laparoscopy can help a doctor diagnose many conditions that affect fertility, such as:Laparoscopy can also help when a woman has unexplained infertility. This is the diagnosis when results of other diagnostic tests were normal, but a woman is still unable to conceive.By taking a look at the reproductive organs, the doctor may be able to identify conditions that are preventing conception and are otherwise undetectable.A laparoscopy is a simple outpatient procedure. A person can undergo it in:A person will receive anesthesia before the procedure, so they will not be awake or able to feel pain. After giving them the anesthesia, a surgeon will:With the camera, the doctor will examine the structures in the abdomen. They will use the probe to move or lift organs out of the way.Depending on what the doctor sees, there may be other steps, including:They may make a third incision in the abdomen and insert instruments to perform these additional procedures.Finally, the surgeon will remove the tools and stitch up the incisions.A person will have to remain under observation for a few hours to make sure that there are no complications and that recovery is going well.Anyone who has undergone a laparoscopy should have someone else drive them home. Also, someone should stay with them for up to 24 hours after surgery.Some pain and discomfort are common after surgery, though it should be minimal.A person may experience pain in the shoulders or abdomen as the injected gas starts to dissipate.It can take a few days to relieve all of the gas and discomfort. Walking around and drinking peppermint tea can help.The doctor should provide discharge instructions with more information about what to expect during recovery.While rare, complications can occur after surgery. Anyone experiencing any of the following complications should contact the doctor right away or head to the nearest emergency room:Compared to other surgical procedures that can help a doctor diagnose the cause of infertility, a laparoscopy involves:Also, if a person receives treatment during the procedure, the chances of conceiving may increase right away.As with any surgical procedure, it is essential to consider the risks.Risks associated with laparoscopy include:In the past, laparoscopy was a standard diagnostic tool for women with unexplained infertility.The increased use of assisted reproductive technologies, such as in vitro fertilization (IVF), has led some doctors to recommend IVF right away, before laparoscopy.However, a doctor may still recommend laparoscopy if they believe that it can help.A person should discuss the procedure, and whether the potential benefits outweigh the risks, with their doctor.In many cases, a doctor can diagnose and even repair any issues during the laparoscopy.After the procedure, they will describe the results and present some possible next steps.If a person decides to try IVF or another fertility treatment, the doctor may recommend waiting several weeks or longer to allow the body to recover from the laparoscopy. Article last reviewed by Tue 30 October 2018.Visit our Fertility category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Fertility.All references are available in the References tab.\t\t\nLaparoscopy. (2015, July). Retrieved from https://www.acog.org/Patients/FAQs/LaparoscopyLaparoscopy surgery for infertility. (n.d.). Retrieved from https://www.advancedfertility.com/laparoscopy.htmMahran, A., Abdelraheim, A. R., Eissa, A., & Gadelrab, M. (2017, December). Does laparoscopy still has a role in modern fertility practice? International Journal of Reproductive BioMedicine, 15(12), 787–794. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5816239/Tsuji, I., Ami, K., Miyazaki, A., Hujinami, N., & Hoshiai, H. (2009, September). Benefit of diagnostic laparoscopy for patients with unexplained infertility and normal hysterosalpingography findings. Tohoku Journal of Exploratory Medicine, 219(1), 39–42. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/19713683Please use one of the following formats to cite this article in your essay, paper or report:MLAGalan, Nicole. \"What to know about laparoscopy for infertility.\" Medical News Today. MediLexicon, Intl., 30 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323511.php>APAGalan, N. (2018, October 30). \"What to know about laparoscopy for infertility.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323511.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323511.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}