{"id": "Major depression: Existing drug reduces symptoms by 45 percent", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.Depression affects about 300 million people across the globe, making the condition the \"leading cause of ill health and disability worldwide,\" according to the World Health Organization (WHO).In 2016 in the United States, over 10 million adults had at least one major depressive episode. Approximately 64 percent of these people had their lives severely impaired as a result.Despite the prevalence and severity of this condition, the current treatments are limited and often ineffective. Up to 30 percent of people with major depression are resistant to treatment.Furthermore, some studies have suggested that antidepressants may have a host of unexpected side effects, such as raising the risk of stroke and heart attack or that of premature mortality.Now, new research finds hope for treating major depression in an existing anticonvulsant drug called ezogabine.Scientists at the Icahn School of Medicine at Mount Sinai in New York City, NY, tested the drug in 18 participants who were having a major depressive episode but not taking any medication.Dr. James Murrough, the director of the Mood and Anxiety Disorders Program at the Icahn School of Medicine, is the senior author of the paper, which now appears in the journal Molecular Psychiatry. For the new research, Dr. Murrough and his colleagues drew from one of their previous studies, in which they showed that ezogabine, or retigabine, was successful in treating depression-like symptoms in mice.The drug is a potassium channel opener. As the researchers explain, previous studies have shown that potassium channels in the brain's ventral striatum — a region involved in processing reward — mediate the brain's resilience to depression.In the new study, Dr. Murrough and team administered up to 900 milligrams of ezogabine, orally, to 18 people with major depressive disorder for a period of 10 weeks.Using functional MRI scanners, the researchers examined the participants' brain circuitry pre- and post-treatment, looking to see whether the drug had had any effect on their brains' reward systems.The study revealed that ezogabine led to a 45 percent reduction in depressive symptoms, as measured by the activity in the brain's reward circuitry.More specifically, an \"[i]mprovement in depression was associated with decreased functional connectivity between the ventral caudate and clusters within the mid-cingulate cortex and posterior cingulate cortex,\" report the researchers.Also, a subgroup of participants showed improved reward learning after the treatment. The study's senior investigator comments on the findings, saying, \"The results of this study are exciting because we haven't had a new medicine to treat depression in decades.\"\"Most antidepressants are in the same class of drugs and work by increasing serotonin. Our research suggests a different molecular target that works through other brain mechanisms and could be helpful for patients.\"Dr. James Murrough\"We know that patients with depression become depressed for different reasons, and we've been stuck in a one-size-fits-all treatment for a long time,\" Dr. Murrough adds.\"A new class of medicines could give us an opportunity to treat patients based on the specific underlying cause of their disease.\"Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323562.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}