{"id": "Treatment options for COPD exacerbations", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.COPD is the name given to a group of long-term lung diseases. The condition tends to get worse over time and symptoms can include:People with COPD may occasionally notice that their symptoms suddenly get worse, or that new symptoms develop. Doctors refer to these periods as exacerbations, or flare-ups.In some people, certain things, such as an infection, a change in the weather, or exposure to irritants or allergens, can trigger an exacerbation.In this article, learn about some of the options for treating a COPD exacerbation. We also discuss the importance of treating exacerbations, when hospitalization may be necessary, and some tips for preventing exacerbations.Generally, the sooner a person begins treatment for a COPD exacerbation, the better. Several treatment options are available, including:Bronchodilators are medications that relax the muscles of the airways, which helps them open up. One of the most common bronchodilators that doctors prescribe for people with COPD is albuterol.A COPD exacerbation may result in increased chest tightness, wheezing, or shortness of breath. Taking medication to open the lungs, such as a bronchodilator, can help ease these symptoms.Bronchodilators typically come in the form of an inhaler device or a liquid. To take the liquid form, a person must use a machine called a nebulizer to turn the liquid into an aerosol or mist, which a person can then inhale into the lungs.Side effects of using a bronchodilator may include a faster heart rate, a headache, and shakiness.Increased inflammation of the lungs and airways can trigger a COPD exacerbation. Corticosteroids can help reduce this inflammation and relieve symptoms.Corticosteroids come in many forms, including tablets, inhaler devices, and injections. Corticosteroids that doctors commonly prescribe for the treatment of COPD exacerbations include prednisone and budesonide.Corticosteroids can cause systemic side effects, especially when a person takes them intravenously or orally. Systemic side effects can affect the whole body.Possible side effects include increased blood sugar, nervousness, and headache. Nebulized corticosteroids may cause hoarseness, dry mouth, or oral yeast infections.The best way to administer corticosteroids to treat a COPD exacerbation depends on the type and severity of symptoms. However, the results of a 2014 study suggest that nebulized corticosteroids may be as effective as intravenous corticosteroids but with fewer systemic side effects.People with COPD are more likely to develop a lung infection than those without the lung disease. These infections can lead to an exacerbation, and people with COPD may be more likely to experience complications from lung infections.If a doctor suspects that a person with COPD has a bacterial infection, they may prescribe them a course of antibiotics.The results of a 2013 study that involved 53,900 participants suggest that adding antibiotics to a treatment plan that also included corticosteroids may briefly improve symptoms for people in the hospital with a COPD exacerbation.A person's oxygen levels may decrease during a COPD exacerbation. Oxygen therapy can help improve oxygen levels in the blood and ease the related symptoms, such as shortness of breath.During oxygen therapy, a person will inhale oxygen from a machine through a mask or via nasal tubes. People can use an oxygen therapy machine at home.Noninvasive ventilation (NIV) is a type of respiratory support that can improve oxygen levels, inflate the lungs, and make breathing easier. NIV involves a machine that delivers pressure and oxygen to the lungs through a mask.Doctors will typically provide NIV to people in the hospital with a severe COPD exacerbation.A 2017 study reviewed 17 clinical trials that involved 1,264 people who were in the hospital with COPD. The researchers found that participants who underwent NIV had a 46 percent lower risk of death than those who did not undergo NIV.NIV treatment also reduced the length of hospital stays and lowered the risk of experiencing COPD-related complications.During intubation, a specialist will insert a breathing tube into a person's windpipe to allow for mechanical ventilation, or assisted breathing. The specialist will then connect the breathing tube to a ventilator, which is also known as a breathing machine or a respirator.Doctors may use a ventilator if a person is unable to breathe on their own, or their breathing is ineffective at removing carbon dioxide or oxygenating the lungs.The machine can deliver a set number of breaths per minute, a volume of air, and pressure to the lungs. It also delivers oxygen.It is critical for a person to begin treatment for a flare-up of COPD symptoms as soon as possible. Exacerbations can trigger a decrease in oxygen levels in the blood or issues removing carbon dioxide from the body, which can result in respiratory failure.Recognizing the signs of a COPD exacerbation quickly and seeking appropriate treatment may prevent a flare-up from becoming life-threatening.A person may treat a COPD exacerbation at home using oxygen and medications. However, there may be other cases in which hospitalization is needed.At the hospital, medical professionals can continuously monitor a person, as well as administer specialized treatment.Signs that a person with COPD may need to go to the hospital include:The following tips may help prevent or reduce COPD exacerbations:COPD exacerbations are events during which a person's symptoms suddenly become worse or new symptoms develop. Certain strategies, such as avoiding triggers, can help reduce the chance of experiencing a COPD exacerbation. However, it is not always possible to prevent them.Treatment depends on the type and severity of the exacerbation and can include bronchodilators, corticosteroids, antibiotics, oxygen therapy, and ventilation. Sometimes, a person may need more than one form of treatment.Prompt recognition and treatment of a COPD exacerbation can reduce the need for hospitalization and may lower the risk of complications. A doctor can provide a treatment and action plan for dealing with exacerbations. Article last reviewed by Tue 30 October 2018.Visit our COPD category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on COPD.All references are available in the References tab.\t\t\nCOPD. (n.d.). Retrieved from https://www.nhlbi.nih.gov/health-topics/copdOsadnik, C. R., Tee, V. S., Carson-Chahhoud, K. V., Picot, J., Wedzicha, J. A., & Smith, B. J. (2017, July 13). Non-invasive ventilation for the management of acute hypercapnic respiratory failure due to exacerbation of chronic obstructive pulmonary disease. Cochrane Database of Systematic Reviews, 7, CD004104. Retrieved from https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD004104.pub4/fullStefan, M. S., Rothberg, M. B., Shieh, M-S., Pekow, P. S., & Lindenauer, P. K. (2013, January). Association between antibiotic treatment and outcomes in patients hospitalized with acute exacerbation of COPD treated with systemic steroids. Chest, 143(1), 82–90. Retrieved from https://www.sciencedirect.com/science/article/pii/S0012369213600161Ucar, E. Y., Araz, O., Meral, M., Sonkaya, E., Saglam, L., Kaynar, H., . . . Akgun, M. (2014, March 28). Two different dosages of nebulized steroid versus parenteral steroid in the management of COPD exacerbations: A randomized control trial. Medical Science Monitor, 20, 513–520. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3976199/What is a COPD exacerbation? (n.d). Retrieved from https://www.copdfoundation.org/Learn-More/I-am-a-Person-with-COPD/Avoiding-Exacerbations-and-Pneumonia.aspxPlease use one of the following formats to cite this article in your essay, paper or report:MLAde Pietro, MaryAnn. \"Treatment options for COPD exacerbations.\" Medical News Today. MediLexicon, Intl., 30 Oct. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323522.php>APAde Pietro, M. (2018, October 30). \"Treatment options for COPD exacerbations.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323522.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323522.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}