{"id": "What is modern medicine?", "paragraph": "For full functionality, it is necessary to enable JavaScript. Here are instructions how to enable JavaScript in your web browser.\n\t\t\tHealthline Media, Inc. would like to process and share personal data (e.g., mobile ad id) and data about your use of our site (e.g., content interests) with our third party partners (see a current list) using cookies and similar automatic collection tools in order to a) personalize content and/or offers on our site or other sites, b) communicate with you upon request, and/or c) for additional reasons upon notice and, when applicable, with your consent.\n\t\t\tHealthline Media, Inc. is based in and operates this site from the United States. Any data you provide will be primarily stored and processed in the United States, pursuant to the laws of the United States, which may provide lesser privacy protections than European Economic Area countries.\n\t\t\n\t\t\tBy clicking “accept” below, you acknowledge and grant your consent for these activities unless and until you withdraw your consent using our rights request form. Learn more in our Privacy Policy.\n\t\tGet the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003Get the most out of Medical News Today. Subscribe to our Newsletter to recieve:MNT - Hourly Medical News Since 2003\n\t\t\t\t\t\t\tWe use cookies and similar technologies to improve your browsing experience, personalize content and offers, show targeted ads, analyze traffic, and better understand you. We may share your information with third-party partners for marketing purposes. To learn more and make choices about data use, visit our Advertising Policy and Privacy Policy. By clicking “Accept and Continue” below, (1) you consent to these activities unless and until you withdraw your consent using our rights request form, and (2) you consent to allow your data to be transferred, processed, and stored in the United States.\n\t\t\t\t\t\tLog in with your Medical News Today account to create or edit your custom homepage, catch-up on your opinions notifications and set your newsletter preferences.Sign up for a free Medical News Today account to customize your medical and health news experiences.During the 19th century, economic and industrial growth continued to develop, and people made many scientific discoveries and inventions.Scientists made rapid progress in identifying and preventing illnesses and in understanding how bacteria and viruses work.However, they still had a long way to go regarding the treatment and cures of infectious diseases.During the 19th century, the way that people were living and working was changing dramatically. These changes affected the risk of infectious diseases and other conditions.Meanwhile, scientific advances at that time started to make new treatments possible.The 19th and 20th centuries saw breakthroughs occurring in infection control. At the end of the 19th century, 30 percent of deaths were due to infection. By the end of the 20th century, this figure had fallen to less than 4 percent.Louis Pasteur (1822–1895), a chemist and microbiologist from France, was one of the founders of medical microbiology.As a professor of chemistry at the University of Lille, he and his team had the task of finding solutions to some of the problems that were affecting local industries.Pasteur showed that bacteria caused wine, beer, and milk to go sour. Boiling and cooling a liquid, he explained, would remove the bacteria.Together, Louis Pasteur and Claude Bernard (1813–1878) developed a technique for pasteurizing liquids.Claude Bernard was also the first scientist to suggest using \"blind\" experiments to make scientific observations more objective.Later, after investigating an epidemic among silkworms in the silk industry in the south of France, Pasteur determined that parasites were the cause. He recommended only using silkworm eggs that were healthy and had no parasites. This action resolved the epidemic, and the silk industry recovered.Pasteur was sure that pathogens attack the body from the outside. This was the germ theory of disease. However, many scientists could not believe that microscopic beings could harm and even kill people and other comparatively large species.Pasteur said that many diseases, including tuberculosis (TB), cholera, anthrax, and smallpox, happen when germs enter the body from the environment. He believed that vaccines could prevent such diseases and went on to develop a vaccine for rabies.Florence Nightingale (1820–1910) was a British nurse, statistician, and writer. She did pioneering nursing work while caring for wounded soldiers during the Crimean War.Nightingale was from a well-connected family. At first, they did not approve of her studying nursing. However, her parents eventually agreed that she could take a 3-month nursing course in Germany in 1851. By 1853, she was the superintendent of a women's hospital in Harley Street, London.The Crimean War broke out in 1854. Sidney Herbert, the Minister for War, asked Nightingale to lead a team of nurses in the military hospitals in Turkey. She arrived in Scutari, Turkey in 1854 with 34 nurses whom she had trained.Nightingale was shocked by what she saw. Exhausted medical staff members were tending to wounded soldiers in unbearable pain, many of whom were dying unnecessarily, while the officials in charge remained indifferent. A lack of medication and poor hygiene standards led to mass infection.Nightingale and her team worked tirelessly to improve hygiene and provide patient services, including cooking facilities and a laundry. Under her influence, the fatality rate fell by two-thirds.In 1860, Nightingale founded a training school for nurses in London. Nurses who trained there went on to work all over the United Kingdom.They took with them everything that they had learned about sanitation and hygiene, proper hospital planning, and the best ways to achieve health.Nightingale's work also marked a turning point for women, who took on a more significant role in medical care.Many of her practices still apply today.\n1800: British chemist and inventor Humphry Davy described the anesthetic properties of nitrous oxide, known as laughing gas.1816: Rene Laennec, a French doctor, invented the stethoscope and pioneered its use in the diagnosis of chest infections.1818: James Blundell, a British obstetrician, performed the first successful blood transfusion on a patient who had hemorrhaged.1842: Crawford Long, an American pharmacist and surgeon, was the first doctor to give a patient inhaled ether anesthesia for a surgical procedure.1847: A Hungarian doctor called Ignaz Semmelweis found that the incidence of \"childbed fever,\" or puerperal fever, fell considerably if health workers disinfected their hands before touching the woman during delivery. Childbed fever was fatal in 25 to 30 percent of sporadic cases and 70 to 80 percent of epidemic cases.1849: Elizabeth Blackwell, an American, became the first fully qualified female doctor in the United States and the first female to be on the U.K.'s Medical Register. She promoted the education of women in medicine.1867: Joseph Lister, a British surgeon and a pioneer of antiseptic surgery, successfully used phenol — then known as carbolic acid — to clean wounds and sterilize surgical instruments, resulting in a reduction in postoperative infections.1879: Pasteur produced the first laboratory-developed vaccine, which was against chicken cholera.1881: Pasteur developed an anthrax vaccine by attenuating the anthrax bacterium with carbolic acid. He demonstrated its effectiveness to the public using 50 sheep. All 25 of the unvaccinated sheep died, but only one vaccinated sheep perished, probably from an unrelated cause.1882: Pasteur managed to prevent rabies in Joseph Meister, a 9-year-old boy, using a postexposure vaccination.1890: Emil von Behring, a German physiologist, discovered antitoxins and used them to develop vaccines for diphtheria and tetanus. He later received the first Nobel Prize in Physiology or Medicine.1895: Wilhelm Conrad Röntgen, a German physicist, discovered X-rays by producing and detecting electromagnetic radiation in this wavelength range.1897: Chemists working in the German company Bayer AG produced the first Aspirin. It was a synthetic version of salicin, which they derived from the plant species Filipendula ulmaria (meadowsweet). Within 2 years, it became a global commercial success.1901: Karl Landsteiner, an Austrian biologist and physician, identified the different blood types and classified them into blood groups.1901: Alois Alzheimer, a German psychiatrist and neuropathologist, identified \"presenile dementia,\" later known as Alzheimer's disease.1903: A Dutch doctor and physiologist called Willem Einthoven invented the first practical electrocardiogram (ECG or EKG).1906: Frederick Hopkins, an English biochemist, discovered vitamins and suggested that vitamin deficiencies were the cause of scurvy and rickets.1907: Paul Ehrlich, a German doctor and scientist, developed a chemotherapeutic cure for sleeping sickness. His lab also discovered arsphenamine (Salvarsan), the first effective treatment for syphilis. These discoveries were the start of chemotherapy.1921: Medical scientists Sir Frederick Banting, a Canadian, and Charles Herbert Best, an American-Canadian, discovered insulin.1923–1927: Scientists discovered and used the first vaccines for diphtheria, pertussis (whooping cough), tuberculosis (TB), and tetanus.1928: Sir Alexander Fleming, a Scottish biologist and pharmacologist, discovered penicillin, which came from the mold Penicillium notatum. This discovery changed the course of history, saving millions of lives.1929: The German doctor Hans Berger discovered human electroencephalography, making him the first person to record brain waves.1932: Gerhard Domagk, a German pathologist and bacteriologist, developed a cure for streptococcal infections and created Prontosil, the first antibiotic on the market.1935: Max Theiler, a South African microbiologist, developed the first successful vaccine for yellow fever.1943: Willem J. Kolff, a Dutch doctor, built the world's first dialysis machine. He later pioneered artificial organs.1946: American pharmacologists Alfred G. Gilman and Louis S. Goodman discovered the first effective cancer chemotherapy drug, nitrogen mustard, after noticing that soldiers had abnormally low levels of white blood cells following exposure to nitrogen mustard.1948: American chemists Julius Axelrod and Bernard Brodie invented acetaminophen (paracetamol, Tylenol).1949: Daniel Darrow recommended using oral and intravenous rehydration solutions to treat diarrhea in infants. With Harold Harrison, he created the first electrolyte-glucose solution for clinical use.1952: Jonas Salk, an American medical researcher and virologist, invented the first polio vaccine. Salk was hailed as a \"miracle worker,\" because polio had become a serious public health problem in the U.S. after World War II.1953: Dr. John Heysham Gibbon, an American surgeon, invented the heart-lung machine. He also performed the first ever open-heart surgery, repairing an atrial septal defect, also known as a hole in the heart.1953: Swedish physicist Inge Edler invented medical ultrasonography (echocardiography).1954: Joseph Murray carried out the first human kidney transplant, which involved identical twins.1958: Rune Elmqvist, a doctor and engineer, developed the first implantable pacemaker. He also developed the first inkjet ECG printer.1959: Min Chueh Chang, a Chinese-American reproductive biologist, carried out the in vitro fertilization (IVF) that later led to the first \"test tube baby.\" Chang also contributed toward the development of the combined oral contraceptive pill, which the FDA approved in 1960.1960: A group of Americans developed the technique of cardiopulmonary resuscitation (CPR). They tested it successfully on a dog first, and the technique saved a child's life shortly afterward.1962: Sir James W. Black, a Scottish doctor and pharmacologist, invented the first beta-blocker after investigating how adrenaline affects the functioning of the human heart. The drug, Propranolol, is a treatment for heart disease. Black also developed cimetidine, a treatment for stomach ulcers.1963: Thomas Starzl, an American physician, performed the first human liver transplant, and James Hardy, an American surgeon, carried out the first human lung transplant.1963: Leo H. Sternbach, a Polish chemist, discovered diazepam (Valium). Throughout his career, Sternbach also discovered chlordiazepoxide (Librium), trimethaphan (Arfonad), clonazepam (Klonopin), flurazepam (Dalmane), flunitrazepam (Rohypnol), and nitrazepam (Mogadon). John Enders and colleagues developed the first measles vaccine.1965: Harry Martin Meyer, an American pediatric virologist, co-developed the rubella vaccine. It became available in 1970.1966: C. Walton Lillehei, an American surgeon, carried out the first successful human pancreas transplant. Lillehei also pioneered open-heart surgery, as well as new equipment, prostheses, and techniques for cardiothoracic surgery.1967: Christiaan Barnard, a South African cardiac surgeon, carried out the first human-to-human heart transplant. Maurice Hilleman, an American microbiologist and vaccinologist, produced the first mumps vaccine. Hilleman developed over 40 vaccines, more than anybody else.1970: Doctors used the first effective immunosuppressive drug, cyclosporine, in organ transplant procedures. Cyclosporine also treats psoriasis and other auto-immune conditions, including severe cases of rheumatoid arthritis.1971: Raymond Vahan Damadian, an Armenian-American medical doctor, discovered the use of magnetic resonance imaging (MRI) for medical diagnosis. In the same year, Sir Godfrey Hounsfield, a British electrical engineer, presented the computed tomography (CT or CAT) scan machine that he had developed.1978: Doctors recorded the last fatal case of smallpox.1979: George Hitchings, an American doctor, and Gertrude Elion, an American biochemist and pharmacologist, made important breakthroughs with antiviral medications. Their pioneering work eventually led to the development of azidothymidine (AZT), an HIV drug.1980: Dr. Baruch Samuel Blumberg, an American doctor, developed the hepatitis B diagnostic test and vaccine.1981: Bruce Reitz, an American cardiothoracic surgeon, successfully performed the first human heart-lung combined transplant procedure.1985: Kary Banks Mullis, an American biochemist, made improvements to the polymerase chain reaction (PCR), making it possible to generate thousands and possibly millions of copies of a specific DNA sequence.1985: Sir Alec John Jeffreys, a British geneticist, developed the techniques for DNA fingerprinting and profiling that forensic departments now use worldwide. These techniques also resolve problems not relating to crime, such as paternity disputes.1986: Eli Lilly launched fluoxetine (Prozac), a selective serotonin reuptake inhibitor (SSRI) class antidepressant that doctors prescribe for several mental health problems.1987: The U.S. Food and Drug Administration (FDA) approved the first statin, lovastatin (Mevacor). Statins can reduce LDL cholesterol levels by up to 60 percent, reducing the risk of heart disease and stroke.1998: James Alexander Thomson, an American developmental biologist, derived the first human embryonic stem cell line. He later found a way to create stem cells from human skin cells.2000: Scientists completed the draft Human Genome Project (HGP). The project involves collaborators from around the world.It aims to:The project may lead to the development of new medications and treatments to prevent or cure genetically-based diseases.2001: Dr. Kenneth Matsumura created the first bio-artificial liver. This could lead to scientists creating artificial livers for transplantation or other techniques that enable a damaged liver to renew itself.2005: Jean-Michel Dubernard, a French transplant specialist, carried out a partial face transplant on a woman whose face became disfigured as a result of a dog attack. In 2010, Spanish doctors carried out a full-face transplant on a man who had been in a shooting accident.Research continues to move medical science forward. Some of the areas that scientists are working on now include:Targeted cancer therapy: Doctors are starting to use a new class of drug called biologics to treat cancer and other diseases. Unlike conventional chemotherapy, which can destroy fast-growing healthy cells, these drugs target specific proteins on cancer cells and cause less damage to the whole body.HIV treatment: The effectiveness of HIV treatment is now such that people who take the medication regularly will not pass on the virus. The amount of the virus in their blood, known as viral load, is almost zero.Stem cell therapy: Scientists are working on making human tissue and even whole organs from stem cells. This technique could one day help in treatments ranging from wound healing to prosthetics and replacement livers.Gene therapy: A type of genetic engineering known as CRISPR gene editing may make it possible in the future to prevent genetic and inherited conditions, such as heart disease, leukemia, cystic fibrosis, and hemophilia.Robotics: Robotics and remote-controlled tools can already help surgeons carry out certain types of procedure. One day, surgeons may carry out all operations by controlling the movements of a surgical robot while looking at a monitor. This could enable greater precision and remove some of the risks of human error.On a different scale, medical supply companies have already used drones to deliver medicines to remote areas of the world.While modern medicine continues to make headway, some significant challenges remain.One is the upsurge of antibiotic resistance, partly in response to the overuse of antibiotics and also because pathogens, or germs, are adapting to resist them.Another is the increase in pollution and environmental hazards.While the 20th century saw a massive drop in fatalities from infection, future centuries could see that number rise again.It is not yet time to sit back and relax. Article last reviewed by Wed 31 October 2018.Visit our Medical Students / Training category page for the latest news on this subject, or sign up to our newsletter to receive the latest updates on Medical Students / Training.All references are available in the References tab.\t\t\nBosely, S. (2007, January 5). Milestones that showed the way to modern medicine. Retrieved from https://www.theguardian.com/science/2007/jan/05/medicineandhealth.healthFeingold, K. R., & Grunfield, C. (2016, August 10). Cholesterol lowering drugs. Endotext [Internet]. Retrieved from https://www.ncbi.nlm.nih.gov/books/NBK395573/Florence Nightingale. (2018, August 21). Retrieved from https://www.history.com/topics/womens-history/florence-nightingale-1Hajar, R. (2015, January–March). History of medicine timeline. Heart Views, 16(1), 43–45. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4379645/Hallett, C. (2005, January 1). The attempt to understand puerperal fever in the eighteenth and early nineteenth centuries: The influence of inflammation theory. Medical History 49(1): 1–28. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1088248/Louis Pasteur (1822–95). (n.d.). Retrieved from http://broughttolife.sciencemuseum.org.uk/broughttolife/people/louispasteurMeasles history. (2018, March 19). Retrieved from https://www.cdc.gov/measles/about/history.htmlMedical milestones: Celebrating key advances since 1840. (2007, January). The BMJ, 334(Suppl.), s1–22. Retrieved from https://www.bmj.com/content/suppl/2007/01/18/334.suppl_1.DC2/milestones.pdfNewman, L. (2005, April 30). Maurice Hilleman. The BMJ, 330(7498), 1028. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC557162/ Winners of the Nobel Prize for Physiology or Medicine. (2018, October 2). Retrieved from https://www.britannica.com/topic/Winners-of-the-Nobel-Prize-for-Physiology-or-Medicine-1856944Please use one of the following formats to cite this article in your essay, paper or report:MLAteam, MNT Editorial. \"What is modern medicine?.\" Medical News Today. MediLexicon, Intl., 2 Nov. 2018. Web.17 Nov. 2018. <https://www.medicalnewstoday.com/articles/323538.php>APAteam, M. (2018, November 2). \"What is modern medicine?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/323538.php.Please note: If no author information is provided, the source is cited instead.Your privacy is important to us.Healthline Media UK Ltd, Brighton, UK.© 2004-2018 All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.Privacy |\n\t\t\t\t\tTerms |\n\t\t\t\t\tAd policy | \n\t\t\t\t\tCareersThis page was printed from: https://www.medicalnewstoday.com/articles/323538.phpVisit www.medicalnewstoday.com for medical news and health news headlines posted throughout the day, every day.2018 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}