{"id": "Follow President Trump's rally in Wisconsin", "paragraph": "Follow CNN politicsOur live coverage of President Trump's Wisconsin rally has ended. Scroll through the posts below to see how it unfolded or visit CNN Politics.From CNN's Liz StarkPresident Donald Trump claimed tonight Democrats were encouraging caravans of migrants to \"violate our laws and to break into our country.\"“As we speak, the Democrat Party is openly encouraging caravan after caravan of illegal aliens to violate our laws and to break into our country,” Trump told the Wisconsin crowd.He emphasized that this is a “crisis on the border” and continued to blame Democrats for immigration policies in the US. “Right now is the sole result of Democrat laws and activist Democrat judges that do whatever they want and that prevent us from returning illegal aliens back home to Central America and other parts of the world.”Some background: US officials have been keeping their eyes on a caravan that's forming in El Salvador, a Department of Homeland Security official told CNN on Tuesday. And another migrant caravan of around 2,000 people entered Guatemala from Honduras and is expected to reach Guatemala City on Wednesday.US-bound migrant caravans are not uncommon, as Central Americans desperate to escape violence and poverty band together for safety on the road. Some advocates also use the mass movements to help draw attention to political causes.But the formation of new caravans in Central America comes as political pressure mounts over a convoy of thousands of people now transiting Mexico, en route from Honduras to the United States. That caravan has drawn the ire of the President, who in an apparent fear campaign aimed at boosting turnout in the November 6 midterm elections. Trump has blamed Democrats, without evidence, for pushing for overrun borders.From CNNs Betsy KleinPresident Trump vowed tonight to protect Americans with pre-existing conditions, even though his administration’s actions say otherwise.“The Democratic healthcare plan would obliterate Medicare and terminate Medicare Advantage for nearly half a million seniors here in Wisconsin,” he said, vowing that “Republicans want to protect Medicare.”Trump also railed against Obamacare, and said “essentially, we’ve dismantled it.”“It’s been brought down to size — if you’ve noticed your premiums are going up. They’re going up very little by comparison” to how much they would have gone up if Obamacare provisions had stayed in place, he said.Why this matters: A Democratic measure aimed at eliminating short-term health care plans that don't have to cover pre-existing conditions failed in the Senate earlier this month. Maine Sen. Susan Collins was the sole Republican to vote for the measure. The resolution was aimed at rebuffing a Trump executive order unveiled in August that made it easier to buy these plans.The White House supported several Obamacare repeal bills, including one in the House of Representatives that advocates argued weakened coverage of pre-existing conditions. Several moderate Republicans in the House of Representatives even cited a lack of protections for people with pre-existing conditions as a reason they voted \"no.\"From CNN's Betsy KleinPresident Donald Trump heaped praise on another onetime 2016 rival — Wisconsin Gov. Scott Walker, whom he brought to the stage during his rally.“Scott Walker is a tireless warrior,” Trump said, prompting a “four more years” chant from the crowd.“We are so happy to have you back here in the state of Wisconsin,” Walker told Trump after taking the stage.Walker said the President called him recently while he was campaigning alongside Vice President Mike Pence and asked him where to go. “I said Wausau,” Walker said. “Pretty good crowd here tonight.”The governor touted record unemployment rates, taxes, and the Foxconn investment. (The company is expected to spend at least $9 billion building a plant in Wisconsin that will employ thousands of workers making screens for devices.)Walker also made sure to use the opportunity to talk about healthcare and pre-existing conditions.“The President mentioned my wife, Tonette, who does a super job. She’s got Type 1 diabetes. I want to reinforce it: we will always cover people like my wife with pre-existing medical conditions, don’t believe the lies, don’t believe the lies,” he said.From CNN's Betsy KleinFormer Trump administration chief of staff Reince Priebus is at the rally tonight in his native Wisconsin, receiving a shoutout from President Trump.“It took us about five years to figure out how the hell to pronounce his name,” Trump joked in Mosinee. Trump said Priebus is “doing fantastically well” and remarked that he is loved in both   Washington and Wisconsin.“Really talented guy,” he said of the former GOP chairman.He added: “Great guy, we had a lot of fun. That was a lot of fun. And he loves this place.”From CNN's Liz StarkAfter criticizing Democrats on taxes, President Donald Trump reflected on how “nice” he was being at his rally in Wisconsin.“And hopefully we can keep it that way, right? We’re going to keep it that way,” he added.From CNN's Eric BradnerPresident Donald Trump pointed the finger Wednesday night at Democrats and the news media for the turbulent national political environment, on the same day explosive devices were mailed to the Obamas, the Clintons, CNN and other public officials.Trump took no responsibility for the tone of the political discourse.During a rally in Wisconsin, the President promised to bring those responsible for mailing the explosive devices to justice.\"Any acts or threats of political violence are an attack on our democracy itself. No nation can succeed that tolerates violence or the threat of violence as a method of political intimidation, corrosion or control, we all know that. Such conduct much be fiercely opposed and firmly prosecuted,\" he said.\"We want all sides to come together in peace and harmony. We can do it. We can do it. We can do it. It'll happen.\"Then he pivoted, saying those in the political arena \"must stop treating political opponents as being morally defective.\"\"The language of moral condemnation and destructive, routine -- these are arguments and disagreements that have to stop,\" he said.He complained of \"mobs\" -- a reference to protesters, who opposed Brett Kavanaugh's Supreme Court nomination and confronted Republican senators on Capitol Hill, and who have challenged GOP lawmakers and Trump Cabinet officials at restaurants and in public.\"No one should carelessly compare political opponents to historical villains, which is done often and all the time. It's got to stop. We should not mob people in public spaces or destroy public property. There is one way to settle our disagreements -- it's called peacefully, at the ballot box. That's what we want,\" Trump said.He then said it's the news media's responsibility to set the national political tone.\"The media also has a responsibility to set a civil tone and to stop the endless hostility and constant negative and oftentimes false attacks and stories. Have to do it,\" he said.Trump took no responsibility for his own rhetoric -- which has included attacks on news outlets and Democratic opponents, as well as moments like a recent rally in Montana where he praised a Republican congressman who pleaded guilty to charges stemming from his body-slamming a reporter.From CNN's Betsy KleinPresident Donald Trump vowed an “aggressive investigation\" into the attempted attacks on former Presidents Clinton and Obama, as well as other former government officials and CNN.“Any acts or threats of political violence are an attack on our democracy itself. No nation can succeed that tolerates violence or the threat of violence as a method of political intimidation or coercion or control, we all know that. Such conduct must be fiercely opposed and firmly prosecuted,” he said.But he then pivoted to calling for people on “all sides” to come together.“For example, those engaged in the political arena must stop treating political opponents as being morally defective. Have to do that,\" he said. Trump continued: \"The language of moral condemnation and destructive routine, these are arguments and disagreements that have to stop. No one should carelessly compare political opponents to historical villains, which is done often, it’s done all the time. Gotta stop. We should not mob people in public spaces or destroy public property. There is one way to settle our disagreements, it’s called peacefully at the ballot box.\" And then he had a message for the media.President Trump opened tonight's rally by addressing the bombs and suspicious package that were intercepted.\"My highest duty, as you know, as President, is to keep America safe. That's what we talk about. That's what we do,\" he said. \"The federal government is conducting an aggressive investigation and we will find those responsible and we will bring them to justice. Hopefully very quickly. Any acts or threats of political violence are an attack on our democracy, itself.\"Trump continued: \"No nation can succeed that tolerates violence or the threat of violence as a method of political intimidation, coercion, or control. We all know that. Such conduct must be fiercely opposed and firmly prosecuted. We want all sides to come together in peace and harmony. We can do it. We can do it. We can do it. It will happen.\"Follow CNN politicsPlease enable JavaScript for a better experience."}