{"id": "Esther McVey so 'hysterical and aggressive' in Cabinet minister 'thought they needed security'", "paragraph": "The former Work and Pensions Secretary quit Theresa May's Cabinet over the proposed Brexit deal and has been replaced by former Home Secretary Amber RuddCabinet ministers were so concerned by Esther McVey 's behaviour during the crunch Brexit Cabinet meeting they thought security might have to be called, it has been claimed.Mcvey, who resigned from the Government on Wednesday in protest at Theresa May’s Brexit deal – is reported to have been embroiled in a furious confrontation with the Prime Minister during the mammoth five-hour meeting on Wednesday afternoon.The former Work and Pensions Secretary demanded a vote to formally record Ministers’ positions on the deal, according to the Mail on Sunday who quote a \"senior figure present\".Ms McVey has denied that she was in tears and told the paper: \"I’m made of much sterner stuff than that.\"But one Minister present told The Mail on Sunday: ‘It was the most extraordinary meltdown I’ve seen in Cabinet. I thought security would have to be called, because she seemed so hysterical and aggressive.\"The Prime Minister tried to talk to her, but it was all just empty waffle which Esther talked over. So Julian [Smith, Chief Whip], just started shouting at her to shut up.’The Mail also reports that Cabinet Secretary Mark Sedwill objected to Ms McVey’s call for a vote to 'put on record where everyone stood'.Downing Street was left shaken by the resignations of Brexit secretary Dominic Raab and Ms Mcvey the day after the draft of the deal was made public.But Michael Gove remained in post along with other Brexiteers such as Chris Grayling and Andrea Leadsom.In her resignation letter, Ms McVey said: \"The deal you put before the Cabinet yesterday does not honour the result of the referendum. Indeed, it doesn’t meet the tests you set from the outset of your Premiership.\"She added that the deal would prevent future governments from striking free trade deals and ‘threatens the integrity of the United Kingdom’.But May continues to back the deal and says it delivers on the result of the referendum. Although still in the Cabinet, Andrea Leadsom is said the leading a 'gang of five' including Grayling, Penny Mourdaunt, Liam Fox and Michael Gove in a bid to re-write the deal. Ms McVey has been replaced at the DWP by former Amber Rudd, who resigned as Home Secretary after admitting she misled parliament regarding the Windrush scandal.However a subsequent review said she had been let down by officials."}