{"id": "Nigel Benn and Chris Eubank set to return to ring 25 years after their last fight", "paragraph": "The British boxing legends first fought 25 years ago Boxing legends Nigel Benn and Chris Eubank are lining up a sensational return to the ring - 25 years after they last went toe-to-toe. A money-spinning bout is being considered as the pair prepare for one final fight. An announcement could come next week.But they will have to satisfy the boxing authorities they are fit to fight and would need a licence from the British Boxing Board of Control (BBBC).The possibility of a clash comes just months after Benn challenged Steve Collins, 52, who held the WBO world title at both middleweight and super-middleweight, to a fight.Eubank Snr, 52, and Benn, 54, had two monumental fights in the 1990s. Eubank won the first fight by knockout in 1990. They last fought in October 1993 when the encounter was dubbed “Judgement Day” and 17.5 million Britons tuned in to watch.That night 42,000 fans crammed into Old Trafford in what was seen as one of the biggest fights in British boxing history.Speaking earlier this year about the 1993 fight which ended in a draw, Eubank said: “We were well aware that bad blood creates big audiences.“But what holds the audience is authenticity. Both of us were the real thing. The public knows it when they see it.”Eubank Snr and Benn could potentially fight as early as April next year. They both have children who have taken up professional boxing.Chris Eubank Jnr, 29, is a former IBO super-middleweight champ, while Conor Benn, 22, competes in the welterweight category.Confirming an announcement is due imminently, a source close to Benn's camp said: “This fight has been in the making for three and a half years, on and off, on and off.“Nigel is travelling to Spain this week to do a Q&A and he will be making a big announcement.”If Eubank Snr and Benn were denied a licence to fight by the BBBC, there may be “other avenues” for getting the fight sanctioned.British fighters David Haye and Dereck Chisora obtained clearance from Luxembourg’s boxing federation prior to their fight at Upton Park in July 2012.The news comes weeks after it emerged Eubank Snr has reportedly joined a police force in the US - despite being arrested twice in the UK.He accepted a role as a city marshal in Opelousas, Louisiana.Eubank is giving lectures on how to “peacefully defuse difficult situations” after getting the role through “a friend of a friend”. However the ex-world super-middleweight, who was declared bankrupt in 2005 over an unpaid £1.3million tax bill, has had no formal training."}