{"id": "Freddie Ljungberg reveals how Unai Emery has transformed Arsenal", "paragraph": "The Gunners are currently on a 16-match unbeaten run as they look to finish in the Premier League top fourUani Emery is re-schooling Arsenal’s ­players to ensure they are fit for new ­European diplomas, according to Gunners graduate Freddie Ljungberg.After years under The Professor, Arsene Wenger, the squad are being re-educated by Emery, says Ljungberg, who went back to the club this summer to become their Under-23s coach.It’s a shift that combines high energy and ­aggression with the free-flowing passing always demanded by Wenger.But it’s football with a purpose, insists ­Ljungberg – where players’ actions are far more scrutinized and with the Emery method running from the bottom rungs right through to the first team at the top.“There have certainly been some changes at the club since Arsene left,” said Ljungberg, the Swede who was once a member of Wenger’s Invincibles of 2003-04 and who did his own finishing school at Wolfsburg in the Bundesliga before returning to London.“Unai is very calm, composed and ­extremely detailed in what he ­expects. From Monday through to Friday, every single training session is very carefully planned.“There is always a thought process to what the players are doing and the players have to be open-minded. They need to know their roles and what is expected of them.“We speak regularly – and always after every U-23 game – because he wants that connection and for the teams below to replicate what ­happens in the first team.“That’s fine for me because our principles are quite similar about how the game should be played – players who can play out from the back and not feel uncomfortable in any situation on the field. It’s detailed, with lots of ­information, but the philosophy is simple.”Arsenal went into the ­international break on the back of three successive draws, but they are unbeaten since ­August 18 – a ­16-match run that serves as evidence of Emery’s energetic impact.The Spaniard has made players train at a higher intensity than under Wenger, with a greater stress on physical strength and ­conditioning. The result is a team that now ­regularly finishes games on top, although they are still to overcome their habit of starting slowly.The tone is more demanding and less forgiving than under Wenger. But then Emery, 47, is a much younger man – in much more of a hurry.Nor has the former PSG boss been unafraid to puncture some inflated egos, with Mesut Ozil and Aaron Ramsey both being substituted and an enthusiasm to give youngsters, such as Emile Smith Rowe, Julio Pleguezuelo and Ainsley ­Maitland-Niles a taste of first-team action.That suits Ljungberg, who sees his role as the provider of fresh faces, regardless of the impact on his own U-23 team.“My job is to get as many players up into the first team as possible. He can take as many as he wants,” he added.“The important thing is to make sure the boys are ready because he is a manager who believes in young players and what they can do.“That has always been a feature of successful Arsenal teams. I want to provide players who can go up because they have the ability. But they will also have to know how to do the dirty stuff, at times, when they need to dig deep.“The manager wants players who are ready to make their mark, but they have to be able to be part of a ­structure. That’s the way he is. He wants players who can ­express themselves, but within a ­discipline. He has come in with new ideas, with ­energy and he wants to make the club better.”Another early stress-tester of that objective will be Arsenal’s next two Premier League games – against the clubs ­immediately below and above them in the table – Bournemouth, followed by Emery’s first North London derby against Spurs."}