{"id": "Couple told to say goodbye to son born at 24 weeks reveal incredible recovery", "paragraph": "Noah has suffered two cardiac arrests, more than 20 blood transfusions, undergone heart surgery and overcome more than eight infections after his birth at Liverpool Women's HospitalA couple who were told to say goodbye to their baby boy just moments after he was born premature at 24 weeks have spoken about his \"rollercoaster\" recovery.Noah has suffered two cardiac arrests, more than 20 blood transfusions, undergone heart surgery and overcome more than eight infections in his tiny 127 day life.He also had bleeds on the brain, acute renal failure and five lumbar punctures - but dad Paul Gleeson said these were only a few of the procedures the brave little boy managed to pull through.Paul, 39, and wife Emma's ordeal began when she started bleeding in July this year, reports the Liverpool Echo.Emma, 27, rushed to hospital and was told she would have to deliver him just short of 16 weeks early.Doctors at Liverpool Women's Hospital had tried a number of procedures to delay labour, but they soon realised delivering Noah early was the only option.Paul said: \"It was scary. We then had to make decisions about what our wishes were if things went wrong in labour with Noah. We had to make this decision quick.\"We were told a c section would cause a high risk to Emma and not benefit Noah.\"We told them if he needed resuscitating to try everything they could but then we did not want Noah to be put through anything that was not beneficial for him.\"After Emma gave birth we thought things were going to be OK as doctors showed us Noah so for the first time we relaxed. But then they said to come through and say goodbye.\"I went through and there were doctors working on Noah at the same time. He had been taken into intensive care and was in an incubator which had steamed up due to the ventilator pumping fast air into the baby.\"It wasn't nice to see any baby like that never mind your own. The doctors were amazing with us and Noah. They did everything they could, even helping us to get him baptised that night.\"After this I went back into our room and we were just devastated, Noah was our first child, he was our dream and we were devatasted.\"Thankfully, Noah exceeded doctors expectations and survived his first night, and his second, his third and so on.After being born on July 14, 2018 Noah remained in hospital for 111 days.Paul listed all the things his son went through during this time, including two cardiac arrests, a double resuscitation, more than 20 blood transfusions, more than eight infections and heart surgery.He also said he had bleeds on the brain, acute renal failure, five lumbar punctures - but he admitted this list is only what he could remember after their rollercoaster journey.Paul added: \"It seems short listing it like that, but experiencing it was very difficult.\"During the first month, there was a worry Noah just wouldn’t make it. At one point he was on the max of every medication he could be on and was just stable.\"Should he have become unstable, we would have had to have a different conversation about making him comfortable. However Noah being a fighter, never gave up.\"Every time a nurse went off shift you could tell they didn't expect to see him again.\"It was two weeks after he was born we got our first bit of hope as Noah made the smallest bit of progress.\"It was strange because once we got this first bit of hope then everyday we were getting a bit more good news.\"It was three weeks before we could hold him, which was difficult. Because of all the tubes it was a two nurse job to get him out of the incubator.\"They always said on the unit that it is a rollercoaster journey and that is what it was.\"After battling against the odds, Noah was finally allowed home on November 1 - the date he was due to born.Paul added: \"He's amazing. We are very lucky that he has came through with very little problems.\"He came home on a tube of oxygen and we need to be extra careful over the winter months as if he gets a common cold it get put him back in hospital.\"He has Chronic Lung Disease but doctors believe he should outgrow this as he gets older.\"When he was in hospital our family moved baby stuff we had bought out of our house in case he never made it. So it's been nice being home and being able to get it back and start doing the baby room.\"Before we left even the doctors and nurses who had treated Noah were surprised how well he has done.\"We have so much appreciation and thanks to the Liverpool Women's Hospital and the Neonatal unit, the nurses and the doctors on the unit do amazing work for all the babies whilst supporting us parents too during what is the most difficult time for any parent.\"Without their love, care and support Noah would not be here for anyone to show any interest.\"Paul and Emma decided to set up an Instagram account documenting Noah's journey in a bid to help others in a similar situation.Speaking about their decision Paul said: \"We originally created Noah’s Instagram account so we could update friends and family on his journey.\"We found lots of people messaging us for updates which was upsetting especially in the early days, so we thought we would do this to document his journey and share with our family and friends.\"It soon grew to friends of friends and everyone was interested and hoping for the best for Noah.\"Our thoughts with it now is to continue to update Noah’s journey and development now he’s home and more importantly hopefully provide hope and comfort to other premature parents who, like us, would be frightened and unsure.\"We found similar hope in a private Facebook group for parents of the NICU unit.\"Our story is a happy one in that we got to take Noah home. However there are many parents who aren’t as lucky as us.\"It’s a real difficult journey and if this can bring a smile to people and give parents hope that no matter how bleak, there is always hope we will be very happy.\"You can follow Noah's journey on Instagram @noah_gleeson. A JustGiving page has also been set-up to raise money for Liverpool Women's Hospital and Neonatal Unit. You can donate at justgiving.com/fundraising/challengefornoah ."}