{"id": "Megan Barton Hanson trusts Wes Nelson completely after cheating rumours: 'We’re quite private and I think that helps a lot'", "paragraph": "EXCLUSIVE: Love Island star insists her relationship is 'going from strength to strength' after cheating rumoursMegan Barton Hanson has revealed that she trusts her boyfriend Wes Nelson completely - despite the cheating rumours trying to pull them apart.The Love Island star moved in with her boyfriend of three months this week amid a storm of rumours about their relationship.First, Megan was faced with a barrage of messages from fans telling her Wes cheated with a mystery woman while making a personal appearance. Then, she was the subject of her own media storm when it was suggested she had 'disappeared' with Pete Wicks during a boozy night out. But Megan insists their relationship is still \"really good\" and \"going from strength to strength\". \"It’s really good, his PA run has come to an end now and he’s getting ready for Dancing On Ice so it’s all really positive,\" Megan who is the new brand ambassador for PrettyLittleThing exclusively told Mirror Online. And she's not worried about the Dancing On Ice curse after Kem Cetinay split from his Love Island girlfriend Amber Davies while taking part in the show last year.\"I think if anything we’re going to have more time together because when he’s travelling to his PAs he's halfway across England.\"I think if anything once he’s got his Dancing On Ice schedule it’ll be better and if anything we’ll have more time together so it’ll be nice.\"But is Megan worried about Wes' head getting turned by the dancers on the show?\"No I don’t think so he’s so completive he’ll be more interested in how good he is and if he’s better than the other people on it,\" she said.And she revealed she doesn't feel any pressure to stay together.\"I think if we cared so much about what the public think we wouldn’t have played Love Island how we did it,\" she reasoned.\"He could have played it safe with Laura, I could have played it safe with Eyal, so I think we’re very much focused on our careers and each other then you can’t think about how other people are going to perceive it.\"Ultimately if we’re not happy then we’ll end it but we have a really good time so you can’t put that much pressure on it and think: ‘Oh we should do it for the public.’\"She added: \"We don’t put a lot on social media, documenting our whole relationship.\"We’ll put something on from a night out if we’re think we’re being funny but we’re quite private and I think that helps a lot and I think we’re on the same page with making the most of the opportunities we’ve been given while building our relationship.\"It’s still early days in our relationship. I never would have thought I would have come out with a boyfriend and moved in with him after three months.\"Last night, things could have got a little awkward on the red carpet as Megan and Pete narrowly avoided each other as they made their way into the Pride Of Britain Awards.Megan, 24, looked fantastic in her green gown which showed plenty of shoulder.Meanwhile Wes didn't seem concerned by the rumours and looked razor sharp in his black suit and loafers.The Sun reported that there were questions to be answered about the boozy night the Animal Hero Awards at The Grosvenor House Hotel last month.But lips were sealed on the red carpet and awkward reunions avoided.\"Megan and Pete hit it off from the moment they first started talking – they both seemed keen to get to know each other better,\" a source said.\"At first Pete was very cautious and made it clear he wasn’t interested due to her being in a relationship with Wes. But as the night progressed they’d both had a lot to drink and were having fun.\"The pair even went \"missing\" for a long period of time from the rest of the group that included Ferne, Mario and also Jon Clark... Megan loves Wes so has insisted to close friends that nothing happened between her and Pete.\""}