{"id": "Transfer news: 'PSG expect to lose either Kylian Mbappe or Neymar' as they continue Alexis Sanchez interest", "paragraph": "PLUS: Manchester United boss Jose Mourinho is being targeted by Florentino Perez for a Real Madrid reunionParis Saint-Germain are reportedly preparing to lose one of either Kylian Mbappe or Neymar as they prepare to bring Alexis Sanchez to the club.The French giants are bracing for offers for superstar forwards Mbappe and Neymar - especially if they fail to progress from their Champions League group.PSG are currently third behind Napoli and Liverpool in the European competition, and despite boasting a 100 per cent record and leading their domestic league by eight points, it would be unlikely to see the highly rated duo remain in Paris. According to the Sun, if they were to depart the club would be desperately targeting a similarly big name to replace them.  As Mirror Football revealed last week, Sanchez is aiming to leave Manchester United in January. PSG are his most likely to be his destination, with the Ligue 1 champions one of the few clubs to be able to shell out for his £500,000-a-week wages.United would command a huge transfer fee for the Chilean, despite picking him up in a swap deal for Arsenal-bound Henrikh Mkhitaryan last season. Manchester United boss Jose Mourinho is being targeted by Florentino Perez for a Real Madrid reunion, according to the Spanish giants’ former president Ramon Calderon.  Mourinho expects Manchester United to sanction a January signing to boost his floundering back line. Talks have continued within Old Trafford over signing a defender since being linked with EIGHT of them in the summer but not landing one .  EXCLUSIVE Milan Mandaric is backing Vichai Srivaddhanaprabha’s son to continue his family’s successful football “mission” at tragedy-hit Leicester City. Mandaric, who sold the Foxes to the Thai businessman in 2010, says Aiyawatt is cut from the same cloth as his father and is sure he'll carry on investing in the club following the helicopter crash at the ground on Saturday which killed his father and four others.  Frank Lampard has revealed he never wanted to leave Chelsea, and won’t rule out rejoining his old club as manager in the future. The Blues hero, now in his first season on the touchline, takes Championship side Derby to Stamford Bridge in the League Cup on Wednesday.  Bernardo Silva has warned the Premier League’s resurgent superpowers the best if yet to come from Manchester City, after the champions went top again with an away win over Tottenham.  Naby Keita reckons he's already a better player than when he joined Liverpool in the summer — because of their competition for places. "}