{"status": "ok", "totalResults": 4478, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "These are the 10 coolest new cars for under $20,000", "description": "Kelley Blue Book's KBB.com came up with a list of the 10 coolest cars for under $20,000. The list features cars and crossovers from Chevrolet, Honda, Hyundai, Kia, Mazda, Subaru, Jeep, and Volkswagen. The vehicles on the KBB list stand out for a variety of re…", "url": "https://www.businessinsider.com/coolest-cars-cheap-cars-under-20000-according-to-kbb-2018-5", "urlToImage": "https://amp.businessinsider.com/images/5b05a4591ae6623b008b459e-1536-768.jpg", "publishedAt": "2018-10-17T15:12:00Z", "content": "A 2018 Mazda 3. Mazda It's getting harder and harder to find a cheap and cheerful new car these days. Even though cars are getting better by the day, they're also getting more expensive. In fact, average transaction price of a new car has gone up 3.3% over th… [+1751 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shana Lebowitz", "title": "A former Googler and Facebook exec says a simple shift in mindset can help you land the raise you want", "description": "Libby Leffler, a former Facebook executive and Google employee, is now the vice president of membership at SoFi. Leffler recommends that, before you ask your boss for a raise, you put yourself in their shoes. What are they going to be thinking and feeling whe…", "url": "https://www.businessinsider.com/how-to-ask-for-raise-first-step-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5b9c13038ea82fa1278b58df-1920-960.jpg", "publishedAt": "2018-10-18T12:43:00Z", "content": "\"Being able to put yourself in someone else's shoes is really important.\" This is true of life in general, but it's especially true when you're asking your boss for a raise. According to Libby Leffler, who is the vice president of membership at personal finan… [+1485 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "The same question that can chart a path to early retirement is the one Warren Buffett used to build Berkshire Hathaway into a powerhouse", "description": "Inversion is a mental model that involves flipping your outlook to prevent the opposite of what you want to happen from happening. Warren Buffett and his business partner Charlie Munger employed inversion as a business strategy to build Berkshire Hathaway int…", "url": "https://www.businessinsider.com/warren-buffett-business-strategy-set-path-to-early-retirement-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7a61aa4f8be09f1669818-1920-960.jpg", "publishedAt": "2018-10-18T12:49:00Z", "content": "Some business strategies aren't just for the 9-to-5 — they're also applicable outside of office hours. In a recent podcast hosted by Brandon of the Mad Fientist, who retired early at 34, productivity expert James Clear called a Warren Buffett-approved mental … [+2154 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Brian Pascus", "title": "Southwest Airlines is selling one-way tickets for as low as $49 and round-trip tickets for as low as $97 (LUV)", "description": "Southwest Airlines is offering low-cost domestic flights as part of a seasonal promotion, with some flights for this fall and winter starting as low as $49 one-way and $97 round-trip. The deal expires on Thursday, October 25 at 11:59 p.m., and continental US …", "url": "https://www.businessinsider.com/southwest-airlines-tickets-sale-one-way-49-dollars-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc88c6bf5d5cc12ef2070e5-1920-960.jpg", "publishedAt": "2018-10-18T14:21:34Z", "content": "Southwest Airlines is offering low-cost domestic flights as a part of a seasonal promotion, with some flights for this fall and winter starting at as low as $49 one-way and $97 round-trip. The Dallas-based carrier is offering a variety of low-cost, one-way an… [+1376 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "$20 billion startup Atlassian explains why it's blowing up its oldest product to evolve with today’s software teams (TEAM)", "description": "On Thursday, Atlassian announced the launch of a new version of Jira, its product for tracking the progress of software development projects. Jira was redesigned to progress with modern software development teams, which are becoming smaller and more agile. Th…", "url": "https://www.businessinsider.com/atlassian-is-blowing-up-jira-to-evolve-with-modern-software-developers-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7b5d0f5d5cc0ab661a4e3-2732-1366.jpg", "publishedAt": "2018-10-18T12:00:00Z", "content": "Atlassian's most popular product is getting a big makeover — so big, that it's practically a different product. The Australian tech company valued at $20 billion created its Jira software development platform back when the company was founded in 2002. With th… [+2455 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meredith Cash", "title": "New Lakers teammate LeBron James inspires Kyle Kuzma on and off the court", "description": "After spending last season making the case that he was the steal of the 2017 NBA Draft, Los Angeles Lakers power forward Kyle Kuzma will spend his sophomore season suiting up alongside one of the greatest athletes to play the game in superstar LeBron James. W…", "url": "https://www.businessinsider.com/lebron-james-inspires-kyle-kuzmas-philanthropic-efforts-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7b04da4f8be0ae943efa3-1334-667.jpg", "publishedAt": "2018-10-18T14:00:14Z", "content": "After an impressive rookie year with the Los Angeles Lakers, power forward Kyle Kuzma will spend his sophomore season playing alongside LeBron James. Adding a player of James' caliber would be a game-changer for any NBA team, but the four-time MVP has quickly… [+2806 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "Bill Gates says there are 5 'grand challenges' to stopping an apocalyptic future of floods, hurricanes, and drought", "description": "Renewable energy sources aren't enough to eliminate the harmful effects of climate change, Bill Gates wrotein a recent blog post. To prevent climate-related disasters such as floods, drought, and extreme temperatures, the world must focus on five \"grand chall…", "url": "https://www.businessinsider.com/bill-gates-challenges-to-stopping-climate-change-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc79c7298b249089b473992-1920-960.jpg", "publishedAt": "2018-10-18T13:54:00Z", "content": "Bill Gates has a message for those worried about climate-related disasters like hurricanes, droughts, flooding, and extreme temperatures: No solution works on its own. In a recent blog post, Gates refuted the idea that renewable energy sources like solar pane… [+762 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Uber raised $2 billion in its first-ever bond-offering — and the entire deal was done in near secrecy", "description": "Uber raised $2 billion in bonds this week, the company confirmed to Business Insider on Thursday. It's the ride-hailing company's first ever bond offering, and was able to maintain its secrecy through the private placement. Uber and its closest competitor Lyf…", "url": "https://www.businessinsider.com/uber-bond-offering-raises-2-billion-popular-offering-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5b744cd6dcee3019008b53e1-1920-960.jpg", "publishedAt": "2018-10-18T14:38:41Z", "content": "Uber has quietly sold $2 billion worth of bonds to a small but eager group of investors this week in a so-called private placement that allowed the ride-hailing giant to maintain its notorious veil of secrecy as it races towards an IPO next year. The offering… [+2616 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mekebeb Tesfaye", "title": "BBVA is taking open banking to the US with the launch of an open platform (BBVA)", "description": "This story was delivered to Business Insider Intelligence \" Fintech Briefing \" subscribers. To learn more and subscribe, please click here. Spanish banking giant BBVA has announced the launch of a Banking-as-a-Service (BaaS) platform in the US, dubbed BBVA Op…", "url": "https://www.businessinsider.com/bbva-us-open-platform-launch-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc8826cfed59212527a8df5-1536-768.jpg", "publishedAt": "2018-10-18T12:59:00Z", "content": "This story was delivered to Business Insider Intelligence \" Fintech Briefing \" subscribers. To learn more and subscribe, please click here. Spanish banking giant BBVA has announced the launch of a Banking-as-a-Service (BaaS) platform in the US, dubbed BBVA Op… [+2381 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Greg Magana", "title": "Having a brick-and-mortar presence can boost a brand’s web traffic", "description": "This story was delivered to Business Insider Intelligence \" E-Commerce Briefing \" subscribers hours before appearing on Business Insider. To be the first to know, please click here. Having a brick-and-mortar presence can boost a brand’s web traffic, according…", "url": "https://www.businessinsider.com/physical-stores-boost-retailer-web-traffic-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc885928f5fcb12895c8f1b-1920-960.jpg", "publishedAt": "2018-10-18T13:10:00Z", "content": "This story was delivered to Business Insider Intelligence \" E-Commerce Briefing \" subscribers hours before appearing on Business Insider. To be the first to know, please click here. Having a brick-and-mortar presence can boost a brand's web traffic, according… [+2163 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Daniel Brown", "title": "What we know about the Su-27, the Ukrainian fighter jet that recently crashed with a US pilot aboard", "description": "A Ukrainian Su-27UB Flanker crashed about 185 miles southwest of Kyiv on Tuesday, killing a Ukrainian pilot and American pilot. The crash occurred during the multinational Clear Sky 2018 exercises, which involved military personnel from nine countries and wer…", "url": "https://www.businessinsider.com/what-we-know-about-su-27-ukrainian-jet-crashed-with-us-pilot-aboard-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc78ce38f5fcb066a411783-1136-568.jpg", "publishedAt": "2018-10-17T20:47:58Z", "content": "A Ukrainian Su-27UB Flanker crashed about 185 miles southwest of Kyiv on Tuesday, killing a Ukrainian pilot and American pilot. The crash occurred during the multinational Clear Sky 2018 exercises, which involved military personnel from nine countries and wer… [+636 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christopher Woody", "title": "The world's 2 biggest countries are playing nice a year after a showdown, but a future clash may be unavoidable", "description": "A year after a showdown along their disputed border, India and China have improved their relationship. Despite that renewed cooperation, the strategic issues driving the tension between them are unresolved. Persistent issues, along with other moves both sides…", "url": "https://www.businessinsider.com/china-india-recalibrating-after-doklam-but-future-conflict-possible-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc77fc6a4f8be055253baa3-1334-667.jpg", "publishedAt": "2018-10-17T21:08:36Z", "content": "At the end of August 2017, India and China backed away from a 73-day standoff on the Doklam Plateau, high in the eastern Himalayas. In the year since, both sides have sought to mend ties, especially after a summit between Prime Minister Narendra Modi and Pres… [+9331 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "DELETE YOUR ACCOUNT: How to wipe your personal information from Facebook, Amazon, Google, and other major websites and apps (AAPL, MSFT, SNAP, AMZN, GOOG, GOOGL, FB)", "description": "Shutterstock. that hackers got access to the sensitive personal information of as many as 30 million users, causing many to rush to delete their accounts and protect it from any further breaches. But Facebook is definitely not the only website on the Internet…", "url": "http://uk.businessinsider.com/delete-your-account-facebook-amazon-google-apple-twitter-2018-10", "urlToImage": "http://static2.uk.businessinsider.com/image/5bc7a304bde70f4dd9074f9b-1190-625/delete-your-account-how-to-wipe-your-personal-information-from-facebook-amazon-google-and-other-major-websites-and-apps.jpg", "publishedAt": "2018-10-17T21:07:00Z", "content": "Shutterstock Facebook revealed last week that hackers got access to the sensitive personal information of as many as 30 million users, causing many to rush to delete their accounts and protect it from any further breaches. But Facebook is definitely not the o… [+7056 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "The maker of 'Fortnite' is suing two YouTubers for trolling with cheats and sharing hacks (GOOG)", "description": "The creators of \"Fortnite\" are cracking down on cheaters. Epic Games \"Fortnite\" developer Epic Games is suing a pair of YouTubers for promoting hacks and trolling in the game and selling cheat software. The lawsuit, filed in a North Carolina district court, c…", "url": "http://uk.businessinsider.com/fortnite-maker-epic-games-sues-youtube-games-sharing-cheat-tips-2018-10", "urlToImage": "http://static3.uk.businessinsider.com/image/5bc7980adde8674ab4277e11-1190-625/the-maker-of-fortnite-is-suing-two-youtubers-for-trolling-with-cheats-and-sharing-hacks.jpg", "publishedAt": "2018-10-17T21:07:00Z", "content": "The creators of \"Fortnite\" are cracking down on cheaters. Epic Games Epic Games has filed a lawsuit against two YouTubers for promoting the use of \"Fortnite: Battle Royale\" hacks on YouTube and selling cheating software on a private website. A copy of the cla… [+4156 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Brodwin", "title": "Most rehabs don't offer a science-backed treatment for drug addiction. A new initiative aims to change that.", "description": "To treat addiction to opioid painkillers like OxyContin and Vicodin, scientists say we should be using something called medication-assisted treatment, which involves giving patients access to medications that appear to curb overdose deaths. Few rehabs or trea…", "url": "https://www.businessinsider.com/drug-addiction-treatment-not-offered-most-rehab-centers-new-initiative-aims-change-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5addf0d919ee861c008b4640-960-480.jpg", "publishedAt": "2018-10-17T19:06:00Z", "content": "As the death toll from opioid addiction continues to soar with nearly 64,000 people dying in 2016 alone, scientists and public health experts are calling on clinics and rehab facilities to make sure they're using the latest science to treat the condition. So … [+8823 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Becky Peterson", "title": "Oracle is acquiring a tiny cloud startup backed by Qualcomm to build out its health science product suite (ORCL)", "description": "Oracle is acquiring goBalto, a health tech start up which focuses on reducing the time it takes to start a new clinic trial. goBalto, which was last valued at $70 million in a 2015 funding round, was backed by investors including Qualcomm Ventures. The terms …", "url": "https://www.businessinsider.com/oracle-acquires-gobalto-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5b6dd3c8e199f319008b4f1c-2732-1366.jpg", "publishedAt": "2018-10-17T18:10:48Z", "content": "Oracle is making moves to grow its health science platform with its acquisition of goBalto, a cloud startup focused on streamlining the clinic trial process. The San Francisco-based goBalto was last valued at $70 million in 2015, according to Pitchbook. Since… [+1346 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "California’s mega-farms have a dark side that could put our supply of fruits, vegetables, and nuts at risk", "description": "The Central Valley is one the main food suppliers in the US, but it now faces a host of environmental concerns. In the wake of a six-year drought, the region's mega-farms have begun to sink, and pumping groundwater has released toxic levels of arsenic into th…", "url": "https://www.businessinsider.com/california-mega-farms-food-sinking-land-toxic-water-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc74dd33fe22929906b281b-2732-1366.jpg", "publishedAt": "2018-10-17T18:34:00Z", "content": "In the center of California lies one of the most important agricultural areas in the US — an 18,000-square-mile stretch of heartland known as the Central Valley. Each year, the region's mega-farms produce about a quarter of the nation's food supply, or around… [+2508 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "White House counsel Don McGahn is reportedly out after tumultuous tenure in the Trump administration", "description": "White House counsel Don McGahn reportedly left the Trump administration on Wednesday. President Donald Trump floated the idea of replacing McGahn with attorney Pat Cipollone, a Justice Department veteran, earlier this week. McGahn's departure adds to a long l…", "url": "https://www.businessinsider.com/don-mcgahn-out-white-house-counsel-trump-administration-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7c82b65d3320ae314aa76-1920-960.jpg", "publishedAt": "2018-10-18T00:03:39Z", "content": "White House counsel Don McGahn left the Trump administration on Wednesday after a tumultuous 21-month tenure, two people with knowledge of the situation said in a New York Times report published Wednesday evening. McGahn was said to be on his way out of the W… [+1396 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "These lesser-known programming languages are exploding in popularity, according to the 'Facebook for programmers' (MSFT)", "description": "In the cutting-edge world of Silicon Valley, not only do developers have to learn the most popular programming languages, they also have to keep up with new ones. GitHub, which hosts open-source software projects to which users can browse and contribute, has …", "url": "https://www.businessinsider.com/the-fastest-growing-programming-languages-according-to-the-facebook-for-programmers-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc79a07e92e9708060fb054-2732-1366.jpg", "publishedAt": "2018-10-18T00:00:00Z", "content": "In the cutting-edge world of Silicon Valley, not only do developers have to learn the most popular programming languages, they also have to keep up with new ones. GitHub, which hosts open-source software projects to which users can browse and contribute, has … [+925 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Apple gives US users tool to see what data it has collected - Business Insider", "description": "Business Insider Apple gives US users tool to see what data it has collected Business Insider By Stephen Nellis. (Reuters) - Apple Inc on Wednesday rolled out an online tool to users in the United States and several other countries to download, change or dele…", "url": "http://uk.businessinsider.com/r-apple-gives-us-users-tool-to-see-what-data-it-has-collected-2018-10", "urlToImage": "http://static3.uk.businessinsider.com/image/5bc75226bde70f44ad10af7d-1190-625/apple-gives-us-users-tool-to-see-what-data-it-has-collected.jpg", "publishedAt": "2018-10-17T15:05:00Z", "content": "FILE PHOTO: Customers walk past an Apple logo inside of an Apple store at Grand Central Station in New York Thomson Reuters By Stephen Nellis (Reuters) - Apple Inc on Wednesday rolled out an online tool to users in the United States and several other countrie… [+2346 chars]"}]}