{"status": "ok", "totalResults": 4478, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Tesla is gaining around after securing a Shanghai site for its first overseas Gigafactory (TSLA)", "description": "Tesla announced Wednesday that it has secured an 860,000 square meter plot of land in Shanghai, China, to build its first overseas Gigafactory. In July, the car maker signed a deal with Shanghai authorities to open a plant in the Chinese city with an annual c…", "url": "https://markets.businessinsider.com/news/stocks/tesla-stock-gigafactory-site-secured-shanghai-2018-10-1027625292", "urlToImage": "https://static6.businessinsider.com/image/5bc72682c1aa1325c2716103-2400/gettyimages-471769884.jpg", "publishedAt": "2018-10-17T12:17:00Z", "content": "Getty/Kevork Djansezian Tesla is gaining around early Wednesday after the company announced it has secured a site in Shanghai, China, to build its first overseasÂ Gigafactory.Â Shares were up about 1.5% ahead of the opening bell. The electric-car maker said W… [+1041 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "An Amazon staffer says over 450 employees wrote to Jeff Bezos demanding Amazon stop selling facial recognition software to police (AMZN)", "description": "An anonymous Amazon employee wrote an op-ed for Medium demanding that Amazon stop selling its facial recognition software Rekognition to police forces. The employee said over 450 Amazon staffers wrote to Jeff Bezos asking for the same thing a few weeks ago, b…", "url": "https://www.businessinsider.com/amazon-employee-letter-jeff-bezos-facial-recognition-software-police-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc731a25eb97e2636484cb3-1920-960.jpg", "publishedAt": "2018-10-17T13:29:29Z", "content": "An anonymous Amazon employee has written an op-ed for Medium demanding that Amazon cease selling facial recognition software to police forces. The employee, the authenticity of whom was verified by Medium's editorial staff, says that more than 450 Amazon work… [+2426 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christopher Woody and Ryan Pickrell", "title": "Trump says 'ISIS is defeated' — the Pentagon says not quite", "description": "President Donald Trump said in an interview on Tuesday that ISIS had been defeated. He's made similar statements before, but military officials have been more circumspect. While ISIS has lost the territory it once controlled, the group remains a potent terror…", "url": "https://www.businessinsider.com/trump-says-isis-is-defeated-the-pentagon-says-not-quite-2018-10", "urlToImage": "https://amp.businessinsider.com/images/589b6b913149a1e53a8b59e5-2732-1366.jpg", "publishedAt": "2018-10-17T15:05:17Z", "content": "President Donald Trump told the Associated Press in a wide-ranging interview on Tuesday that ISIS, the terrorist group that swept over Iraq and Syria in 2014, has been defeated. US military leaders have said the group has been rolled back and denied control o… [+6295 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Peter Kotecki", "title": "SodaStream built a 1000-foot-long contraption called the 'Holy Turtle' to collect plastic from the ocean", "description": "SodaStream, which makes popular home carbonation machines, has unveiled a 1000-foot-long contraption for cleaning plastic waste from ocean waters. CEO Daniel Birnbaum — along with 150 company executives, environmental specialists, and representatives of the P…", "url": "https://www.businessinsider.com/sodastreams-holy-turtle-cleans-plastic-from-ocean-in-honduras-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc4aeeb98a1801a290a8383-2732-1366.jpg", "publishedAt": "2018-10-17T14:40:00Z", "content": "SodaStream, which makes popular home carbonation machines, has unveiled a 1000-foot-long contraption for cleaning plastic waste from ocean waters. CEO Daniel Birnbaum — along with 150 company executives, environmental specialists, and representatives of the P… [+870 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "This self-storage startup lets you take your extra junk and rent it to strangers for cash or cryptocurrency", "description": "Omni — a San Francisco-based self-storage startup that's raised over $40 million — is on a mission to transform the traditional self-storage world. Omni lets users not only store their items for a flat monthly fee per item, but it also allows for those items …", "url": "https://www.businessinsider.com/self-storage-omni-now-lets-you-rent-your-stuff-for-xrp-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc66721e8f6d01e1f4bd533-2732-1366.jpg", "publishedAt": "2018-10-17T15:00:00Z", "content": "Costume Town may look like a typical, online costume rental store — complete with a replica Stormtrooper suit and Spider-Man onesie — but behind the scenes, it runs a little differently. Rather than keep its inventory in a storefront or warehouse, Costume Tow… [+3570 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "One indicator shows that Democrats are on the path to flipping the House in November", "description": "Democrats are far outstripping their Republican opponents in individual and small-donor fundraising for House candidates this year, a strong indicator that the Democratic Party is poised to flip the House. Democrats have raised nearly two-thirds of the total …", "url": "https://www.businessinsider.com/one-indicator-shows-that-democrats-are-on-the-path-to-flipping-the-house-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc73c89dff09427b57935da-1136-568.jpg", "publishedAt": "2018-10-17T14:59:45Z", "content": "Democrats are far outstripping their Republican opponents in individual and small-donor fundraising for House candidates this year, a strong indicator that the Democratic Party is poised to flip the House. Nearly two years into Donald Trump's presidency, Demo… [+1472 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sponsor Post", "title": "Brentwood Home's dual-sided mattress promotes active recovery and restorative sleep", "description": "Established online mattress retailer Brentwood Home introduces the Crystal Cove mattress, a uniquely dual-sided mattress specifically designed to promote therapeutic recovery and deep, restorative sleep. The 100% vegan, non-toxic mattress balances the latest …", "url": "https://www.businessinsider.com/sc/brentwood-homes-crystal-cove-mattress-sleep-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc5e794b26cd90e9d2ca6aa-1136-568.jpg", "publishedAt": "2018-10-17T16:15:00Z", "content": "Established online mattress retailer Brentwood Home introduces the Crystal Cove mattress, a uniquely dual-sided mattress specifically designed to promote therapeutic recovery and deep, restorative sleep. The 100% vegan, non-toxic mattress balances the latest … [+2213 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "Facebook built an election 'war room' to try and avoid repeating the mistakes of 2016 — here's what it's like inside (FB)", "description": "Facebook has built a physical \"war room\" in its California headquarters to try and avoid repeating the mistakes of the 2016 US presidential election. On Wednesday, it opened up the room to journalists, including Business Insider. The company has made progress…", "url": "https://www.businessinsider.com/inside-facebook-election-war-room-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7b9dfa977740ba10d2c14-1920-960.jpg", "publishedAt": "2018-10-18T10:00:00Z", "content": "Facebook can't afford to repeat the mistakes of 2016. During the 2016 US presidential election, the social network was wildly abused by Russian propagandists, who spread fake news and misinformation on a massive scale — setting off a chain reaction of scandal… [+4136 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "$20 billion startup Atlassian explains why it's blowing up its oldest product to evolve with today’s software teams (TEAM)", "description": "On Thursday, Atlassian announced the launch of a new version of Jira, its product for tracking the progress of software development projects. Jira was redesigned to progress with modern software development teams, which are becoming smaller and more agile. Th…", "url": "https://www.businessinsider.com/atlassian-is-blowing-up-jira-to-evolve-with-modern-software-developers-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7b5d0f5d5cc0ab661a4e3-2732-1366.jpg", "publishedAt": "2018-10-18T12:00:00Z", "content": "Atlassian's most popular product is getting a big makeover — so big, that it's practically a different product. The Australian tech company valued at $20 billion created its Jira software development platform back when the company was founded in 2002. With th… [+2455 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "Russian billionaire Roman Abramovich owns the second-largest yacht in the world and a customized airplane with a 30-person banquet hall — see how else he spends his fortune of at least $11 billion", "description": "Billionaire Roman Abramovich was once the richest man in Russia. Today, estimates of his net worth range from $11.6 billion to $14.1 billion. The billionaire owns UK's Chelsea soccer team as well as stakes in steel giant Evraz and mining company Norilsk Nicke…", "url": "https://www.businessinsider.com/roman-abramovich-net-worth-yacht-cars-houses-photos-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7826f8f5fcb05547911e2-1920-960.jpg", "publishedAt": "2018-10-17T19:11:00Z", "content": "Russian billionaire Roman Abramovich, owner of the UK's Chelsea soccer team, is known for his mind-boggling collection of superyachts, luxury cars, private planes, and lavish homes around the world. The Wall Street Journal once nicknamed his global collection… [+525 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Daniel Brown", "title": "What we know about the Su-27, the Ukrainian fighter jet that recently crashed with a US pilot aboard", "description": "A Ukrainian Su-27UB Flanker crashed about 185 miles southwest of Kyiv on Tuesday, killing a Ukrainian pilot and American pilot. The crash occurred during the multinational Clear Sky 2018 exercises, which involved military personnel from nine countries and wer…", "url": "https://www.businessinsider.com/what-we-know-about-su-27-ukrainian-jet-crashed-with-us-pilot-aboard-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc78ce38f5fcb066a411783-1136-568.jpg", "publishedAt": "2018-10-17T20:47:58Z", "content": "A Ukrainian Su-27UB Flanker crashed about 185 miles southwest of Kyiv on Tuesday, killing a Ukrainian pilot and American pilot. The crash occurred during the multinational Clear Sky 2018 exercises, which involved military personnel from nine countries and wer… [+636 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "The same question that can chart a path to early retirement is the one Warren Buffett used to build Berkshire Hathaway into a powerhouse", "description": "Inversion is a mental model that involves flipping your outlook to prevent the opposite of what you want to happen from happening. Warren Buffett and his business partner Charlie Munger employed inversion as a business strategy to build Berkshire Hathaway int…", "url": "https://www.businessinsider.com/warren-buffett-business-strategy-set-path-to-early-retirement-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7a61aa4f8be09f1669818-1920-960.jpg", "publishedAt": "2018-10-18T12:49:00Z", "content": "Some business strategies aren't just for the 9-to-5 — they're also applicable outside of office hours. In a recent podcast hosted by Brandon of the Mad Fientist, who retired early at 34, productivity expert James Clear called a Warren Buffett-approved mental … [+2154 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shana Lebowitz", "title": "A former Googler and Facebook exec says a simple shift in mindset can help you land the raise you want", "description": "Libby Leffler, a former Facebook executive and Google employee, is now the vice president of membership at SoFi. Leffler recommends that, before you ask your boss for a raise, you put yourself in their shoes. What are they going to be thinking and feeling whe…", "url": "https://www.businessinsider.com/how-to-ask-for-raise-first-step-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5b9c13038ea82fa1278b58df-1920-960.jpg", "publishedAt": "2018-10-18T12:43:00Z", "content": "\"Being able to put yourself in someone else's shoes is really important.\" This is true of life in general, but it's especially true when you're asking your boss for a raise. According to Libby Leffler, who is the vice president of membership at personal finan… [+1485 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Myelle Lansat", "title": "The millionaire host of 'The Price is Right' says a smart person does the same thing for their career every day — so other people don't", "description": "\" The Price Is Right \" host Drew Carey uses vision boards to set personal goals every day. A vision board is a visual representation of personal goals. Carey said if you don't set goals for yourself regularly, you can be vulnerable to doing things that other …", "url": "https://www.businessinsider.com/the-price-is-right-host-drew-carey-career-advice-2018-10", "urlToImage": "https://amp.businessinsider.com/images/540b673269bedd691cf281af-1920-960.jpg", "publishedAt": "2018-10-18T13:27:00Z", "content": "Before Drew Carey shows up to the \"The Price is Right\" set every day, the host sets personal goals for himself, he said in a recent interview with INSIDER. The first episode of \"The Price Is Right\" aired September 4, 1972 with host Bob Barker. In 2007, Carey … [+1970 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "Careem, a ridehailing company in acquisition talks with Uber, raised $200 million from Saudi backers", "description": "Careem, a Middle East ride-hailing equivalent to Uber, has raised a $200 million tranche for its latest round of funding. The deal values the company at more than $2 billion, one source said, and the company hopes to raise $500 million for the round. The deal…", "url": "https://www.businessinsider.com/uber-rival-careem-200-million-saudi-arabia-2-billion-valuation2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc853c5756c1010d6419a02-1136-568.jpg", "publishedAt": "2018-10-18T10:21:11Z", "content": "Careem, a Middle East rival to Uber, has closed an initial $200 million raise in a funding round co-led by Saudi Arabia's Kingdom Holding Company. Kingdom Holding Company is an investment vehicle for Saudi's richest man, billionaire Prince Alwaleed bin Talal.… [+2508 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lauren Johnson", "title": "What you need to know in advertising today", "description": "Facebook is on the back foot. Again. On Tuesday, a group of small advertisers added a complaint to a two-year lawsuit accusing Facebook of not reporting measurement problems for more than a year. The group claims that Facebook misreported an error in counting…", "url": "https://www.businessinsider.com/advertising-news-today-marketers-react-to-facebook-lawsuit-pinterest-launches-advertising-tools-10-18-2018", "urlToImage": "https://amp.businessinsider.com/images/5bc8873f98b249132262ea25-2732-1366.jpg", "publishedAt": "2018-10-18T13:26:18Z", "content": "Dado Ruvic/Reuters Facebook is on the back foot. Again. On Tuesday, a group of small advertisers added a complaint to a two-year lawsuit accusing Facebook of not reporting measurement problems for more than a year. The group claims that Facebook misreported a… [+2445 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Uber raised $2 billion in its first-ever bond-offering — and the entire deal was done in near secrecy", "description": "Uber raised $2 billion in bonds this week, the company confirmed to Business Insider on Thursday. It's the ride-hailing company's first ever bond offering, and was able to maintain its secrecy through the private placement. Uber and its closest competitor Lyf…", "url": "https://www.businessinsider.com/uber-bond-offering-raises-2-billion-popular-offering-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5b744cd6dcee3019008b53e1-1920-960.jpg", "publishedAt": "2018-10-18T14:38:41Z", "content": "Uber has quietly sold $2 billion worth of bonds to a small but eager group of investors this week in a so-called private placement that allowed the ride-hailing giant to maintain its notorious veil of secrecy as it races towards an IPO next year. The offering… [+2616 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Brian Pascus", "title": "Southwest Airlines is selling one-way tickets for as low as $49 and round-trip tickets for as low as $97 (LUV)", "description": "Southwest Airlines is offering low-cost domestic flights as part of a seasonal promotion, with some flights for this fall and winter starting as low as $49 one-way and $97 round-trip. The deal expires on Thursday, October 25 at 11:59 p.m., and continental US …", "url": "https://www.businessinsider.com/southwest-airlines-tickets-sale-one-way-49-dollars-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc88c6bf5d5cc12ef2070e5-1920-960.jpg", "publishedAt": "2018-10-18T14:21:34Z", "content": "Southwest Airlines is offering low-cost domestic flights as a part of a seasonal promotion, with some flights for this fall and winter starting at as low as $49 one-way and $97 round-trip. The Dallas-based carrier is offering a variety of low-cost, one-way an… [+1376 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "Bill Gates says there are 5 'grand challenges' to stopping an apocalyptic future of floods, hurricanes, and drought", "description": "Renewable energy sources aren't enough to eliminate the harmful effects of climate change, Bill Gates wrotein a recent blog post. To prevent climate-related disasters such as floods, drought, and extreme temperatures, the world must focus on five \"grand chall…", "url": "https://www.businessinsider.com/bill-gates-challenges-to-stopping-climate-change-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc79c7298b249089b473992-1920-960.jpg", "publishedAt": "2018-10-18T13:54:00Z", "content": "Bill Gates has a message for those worried about climate-related disasters like hurricanes, droughts, flooding, and extreme temperatures: No solution works on its own. In a recent blog post, Gates refuted the idea that renewable energy sources like solar pane… [+762 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meredith Cash", "title": "New Lakers teammate LeBron James inspires Kyle Kuzma on and off the court", "description": "After spending last season making the case that he was the steal of the 2017 NBA Draft, Los Angeles Lakers power forward Kyle Kuzma will spend his sophomore season suiting up alongside one of the greatest athletes to play the game in superstar LeBron James. W…", "url": "https://www.businessinsider.com/lebron-james-inspires-kyle-kuzmas-philanthropic-efforts-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bc7b04da4f8be0ae943efa3-1334-667.jpg", "publishedAt": "2018-10-18T14:00:14Z", "content": "After an impressive rookie year with the Los Angeles Lakers, power forward Kyle Kuzma will spend his sophomore season playing alongside LeBron James. Adding a player of James' caliber would be a game-changer for any NBA team, but the four-time MVP has quickly… [+2806 chars]"}]}