{"status": "ok", "totalResults": 6493, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Reuters", "title": "'No time to be nervous': cosmonaut, astronaut recount spacecraft mishap", "description": "A Russian cosmonaut and a NASA astronaut describe what they experienced during their close call last week -- the failed launch and emergency landing of their Soyuz spacecraft.", "url": "https://www.cbc.ca/news/technology/astronaut-failed-launch-1.4866116", "urlToImage": "https://i.cbc.ca/1.4866134.1539778612!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/kazakhstan-russia-space.jpg", "publishedAt": "2018-10-17T12:23:20Z", "content": "Russian cosmonaut Alexei Ovchinin shrugged off on Tuesday his emergency landing last week, saying there had been no time to worry as his capsule plunged back to earth. Ovchinin and American astronaut Nick Hague had to abort their mission on Oct. 11 after the … [+4149 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "The Associated Press", "title": "The puppeteer behind Sesame Street's Big Bird for nearly 50 years is retiring", "description": "Caroll Spinney has been with Sesame Street since its start in 1969. But the puppeteer who brought Big Bird and Oscar the Grouch to life for nearly 50 years says its time to retire.", "url": "https://www.cbc.ca/news/entertainment/spinney-sesame-street-retire-1.4866199", "urlToImage": "https://i.cbc.ca/1.4754763.1532093654!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sesame-street.jpg", "publishedAt": "2018-10-17T13:58:17Z", "content": "The puppeteer who has played Big Bird on Sesame Street is retiring after nearly 50 years on the show. Caroll Spinney tells the New York Times that Thursday will be his last day on the program, which he joined from the start in 1969. In addition to Big Bird, t… [+473 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "Thursday will be a cold one", "description": "The sun will be out, but it will only help warm us psychologically, as the high only hits 4 C.", "url": "https://www.cbc.ca/news/canada/ottawa/ottawa-weather-october-18-2018-1.4867571", "urlToImage": "https://i.cbc.ca/1.2801162.1413487289!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/ottawa-weather-20141012-topix.jpg", "publishedAt": "2018-10-18T08:00:00Z", "content": "It is a particularly chilly start to the day. The sun will be out, but it will only help warm us psychologically, as the high only hits 4 C. A breeze will pick up a bit too, so bundle up. After another chilly night, temperatures are expected to climb into the… [+138 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Rachel Houlihan,Dave Seglins,Laura Clementson", "title": "'Hand caught in a cookie jar': Band managers demand answers about Ticketmaster's secret scalper program", "description": "Managers of popular musical acts such as Mumford & Sons, Mark Knopfler, Radiohead and the Pixies are blasting Ticketmaster over its secretive partnership with scalpers that was exposed in a recent CBC News investigation.", "url": "https://www.cbc.ca/news/business/ticketmaster-scalper-program-band-managers-1.4867652", "urlToImage": "https://i.cbc.ca/1.4867759.1539824764!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/mark-knopfler-and-marcus-mumford.jpg", "publishedAt": "2018-10-18T08:00:00Z", "content": "Managers of popular musical acts such as Mumford &amp; Sons, Mark Knopfler, Radiohead and the Pixies are blasting Ticketmaster over its secretive partnership with scalpers that was exposed in a recent CBC News investigation. In leaked emails obtained by CBC, … [+5421 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Rhiannon Johnson", "title": "New iNdigital space showcases digital and interactive media at imagineNATIVE", "description": "The rising popularity of digital interactive work like VR experiences and video games has spurred the imagineNATIVE film and media arts festival in Toronto to add a dedicated digital space this year.", "url": "https://www.cbc.ca/news/indigenous/indigital-imaginenative-festival-toronto-1.4865173", "urlToImage": "https://i.cbc.ca/1.4865463.1539732992!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/vr.JPG", "publishedAt": "2018-10-18T08:00:00Z", "content": "The rising popularity of digital interactive work like VR experiences and video games has spurred the imagineNATIVE film and media arts festival in Toronto to add a dedicated digital space this year. The new iNdigital Space will feature eight video games, fiv… [+1772 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Laura Osman", "title": "Bylaw 'swat team' to target pot smoking in city parks", "description": "The City of Ottawa has established a \"swat team\" of eight bylaw officers to keep pot smokers away from its parks.", "url": "https://www.cbc.ca/news/canada/ottawa/parks-by-law-cannabis-1.4866751", "urlToImage": "https://i.cbc.ca/1.4482756.1515687997!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/mexico-protest-marijuana.jpg", "publishedAt": "2018-10-18T08:00:00Z", "content": "The City of Ottawa has established a \"swat team\" of eight bylaw officers to keep pot smokers out of its parks. Smoking cannabis, like cigarettes, is banned in city parks and facilities, and the city is reinforcing that rule with some extra muscle. \"We don't w… [+1388 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Sherri Borden Colley", "title": "There are few black surfers in Nova Scotia. This actress wants to change that", "description": "Vinessa Antoine wants to change the narrative and is working with the Surfing Association of Nova Scotia to possibly start a surf program for people from North Preston.", "url": "https://www.cbc.ca/news/canada/nova-scotia/blacks-surfers-nova-scotia-north-preston-beach-diggstown-1.4866764", "urlToImage": "https://i.cbc.ca/1.4867072.1539802916!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/vinessa-antoine.jpg", "publishedAt": "2018-10-18T08:00:00Z", "content": "The opening scene of Diggstown, the new crime CBC TV drama set in Nova Scotia, shows corporate lawyer Marcie Diggs coming off a surf board at Martinique Beach on the province's Eastern Shore. It's rare to see black or brown people on boards here. So having le… [+4323 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "Pump prices a little less painful", "description": "The cost of gas is down. And that's not the only fuel type that has a lower cost as of Thursday morning.", "url": "https://www.cbc.ca/news/canada/newfoundland-labrador/gas-fuel-prices-drop-newfoundland-labrador-1.4866220", "urlToImage": "https://i.cbc.ca/1.4270520.1532052058!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/statcan-inflation-july-20170818.jpg", "publishedAt": "2018-10-18T08:30:00Z", "content": "It's a decrease right across the board when it comes to fuel in Newfoundland and Labrador. Gas saw the biggest drop of just under five cents a litre as of Thursday morning, as part of the Public Utilities Board's weekly price adjustment. The decline follows t… [+421 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Kristin Annable", "title": "'He told me to sit on his lap': 2nd woman comes forward with accusation against Manitoba MLA Cliff Graydon", "description": "CBC News spoke to numerous people who worked at the Manitoba Legislature in various roles, including cabinet ministers, who said it was widely acknowledged that the Emerson MLA made inappropriate comments directed at women.", "url": "https://www.cbc.ca/news/canada/manitoba/graydon-mla-2nd-harassment-accusation-1.4867329", "urlToImage": "https://i.cbc.ca/1.4867542.1539817636!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/cliff-graydon.png", "publishedAt": "2018-10-18T10:00:00Z", "content": "A former Manitoba legislative staffer was \"floored\" when she read the news that Emerson MLA Cliff Graydon told a female staffer to sit on his lap. That's because the staffer says Graydon made a near-identical comment to her five years ago. \"That is exactly wh… [+5103 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "A look inside 2 of Manitoba's first cannabis stores on Day 1 of legalized pot", "description": "CBC News went inside two of the first stores in Manitoba selling legal recreational cannabis — Tokyo Smoke in St. Boniface and the Delta 9 store on Dakota Street — to capture their opening day.", "url": "https://www.cbc.ca/news/canada/manitoba/marijuana-legalization-photo-essay-1.4866463", "urlToImage": "https://i.cbc.ca/1.4866868.1539806623!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/delta-9.jpg", "publishedAt": "2018-10-17T20:10:55Z", "content": null}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "Female staffer seriously injured in assault at referral centre for the homeless", "description": "Police have taken a man into custody after a female staffer at an assessment and referral centre was assaulted at the facility Wednesday afternoon.", "url": "https://www.cbc.ca/news/canada/toronto/woman-assaulted-at-streets-to-home-centre-1.4867218", "urlToImage": "https://i.cbc.ca/1.4555873.1519845044!/httpImage/image.jpg_gen/derivatives/16x9_620/li-620-police-car.jpg", "publishedAt": "2018-10-17T20:13:54Z", "content": "Police have taken a man into custody after a female staffer at an assessment and referral centre for the homeless was assaulted facility Wednesday afternoon. Police said the incident happened at the centre, which helps homeless people find shelter. It's locat… [+465 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "'Messenger' star formed right after Big Bang discovered by UVic researchers", "description": "A group of researchers, including astronomers from the University of Victoria, is one step closer to understanding what the early universe was like, with the discovery of one of its oldest-known stars.", "url": "https://www.cbc.ca/news/canada/british-columbia/messenger-star-formed-right-after-big-bang-discovered-by-uvic-researchers-1.4865824", "urlToImage": "https://i.cbc.ca/1.4865835.1539808099!/fileImage/httpImage/image._gen/derivatives/16x9_620/young-universe.", "publishedAt": "2018-10-17T20:36:11Z", "content": "A group of researchers, including astronomers from the University of Victoria, is one step closer to understanding what the early universe was like, with the discovery of one of its oldest-known stars. \"A 13 billion-year-old star. Isn't that amazing?\" Kim Ven… [+2941 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "The Associated Press", "title": "Rise in cases of rare polio-like illness in U.S. children, officials say", "description": "Waves of the mysterious condition that causes muscle weakness seems to appear every other year in the U.S., according to the Centers for Disease Control and Prevention.", "url": "https://www.cbc.ca/news/health/acute-flaccid-myelitis-paralyzing-illness-children-1.4866832", "urlToImage": "https://i.cbc.ca/1.2945254.1423082328!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/hospital-bed.jpg", "publishedAt": "2018-10-17T19:13:53Z", "content": "U.S. health officials have reported a jump in cases of a rare paralyzing illness in children, and say it seems to be following an every-other-year pattern. At least 62 cases have been confirmed in 22 states this year, and at least 65 additional illnesses in t… [+1890 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "David Bell", "title": "'Wild West' of online hate could result from NAFTA replacement, associate law prof warns", "description": "The NAFTA-replacing trade agreement that was recently signed could open the door to online hate speech and revenge porn because companies like Facebook and Google will no longer be held liable for that content, a Calgary law professor warns.", "url": "https://www.cbc.ca/news/canada/calgary/usmca-provision-online-hate-canada-u-s-1.4866930", "urlToImage": "https://i.cbc.ca/1.4866967.1539800887!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/online-hate.jpg", "publishedAt": "2018-10-17T19:10:26Z", "content": "The NAFTA-replacing trade agreement that was recently signed could open the door to the Wild West of online hate speech and revenge porn because companies like Facebook and Google will no longer be held liable for that content, a Calgary law professor warns. … [+5859 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "Ontario killer and rapist Paul Bernardo denied parole", "description": "Ontario killer and rapist Paul Bernardo was denied parole at a hearing in eastern Ontario today. It was attended by family members of some of his victims and one of his survivors.", "url": "https://www.cbc.ca/news/canada/toronto/bernardo-parole-mahaffy-french-1.4866556", "urlToImage": "https://i.cbc.ca/1.3136869.1539720443!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/toronto-paul-bernardo.jpg", "publishedAt": "2018-10-17T16:22:15Z", "content": "UPDATE: The parole board has decided Paul Bernardo will remain behind bars. In his first attempt at getting parole, the Ontario rapist and killer was denied. Earlier story appears below The mother of one of Paul Bernardo's victims told his parole board hearin… [+3507 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "Man on mobility scooter in 'serious condition' after being struck by vehicle", "description": "Police said they have ruled out alcohol, drugs and speed as factors in the crash, but their investigation is still ongoing.", "url": "https://www.cbc.ca/news/canada/british-columbia/man-on-mobility-scooter-in-serious-condition-after-being-struck-by-vehicle-1.4867888", "urlToImage": "https://i.cbc.ca/1.4345850.1523664634!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/stock-crime-scene-police-tape-do-not-cross-yellow-tape-forensics-investigation-generic.jpg", "publishedAt": "2018-10-18T09:14:10Z", "content": "A pedestrian is in serious condition after a crash in Surrey Wednesday afternoon. Surrey RCMP responded to the call at around 3:30 p.m. at the intersection of Green Timbers Way and 140 Street. The 59-year-old man was crossing 140 Street in a mobility scooter … [+341 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Justin McElroy,Tamara Baluja", "title": "With 3 days left until the election, here's what you need to know", "description": "Three. Days. Left.", "url": "https://www.cbc.ca/news/canada/british-columbia/with-3-days-left-until-the-election-here-s-what-you-need-to-know-1.4867818", "urlToImage": "https://i.cbc.ca/1.4516062.1527699522!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ballot-box.jpg", "publishedAt": "2018-10-18T13:00:57Z", "content": "Want to know what really matters for the municipal elections in Metro Vancouver? This is your newsletter. Three. Days. Left. Over the past three months, we've talked about the ups and downs of the election campaign. If you're a candidate, it's down to getting… [+14021 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC Sports", "title": "Watch Canada's Sports Hall of Fame officially induct 2018 class", "description": "Watch live today at 10 a.m. ET as Canada’s Sports Hall of Fame introduces the class of 2018 from Toronto. The class consists of eight inductees — six athletes and two builders.", "url": "https://www.cbc.ca/sports/canada-s-sports-hall-of-fame-officially-induct-2018-class-1.4867961", "urlToImage": "https://i.cbc.ca/1.4635655.1524692379!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/keon-dave-070217-1180.jpg", "publishedAt": "2018-10-18T12:41:23Z", "content": "Watch live today at 10 a.m. ET as Canada's Sports Hall of Fame introduces the class of 2018 from Toronto. The class consists of of eight inductees six athletes and two builders. Hockey Hall of Famer Dave Keon leads a class that also includes a four-time Grey … [+530 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Scott Russell", "title": "Winter is coming, but will the Games return to Calgary?", "description": "The road to the next Olympic Winter Games may have Beijing as its ultimate destination, but, as Scott Russell writes, the curtain goes up on the winter sport season with one overarching story dominating the winter sport narrative: Will Calgary take the plunge…", "url": "https://www.cbc.ca/sports/olympics/scott-russell-rttog-season-preview-calgary-2026-1.4867551", "urlToImage": "https://i.cbc.ca/1.4868007.1539868993!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/app2001061460086.jpg", "publishedAt": "2018-10-18T13:35:45Z", "content": "We are on the threshold of winter and in a country where ice tends to run through our sporting vein s, the sweet season is about to commence. The road to the next Olympic Winter Games has Beijing as its ultimate destination, but that's more than a thousand da… [+5499 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Brett Ruskin", "title": "Internet videos show how underage users can order pot online in Nova Scotia", "description": "By modifying the cookies associated with the Nova Scotia Liquor Corporation website, users have found a way to access the cannabis catalogue without an age-verified code.", "url": "https://www.cbc.ca/news/canada/nova-scotia/internet-videos-show-how-underage-users-can-order-pot-online-in-nova-scotia-1.4649602", "urlToImage": "https://i.cbc.ca/1.4861638.1539384579!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/canada-legalized-marijuana-20181012.jpg", "publishedAt": "2018-10-18T13:31:18Z", "content": "One day after recreational marijuana became legal in Canada, internet users have found a way to sidestep the initial age-verification process for online pot purchases in Nova Scotia. According to at least one video tutorial online, the Nova Scotia Liquor Corp… [+1432 chars]"}]}