{"status": "ok", "totalResults": 1331, "articles": [{"source": {"id": "fortune", "name": "Fortune"}, "author": "Don Reisinger", "title": "Uber May Be Preparing to Spin Off Its Self-Driving Car Unit", "description": "Uber has been working on autonomous vehicles for years. And now, the company might opt for something a little different.", "url": "http://fortune.com/2018/10/17/uber-self-driving-car-spinoff/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-1028930552.jpg", "publishedAt": "2018-10-17T14:18:27Z", "content": "Uber is considering spinning off its self-driving car unit, but still retaining control, according to a new report. The ride-hailing company is mulling the possibility of spinning off the self-driving car unit into its own entity and taking investments from o… [+1353 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Natasha Bach", "title": "Rupert Murdoch’s Children Are in Line for a $2 Billion Payday—Each—When the Family Media Empire Breaks Up", "description": "Based on the 21st Century Fox shares held by the Murdoch Family Trust, each Murdoch child is due to receive $2 billion from the sale.", "url": "http://fortune.com/2018/10/17/21st-century-fox-sale-murdoch-family-trust/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-1031795884.jpg", "publishedAt": "2018-10-17T14:10:30Z", "content": "Rupert Murdochs six children are heading toward a hefty pay day. Following the breakup of Murdochs media empire and completion of the sale of 21st Century Fox to Disney (dis), each of Murdochs children will receive $2 billion, according to The Financial Times… [+995 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Bloomberg", "title": "IBM Stock Falls the Most in 4 Years After Quarterly Earnings Disappoint", "description": "IBM stock tumbled as much as 8.1 percent to $133.43 in New York, bringing losses so far this year to 12 percent.", "url": "http://fortune.com/2018/10/17/ibm-stock-price-earnings-2018/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/ibm-stock-price.jpg", "publishedAt": "2018-10-17T15:27:36Z", "content": "International Business Machines Corp. shares dropped the most in four years Wednesday after the company missed analysts quarterly revenue estimates, ending a short-lived streak of sales gains and casting doubt on its strategy to boost growth through new busin… [+3957 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Aaron Pressman, Adam Lashinsky", "title": "Data Sheet—Some More Skepticism About Blockchains, Bitcoins, and What Not", "description": "Fortune's Global Forum in Toronto discussed whether blockchain technology, derived from bitcoin, will prove useful or not.", "url": "http://fortune.com/2018/10/18/data-sheet-blockchain-bitcoin/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/43569522100_b616d8368e_k.jpg", "publishedAt": "2018-10-18T12:46:24Z", "content": "On the concluding morning of the Fortune Global Forum in Toronto Wednesday, Fortune s Jeff John Roberts began a panel on blockchain technology by asking who in the audience was skeptical about blockchain. I raised my hand. Fortune s Alan Murray, who was sitti… [+2785 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Bloomberg", "title": "Microsoft Co-Founder Paul Allen Left $26 Billion Behind. His Estate Could Take Years to Unravel", "description": "Paul Allen’s family office will live long and prosper.", "url": "http://fortune.com/2018/10/18/paul-allen-estate-net-worth/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/paul-allen-e1539875448940.jpg", "publishedAt": "2018-10-18T15:12:34Z", "content": "Paul Allens family office will live long and prosper. The billionaires vast holdings at Vulcan Inc. — with real estate, art, sports teams and venture capital stakes — would take years to unravel, if thats even what he wanted. Allen, who died Monday, had no sp… [+4362 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Natasha Bach", "title": "U.S. Voter Turnout for the Midterm Elections in November Could Hit a 50-Year High", "description": "A professor estimates that as many as 45-50% of eligible voters will go to the polls in November, a level not seen since the 1970s.", "url": "http://fortune.com/2018/10/18/midterms-voter-turnout-prediction/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-972438496-e1539870405381.jpg", "publishedAt": "2018-10-18T13:53:35Z", "content": "November could see the highest voter turnout in 50 years, based on a new prediction this week. Michael McDonald, a University of Florida professor who studies voter turnout, told NPR that turnout this year could be at a rate that most people have never experi… [+1624 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Kevin Kelleher", "title": "Netflix Is Ending ‘Orange Is the New Black’ After the Landmark Series’ Upcoming Seventh Season", "description": "Netflix is canceling Orange Is the New Black after its seventh season airs in 2019. The show won three Emmys and was a hit for Netflix.", "url": "http://fortune.com/2018/10/17/netflix-ending-orange-is-the-new-black-seventh-season/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-453186096.jpg", "publishedAt": "2018-10-18T00:30:15Z", "content": "Netflix said Wednesday it’s canceling Orange Is the New Black, one of the most popular of its original series. A video posted to the show’s official Twitter account said it will end after its upcoming seventh season airs next year. Orange Is the New Black was… [+1505 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Grace Dobush", "title": "Starbucks Is Downsizing Dramatically in Europe, a Market It Still Can’t Crack", "description": "Latin American partner Alsea is taking over operations across the continent, where selling American coffee has been a tall order.", "url": "http://fortune.com/2018/10/19/starbucks-sale-european-operations/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-1044192050.jpg", "publishedAt": "2018-10-19T11:24:20Z", "content": "Starbucks (sbux) is selling 83 company-owned stores in France and the Netherlands to its longtime Mexican partner, Alsea SAB (alssf). Alsea will also provide services to 179 other Starbucks locations owned by franchisees in France, the Netherlands, Belgium an… [+1737 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Bloomberg", "title": "This Man Will Accept Bitcoin Payment for His $15.9 Million Mansion", "description": "Roy Niederhoffer is reluctantly placing the 10,720-square-foot, 32-foot-wide mansion on the market.", "url": "http://fortune.com/2018/10/19/roy-niederhoffer-bitcoin-buy-house/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/roy-niederhoffer-e1539964286988.jpg", "publishedAt": "2018-10-19T15:53:01Z", "content": "In 2013, Roy Niederhoffer, the president of New York-based R.G. Niederhoffer Capital Management, Inc., was in need of a place to live. Hed begun a long-term construction project to renovate a house in Manhattan, but in the meantime, he and his young family we… [+5377 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Clay Chandler", "title": "How China Aims to Win the 5G Race", "description": "China is supporting its home grown companies like Huawei as it races to offer 5G wireless service before other countries.", "url": "http://fortune.com/2018/10/19/chine-5g-wireless-race/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-1045293600.jpg", "publishedAt": "2018-10-19T16:15:05Z", "content": "This article first appeared in Data Sheet, Fortunes daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here. China, the world’s largest mobile market by subscriber and network size, is determined to become the world leade… [+2586 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Robert Hackett", "title": "Crypto Startup That Lets You ‘Short’ Ethereum Just Raised $10 Million", "description": "An Ethereum crypto startup, dYdX, which creates financial products for loans, short sells, and leveraged long bets, just raised $10 million.", "url": "http://fortune.com/2018/10/19/crypto-ethereum-short-token-dydx/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-951165810.jpg", "publishedAt": "2018-10-19T16:14:58Z", "content": "An Ethereum-based startup called dYdX just landed $10 million in funding from investors. The 5-person company has developed a margin trading protocol, open source software that lets people borrow money from one another in the interest of creating new cryptocu… [+4891 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Jaclyn Trop", "title": "General Motors Is Leading the Charge Toward Gender Equality in the Automotive Industry", "description": "Its board has gender parity.", "url": "http://fortune.com/2018/10/19/general-motors-is-leading-the-charge-toward-gender-equality-in-the-automotive-industry/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2017/06/538551988.jpg", "publishedAt": "2018-10-19T15:31:27Z", "content": "With a female chief executive, gender parity among its board of directors, and strides toward equal pay, General Motors is leading the automotive industry toward equality. The Detroit automaker, which recently named Dhivya Suryadevara to the chief financial o… [+2794 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "FORTUNE.COM/Grace Dobush", "title": "The Controversial Reason Rihanna Turned Down the 2019 Super Bowl Halftime Show", "description": "Here's why Maroon 5 is now facing calls to drop out, too.", "url": "https://fortune.com/2018/10/19/rihanna-super-bowl-haltime-show-2019-kaepernick-maroon-5/", "urlToImage": "https://cdn-img.instyle.com/sites/default/files/styles/622x350/public/images/2018/09/gettyimages-460340658_0.jpg?itok=7dprtVqR", "publishedAt": "2018-10-19T14:00:00Z", "content": "Maroon 5 is headlining next years Super Bowl only because Rihanna turned the gig down out of support for Colin Kaepernick, US Weekly reports. An insider told the magazine: The NFL and CBS really wanted Rihanna to be next years performer in Atlanta. They offer… [+2005 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Bloomberg", "title": "PayPal Beats 3rd-Quarter Earnings Estimates. Here’s What Analysts Think", "description": "PayPal Holdings Inc. rallied as much as 9.5 percent after beating third-quarter estimates.", "url": "http://fortune.com/2018/10/19/paypal-stock-earnings-venmo-2018/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/paypal-stock-earnings-e1539956974842.jpg", "publishedAt": "2018-10-19T13:50:23Z", "content": "PayPal Holdings Inc. rallied as much as 9.5 percent after beating third-quarter estimates, boosting its 2018 forecast and providing 2019 guidance that was in-line with three- to five-year targets. But analysts said the real bright spot in the earnings report … [+3224 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Grace Dobush", "title": "Bitcoin Scammer Hit With $2.5 Million Fine for Ponzi Scheme that Promised Outrageous Returns", "description": "Nicholas Gelfman claimed to have a computer program that gave clients up to 11% returns on bitcoin trading. Spoiler alert: He didn't.", "url": "http://fortune.com/2018/10/19/bitcoin-ponzi-scheme-scammer/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-10519352861.jpg", "publishedAt": "2018-10-19T10:12:19Z", "content": "Nicholas Gelfman claimed to have a high-frequency trading computer program that could mine profits from Bitcoin, saying that his clients typically earned 7-11% monthly return on their Bitcoins. He collected more than $600,000 from at least 80 eager investors … [+1357 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Claire Zillman, Emma Hinchliffe", "title": "WeWork Rent the Runway, Heidi Cruz, Cyan Banister: Broadsheet October 19", "description": "The Broadsheet, Fortune Most Powerful Women by Kristen Bellstrom and Claire Zillman", "url": "http://fortune.com/2018/10/19/wework-rent-the-runway-heidi-cruz-cyan-banister-broadsheet-october-19/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "publishedAt": "2018-10-19T11:56:05Z", "content": "• Fully onboard? A new PwC survey of corporate directors out this week provided some head-scratching results. First, the good news: some 94% of directors agree that board diversity brings unique perspectives to the boardroom, and 84% say it enhances board per… [+1770 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Lucas Laursen", "title": "StarKist Pleads Guilty to a Price-Fixing Scheme That Forced Customers to Overpay for Canned Tuna", "description": "The fine, which will be subject to court approval of the plea deal, could be as high as $100 million.", "url": "http://fortune.com/2018/10/19/starkist-tuna-price-fixing-plea/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-515323236.jpg", "publishedAt": "2018-10-19T11:49:38Z", "content": "StarKist Co. will plead guilty to a felony charge of price-fixing and pay a fine, the U.S. Department of Justice said yesterday in a statement. The fine, which will be subject to court approval of the plea deal, could be as high as $100 million. It is part of… [+1759 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Lisa Marie Segarra", "title": "Atari CEO Talks U.S. Nasdaq Listing and Bringing the Company Back From the Brink", "description": "Atari CEO Frédéric Chesnais spoke with Fortune about where the company is today after it announced its international Nasdaq listing.", "url": "http://fortune.com/2018/10/18/atari-ceo-q-and-a/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/atari-ceo-nasdaq-e1539902706318.jpg", "publishedAt": "2018-10-19T00:16:10Z", "content": "Atari pioneered the move of video games from arcades to homes in the 1970s and 80s. With massive successes like Pong, one of the many titles played on Atari’s hit console, the company cemented itself into video game history. Atari then went into a slow declin… [+6497 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Jonathan Vanian", "title": "Facebook’s Recent Big Hack Was Reportedly Caused by Spammers", "description": "Facebook's recent hack that affected about 30 million people was reportedly caused by spammers and not foreign entities.", "url": "http://fortune.com/2018/10/18/facebook-data-hack-spammers/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-1052025274-e1539897127357.jpg", "publishedAt": "2018-10-18T21:48:42Z", "content": "Facebook’s recent hack that affected around 30 million people may have been caused by spammers, rather than entities tied to certain nation states. That’s according to a report on Thursday by The Wall Street Journal citing anonymous sources familiar with the … [+2306 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Erin Corbett", "title": "Can You Get the Flu From a Flu Shot? Experts Weigh In", "description": "Here's what experts have to say about whether you can get the flu from the flu shot.", "url": "http://fortune.com/2018/10/17/flu-after-flu-shot-from-flu-shot/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/flu-shot.jpg", "publishedAt": "2018-10-17T18:22:03Z", "content": "Flu season is upon us and the Centers for Disease Control and Prevention is recommending that everyone get a flu shot this year, from ages six months old and up. But some people might wonder, can you get the flu from a flu shot? Here’s what the experts say. I… [+2043 chars]"}]}