{"status": "ok", "totalResults": 3248, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Bradford Betz", "title": "Roseanne Barr takes to Twitter to blast character's fate on show - Fox News", "description": "Fox News Roseanne Barr takes to Twitter to blast character's fate on show Fox News \"The Conner's\" star Emma Kenney says filming ABC's spinoff without Roseanne Barr is going smoothly. SPOILER ALERT. Roseanne Barr on Tuesday blasted ABC for the morbid direction…", "url": "https://www.foxnews.com/entertainment/roseanne-barr-takes-to-twitter-to-blast-characters-fate-on-show", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/AP18289672360848.jpg", "publishedAt": "2018-10-17T12:49:04Z", "content": "SPOILER ALERT Roseanne Barr on Tuesday blasted ABC for the morbid direction it took with “The Conners” — a spinoff of the “Roseanne” reboot that was axed earlier this year after Barr posted a racist tweet about an Obama-era official. “The Conners,” which prem… [+2127 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "WATCH: Antarctic ice makes frightening 'singing' sounds - Fox News", "description": "Fox News WATCH: Antarctic ice makes frightening 'singing' sounds Fox News Winds blowing across snow dunes on Antarctica's Ross Ice Shelf cause the massive ice slab's surface to vibrate, producing a near-constant drumroll of seismic 'tones' scientists could po…", "url": "https://www.foxnews.com/science/antarctic-ice-makes-frightening-singing-sounds", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/antarctica-SINGING.jpg", "publishedAt": "2018-10-17T15:29:00Z", "content": "Scientists have discovered eerie \"singing\" sounds coming from ice shelves in Antarctica as they observed seismic changes to the Ross Ice Shelf. The scientists began their observations in 2014 on the Ross Ice Shelf, Antarctica's largest and \"a Texas-sized plat… [+1506 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Runner praised for helping legally blind competitor who fell", "description": "A New York high school cross-country athlete is being praised for stopping to help a vision-impaired runner who fell as they neared the finish line.", "url": "https://www.foxnews.com/health/runner-praised-for-helping-legally-blind-competitor-who-fell", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/Blind_runner.jpg", "publishedAt": "2018-10-18T14:11:51Z", "content": "AUBURN, N.Y. A New York high school cross-country athlete is being praised for stopping to help a vision-impaired runner who fell as they neared the finish line. Syracuse.com reports that Cazenovia High School sophomore Jake Tobin only had about 320 yards (29… [+580 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Chris Ciaccia", "title": "Comets and asteroids could be flinging life all over the galaxy, study finds", "description": "If you're wondering where E.T. is, he might be riding on a comet across the galaxy, according to a new study.", "url": "https://www.foxnews.com/science/comets-and-asteroids-could-be-flinging-life-all-over-the-galaxy-study-finds", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/bfb20744-oumuamua.jpg", "publishedAt": "2018-10-18T14:44:13Z", "content": "If you're wondering where E.T. is, he might be riding on a comet across the galaxy, according to a new study. The study, published in The Astronomical Journal, details the implications of comet-like objects that could be \"ferrying\" microbial life across thous… [+3406 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Alexandria Hein", "title": "Ohio boy gets custom Halloween costume to fit wheelchair", "description": "A 5-year-old boy in Ohio is all set for Halloween after his family created a custom costume to fit around his wheelchair.", "url": "https://www.foxnews.com/health/ohio-boy-gets-custom-halloween-costume-to-fit-wheelchair", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/blake_school_bus.jpg", "publishedAt": "2018-10-18T13:40:25Z", "content": "A 5-year-old boy in Ohio is all set for Halloween after his family created a custom costume to fit around his wheelchair. Blake Mompher, who has spina bifida, will make his rounds disguised as a “Blake County Schools” bus. “He’s just a boy who loves buses, tr… [+1174 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "Soros-backed group fires operative after arrest over alleged battery against GOP campaign manager", "description": "The liberal group American Bridge 21st Century announced Wednesday night that it had fired one of its operatives a day after he was arrested and accused of battery against the female campaign manager for Nevada GOP gubernatorial candidate Adam Laxalt.", "url": "https://www.foxnews.com/politics/soros-backed-group-fires-operative-after-arrest-over-alleged-battery-against-gop-campaign-manager", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/stark-2.jpg", "publishedAt": "2018-10-17T23:54:05Z", "content": "The liberal group American Bridge 21st Century announced Wednesday night that it had fired one of its operatives a day after he was arrested and accused of battery against the female campaign manager for Nevada GOP gubernatorial candidate Adam Laxalt. In a st… [+3363 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Vietnam War hero sentenced to 7 years for decades-old rifle purchase: report", "description": "A decorated Vietnam veteran and firearms collector was sentenced to seven years in federal prison Wednesday for a decades-old purchase of a rifle.", "url": "https://www.foxnews.com/us/vietnam-war-hero-sentenced-to-7-years-for-decades-old-rifle-purchase-report", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/6c25564b-AP6.jpg", "publishedAt": "2018-10-18T05:31:35Z", "content": "A decorated Vietnam veteran and firearms collector was sentenced to seven years in federal prison Wednesday for a decades-old purchase of a rifle. Alfred Pick, 70, purchased the M14 -- a fully automatic weapon illegal to own -- at a Ft. Worth gun show in the … [+1448 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'reilly", "title": "Feinstein wants Kavanaugh sexual misconduct investigation reopened if Dems take Senate", "description": "Sen. Dianne Feinstein, D-Calif., said on Wednesday that if Democrats took control of the Senate following November’s midterm elections than she would be in favor of reopening an investigation into the sexual misconduct allegations levelled against Supreme Cou…", "url": "https://www.foxnews.com/politics/feinstein-wants-kavanaugh-sexual-misconduct-investigation-reopened-if-dems-take-senate", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2018/09/27/694940094001_5841222397001_5841218890001-vs.jpg", "publishedAt": "2018-10-17T20:53:24Z", "content": "Sen. Dianne Feinstein, D-Calif., said Wednesday that if Democrats took control of the Senate following November’s midterm elections, she would be in favor of reopening an investigation into the sexual misconduct allegations levelled against Supreme Court Just… [+1941 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Laura Ingraham", "title": "Laura Ingraham: Republicans must unite (just like they did with Kavanaugh) over lawlessness at the border - Fox News", "description": "Fox News Laura Ingraham: Republicans must unite (just like they did with Kavanaugh) over lawlessness at the border Fox News As our cable competitors are devoting hours of coverage today to the president's tweets about Stormy Daniels, voters I think are just t…", "url": "https://www.foxnews.com/opinion/laura-ingraham-republicans-must-unite-over-lawlessness-at-the-border", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2018/10/17/694940094001_5849690459001_5849687030001-vs.jpg", "publishedAt": "2018-10-17T14:54:38Z", "content": "As our cable competitors are devoting hours of coverage today to the president's tweets about Stormy Daniels, voters I think are just tuning it out. Why? Because the voters are smarter than the media thinks they are. Americans outside the leftist activist bub… [+5133 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gregg Re", "title": "Treasury employee charged with leaking financial info on Trump team was arrested with flash drive in hand, prosecutors say", "description": "The top Treasury Department employee who was arrested and charged by federal authorities with leaking confidential financial documents pertaining to former Trump officials was apprehended with a flash drive containing the allegedly pilfered information in-han…", "url": "https://www.foxnews.com/politics/treasury-employee-charged-with-leaking-financial-info-of-trump-team", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/Deficit-Trillion-Treasury.jpg", "publishedAt": "2018-10-17T20:28:17Z", "content": "The top Treasury Department employee who was arrested and charged by federal authorities with leaking confidential financial documents pertaining to former Trump officials was apprehended with a flash drive containing the allegedly pilfered information in her… [+8305 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Thomas Byrne", "title": "President Trump Seeking 5 Percent Budget Cut", "description": "On the heels of the largest budget deficit in six years. President Trump is pushing his Cabinet to find cuts. FOX's Jared Halpern has more from Washington: President Trump is requesting each Cabinet Secretary to cut five percent from their budgets next year: …", "url": "https://radio.foxnews.com/2018/10/17/president-trump-seeking-5-percent-budget-cut/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2018/10/Trump.jpg", "publishedAt": "2018-10-17T16:31:54Z", "content": "Play Audio Clip Listen to audio clip. On the heels of the largest budget deficit in six years. President Trump is pushing his Cabinet to find cuts. FOX's Jared Halpern has more from Washington: President Trump is requesting each Cabinet Secretary to cut five … [+637 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "James Rogers", "title": "NASA astronaut describes dramatic escape from failed Soyuz rocket", "description": "NASA astronaut Nick Hague has described his dramatic escape from a failed Soyuz rocket just minutes after its launch last week.", "url": "https://www.foxnews.com/science/nasa-astronaut-describes-dramatic-escape-from-failed-soyuz-rocket", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/NASANickHagueGetty2018.jpg", "publishedAt": "2018-10-17T18:20:01Z", "content": "NASA astronaut Nick Hague has described his dramatic escape from a failed Soyuz rocket just minutes after its launch last week. After blasting into the sky from the Baikonur Cosmodrome in Kazakhstan, a problem with the separation of first and second stage boo… [+4216 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "William Sanchez", "title": "10/17/18 Starnes First Hour", "description": "The first hour of the Todd Starnes Radio Show on FOX News Talk - 12pm Eastern M-F.", "url": "https://radio.foxnews.com/2018/10/17/10-17-18-starnes-first-hour/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2016/07/news_banner_featured_image-150x150.jpg", "publishedAt": "2018-10-17T16:00:00Z", "content": "The first hour of the Todd Starnes Radio Show on FOX News Talk - 12pm Eastern M-F."}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Jo Dee Messina letting God 'take charge' in cancer battle - Fox News", "description": "Fox News Jo Dee Messina letting God 'take charge' in cancer battle Fox News Jo Dee Messina performing during the 2nd annual Christmas Concert at Brentwood United Methodist Church in December 2010 in Brentwood, Tennessee. (Getty, File). Country singer Jo Dee M…", "url": "https://www.foxnews.com/entertainment/jo-dee-messina-letting-god-take-charge-in-cancer-battle", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/jo-dee-messina-getty.jpg", "publishedAt": "2018-10-17T21:50:19Z", "content": "Country singer Jo Dee Messina is letting God \"take charge\" in her ongoing battle with cancer. The 48-year-old was first diagnosed with cancer in September 2017 but she hasn't let that change her relationship with God. She said she tried to soften the blow for… [+1327 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nicole Darrah", "title": "Mom recorded chasing 14-year-old son who took her BMW, whipping him with belt - Fox News", "description": "Fox News Mom recorded chasing 14-year-old son who took her BMW, whipping him with belt Fox News A Texas mother has gone viral after her 13-year-old son stole her new BMW to go to his girlfriend's house. A Texas mom was caught furiously whipping her son after …", "url": "https://www.foxnews.com/us/mom-recorded-chasing-14-year-old-son-who-took-her-bmw-whipping-him-with-belt", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2018/10/17/694940094001_5850120573001_5850123445001-vs.jpg", "publishedAt": "2018-10-18T00:09:14Z", "content": "A Texas mom was caught furiously whipping her son after he apparently took her new BMW and tried driving it to his friend’s house. In a series of now-viral tweets posted on Friday, sister Liza Campero, of El Paso, detailed what happened with her 14-year-old b… [+973 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Caleb Parke", "title": "Ole Miss professor condemned for tweeting Senators ‘don’t deserve your civility’", "description": "An assistant professor at the University of Mississippi has come under fire for calling on people to interrupt and harass senators in public.", "url": "https://www.foxnews.com/us/ole-miss-professor-condemned-for-claiming-senators-dont-deserve-your-civility", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/James-Thomas-twet.jpg", "publishedAt": "2018-10-17T16:52:58Z", "content": "An assistant professor at the University of Mississippi has come under fire for calling on people to interrupt and harass senators in public. Ole Miss Chancellor Jeffrey Vitter condemned a post on social media by Assistant Professor of Sociology James Thomas … [+2603 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Suspects in Khashoggi case linked to Saudi crown prince", "description": "Saudi Crown Prince Mohammed bin Salman has been praised as a reformer but also faced criticism from the West; State Department correspondent Rich Edson reports", "url": "http://video.foxnews.com/v/5850101384001/", "urlToImage": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/10/17/640/360/694940094001_5850102598001_5850101384001-vs.jpg", "publishedAt": "2018-10-17T22:26:03Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "'First Man' star Claire Foy calls Donald Trump 'the giant penis of America'", "description": "'First Man' star Claire Foy calls Donald Trump 'the giant penis of America' foxnews.com", "url": "https://www.foxnews.com/entertainment/first-man-star-claire-foy-calls-donald-trump-giant-penis-of-america", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/clairefoy.jpg", "publishedAt": "2018-10-19T11:56:35Z", "content": "British actress Claire Foy shared her views about President Trump, calling him “the giant penis of America” in a new interview. “The Crown” actress opened up about politics in a profile with The Hollywood Reporter released Wednesday. “All powerful! D.C. is wh… [+2907 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Lucia Suarez Sang", "title": "US student detained in Israel for BDS support allowed to enter Jewish state after deportation overturned", "description": "Israel's Supreme Court said Thursday an American graduate student stuck for more than two weeks in immigration limbo will be allowed to enter the country, ruling the woman's desire to study in the Jewish state undermined her previous support of an anti-Israel…", "url": "https://www.foxnews.com/world/us-student-detained-in-israel-for-bds-support-allowed-to-enter-jewish-state-after-deportation-overturned", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/ContentBroker_contentid-99be1bfd2c5c49949de3f8f3dc1c0f98.png", "publishedAt": "2018-10-19T13:30:14Z", "content": "Israel's Supreme Court said Thursday an American graduate student stuck for more than two weeks in immigration limbo will be allowed to enter the country, ruling the woman's desire to study in the Jewish state undermined her previous support of an anti-Israel… [+2953 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gary Gastelu", "title": "Ford Mustang Shelby GT500 leaked and dealers told four-door Mustang is in the works, reports say - Fox News", "description": "Fox News Ford Mustang Shelby GT500 leaked and dealers told four-door Mustang is in the works, reports say Fox News Ford's new snake has slithered out of its hole. Photos of the upcoming 2020 Mustang Shelby GT500 muscle car surreptitiously taken at a private F…", "url": "https://www.foxnews.com/auto/ford-mustang-shelby-gt500-leaked-and-dealers-told-four-door-mustang-is-in-the-works-reports-say", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/gt500.jpg", "publishedAt": "2018-10-19T16:08:24Z", "content": "Ford’s new snake has slithered out of its hole. Photos of the upcoming 2020 Mustang Shelby GT500 muscle car surreptitiously taken at a private Ford dealer event in Las Vegas were posted to Instagram on Thursday and offer the best look yet at what’s set to be … [+1432 chars]"}]}