{"status": "ok", "totalResults": 3252, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Bradford Betz", "title": "Roseanne Barr takes to Twitter to blast character's fate on show - Fox News", "description": "Fox News Roseanne Barr takes to Twitter to blast character's fate on show Fox News \"The Conner's\" star Emma Kenney says filming ABC's spinoff without Roseanne Barr is going smoothly. SPOILER ALERT. Roseanne Barr on Tuesday blasted ABC for the morbid direction…", "url": "https://www.foxnews.com/entertainment/roseanne-barr-takes-to-twitter-to-blast-characters-fate-on-show", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/AP18289672360848.jpg", "publishedAt": "2018-10-17T12:49:04Z", "content": "SPOILER ALERT Roseanne Barr on Tuesday blasted ABC for the morbid direction it took with “The Conners” — a spinoff of the “Roseanne” reboot that was axed earlier this year after Barr posted a racist tweet about an Obama-era official. “The Conners,” which prem… [+2127 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Travis Fedschun", "title": "California bus crash injured 40, moment of impact seen in dashcam video - Fox News", "description": "Fox News California bus crash injured 40, moment of impact seen in dashcam video Fox News Newly released dashcam video shows the terrifying moment Sunday a bus lost control on a freeway in Southern California, careening out of control, smashing into a center …", "url": "https://www.foxnews.com/us/california-bus-crash-injured-40-moment-of-impact-seen-in-dashcam-video", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/buscrash__.jpg", "publishedAt": "2018-10-17T13:42:17Z", "content": "Newly released dashcam video shows the terrifying moment Sunday a bus lost control on a freeway in Southern California, careening out of control, smashing into a center divider and injuring dozens of people. The crash took place on the 405 Freeway in the San … [+1861 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Madeline Farber", "title": "Virginia homeowner finds nearly 50-pound ‘aggressive’ snapping turtle in yard", "description": "A homeowner in Chesterfield, Virginia, found a rather prehistoric looking creature in their yard last Friday: a massive common snapping turtle.", "url": "https://www.foxnews.com/science/virginia-homeowner-finds-nearly-50-pound-aggressive-snapping-turtle-in-yard", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/turtle-richmond-wildlife-1.jpg", "publishedAt": "2018-10-17T16:04:21Z", "content": "A homeowner in Chesterfield, Virginia, found a rather prehistoric looking creature in their yard last Friday: a massive common snapping turtle. The turtle, which weighed 48.6 pounds, is “the largest common snapping turtle our center has examined in 5 years,” … [+1419 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Kristen Bell voices concern about message 'Snow White' sends to daughters - Fox News", "description": "Scottish Daily Record Kristen Bell voices concern about message 'Snow White' sends to daughters Fox News Kristen Bell, the voice of Anna in Disney's hit animated film \"Frozen,\" revealed in an interview published Wednesday her concerns about the message \"Snow …", "url": "https://www.foxnews.com/entertainment/kristen-bell-voices-concern-about-message-snow-white-sends-to-daughters", "urlToImage": "http://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2018-10-18T08:49:29Z", "content": "Kristen Bell, the voice of Anna in Disney's hit animated film \"Frozen,\" revealed in an interview published Wednesday her concerns about the message \"Snow White\" sends to her two daughters. Bell told Parents magazine that she asks her daughters, \"Don't you thi… [+1543 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Frank Miles", "title": "Marine veteran, 80, to receive Medal of Honor for Vietnam bravery", "description": "Marine veteran, 80, to receive Medal of Honor for Vietnam bravery foxnews.com", "url": "https://www.foxnews.com/us/marine-veteran-80-to-receive-medal-of-honor-for-vietnam-bravery", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/Sergeant-Major-John-Canley.jpg", "publishedAt": "2018-10-17T19:50:56Z", "content": "Marine veteran John Canley will receive the nation’s highest military honor Wednesday for his “conspicuous gallantry” during the Vietnam War. Canley, who will receive the award from President Trump at the White House, led Marines through the streets fighting … [+2260 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gregg Re", "title": "Treasury employee charged with leaking financial info on Trump team was arrested with flash drive in hand, prosecutors say", "description": "The top Treasury Department employee who was arrested and charged by federal authorities with leaking confidential financial documents pertaining to former Trump officials was apprehended with a flash drive containing the allegedly pilfered information in-han…", "url": "https://www.foxnews.com/politics/treasury-employee-charged-with-leaking-financial-info-of-trump-team", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/Deficit-Trillion-Treasury.jpg", "publishedAt": "2018-10-17T20:28:17Z", "content": "The top Treasury Department employee who was arrested and charged by federal authorities with leaking confidential financial documents pertaining to former Trump officials was apprehended with a flash drive containing the allegedly pilfered information in her… [+8305 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Thomas Byrne", "title": "President Trump Seeking 5 Percent Budget Cut", "description": "On the heels of the largest budget deficit in six years. President Trump is pushing his Cabinet to find cuts. FOX's Jared Halpern has more from Washington: President Trump is requesting each Cabinet Secretary to cut five percent from their budgets next year: …", "url": "https://radio.foxnews.com/2018/10/17/president-trump-seeking-5-percent-budget-cut/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2018/10/Trump.jpg", "publishedAt": "2018-10-17T16:31:54Z", "content": "Play Audio Clip Listen to audio clip. On the heels of the largest budget deficit in six years. President Trump is pushing his Cabinet to find cuts. FOX's Jared Halpern has more from Washington: President Trump is requesting each Cabinet Secretary to cut five … [+637 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News Insider", "title": "Judge Napolitano on Jamal Khashoggi's Murder: President Trump 'Must Put This Fire Out'", "description": "Judge Andrew Napolitano said the Trump administration may have to take drastic action after the suspected murder of a U.S. legal resident by Saudi agents in Turkey.", "url": "http://insider.foxnews.com/2018/10/18/judge-napolitano-jamal-khashoggis-murder-president-trump-must-put-fire-out", "urlToImage": "http://insider.foxnews.com/sites/insider.foxnews.com/files/styles/780/public/judgenapFF.jpg?itok=eiaVKB71", "publishedAt": "2018-10-18T14:28:00Z", "content": "Judge Andrew Napolitano said the Trump administration may have to take drastic action after the suspected murder of a U.S. legal resident by Saudi agents in Turkey. Speaking on \"Fox &amp; Friends\" Thursday, Napolitano was asked about what President Trump can … [+1850 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Greg Norman", "title": "Trump threatens to call US military to close southern border as 4,000-strong migrant caravan pushes north", "description": "President Trump warned Thursday he will “call up the U.S. Military and CLOSE OUR SOUTHERN BORDER” with Mexico if officials there don’t stop the northward flow of a growing migrant caravan that's swelled in size to about 4,000 people.", "url": "https://www.foxnews.com/us/trump-threatens-to-call-us-military-to-close-southern-border-as-4000-strong-migrant-caravan-pushes-north", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/Honduras-1.jpg", "publishedAt": "2018-10-18T11:52:27Z", "content": "President Trump warned Thursday he will “call up the U.S. Military and CLOSE OUR SOUTHERN BORDER” with Mexico if officials there don’t stop the northward flow of a growing migrant caravan that's swelled in size to about 4,000 people. The president’s latest th… [+2563 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Runner praised for helping legally blind competitor who fell", "description": "A New York high school cross-country athlete is being praised for stopping to help a vision-impaired runner who fell as they neared the finish line.", "url": "https://www.foxnews.com/health/runner-praised-for-helping-legally-blind-competitor-who-fell", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/Blind_runner.jpg", "publishedAt": "2018-10-18T14:11:51Z", "content": "AUBURN, N.Y. A New York high school cross-country athlete is being praised for stopping to help a vision-impaired runner who fell as they neared the finish line. Syracuse.com reports that Cazenovia High School sophomore Jake Tobin only had about 320 yards (29… [+580 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Alexandria Hein", "title": "Ohio boy gets custom Halloween costume to fit wheelchair", "description": "A 5-year-old boy in Ohio is all set for Halloween after his family created a custom costume to fit around his wheelchair.", "url": "https://www.foxnews.com/health/ohio-boy-gets-custom-halloween-costume-to-fit-wheelchair", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/blake_school_bus.jpg", "publishedAt": "2018-10-18T13:40:25Z", "content": "A 5-year-old boy in Ohio is all set for Halloween after his family created a custom costume to fit around his wheelchair. Blake Mompher, who has spina bifida, will make his rounds disguised as a “Blake County Schools” bus. “He’s just a boy who loves buses, tr… [+1174 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Bradford Betz", "title": "Los Angeles councilman announces departure day after fundraiser - Fox News", "description": "Fox News Los Angeles councilman announces departure day after fundraiser Fox News Mitchell Englander said he would be joining a sports firm after stepping from the Los Angeles City Council. (Facebook). A Los Angeles City Councilman raised a few eyebrows last …", "url": "https://www.foxnews.com/us/los-angeles-councilman-announces-departure-day-after-fundraiser", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/Englander.png", "publishedAt": "2018-10-16T04:28:24Z", "content": "A Los Angeles City Councilman raised a few eyebrows last week after announcing his departure from office the day after hosting an $800-per-person fundraiser. Mitchell Englander, 48, who represents Los Angeles' 12 District, hosted the fundraising event Wednesd… [+1964 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Gutfeld on Google's cowardice", "description": "Amazon CEO Jeff Bezos knocks Google for turning down a military contract.", "url": "http://video.foxnews.com/v/5850086121001/", "urlToImage": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/10/17/640/360/694940094001_5850086730001_5850086121001-vs.jpg", "publishedAt": "2018-10-17T21:53:25Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'reilly", "title": "Feinstein wants Kavanaugh sexual misconduct investigation reopened if Dems take Senate", "description": "Sen. Dianne Feinstein, D-Calif., said on Wednesday that if Democrats took control of the Senate following November’s midterm elections than she would be in favor of reopening an investigation into the sexual misconduct allegations levelled against Supreme Cou…", "url": "https://www.foxnews.com/politics/feinstein-wants-kavanaugh-sexual-misconduct-investigation-reopened-if-dems-take-senate", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2018/09/27/694940094001_5841222397001_5841218890001-vs.jpg", "publishedAt": "2018-10-17T20:53:24Z", "content": "Sen. Dianne Feinstein, D-Calif., said Wednesday that if Democrats took control of the Senate following November’s midterm elections, she would be in favor of reopening an investigation into the sexual misconduct allegations levelled against Supreme Court Just… [+1941 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Suspects in Khashoggi case linked to Saudi crown prince", "description": "Saudi Crown Prince Mohammed bin Salman has been praised as a reformer but also faced criticism from the West; State Department correspondent Rich Edson reports", "url": "http://video.foxnews.com/v/5850101384001/", "urlToImage": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/10/17/640/360/694940094001_5850102598001_5850101384001-vs.jpg", "publishedAt": "2018-10-17T22:26:03Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Caleb Parke", "title": "Ole Miss professor condemned for tweeting Senators ‘don’t deserve your civility’", "description": "An assistant professor at the University of Mississippi has come under fire for calling on people to interrupt and harass senators in public.", "url": "https://www.foxnews.com/us/ole-miss-professor-condemned-for-claiming-senators-dont-deserve-your-civility", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/James-Thomas-twet.jpg", "publishedAt": "2018-10-17T16:52:58Z", "content": "An assistant professor at the University of Mississippi has come under fire for calling on people to interrupt and harass senators in public. Ole Miss Chancellor Jeffrey Vitter condemned a post on social media by Assistant Professor of Sociology James Thomas … [+2603 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Cristina Johnson", "title": "Senate Majority Leader Mitch McConnell: If The Democrats Win Back The Senate Judicial Confirmations Will Stop Completely", "description": "Senate Majority Leader Mitch McConnell joined Fox News Radio's Guy Benson to talk about the missing Saudi journalist, the Kavanaugh confirmation process, and more. On President Trump's handling of the missing Saudi journalist: I think the President's decision…", "url": "https://radio.foxnews.com/2018/10/17/senate-majority-leader-mitch-mcconnell-if-the-democrats-win-back-the-senate-judicial-confirmations-will-stop-completely/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2018/10/100618_mitch.jpg", "publishedAt": "2018-10-17T19:21:33Z", "content": "Senate Majority Leader Mitch McConnell joined Fox News Radio's Guy Benson to talk about the missing Saudi journalist, the Kavanaugh confirmation process, and more. On President Trump's handling of the missing Saudi journalist: I think the President's decision… [+6047 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "William Sanchez", "title": "Senate Majority Leader Mitch McConnell, Fox News Anchor/Correspondent Trace Gallagher & Fox News Contributor Charles Hurt", "description": "Senate Majority Leader Mitch McConnell joins the show tonight to talk news of the day, the Kavanugh confirmation process and midterms! Investigation or Coverup? A pro-government Turkish newspaper on Wednesday published a gruesome recounting of the alleged sla…", "url": "https://radio.foxnews.com/2018/10/17/benson-and-harf-10-17-18/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2016/07/news_banner_featured_image-150x150.jpg", "publishedAt": "2018-10-17T20:45:00Z", "content": "Play Audio Clip Listen to audio clip. Senate Majority Leader Mitch McConnell joins the show tonight to talk news of the day, the Kavanugh confirmation process and midterms! Investigation or Coverup? A pro-government Turkish newspaper on Wednesday published a … [+1314 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "Soros-backed group fires operative after arrest over alleged battery against GOP campaign manager", "description": "The liberal group American Bridge 21st Century announced Wednesday night that it had fired one of its operatives a day after he was arrested and accused of battery against the female campaign manager for Nevada GOP gubernatorial candidate Adam Laxalt.", "url": "https://www.foxnews.com/politics/soros-backed-group-fires-operative-after-arrest-over-alleged-battery-against-gop-campaign-manager", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/stark-2.jpg", "publishedAt": "2018-10-17T23:54:05Z", "content": "The liberal group American Bridge 21st Century announced Wednesday night that it had fired one of its operatives a day after he was arrested and accused of battery against the female campaign manager for Nevada GOP gubernatorial candidate Adam Laxalt. In a st… [+3363 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Vietnam War hero sentenced to 7 years for decades-old rifle purchase: report", "description": "A decorated Vietnam veteran and firearms collector was sentenced to seven years in federal prison Wednesday for a decades-old purchase of a rifle.", "url": "https://www.foxnews.com/us/vietnam-war-hero-sentenced-to-7-years-for-decades-old-rifle-purchase-report", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/6c25564b-AP6.jpg", "publishedAt": "2018-10-18T05:31:35Z", "content": "A decorated Vietnam veteran and firearms collector was sentenced to seven years in federal prison Wednesday for a decades-old purchase of a rifle. Alfred Pick, 70, purchased the M14 -- a fully automatic weapon illegal to own -- at a Ft. Worth gun show in the … [+1448 chars]"}]}