{"status": "ok", "totalResults": 368, "articles": [{"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Alan Carter, PharmD", "title": "What to know about steroids for COPD", "description": "Doctors usually prescribe bronchodilators for COPD but may recommend steroids for severe symptoms. In this article, learn about the types of steroid medications available, as well as how they work, whether they are effective, and if there are any risks or sid…", "url": "https://www.medicalnewstoday.com/articles/323453.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323453/323453_1100.jpg", "publishedAt": "2018-10-25T14:00:00Z", "content": "Chronic obstructive pulmonary disease is a group of conditions that affect how well a person breathes. Doctors usually treat the condition with bronchodilators but may also prescribe steroids. Risk factors for chronic obstructive pulmonary disease (COPD) incl… [+7495 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Brenda B. Spriggs, M.D. FACP", "title": "Medical News Today: Rheumatoid arthritis and CRP levels: What do they mean?", "description": "Rheumatoid arthritis is an inflammatory condition that affects the joints. People with rheumatoid arthritis have increased levels of C-reactive protein in their blood. Here, learn more about this protein and what levels show.", "url": "https://www.medicalnewstoday.com/articles/323450.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323450/323450_1100.jpg", "publishedAt": "2018-10-25T14:00:00Z", "content": "Rheumatoid arthritis causes inflammation in the joints. Measuring the amount of C-reactive protein in the blood can help determine the extent of this inflammation. Rheumatoid arthritis (RA) is an autoimmune condition that causes the body to attack healthy tis… [+3874 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Maria Cohut", "title": "Medical News Today: Heart attack: New finding may change the face of treatment", "description": "New research from Sweden reveals that certain antibodies are highly present in people who have had a heart attack, which may have important implications.", "url": "https://www.medicalnewstoday.com/articles/323451.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323451/323451_1100.jpg", "publishedAt": "2018-10-25T14:00:00Z", "content": "Heart attacks are medical emergencies in which blood supply to the heart is blocked usually by a blood clot. A new study from Sweden has made an intriguing discovery that may change existing guidelines about treating heart attacks. Antibodies, or immunoglobul… [+3357 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Tim Newman", "title": "Why you probably have microplastics in your poop", "description": "Two new studies find tiny pieces of plastic, or microplastics, in stool and table salt samples from across the globe. What does this mean for our health?", "url": "https://www.medicalnewstoday.com/articles/323428.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323428/323428_1100.jpg", "publishedAt": "2018-10-25T15:00:00Z", "content": "Two recently published studies underline how pervasive plastic is on our planet. One finds it hiding in table salt, and the other finds it in stool samples. The question is, how will it impact health? Most of us know that planet Earth has a problem with plast… [+4960 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Maria Cohut", "title": "Surgeons carry out spine surgery in the womb", "description": "Scientists can repair a potentially disabling spine defect, spina bifida, in the womb. This procedure is becoming more widely available little by little.", "url": "https://www.medicalnewstoday.com/articles/323488.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323488/323488_1100.jpg", "publishedAt": "2018-10-28T10:00:00Z", "content": "In a condition known as spina bifida, children are born with an exposed spinal cord, which causes numerous physical and developmental issues. Usually, surgeons will operate on spina bifida after birth, but a complex in utero surgery can allow the baby to deve… [+4856 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": null, "title": "How a 150-year old drug might help battle cancer", "description": "The potency of cancer treatments is often reduced by a lack of oxygen in and around the tumor. Researchers have found an existing drug that might help.", "url": "https://www.medicalnewstoday.com/articles/323384.php", "urlToImage": null, "publishedAt": "2018-10-19T07:00:00Z", "content": null}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Dena Westphalen, PharmD", "title": "Medical News Today: How to use cromolyn sodium to treat allergies", "description": "Cromolyn sodium is a widely available medication for preventing and treating nasal allergies, such as hay fever and pet or dust allergies. It comes as a nasal solution and works by preventing the release of histamines in the nose. Learn more here.", "url": "https://www.medicalnewstoday.com/articles/323372.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323372/323372_1100.jpg", "publishedAt": "2018-10-17T17:00:00Z", "content": "Cromolyn sodium is an over-the-counter medication for treating nasal allergies. It comes as a nasal solution and works best when a person uses it before they come into contact with the substance that triggers their allergy. Allergic reactions occur when the b… [+5666 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Catharine Paddock PhD", "title": "High blood pressure control with 'exercise in a pill'", "description": "Increased body levels of a compound that the liver makes could control high blood pressure without having to exercise or eat less salt, study suggests.", "url": "https://www.medicalnewstoday.com/articles/323382.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323382/323382_1100.jpg", "publishedAt": "2018-10-18T16:00:00Z", "content": "A discovery about a function in the liver could lead to a new way to control blood pressure a pill that mimics the effect of exercise according to a recent study that features in the journal Cell Reports. The idea is that the tablet would raise body levels of… [+3063 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Maria Cohut", "title": "Medical News Today: Do your surroundings affect your taste? Virtual reality answers", "description": "Our sense of taste impacts many of our choices, but how do our surroundings influence it? A series of virtual reality experiments now provide an answer.", "url": "https://www.medicalnewstoday.com/articles/323362.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323362/323362_1100.jpg", "publishedAt": "2018-10-17T10:00:00Z", "content": "What we taste is intertwined not just with what we smell, but also with other sensory inputs. What we can see, in particular, may alter how we perceive the flavor of food at least this is what a range of experiments using virtual reality settings have shown. … [+3147 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Christine Frank, DDS", "title": "Medical News Today: Everything you need to know about gingivostomatitis", "description": "Gingivostomatitis is an infection that occurs in and around the mouth. It causes painful sores, blisters, and swelling. It is more common in children and is highly contagious. Learn more about the causes and risk factors in this article, as well as treatment …", "url": "https://www.medicalnewstoday.com/articles/323368.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323368/323368_1100.jpg", "publishedAt": "2018-10-17T15:00:00Z", "content": "Gingivostomatitis is a highly contagious infection of the mouth. Its main symptoms include pain, swollen gums, blisters, and sores. These sores can develop on the tongue, under the tongue, and on the cheeks inside the mouth, as well as on the lips and gums. I… [+5256 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Ana Sandoiu", "title": "Medical News Today: Fitness and lifespan: Is too much exercise harmful?", "description": "When it comes to exercise and the risk of mortality, is there such a thing as too much physical activity? New research investigates.", "url": "https://www.medicalnewstoday.com/articles/323420.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323420/323420_1100.jpg", "publishedAt": "2018-10-23T10:00:00Z", "content": "A new, large-scale study finds that even extreme levels of fitness increase lifespan particularly in older people. Exercise is widely considered to benefit health, but is there such a thing as too much exercise? Some recent studies suggest so. For instance, 9… [+2973 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Nancy Moyer, MD", "title": "Medical News Today: What is the link between pannus and rheumatoid arthritis?", "description": "In people with rheumatoid arthritis (RA), pannus occurs when excess tissue grows in a person’s joint. Pannus can lead to permanent joint damage. Learn more here.", "url": "https://www.medicalnewstoday.com/articles/323413.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323413/323413_1100.jpg", "publishedAt": "2018-10-23T14:00:00Z", "content": "Pannus is an abnormal growth of tissue that develops in the joints. It can form in the later stages of rheumatoid arthritis. Rheumatoid arthritis (RA) is an autoimmune disease that causes inflammation in the joints. When a person has RA, the synovium, which i… [+4185 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Nancy Moyer, MD", "title": "Medical News Today: What are the effects of black mold exposure?", "description": "Black mold is a type of fungus that tends to thrive in damp areas. Long-term exposure to black mold may cause symptoms, particularly in people with asthma, respiratory allergies, or a weakened immune system. Learn more here.", "url": "https://www.medicalnewstoday.com/articles/323419.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323419/323419_1100.jpg", "publishedAt": "2018-10-23T14:00:00Z", "content": "Black mold can infest homes or other buildings, especially in damp areas. Long-term exposure to black mold is potentially harmful to health and may cause a range of symptoms. In this article, we explain what black mold is and look at the effects it can have o… [+8193 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Alan Carter, PharmD", "title": "Medical News Today: What are the benefits of lion's mane mushrooms?", "description": "Lion’s mane mushrooms may offer some health benefits, such as reducing inflammation, boosting immune function, and improving cognitive health. People can cook with the mushrooms or take supplements. There are no known side effects, and they should be safe for…", "url": "https://www.medicalnewstoday.com/articles/323400.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323400/323400_1100.jpg", "publishedAt": "2018-10-22T14:00:00Z", "content": "Abdulla, M. A., Fard, A. A., Sabaratnam, V., Wong, K. H., Kuppusamy, U. R., Abdullah, N., &amp; Ismail, S. (2011). Potential activity of aqueous extract of culinary-medicinal lion's mane mushroom, Hericium erinaceus (Bull.: Fr.) Pers. (Aphyllophoromycetideae)… [+6716 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Debra Rose Wilson, PhD, MSN, RN, IBCLC, AHN-BC, CHT", "title": "Medical News Today: Acupressure for inducing labor: What to know", "description": "Some people use acupressure to help induce labor, but is it effective? In this article, we discuss four acupressure points to try and look at the research behind the claims.", "url": "https://www.medicalnewstoday.com/articles/323402.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323402/323402_1100.jpg", "publishedAt": "2018-10-22T14:00:00Z", "content": "Acupressure practitioners say that applying pressure to these specific points on the body can change the body's energy, called qi or chi. Some people believe that acupressure may help induce labor in women who are at the end of their third trimester. Acupress… [+5371 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "William Morrison, MD", "title": "Medical News Today: What is turf toe and how do you treat it?", "description": "Turf toe is a common sports injury that occurs when the bones and tissue around the big toe become damaged. This damage can occur when pushing down on the toe repeatedly puts stress on this part of the body. Most cases resolve with rest alone, but some severe…", "url": "https://www.medicalnewstoday.com/articles/323406.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323406/323406_1100.jpg", "publishedAt": "2018-10-22T17:00:00Z", "content": "Turf toe refers to an injury that affects the ligaments around a person's big toe. It is a common sports injury, particularly among American football and soccer players who play on artificial turf. Pushing forcefully off the big toe, as players do when they b… [+6957 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Philip Gregory, PharmD, MS", "title": "Medical News Today: Is hair loss a side effect of metformin?", "description": "Doctors prescribe metformin to treat people with type 2 diabetes or polycystic ovary syndrome (PCOS). In rare cases, metformin may cause hair loss. Learn more here.", "url": "https://www.medicalnewstoday.com/articles/323410.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323410/323410_1100.jpg", "publishedAt": "2018-10-22T17:00:00Z", "content": "Metformin is a prescription medication for the treatment of type 2 diabetes and polycystic ovary syndrome. Some people are worried that this drug may cause hair loss, but there is little evidence to validate this concern. Doctors typically prescribe metformin… [+9019 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Catharine Paddock PhD", "title": "Does lavender really help with anxiety?", "description": "A study of mice reveals that the scent of linalool, a natural alcohol found in lavender, relieves anxiety through its effect on olfactory nerve cells.", "url": "https://www.medicalnewstoday.com/articles/323422.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323422/323422_1100.jpg", "publishedAt": "2018-10-23T16:00:00Z", "content": "Traditional folk medicine maintains that the smell of some plants can calm the nerves. Now, new research is suggesting that one fragrant compound present in lavender can lessen anxiety by stimulating the nose to pass signals to the brain. Investigators at Kag… [+4019 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Katherine Marengo LDN, RD", "title": "Medical News Today: Dairy alternatives: How to replace milk, cheese, butter, and more", "description": "Increasing numbers of people are choosing to give up dairy for their health or other reasons. Learn about alternatives to milk, cheese, butter, ice cream, and more.", "url": "https://www.medicalnewstoday.com/articles/323411.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323411/323411_1100.jpg", "publishedAt": "2018-10-23T14:00:00Z", "content": "Many people are moving towards dairy alternatives for a variety of reasons, including better health or to reduce their impact on the planet. One struggle people face when giving up dairy is how to replace everyday dairy products. In this article, we offer a g… [+8571 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Alan Carter, PharmD", "title": "What causes opioid-induced constipation (OIC)?", "description": "Opioids are important for controlling pain, but they can lead to opioid-induced constipation (OIC). Why does this happen and what other effects do opioids have on digestion?", "url": "https://www.medicalnewstoday.com/articles/323418.php", "urlToImage": "https://cdn1.medicalnewstoday.com/content/images/hero/323/323418/323418_1100.jpg", "publishedAt": "2018-10-26T07:00:00Z", "content": "Opioid use can lead to constipation. The person may notice that they pass formed stools less often than usual, and the stools that are hard and difficult to pass. Opioid-constipation is a common problem for people using some types of pain relief medication. F… [+3228 chars]"}]}