{"status": "ok", "totalResults": 10128, "articles": [{"source": {"id": "mirror", "name": "Mirror"}, "author": "Emily Retter", "title": "BTS are the biggest band you've probably never heard of - meet South Korea’s answer to One Direction", "description": "BTS are taking the world by storm with their winning brand of bubblegum pop", "url": "https://www.mirror.co.uk/news/real-life-stories/bts-biggest-band-youve-probably-13426800", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13430934.ece/ALTERNATES/s1200/0_South-Korean-President-Moon-Jae-in-visits-France.jpg", "publishedAt": "2018-10-17T12:07:42Z", "content": "Taylor Swift didnt stand a chance when they smashed her 43 million views YouTube debut video record. Neither did Justin Bieber, Selena Gomez, or Ariana Grande when they beat all three to scoop a prestigious Billboard Music Award. Theyve just sold out two nigh… [+3661 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Kevin Maguire", "title": "PMQs was an off day as Jeremy Corbyn missed an open goal with enfeebled Theresa May", "description": "This wasn't one of Corbyn's better performances and he missed an open goal when Theresa May is enfeebled, writes Kevin Maguire", "url": "https://www.mirror.co.uk/news/politics/pmqs-day-jeremy-corbyn-missed-13431715", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13431266.ece/ALTERNATES/s1200/1_PMQS.jpg", "publishedAt": "2018-10-17T12:19:00Z", "content": "Jeremy Corbyn is right - Theresa May is too weak at the head of a divided Government to fight Britain's corner in Europe and must stop putting the Conservative Party's interests first. The Labour leader raised a couple of good points at Prime Minister's Quest… [+1486 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Jake Polden", "title": "Paul Scholes has a theory on why Manchester United really signed Alexis Sanchez", "description": "The Red Devils swapped Henrikh Mkhitaryan for the Chile international in the January transfer window", "url": "https://www.mirror.co.uk/sport/football/news/paul-scholes-theory-manchester-united-13431708", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13431705.ece/ALTERNATES/s1200/0_Manchester-United-v-West-Ham-United-Emirates-FA-Cup-Quarter-Final-Old-Trafford.jpg", "publishedAt": "2018-10-17T12:16:07Z", "content": "Paul Scholes has an interesting theory on why Manchester United signed Alexis Sanchez, claiming he was brought in for all the wrong reasons. The Red Devils landed the Chile international in the January transfer window, with Henrikh Mkhitaryan heading to Arsen… [+1273 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "mirror", "title": "Love Island boob job advertising banned - MYA Cosmetic Surgery ads branded 'harmful' by watchdog", "description": "Advertising watchdog said MYA Cosmetic Surgery commercials were 'irresponsible and harmful'.", "url": "https://www.mirror.co.uk/3am/celebrity-news/cosmetic-surgery-ads-shown-during-13431365", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13431560.ece/ALTERNATES/s1200/2_MYA-Cosmetic-Surgery.jpg", "publishedAt": "2018-10-17T12:06:27Z", "content": "Cosmetic surgery adverts screened during this year's Love Island have been banned after they were deemed \"irresponsible\". The Advertising Standards Authority (ASA) responded to complaints from viewers and mental health charities that the MYA Cosmetic Surgery … [+3420 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Mark Morris", "title": "Huge great white shark gets very close to biting off cameraman's arm", "description": "He managed to capture footage of the heart-stopping moment", "url": "https://www.mirror.co.uk/news/world-news/huge-great-white-shark-gets-13430946", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13430984.ece/ALTERNATES/s1200/3_Cameraman-has-close-shave-with-gigantic-great-white-shark.jpg", "publishedAt": "2018-10-17T12:13:05Z", "content": "A cameraman was lucky to keep his arm after leaning out of a boat as a gigantic great white shark lunged towards him. The man was filming the shark as it circled the cage diving tourist boat, following the bait dangling from it. The shark was \"very active for… [+692 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Nicola Oakley", "title": "Touching reason Meghan Markle chose these jeans on day two of her royal tour in Australia", "description": "They weren't just any old jeans - the reason she wore them was 'very Meghan'", "url": "https://www.mirror.co.uk/news/uk-news/touching-reason-meghan-markle-chose-13432103", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13429236.ece/ALTERNATES/s1200/31_Meghan-and-Harry.jpg", "publishedAt": "2018-10-17T13:55:15Z", "content": "Meghan Markle is a couple of days in to her first overseas royal tour with husband Prince Harry - and her fashion choices are under a microscope. On Monday she stepped out wearing Princess Diana' s earrings and bracelet, and it didn't take long for eagle-eyed… [+2727 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "David McDonnell", "title": "Kevin De Bruyne set to make Manchester City return against Burnley after knee ligament injury", "description": "De Bruyne has not featured for City this season after suffering knee ligament damage in training back in August", "url": "https://www.mirror.co.uk/sport/football/news/kevin-de-bruyne-set-make-13432364", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13417614.ece/ALTERNATES/s1200/0_Liverpool-v-Manchester-City-Premier-League-Anfield.jpg", "publishedAt": "2018-10-17T14:01:44Z", "content": "Kevin De Bruyne is set to make his long-awaited return for Manchester City this weekend. De Bruyne has not featured for City this season after suffering knee ligament damage in training back in August. But the Belgium international, voted City's Player of the… [+473 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Martin Domin", "title": "Wembley will NOT be sold to Shahid Khan after Fulham owner withdraws £600m offer to buy stadium", "description": "The Fulham owner had offered £600million for the stadium but has now pulled his bid", "url": "https://www.mirror.co.uk/sport/football/breaking-wembley-not-sold-after-13432376", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article815160.ece/ALTERNATES/s1200/fa-cup-wembley-stadium-view-general-cropped.jpg", "publishedAt": "2018-10-17T14:03:37Z", "content": "Shahid Khan has withdrawn his £600million offer to buy Wembley. The Fulham owner had expressed a serious interest in purchasing the national stadium but has now decided against pursuing his interest. The billionaire's offer had drawn criticism from across the… [+4018 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "John Fitzsimons", "title": "What moving house, getting married, splitting up and having kids all have in common - but people routinely forget", "description": "When your circumstances change, it’s crucial that you check this document is still accurate", "url": "https://www.mirror.co.uk/money/what-moving-house-getting-married-13426742", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article9233487.ece/ALTERNATES/s1200/Wedding-confetti-bride-and-groom.jpg", "publishedAt": "2018-10-17T14:15:32Z", "content": "Getting married. Having kids. Moving house. Splitting up. Winning the lottery. These arent just a handful of the most stressful life events any of us ever go through, and they also happen to be the times when its really important that you review your will. As… [+4305 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Lewis Knight", "title": "The Kindergarten Teacher review: Maggie Gyllenhaal \"has reached a new career pinnacle\" in warped character drama", "description": "Maggie Gyllenhaal rises to the challenge of playing an unlikable character who goes too far", "url": "https://www.mirror.co.uk/film/kindergarten-teacher-review-maggie-gyllenhaal-13432375", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13432780.ece/ALTERNATES/s1200/0_kindergarteb.jpg", "publishedAt": "2018-10-17T15:58:59Z", "content": "Often the best characters in cinema are those that are morally grey or even utterly despicable. In The Kindergarten Teacher, Maggie Gyllenhaal gets her chance to play another complicated female lead role that will infuriate some, provoke empathy, or even a gr… [+2938 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "mirror", "title": "Holly Willoughby gets a taste of bushtucker trial ahead of I'm A Celebrity job", "description": "Jimmy Carr offered a blindfolded Holly an unknown substance to taste on Celebrity Juice.", "url": "https://www.mirror.co.uk/tv/tv-news/holly-willoughby-gets-taste-bushtucker-13435544", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13435615.ece/ALTERNATES/s1200/0_Holly-Willoughby-will-do-Im-A-Celeb-Bushtucker-trial-on-Celeb-Juice.jpg", "publishedAt": "2018-10-18T07:58:39Z", "content": "She's gearing up to step into Ant McPartlin's shoes on I'm A Celebrity... Get Me Out Of Here! next month. So her Celebrity Juice pals thought it was high time Holly Willoughby had a taste of the infamous Bushtucker Trials. In Thursday's episode of the ITV2 pa… [+1621 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Matthew Osborn", "title": "Warriors Orochi 4 review: Just misses the mark but a step in the right direction", "description": "Fun combat is let down by a clunky interface in this action-packed combat adventure", "url": "https://www.mirror.co.uk/tech/warriors-orochi-4-review-just-13430845", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13431426.ece/ALTERNATES/s1200/0_Warriors-Orochi-4.jpg", "publishedAt": "2018-10-18T09:50:06Z", "content": "The Dynasty Warriors games have pretty much become a genre in of themselves, with their well-established formula of having the player taken on hordes of identikit enemies in epic melee combat. However, after the poor response to Dynasty Warriors 9 some of the… [+3378 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "David Anderson", "title": "Hughie Fury full of belief as he warns Anthony Joshua: \"I'm coming for you\"", "description": "“I’m not much of a talker, I let my fists do the talking, but I believe 100 per cent I can beat him\"", "url": "https://www.mirror.co.uk/sport/boxing/hughie-fury-full-belief-warns-13433975", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13407124.ece/ALTERNATES/s1200/0_Hughie-Fury.jpg", "publishedAt": "2018-10-17T19:07:47Z", "content": "Anthony Joshua has been warned by Hughie Fury - Im coming for you. Fury will become the mandatory challenger for Joshuas IBF heavyweight title if he beats Kubrat Pulev in Sofia on Saturday week and his sights are set firmly on his British rival. Yes, 100 per … [+2125 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Vicki Newman", "title": "Holly Willoughby oozes sexy Halloween glamour as she transforms into Morticia for Celebrity Juice special", "description": "The This Morning presenter slipped into a sensational figure-hugging PVC costume and transformed her look with a black wig", "url": "https://www.mirror.co.uk/3am/celebrity-news/holly-willoughby-oozes-sexy-halloween-13433638", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13344300.ece/ALTERNATES/s1200/2_rexfeatures_9878604gm.jpg", "publishedAt": "2018-10-17T18:20:50Z", "content": "If anyone can make Halloween sexy, it's Holly Willoughby. The This Morning presenter has transformed into Addams Family matriarch Morticia for the Celebrity Juice Halloween special - and she looks sensational. The mum-of-three slipped into a skin-tight black … [+2184 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Robyn Darbyshire", "title": "Mum received haunting phone call days after daughter vanished in 1978 - fresh investigation examines mystery", "description": "The mystery of Trudie Adams’ disappearance is the subject of ABC's latest true crime podcast Unravel which examines how the case has remained unsolved for 40 years", "url": "https://www.mirror.co.uk/news/real-life-stories/mum-received-haunting-phone-call-13433401", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13433477.ece/ALTERNATES/s1200/0_httpwwwaustralianmissingpersonsregistercomTrudieAdamshtm.jpg", "publishedAt": "2018-10-17T19:10:45Z", "content": "Trudie Adams vanished on her way home from a party in Newport, Sydney in 1978 - and the mystery of her disappearance has still not been solved. The 18-year-old left the party in Sydney's northern beaches and hitched a lift, which was not uncommon as there was… [+2853 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Tom Bryant", "title": "David Dickinson reveals all about sexy fan mail, why he loves his tan, and his fears for the future", "description": "The 77-year-old antiques expert says he's still a hit with the ladies – but worries about his television future", "url": "https://www.mirror.co.uk/3am/celebrity-news/david-dickinson-reveals-sexy-fan-13433676", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13433817.ece/ALTERNATES/s1200/1_ITV-Palooza-2018-London.jpg", "publishedAt": "2018-10-17T19:30:37Z", "content": "Hw may be well into his 70s but David Dickinson shows he is still a party animal as he leaves an ITV bash looking decidedly sweaty. And the ex-Bargain Hunt host, who clearly enjoyed himself at the Palooza Party in London on Tuesday, has revealed he is still a… [+1550 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Chantelle Symester", "title": "Westlife announce 2019 comeback tour date and this is when tickets are set to go on sale", "description": "The recently reunited 00's Irish pop boyband will be celebrating 20 years of hits including 14 UK number 1’s", "url": "https://www.mirror.co.uk/3am/celebrity-news/westlife-2019-tour-tickets-13433476", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13433541.ece/ALTERNATES/s1200/0_Westlife-tw.jpg", "publishedAt": "2018-10-17T19:35:00Z", "content": "Westlife have finally announced details of their comeback tour. The Twenty Tour is set to take place next summer and will celebrate the Irish pop band's long career which features 14 number one hit songs including the chart-topping 'Flying Without Wings'. The… [+1703 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Susie Boniface", "title": "Britain's nuclear test heroes given fresh hope with order to investigate possible probe into birth abnormalities", "description": "After a 30-year campaign the government will consider examining the genetic legacy of Britain’s nuclear weapons tests", "url": "https://www.mirror.co.uk/news/uk-news/britains-nuclear-test-heroes-given-13433832", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13082145.ece/ALTERNATES/s1200/0_Farnborough-International-Airshow.jpg", "publishedAt": "2018-10-17T20:42:21Z", "content": "Defence supremo Gavin Williamson has given fresh hope to Britains nuclear test heroes with potential research into the genetic defects that plague their families. Ministry of Defence officials have been ordered to investigate how the shocking rate of birth ab… [+2864 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Chantelle Symester", "title": "Little Mix announce UK tour dates for 2019 and tickets go on sale soon", "description": "The 'Shout Out To My Ex' chart-toppers are back with new music this November and live shows across the UK next year", "url": "https://www.mirror.co.uk/3am/celebrity-news/little-mix-tour-2019-tickets-13435542", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13435641.ece/ALTERNATES/s1200/0_Little-Mix-Visit-KISS-FM.jpg", "publishedAt": "2018-10-18T08:10:00Z", "content": "Little Mix are going on tour in 2019 as the pop girl band gear up to release new album LM5 next month. The band - Jade Thirlwall, Perrie Edwards, Leigh-Anne Pinnock, and Jesy Nelson - are set to start the LM5 tour next winter. Dates will include shows at majo… [+2181 chars]"}, {"source": {"id": "mirror", "name": "Mirror"}, "author": "Amber Hicks", "title": "Trainee teacher, 22, killed in crash on way home from family wedding leaving mum with 'unfixable hole in heart'", "description": "Two others were also injured in the crash in Sutton Coldfield, Birmingham, which left \"talented and caring\" Chloe Kerr with fatal injuries", "url": "https://www.mirror.co.uk/news/uk-news/trainee-teacher-22-killed-crash-13435738", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13435938.ece/ALTERNATES/s1200/0_Chloe-Kerr.jpg", "publishedAt": "2018-10-18T09:12:32Z", "content": "Tributes are being paid to a \"beautiful and sweet\" trainee teacher who was killed in a car crash on the way home from a family wedding. Chloe Kerr's heartbroken family and friends have been remembering the 22-year-old who \"lit up every room she walked into\" a… [+4872 chars]"}]}