{"status": "ok", "totalResults": 211, "articles": [{"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Charles Holmes", "title": "Cardi B Proved She’s Rap’s Latest General At The BET Hip Hop Awards", "description": "Cardi B, clad in camo, opened the 2018 BET Hip Hop Awards with a militaristic performance of \"Get Up 10\" and stuck around to do \"Backin' It Up\" as well.", "url": "http://www.mtv.com/news/3101840/cardi-b-bet-awards-get-up-10/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661349?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-17T14:11:26Z", "content": "Cardi B came to wage war. At the 2018 BET Hip Hop Awards on Tuesday night (October 16), the Bronx rapper tore through an inspirational performance of Invasion of Privacy opener \"Get Up 10.\" Surrounded by backup dancers clad in camo, Cardi rapped, \"Real bitch,… [+1091 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Haley Longman", "title": "Will Teen Mom OG‘s Cheyenne and Zach Learn A Lesson From Their BBQ Blowup?", "description": "Cheyenne and Zach made up after their fight at her family's BBQ on 'Teen Mom OG.' But can they continue to communicate and improve their relationship?", "url": "http://www.mtv.com/news/3100475/teen-mom-og-zach-cheyenne-bbq-fight/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661242?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-17T15:00:27Z", "content": "Cheyenne s first family gathering on Teen Mom OG was pretty eventful, to say the least -- she and her dad had a tiff after he found out that she and her boyfriend Zach were living together. But after the dust settled on that fight, we saw Cheyenne getting ups… [+1121 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Matt Gehring", "title": "Marcus Scribner And Flipp Dinero Talk Highlights Of Their Careers On ‘TRL’", "description": "Marcus Scribner (black-ish) and Flipp Dinero (\"Leave Me Alone\") stopped by TRL with host Sway Calloway on Tuesday, October 16.", "url": "http://trl.mtv.com/news/3101809/marcus-scribner-and-flipp-dinero-talk-highlights-of-their-careers-on-trl/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661342?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-17T14:59:02Z", "content": "On a true fall morning from Times Square, Marcus Scribner and Flipp Dinero took to the TRL studio to kick it with host Sway Calloway. Just 21 days ahead of the midterm elections, Marcus gave his take on why it's extra important to use his platform to get mill… [+825 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Matt Gehring", "title": "PRETTYMUCH (And MINIMUCH) Prep For The Funktion Tour With “Real Friends”", "description": "A five-day campaign consisting of the PRETTYMUCH boys posing with their mini-mes culminated in the release of a new single, “Real Friends,” just over 24 hours before kicking off their Funktion Tour in Seattle. That timing was no accident, considering the trac…", "url": "http://trl.mtv.com/news/3101856/prettymuch-and-minimuch-prep-for-the-funktion-tour-with-real-friends/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661361?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-17T18:14:36Z", "content": "A five-day campaign consisting of the PRETTYMUCH boys posing with their mini-mes culminated in the release of a new single, \"Real Friends,\" just over 24 hours before kicking off their Funktion Tour in Seattle. That timing was no accident, considering the trac… [+1048 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Madeline Roth", "title": "Zayn Tries And Fails To Play It Smooth On New Song ‘Fingers’", "description": "Zayn releases the smoldering new single \"Fingers,\" which is all about unrequited love and texting.", "url": "http://www.mtv.com/news/3102030/zayn-fingers-new-song/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661455?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-18T18:23:06Z", "content": "Zayn 's string of 2018 releases have really run the gamut, genre-wise from the poppy \" Let Me,\" to the rocking \" Sour Diesel,\" to the Timbaland collab \" Too Much \" but the crooner's newest single brings him right back to Mind Of Mine territory. \"Fingers\" is a… [+1031 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Madeline Roth", "title": "Post Malone And Swae Lee Drop Their Swinging Spider-Man Soundtrack Single", "description": "Post Malone and Swae Lee drop \"Sunflower,\" their new song from the soundtrack for \"Spider-Man: Into the Spider-Verse.\"", "url": "http://www.mtv.com/news/3102060/post-malone-swae-lee-sunflower-spider-man/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661483?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-18T20:07:13Z", "content": "Post Malone and Swae Lee have swung through with another must-hear collaboration. After teaming up for \"Spoil My Night\" from Post's latest album, the rockstar and the Rae Sremmurd MC are back with \"Sunflower,\" a new song from the soundtrack for Spider-Man: In… [+927 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Matt Gehring", "title": "This 20-Year-Old Artist Carves Pumpkins Of Your Faves Every Halloween", "description": "Megan (@spinningaroundconfetti on Instagram) has caught the eyes of stan Twitter with her pumpkin carvings of musicians like Shawn Mendes, Camila Cabello, Taylor Swift and Why Don't We.", "url": "http://trl.mtv.com/news/3102070/this-20-year-old-artist-carves-pumpkins-of-your-faves-every-halloween/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661490?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-19T18:36:14Z", "content": "Super fans dress up as their faves for Halloween. Super duper fans carve deeply-intricate portraits of their faves and their album art into pumpkins for Halloween! That's the prerogative for Megan, a 20-year-old artist whose pumpkin carvings have caught the e… [+2453 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Matt Gehring", "title": "Here’s How Billie Eilish Cried Black Tears In The “When The Party’s Over” Video", "description": "Billie Eilish released the music video for \"when the party's over,\" complete with black tears after she drinks black liquid.", "url": "http://trl.mtv.com/news/3102579/heres-how-billie-eilish-cried-black-tears-in-the-when-the-partys-over-video/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661844?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-25T21:32:46Z", "content": "Aesthetically-inclined Billie Eilish's new music video for \"when the party's over\" isn't for the faint of heart -- or the squeamish. Already a heartbreaking piano ballad, \"when the party's over\" gets even more emotional in the single-take, continuous video th… [+1654 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Tina Smithers Peckham", "title": "Vinny Has A New Role On Family Vacation: Couples Counselor", "description": "After Ronnie and Jen clashed again, Vinny gave his 'Jersey Shore: Family Vacation' friend the best advice ever.", "url": "http://www.mtv.com/news/3101614/jersey-shore-family-vacation-vinny-ronnie-advice/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661706?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-26T01:00:03Z", "content": "Sometimes, it takes a close friend (or family member) to truly open your eyes to what may be an unhealthy situation. Ronnie has Vinny to thank for his latest relationship realization, one that came during tonight's episode of Jersey Shore: Family Vacation Par… [+2094 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Madeline Roth", "title": "Little Mix And Nicki Minaj Stylishly Smash Stereotypes In ‘Woman Like Me’ Video", "description": "Little Mix drop the stylish, empowering new video for \"Woman Like Me,\" featuring Nicki Minaj.", "url": "http://www.mtv.com/news/3102594/little-mix-woman-like-me-video/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661854?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-26T00:33:55Z", "content": "Little Mix are no strangers to bold, empowering music videos see \"Power,\" \"Shout Out To My Ex,\" and most of their other singles as proof but the group's latest one may be the best yet. For \" Woman Like Me \" the boss-minded Nicki Minaj collaboration released e… [+931 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Alissa Schulman", "title": "Katherine Langford Secretly Joined The Avengers 4 Cast", "description": "Marvel's \"Avengers 4\" casts \"13 Reasons Why\" star Katherine Langford in a mystery role.", "url": "http://www.mtv.com/news/3102658/katherine-langford-avengers-4/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661955?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-26T22:56:41Z", "content": "In case you needed it, here's one more reason why Avengers 4 is going to be a must-see: Katherine Langford has joined the roster, multiple outlets have confirmed. Sadly, there is absolutely no information about her role in the upcoming conclusion to Marvel's … [+816 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Madeline Roth", "title": "Migos’ Takeoff Takes His Seat At The Throne In ‘Last Memory’ Video", "description": "Takeoff releases the regal video for \"Last Memory,\" the lead single from his debut solo album.", "url": "http://www.mtv.com/news/3102644/takeoff-last-memory-video/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661952?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-26T21:12:31Z", "content": "Migos may be one of the biggest groups in music, but Quavo and Offset tend to command most of the spotlight. That changed on Friday (October 26), when the most low-key and under-appreciated Migo, Takeoff, released the lead single from his upcoming debut solo … [+970 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Jordana Ossad", "title": "Are You The One? Reconciliation: Should Nutsa Have Taken Brett Back?", "description": "Nutsa took Brett back on 'Are You the One?' -- after he told her he didn't feel 'a spark.' But was that the best decision?", "url": "http://www.mtv.com/news/3101674/are-you-the-one-nusta-brett/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661733?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-25T03:00:45Z", "content": "Brett and Nutsa have been on different Hawaiian wavelengths throughout Are You the One? (in short, she has much more of an emotional attachment than he does). While they had a chance to enter the Truth Booth several weeks back, the rest of their cohorts (with… [+2269 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Matt Gehring", "title": "Algee Smith And MadeInTYO Spared No Details On ‘TRL’ This Morning", "description": "Algee Smith (The Hate U Give) and MadeInTYO (Sincerely, Tokyo) joined host Sway Calloway on TRL on Tuesday, October 23.", "url": "http://trl.mtv.com/news/3102368/algee-smith-and-madeintyo-spared-no-details-on-trl-this-morning/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661722?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-24T20:00:08Z", "content": "The questions may have been tough, but growing stars Algee Smith and MadeInTYO didn't hold back from TRL 's Times Square studio this morning. First on set, Algee got real about making the most of his abbreviated role as Khalil in The Hate U Give, now in theat… [+563 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Patrick Hosken", "title": "Drake’s Producer 40 Gave Up The Info About His Son, Pusha T Says", "description": "Pusha T reveals the source of his intel on Drake having a secret son, info he used for the dis track \"The Story of Adidon.\" And it's apparently Drake's right-hand man, Noah \"40\" Shebib.", "url": "http://www.mtv.com/news/3101853/pusha-t-40-drake-son-story-of-adidon/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661376?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-17T16:54:48Z", "content": "One of the biggest hip-hop stories of 2018 remains the revelation that Drake apparently had a son in secret. Pusha T first dug up the dirt and aired it out on his vicious dis track \" The Story of Adidon \" back in May, rapping, \"We talkin' character, let me ke… [+2235 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Matt Gehring", "title": "Phony Ppl And Jovan Adepo Bless The Morning On ‘TRL’", "description": "Phony Ppl (mozaik) and Jovan Adepo (Overlord) dropped by MTV TRL with Sway Calloway.", "url": "http://trl.mtv.com/news/3102304/phony-ppl-and-jovan-adepo-bless-the-morning-on-trl/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661652?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-23T15:39:18Z", "content": "With Phony Ppl's album m'z-ik out now and Jovan Adepo's box office flick Overlord two weeks away, two major rising talents spilled the details of their buzzy new projects on TRL. Taking over the TRL couch, the four guys of Phony Ppl had a total post-album rel… [+715 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Haley Longman", "title": "Will Teen Mom OG‘s Cory Try To Make A Move On The Newly Single Cheyenne?", "description": "Cheyenne and Zach broke up after another big fight on 'Teen Mom OG,' so will Cory move in on his baby mama now that she's single?", "url": "http://www.mtv.com/news/3100737/teen-mom-og-cory-cheyenne-dating/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661621?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-24T15:00:46Z", "content": "Well, we guess Cheyenne and Zach didnt improve their communication after their BBQ blow-up argument after all on this weeks Teen Mom OG, Cheyenne ended her relationship with her boyfriend-turned-roommate after another fight. So what went down and more importa… [+1623 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Alissa Schulman", "title": "Watch Lea Michele And Darren Criss Channel A Star Is Born While Covering ‘Shallow’", "description": "Lea Michele and Darren Criss covered Lady Gaga and Bradley Cooper's chart-topping hit \"Shallow\" from \"A Star Is Born\" during their LM/DC Las Vegas tour stop.", "url": "http://www.mtv.com/news/3102714/lea-michele-darren-criss-a-star-is-born-cover/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:662083?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-29T22:56:33Z", "content": "The spirit of Glee is still alive on the LM/DC tour ! During their Las Vegas tour stop on Friday (October 26), Lea Michele and Darren Criss hit the stage with their rendition of Lady Gaga and Bradley Cooper's A Star Is Born hit, \"Shallow,\" and the cover felt … [+885 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Haley Longman", "title": "Family Dispute: Teen Mom OG‘s Maci Is Clashing With Ryan’s Parents", "description": "Maci and Ryan and his parents Jen and Larry disagree over whether or not to send Bentley to a private middle school called Baylor on Teen Mom OG.", "url": "http://www.mtv.com/news/3101310/teen-mom-og-maci-bentley-private-school/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:661924?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-30T02:00:40Z", "content": "Maci was at odds with Ryans parents on this weeks Teen Mom OG -- all because they disagreed about where Bentley should attend middle school in two years. For their part, Jen and Larry were pushing for private school, but Maci felt there was no reason to remov… [+1632 chars]"}, {"source": {"id": "mtv-news", "name": "MTV News"}, "author": "Matt Gehring", "title": "Donna Missal Used Her Platform For Good On ‘TRL’", "description": "Donna Missal joined TRL with host Sway Calloway in a \"protect trans kids\" shirt to perform her single \"Keep Lying\" from 'This Time' on Monday, October 29.", "url": "http://trl.mtv.com/news/3102764/donna-missal-used-her-platform-for-good-on-trl/", "urlToImage": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:662104?quality=0.8&format=jpg&width=1440&height=810&.jpg", "publishedAt": "2018-10-30T03:00:44Z", "content": "Donna Missal used every minute of her TRL appearance this morning to do the very most with the platform she's been given. Dropping by in a homemade shirt that read \"Protect Trans Kids,\" Donna spoke of the importance of using her voice for good, especially aft… [+716 chars]"}]}