{"status": "ok", "totalResults": 291, "articles": [{"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "11 Takeaways: Packers 33, 49ers 30 in Week 6 - 49ers.com", "description": "49ers.com 11 Takeaways: Packers 33, 49ers 30 in Week 6 49ers.com GREEN BAY, Wisc. -- The San Francisco 49ers certainly had their chances, but ultimately, it was Aaron Rodgers and the Green Bay Packers who pulled out the narrow victory on \"Monday Night Footbal…", "url": "https://49ers.pocket.nfl.com/news/11-takeaways-packers-33-49ers-30-in-week-6", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/49ers/zpzij1gl2tcypfrsiqaw", "publishedAt": "2018-10-16T04:49:45Z", "content": "GREEN BAY, Wisc. -- The San Francisco 49ers certainly had their chances, but ultimately, it was Aaron Rodgers and the Green Bay Packers who pulled out the narrow victory on \"Monday Night Football.\" The Packers won, 33-30, on a last-second field goal by Mason … [+5229 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "www.steelers.com", "title": "Commissioner Goodell on Fall Meetings", "description": "NFL COMMISSIONER ROGER GOODELL NEWS CONFERENCE 2018 FALL MEETING – NEW YORK – OCTOBER 17, 2018 Roger Goodell: Good afternoon. We covered a great deal over the last couple of days. I'm sure you'll have plenty of questions and I'll be happy to answer those. The…", "url": "https://steelers.pocket.nfl.com/news/commissioner-goodell-on-fall-meetings", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/steelers/vn9jhneutkcfxkyx0qod", "publishedAt": "2018-10-17T19:29:00Z", "content": "NFL COMMISSIONER ROGER GOODELL NEWS CONFERENCE 2018 FALL MEETING NEW YORK OCTOBER 17, 2018 Roger Goodell: Good afternoon. We covered a great deal over the last couple of days. I'm sure you'll have plenty of questions and I'll be happy to answer those. The foc… [+10084 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "News Blitz 10/19: Ready for road success - Patriots.com", "description": "Patriots.com News Blitz 10/19: Ready for road success Patriots.com The Patriots have been impressive in winning their last three games but look to do something they've yet to accomplish thus far this season when they travel to Chicago on Sunday: win a road ga…", "url": "https://patriots.pocket.nfl.com/news/news-blitz-10-19-ready-for-road-success", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/patriots/lhdpckp6t9afuvk8uvuh", "publishedAt": "2018-10-19T14:20:07Z", "content": null}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "Live Pregame Updates from London - Titansonline.com", "description": "Titansonline.com Live Pregame Updates from London Titansonline.com LONDON -- TitansOnline.com Senior Writer and Editor Jim Wyatt gives live pre-game updates prior to today's game against the Los Angeles Chargers at Wembley Stadium in London (8:30 a.m., CT). L…", "url": "https://titans.pocket.nfl.com/news/live-pregame-updates-from-london", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/titans/uf63g5eqsfsseabxdd0u", "publishedAt": "2018-10-21T12:44:27Z", "content": "Tennessee Titans' quarterback Marcus Mariota takes part in an NFL training session at Syon House, in Syon Park, south west London, Friday, Oct. 19, 2018. The Tennessee Titans are preparing for an NFL regular season game against the Los Angeles Chargers in Lon… [+13181 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Kevin Patra", "title": "Cowboys among teams interested in Amari Cooper - NFL.com", "description": "NFL.com Cowboys among teams interested in Amari Cooper NFL.com Jon Gruden insisted he's not shopping Amari Cooper, but that isn't stopping teams from doing their due diligence. NFL Network Insider Ian Rapoport reported Sunday morning that the Dallas Cowboys a…", "url": "http://www.nfl.com/news/story/0ap3000000976228/article/cowboys-among-teams-interested-in-amari-cooper", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/21/0ap3000000976212_thumbnail_200_150.jpg", "publishedAt": "2018-10-21T15:47:42Z", "content": "Jon Gruden insisted he's not shopping Amari Cooper, but that isn't stopping teams from doing their due diligence. NFL Network Insider Ian Rapoport reported Sunday morning that the Dallas Cowboys are one team that has checked in on the availability of the form… [+750 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Nick Shook", "title": "Jaguars bench Blake Bortles for Cody Kessler - NFL.com", "description": "NFL.com Jaguars bench Blake Bortles for Cody Kessler NFL.com Blake Bortles' rough day is over. Jacksonville has replaced Bortles with Cody Kessler. The Jaguars trailed the Texans 20-0 and Bortles accounted for two turnovers (two fumbles) in the first 34:15 of…", "url": "http://www.nfl.com/news/story/0ap3000000976508/article/jaguars-bench-blake-bortles-for-cody-kessler", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/21/0ap3000000976588_thumbnail_200_150.jpg", "publishedAt": "2018-10-21T18:49:40Z", "content": "Blake Bortles ' rough day is over. Jacksonville has replaced Bortles with Cody Kessler. The Jaguars trailed the Texans 20-0 and Bortles accounted for two turnovers (two fumbles) in the first 34:15 of action when Kessler entered the game. Bortles' second turno… [+1281 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Nick Shook", "title": "Watson took bus to Jacksonville for win over Jaguars - NFL.com", "description": "NFL.com Watson took bus to Jacksonville for win over Jaguars NFL.com The Houston Texans have won four games in a row, with the last three coming on gutsy performances from their budding star quarterback. It turns out, Deshaun Watson had to do more than a litt…", "url": "http://www.nfl.com/news/story/0ap3000000976946/article/watson-took-bus-to-jacksonville-for-win-over-jaguars", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/21/0ap3000000976947_thumbnail_200_150.jpg", "publishedAt": "2018-10-21T22:04:56Z", "content": "The Houston Texans have won four games in a row, with the last three coming on gutsy performances from their budding star quarterback. It turns out, Deshaun Watson had to do more than a little extra to play in Houston's Week 7 win over the Jacksonville Jaguar… [+2211 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Jeremy Bergman", "title": "DeVante Parker's agent: WR healthy, Gase 'incompent' - NFL.com", "description": "NFL.com DeVante Parker's agent: WR healthy, Gase 'incompent' NFL.com DeVante Parker is MIA in MIA and not on his own accord. The Miami Dolphins receiver has been sidelined by a quad injury for much of this season and has been held out of all but two games, wh…", "url": "http://www.nfl.com/news/story/0ap3000000977001/article/devante-parkers-agent-blasts-dolphins-adam-gase", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/21/0ap3000000976994_thumbnail_200_150.jpg", "publishedAt": "2018-10-21T22:58:00Z", "content": "DeVante Parker is MIA in MIA and not on his own accord. The Miami Dolphins receiver has been sidelined by a quad injury for much of this season and has been held out of all but two games, while new acquisitions Albert Wilson and Danny Amendola pace the Fins i… [+2326 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "TY Hilton Back In Lineup, Dontrelle Inman Getting First Colts Start, Against Bills - Colts.com", "description": "Colts.com TY Hilton Back In Lineup, Dontrelle Inman Getting First Colts Start, Against Bills Colts.com INDIANAPOLIS — T.Y. Hilton is back, and he'll have a brand new weapon lining up across the field from him. Hilton, who has missed the last two games with ch…", "url": "https://colts.pocket.nfl.com/news/t-y-hilton-back-in-lineup-dontrelle-inman-getting-first-colts-start-against-bill", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/colts/jhwpepmegfqi53sqwx9y", "publishedAt": "2018-10-21T15:29:02Z", "content": "INDIANAPOLIS T.Y. Hilton is back, and he'll have a brand new weapon lining up across the field from him. Hilton, who has missed the last two games with chest and hamstring injuries, is expected to be back in the lineup for today's Week 7 matchup against the B… [+3066 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Jeremy Bergman", "title": "Bengals LB Burfict fined $112K for hits vs. Steelers - NFL.com", "description": "Sports Illustrated Bengals LB Burfict fined $112K for hits vs. Steelers NFL.com Vontaze Burfict has been fined. Again. In his second game back from a four-game suspension, the Cincinnati Bengals linebacker incurred $112,000 in fines stemming from multiple pla…", "url": "http://www.nfl.com/news/story/0ap3000000976119/article/bengals-lb-burfict-fined-112k-for-hits-vs-steelers", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/20/0ap3000000976120_thumbnail_200_150.jpg", "publishedAt": "2018-10-20T21:27:00Z", "content": "Vontaze Burfict has been fined. Again. In his second game back from a four-game suspension, the Cincinnati Bengals linebacker incurred $112,000 in fines stemming from multiple plays against the Pittsburgh Steelers last week that were constituted as unnecessar… [+2103 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Brandon Lee", "title": "Surprising Stats: Week 7 - NFL.com", "description": "NFL.com Surprising Stats: Week 7 NFL.com Seven is supposedly a lucky number. But you can't go through life depending on luck. You need the facts. You need the numbers. Here are some interesting stats that will get you on the path toward creating your own luck…", "url": "http://www.nfl.com/fantasy/story/0ap3000000976049/article/surprising-stats-week-7", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/19/0ap3000000976051_thumbnail_200_150.jpg", "publishedAt": "2018-10-19T21:50:00Z", "content": "Seven is supposedly a lucky number. But you can't go through life depending on luck. You need the facts. You need the numbers. Here are some interesting stats that will get you on the path toward creating your own luck. Tennessee Titans at Los Angeles Charger… [+6781 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Herbie Teope", "title": "Belichick on Khalil Mack: No player is in LT's class - NFL.com", "description": "NFL.com Belichick on Khalil Mack: No player is in LT's class NFL.com Throughout the course of his coaching career, Bill Belichick has been around some of the NFL's all-time greats, including Hall of Famer Lawrence Taylor. So, as a subject-matter expert on foo…", "url": "http://www.nfl.com/news/story/0ap3000000975306/article/belichick-on-khalil-mack-no-player-is-in-lts-class", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/17/0ap3000000975279_thumbnail_200_150.jpg", "publishedAt": "2018-10-17T17:55:00Z", "content": "Throughout the course of his coaching career, Bill Belichick has been around some of the NFL's all-time greats, including Hall of Famer Lawrence Taylor. So, as a subject-matter expert on football and a variety of players, Belichick will often find himself on … [+1710 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Herbie Teope", "title": "Injuries: Cardinals' Josh Rosen (toe) in walking boot - NFL.com", "description": "NFL.com Injuries: Cardinals' Josh Rosen (toe) in walking boot NFL.com The Arizona Cardinals are in a wait-and-see mode with rookie quarterback Josh Rosen. Rosen, who suffered a toe injury on the Cardinals' final offensive play Thursday night, is in a walking …", "url": "http://www.nfl.com/news/story/0ap3000000975898/article/injuries-cardinals-josh-rosen-toe-in-walking-boot", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/19/0ap3000000975951_thumbnail_200_150.jpg", "publishedAt": "2018-10-19T17:35:53Z", "content": "The Arizona Cardinals are in a wait-and-see mode with rookie quarterback Josh Rosen. Rosen, who suffered a sprained toe on the Cardinals ' final offensive play Thursday night, is in a walking boot and pending an MRI, NFL Network Insider Ian Rapoport reported.… [+4544 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Kevin Patra", "title": "Big Ben: Burfict threatened JuJu after hit on Brown - NFL.com", "description": "NFL.com Big Ben: Burfict threatened JuJu after hit on Brown NFL.com The beef between Cincinnati Bengals linebacker Vontaze Burfict and the Pittsburgh Steelers isn't going away anytime soon. During Sunday's tilt, Burfict tossed an elbow at Steelers star receiv…", "url": "http://www.nfl.com/news/story/0ap3000000975035/article/big-ben-burfict-threatened-juju-after-hit-on-brown", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/16/0ap3000000975025_thumbnail_200_150.jpg", "publishedAt": "2018-10-16T17:54:00Z", "content": "The beef between Cincinnati Bengals linebacker Vontaze Burfict and the Pittsburgh Steelers isn't going away anytime soon. During Sunday's tilt, Burfict tossed an elbow at Steelers star receiver Antonio Brown, knocking the wideout out of the game briefly and d… [+1402 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Kevin Patra", "title": "Shad Khan withdraws bid to buy Wembley Stadium - NFL.com", "description": "NFL.com Shad Khan withdraws bid to buy Wembley Stadium NFL.com Jacksonville Jaguars owner Shad Khan is shutting down his efforts to buy Wembley Stadium. Khan and the Football Association announced Wednesday that the Jacksonville Jaguars owner has withdrawn hi…", "url": "http://www.nfl.com/news/story/0ap3000000975222/article/shad-khan-withdraws-bid-to-buy-wembley-stadium", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/17/0ap3000000975221_thumbnail_200_150.jpg", "publishedAt": "2018-10-17T14:35:27Z", "content": "Jacksonville Jaguars owner Shad Khan is shutting down his efforts to buy Wembley Stadium. Khan and the Football Association announced Wednesday that the Jacksonville Jaguars owner has withdrawn his unsolicited offer to purchase the London stadium. \"Unfortunat… [+3684 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "Bills Today: Kyle Williams explains why he returned for 2018 - BuffaloBills.com", "description": "BuffaloBills.com Bills Today: Kyle Williams explains why he returned for 2018 BuffaloBills.com 1 - Kyle Williams explains why he returned for 2018. Thousands of tears were shed in Western New York on Dec. 31, 2017. Just hours before the year came to an end, t…", "url": "https://bills.pocket.nfl.com/news/bills-today-kyle-williams-explains-why-he-returned-for-2018", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/bills/e7uz33zsevb7jtmdpeai", "publishedAt": "2018-10-17T09:00:32Z", "content": "1 - Kyle Williams explains why he returned for 2018 Thousands of tears were shed in Western New York on Dec. 31, 2017. Just hours before the year came to an end, the Bills qualified for the NFL postseason, putting an end to their playoff drought before it cou… [+4817 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Herbie Teope", "title": "Hue Jackson will not take over Browns' play-calling - NFL.com", "description": "NFL.com Hue Jackson will not take over Browns' play-calling NFL.com Cleveland Browns head coach Hue Jackson voiced frustrations over his team's offensive showing after Week 7's overtime loss to the Tampa Bay Buccaneers. While the Browns head coach expressed a…", "url": "http://www.nfl.com/news/story/0ap3000000977440/article/hue-jackson-will-not-take-over-browns-playcalling", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/22/0ap3000000977438_thumbnail_200_150.jpg", "publishedAt": "2018-10-22T19:53:00Z", "content": "Cleveland Browns head coach Hue Jackson voiced frustrations over his team's offensive showing after Week 7's overtime loss to the Tampa Bay Buccaneers. While the Browns head coach expressed a desire to be more involved on offense, one thing is now crystal cle… [+1868 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Marc Sessler", "title": "Raiders place Marshawn Lynch on injured reserve - NFL.com", "description": "NFL.com Raiders place Marshawn Lynch on injured reserve NFL.com Amari Cooper isn't the only one who won't play for the Raiders this Sunday. The team announced Monday that Marshawn Lynch has been placed on injured reserve because of core muscle injury. It's fa…", "url": "http://www.nfl.com/news/story/0ap3000000977493/article/raiders-place-marshawn-lynch-on-injured-reserve", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/22/0ap3000000977481_thumbnail_200_150.jpg", "publishedAt": "2018-10-22T22:13:00Z", "content": "Amari Cooper isn't the only one who won't play for the Raiders this Sunday. The team announced Monday that Marshawn Lynch has been placed on injured reserve because of core muscle injury. It's fair to wonder if the 32-year-old running back has played his fina… [+1123 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Herbie Teope", "title": "Drew Brees becomes fourth QB with 500 TD passes - NFL.com", "description": "NFL.com Drew Brees becomes fourth QB with 500 TD passes NFL.com New Orleans Saints quarterback Drew Brees on Sunday added another career accomplishment to his record-setting season. Brees threw a 1-yard touchdown pass to tight end Benjamin Watson in the secon…", "url": "http://www.nfl.com/news/story/0ap3000000976875/article/drew-brees-becomes-fourth-qb-with-500-td-passes", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/21/0ap3000000976927_thumbnail_200_150.jpg", "publishedAt": "2018-10-21T21:26:21Z", "content": "New Orleans Saints quarterback Drew Brees on Sunday added another career accomplishment to his record-setting season. Brees threw a 1-yard touchdown pass to tight end Benjamin Watson in the second quarter against the Baltimore Ravens to become the fourth quar… [+1268 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Michael Silver", "title": "Aggressive Payton sets tone in Saints' win over Ravens - NFL.com", "description": "NFL.com Aggressive Payton sets tone in Saints' win over Ravens NFL.com BALTIMORE -- In the days leading up to Sunday's scintillating stylistic showdown between the NFL's top scoring offense and its stingiest scoring defense, New Orleans Saints coach Sean Payt…", "url": "http://www.nfl.com/news/story/0ap3000000977325/article/aggressive-payton-sets-tone-in-saints-win-over-ravens", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/21/0ap3000000977324_thumbnail_200_150.jpg", "publishedAt": "2018-10-22T05:53:00Z", "content": "BALTIMORE -- In the days leading up to Sunday's scintillating stylistic showdown between the NFL's top scoring offense and its stingiest scoring defense, New Orleans Saints coach Sean Payton was in touch with his inner nerd. Awash in several binders' worth of… [+9722 chars]"}]}