{"status": "ok", "totalResults": 291, "articles": [{"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Kevin Patra", "title": "Injuries: Colts receiver TY Hilton practices fully - NFL.com", "description": "NFL.com Injuries: Colts receiver TY Hilton practices fully NFL.com T.Y. Hilton is making his way back from missing the past two games due to a hamstring injury. The Indianapolis Colts receiver told reporters on Wednesday he will test out his injury today and …", "url": "http://www.nfl.com/news/story/0ap3000000975310/article/injuries-colts-receiver-ty-hilton-practices-fully", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/17/0ap3000000975311_thumbnail_200_150.jpg", "publishedAt": "2018-10-17T20:10:37Z", "content": "T.Y. Hilton is making his way back from missing the past two games due to a hamstring injury. The Indianapolis Colts receiver told reporters on Wednesday he will test out his injury today and Thursday, on a restricted basis. We'll likely to know by week's end… [+2414 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Herbie Teope", "title": "Belichick on Khalil Mack: No player is in LT's class - NFL.com", "description": "NFL.com Belichick on Khalil Mack: No player is in LT's class NFL.com Throughout the course of his coaching career, Bill Belichick has been around some of the NFL's all-time greats, including Hall of Famer Lawrence Taylor. So, as a subject-matter expert on foo…", "url": "http://www.nfl.com/news/story/0ap3000000975306/article/belichick-on-khalil-mack-no-player-is-in-lts-class", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/17/0ap3000000975279_thumbnail_200_150.jpg", "publishedAt": "2018-10-17T17:55:00Z", "content": "Throughout the course of his coaching career, Bill Belichick has been around some of the NFL's all-time greats, including Hall of Famer Lawrence Taylor. So, as a subject-matter expert on football and a variety of players, Belichick will often find himself on … [+1710 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "www.detroitlions.com", "title": "Week 7 opponent: What the Dolphins are saying", "description": "Every week during the regular season we get an opportunity to talk with the opposing head coach via conference call. This week it was Miami Dolphins head coach Adam Gase. I also scanned the Miami area media websites and the Dolphins website, to see what else …", "url": "https://lions.pocket.nfl.com/news/week-7-opponent-what-the-dolphins-are-saying", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/lions/z3dpwzko0pfwizpjo8nz", "publishedAt": "2018-10-17T19:21:00Z", "content": "Every week during the regular season we get an opportunity to talk with the opposing head coach via conference call. This week it was Miami Dolphins head coach Adam Gase. I also scanned the Miami area media websites and the Dolphins website, to see what else … [+2991 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Nick Shook", "title": "Ryan Tannehill ruled out; NFL to review report of injury - NFL.com", "description": "NFL.com Ryan Tannehill ruled out; NFL to review report of injury NFL.com Ryan Tannehill's surprise scratch Sunday cleared the way for an unexpected Brocktoberfest. While that was fun for the fans in Miami, it didn't wipe away the fact Tannehill was mysterious…", "url": "http://www.nfl.com/news/story/0ap3000000975291/article/ryan-tannehill-ruled-out-nfl-to-review-report-of-injury", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/17/0ap3000000975295_thumbnail_200_150.jpg", "publishedAt": "2018-10-17T18:33:55Z", "content": "Ryan Tannehill 's surprise scratch Sunday cleared the way for an unexpected Brocktoberfest. While that was fun for the fans in Miami, it didn't wipe away the fact Tannehill was mysteriously unavailable last week. As a result, the league is reviewing the team'… [+1597 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "www.steelers.com", "title": "Commissioner Goodell on Fall Meetings", "description": "NFL COMMISSIONER ROGER GOODELL NEWS CONFERENCE 2018 FALL MEETING – NEW YORK – OCTOBER 17, 2018 Roger Goodell: Good afternoon. We covered a great deal over the last couple of days. I'm sure you'll have plenty of questions and I'll be happy to answer those. The…", "url": "https://steelers.pocket.nfl.com/news/commissioner-goodell-on-fall-meetings", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/steelers/vn9jhneutkcfxkyx0qod", "publishedAt": "2018-10-17T19:29:00Z", "content": "NFL COMMISSIONER ROGER GOODELL NEWS CONFERENCE 2018 FALL MEETING NEW YORK OCTOBER 17, 2018 Roger Goodell: Good afternoon. We covered a great deal over the last couple of days. I'm sure you'll have plenty of questions and I'll be happy to answer those. The foc… [+10084 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Graham Barfield", "title": "Next Gen Stats: Week 7 fantasy football matchups - NFL.com", "description": "Next Gen Stats: Week 7 fantasy football matchups NFL.com Now in its third season, Next Gen Stats has quickly exploded. The statistics are featured in game broadcasts, they are leveraged in countless articles, tweets, and podcasts throughout the week, and the …", "url": "http://www.nfl.com/fantasy/story/0ap3000000975650/article/next-gen-stats-week-7-fantasy-football-matchups", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/18/0ap3000000975642_thumbnail_200_150.jpg", "publishedAt": "2018-10-18T22:42:41Z", "content": "Now in its third season, Next Gen Stats has quickly exploded. The statistics are featured in game broadcasts, they are leveraged in countless articles, tweets, and podcasts throughout the week, and the Next Gen Stats database is free to access. In this weekly… [+16455 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "Cardinals Let Mike McCoy Go, Promote Byron Leftwich to Offensive Coordinator - AZCardinals.com", "description": "AZCardinals.com Cardinals Let Mike McCoy Go, Promote Byron Leftwich to Offensive Coordinator AZCardinals.com In the moments after the Cardinals' blowout loss to the Broncos Thursday night, Steve Wilks said it was “premature” to talk about any changes yet beca…", "url": "https://cardinals.pocket.nfl.com/news/cardinals-let-mike-mccoy-go-promote-byron-leftwich-to-offensive-coordinator", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/cardinals/j5ebqipmpaupxhqjblrl", "publishedAt": "2018-10-19T15:22:58Z", "content": "In the moments after the Cardinals blowout loss to the Broncos Thursday night, Steve Wilks said it was premature to talk about any changes yet because the situation had to be evaluated. Friday, after the coach had his chance to digest the situation, change ha… [+1794 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "What They're Saying: Derek Anderson: 'I'm fully committed to it' - BuffaloBills.com", "description": "BuffaloBills.com What They're Saying: Derek Anderson: 'I'm fully committed to it' BuffaloBills.com 1 - Derek Anderson: 'I'm fully committed to it'. The Buffalo Bills' quarterback carousel continues to turn, and it's now Derek Anderson's turn to hop on. An elb…", "url": "https://bills.pocket.nfl.com/news/what-they-re-saying-derek-anderson-i-m-fully-committed-to-it", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/bills/dmktdjh7rzzaf6vjn4mu", "publishedAt": "2018-10-17T20:53:43Z", "content": "1 - Derek Anderson: Im fully committed to it The Buffalo Bills quarterback carousel continues to turn, and its now Derek Andersons turn to hop on. An elbow injury will prevent rookie signal-caller Josh Allen from playing in the teams Week 7 matchup with the C… [+6701 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Herbie Teope", "title": "Pats' Rob Gronkowski not upset over red-zone targets - NFL.com", "description": "NFL.com Pats' Rob Gronkowski not upset over red-zone targets NFL.com New England Patriots tight end Rob Gronkowski is on a scoreless drought entering Sunday's game against the Chicago Bears. Gronkowski hasn't caught a touchdown pass since Week 1, a span of fi…", "url": "http://www.nfl.com/news/story/0ap3000000975545/article/pats-rob-gronkowski-not-upset-over-redzone-targets", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/18/0ap3000000975544_thumbnail_200_150.jpg", "publishedAt": "2018-10-18T16:37:00Z", "content": "New England Patriots tight end Rob Gronkowski is on a scoreless drought entering Sunday's game against the Chicago Bears. Gronkowski hasn't caught a touchdown pass since Week 1, a span of five games to mark the longest scoreless streak in a single season for … [+3019 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Elliot Harrison", "title": "NFL Week 7 game picks: Chiefs over Bengals; Saints top Ravens - NFL.com", "description": "NFL.com NFL Week 7 game picks: Chiefs over Bengals; Saints top Ravens NFL.com The bye weeks are fully upon us, with even more teams off this week than before...... but that doesn't mean the NFL schedule doesn't carry some sneaky-good games, especially on the …", "url": "http://www.nfl.com/news/story/0ap3000000975533/article/nfl-week-7-game-picks-chiefs-over-bengals-saints-top-ravens", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/18/0ap3000000975530_thumbnail_200_150.jpg", "publishedAt": "2018-10-18T16:11:05Z", "content": "The bye weeks are fully upon us, with even more teams off this week than before...... but that doesn't mean the NFL schedule doesn't carry some sneaky-good games, especially on the intra-divisional front. Start with Texans at Jaguars, a divisional showdown in… [+15283 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Brandon Lee", "title": "Surprising Stats: Week 7 - NFL.com", "description": "NFL.com Surprising Stats: Week 7 NFL.com Seven is supposedly a lucky number. But you can't go through life depending on luck. You need the facts. You need the numbers. Here are some interesting stats that will get you on the path toward creating your own luck…", "url": "http://www.nfl.com/fantasy/story/0ap3000000976049/article/surprising-stats-week-7", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/19/0ap3000000976051_thumbnail_200_150.jpg", "publishedAt": "2018-10-19T21:50:00Z", "content": "Seven is supposedly a lucky number. But you can't go through life depending on luck. You need the facts. You need the numbers. Here are some interesting stats that will get you on the path toward creating your own luck. Tennessee Titans at Los Angeles Charger… [+6781 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Herbie Teope", "title": "Injuries: Cardinals' Josh Rosen (toe) in walking boot - NFL.com", "description": "NFL.com Injuries: Cardinals' Josh Rosen (toe) in walking boot NFL.com The Arizona Cardinals are in a wait-and-see mode with rookie quarterback Josh Rosen. Rosen, who suffered a toe injury on the Cardinals' final offensive play Thursday night, is in a walking …", "url": "http://www.nfl.com/news/story/0ap3000000975898/article/injuries-cardinals-josh-rosen-toe-in-walking-boot", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/19/0ap3000000975951_thumbnail_200_150.jpg", "publishedAt": "2018-10-19T17:35:53Z", "content": "The Arizona Cardinals are in a wait-and-see mode with rookie quarterback Josh Rosen. Rosen, who suffered a sprained toe on the Cardinals ' final offensive play Thursday night, is in a walking boot and pending an MRI, NFL Network Insider Ian Rapoport reported.… [+4544 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Austin Knoblauch", "title": "Everson Griffen set to return for Vikings vs. Saints - NFL.com", "description": "NFL.com Everson Griffen set to return for Vikings vs. Saints NFL.com Everson Griffen is poised to make his game day return to the Minnesota Vikings on Sunday. The defense end, who missed the last five games because of a mental health issue, is expected to pla…", "url": "http://www.nfl.com/news/story/0ap3000000978703/article/everson-griffen-set-to-return-for-vikings-vs-saints", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/26/0ap3000000978697_thumbnail_200_150.jpg", "publishedAt": "2018-10-26T20:39:45Z", "content": "Everson Griffen is poised to make his game day return to the Minnesota Vikings on Sunday. The defense end, who missed the last five games because of a mental health issue, is expected to play against the New Orleans Saints, NFL Network's Tom Pelissero reporte… [+1319 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Bucky Brooks", "title": "Jaguars' sickness... diagnosed! Plus, a warning to Raider Nation - NFL.com", "description": "NFL.com Jaguars' sickness... diagnosed! Plus, a warning to Raider Nation NFL.com Former NFL player and scout Bucky Brooks knows the ins and outs of this league, providing keen insight in his notebook. The topics of this edition include: -- The problem with Jo…", "url": "http://www.nfl.com/news/story/0ap3000000978742/article/jaguars-sickness-diagnosed-plus-a-warning-to-raider-nation", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/26/0ap3000000978726_thumbnail_200_150.jpg", "publishedAt": "2018-10-26T22:47:08Z", "content": "Former NFL player and scout Bucky Brooks knows the ins and outs of this league, providing keen insight in his notebook. The topics of this edition include: -- The problem with Jon Gruden's Raiders going all in on the draft. -- Why the Cowboys ' trade for Amar… [+27738 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Kevin Patra", "title": "Chad Kelly released by Broncos day after arrest - NFL.com", "description": "NFL.com Chad Kelly released by Broncos day after arrest NFL.com The Denver Broncos aren't giving Chad Kelly another chance. The Broncos released backup quarterback Chad Kelly on Wednesday following his arrest on suspicion of first-degree criminal trespassing …", "url": "http://www.nfl.com/news/story/0ap3000000977922/article/chad-kelly-released-by-broncos-day-after-arrest", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/24/0ap3000000977921_thumbnail_200_150.jpg", "publishedAt": "2018-10-24T15:09:43Z", "content": "The Denver Broncos aren't giving Chad Kelly another chance. The Broncos released backup quarterback Chad Kelly on Wednesday following his arrest on suspicion of first-degree criminal trespassing on Tuesday. Mike Klis of KUSA in Denver first reported the devel… [+2270 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Kevin Patra", "title": "Giants players 'not throwing in the towel' on 2018 - NFL.com", "description": "NFL.com Giants players 'not throwing in the towel' on 2018 NFL.com To the rest of the world, the New York Giants (1-6) are rebuilding on the fly, effectively admitting their chances of making the postseason are zilch. The trades of Eli Apple and Damon Harriso…", "url": "http://www.nfl.com/news/story/0ap3000000978158/article/giants-players-not-throwing-in-the-towel-on-2018", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/25/0ap3000000978157_thumbnail_200_150.jpg", "publishedAt": "2018-10-25T13:19:00Z", "content": "To the rest of the world, the New York Giants (1-6) are rebuilding on the fly, effectively admitting their chances of making the postseason are zilch. The trades of Eli Apple and Damon Harrison in the past week signaled the change in approach from a Giants fr… [+1543 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Elliot Harrison", "title": "NFL Week 8 game picks: Saints nip Vikings, Rams top Packers - NFL.com", "description": "NFL.com NFL Week 8 game picks: Saints nip Vikings, Rams top Packers NFL.com Seven straight wins, and the Rams are not getting the love... Sean McVay's football team has taken on all comers, and disposed of most of them quite easily. Not only does L.A. deserve…", "url": "http://www.nfl.com/news/story/0ap3000000978174/article/nfl-week-8-game-picks-saints-nip-vikings-rams-top-packers", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/24/0ap3000000978107_thumbnail_200_150.jpg", "publishedAt": "2018-10-25T15:16:08Z", "content": "Seven straight wins, and the Rams are not getting the love... Sean McVay's football team has taken on all comers, and disposed of most of them quite easily. Not only does L.A. deserve as much coverage as Patrick Mahomes or the Le'Veon Bell saga, but they are … [+14667 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "Eagle Eye: Creating Giant Headaches - PhiladelphiaEagles.com", "description": "PhiladelphiaEagles.com Eagle Eye: Creating Giant Headaches PhiladelphiaEagles.com The Eagles' offense came back to life against the New York Giants last Thursday night, which was great to see, but the defense was equally as fun to watch for many reasons. The …", "url": "https://eagles.pocket.nfl.com/news/philadelphia-eagle-eye-creating-giant-headaches", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/eagles/sbnxhiikmzokeldnl5ta", "publishedAt": "2018-10-16T04:39:53Z", "content": "The Eagles' offense came back to life against the New York Giants last Thursday night, which was great to see, but the defense was equally as fun to watch for many reasons. The thing I was most excited to see, however, was the look of the Eagles' secondary. S… [+10109 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Elliot Harrison", "title": "NFL Power Rankings, Week 7: Patriots back; Raiders hit bottom - NFL.com", "description": "ESPN NFL Power Rankings, Week 7: Patriots back; Raiders hit bottom NFL.com The Patriots ascend, the Jags don't and the rest is history. Before we get to all that, NFL history took two losses this week: Jim Taylor and Paul Allen. Taylor, a former Packers great…", "url": "http://www.nfl.com/news/story/0ap3000000974986/article/nfl-power-rankings-week-7-patriots-back-raiders-hit-bottom", "urlToImage": "http://static.nfl.com/static/content/public/photo/2018/10/15/0ap3000000974838_thumbnail_200_150.jpg", "publishedAt": "2018-10-16T15:27:19Z", "content": "The Patriots ascend, the Jags don't and the rest is history. Before we get to all that, NFL history took two losses this week: Jim Taylor and Paul Allen. Taylor, a former Packers great, passed away on Saturday. A Hall of Famer and one of the game's all-time p… [+24516 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": null, "title": "11 Takeaways: Packers 33, 49ers 30 in Week 6 - 49ers.com", "description": "49ers.com 11 Takeaways: Packers 33, 49ers 30 in Week 6 49ers.com GREEN BAY, Wisc. -- The San Francisco 49ers certainly had their chances, but ultimately, it was Aaron Rodgers and the Green Bay Packers who pulled out the narrow victory on \"Monday Night Footbal…", "url": "https://49ers.pocket.nfl.com/news/11-takeaways-packers-33-49ers-30-in-week-6", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/49ers/zpzij1gl2tcypfrsiqaw", "publishedAt": "2018-10-16T04:49:45Z", "content": "GREEN BAY, Wisc. -- The San Francisco 49ers certainly had their chances, but ultimately, it was Aaron Rodgers and the Green Bay Packers who pulled out the narrow victory on \"Monday Night Football.\" The Packers won, 33-30, on a last-second field goal by Mason … [+5229 chars]"}]}