{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Schmidt signs six-year extension with Golden Knights - NHL.com", "description": "NHL.com Schmidt signs six-year extension with Golden Knights NHL.com Nate Schmidt signed a six-year, $35.7 million contract extension with the Vegas Golden Knights on Wednesday. It has an average annual value of $5.95 million. The contract begins next season …", "url": "https://www.nhl.com/news/nate-schmidt-signs-six-year-extension-with-golden-knights/c-301263382", "urlToImage": "https://nhl.bamcontent.com/images/photos/299924776/1024x576/cut.jpg", "publishedAt": "2018-10-25T16:26:23Z", "content": null}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Wild send Kings to sixth straight loss - NHL.com", "description": "NHL.com Wild send Kings to sixth straight loss NHL.com ST. PAUL, Minn. -- The Minnesota Wild extended their winning streak to four games with a 4-1 victory against the Los Angeles Kings at Xcel Energy Center on Thursday. The Kings (2-7-1) lost their sixth str…", "url": "https://www.nhl.com/news/los-angeles-kings-minnesota-wild-game-recap/c-301283666", "urlToImage": "https://nhl.bamcontent.com/images/photos/301296140/1024x576/cut.jpg", "publishedAt": "2018-10-26T03:08:09Z", "content": "ST. PAUL, Minn. -- The Minnesota Wild extended their winning streak to four games with a 4-1 victory against the Los Angeles Kings at Xcel Energy Center on Thursday. The Kings (2-7-1) lost their sixth straight game (0-6-0). Eric Fehr had a goal and an assist,… [+3494 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Penguins' pedigree shows in win against Maple Leafs - NHL.com", "description": "NHL.com Penguins' pedigree shows in win against Maple Leafs NHL.com TORONTO -- John Tavares experienced an old feeling with his new team Thursday. [GAME RECAP: Murray shuts out Maple Leafs, ends Matthews' streak in return to Penguins]. The disappointment of l…", "url": "https://www.nhl.com/news/pittsburgh-penguins-show-pedigree-in-win-over-toronto-maple-leafs/c-301085884", "urlToImage": "https://nhl.bamcontent.com/images/photos/301086334/1024x576/cut.jpg", "publishedAt": "2018-10-19T04:55:32Z", "content": "TORONTO -- John Tavares experienced an old feeling with his new team Thursday. [GAME RECAP: Murray shuts out Maple Leafs, ends Matthews' streak in return to Penguins ] The disappointment of losing to the Pittsburgh Penguins. \"I've seen them a lot in my career… [+4721 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Red Wings rally with late goals to repel Rangers - NHL.com", "description": "NHL.com Red Wings rally with late goals to repel Rangers NHL.com DETROIT -- Dylan Larkin scored with six seconds left in overtime to give the Detroit Red Wings a 3-2 win against the New York Rangers at Little Caesars Arena on Friday. Larkin flipped Andreas At…", "url": "https://www.nhl.com/news/new-york-rangers-detroit-red-wings-game-recap/c-301768730", "urlToImage": "https://nhl.bamcontent.com/images/photos/301788978/1024x576/cut.jpg", "publishedAt": "2018-11-10T03:24:57Z", "content": "DETROIT -- Dylan Larkin scored with six seconds left in overtime to give the Detroit Red Wings a 3-2 win against the New York Rangers at Little Caesars Arena on Friday. \"The way we played in the third period was fun hockey,\" Larkin said. \"We just worked and w… [+4177 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Quenneville turned Blackhawks into Stanley Cup champions - NHL.com", "description": "NHL.com Quenneville turned Blackhawks into Stanley Cup champions NHL.com Joel Quenneville, the second-winningest coach in NHL history, was fired Tuesday by the Chicago Blackhawks. Quenneville, 60, has 890 wins, more than any other NHL coach except Scotty Bowm…", "url": "https://www.nhl.com/news/joel-quenneville-career-timeline/c-301657086", "urlToImage": "https://nhl.bamcontent.com/images/photos/301658656/1024x576/cut.jpg", "publishedAt": "2018-11-06T18:19:11Z", "content": "Joel Quenneville, the second-winningest coach in NHL history, was fired Tuesday by the Chicago Blackhawks. Quenneville, 60, has 890 wins, more than any other NHL coach except Scotty Bowman (1,244). He was in his 11th season with the Blackhawks and led Chicago… [+5355 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Hagelin traded to Kings by Penguins for Pearson - NHL.com", "description": "NHL.com Hagelin traded to Kings by Penguins for Pearson NHL.com CRANBERRY, Pa. -- Carl Hagelin was traded to the Los Angeles Kings by the Pittsburgh Penguins on Wednesday for Tanner Pearson. Hagelin, a 30-year-old forward, has three points (one goal, two assi…", "url": "https://www.nhl.com/news/penguins-trade-carl-hagelin-to-kings-for-tanner-pearson/c-301927780", "urlToImage": "https://nhl.bamcontent.com/images/photos/301927758/1024x576/cut.jpg", "publishedAt": "2018-11-14T23:21:49Z", "content": "CRANBERRY, Pa. -- Carl Hagelin was traded to the Los Angeles Kings by the Pittsburgh Penguins on Wednesday for Tanner Pearson. Hagelin, a 30-year-old forward, has three points (one goal, two assists) in 16 games this season. He had 31 points (10 goals, 21 ass… [+3355 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Couture scores hat trick for Sharks in win against Sabres - NHL.com", "description": "NHL.com Couture scores hat trick for Sharks in win against Sabres NHL.com SAN JOSE -- Logan Couture scored his third NHL hat trick, and Evander Kane had two assists in his first game against his former team to help the San Jose Sharks to a 5-1 victory against…", "url": "https://www.nhl.com/news/buffalo-sabres-san-jose-sharks-game-recap/c-301068220", "urlToImage": "https://nhl.bamcontent.com/images/photos/301088420/1024x576/cut.jpg", "publishedAt": "2018-10-19T05:35:55Z", "content": "SAN JOSE -- Logan Couture scored his third NHL hat trick, and Evander Kane had two assists in his first game against his former team to help the San Jose Sharks to a 5-1 victory against the Buffalo Sabres at SAP Center on Thursday. Couture scored in the first… [+4308 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Crawford plays well for Blackhawks in first game since December - NHL.com", "description": "NHL.com Crawford plays well for Blackhawks in first game since December NHL.com CHICAGO -- Corey Crawford's excitement was tempered, to say the least. [GAME RECAP: Crawford returns, Blackhawks lose to Coyotes]. Crawford was playing in his first game since Dec…", "url": "https://www.nhl.com/news/corey-crawford-makes-strong-return-to-chicago-blackhawks/c-301086330", "urlToImage": "https://nhl.bamcontent.com/images/photos/301088074/1024x576/cut.jpg", "publishedAt": "2018-10-19T05:22:54Z", "content": "CHICAGO -- Corey Crawford 's excitement was tempered, to say the least. [GAME RECAP: Crawford returns, Blackhawks lose to Coyotes ] Crawford was playing in his first game since Dec. 23, 2017, because of a concussion, made 27 saves for the Chicago Blackhawks i… [+2374 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Willie Desjardins Named Head Coach; John Stevens Relieved of His Duties - NHL.com", "description": "NHL.com Willie Desjardins Named Head Coach; John Stevens Relieved of His Duties NHL.com The LA Kings have relieved John Stevens of his head coaching duties and Willie Desjardins has been named the new interim head coach, Kings Vice President and General Manag…", "url": "https://www.nhl.com/kings/news/willie-desjardins-named-head-coach-john-stevens-relieved-of-his-duties/c-301610344", "urlToImage": "https://nhl.bamcontent.com/images/photos/301612212/1024x576/cut.jpg", "publishedAt": "2018-11-04T19:42:07Z", "content": "The LA Kings have relieved John Stevens of his head coaching duties and Willie Desjardins has been named the new interim head coach, Kings Vice President and General Manager Rob Blake announced today. \"This is a critical time in our season and our results to … [+1553 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Stevens fired as coach of Kings, Desjardins named replacement - NHL.com", "description": "NHL.com Stevens fired as coach of Kings, Desjardins named replacement NHL.com LOS ANGELES -- John Stevens was fired as coach of the Los Angeles Kings on Sunday. Willie Desjardins was named his replacement for the remainder of this season. Assistant Don Nachba…", "url": "https://www.nhl.com/news/john-stevens-fired-as-kings-coach-willie-desjardins-named-replacement/c-301612046", "urlToImage": "https://nhl.bamcontent.com/images/photos/301612228/1024x576/cut.jpg", "publishedAt": "2018-11-04T21:34:57Z", "content": "LOS ANGELES -- John Stevens was fired as coach of the Los Angeles Kings on Sunday. Willie Desjardins was named his replacement for the remainder of this season. Assistant Don Nachbaur was also fired and replaced by Marco Sturm, though Sturm will not join the … [+2840 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Colliton becomes coach of Blackhawks, youngest in NHL - NHL.com", "description": "NHL.com Colliton becomes coach of Blackhawks, youngest in NHL NHL.com CHICAGO -- Jeremy Colliton, named coach of the Chicago Blackhawks after Joel Quenneville was fired Tuesday, has gotten successful results quickly with his previous teams. But taking over th…", "url": "https://www.nhl.com/news/chicago-blackhawks-jeremy-colliton-becomes-youngest-coach-in-nhl/c-301670160", "urlToImage": "https://nhl.bamcontent.com/images/photos/301672944/1024x576/cut.jpg", "publishedAt": "2018-11-07T00:37:56Z", "content": "CHICAGO -- Jeremy Colliton, named coach of the Chicago Blackhawks after Joel Quenneville was fired Tuesday, has gotten successful results quickly with his previous teams. But taking over the Blackhawks (6-6-5), who have lost five straight and are sixth in the… [+3537 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Penguins could see more changes after trading Hagelin, GM says - NHL.com", "description": "NHL.com Penguins could see more changes after trading Hagelin, GM says NHL.com CRANBERRY, Pa. -- The Pittsburgh Penguins traded forward Carl Hagelin on Wednesday, and more moves could be coming. \"We're not tracking toward winning a Stanley Cup right now,\" gen…", "url": "https://www.nhl.com/news/jim-rutherford-pittsburgh-penguins-could-see-more-changes/c-301932714", "urlToImage": "https://nhl.bamcontent.com/images/photos/301937318/1024x576/cut.jpg", "publishedAt": "2018-11-15T01:14:52Z", "content": "CRANBERRY, Pa. -- The Pittsburgh Penguins traded forward Carl Hagelin on Wednesday, and more moves could be coming. \"We're not tracking toward winning a Stanley Cup right now,\" general manager Jim Rutherford said after the trade with the Los Angeles Kings for… [+4281 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Facts and Figures: Avalanche top line continues fast start - NHL.com", "description": "NHL.com Facts and Figures: Avalanche top line continues fast start NHL.com The Colorado Avalanche line of center Nathan MacKinnon and forwards Mikko Rantanen and Gabriel Landeskog had another big night Friday, combining for 10 points in a come-from-behind 6-3…", "url": "https://www.nhl.com/news/facts-and-figures-colorado-avalanche-top-line-october-27/c-301336068", "urlToImage": "https://nhl.bamcontent.com/images/photos/301336388/1024x576/cut.jpg", "publishedAt": "2018-10-27T13:47:11Z", "content": null}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Islanders top Penguins to complete road sweep; Lehner injured - NHL.com", "description": "NHL.com Islanders top Penguins to complete road sweep; Lehner injured NHL.com PITTSBURGH -- Jordan Eberle scored twice to help the New York Islanders to a 6-3 win against the Pittsburgh Penguins at PPG Paints Arena on Tuesday. Eberle's first goal, which gave …", "url": "https://www.nhl.com/news/new-york-islanders-pittsburgh-penguins-game-recap/c-301435218", "urlToImage": "https://nhl.bamcontent.com/images/photos/301444078/1024x576/cut.jpg", "publishedAt": "2018-10-31T03:44:56Z", "content": "PITTSBURGH -- Jordan Eberle scored twice to help the New York Islanders to a 6-3 win against the Pittsburgh Penguins at PPG Paints Arena on Tuesday. Eberle's first goal, which gave the Islanders a 4-2 lead on a power play at 11:56 of the second period, chased… [+4513 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Colliton loses coaching debut with Blackhawks to Hurricanes - NHL.com", "description": "NHL.com Colliton loses coaching debut with Blackhawks to Hurricanes NHL.com CHICAGO -- Jeremy Colliton lost his NHL coaching debut with the Chicago Blackhawks, 4-3 to the Carolina Hurricanes at United Center on Thursday. \"We definitely got better as the game …", "url": "https://www.nhl.com/news/carolina-hurricanes-chicago-blackhawks-game-recap/c-301736802", "urlToImage": "https://nhl.bamcontent.com/images/photos/301752536/1024x576/cut.jpg", "publishedAt": "2018-11-09T04:16:50Z", "content": "CHICAGO -- Jeremy Colliton lost his NHL coaching debut with the Chicago Blackhawks, 4-3 to the Carolina Hurricanes at United Center on Thursday. \"We definitely got better as the game went on,\" Colliton said. \"No doubt about that. I liked, we had a push there … [+4626 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Crosby may be out for Penguins against Lightning - NHL.com", "description": "NHL.com Crosby may be out for Penguins against Lightning NHL.com CRANBERRY, Pa. -- Sidney Crosby could be sidelined with an upper-body injury when the Pittsburgh Penguins host the Tampa Bay Lightning on Thursday (7 p.m. ET; TVAS, ATTSN-PT, SUN, NHL.TV). The 3…", "url": "https://www.nhl.com/news/pittsburgh-penguins-sidney-crosby-may-be-out-of-lineup/c-301930580", "urlToImage": "https://nhl.bamcontent.com/images/photos/301930820/1024x576/cut.jpg", "publishedAt": "2018-11-15T01:14:52Z", "content": null}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Rutherford acquires Pearson to help Pens break funk - NHL.com", "description": "NHL.com Rutherford acquires Pearson to help Pens break funk NHL.com General manager Jim Rutherford signed a three-year contract extension with the Pens on Wednesday afternoon. Rutherford's first order of business after the extension? A trade. Pittsburgh acqui…", "url": "https://www.nhl.com/penguins/news/rutherford-acquires-pearson-to-help-pens-break-funk/c-301930710", "urlToImage": "https://nhl.bamcontent.com/images/photos/301930598/1024x576/cut.jpg", "publishedAt": "2018-11-14T19:17:56Z", "content": "Pittsburgh acquired forward Tanner Pearson from the Los Angeles Kings in exchange for locker room favorite Carl Hagelin. \"We felt that we needed to make some changes,\" Rutherford said. \"This could be the start, but we'll see how this goes for a little bit. Th… [+2246 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Highlights from Hockey Hall of Fame Class of 2018 speeches - NHL.com", "description": "NHL.com Highlights from Hockey Hall of Fame Class of 2018 speeches NHL.com TORONTO -- The six newest members of the Hockey Hall of Fame were inducted Monday. Here are some of the key moments from the induction speeches of Commissioner Gary Bettman, Willie O'R…", "url": "https://www.nhl.com/news/highlights-from-hockey-hall-of-fame-speeches/c-301879246", "urlToImage": "https://nhl.bamcontent.com/images/photos/301885250/124x70/cut.jpg", "publishedAt": "2018-11-13T04:46:23Z", "content": "COMMISSIONER GARY BETTMAN: Hall of Fame journey had humble beginning Bettman's tenure as NHL Commissioner nearly never happened. After interviewing as the last of five finalists in November 1992, he received a call offering him the position. He initially turn… [+10730 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": null, "title": "Strome traded to Rangers by Oilers for Spooner - NHL.com", "description": "NHL.com Strome traded to Rangers by Oilers for Spooner NHL.com Ryan Strome was traded to the New York Rangers by the Edmonton Oilers for Ryan Spooner on Friday. Strome, a 25-year-old forward, had two points (one goal, one assist) in 18 games this season. He w…", "url": "https://www.nhl.com/news/new-york-rangers-acquire-ryan-strome-for-ryan-spooner/c-302005940", "urlToImage": "https://nhl.bamcontent.com/images/photos/302005644/1024x576/cut.jpg", "publishedAt": "2018-11-16T20:35:38Z", "content": "Ryan Strome was traded to the New York Rangers by the Edmonton Oilers for Ryan Spooner on Friday. Strome, a 25-year-old forward, has two points (one goal, one assist) in 18 games this season. He was in his second season with the Oilers, who acquired him in a … [+1569 chars]"}]}