{"status": "ok", "totalResults": 595, "articles": [{"source": {"id": "polygon", "name": "Polygon"}, "author": "Owen S. Good", "title": "Red Dead Redemption 2 developers open up about work conditions at Rockstar Games", "description": "Rockstar Games gave permission for developers at its studios to speak on social media about their experiences working for the company, in response to an interview in New York magazine in which a studio co-founder breezily mentioned that 100-hour workweeks wer…", "url": "https://www.polygon.com/2018/10/18/17994068/red-dead-redemption-2-crunch-rockstar-games", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LNRdN2vgRfTGBkMdAtSKuut3HsU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10777205/02.jpg", "publishedAt": "2018-10-18T14:04:34Z", "content": "Several refute talk that 100-hour workweeks are the norm Rockstar Games, still battling blowback from the offhand comment that a company co-founder gave about long work hours in an interview published this week, last night gave current employees permission to… [+5203 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Charlie Hall", "title": "Thronebreaker: The Witcher Tales transforms Gwent into magic", "description": "How about an isometric RPG set in the Witcher universe? Thronebreaker: The Witcher Tales also serves as an elaborate master class on playing the competitive CCG, Gwent. Here are our impressions of the PlayStation 4, Windows PC and Xbox One game.", "url": "https://www.polygon.com/2018/10/18/17994198/thronebreaker-the-witcher-tales-review-preview-impressions", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LB_i0tsxSExKT4D6EjjY6CzopOU=/0x0:1107x580/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13200867/prepare_for_war_en.2.jpg", "publishedAt": "2018-10-18T15:00:02Z", "content": "An RPG filled with clever challenges and puzzles that feel like parlor tricks Thronebreaker: The Witcher Tales is a complete reimagining of Gwent, the in-fiction collectible card game from CD Projekt Red’s legendary series of Witcher role-playing games. It’s … [+4924 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Russ Frushtick", "title": "Get a score of 3 or more at different Shooting Galleries - Fortnite Challenge Guide", "description": "This week has you hunting for shooting galleries around the map", "url": "https://www.polygon.com/fortnite-battle-royale-guide/2018/10/18/17994672/get-a-score-of-3-or-more-at-different-shooting-galleries-fortnite-challenge-guide", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vjPCV43ZBThZMJWbOAMiqgPfnfk=/53x0:1782x905/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13292671/Screen_Shot_2018_10_18_at_11.14.29_AM.png", "publishedAt": "2018-10-18T15:17:39Z", "content": "Fortnite s challenges have been much more direct of late, but that doesnt mean there arent some tricky ones floating around. Take for example, this weeks: Get a score of 3 or more at different Shooting Galleries. Seems easy enough, but only if you know exactl… [+926 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "Destiny 2 data mining suggests the return of Destiny’s Thunderlord", "description": "Thanks to the recent Destiny 2 patch, players have been able to search through the game’s new data to find evidence of the exotic machine gun Thunderlord.", "url": "https://www.polygon.com/2018/10/17/17991218/destiny-2-thunderlord-cosmodrome-festival-of-the-lost", "urlToImage": "https://cdn.vox-cdn.com/thumbor/hbT2035mcp4d_cTiv78pXYOFQHg=/0x0:1062x556/fit-in/1200x630/cdn.vox-cdn.com/assets/2784333/Destiny_10_1100.png", "publishedAt": "2018-10-17T21:00:02Z", "content": "It looks like players will be heading back home to pick up this old exotic machine gun For weeks, there has been a rumor in the Destiny community that the Thunderlord exotic machine gun will be returning as part of Destiny 2 ’s Festival of the Lost event, the… [+2698 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Owen S. Good", "title": "Epic takes big-time YouTuber to federal court over Fortnite hacks", "description": "A federal lawsuit against operators of two YouTube channels looks like a message at large to the hacking/modding subculture giving some players an unfair advantage in Fortnite.", "url": "https://www.polygon.com/fortnite/2018/10/17/17991422/fortnite-hacks-lawsuit-golden-modz-youtube-takedown", "urlToImage": "https://cdn.vox-cdn.com/thumbor/QmrQhgV6rj7QfQi47srkH46ZQxc=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10517003/download.png", "publishedAt": "2018-10-17T20:38:07Z", "content": "Lawsuit asks a judge to shut down hackers who boasted of ‘magical powers’ in the game Epic Games, maker of Fortnite, is now going after two YouTubers — one with more than 1.7 million subscribers — alleging they used aimbots to hack the game and sold their che… [+1682 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Emily Heller", "title": "The best horror video games to play on Halloween", "description": "From survival horror games to eerie visual novels, these are the scary games on PlayStation 4, Xbox One, Switch and PC that will keep you up at night.", "url": "https://www.polygon.com/deals/2018/10/17/17979906/best-horror-video-games-ps4-xbox-one-pc-switch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/sTXzXxCsLI9l4AVFGbqcWHRtl5w=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7611491/resident_evil_7b.jpg", "publishedAt": "2018-10-17T18:33:48Z", "content": "The horror genre is incredibly varied just ask my suggested Netflix categories. Slashers, psychological thrillers and creature features all have their own cliches and tropes. Still, from the campy spectacle of American Horror Story to the atmospheric slow bur… [+7063 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Emily Heller", "title": "Where and how to buy a PlayStation 4 Pro", "description": "Sony seems to be having some stock issues with the PlayStation 4 Pro console. Here are some tips on how to find one when Amazon says it’s out of stock.", "url": "https://www.polygon.com/deals/2018/10/17/17989726/playstation-4-pro-out-of-stock-where-to-buy-amazon-best-buy-gamestop-walmart", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RboOHVO7i0Nb7LdFiR1tM8k6P5Q=/0x148:2048x1220/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7455033/ps4_pro.jpg", "publishedAt": "2018-10-17T20:09:37Z", "content": "Its been a big year for PlayStation. From reaching a milestone of 500 million consoles sold, to announcing the PlayStation Classic and confirming work on its next console, Sony is going hard on gaming. For the past few months, however, Sonys flagship console,… [+2757 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "David L. Craddock", "title": "Why Shovel Knight was the right game at the right time", "description": "A new book by David L. Craddock looks at the making of Yacht Club Games’ debut title, Shovel Knight. Here’s an excerpt.", "url": "https://www.polygon.com/features/2018/10/19/17992216/why-shovel-knight-was-the-right-game-at-the-right-time", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YOkPYsGv80EzTVjIDGdMjcu7-KM=/0x189:1200x817/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13289627/shovelKnight.png", "publishedAt": "2018-10-19T16:00:02Z", "content": "A new book looks at the making of Yacht Club Games’ debut title The following excerpt comes from the book Shovel Knight, available now from publisher Boss Fight Books. Based around interviews with development studio Yacht Club Games, the book looks at the mak… [+13920 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "Destiny 2 Xur location and items, Oct. 19-22", "description": "Head to Io for some Exotic items for your favorite merchant. This week’s items include Sunshot, Orpheus Rig, Lion Rampant, Karnstein Armlets, and Three of Coins. Boots and gloves and handcannons for all!", "url": "https://www.polygon.com/destiny-2-guide-walkthrough/2018/10/19/18000998/destiny-2-xur-location-and-items-oct-19-22", "urlToImage": "https://cdn.vox-cdn.com/thumbor/iBLL-5itZUSZVwU_dfN80WEZSVY=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9253051/Xur_Destiny_2_.jpg", "publishedAt": "2018-10-19T17:51:25Z", "content": "If you played D estiny, you may be familiar with Xur, the weekly Exotic item merchant. In Destiny 2, hes back, and now appears all over the map. This week, hes on Io. You can find Xur hanging out inside a small cave to the east of the Giants Scar landing zone… [+4124 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Owen S. Good", "title": "Days Gone delayed two months", "description": "Days Gone, the open-world post-apocalyptic biker fantasy by Sony Bend, has been delayed again and this time will launch on PS4 in April 2019.", "url": "https://www.polygon.com/2018/10/19/17999436/days-gone-ps4-release-date-delay", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ey1Oie3NnyBI88TGtFZbDmZTLuY=/0x43:1920x1048/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6644245/vlcsnap-2016-06-13-21h20m17s083.0.png", "publishedAt": "2018-10-19T13:33:14Z", "content": "Days Gone, the PlayStation 4s zombie-apocalypse/motorcycle gang adventure, is being delayed two months. Its now launching April 26, 2019. Sony Bend, the studio developing the game, said it will use the extra time to further polish Days Gone. The game was firs… [+743 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Emily Heller", "title": "A beginner’s guide to streaming on Twitch and YouTube", "description": "A beginner’s guide to the headphones, microphones, capture cards and software you’ll need to start streaming video games on Twitch or YouTube.", "url": "https://www.polygon.com/deals/2018/10/19/17932522/twitch-youtube-streaming-guide-microphone-headphones-apps", "urlToImage": "https://cdn.vox-cdn.com/thumbor/MJbZ8JfOdfoti2Xwb6tm31OvZM0=/0x0:1280x670/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/4181954/twitch_ps4_app.0.jpg", "publishedAt": "2018-10-19T12:00:02Z", "content": "Video game livestreaming has gone from a niche subgenre to a cultural phenomenon in just a few years, with huge communities dedicated to specific platforms, games, and personalities. Professional streamers might make it look easy (and it can be !), but if you… [+10549 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Charlie Hall", "title": "BattleTech’s expansion will add 30 hours to the game in late November", "description": "BattleTech, from Harebrained Schemes, is launching the Flashpoint expansion on Nov. 27. Here’s what’s included, as well as details on the next expansion expected in summer 2019.", "url": "https://www.polygon.com/2018/10/18/17995344/battletech-flashpoint-expansion-release-date", "urlToImage": "https://cdn.vox-cdn.com/thumbor/q7ia-DCf1DLATp2ISlXwAGIHpaM=/0x4:1920x1009/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13293437/flashpoint.jpg", "publishedAt": "2018-10-18T17:10:02Z", "content": "BattleTech, the excellent, turn-based adaptation of the classic tactical miniatures wargame, is getting a big expansion, Flashpoint. Now that expansion has a release date of Nov. 27. Developer Harebrained Schemes dropped news of the release date alongside oth… [+2136 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "Black Ops 4 shows just how important Zombies is to Call of Duty", "description": "Dedicated hunters have been holding interact on broken glass bottles and shooting random walls for years now. But Treyarch seems to be leaning into the Easter eggs more as a feature with Call of Duty: Black Ops 4.", "url": "https://www.polygon.com/2018/10/18/17978270/call-of-duty-black-ops-4-zombies-easter-egg-hunt", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2ZrTXVyAtk-OJHwE3YKyba0CdhY=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13273723/Voyage.png", "publishedAt": "2018-10-18T22:15:10Z", "content": "Zombies is becoming the closest thing that Call of Duty has to raids Zombies has been a part of the Call of Duty package for 10 years now, first arriving with Call of Duty: World at War. Over the past decade, players have been hunting for cleverly hidden East… [+4819 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Funimation will cut ties with Crunchyroll, VRV next month", "description": "Thanks to the recent Sony acquisition, Funimation is not renewing their contract with third-party streaming sites.", "url": "https://www.polygon.com/2018/10/18/17996028/funimation-leaving-crunchyroll-vrv-streaming", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Kgn5qchULsODvl9CFODPPFH_FMA=/19x0:898x460/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11939803/My_Hero_Academia_Season_3.jpg", "publishedAt": "2018-10-18T19:33:23Z", "content": "Funimation, the American production company that specializes in anime distribution for shows like My Hero Academia, Dragon Ball Super, One Piece and Your Name, announced that it is leaving third-party streaming sites, including Crunchyroll and VRV. According … [+1282 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Owen S. Good", "title": "Some Soulcalibur 6 fans remind everyone why we can’t have nice things", "description": "Lizardman got a huge phallus in Soulcalibur 6 thanks to dirty-minded players using the game’s Create-a-Soul feature.", "url": "https://www.polygon.com/2018/10/19/18001852/soulcalibur-6-lizardman-mod-nsfw", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lEPXKRmUX0nRKfwQgPLKWOVZZLM=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13302023/aeonCalcos.jpg", "publishedAt": "2018-10-19T22:35:30Z", "content": "Soulcalibur 6 launched today and it again, foolishly, trusted fans with the Create a Soul feature, which is a very well endowed tool for creating custom characters. And boy, is it fun to play with. Warning: This video below depicts graphic and exaggerated liz… [+744 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Rafael Motamayor", "title": "Netflix’s The Night Comes For Us is the wildest martial arts film of the year", "description": "Timo Tjahjanto (Headshot) returns with a martial arts action movie that puts live-action Mortal Kombat movies to shame. Joe Taslim and Iko Uwais face off in an Indonesian crime movie that’s bloody fight after bloody fight. If you loved The Raid, watch this Ne…", "url": "https://www.polygon.com/2018/10/19/18001542/the-night-comes-for-us-review-netflix", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SxYOV_uNM9FCxllUwevhFqdhup4=/0x0:4256x2228/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13301287/TNCFU_2.jpeg", "publishedAt": "2018-10-19T21:03:06Z", "content": "Early word compared The Night Comes for Us, the new film from Headshot and V/H/S/2 director Timo Tjahjanto, to the bloody spectacle of The Raid movies. There are surface-level similarities: Both are set in Indonesia, feature simple plots, pack spectacularly c… [+4748 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Jeff Ramos", "title": "Red Dead Redemption’s Undead Nightmare was more than a trendy zombie game", "description": "Undead Nightmare wasn’t simply “Red Dead Redemption, but with zombies;” it was a refreshing take on how zombies could feel original in Red Dead’s existing world.", "url": "https://www.polygon.com/red-dead-redemption/2018/10/25/18022724/red-dead-redemption-undead-nightmare", "urlToImage": "https://cdn.vox-cdn.com/thumbor/efBTRTr7SyuGjaMKcT6r6nyfpj4=/0x71:1800x1013/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13333095/jbareham_181025_0811_0001.jpg", "publishedAt": "2018-10-25T20:00:02Z", "content": "A decade ago, we were lost in a horde of zombie games. From Minecraft to Dead Island, video games were toying with the undead, capitalizing on our cultural zombie obsession with varying degrees of success. But Red Dead Redemption s spin on the walking dead, a… [+3666 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Jenna Stoeber", "title": "The new Suspiria offers style and suspense — but don’t expect any neon pink", "description": "Luca Guadagnino’s remake of Suspiria breaks free of Dario Argento’s original, and makes for a moody, contemplative experience. Dakota Johnson and Tilda Swinton (in multiple roles!) shine in this eerie, dance-filled horror movie.", "url": "https://www.polygon.com/2018/10/25/18001526/suspiria-2018-review", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-thYWGDK6jch-TgTHnHFv5I2cwI=/0x0:4500x2356/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13319767/suspiria_16_427_AB_SUSPIRIA_04_0328_5_EW_Fall_Preview_rgb.jpg", "publishedAt": "2018-10-25T23:40:56Z", "content": "This months remake of Suspiria opens with fresh-faced Susie (Dakota Johnson) achieving her dream of joining the illustrious Helena Markos Dance Company. Her performance catches the eye of the director, Madame Blanc (Tilda Swinton), who draws her deeper and de… [+4431 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "MediEvil for PS4 will be a full remake, first trailer coming Oct. 31", "description": "Sony’s remake of the original MediEvil for PlayStation 4 is more than just a remaster, and we’ll get our first look at the PS4 version of the PlayStation classic on Halloween with a new trailer.", "url": "https://www.polygon.com/2018/10/26/18026722/medievil-ps4-remake-trailer-halloween", "urlToImage": "https://cdn.vox-cdn.com/thumbor/iQ3tifJSzp3zA_v2FP2rI9n1TL0=/0x138:1800x1080/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13338383/81Xgg_66a3L.jpg", "publishedAt": "2018-10-26T14:10:02Z", "content": "Remake of the PlayStation classic being developed by Other Ocean Interactive PlayStation fans will get their first look at the remake of MediEvil for PlayStation 4 next week, according to Shawn Layden, chairman of Sony Interactive Entertainment Worldwide Stud… [+1350 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "How to watch the Blackout Doritos Bowl Call of Duty streamer tournament", "description": "The first official Blackout tournament is happening at TwitchCon and will pit streamer all-stars against each other as well as fans. Here’s where you can watch the Blackout Doritos Bowl, as well as the team lineups.", "url": "https://www.polygon.com/gaming/2018/10/26/18024634/watch-blackout-doritos-bowl-call-of-duty-stream-tournament", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Lf9CCgHGHqeoG2eixtT1MNN3Dx4=/0x52:1436x804/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12861009/blackout.jpg", "publishedAt": "2018-10-26T14:30:02Z", "content": "You’ll even have a chance to play against the pros Call of Duty: Black Ops 4 and its battle royale mode, Blackout, have only been out for two weeks but it’s already time for the game’s first esports-style event: the Doritos Bowl, a streamer-focused Blackout t… [+1222 chars]"}]}