{"status": "ok", "totalResults": 1047, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "Steve McCaskill", "title": "Samsung buys Zhilabs to power 5G analytics", "description": "Samsung's 5G efforts continue with purchase of analytics experts", "url": "https://www.techradar.com/news/samsung-buys-zhilabs-to-power-5g-analytics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/72CQtFQSUN6GDhKtKibJEN-1200-80.jpeg", "publishedAt": "2018-10-17T14:58:46Z", "content": "Samsung is strengthening its bid to become a major player in 5G networks with the acquisition of analytics firm Zhilabs. Spain-based Zhilabs is best known for its intelligent network and service analytics technology and Samsung wants to use this in its 5G net… [+1525 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Cat Ellis", "title": "Spotify will soon let musicians upload tunes to rival services", "description": "Get your work on YouTube, Tidal, iTunes, Pandora and dozens more, all at once.", "url": "https://www.techradar.com/news/spotify-will-soon-let-musicians-upload-tunes-to-rival-services", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rorYXGYM3fmCr4iedyzqU9-1200-80.jpeg", "publishedAt": "2018-10-18T09:28:08Z", "content": "Artists will soon be able to use the Spotify app to upload their work to dozens of other platforms, including all of the streaming service's main rivals. According to Engadget, Spotify has partnered with startup Distrokid, a service that enables artists to up… [+852 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Phil Hall", "title": "Keep your images safe with Lexar's new fingerprint USB 3.0 drive", "description": "Lexar reckon's the JumpDrive Fingerprint F35 is one of the most secure USB 3.0 flash drives available.", "url": "https://www.techradar.com/news/keep-your-images-safe-with-lexars-new-fingerprint-usb-30-drive", "urlToImage": "https://cdn.mos.cms.futurecdn.net/txaZThRMs4Q7pcXRRMMyUb-1200-80.jpg", "publishedAt": "2018-10-18T12:47:20Z", "content": "Whether you're looking to share your hi-res portfolio with a few trusted clients or want to keep important documents secure, Lexar could have the answer with the JumpDrive Fingerprint F35 USB 3.0 Flash Drive. Lexar reckons it is one of the most secure USB 3.0… [+602 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gerald Lynch", "title": "Spotify for Wear OS finally does all the things you'd want it to", "description": "No more relying on third party apps to get your music playing as you'd like it to.", "url": "https://www.techradar.com/news/spotify-for-wear-os-finally-does-all-the-things-youd-want-it-to", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2BdFqj3FtAymG2PgyCcSrC-1200-80.jpg", "publishedAt": "2018-10-18T13:01:09Z", "content": "Spotify has announced that a brand new Wear OS app for Android wearables will be coming in the next week, finally sorting out some of the control woes the music streaming service has on techy wristwatches. Until now, Spotify has been lingering on with a last-… [+1017 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Pritchard,Vic Hood", "title": "Half-Life 3: release date, news and rumors for Valve's elusive beast", "description": "Will Gabe ever stop tormenting us with hats and just tell us if Half-Life 3 will see the light of day?", "url": "https://www.techradar.com/news/gaming/half-life-3-release-date-news-and-rumours-1290663", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ETCJuNkRqiwrh3BMAyf74h-1200-80.jpg", "publishedAt": "2018-10-18T14:35:00Z", "content": "On 10th October 2007, Valve released Half-Life 2: Episode 2, the continuation of Gordon Freeman’s story as he and his friends fought to free the human race from the oppression of the alien Combine. The ending provided very little in the way of closure, settin… [+11643 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Andrew Williams", "title": "HDR on a smartphone: is it really worth having?", "description": "HDR is boosting the mobile viewing experience for top-end phones - and hopefully more in the future", "url": "https://www.techradar.com/news/hdr-on-a-smartphone-is-it-really-worth-having", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2F2rmTfR8B3zaPqEYr9nbD-1200-80.jpg", "publishedAt": "2018-10-18T12:18:23Z", "content": "You've probably seen it mentioned, but never really understood what you're seeing: HDR is a thing in your smartphone's camera, but it's coming to screens as well. It's also being bandied about on high-end TVs as well, so it's clearly a good thing... but what … [+4917 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Sudhanshu Singh", "title": "Samsung Galaxy Tab S4 arrives in India to rival the Apple iPad Pro", "description": "A direct rival to Apple's iPad Pro, the Galaxy Tab S4 doesn't offer anything groundbreaking.", "url": "https://www.techradar.com/news/samsung-galaxy-tab-s4-arrives-in-india-to-rival-the-apple-ipad-pro", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9s9966sBoUq8UaUmzfM2B7-1200-80.jpg", "publishedAt": "2018-10-18T12:16:59Z", "content": "Samsung has launched their latest flagship tablet -- the Galaxy Tab S4 -- in India. As the name suggests, the 10.5-inch tablet succeeds the Galaxy Tab S3 and brings tons of new additions in terms of software features and hardware. It has a 10.5-inch 2560x1600… [+2840 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gerald Lynch", "title": "BBC, ITV, Channel 4 and Channel 5 want top billing on Netflix, Amazon Prime", "description": "UK broadcasters are urging the government to support them in taking on international streaming services.", "url": "https://www.techradar.com/news/bbc-itv-channel-4-and-channel-5-want-top-billing-on-netflix-amazon-prime", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Bq4CtLZAzeXrGB7GvBkjH-1200-80.jpg", "publishedAt": "2018-10-16T09:11:29Z", "content": "The leading public broadcasters in the UK have published an open letter urging the Government to support local networks against the rise of international streaming services. Signed by Carolyn McCall (CEO, ITV), Tony Hall (Director General, BBC), Alex Mahon (C… [+1954 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Angelique Medina", "title": "72% of FTSE 100 companies are at risk of being taken off the Internet – is your company too?", "description": "ThousandEyes' Angelique Medina explains why businesses should serve their DNS records from diverse networks to prevent being taken offline.", "url": "https://www.techradar.com/news/72-of-ftse-100-companies-are-at-risk-of-being-taken-off-the-internet-is-your-company-too", "urlToImage": "https://cdn.mos.cms.futurecdn.net/krMkFvnhuKwiWuzPnKN5ej-1200-80.jpg", "publishedAt": "2018-10-16T09:30:20Z", "content": "The Domain Name System (DNS) is one of the cornerstones of the Internet today. It is, in effect, the “phone book of the Internet.” However, despite its critical role, it’s also the least appreciated aspect of delivering an online user experience, and the most… [+4184 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Ian McDougall", "title": "Tech's ultimate success: software developers are now more valuable to companies than money", "description": "Stripe's Country Manager Ian McDougall explains how a lack of developer talent poses a serious threat to business growth in the age of digital transformation.", "url": "https://www.techradar.com/news/techs-ultimate-success-software-developers-are-now-more-valuable-to-companies-than-money", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Wnu43kUqLzL8aF47aNoE3e-1200-80.jpg", "publishedAt": "2018-10-16T08:30:06Z", "content": "A full quarter of a century into the era of the modern consumer internet and many are still grappling with the fundamental problem that is “ digital transformation ”. One reason businesses are still faced with this challenge is because it can’t be solved the … [+2978 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Sponsored", "title": "Try VideoProc: easily process and edit GoPro, DJI, iPhone 4K videos and win a GoPro Hero 7", "description": "VideoProc can also convert and backup DVD to digital formats, download videos, music and playlists from YouTube and over 1,000 other sites, record your PC’s screen and more.", "url": "https://www.techradar.com/news/try-videoproc-easily-process-and-edit-gopro-dji-iphone-4k-videos-and-win-a-gopro-hero-7", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3R2sRtVktyz2mKYVqJVqXY-1200-80.jpg", "publishedAt": "2018-10-16T08:42:54Z", "content": "When you’re editing video and audio files, you need software that will make it as quick and effortless as possible. VideoProc, a brand-new video processing suite from Digiarty Software, lets you convert, edit, resize, adjust, download and record all kinds of … [+5367 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Sharmishta Sarkar", "title": "Australian government to introduce new ‘rapid takedown’ anti-piracy legislation", "description": "The Aussie government aims to further crack down on illegal video and music downloads with new legislation.", "url": "https://www.techradar.com/news/australian-government-to-introduce-new-rapid-takedown-anti-piracy-legislation", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dpnvLZuYef6xLpgAsUYt3c-1200-80.jpg", "publishedAt": "2018-10-18T00:08:08Z", "content": "Australia's government has made a number of serious attempts to combat online piracy in recent years. Back in 2015, it introduced the Copyright Amendment (Online Infringement) Bill, which gave the Federal Court authority to have numerous online piracy sites b… [+1837 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "https://www.facebook.com/TechRadar", "title": "Invictus Games live stream: how to watch Sydney 2018 online free from anywhere", "description": "Watch Prince Harry's Invictus Games in Sydney from anywhere using these live streams options.", "url": "https://www.techradar.com/news/invictus-games-live-stream-how-to-watch-sydney-2018-online-free-from-anywhere", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fwzjjHMbRE6xzj4ua5xJy-1200-80.jpg", "publishedAt": "2018-10-20T07:04:16Z", "content": "Invictus Games 2018 - where and when This year's Invictus Games will take place in the Sydney Olympic Park, Australia. The opening ceremony will take place on Saturday October 20 at 7.30pm local time (10.30am BST, 2.30am PT, 5.30am ET). The sporting days will… [+4079 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Steve May", "title": "Panasonic DMP-UB700", "description": "Panasonic's second 4K Blu-ray player is much more affordable than the first, making it one of the best bargains of the year.", "url": "https://www.techradar.com/reviews/panasonic-dmp-ub700", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jfGWFH4MJd4JFCKKV4Rf24-1200-80.jpg", "publishedAt": "2018-10-20T19:05:41Z", "content": "With millions of discs sold and a catalog of hundreds of titles, the UHD Blu-ray format has defied critics and appears to be finding an audience amongst keen 4Kphiles with an eye for quality. But if you want to jump on board, what UHD deck should you buy? We … [+4998 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Nate Drake", "title": "Xero", "description": "Xero is a great choice for businesses that want all of their accountancy needs met by one platform.", "url": "https://www.techradar.com/reviews/xero", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XSfiZyKBW6cWVG8MZyQeNd-1200-80.jpg", "publishedAt": "2018-10-20T15:00:35Z", "content": "Xero is a New Zealand cloud-based accounting solution. It was founded in 2006 and has offices in New Zealand, Australia, the UK, Singapore and the US. The platform offers a wide-range of accounting features which are coveted by most business users. These incl… [+5319 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mike Williams", "title": "McAfee Total Protection", "description": "This antivirus suite gives you plenty of features, but how useful or powerful are they?", "url": "https://www.techradar.com/reviews/mcafee-total-protection", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZAg6MXWPcARgqrdQbRTvsV-1200-80.jpg", "publishedAt": "2018-10-19T11:58:40Z", "content": "Most security vendors offer a wide range of products: a basic antivirus, a simple security suite, a more comprehensive security suite, an Ultimate Premium Security Suite with bundled extras and other bits and pieces thrown in to catch your attention. Take a l… [+12518 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Phil Hall", "title": "Can the Google Pixel 3 XL outperform a compact camera... or even a DSLR?", "description": "We look at how Google's Pixel 3 and Pixel 3 XL smartphone cameras compare to dedicated rivals.", "url": "https://www.techradar.com/news/can-the-google-pixel-3-xl-outperform-a-compact-camera-or-even-a-dslr", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fD6uBsLRyoakmGWdMZuWQV-1200-80.jpg", "publishedAt": "2018-10-19T13:45:48Z", "content": "We reckon Google's new Pixel 3 and Pixel 3 XL have the best cameras going on a smartphone right now – and that's some serious bragging rights in phones world. But don't take our word for it – the phones are already attracting a good deal of hyperbolic comment… [+9983 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Will Dalton", "title": "Los Angeles Chargers vs Tennessee Titans live stream: how to watch today's NFL from anywhere", "description": "Don't miss Los Angeles Chargers vs Tennessee Titans in front of a packed Wembley crowd. Here's how to live stream from anywhere on Earth.", "url": "https://www.techradar.com/news/los-angeles-chargers-vs-tennessee-titans-live-stream-how-to-watch-todays-nfl-from-anywhere", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yS2tnox9XY8fGB7yoVJDY3-1200-80.jpg", "publishedAt": "2018-10-21T10:54:53Z", "content": "The NFL action at Wembley has once again been capturing the imagination of the British public, while millions tune in back in the States to watch their heroes strut their stuff across the pond. Next up in London is Los Angeles Chargers vs Tennessee Titans – d… [+5783 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Will Dalton", "title": "Inter Milan vs AC Milan live stream: how to watch today's Milan derby in Serie A online", "description": "Don't miss out on a live stream of fierce city rivals Inter and AC Milan doing battle in the San Siro. Tune in wherever you are in the world.", "url": "https://www.techradar.com/news/inter-milan-vs-ac-milan-live-stream-how-to-watch-todays-milan-derby-in-serie-a-online", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9vuyvU4n53kBE4AK7v88sn-1200-80.jpg", "publishedAt": "2018-10-21T18:34:38Z", "content": "Live stream the Milan derby - where and when Today is the day for Inter vs AC Milan, taking place in the sides' mutual home – the famous San Siro stadium. Kick-off is 8.30pm locally, which is 7.30pm BST, 2.30pm ET, 11.30am PT and 4.30am Monday AET. Club footb… [+4965 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Rogerson", "title": "ToryTrack Gigi is Tory Burch’s first touchscreen smartwatch and it’s out now", "description": "The ToryTrack Gigi has NFC, GPS, a heart rate monitor and a classic Tory Burch design.", "url": "https://www.techradar.com/news/torytrack-gigi-is-tory-burchs-first-touchscreen-smartwatch-and-its-out-now", "urlToImage": "https://cdn.mos.cms.futurecdn.net/g9G6gVWzkZjrF85o4AS8ib-1200-80.jpg", "publishedAt": "2018-10-25T12:00:00Z", "content": "Ever more fashion brands are now making smartwatches and the latest addition is Tory Burch, which has just announced its first touchscreen smartwatch, the ToryTrack Gigi. Specs-wise it’s in line with many other recent smartwatches, such as the Fossil Q Ventur… [+1311 chars]"}]}