{"status": "ok", "totalResults": 4215, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "John Bowden", "title": "GOP Senator: Most people have said things like 'horseface'", "description": "Louisiana Sen. John Kennedy (R) rebuked President Trump on Wednesday over his use of the insulting term \"horseface\" to describe Stormy Daniels,but went on to suggest that such insults were commonplace among American voters.", "url": "https://thehill.com/homenews/senate/411825-gop-senator-most-people-have-said-things-like-horseface", "urlToImage": "https://thehill.com/sites/default/files/kennedyjohn_100218sr_lead.jpg", "publishedAt": "2018-10-17T14:10:58Z", "content": "Louisiana Sen. John Kennedy John Neely Kennedy MORE (R) rebuked President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip to Middle East MORE on We… [+2792 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Michael Burke", "title": "$100M in Saudi money lands in US accounts as Pompeo landed in Riyadh: report", "description": "On the same day that Secretary of State Mike Pompeo landed in Saudi Arabia to discuss the disappearance of Saudi journalist Jamal Khashoggi, a previously promised $100 million landed in American bank accounts from Saudi Arabia, according to a", "url": "https://thehill.com/policy/international/411802-100m-in-saudi-money-lands-in-us-accounts-as-pompeo-landed-in-riyadh", "urlToImage": "https://thehill.com/sites/default/files/saudi_binsalmanmohammed_041917getty.jpg", "publishedAt": "2018-10-17T13:52:08Z", "content": "On the same day that Secretary of State Mike Pompeo Michael (Mike) Richard Pompeo IMF's Christine Lagarde delays trip to Middle East Saudi mystery drives wedge between Trump, GOP Overnight Defense: Trump worries Saudi Arabia treated as 'guilty until proven in… [+2154 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tal Axelrod", "title": "US sanctions hurt Russian company's microchip advances: report", "description": "U.S. sanctions targeting Russian tech businesses have delayed a Russian microchip company's efforts to replace Western products with Russian-made goods,...", "url": "https://thehill.com/policy/international/russia/411819-us-sanctions-put-hold-on-russia-tech-project-report", "urlToImage": "https://thehill.com/sites/default/files/russia_sanctions_080318getty.jpg", "publishedAt": "2018-10-17T14:03:09Z", "content": "U.S. sanctions targeting Russian tech businesses have delayed a Russian microchip companys efforts to replace Western products with Russian-made goods, according to Reuters. The sanctions, which stem from Russias internationally unrecognized annexation of Cri… [+1467 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Owen Daugherty", "title": "At least 17 killed in explosion, shooting at Crimea college: reports", "description": "A Russian student reportedly killed at least 17 students and staff at a college in Crimea,...", "url": "https://thehill.com/blogs/blog-briefing-room/news/411843-at-least-17-killed-in-explosion-shooting-at-crimea-college", "urlToImage": "https://thehill.com/sites/default/files/crimeashooting_10172018_kerchfm_0.jpg", "publishedAt": "2018-10-17T15:32:55Z", "content": "A Russian student reportedly killed at least 17 students and staff at a college in Crimea, according to the Associated Press. A Russian official said the student went on a rampage at the school Wednesday before killing himself. Russias Investigative Committee… [+730 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Avery Anapol", "title": "Campaign manager for brothel owner who died: He’ll still win Nevada election", "description": "The campaign manager for the late brothel owner Denis Hof predicts that he will still win election to the Nevada state legislature.Chuck Muth, Hof's campaign manager, said that he thinks Hof w...", "url": "https://thehill.com/homenews/campaign/411992-campaign-manager-for-brothel-owner-who-died-hell-still-win-nevada-election", "urlToImage": "https://thehill.com/sites/default/files/hofdennis.jpg", "publishedAt": "2018-10-18T12:28:39Z", "content": "The campaign manager for the late Nevada brothel owner Denis Hof's Republican bid for state office predicts that he will posthumously win election to the state legislature. Chuck Muth noted Republican's almost 2-to-1 registration advantage over Democrats in t… [+1052 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Harper Neidig", "title": "Facebook believes hack was carried out by spammers: report", "description": "Facebook believes that the hack it discovered last month that affected nearly 30 million users was not conducted by a foreign state but rather spammers hoping to profit off deceptive advertising, according to...", "url": "https://thehill.com/policy/technology/412019-facebook-believes-hack-was-carried-out-by-spammers-report", "urlToImage": "https://thehill.com/sites/default/files/privacy_facebook_042018getty.jpg", "publishedAt": "2018-10-18T14:20:48Z", "content": "Facebook believes that the hack it discovered last month that affected nearly 30 million users was not conducted by a foreign state but rather spammers hoping to profit off deceptive advertising, according to The Wall Street Journal. The Journal, citing unnam… [+933 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Nathaniel Weixel", "title": "McConnell defends Trump-backed lawsuit against ObamaCare", "description": "Senate Majority Leader Mitch McConnell (R-Ky.) defended the Trump administration's decision to join a lawsuit that seeks to overturn ObamaCare and its protections for people with pre-existing conditions....", "url": "https://thehill.com/policy/healthcare/412026-mcconnell-defends-trump-backed-lawsuit-against-obamacare", "urlToImage": "https://thehill.com/sites/default/files/mcconnellmitch_100618getty_0.jpg", "publishedAt": "2018-10-18T14:57:26Z", "content": "Senate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnell GOP leaders hesitant to challenge Trump on Saudi Arabia Overnight Health Care Presented by Purdue Pharma Trump officials ratchet up fight over drug pricing | McConnell says Republicans … [+3404 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Michael Burke", "title": "Trump to fundraise for GOP candidate in key NJ House race", "description": "President Trump will hold a fundraiser in next week for Republican House candidate Jay Webber, the New Jersey state assemblyman's campaign announced Thursday.The fundraiser will be held Oct. 25 in Washington, D.C.,...", "url": "https://thehill.com/homenews/campaign/412029-trump-to-fundraise-for-gop-candidate-in-key-nj-house-race", "urlToImage": "https://thehill.com/sites/default/files/trumpdonald_101718sr4_lead.jpg", "publishedAt": "2018-10-18T15:11:57Z", "content": "President Trump Donald John Trump Trump renews attacks against Tester over VA nominee on eve of Montana rally Trump submits 2017 federal income tax returns Corker: Trump administration 'clamped down' on Saudi intel, canceled briefing MORE will hold a fundrais… [+1940 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joe Concha", "title": "NY Times election night needle returns for the midterms", "description": "The New York Times election needle, which has been the subject of criticism, is set to return for the November midterms,...", "url": "https://thehill.com/homenews/media/412030-ny-times-election-night-needle-returns-for-the-midterms", "urlToImage": "https://thehill.com/sites/default/files/blogs/new_york_times.jpg", "publishedAt": "2018-10-18T15:05:13Z", "content": "The New York Times election needle, which has been the subject of criticism, is set to return for the November midterms, according to the Columbia Journalism Review (CJR). The online predictive forecast model was particularly the subject of scorn on the night… [+2077 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Michael Burke", "title": "Feinstein’s Dem challenger: 'It’s time that we stop biding our time and biting our tongue'", "description": "Sen. Dianne Feinstein's (D-Calif.) progressive challenger, California state Sen. Kevin de León (D), on Wednesday called on Democrats to \"stop bid...", "url": "https://thehill.com/homenews/senate/411987-feinsteins-dem-challenger-its-time-that-we-stop-biding-our-time-and-biting", "urlToImage": "https://thehill.com/sites/default/files/feinsteindianne_082118gn_lead.jpg", "publishedAt": "2018-10-18T11:52:41Z", "content": "Sen. Dianne Feinstein 's (D-Calif.) progressive challenger, California state Sen. Kevin de León (D), on Wednesday called on Democrats to \"stop biding our time and biting our tongue,\" saying the party needs to stand up to President Trump Donald John Trump Trum… [+1627 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Michael Burke", "title": "Ex-USA Gymnastics head arrested in connection with Nassar case", "description": "Former USA Gymnastics President and CEO Steve Penny was arrested after being indicted by a Texas grand jury on charges that he tampered with evidence in the investigation of former USA Olympics doctor Larry Nassar, according to media reports.", "url": "https://thehill.com/blogs/blog-briefing-room/news/412012-ex-usa-gymnastics-head-arrested-in-connection-with-nassar-case", "urlToImage": "https://thehill.com/sites/default/files/pennysteve_012611getty.jpg", "publishedAt": "2018-10-18T13:59:31Z", "content": "Former USA Gymnastics President and CEO Steve Penny was arrested after being indicted by a Texas grand jury on charges that he tampered with evidence in the investigation of former USA Olympics doctor Larry Nassar, according to media reports. Penny faces 2 to… [+1240 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Timothy Cama", "title": "Overnight Energy: U.S. greenhouse gas emissions fall in 2017 | EPA science rule won’t be final until 2020 | Trump criticizes California for wildfires", "description": "GREENHOUSE GASES DROP IN 2017: United States greenhouses gas emissions decreased during President Trump's first year in office, according to new a Environmental Protection Agency (EPA) report releas...", "url": "https://thehill.com/policy/energy-environment/overnights/411940-overnight-energy-us-greenhouse-gas-emissions-fall-in", "urlToImage": "https://thehill.com/sites/default/files/blogs/coal_power_plant_line_659168788.jpg", "publishedAt": "2018-10-17T21:22:40Z", "content": "GREENHOUSE GASES DROP IN 2017: United States greenhouses gas emissions decreased during President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip t… [+7452 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Jessie Hellmann", "title": "McConnell: GOP could try to repeal ObamaCare again after midterms", "description": "Senate Majority Leader Mitch McConnell (R-Ky.) said Wednesday that Republicans may take another crack at repealing ObamaCare if they maintain", "url": "https://thehill.com/homenews/senate/411896-mcconnell-gop-could-try-to-repeal-obamacare-again-after-midterms", "urlToImage": "https://thehill.com/sites/default/files/mcconnellmitch_100618getty_0.jpg", "publishedAt": "2018-10-17T19:16:47Z", "content": "Senate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnell Graham: I hope Dems 'get their ass kicked' for conduct around Kavanaugh Saudi mystery drives wedge between Trump, GOP Overnight Defense: Trump worries Saudi Arabia treated as 'guilty un… [+2713 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Nick Calio, Opinion Contributor", "title": "Bipartisanship can – and does – exist in Washington", "description": "As Capitol Hill celebrates a bipartisan achievement of passing the FAA Reauthorization bill this month, it's only fitting that we also celebrate the 40th anniversary of the bipartisan Airline Deregulation Act.", "url": "https://thehill.com/blogs/congress-blog/politics/411882-bipartisanship-can-and-does-exist-in-washington", "urlToImage": "https://thehill.com/sites/default/files/ohareairport_030718.jpg", "publishedAt": "2018-10-17T18:45:08Z", "content": "If you read the headlines or click on whats trending these days, it would be easy to believe that there isnt any glimmer of bipartisan spirit alive in the nations capital. But while many cameras were turned off and many reporters were writing on other news st… [+3410 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Emily Birnbaum", "title": "Trump Jr. to campaign in West Virginia", "description": "President Trump's eldest son, Donald Trump Jr., is set to campaign in West Virginia on Monday on behalf of Senate candidate Patrick Morrisey (R), who is...", "url": "https://thehill.com/homenews/administration/411903-trump-jr-to-campaign-in-west-virginia", "urlToImage": "https://thehill.com/sites/default/files/trumpjrdonald_040218gn2_lead.jpg", "publishedAt": "2018-10-17T19:43:46Z", "content": "President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip to Middle East MORE 's eldest son, Donald Trump Jr. Donald (Don) John Trump Dems fear par… [+2003 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joe Concha", "title": "'The Conners' premieres without Roseanne, draws 10.5M viewers", "description": "Premiering without its formerly titular character Roseanne Barr, ABC's \"The Conners\" drew 10.5 million viewers on Tuesday night, topping all programs on network television including NBC juggernaut, \"This Is Us,\" according to early Nielsen rat", "url": "https://thehill.com/blogs/in-the-know/411884-the-conners-premieres-without-roseanne-draws-105m-viewers", "urlToImage": "https://thehill.com/sites/default/files/barrroseanne_goodmanjohn_getty.jpg", "publishedAt": "2018-10-17T18:48:33Z", "content": "Premiering without its formerly titular character Roseanne Barr, ABC's \"The Conners\" drew 10.5 million viewers on Tuesday night, topping all programs on network television including NBC juggernaut, \"This Is Us,\" according to early Nielsen ratings released Wed… [+1165 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Timothy Cama", "title": "Trump: California ‘better get their act together’ on wildfires", "description": "President Trump on Wednesday seemed to threaten to withhold funding to fight wildfires in California if the state doesn't remove more \"old trees\" from forests.\"California's a mess. We're giving billions and billion...", "url": "https://thehill.com/policy/energy-environment/411883-trump-california-better-get-their-act-together-on-wildfires", "urlToImage": "https://thehill.com/sites/default/files/trumpdonald_101718upi2_lead.jpg", "publishedAt": "2018-10-17T18:43:46Z", "content": "President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip to Middle East MORE on Wednesday seemed to threaten to withhold funding to fight wildfire… [+2508 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Miranda Green", "title": "EPA in talks with Volvo over faulty emissions part in trucks", "description": "The Environmental Protection Agency (EPA) is working with Volvo to address a faulty part that could lead to increased, illegal emissions in its commercial trucks.EPA along with the California Air Resources Board (C...", "url": "https://thehill.com/policy/energy-environment/411912-epa-in-talks-with-volvo-over-faulty-emissions-piece", "urlToImage": "https://thehill.com/sites/default/files/car_emissions_tailpipe.jpg", "publishedAt": "2018-10-17T20:09:21Z", "content": "The Environmental Protection Agency (EPA) is working with Volvo to address a faulty part that could lead to increased, illegal emissions in its commercial trucks. EPA along with the California Air Resources Board (CARB) has been meeting with the manufacturer … [+1982 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Owen Daugherty", "title": "Texas students required to watch video on interacting with police in order to graduate high school", "description": "Starting this school year, Texas high school students are required by state law to watch a video instructing them how to interact with law enforcement during a traffic stop before they are allowed to graduate....", "url": "https://thehill.com/homenews/state-watch/411917-texas-law-requires-students-watch-video-on-interacting-with-police-in", "urlToImage": "https://thehill.com/sites/default/files/texaspolicevideo_101718.jpg", "publishedAt": "2018-10-17T20:37:14Z", "content": "Starting this school year, Texas high school students are required by state law to watch a video instructing them how to interact with law enforcement during a traffic stop before they are allowed to graduate. The law, which came following the fatal police sh… [+1324 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Jordain Carney", "title": "Senate Dems ask Trump to disclose financial ties to Saudi Arabia", "description": "Senate Democrats are asking President Trump and the Trump Organization to disclose any ties to Saudi Arabia, as well as freeze any potential business relationships in the wake of the disappearance of a U.S.-based journali...", "url": "https://thehill.com/blogs/floor-action/senate/411929-senate-dems-ask-trump-to-disclose-financial-ties-to-saudi-arabia", "urlToImage": "https://thehill.com/sites/default/files/udalltom_051618gn2_lead.jpg", "publishedAt": "2018-10-17T20:45:08Z", "content": "The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 fax The contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}]}