{"status": "ok", "totalResults": 243, "articles": [{"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "MAURICIO SAVARESE", "title": "Brazil front-runner accused of illegal campaign practices - Washington Times", "description": "Washington Times Brazil front-runner accused of illegal campaign practices Washington Times SAO PAULO (AP) - A Brazilian presidential candidate on Thursday accused his far-right adversary of illegal campaign practices for allegedly allowing friendly businessm…", "url": "https://www.washingtontimes.com/news/2018/oct/18/brazil-front-runner-accused-of-illegal-campaign-pr/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/18/brazil_elections_haddad_76567_s2048x1403.jpg?124ac20dcefb510cd672f7b2110f174f0221faeb", "publishedAt": "2018-10-18T21:42:56Z", "content": "SAO PAULO (AP) - A Brazilian presidential candidate on Thursday accused his far-right adversary of illegal campaign practices for allegedly allowing friendly businessmen to secretly pay to spread slanderous messages. The accusations by left-leaning Fernando H… [+3246 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Associated Press", "title": "Mothers of big families challenge Macron's fertility stance - Washington Times", "description": "Washington Times Mothers of big families challenge Macron's fertility stance Washington Times PARIS (AP) - French President Emmanuel Macron is facing criticism from mothers with big families both at home and abroad for comments he made about women and fertili…", "url": "https://www.washingtontimes.com/news/2018/oct/18/angry-mothers-take-on-macron-over-fertility-commen/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/18/belgium_eu_brexit_98101_s2048x1354.jpg?12bb062275436cdcece75bd80952867dd0071bc8", "publishedAt": "2018-10-18T17:48:45Z", "content": "PARIS (AP) - French President Emmanuel Macron is facing criticism from mothers with big families both at home and abroad for comments he made about women and fertility in Africa. Hundreds of French and American women took offense at a September speech that Ma… [+1692 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Cheryl K. Chumley", "title": "Hillary Clinton's dwindling power - Washington Times", "description": "Washington Times Hillary Clinton's dwindling power Washington Times ANALYSIS/OPINION: Hillary Clinton, never one for the conservatives, has now managed to isolate — nay, tick off — even the hardest core of her supporters. What's come from her fans in the medi…", "url": "https://www.washingtontimes.com/news/2018/oct/18/hillary-clintons-dwindling-power/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/11/10112018_clinton-78201_s2048x1347.jpg?4b731c85e45326111c2ca165bb4218132924a3d8", "publishedAt": "2018-10-18T14:25:51Z", "content": "ANALYSIS/OPINION: Hillary Clinton, never one for the conservatives, has now managed to isolate — nay, tick off — even the hardest core of her supporters. What’s come from her fans in the media in the last few hours could very well signal the end of Clinton ’s… [+4315 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Tom Howell Jr.", "title": "HHS IG: Hospitals better prepared for Ebola after 2014 outbreak - Washington Times", "description": "Washington Times HHS IG: Hospitals better prepared for Ebola after 2014 outbreak Washington Times Far more U.S. hospitals are prepared to deal with Ebola than they were in 2014, when a raging outbreak in West Africa stress-tested the American health system an…", "url": "https://www.washingtontimes.com/news/2018/oct/19/hhs-ig-hospitals-better-prepared-ebola-after-2014-/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2014/11/07/7189e904cf7cc32b640f6a7067009670_s2048x1430.jpg?e8a6c332f3da7afd414eb9ebee73cc6b126ecbf6", "publishedAt": "2018-10-19T17:25:20Z", "content": "Far more U.S. hospitals are prepared to deal with Ebola than they were in 2014, when a raging outbreak in West Africa stress-tested the American health system and forced the federal government to rewrite its guidelines for dealing with infectious diseases, a … [+4315 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Andrew Blake", "title": "WikiLeaks touts legal action against Ecuador over Assange's stay inside embassy - Washington Times", "description": "Washington Times WikiLeaks touts legal action against Ecuador over Assange's stay inside embassy Washington Times WikiLeaks founder Julian Assange has initiated legal action against the government of Ecuador over terms and conditions related to his ongoing re…", "url": "https://www.washingtontimes.com/news/2018/oct/19/wikileaks-touts-legal-action-against-ecuador-over-/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/06/04/Ecuador_Assange_51139.jpg-d4292_s2048x1475.jpg?e4deb6753c8981fefd8fdbc6b407f65a2c2bbbd5", "publishedAt": "2018-10-19T19:14:53Z", "content": "WikiLeaks founder Julian Assange has initiated legal action against the government of Ecuador over terms and conditions related to his ongoing residency inside the nation’s London embassy, representatives for the anti-secrecy group said Friday. Baltasar Garzo… [+2706 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Jeff Mordock", "title": "Justice Department announces new measures to fight opioids - Washington Times", "description": "Washington Times Justice Department announces new measures to fight opioids Washington Times The Justice Department will create a task force to target prescription opioid abuse n the Appalachian region, as part of a series of measures to fight a drug epidemic…", "url": "https://www.washingtontimes.com/news/2018/oct/25/justice-department-to-allocate-70m-to-fight-opioid/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/16/mexican_drug_cartel_11883_s2048x1365.jpg?157fd7a2b2da4a762ebf407a263d15da8e5779ba", "publishedAt": "2018-10-25T14:37:30Z", "content": "The Justice Department will create a task force to target prescription opioid abuse in the Appalachian region, as part of a series of measures to fight a drug epidemic that has claimed the lives of 72,000 Americans, Attorney General Jeff Sessions said Thursda… [+4459 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Associated Press", "title": "Britain backs...", "description": "Britain's defense secretary says his country stands \"absolutely resolute\" with the United States as President Donald Trump says he'll pull out from a landmark arms control agreement with Russia. Gavin Williamson blames Russia for endangering the treaty. He's …", "url": "https://www.washingtontimes.com/news/2018/oct/21/gavin-williamson-says-britain-backs-donald-trump-u/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/04/belgium_nato_russia_cyberattacks_95571_s2048x1365.jpg?157fd7a2b2da4a762ebf407a263d15da8e5779ba", "publishedAt": "2018-10-21T12:46:37Z", "content": "Britain’s defense secretary says his country stands “absolutely resolute” with the United States as President Donald Trump says he’ll pull out from a landmark arms control agreement with Russia. Gavin Williamson blames Russia for endangering the treaty. He’s … [+707 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Associated Press", "title": "Charles Wang, former New York Islanders owner, dies at 74 - Washington Times", "description": "Charles Wang, former New York Islanders owner, dies at 74 Washington Times OYSTER BAY, N.Y. (AP) - Charles Wang, the technology company founder who formerly owned the New York Islanders hockey team, has died. He was 74. His attorney John McEntee said in an em…", "url": "https://www.washingtontimes.com/news/2018/oct/21/charles-wang-former-new-york-islanders-owner-dies-/", "urlToImage": null, "publishedAt": "2018-10-21T14:27:12Z", "content": "OYSTER BAY, N.Y. (AP) - A technology company founder who formerly owned the New York Islanders hockey team has died. Charles Wang was 74. His attorney John McEntee says in an emailed statement that Wang died Sunday in Oyster Bay, New York. A cause of death wa… [+651 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Associated Press", "title": "Settlement reached for Hawaii hepatitis A class-action suit - Washington Times", "description": "Honolulu Star-Advertiser Settlement reached for Hawaii hepatitis A class-action suit Washington Times HONOLULU (AP) - A preliminary settlement of up to $4.5 million has been reached in a class-action lawsuit for people exposed to hepatitis A but not sickened …", "url": "https://www.washingtontimes.com/news/2018/oct/19/settlement-reached-for-hawaii-hepatitis-a-class-ac/", "urlToImage": null, "publishedAt": "2018-10-19T22:57:58Z", "content": "HONOLULU (AP) - A preliminary settlement of up to $4.5 million has been reached in a class-action lawsuit for people exposed to hepatitis A but not sickened during a Hawaii outbreak in 2016. Seattle attorney Bill Marler announced the settlement Friday. A clai… [+728 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "The Washingtion Times", "title": "No. 25 Washington St hosts No. 12 Oregon in key Pac-12 game", "description": "Oregon running back CJ Verdell (34), scores the winning touchdown in overtime to beat Washington 30-27 in an NCAA college football game in Eugene, Ore., Saturday, Oct. 13, 2018. No. 25 Washington State hosting No. 12 Oregon has more significance than many may…", "url": "https://www.washingtontimes.com/news/2018/oct/19/no-25-washington-st-hosts-no-12-oregon-in-key-pac-/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/15/washington_oregon_football_05488_s2048x1414.jpg?5152483ce6d5202c662fd5be944c9beedc47ba53", "publishedAt": "2018-10-19T20:50:17Z", "content": "No. 25 Washington State hosting No. 12 Oregon has more significance than many may have expected early in the season. The game will be key in determining which program stays alive in the hunt for the Pac-12 North title, which appeared to be a race between Wash… [+3997 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "The Washingtion Times", "title": "No. 9 Oklahoma rebounds from only loss with 52-27 win at TCU", "description": "Kyler Murray and the Oklahoma offense piled up yards and scored points like they have been all season. Kenneth Murray and the Sooners defense did their part as well as ninth-ranked Oklahoma bounced back from its only loss, winning 52-27 at TCU on Saturday in …", "url": "https://www.washingtontimes.com/news/2018/oct/20/no-9-oklahoma-rebounds-from-only-loss-with-52-27-w/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/20/oklahoma_tcu_football_83816_s2048x1486.jpg?3e5497bf822177d609c6131cc72c2019715d854a", "publishedAt": "2018-10-20T19:45:00Z", "content": "FORT WORTH, Texas (AP) - Kyler Murray and the Oklahoma offense piled up yards and scored points like they have been all season. Kenneth Murray and the Sooners defense did their part as well as ninth-ranked Oklahoma bounced back from its only loss, winning 52-… [+4597 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Andrew Blake", "title": "Alaska governor suspends his reelection campaign, endorses Democratic challenger - Washington Times", "description": "Washington Times Alaska governor suspends his reelection campaign, endorses Democratic challenger Washington Times Bill Walker, the governor of Alaska, abruptly suspended his re-election campaign Friday and endorsed his Democratic challenger, Mark Begich, in …", "url": "https://www.washingtontimes.com/news/2018/oct/20/bill-walker-alaska-governor-suspends-re-election-c/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/20/election_2018_governor_alaska_01965_s2048x1505.jpg?55e53793b0fb828ae7bde229eeb33df540675935", "publishedAt": "2018-10-20T14:59:34Z", "content": "Bill Walker, the governor of Alaska, abruptly suspended his re-election campaign Friday and endorsed his Democratic challenger, Mark Begich, in lieu of both candidates competing in next month’s midterm race against Republican hopeful Mike Dunleavy. Mr. Walker… [+2260 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Associated Press", "title": "Israeli farmers concerned about Jordan ending land lease - Washington Times", "description": "Washington Times Israeli farmers concerned about Jordan ending land lease Washington Times TSOFAR, Israel (AP) - Israeli farmers are voicing concern over Jordan's intention not to renew parts of its landmark peace treaty with Israel that leased out two small …", "url": "https://www.washingtontimes.com/news/2018/oct/22/israeli-farmers-concerned-about-jordan-ending-land/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/22/israel_jordan_97082_s2048x1365.jpg?157fd7a2b2da4a762ebf407a263d15da8e5779ba", "publishedAt": "2018-10-22T14:32:53Z", "content": "TSOFAR, Israel (AP) - Israeli farmers are voicing concern over Jordan ’s intention not to renew parts of its landmark peace treaty with Israel that leased out two small border areas for agricultural work. Eran Baron says Monday that farmers like him have inve… [+695 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Dave Boyer", "title": "Trump: 'We must never allow political violence to take root in America' - Washington Times", "description": "Washington Times Trump: 'We must never allow political violence to take root in America' Washington Times The TV images could hardly be worse for the White House. The white van impounded by police as they arrested mail bomb suspect Cesar Sayoc Jr. was shown r…", "url": "https://www.washingtontimes.com/news/2018/oct/26/donald-trump-we-must-never-allow-political-violenc/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/25/Trump_30812.jpg-4db87_s2048x1364.jpg?f9c67f4708cc0e99c4b4cc589081ff5d217c5718", "publishedAt": "2018-10-27T01:52:30Z", "content": "The TV images could hardly be worse for the White House. The white van impounded by police as they arrested mail bomb suspect Cesar Sayoc Jr. was shown repeatedly on cable networks Friday, its windows covered with political stickers championing President Trum… [+4150 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Tom Howell Jr.", "title": "DCCC chair 'confident' Dems will take House, says candidates 'connecting with the American people' - Washington Times", "description": "Washington Times DCCC chair 'confident' Dems will take House, says candidates 'connecting with the American people' Washington Times Rep. Ben Ray Luján on Sunday said he's “confident” that Democrats will win back the House majority on Election Day, citing vot…", "url": "https://www.washingtontimes.com/news/2018/oct/28/ben-ray-lujan-dccc-chair-confident-democrats-will-/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/09/23/AP_16246575560158_s2048x1534.jpg?e02307a44d6b8388540e6a40cdb14eb5791b4b9f", "publishedAt": "2018-10-28T18:21:08Z", "content": "Rep. Ben Ray Luj án on Sunday said he’s “confident” that Democrats will win back the House majority on Election Day, citing voter energy and the caliber of his side’s candidates. His Republican counterpart said he’s dreaming, pointing to a roaring economy in … [+3330 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Tom Howell Jr.", "title": "'Do not come': Homeland Security chief says migrant caravan is 'not getting in' - Washington Times", "description": "Washington Times 'Do not come': Homeland Security chief says migrant caravan is 'not getting in' Washington Times Homeland Security Secretary Kirstjen Nielsen on Sunday said the migrant caravan marching through Mexico to the U.S. is “not getting in.” “There a…", "url": "https://www.washingtontimes.com/news/2018/oct/28/kirstjen-nielsen-says-migrant-caravan-not-getting/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/26/immigration_border_93016_s2048x1365.jpg?157fd7a2b2da4a762ebf407a263d15da8e5779ba", "publishedAt": "2018-10-28T16:09:56Z", "content": "Homeland Security Secretary Kirstjen Nielsen on Sunday said the migrant caravan marching through Mexico to the U.S. is “not getting in.” “There a legal way to get into this country. Those who choose to enter illegally will be stopped,” Ms. Nielsen told Fox Ne… [+1494 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Associated Press", "title": "Arkansas says 1st flu death of season confirmed - Washington Times", "description": "KTAL Arkansas says 1st flu death of season confirmed Washington Times LITTLE ROCK, Ark. (AP) - Arkansas health officials say the state has recorded its first flu death of the season. The Arkansas Department of Health says the person was between the ages of 45…", "url": "https://www.washingtontimes.com/news/2018/oct/18/arkansas-says-1st-flu-death-of-season-confirmed/", "urlToImage": null, "publishedAt": "2018-10-18T12:43:01Z", "content": "LITTLE ROCK, Ark. (AP) - Arkansas health officials say the state has recorded its first flu death of the season. The Arkansas Department of Health says the person was between the ages of 45 and 64 and had not been vaccinated. The state did not release where t… [+637 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Fred J. Eckert", "title": "BOOK REVIEW: ‘The Fox’ by Frederick Forsyth", "description": "ANALYSIS/OPINION: THE FOX. By Frederick Forsyth. G.P. Putnam’s Sons, $28, 304 pages. A momentous deadly war is underway against the West intense, constant, ever-escalating, a war that makes our rapidly-changing era perhaps the most dangerous ever. This is the…", "url": "https://www.washingtontimes.com/news/2018/oct/17/book-review-the-fox-by-frederick-forsyth/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/17/10172018_41r-xflf-1l8201_s2048x1194.jpg?b496e55510bf7d1f142aba7123a36fc0cd023aa5", "publishedAt": "2018-10-18T13:22:00Z", "content": "ANALYSIS/OPINION: THE FOX By Frederick Forsyth G.P. Putnam’s Sons, $28, 304 pages A momentous deadly war is underway against the West — intense, constant, ever-escalating, a war that makes our rapidly-changing era perhaps the most dangerous ever. This is the … [+5371 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "The Washingtion Times", "title": "Terrapins excelling under interim coach Matt Canada despite turmoil", "description": "Despite the turmoil surrounding the program since Durkin was placed on leave amid charges he and the University of Maryland were negligent in the death of lineman Jordan McNair, players have rallied around both the memory of their late teammate and the steady…", "url": "https://www.washingtontimes.com/news/2018/oct/17/terrapins-excelling-under-interim-coach-despite-tu/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/10/17/10172018_big-ten-this-week-football-8201_s2048x1385.jpg?6ca2385d86dc88df71a99d8e612162e9f55406fb", "publishedAt": "2018-10-18T01:39:11Z", "content": "COLLEGE PARK | Considering coach D.J. Durkin’s fate has hung over the team all season, they are one of the most-penalized teams in the nation, and four of their next six games are against ranked opponents, the Maryland Terrapins are looking pretty good right … [+3471 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Cheryl K. Chumley", "title": "Polio-like paralyzing disease hits hundreds -- but don't call it polio - Washington Times", "description": "Washington Times Polio-like paralyzing disease hits hundreds -- but don't call it polio Washington Times ANALYSIS/OPINION: The United States was declared “polio-free” in 1979, a feat the Centers for Disease Control and Prevention says is “thanks to [an] effec…", "url": "https://www.washingtontimes.com/news/2018/oct/19/polio-paralysis-hits-386-dont-call-it-polio/", "urlToImage": "https://twt-thumbs.washtimes.com/media/image/2018/06/26/brain_tumors_polio_treatment_89595_s2048x1356.jpg?cf0e5d8af236a0e39998547046f4fe15d7a7f177", "publishedAt": "2018-10-19T09:54:56Z", "content": "ANALYSIS/OPINION: The United States was declared “polio-free” in 1979, a feat the Centers for Disease Control and Prevention says is “thanks to [an] effective vaccine.” But now it’s back — or is it? Get ready for the doublespeak. The government says no, the c… [+5063 chars]"}]}