{"status": "ok", "totalResults": 4680, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "SAM SIFTON", "title": "What to Cook: You Don’t Need a Recipe!", "description": "Freestyle and pair some pasta from the larder with sausage and sage, or stick to a recipe like Tejal Rao’s for aligot or Melissa Clark’s for pie crust.", "url": "https://www.nytimes.com/2018/10/17/dining/you-dont-need-a-recipe.html", "urlToImage": "https://static01.nyt.com/images/2016/11/20/magazine/20eat-copy/20eat-facebookJumbo.jpg", "publishedAt": "2018-10-17T14:30:00Z", "content": "Good morning. I had some pasta shells in the larder, a bunch of spicy Italian sausage in the fridge, some butter and a fistful of sage. I got water going on the stovetop for the pasta, and that was dinner right there, no-recipe-recipe-style: the sausages sear… [+1317 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "STEPH YIN", "title": "Trilobites: Why Southeast Asia and Australia’s Coral Reefs Became So Rich in Species", "description": "Fairy basslets, wrasses and anthias in Beqa Lagoon in Fiji.", "url": "https://www.nytimes.com/2018/10/17/science/coral-reef-biodiversity.html", "urlToImage": "https://static01.nyt.com/images/2018/10/18/science/18TB-REEF/18TB-REEF-facebookJumbo.jpg", "publishedAt": "2018-10-17T19:52:41Z", "content": "Using databases that aggregate research done by hundreds of scientists, Ms. Millers team categorized more than 12,000 fish species as present or absent in eight marine regions around the world. The researchers then traced living species back in time, using an… [+1266 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "We Asked for Epic Love in 100 Words. 3,000 Responded.", "description": "For the first Modern Love in miniature, we’re sharing your stories about life-changing burritos, unconventional arrangements, and other romantic gains and losses.", "url": "https://www.nytimes.com/2018/10/17/style/tiny-love-modern-epic-love-in-100-words.html", "urlToImage": "https://static01.nyt.com/images/2018/10/17/fashion/17TINYLOVE-COMBO/17TINYLOVE-COMBO-facebookJumbo-v2.jpg", "publishedAt": "2018-10-17T20:28:08Z", "content": "After the breakup, we spent every Thanksgiving, birthday and Christmas together. Close enough to touch, legs inches apart. We were still dying of AIDS in the 90s, but I always thought no, not Michael. When he died I wondered who would love black gay me like t… [+1542 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "GARDINER HARRIS and EDWARD WONG", "title": "Pompeo’s Grin and Dismissal of Facts on Saudi Trip Tarnish His Image", "description": "Secretary of State Mike Pompeo has cultivated an image of talking tough. But his trip to Saudi Arabia to discuss the disappearance of Jamal Khashoggi offered a different picture.", "url": "https://www.nytimes.com/2018/10/17/world/middleeast/pompeo-khashoggi-murder.html", "urlToImage": "https://static01.nyt.com/images/2018/10/18/us/politics/18dc-diplo-sub/18dc-diplo-sub-facebookJumbo.jpg", "publishedAt": "2018-10-17T17:53:42Z", "content": "But we have more important interests at stake, Mr. Burns said. We cant afford to have a business-as-usual attitude. This is a time to be stern with M.B.S., to disavow his governments crime and to sanction Saudi Arabia. Our credibility as a democracy is at sta… [+1280 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "EVA GOLINGER", "title": "A Tale of Three Presidents", "description": "Nicolás Maduro and Donald Trump have an authoritarian bent, as did Hugo Chávez, but the Chávez I knew also believed in social justice, equality and fundamental freedoms.", "url": "https://www.nytimes.com/2018/10/17/opinion/contributors/a-tale-of-three-presidents.html", "urlToImage": "https://static01.nyt.com/images/2018/10/17/opinion/17golinger/17golinger-facebookJumbo.jpg", "publishedAt": "2018-10-17T19:00:04Z", "content": "But Mr. Chávez had enormous empathy for the poor and the marginalized. He made great strides during his presidency, helping millions of people. True, he made many mistakes. Mr. Chávez aspired to make his model sustainable, but died without achieving that goal… [+2048 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "ALONDRA NELSON", "title": "Elizabeth Warren and the Folly of Genetic Ancestry Tests", "description": "Senator Elizabeth Warren at a town hall forum in Woburn, Mass., in August.", "url": "https://www.nytimes.com/2018/10/17/opinion/elizabeth-warren-and-the-folly-of-genetic-ancestry-tests.html", "urlToImage": "https://static01.nyt.com/images/2018/10/17/opinion/17Nelson/17Nelson-facebookJumbo.jpg", "publishedAt": "2018-10-17T19:00:57Z", "content": "Senator Warrens genetic-ancestry results suggest she has a Native American ancestor, most likely more than six generations back. But a few segments of a persons genome that indicate she may have indigenous ancestry does not make her Native American. To be Nat… [+1659 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "ELAINE GLUSAC", "title": "36 Hours: 36 Hours in Chicago", "description": "The BP Pedestrian Bridge, designed by Frank Gehry, connects Maggie Daley Park to Millennium Park.", "url": "https://www.nytimes.com/2018/10/18/travel/what-to-do-in-chicago.html", "urlToImage": "https://static01.nyt.com/images/2018/10/28/travel/28Hours-Chicago1/28Hours-Chicago1-facebookJumbo-v2.jpg", "publishedAt": "2018-10-18T09:00:01Z", "content": "Eighteen miles of paved pathway edges Lake Michigan, the Great Lake that moderates much of Chicagos weather. Biking is the best way to appreciate the citys sparkling outdoor asset. Rent a hybrid, town cruiser or road bike from Bike and Roll Chicago at Millenn… [+1960 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By SUSAN GUBAR", "title": "Flat Out: Rejecting Breast Reconstruction", "description": "After a double mastectomy, Catherine Guthrie wanted to retain her strength and challenge the idea of feminine norms.", "url": "https://www.nytimes.com/2018/10/18/well/family/flat-out-rejecting-breast-reconstruction.html", "urlToImage": "https://static01.nyt.com/images/2018/10/18/well/18GUBAR-FLAT1/18GUBAR-FLAT1-facebookJumbo.jpg", "publishedAt": "2018-10-18T09:00:00Z", "content": "How does she feel now about her decision to go flat? I am as strong, mobile and flexible today as when I was diagnosed, she said. The ease of lying on her stomach in bed, on a yoga mat or at the beach is priceless. Noting similarities between the flat movemen… [+2065 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "DealBook Briefing: SoftBank’s Big Saudi Problem", "description": "The Japanese company became the most powerful tech investor with $45 billion from Saudi Arabia. Now that money is causing it some headaches.", "url": "https://www.nytimes.com/2018/10/18/business/dealbook/softbank-saudi-arabia.html", "urlToImage": "https://static01.nyt.com/images/2018/10/19/business/dealbookemail/19db-newsletter-masa/merlin_144800676_3a8ff35b-6521-4f15-90fa-0a3aa9fb25d2-facebookJumbo.jpg", "publishedAt": "2018-10-18T10:48:09Z", "content": "Good Thursday morning. Thasunda Duckett of JPMorgan Chase, Nancy Dubuc of Vice Media, Damien Hooper-Campbell of eBay and John Hope Bryant of Operation Hope will all be speaking at our Playing for the Long Term conference on Nov. 1 at Jazz at Lincoln Center in… [+1536 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "New York Times", "title": "How Saudi journalist Jamal Khashoggi’s death provoked a backlash that thousands of deaths in Yemen didn’t", "description": "Practically overnight, longtime U.S. supporters of the alliance are disavowing it. U.S. businesses are pulling back from the kingdom.", "url": "https://www.nytimes.com/2018/10/17/world/.../jamal-khashoggi-saudi-arabia.html", "urlToImage": "https://images.indianexpress.com/2018/10/us_saudi_backlash_2-1200.jpg?w=1024", "publishedAt": "2018-10-18T13:05:21Z", "content": "A factory destroyed in bombings by the Saudi-led coalition near Sanaa, Yemen. (The New York Times photo) By Max Fisher If you had to pick a year in the past decade when the contradictions of the American-Saudi relationship seemed likeliest to explode into cri… [+7808 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "SCOTT CACCIOLA and ADAM NAGOURNEY", "title": "California Today: California Today: What Will the Lakers Look Like With LeBron James?", "description": "LeBron James and Lance Stephenson of the Los Angeles Lakers celebrated after James made a shot and was fouled against the Golden State Warriors during their preseason game last week.", "url": "https://www.nytimes.com/2018/10/18/us/california-today-lebron-james-lakers.html", "urlToImage": "https://static01.nyt.com/images/2018/10/18/us/18CALIFORNIATODAY1/18CALIFORNIATODAY1-facebookJumbo.jpg", "publishedAt": "2018-10-18T12:54:09Z", "content": "The Lakers, as currently constructed, are an odd team, full of young players with promise (Lonzo Ball, Brandon Ingram), older players with curious pasts (Michael Beasley, Lance Stephenson) and one transcendent star. Which is why a lot of people will be tuning… [+1392 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By JEN GUNTER", "title": "Do You Need a Pap Smear to Get Birth Control?", "description": "Many gynecologists will require you to visit the office for a birth control refill, but you may be surprised (or maybe not) to find out why.", "url": "https://www.nytimes.com/2018/10/18/well/do-you-need-a-pap-smear-to-get-birth-control.html", "urlToImage": "https://static01.nyt.com/images/2018/10/16/smarter-living/obgynask_birthcontrolpills/obgynask_birthcontrolpills-facebookJumbo.jpg", "publishedAt": "2018-10-18T14:39:44Z", "content": "As cervical cancer screening is now recommended to be done every three years, hopefully the Pap smear-pill linkage will finally die. DR.S NOTE Even though you are not seeing your provider once a year for cervical cancer screening, make sure to update them on … [+362 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Helene Cooper", "title": "Jim Mattis, Meeting His Chinese Counterpart, Tries to Ease Tensions", "description": "The defense secretary moved to sand down sharp edges of the relationship after Vice President Mike Pence gave a pointed critique of Beijing.", "url": "https://www.nytimes.com/2018/10/18/world/asia/jim-mattis-china-singapore-wei-fenghe.html", "urlToImage": "https://static01.nyt.com/images/2018/10/19/world/19mattis-1/19mattis-1-facebookJumbo.jpg", "publishedAt": "2018-10-18T11:56:22Z", "content": "The biggest source of tension between the Pentagon and Beijing continues to be the South China Sea. China claims almost all the South China Sea, and strongly protests American military patrols there. The United States, for its part, considers the sea to be in… [+1569 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "STEVEN LEE MYERS", "title": "A New Culprit Is Identified in China’s Choking Smog", "description": "Researchers say that emissions of formaldehyde from autos and chemical and oil refineries play a larger role in China’s smog than previously known.", "url": "https://www.nytimes.com/2018/10/18/world/asia/china-pollution-formaldehyde-sulfur.html", "urlToImage": "https://static01.nyt.com/images/2018/10/19/world/19china-pollute-1sub/19china-pollute-1sub-facebookJumbo.jpg", "publishedAt": "2018-10-18T14:00:03Z", "content": "Our research points toward ways that can more quickly clean up air pollution, said Jonathan M. Moch, a Harvard researcher and lead author of the study. The easiest fixes include improving ignition switches on cars and trucks and fitting nozzles at gas station… [+1038 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "KENNETH P. VOGEL and RACHEL SHOREY", "title": "Democrats Surge Ahead of Republicans in Fund-Raising for Key Races", "description": "Democrats outraised their Republican opponents in 32 of the closest 45 House races, $154 million to $108 million, according to Federal Election Commission reports.", "url": "https://www.nytimes.com/2018/10/15/us/politics/democrats-republicans-midterm-fundraising.html", "urlToImage": "https://static01.nyt.com/images/2018/10/16/us/16donate1/16donate1-facebookJumbo.jpg", "publishedAt": "2018-10-16T03:56:28Z", "content": "But Republicans have had their bright spots in campaign fund-raising. In a tight House race in northwestern Pennsylvania, the Republican incumbent, Mike Kelly, has more than doubled the fund-raising of his Democratic challenger, Ron DiNicola, $2.3 million to … [+1661 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "CHRIS STANFORD", "title": "Saudi Arabia, Paul Allen, N.B.A.: Your Tuesday Briefing", "description": "Almead Stutts, right, the owner of Stutts House of Barbeque, in Tulsa, Okla., on a slow Sunday afternoon. Her story is one of many that Times reporters found when they set out to capture 24 hours in America.", "url": "https://www.nytimes.com/2018/10/16/briefing/saudi-arabia-paul-allen-nba.html", "urlToImage": "https://static01.nyt.com/images/2018/10/16/fashion/16Us-AMbriefing-24-AMCORE/16Us-AMbriefing-24-AMCORE-facebookJumbo.jpg", "publishedAt": "2018-10-16T09:45:03Z", "content": "Read more from this weeks Science section. Milwaukee takes the lead in N.L.C.S. The Brewers shut out the Los Angeles Dodgers, 4-0, to gain the edge in the National League Championship Series, two games to one. Game 4 is tonight, as is Game 3 of the American L… [+1025 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michelle Higgins", "title": "Making an Entrance", "description": "That small space near your front door could be the most important room in your home — even if it’s not a real room. Here’s how to make the best of it.", "url": "https://www.nytimes.com/2018/10/16/realestate/making-an-entrance.html", "urlToImage": "https://static01.nyt.com/images/2018/10/15/realestate/21fix1/21fix1-facebookJumbo.jpg", "publishedAt": "2018-10-16T09:02:41Z", "content": "One way is to cover the walls in a graphic paper, said Ms. Eisen, who often uses grasscloth wall coverings by Phillip Jeffries in the entryways she designs. Wallpaper adds texture, depth, and it can make the rest of the elements feel more refined and expensiv… [+1588 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Hannah Beech", "title": "Nature Cursed Indonesia, but It Took Neglect to Make a Disaster", "description": "As the city of Palu mourns the dead from an earthquake and tsunami, it is haunted by questions of whether the government could have stemmed the devastation.", "url": "https://www.nytimes.com/2018/10/16/world/asia/indonesia-earthquake-tsunami.html", "urlToImage": "https://static01.nyt.com/images/2018/10/17/world/17indonesia-quake-1/17indonesia-quake-1-facebookJumbo.jpg", "publishedAt": "2018-10-16T09:04:31Z", "content": "All three calamities struck on Sept. 28. Its not that we wanted to be right, Mr. Watkinson said. Its that the geological evidence pointed very strongly to the likelihood of something like this occurring. In 2012, the Geological Agency at Indonesias Ministry o… [+1182 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Harry and Meghan Charm Sometimes Skeptical Subjects in Australia - New York Times", "description": "New York Times Harry and Meghan Charm Sometimes Skeptical Subjects in Australia New York Times SYDNEY, Australia — Australians welcomed Prince Harry and his wife, Meghan, the Duchess of Sussex, to Sydney on Tuesday, and clamored for a glimpse of the newly mar…", "url": "https://www.nytimes.com/2018/10/16/world/australia/prince-harry-meghan-markle.html", "urlToImage": "https://static01.nyt.com/images/2018/10/17/world/17oz-royals-1/17oz-royals-1-facebookJumbo.jpg", "publishedAt": "2018-10-16T06:56:02Z", "content": "SYDNEY, Australia Australians welcomed Prince Harry and his wife, Meghan, the Duchess of Sussex, to Sydney on Tuesday, and clamored for a glimpse of the newly married couple, who a day earlier announced they were expecting the royal familys newest addition. T… [+363 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "EDWARD WONG", "title": "U.S. Bars American Aid Groups From Traveling to North Korea", "description": "A farm field in North Korea, whose citizens grapple with food shortages. The travel ban affects humanitarian efforts to provide farming assistance.", "url": "https://www.nytimes.com/2018/10/17/world/asia/north-korea-trump-administration-ban.html", "urlToImage": "https://static01.nyt.com/images/2018/10/18/us/politics/18dc-northkorea-print/18dc-northkorea-facebookJumbo.jpg", "publishedAt": "2018-10-17T22:00:40Z", "content": "A dozen American nonprofit groups work regularly in North Korea. None have a permanent presence there, and must travel back and forth to the country to do their work. Many have said they are now being denied permission to travel, according to Keith Luse, exec… [+1614 chars]"}]}