{"status": "ok", "totalResults": 4214, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "Michael Burke", "title": "Feinstein’s Dem challenger: 'It’s time that we stop biding our time and biting our tongue'", "description": "Sen. Dianne Feinstein's (D-Calif.) progressive challenger, California state Sen. Kevin de León (D), on Wednesday called on Democrats to \"stop bid...", "url": "https://thehill.com/homenews/senate/411987-feinsteins-dem-challenger-its-time-that-we-stop-biding-our-time-and-biting", "urlToImage": "https://thehill.com/sites/default/files/feinsteindianne_082118gn_lead.jpg", "publishedAt": "2018-10-18T11:52:41Z", "content": "Sen. Dianne Feinstein 's (D-Calif.) progressive challenger, California state Sen. Kevin de León (D), on Wednesday called on Democrats to \"stop biding our time and biting our tongue,\" saying the party needs to stand up to President Trump Donald John Trump Trum… [+1627 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Julia Manchester", "title": "Trump Jr. slams GOP establishment: 'They're used to just losing'", "description": "Donald Trump Jr. slammed the Republican establishment in an interview that aired Wednesday on \"Rising,\" arguing that wing of the GOP had grown complacent.\"You have that typical establishment side that they're used...", "url": "https://thehill.com/hilltv/rising/411836-trump-jr-says-gop-establishment-is-used-to-losing", "urlToImage": "https://thehill.com/sites/default/files/trumpjrdonald_022118getty.jpg", "publishedAt": "2018-10-17T15:31:24Z", "content": "Donald Trump Jr. Donald (Don) John Trump Dems fear party is headed to gutter from Avenattis sledgehammer approach Trump Jr. to stump in Indiana for Pences brother and governor hopeful Donald Trump Jr. blasts Beto ORourke: Irish guy pretending to be Hispanic M… [+1491 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Brett Samuels", "title": "Trump awards Medal of Honor to Vietnam veteran 50 years after actions during Tet Offensive", "description": "President Trump on Wednesday awarded the Medal of Honor to a Vietnam veteran credited with saving numerous lives during a fierce battle in the Tet Offensive 50 years ago.Retired Sgt. Major John Canley was honored i...", "url": "https://thehill.com/policy/defense/411927-trump-awards-medal-of-honor-to-vietnam-veteran-50-years-after-actions-during", "urlToImage": "https://thehill.com/sites/default/files/medalofhonor_10172018.png", "publishedAt": "2018-10-17T20:38:08Z", "content": "President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip to Middle East MORE on Wednesday awarded the Medal of Honor to a Vietnam veteran credited… [+2829 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Owen Daugherty", "title": "Texas students required to watch video on interacting with police in order to graduate high school", "description": "Starting this school year, Texas high school students are required by state law to watch a video instructing them how to interact with law enforcement during a traffic stop before they are allowed to graduate....", "url": "https://thehill.com/homenews/state-watch/411917-texas-law-requires-students-watch-video-on-interacting-with-police-in", "urlToImage": "https://thehill.com/sites/default/files/texaspolicevideo_101718.jpg", "publishedAt": "2018-10-17T20:37:14Z", "content": "Starting this school year, Texas high school students are required by state law to watch a video instructing them how to interact with law enforcement during a traffic stop before they are allowed to graduate. The law, which came following the fatal police sh… [+1324 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Jessie Hellmann", "title": "McConnell: GOP could try to repeal ObamaCare again after midterms", "description": "Senate Majority Leader Mitch McConnell (R-Ky.) said Wednesday that Republicans may take another crack at repealing ObamaCare if they maintain", "url": "https://thehill.com/homenews/senate/411896-mcconnell-gop-could-try-to-repeal-obamacare-again-after-midterms", "urlToImage": "https://thehill.com/sites/default/files/mcconnellmitch_100618getty_0.jpg", "publishedAt": "2018-10-17T19:16:47Z", "content": "Senate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnell Graham: I hope Dems 'get their ass kicked' for conduct around Kavanaugh Saudi mystery drives wedge between Trump, GOP Overnight Defense: Trump worries Saudi Arabia treated as 'guilty un… [+2713 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Nick Calio, Opinion Contributor", "title": "Bipartisanship can – and does – exist in Washington", "description": "As Capitol Hill celebrates a bipartisan achievement of passing the FAA Reauthorization bill this month, it's only fitting that we also celebrate the 40th anniversary of the bipartisan Airline Deregulation Act.", "url": "https://thehill.com/blogs/congress-blog/politics/411882-bipartisanship-can-and-does-exist-in-washington", "urlToImage": "https://thehill.com/sites/default/files/ohareairport_030718.jpg", "publishedAt": "2018-10-17T18:45:08Z", "content": "If you read the headlines or click on whats trending these days, it would be easy to believe that there isnt any glimmer of bipartisan spirit alive in the nations capital. But while many cameras were turned off and many reporters were writing on other news st… [+3410 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Emily Birnbaum", "title": "Trump Jr. to campaign in West Virginia", "description": "President Trump's eldest son, Donald Trump Jr., is set to campaign in West Virginia on Monday on behalf of Senate candidate Patrick Morrisey (R), who is...", "url": "https://thehill.com/homenews/administration/411903-trump-jr-to-campaign-in-west-virginia", "urlToImage": "https://thehill.com/sites/default/files/trumpjrdonald_040218gn2_lead.jpg", "publishedAt": "2018-10-17T19:43:46Z", "content": "President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip to Middle East MORE 's eldest son, Donald Trump Jr. Donald (Don) John Trump Dems fear par… [+2003 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Timothy Cama", "title": "Trump: California ‘better get their act together’ on wildfires", "description": "President Trump on Wednesday seemed to threaten to withhold funding to fight wildfires in California if the state doesn't remove more \"old trees\" from forests.\"California's a mess. We're giving billions and billion...", "url": "https://thehill.com/policy/energy-environment/411883-trump-california-better-get-their-act-together-on-wildfires", "urlToImage": "https://thehill.com/sites/default/files/trumpdonald_101718upi2_lead.jpg", "publishedAt": "2018-10-17T18:43:46Z", "content": "President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip to Middle East MORE on Wednesday seemed to threaten to withhold funding to fight wildfire… [+2508 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joe Concha", "title": "'The Conners' premieres without Roseanne, draws 10.5M viewers", "description": "Premiering without its formerly titular character Roseanne Barr, ABC's \"The Conners\" drew 10.5 million viewers on Tuesday night, topping all programs on network television including NBC juggernaut, \"This Is Us,\" according to early Nielsen rat", "url": "https://thehill.com/blogs/in-the-know/411884-the-conners-premieres-without-roseanne-draws-105m-viewers", "urlToImage": "https://thehill.com/sites/default/files/barrroseanne_goodmanjohn_getty.jpg", "publishedAt": "2018-10-17T18:48:33Z", "content": "Premiering without its formerly titular character Roseanne Barr, ABC's \"The Conners\" drew 10.5 million viewers on Tuesday night, topping all programs on network television including NBC juggernaut, \"This Is Us,\" according to early Nielsen ratings released Wed… [+1165 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Jordain Carney", "title": "Senate Dems ask Trump to disclose financial ties to Saudi Arabia", "description": "Senate Democrats are asking President Trump and the Trump Organization to disclose any ties to Saudi Arabia, as well as freeze any potential business relationships in the wake of the disappearance of a U.S.-based journali...", "url": "https://thehill.com/blogs/floor-action/senate/411929-senate-dems-ask-trump-to-disclose-financial-ties-to-saudi-arabia", "urlToImage": "https://thehill.com/sites/default/files/udalltom_051618gn2_lead.jpg", "publishedAt": "2018-10-17T20:45:08Z", "content": "The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 fax The contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "ebirnbaum@thehill.com (Emily Birnbaum)", "title": "US fertility rates are down: CDC", "description": "Total fertility rates in the U.S. have dropped significantly over the past decade as first-time mothers have grown older on average, according to a new data brief from the Centers for Disease Control and Prevention (CDC). Though...", "url": "https://thehill.com/policy/healthcare/412005-us-fertility-rates-are-down-cdc", "urlToImage": "https://thehill.com/sites/default/files/parents_baby_1.jpg", "publishedAt": "2018-10-18T13:41:13Z", "content": "Fertility rates in the U.S. have dropped significantly over the past decade as first-time mothers have grown older on average, according to the Centers for Disease Control and Prevention (CDC). The CDC's data also show differences between rural and metropolit… [+1477 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Chris Mills Rodrigo", "title": "Julian Castro responds to Steve King 'Hispanic' comments: 'He does what he usually does'", "description": "Former Housing and Urban Development Secretary Julián Castro on Thursday responded to criticism from Rep. Steve King, saying the Iowa Republican \"does what he usually does.\"King...", "url": "https://thehill.com/homenews/campaign/412020-julian-castro-responds-to-steve-king-hispanic-comments-he-does-what-he", "urlToImage": "https://thehill.com/sites/default/files/article_images/castrojulian_getty.jpg", "publishedAt": "2018-10-18T14:39:43Z", "content": "Former Housing and Urban Development Secretary Julián Castro on Thursday responded to criticism from Rep. Steve King Steven (Steve) Arnold King Julián Castro says hes 'likely' to run in 2020 Steve King: Julian and Joaquin Castro learned Spanish to qualify as … [+1356 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Avery Anapol", "title": "Campaign manager for brothel owner who died: He’ll still win Nevada election", "description": "The campaign manager for the late brothel owner Denis Hof predicts that he will still win election to the Nevada state legislature.Chuck Muth, Hof's campaign manager, said that he thinks Hof w...", "url": "https://thehill.com/homenews/campaign/411992-campaign-manager-for-brothel-owner-who-died-hell-still-win-nevada-election", "urlToImage": "https://thehill.com/sites/default/files/hofdennis.jpg", "publishedAt": "2018-10-18T12:28:39Z", "content": "The campaign manager for the late Nevada brothel owner Denis Hof's Republican bid for state office predicts that he will posthumously win election to the state legislature. Chuck Muth noted Republican's almost 2-to-1 registration advantage over Democrats in t… [+1052 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Harper Neidig", "title": "Facebook believes hack was carried out by spammers: report", "description": "Facebook believes that the hack it discovered last month that affected nearly 30 million users was not conducted by a foreign state but rather spammers hoping to profit off deceptive advertising, according to...", "url": "https://thehill.com/policy/technology/412019-facebook-believes-hack-was-carried-out-by-spammers-report", "urlToImage": "https://thehill.com/sites/default/files/privacy_facebook_042018getty.jpg", "publishedAt": "2018-10-18T14:20:48Z", "content": "Facebook believes that the hack it discovered last month that affected nearly 30 million users was not conducted by a foreign state but rather spammers hoping to profit off deceptive advertising, according to The Wall Street Journal. The Journal, citing unnam… [+933 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Jessie Hellmann", "title": "Majority of voters say health care issues very important when deciding who to vote for in November", "description": "Seventy-one percent of voters nationally say the issue of health care is \"very important\" in making their decisions about who to vote for in the midterms, according to a...", "url": "https://thehill.com/policy/healthcare/412015-majority-of-voters-say-health-care-issues-very-important-when-deciding-who", "urlToImage": "https://thehill.com/sites/default/files/healthcare_doctorsoffice_istock.jpg", "publishedAt": "2018-10-18T14:00:41Z", "content": "Seventy-one percent of voters nationally say the issue of health care is \"very important\" in making their decisions about who to vote for in the midterms, according to a poll released Thursday. When asked to choose one issue as the single most important, 30 p… [+2438 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Michael Burke", "title": "Ex-USA Gymnastics head arrested in connection with Nassar case", "description": "Former USA Gymnastics President and CEO Steve Penny was arrested after being indicted by a Texas grand jury on charges that he tampered with evidence in the investigation of former USA Olympics doctor Larry Nassar, according to media reports.", "url": "https://thehill.com/blogs/blog-briefing-room/news/412012-ex-usa-gymnastics-head-arrested-in-connection-with-nassar-case", "urlToImage": "https://thehill.com/sites/default/files/pennysteve_012611getty.jpg", "publishedAt": "2018-10-18T13:59:31Z", "content": "Former USA Gymnastics President and CEO Steve Penny was arrested after being indicted by a Texas grand jury on charges that he tampered with evidence in the investigation of former USA Olympics doctor Larry Nassar, according to media reports. Penny faces 2 to… [+1240 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Morgan Chalfant", "title": "Key takeaways from the Arizona Senate debate", "description": "U.S. Senate hopefuls Kyrsten Sinema (D) and Martha McSally (R) faced off in a heated debate Monday evening in Arizona as they sought to woo the state's voters in a quest to replace outgoing Republican Sen. Jeff Flake....", "url": "https://thehill.com/homenews/campaign/411533-takeaways-from-mcsally-sinema-debate", "urlToImage": "https://thehill.com/sites/default/files/kyrstensinema_marthamcsally.jpg", "publishedAt": "2018-10-16T03:33:15Z", "content": "U.S. Senate hopefuls Kyrsten Sinema (D) and Martha McSally Martha Elizabeth McSally Romney defends Trumps policies as effective,' disputes he led 'never Trump' movement Trump adds campaign stops for Senate candidates in Montana, Arizona, Nevada Democrats hold… [+5763 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Owen Daugherty", "title": "Evangelical leader: Not worth risking ties with Saudi Arabia over missing journalist", "description": "A prominent evangelical leader told viewers to “cool down the tempers of those who are screaming blood for the Saudis” and not risk a $100 billion arms deal over the apparent death of Saudi-born journalist Jamal Khashoggi.", "url": "https://thehill.com/policy/international/411949-evangelical-leader-going-after-saudi-arabia-for-disappearance-of", "urlToImage": "https://thehill.com/sites/default/files/sddefault.jpg", "publishedAt": "2018-10-17T22:11:13Z", "content": "A prominent evangelical leader told viewers to cool down the tempers of those who are screaming blood for the Saudis and not risk a $100 billion arms deal over the apparent death of Saudi-born journalist Jamal Khashoggi. Appearing on Christian television show… [+1493 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Brett Samuels", "title": "Cohen meets with investigators probing Trump's family business: report", "description": "President Trump's former longtime attorney Michael Cohen met Wednesday with prosecutors looking into Trump's family business and charity, CNN reported", "url": "https://thehill.com/blogs/blog-briefing-room/411946-cohen-meets-with-investigators-probing-trumps-family-business-report", "urlToImage": "https://thehill.com/sites/default/files/trumpdonald_cohenmichael_1_getty.jpg", "publishedAt": "2018-10-17T21:50:10Z", "content": "President Trump Donald John Trump Five takeaways from Cruz, O'Rourke's debate showdown Arpaio files libel suit against New York Times IMF's Christine Lagarde delays trip to Middle East MORE 's former longtime attorney Michael Cohen met Wednesday with prosecut… [+2427 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Sylvan Lane", "title": "On The Money: Treasury official charged with leaking info on ex-Trump advisers | Trump to request 5 percent cut from Cabinet members | Mnuchin to decide by Thursday whether to attend Saudi conference", "description": "Happy Wednesday and welcome back to On The Money, which unfortunately does not have imminent plans to launch its own artificial moon...", "url": "https://thehill.com/policy/finance/overnights/411951-on-the-money-treasury-official-charged-with-leaking-info-on-ex", "urlToImage": "https://thehill.com/sites/default/files/mnuchinsteven_071218am3_lead.jpg", "publishedAt": "2018-10-17T22:01:31Z", "content": "Happy Wednesday and welcome back to On The Money, which unfortunately does not have imminent plans to launch its own artificial moon. Im Sylvan Lane, and heres your nightly guide to everything affecting your bills, bank account and bottom line. See something … [+7486 chars]"}]}