{"status": "ok", "totalResults": 2382, "articles": [{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Valentina Pop", "title": "What Time Is it in Europe? Soon, the Answer Might Be Really Confusing", "description": "The European Union’s 28 countries are discussing whether to cede control of clocks to each nation; it’s “impossible for old people to change the clock on the microwave two times a year.”", "url": "https://www.wsj.com/articles/what-time-is-it-in-europe-soon-the-answer-might-be-really-confusing-1539872424", "urlToImage": "https://images.wsj.net/im-31509/social", "publishedAt": "2018-10-18T14:41:52Z", "content": "BRUSSELSWhen Europeans set their clocks back on Sunday, it could be one of the last times 500 million people simultaneously get an extra hour of sleep. After four decades of synchronized time change, the European Unions 28 countries are debating whether to go… [+5700 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Craig Nelson", "title": "Taliban Kill Afghan Police Chief", "description": "One of southern Afghanistan’s most powerful figures was killed and the top U.S. commander in the country escaped unharmed when bodyguards for the governor of southern Kandahar province opened fire following a meeting to discuss security for this weekend’s ele…", "url": "https://www.wsj.com/articles/afghan-police-chief-killed-in-taliban-attack-1539875233", "urlToImage": "https://images.wsj.net/im-31609/social", "publishedAt": "2018-10-18T15:19:37Z", "content": "KABULOne of southern Afghanistans most powerful political and military figures was killed Thursday and the top U.S. commander in the country escaped unharmed when bodyguards for the governor of southern Kandahar province opened fire following a meeting to dis… [+2352 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Stephanie Armour", "title": "Republican Candidates Play Defense Over Health Care", "description": "Many Republicans are urgently trying to reassure voters they want to save the protections in President Obama’s 2010 health law. Democrats are pouring on ads to remind the electorate of the GOP push to repeal the law.", "url": "https://www.wsj.com/articles/republican-candidates-play-defense-over-health-care-1539860400", "urlToImage": "https://images.wsj.net/im-31457/social", "publishedAt": "2018-10-18T11:13:11Z", "content": "Republican Rep. Dana Rohrabacher of California backed the unsuccessful GOP effort last year to begin repealing the Affordable Care Act, which guarantees coverage for people with pre-existing medical conditions. Now, in a bruising race against Democratic chall… [+5584 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Sara Randazzo", "title": "Opioid Makers Ask Counties for Proof of Harm", "description": "As the number of opioid lawsuits against Purdue Pharma and other drug manufacturers reaches 1,500 and counting, the companies are pushing their adversaries to offer specific details to back up their claims.", "url": "https://www.wsj.com/articles/opioid-makers-ask-counties-for-proof-of-harm-1539867600", "urlToImage": "https://images.wsj.net/im-31499/social", "publishedAt": "2018-10-18T13:03:56Z", "content": "Purdue Pharma LP has a request for counties suing the drug manufacturer for allegedly causing the opioid epidemic: show us how we are to blame. As the number of opioid lawsuits against Purdue and other drug manufacturers reaches 1,500 and counting, the compan… [+3953 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Michael S. Derby", "title": "Fed's Bullard Says Modernized Taylor Rule Supports No Rate Changes", "description": "St. Louis Fed President James Bullard said Thursday that a modernized way of looking at a venerable monetary-policy rule supports his belief that no rate rises are needed right now.", "url": "https://www.wsj.com/articles/feds-bullard-says-modernized-taylor-rule-supports-no-rate-changes-1539868084", "urlToImage": "https://images.wsj.net/im-31579/social", "publishedAt": "2018-10-18T13:08:05Z", "content": "St. Louis Fed President James Bullard said Thursday that a modernized way of looking at a venerable monetary-policy rule supports his belief that no rate rises are needed right now. Mr. Bullard said the Taylor Rule, which suggests a level for Fed short-term r… [+944 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Samuel I. Schwartz", "title": "How Autonomous Vehicles Will Reshape Our World", "description": "Self-driving cars are just one piece of the puzzle. Former New York City traffic commissioner Samuel I. Schwartz (aka Gridlock Sam) explains.", "url": "https://www.wsj.com/articles/how-autonomous-vehicles-will-reshape-our-world-1539871201", "urlToImage": "https://si.wsj.net/public/resources/images/B3-CA785_wheel__SOC_20181012145808.jpg", "publishedAt": "2018-10-18T14:00:08Z", "content": "Nobody, not even transportation experts like me, had an inkling that ride-on-demand services like Uber would change our travel habits so quickly and dramatically. Never in our lifetime have we witnessed such a rapid shift in transportation. Despite global pro… [+3879 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Vivian Salama", "title": "Trump Threatens to Use Military to Stop 'Onslaught' of Migrants", "description": "President Trump threatened to deploy the military and close the southern border if Mexico doesn’t stop an ’onslaught’ of Latin American migrants passing through its country from reaching the U.S.", "url": "https://www.wsj.com/articles/trump-threatens-to-call-up-the-u-s-military-if-mexico-doesnt-stop-migrants-1539866223", "urlToImage": "https://images.wsj.net/im-31572/social", "publishedAt": "2018-10-18T13:39:27Z", "content": "WASHINGTONPresident Trump on Thursday threatened to deploy the military and close the southern border if Mexico doesnt stop an onslaught of Latin American migrants passing through its country from reaching the U.S. On Twitter, the president blamed Democrats f… [+3131 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Jennifer Maloney", "title": "Rob Sands, CEO of beverage giant Constellation Brands, steps down", "description": "Constellation Brands Inc., a family-controlled company that transformed itself from a boxed-wine seller to a beverage giant that brews Corona and has bet big on marijuana, is handing the reins to an outsider for the first time.", "url": "https://www.wsj.com/articles/constellation-ceo-rob-sands-to-step-down-from-corona-brewer-1539807998", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-GR977_sands1_ZG_20181017170609.jpg", "publishedAt": "2018-10-17T21:08:27Z", "content": "Constellation Brands Inc., a family-controlled company that transformed itself from a boxed-wine seller to a beverage giant that brews Corona and has bet big on marijuana, is handing the reins to an outsider for the first time. Rob Sands, the third in his fam… [+1072 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": null, "title": "U.S. Does Not Name China as Currency Manipulator", "description": "The U.S. Treasury again passed up a formal opportunity to designate China a “currency manipulator,” but singled out the nation’s currency practices as a source of “particular concern.”", "url": "https://www.wsj.com/articles/u-s-does-not-name-china-as-currency-manipulator-1539810918?mod=pls_whats_news_us_business_f", "urlToImage": null, "publishedAt": "2018-10-17T21:15:19Z", "content": null}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Nicole Hong", "title": "A Look at Harvard's Admissions Guidelines", "description": "A guidebook used to assess the Harvard University class that started in fall 2014 provides perhaps the most detailed look so far at exactly how the school weighs a high-school student’s accomplishments and background.", "url": "https://www.wsj.com/articles/a-look-at-harvards-admissions-guidelines-1539804848", "urlToImage": "https://images.wsj.net/im-31469/social", "publishedAt": "2018-10-17T19:53:16Z", "content": "College admissions are both an art and a science. In deciding who to admit, many selective universities employ a holistic review of applicants that assesses their grades and test scores, extracurricular activities, community service, athletic achievementand t… [+1140 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Melissa Korn", "title": "Harvard Admissions Dean Largely Ignored Report on Factors Affecting Asian-American Applicants", "description": "If admission to Harvard were based solely on academic merit, Asian-Americans would comprise 43% of the freshman class.", "url": "https://www.wsj.com/articles/harvard-admissions-dean-largely-ignored-report-on-factors-affecting-asian-american-applicants-1539806653", "urlToImage": "https://images.wsj.net/im-31466/social", "publishedAt": "2018-10-17T20:18:08Z", "content": "BOSTONWere admission to Harvard based solely on academic merit, Asian-Americans would comprise 43% of the freshman class, while African-Americans would make up less than 1%, according to an internal Harvard report discussed at a trial here Wednesday. Lawyers … [+4708 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "James Hookway", "title": "Free More Dissidents, U.S. Asks Vietnam, After 'Mother Mushroom' Is Released", "description": "The U.S. government wants more political prisoners in Vietnam released after authorities there freed “Mother Mushroom,” a prominent dissident, following Defense Secretary Jim Mattis’s visit this week.", "url": "https://www.wsj.com/articles/free-more-dissidents-u-s-asks-vietnam-after-mother-mushroom-is-released-1539849829", "urlToImage": "https://images.wsj.net/im-31548/social", "publishedAt": "2018-10-18T08:03:51Z", "content": "The U.S. government wants more political prisoners in Vietnam released after authorities there freed Mother Mushroom, a prominent dissident, following Defense Secretary Jim Mattiss visit this week. Nguyen Ngoc Nhu Quynh, a 39-year-old blogger best known as Mo… [+2300 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Alison Sider", "title": "United, Delta Climb on Business-Class Demand - Wall Street Journal", "description": "Wall Street Journal United, Delta Climb on Business -Class Demand Wall Street Journal The increase in revenue from business and premium tickets, $592 million, represented about two-thirds of Delta's overall sales increase for the quarter. Delta said more cust…", "url": "https://www.wsj.com/articles/united-delta-climb-on-business-class-demand-1539803503", "urlToImage": "https://images.wsj.net/im-31453/social", "publishedAt": "2018-10-17T19:11:00Z", "content": "Airlines are relying more on business travelers to recoup higher fuel costs. Fliers havent cut back on air travel this year even as ticket prices rise, helping airlines offset a 40% annual increase in fuel prices. That includes rising demand for premium seats… [+2859 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Marc Myers", "title": "Hopelessness and Hope in 'Papa Was a Rolling Stone'", "description": "Re-recorded by the Temptations in 1972, the psychedelic-soul ballad about parental abandonment became a No. 1 pop hit, winning two Grammys .", "url": "https://www.wsj.com/articles/hopelessness-and-hope-in-papa-was-a-rolling-stone-1539788124", "urlToImage": "https://images.wsj.net/im-30798/social", "publishedAt": "2018-10-17T19:35:35Z", "content": "The second time was a charm. Originally recorded by the Undisputed Truth, Papa Was a Rolling Stone only reached No. 63 on Billboards pop chart and No. 24 on the R&amp;B chart when released in early 1972. Re-recorded by the Temptations in mid-1972 with a new a… [+7795 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Richard Rubin", "title": "New 'Opportunity Zone' Rules Offer Developers Tax Breaks", "description": "The Trump administration on Friday will propose guidelines that will help investors use a new tax incentive that encourages development in low-income areas.", "url": "https://www.wsj.com/articles/new-opportunity-zone-tax-break-rules-offer-flexibility-to-developers-1539948600", "urlToImage": "https://images.wsj.net/im-31756/social", "publishedAt": "2018-10-19T12:23:59Z", "content": "WASHINGTONThe Trump administration on Friday will propose guidelines that will help investors use a new tax incentive that encourages development in low-income areas. The Treasury Department designed the rules for the Opportunity Zone program to give business… [+3239 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Drew Hinshaw", "title": "EU Ratchets Up Fight Over Poland's Supreme Court - Wall Street Journal", "description": "Wall Street Journal EU Ratchets Up Fight Over Poland's Supreme Court Wall Street Journal The European Union's top court ordered Poland to suspend a purge of the country's supreme court, escalating a battle over the rule of law that has split Europe between Ea…", "url": "https://www.wsj.com/articles/eu-ratchets-up-fight-over-polands-supreme-court-1539963747", "urlToImage": "https://si.wsj.net/public/resources/images/B3-CC362_polcou_SOC_20181019111501.jpg", "publishedAt": "2018-10-19T15:45:59Z", "content": "The European Unions top court ordered Poland to suspend a purge of the countrys supreme court, escalating a battle over the rule of law that has split Europe between East and West. The Luxembourg-based European Court of Justice said Friday that Poland must de… [+3163 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Max Colchester", "title": "Radical Preacher Who Supported Islamic State Is Freed in UK - Wall Street Journal", "description": "Wall Street Journal Radical Preacher Who Supported Islamic State Is Freed in UK Wall Street Journal LONDON—Radical Islamic preacher Anjem Choudary was released from a British jail Friday after serving half his sentence for inciting support of Islamic State, t…", "url": "https://www.wsj.com/articles/radical-preacher-who-supported-islamic-state-is-freed-in-u-k-1539956723", "urlToImage": "https://images.wsj.net/im-31806/social", "publishedAt": "2018-10-19T13:45:00Z", "content": "LONDONRadical Islamic preacher Anjem Choudary was released from a British jail Friday after serving half his sentence for inciting support of Islamic State, the latest in a stream of people arrested on terrorism charges who have been discharged in the U.K. ov… [+3102 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Sara Randazzo", "title": "University of Southern California to Pay $215 Million in Gynecologist Sex-Abuse Case - Wall Street Journal", "description": "Wall Street Journal University of Southern California to Pay $215 Million in Gynecologist Sex-Abuse Case Wall Street Journal LOS ANGELES—The University of Southern California has agreed to pay $215 million to settle a federal lawsuit brought against it by wom…", "url": "https://www.wsj.com/articles/university-of-southern-california-to-pay-215-million-in-gynecologist-sex-abuse-case-1539965772", "urlToImage": "https://images.wsj.net/im-31691/social", "publishedAt": "2018-10-19T16:19:31Z", "content": "LOS ANGELESThe University of Southern California has agreed to pay $215 million to settle a federal lawsuit brought against it by women who have accused a former campus gynecologist, George Tyndall, of sexual abuse and misconduct. Its among the largest settle… [+4593 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Christopher M. Matthews", "title": "Frustrated Investors Want Frackers to Consolidate", "description": "A private-equity firm is urging oil producer Resolute Energy to merge with a rival, the latest salvo in a growing campaign by some investors to force shale drillers to consolidate.", "url": "https://www.wsj.com/articles/frustrated-investors-want-frackers-to-consolidate-1539958426", "urlToImage": "https://images.wsj.net/im-31809/social", "publishedAt": "2018-10-19T14:13:53Z", "content": "A private-equity firm is urging oil producer Resolute Energy Corp. REN 2.64% to merge with a rival, the latest salvo in a growing campaign by some investors to force shale drillers to consolidate. Kimmeridge Energy Management Co. told Resolutes board of direc… [+4806 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Stu Woo", "title": "Facebook Turns to U.K. Politician to Help Repair Image", "description": "Facebook has hired Britain’s former deputy prime minister, Nick Clegg, as its top policy and communications executive, giving a Silicon Valley outsider the task of mending the social network’s image.", "url": "https://www.wsj.com/articles/facebook-turns-to-u-k-politician-to-help-repair-its-image-1539954410", "urlToImage": "https://images.wsj.net/im-31805/social", "publishedAt": "2018-10-19T13:20:26Z", "content": "LONDON Facebook Inc. has hired one of Britains best-known politicians as its top policy and communications executive, giving a Silicon Valley outsider the task of mending the social networks image as it deals with increased political scrutiny in the U.S. and … [+2464 chars]"}]}