{"status": "ok", "totalResults": 1515, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "WILL WEISSERT / AP", "title": "Beto O’Rourke Lays Into Ted Cruz During Texas Debate as He Tries to Gain Momentum in the Polls", "description": "Democrat Beto O'Rourke abandoned his usual message of optimism and laid into Ted Cruz, hoping to gain poll numbers in the Texas Senate race.", "url": "http://time.com/5426917/orourke-cruz-texas-debate/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/beto-orourke-ted-cruz-texas-senate-debate.jpg?quality=85", "publishedAt": "2018-10-17T14:06:37Z", "content": "(SAN ANTONIO) — Democrat Beto O’Rourke abandoned his usual message of unity and optimism and laid into Ted Cruz, hoping to reverse polls that show him fading against the Republican incumbent during the second debate of a Texas Senate race that’s become one of… [+4472 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cady Lang", "title": "‘It’s Very Sad.’ Ariana Grande Explains Why She Is Taking a Break From Social Media", "description": "Ariana Grande is taking a break from the Internet and social media after splitting from Pete Davidson and the death of ex Mac Milller.", "url": "http://time.com/5426981/ariana-grande-instagram/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/ariana-grande-quits-social-media-after-pete-davidson-split.jpg?quality=85", "publishedAt": "2018-10-17T15:01:21Z", "content": "Ariana Grande is taking a break from the Internet following a year that included the untimely death of ex-boyfriend Mac Miller and most recently, the end of her engagement to Saturday Night Live star fiancé Pete Davidson. Following the taping of NBC’s A Very … [+668 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "President Trump Stresses That Jamal Khashoggi Was Not an ‘American Citizen’ in Latest Remarks About Missing Journalist", "description": "President Trump also says the U.S. is asking Turkey for audio and video relating to missing Saudi journalist Jamal Khashoggi \"if it exists.\"", "url": "http://time.com/5427224/president-trump-saudi-arabia-khashoggi-citizen/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/trump-saudi-arabia-turkey.jpg?quality=85", "publishedAt": "2018-10-17T16:20:39Z", "content": "(WASHINGTON) — President Donald Trump says the U.S. is asking Turkey for audio and video relating to missing Saudi journalist Jamal Khashoggi “if it exists.” The president on Wednesday called Saudi Arabia an important ally, noting it is an important customer … [+525 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time Inc", "title": "This kid could not get enough of Prince Harry’s beard", "description": "After arriving in Dubbo, Australia on the second day of a 16-day tour of Australia and the South Pacific on Tuesday, Prince Harry received an adorable hug from a kid who was enthralled with his beard. While royal admirers waited for the chance to meet Harry a…", "url": "https://time.com/5426667/prince-harry-beard-kid/", "urlToImage": "https://images.hellogiggles.com/uploads/2018/10/17120307/gettyimages-1052320318-e1539803140677.jpg", "publishedAt": "2018-10-17T19:15:15Z", "content": null}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "The Mega Millions Jackpot Has Been Raised Again. Now It’s a Whopping $900 Million", "description": "The Mega Millions jackpot was raised again Wednesday to $900 million. It's the second-largest jackpot in history.", "url": "http://time.com/5427552/mega-millions-jackpot-raised-900-million/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/mega-millions-jackpot-900.jpg?quality=85", "publishedAt": "2018-10-17T19:13:47Z", "content": "(DES MOINES, Iowa) — The Mega Millions jackpot is now up to $900 million. Lottery officials raised the estimated prize Wednesday, less than a day after another drawing without a winner increased the prize to $868 million. Officials say no tickets matched all … [+575 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "How the Anti-Trump Resistance Is Organizing Its Outrage", "description": "Inside the grassroots movement to help Democrats take back Congress", "url": "http://time.com/5428173/boots-on-the-ground/", "urlToImage": "https://s2.wp.com/wp-content/themes/vip/time2014/img/time-logo-og.png", "publishedAt": "2018-10-18T10:09:02Z", "content": "Carolyn Eberly is an unlikely warrior. A former chemist from Waxhaw, N.C., she works at the local library, plays volleyball and wears her blond hair pulled back in a big clip. Her husband has always followed politics, but Eberly used to steer away from it in … [+996 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Susanna Schrobsdorff", "title": "Provocateur Stormy Daniels Takes an Unexpected Turn in the National Spotlight", "description": "Hi To understand what it means to be famous like Stormy Daniels, for the reasons she is famous, spend time with her in a public space. She walks quickly, her head down, blending in with the neighborhood moms at an upscale Manhattan mall–petite, hardly noticea…", "url": "http://time.com/5428162/stormy-daniels-trump-spotlight/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/stormy-daniels-time-with-donald-trump-social.jpg?quality=85", "publishedAt": "2018-10-18T10:30:06Z", "content": "Hi To understand what it means to be famous like Stormy Daniels, for the reasons she is famous, spend time with her in a public space. She walks quickly, her head down, blending in with the neighborhood moms at an upscale Manhattan mall–petite, hardly noticea… [+7280 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Karl Vick", "title": "How the Murder of Jamal Khashoggi Could Upend the Middle East", "description": "The vanishing of Jamal Khashoggi threatens to make a global pariah out of Saudi Arabia’s once feted crown prince Mohammed Bin Salman", "url": "http://time.com/5428159/jamal-khashoggi-murder/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/jamal-khashoggi-journalist-saudi-prince-threatened1.jpg?quality=85", "publishedAt": "2018-10-18T10:34:30Z", "content": "Before the world even learned his age, it could glean that the young man who runs Saudi Arabia takes extraordinary chances with violence. Mohammed Bin Salman, the prince now known by the global shorthand of MBS, was utterly unknown when his father ascended to… [+8958 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mahita Gajanan", "title": "South Africans Rally for Rape Accuser After She Endured a Grueling Cross-Examination During Televised Trial", "description": "Cheryl Zondi, 22, has faced a slew of questions over the last three days regarding her alleged rape by Timothy Omotoso, 60.", "url": "http://time.com/5428303/cheryl-zondi-omotoso-trial-south-africa-cross-examination/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/cheryl-zondi-omotoso-trial.jpg?quality=85", "publishedAt": "2018-10-18T12:57:34Z", "content": "A number of South Africans have banded together in support of a rape accuser who endured a grueling cross-examination during a nationally televised trial this week. Cheryl Zondi, 22, has faced a slew of questions over the last three days regarding her alleged… [+2125 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kara Cooney", "title": "Women Achieved Enormous Power in Ancient Egypt. What They Did With It Is a Warning for Today", "description": "\"Ancient Egypt allowed more females into power in the ancient world than any other place on earth. Was that society somehow more progressive than we might expect? The answer is a quick and deflating no.\"", "url": "http://time.com/5425216/ancient-egypt-women-in-power-today/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/nefertiti.jpeg?quality=85", "publishedAt": "2018-10-18T14:30:47Z", "content": "Ancient Egypt’s female feline goddess had two sides. As Bastet, she could nurture and protect; as Sakhmet she had a propensity to brutally attack and maim without control. But in both forms, she had one raison d’être: to protect and nurture the patriarchy. Su… [+6603 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Holder", "title": "It’s Time for Americans to Take Back the Vote", "description": "When students at North Carolina Agricultural and Technical State University, the largest historically black public college in the country, go to vote this fall, half of them will be voting in the state’s Sixth Congressional District and the other half will be…", "url": "http://time.com/5428175/take-back-the-vote/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/voting-north-carolina-view-lede.jpg?quality=85", "publishedAt": "2018-10-18T10:06:04Z", "content": "When students at North Carolina Agricultural and Technical State University, the largest historically black public college in the country, go to vote this fall, half of them will be voting in the state’s Sixth Congressional District and the other half will be… [+7662 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": null, "title": "Health Care 50", "description": "Revolutionizing medical marijuana", "url": "http://time.com/collection/health-care-50/5425098/orrin-devinsky/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/orin-devinsky-treatments-healthcare-501.jpg?w=720", "publishedAt": "2018-10-18T13:48:38Z", "content": "Thirty-one states have legalized medical marijuana, and in June, cannabis went even more mainstream: GW Pharmaceuticals Epidiolex became the first FDA-approved marijuana-derived drug. The epilepsy medication was spurred by Devinskys research at New York Unive… [+129 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eli Meixler", "title": "Facebook Bans More Myanmar Military-Linked Accounts for Spreading Propaganda", "description": "Facebook has removed nearly two dozen more accounts and pages linked to Myanmar's military, which the U.N. is investigating for genocide", "url": "http://time.com/5425609/facebook-remove-myanmar-military-accounts/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/07/facebook-shares-declines.jpg?quality=85", "publishedAt": "2018-10-16T05:26:33Z", "content": "Facebook has removed nearly two dozen more accounts and pages linked to Myanmar’s military, which the U.N. is investigating for possible charges of genocide during its campaign of violence against the Rohingya Muslim minority. Facebook announced the removal o… [+2048 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mike Corder / AP", "title": "Rembrandt’s Night Watch Will Be Restored in Amsterdam’s Rijksmuseum", "description": "Rembrandt van Rijn's 'The Night Watch' is getting a makeover at Amsterdam's Rijksmuseum which will be open to the public and viewable online", "url": "http://time.com/5425682/rembrandt-night-watch-restoration-rijksmuseum-amsterdam/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/gettyimages-598748574.jpg?quality=85", "publishedAt": "2018-10-16T09:01:19Z", "content": "(AMSTERDAM) — Rembrandt van Rijn’s Golden Age masterpiece The Night Watch is getting a makeover. Amsterdam’s Rijksmuseum announced Tuesday that it will restore its most famous painting, starting next year in a project that will be open to the public and viewa… [+2512 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Soner Cagaptay", "title": "Why the Release of Pastor Andrew Brunson Is a Good Sign for U.S-Turkey Ties", "description": "Maintaining good ties with Turkey is in Washington's interest. Here's how Erdogan and Trump can move forward on key issues.", "url": "http://time.com/5426818/us-turkey-relations-brunson/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/trump-andrew-brunson.jpg?quality=85", "publishedAt": "2018-10-17T22:04:49Z", "content": "Turkey’s release of American pastor Andrew Brunson from jail is a huge step forward for the U.S.-Turkey relationship. It’s not been easy getting here. An August deal between U.S. President Donald Trump and Turkish President Recep Tayyip Erdogan for the pastor… [+6761 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "A Former USA Gymnastics Head Has Been Indicted for Tampering With Evidence", "description": "Former USA Gymnastics president Steve Penny was arrested after a Texas grand jury indicted him of tampering with Larry Nassar probe evidence", "url": "http://time.com/5428084/usa-gymnastics-tampered-evidence-larry-nassar/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/gettyimages-967877302.jpg?quality=85", "publishedAt": "2018-10-18T04:25:37Z", "content": "(HUNTSVILLE, Texas) — Former USA Gymnastics president Steve Penny has been arrested after a Texas grand jury indicted him, alleging he tampered with evidence in the sexual assault investigation of now-imprisoned gymnastics doctor Larry Nassar. In a statement … [+609 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ashley Thomas / AP", "title": "Jamal Khashoggi Warned of Threats to Free Media in His Last Washington Post Column", "description": "The Washington Post published a column by missing Saudi writer Jamal Khashoggi warning that free press is being silenced in the Middle East", "url": "http://time.com/5428051/jamal-khashoggi-last-washington-post-column/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/gettyimages-1051857002.jpg?quality=85", "publishedAt": "2018-10-18T02:39:26Z", "content": "(WASHINGTON) — The Washington Post has published a new column by missing Saudi writer Jamal Khashoggi in which he warns that governments in the Middle East “have been given free rein to continue silencing the media at an increasing rate.” The Post published t… [+3298 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Charleston Sewage Company Gets a Graphic Reminder of Why You Shouldn’t Flush Wet Wipes", "description": "Divers spent two days deep inside a South Carolina sewer, pulling out masses of baby wipes that had clogged intake pumps.", "url": "http://time.com/5430317/charleston-sewer-clog/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/charleston-waste-supply.jpg?quality=85", "publishedAt": "2018-10-20T19:42:22Z", "content": "(CHARLESTON, S.C.) — Divers spent two days deep inside a South Carolina sewer, pulling out huge balls of oily, black used wet wipes and baby wipes that had clogged intake pumps.The Charleston Water System posted pictures of the masses of wipes on its Twitter … [+1541 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Gina Martinez", "title": "Amy Shumer Will Refuse Super Bowl Ads in Support of Colin Kaepernick", "description": "Comedian Amy Shumer said Friday she would not do a Super Bowl commercial this year, in support of ex-quarterback Colin Kaepernick.", "url": "http://time.com/5430336/amy-shumer-super-bowl-maroon-5-colin-kaepernick/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/amy-schumer-kavanaugh-protest.jpg?quality=85", "publishedAt": "2018-10-20T21:12:06Z", "content": "Comedian Amy Shumer said Friday she would not do a Super Bowl commercial this year, in support of ex-quarterback Colin Kaepernick. Her message came the same day reports surfaced that singer Rihanna turned down being the next year’s Super Bowl half time perfor… [+1287 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Arica L. Coleman", "title": "Elizabeth Warren's DNA Test and the Difficult History of Looking for Answers in Blood - TIME", "description": "TIME Elizabeth Warren's DNA Test and the Difficult History of Looking for Answers in Blood TIME If Massachusetts Senator Elizabeth Warren hoped that releasing the results of a DNA test would settle the issue of her claim to Cherokee heritage, she was quickly …", "url": "http://time.com/5430057/elizabeth-warren-dna-history/", "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/warren.jpeg?quality=85", "publishedAt": "2018-10-20T20:27:06Z", "content": "If Massachusetts Senator Elizabeth Warren hoped that releasing the results of a DNA test would settle the issue of her claim to Cherokee heritage, she was quickly proved wrong. In a video highlighting her family heritage, which she released on Monday, Stanfor… [+9217 chars]"}]}