{"status": "ok", "totalResults": 486, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "Funky Materials Give the Mantis Shrimp Its Powerful Punch", "description": "The legendary crustacean uses a hammer-like appendage made of ceramic and polymer to deliver its punishing blow.", "url": "https://www.wired.com/story/funky-materials-give-the-mantis-shrimp-its-powerful-punch/", "urlToImage": "https://media.wired.com/photos/5bc7d05bf867c63ebba1b104/191:100/pass/mantisshrimp-467993194.jpg", "publishedAt": "2018-10-18T15:02:34Z", "content": "Imagine for a second that youre a crab, and a fellow crustacean called a mantis shrimp has decided to make you its lunch. The truth is, its not worth struggling. The mantis shrimp uses muscles to cock back two hammer-like appendages under its face, storing en… [+4528 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jeffrey Van Camp", "title": "Roku Premiere Plus Review (2018): Affordable 4K HDR Streaming", "description": "Roku brings the price of 4K TV streaming down to new lows, with a few caveats.", "url": "https://www.wired.com/review/review-roku-premiere-plus/", "urlToImage": "https://media.wired.com/photos/5bc7d6b60bba6f2d70ffcd45/191:100/pass/rokupremiereplus.jpg", "publishedAt": "2018-10-18T12:00:00Z", "content": "A few years ago, I gave my parents-in-law a Chromecast for Christmas. They needed an easy way to watch Netflix and Chromecast was the hip, hot new thing. This will be perfect, I thought. I was wrong. The problems added up quickly. Their Wi-Fi was spotty, so t… [+5635 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Julie Muncy", "title": "'Black Ops 4' Review: Making 'Call of Duty' For a 'Fortnite' World", "description": "A new battle-royale mode that leans into the trope of the moment makes 'Black Ops 4' the franchise's most honest title to date.", "url": "https://www.wired.com/story/call-of-duty-black-ops-4-review/", "urlToImage": "https://media.wired.com/photos/5bc7b4936278de2d212348df/191:100/pass/COD-BlackOps4-FA.jpg", "publishedAt": "2018-10-18T12:00:00Z", "content": "Blackout, Call of Duty: Black Ops 4 's new game mode, begins the same way all battle-royale sequences do. You fly over a remote warscapethis time, in a series-appropriate attack helicopterand drop in, bristling with fear and aggression. What follows is by now… [+4358 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Joe Ray", "title": "The Noma Guide to Fermentation: A Cure for Kitchen Boredom", "description": "A new cookbook from the chefs at the famed Copenhagen restaurant explores all things pickled, cured, brined, and fermented.", "url": "https://www.wired.com/story/noma-guide-to-fermentation-book-review/", "urlToImage": "https://media.wired.com/photos/5bc8f78c91b99b2d21c6f8e0/191:100/pass/nomacookbook.jpg", "publishedAt": "2018-10-19T16:56:09Z", "content": "Occasionally, when shredding cabbage to make sauerkraut, I wonder, of all vegetables, why this one? Don't get me wronglittle makes me happier than a late-night snack of beer, cheddar, crackers, and kraut, but the popularity of the lowly cabbage for fermenting… [+9486 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "WIRED Autocomplete Interviews: Season 1", "title": "WIRED Autocomplete Interviews - The Try Guys Answer the Web's Most Searched Questions", "description": "Keith, Ned, Zach, and Eugene of The Try Guys take the WIRED Autocomplete Interview and answer the internet's most searched questions about The Try Guys and themselves. Are The Try Guys still at BuzzFeed? Are they all really friends? Do they all live in LA? Th…", "url": "http://video.wired.com/watch/the-try-guys-answer-the-web-s-most-searched-questions", "urlToImage": "http://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill,d_placeholder_thescene.jpg,fl_progressive,g_face,h_450,q_80,w_800/v1539965436/wired_the-try-guys-answer-the-web-s-most-searched-questions.jpg", "publishedAt": "2018-10-19T16:10:00Z", "content": "1 World Trade Center, New York, NY 10007 Tel (212) 286-2860 © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy (updated 5/25/18). You… [+237 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Angela Watercutter", "title": "NCT 127 Answers All of the Internet's Questions About K-Pop", "description": "WIRED asked the group to answer a series of questions from Twitter.", "url": "https://www.wired.com/story/nct-127-k-pop-primer/", "urlToImage": "https://media.wired.com/photos/5bc7a1e5f8a2e62d0bd5c5cd/191:100/pass/NCT-FA.jpg", "publishedAt": "2018-10-18T16:17:40Z", "content": "By now, you probably know what K-pop is. (Real quick if you dont: Its a genre of super sugary, upbeat pop music from South Korea.) But while the genre has been around since the mid-1990s, its seen a massive uptick in popularity stateside thanks, in part, to t… [+1044 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Tech Support : Season 1", "title": "Tech Support - NCT 127 Answer K-Pop Questions From Twitter", "description": "NCT 127 use the power of Twitter to answer some common questions about K-pop. Does a K-pop star have to be from Korea? Why are some K-pop groups so large? Do K-pop bands have opening acts? Taeil, Johnny, Taeyong, Yuta, Doyoung, Jaehyun, Winwin, Jungwoo, Mark,…", "url": "http://video.wired.com/watch/nct-127-answer-k-pop-questions-from-twitter", "urlToImage": "http://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill,d_placeholder_thescene.jpg,fl_progressive,g_face,h_450,q_80,w_800/v1539874415/wired_nct-127-answer-k-pop-questions-from-twitter.jpg", "publishedAt": "2018-10-18T16:00:00Z", "content": null}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jack Stewart", "title": "Tesla’s New 'Mid-Range' Model 3 Is the iPhone XR of Cars", "description": "Elon Musk's unexpected version of the Model 3 will offer 260 miles of range for around $45,000, and carves out a new niche in an expanding product line.", "url": "https://www.wired.com/story/tesla-mid-range-model-3-apple-iphone-xr/", "urlToImage": "https://media.wired.com/photos/5bc920fdf0a2b52cdedc1c99/191:100/pass/TeslaModel3-1044494382.jpg", "publishedAt": "2018-10-19T23:19:13Z", "content": "Whatever you think of Elon Musk, it's fair to say he doesn't run a typical car company, and the idiosyncrasies go beyond the electric powertrains and hulking center screens. Tesla's approach to building and selling automobiles looks rather like that of its Si… [+5494 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jack Stewart", "title": "Continental's 'Invisible' Car Pillars Nix the Safety-Visibility Tradeoff", "description": "Thick pillars are good in crashes but bad for driver's lines of sight. Continental wants to make them disappear.", "url": "https://www.wired.com/story/continental-invisible-a-pillar/", "urlToImage": "https://media.wired.com/photos/5bd263269f47f46d0140e98e/191:100/pass/Car-Visibility-802763822.jpg", "publishedAt": "2018-10-26T11:00:00Z", "content": "Cars that don't mangle their occupants when they crash are good. Cars that make it easy for their drivers to see their surroundings are good. So it's too bad that one of the best ways to deliver on the former gets in the way of the latter. Recent decades of s… [+3811 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Brendan Koerner", "title": "The Feds Just Hit Notorious Swatter Tyler Barriss With 46 New Charges. He Intends to Plead Guilty", "description": "Prosecutors in California have filed 46 new counts against Tyler Barriss for bomb threats, fraud, and swatting incidents nationwide. He’s angling to get the case transferred to Kansas and intends to plead guilty.", "url": "https://www.wired.com/story/feds-hit-notorious-swatter-tyler-barriss-with-46-new-charges/", "urlToImage": "https://media.wired.com/photos/5bd1f096dc9f582b9e25a8eb/191:100/pass/Back-Channel_Tyler-Barriss_2.jpg", "publishedAt": "2018-10-25T16:53:57Z", "content": "Three days after last Christmas, a 25-year-old Los Angeles man named Tyler Barriss allegedly called police in Wichita, Kansas, and pretended that hed murdered his father and was holding hostages in a house near the citys downtown. Barriss thought the house be… [+5146 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Eric Adams", "title": "Step Inside the Air Force's Sound-Swallowing Anechoic Chamber", "description": "The 30-foot cube is at the center of the the Air Force Research Laboratory’s Battlespace Acoustics Branch's efforts to help soldiers, sailors, and air crews focus on what matters, when it matters.", "url": "https://www.wired.com/story/air-force-anechoic-chamber-acoustic-study/", "urlToImage": "https://media.wired.com/photos/5bd254502eea7906bba84c90/191:100/pass/ALF-012.jpg", "publishedAt": "2018-10-26T12:00:00Z", "content": "You know all about the heat of battle, but forget about temperature for a moment, and think about the sound. Battlefields are noisy places, and pilots and soldiers often struggle to filter out information and communication from the chaos of combat. Ideally, t… [+4674 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Peter Rubin", "title": "Meme It Up With 11 Sure-Fire Last-Minute Halloween Costumes", "description": "Forgot about that party? Uncreative in general? Never fear, let the internet be your guide.", "url": "https://www.wired.com/story/11-last-minute-halloween-meme-costumes/", "urlToImage": "https://media.wired.com/photos/5bd257b8b0c71179a8e94c8f/191:100/pass/meme_costumes-final.jpg", "publishedAt": "2018-10-26T13:00:00Z", "content": "According to Google's \"Frightgeist\" map of trending costumes, there's no way around it: it's gonna be a very Fortnite Halloween. From Miami up to Boston and Anchorage down to LA, the Epic Games title is dominating people's searches for holiday getups. (At lea… [+8307 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "How to Keep Lil Trick-or-Treaters Safe on Halloween Night", "description": "Glow sticks and retroreflectors can help your kids be seen on Halloween night. Here's how they work.", "url": "https://www.wired.com/story/how-trick-or-treaters-can-stay-visible-on-a-dark-and-spooooky-night/", "urlToImage": "https://media.wired.com/photos/5bd256405b66a763e54f0ae9/191:100/pass/glowsticks-181575040.jpg", "publishedAt": "2018-10-26T13:00:00Z", "content": "When I think of Halloween, I think of kids outside in the dark. Traditionally, this is the way it works. First, darkness makes everything just a little bit spookier and more Halloween-like. Second, the end of October used to be after the end of Daylight Savin… [+8647 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Robbie Gonzalez", "title": "Make Your Own Fake Blood With This Medically Inspired Recipe", "description": "To make realistic fake blood for Halloween, it helps to understand why actual blood looks and flows the way it does.", "url": "https://www.wired.com/story/water-flour-syrup-dye-mastering-the-elements-of-fake-blood/", "urlToImage": "https://media.wired.com/photos/5bd262b92eea7906bba84c94/191:100/pass/bloodyhand-1036615756.jpg", "publishedAt": "2018-10-26T12:00:00Z", "content": "The internet is oozing (dripping? spurting?) with recipes for fake blood, but to get the exact color and consistency your Halloween costume calls forbe it bright and wet or dark and crustyyour best bet is to brew your own bloody concoction. To do it, it helps… [+4103 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Klint Finley", "title": "California Will Pause Net Neutrality Law for Federal Suit", "description": "The delay could stretch into years, while a lawsuit challenging the FCC's order repealing net neutrality rules is resolved.", "url": "https://www.wired.com/story/california-will-pause-net-neutrality-law-for-federal-suit/", "urlToImage": "https://media.wired.com/photos/5bd37b6147d18c4c60798e05/191:100/pass/statesenate-173856764.jpg", "publishedAt": "2018-10-26T20:54:02Z", "content": "Last month California passed the country's strongest net neutrality law. But will be a while before it takes effect. The same evening Governor Jerry Brown signed the bill into law, the US Department of Justice filed suit to block it. On Friday, California Att… [+2324 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jason Parham", "title": "Liner Notes: Toro Y Moi's 'Freelance' Is Built Like a Disco Software Stack", "description": "Yes, that’s a good thing. A very good thing.", "url": "https://www.wired.com/story/liner-notes-toro-y-moi-freelance/", "urlToImage": "https://media.wired.com/photos/5bd0da7d6623400e6f91ad96/191:100/pass/Toro-Y-Moi-474205294.jpg", "publishedAt": "2018-10-26T17:58:29Z", "content": "For one to understand the song \"Freelance,\" a curious and thrilling disco proposition from Chaz Bearthe soul, sweat, and engine behind the recording outfit Toro Y Moiit's best to think of it as a stack. The song is a sum assembled of intricate strata, a swirl… [+3290 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Emily Dreyfuss", "title": "The Best Halloween Shows and Movies for Little Kids You Can Stream Right Now", "description": "The Best Halloween Shows and Movies for Little Kids You Can Stream Right Now wired.com", "url": "https://www.wired.com/story/halloween-kids-movies-streaming/", "urlToImage": "https://media.wired.com/photos/5bd2aa328a1c2974955b2b48/191:100/pass/Culture-HalloweenKidsMovies-GEJDB5-w.jpg", "publishedAt": "2018-10-26T19:01:35Z", "content": "The people most excited about Halloween are little kids. For humans aged between 2.5 and 10 years old, theres really nothing better. They get to dress up and go outat night! and strangers give them candy. There are leaf piles to jump in and fake skeletons to … [+5657 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jean Guerrero", "title": "My Father Says He’s a ‘Targeted Individual.’ Maybe We All Are", "description": "My dad is one of thousands who believe the government is subjecting them to mind control. As a daughter and a journalist, I felt a duty to investigate his claims. Have these individuals been America’s prophets all along?", "url": "https://www.wired.com/story/my-father-says-hes-a-targeted-individual-maybe-we-all-are/", "urlToImage": "https://media.wired.com/photos/5bcf9c633f2aa02cb7a4edb2/191:100/pass/Targeted_Final.jpg", "publishedAt": "2018-10-25T11:00:00Z", "content": "I was 11 when my father destroyed the condominium where he was living. Searching for hidden transistors or other devices that might be beaming voices into his skull, he took a hammer to the walls, shoved his fists into the holes, and pulled off chunks of plas… [+37738 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Adrienne So", "title": "11 Halloween Picks to Make Trick-or-Treating Fun for Parents", "description": "Your kids can’t go on their yearly pilgrimage to the shrine of Hershey alone. We can help.", "url": "https://www.wired.com/gallery/trick-or-treat-gear", "urlToImage": null, "publishedAt": "2018-10-25T11:00:00Z", "content": null}, {"source": {"id": "wired", "name": "Wired"}, "author": "David Hayes", "title": "Trump's Attacks on the Environment Are Mostly Failing", "description": "The administration's attempts to remove environmental regulations have made very little headway—though that may soon change.", "url": "https://www.wired.com/story/trumps-attacks-on-the-environment-are-mostly-failing/", "urlToImage": "https://media.wired.com/photos/5bd1056f2ea0831210624c33/191:100/pass/trump_featured-1051985706.jpg", "publishedAt": "2018-10-25T13:00:00Z", "content": "This story originally appeared on Slate and is part of the Climate Desk collaboration. It is a popular fiction that despite its many foibles, the Trump administration has been successful in dismantling environmental regulations. Given the sheer number of atta… [+9753 chars]"}]}