{"id": "Private Equity Controls the Gatekeepers of American Democracy", "paragraph": "Millions of Americans will cast votes in Tuesday’s midterm elections, some on machines that experts say use outdated software or are vulnerable to hacking. If there are glitches or some races are too close to call — or evidence emerges of more meddling attempts by Russia — voters may wake up on Wednesday and wonder: Can we trust the outcome?Meet, then, the gatekeepers of American democracy: Three obscure, private equity-backed companies control an estimated $300 million U.S. voting-machine industry. Though most of their revenue comes from taxpayers, and they play an indispensable role in determining the balance of power in America, the companies largely function in secret.Devices made by Election Systems & Software LLC, Dominion Voting Systems and Hart InterCivic Inc. will process about nine of every ten ballots next week. Each of the companies is privately held and at least partially controlled by private equity firms.Beyond that, little is known about how they operate or to whom they answer. They don’t disclose financial results and aren’t subject to federal regulation. While the companies say their technology is secure and up-to-date, security experts for years have raised concerns that older, sometimes poorly engineered, equipment can jeopardize the integrity of elections and, more importantly, erode public trust.“We have more federal regulation of ballpoint pens and Magic Markers than our voting infrastructure,” said Lawrence Norden, deputy director of the Brennan Center’s Democracy Program at New York University School of Law. “There’s no national system, and the result is that states are largely forced to buy from these companies.”The U.S. Constitution assigns responsibility for elections to the states, which often task counties or even towns to conduct elections and set equipment standards. As a result, voting-machine companies cater to a market of about 10,000 jurisdictions ranging in size from more than 4 million voters in Los Angeles County to fewer than 500 in some rural areas. As many as 19 vendors divided the market in the early 2000s, according to John R. Patrick, who wrote the 2016 book “Election Attitude: How Internet Voting Leads to a Stronger Democracy.”That changed after the controversial victory of George W. Bush over Al Gore in the 2000 presidential election. Congress in 2002 passed the Help America Vote Act and doled out more than $3 billion to states to upgrade machines and train poll workers. Once the funds dried up, the industry began consolidating. Now, the three companies cover about 92 percent of voters, according to research by the Penn Wharton Public Policy Initiative at the University of Pennsylvania.ES&S, the largest, was founded in 1979 and says it controls about 60 percent of the market. Private equity firm McCarthy Group invested in ES&S about a decade later and took a majority stake in 2011. Both are based in Omaha, Nebraska.Dominion, founded in Canada, became one of the largest equipment makers in 2010 through a couple of acquisitions, including a subsidiary of Diebold Inc. Rival ES&S purchased the Diebold unit in 2009 but was forced to sell it following a Justice Department antitrust ruling. This year, Staple Street Capital, a New York-based middle-market private equity firm, and Dominion’s management team bought it out.Hart InterCivic, based in Austin, Texas, was formed about a century ago as a ballot-printing business. In 2011, Miami-based private equity firm HIG Capital, founded by alumni of Bain & Co. and Blackstone Group LP, made what it called a “strategic investment” in the company, without disclosing the size of its stake.HIG was criticized in 2012 after reports revealed the firm and its principals, including managing director Jeff Bohl, who was also a Hart board member, had donated generously to Mitt Romney’s presidential campaign. At the time, Hart denied “any suggestions that the company might try to influence the outcome of election results.” Since 2012, the majority of HIG employees’ donations have gone to Democrats, according to the Center for Responsive Politics.HIG and Staple Street didn’t respond to requests for comment. McCarthy declined to comment and referred questions to ES&S, whose spokeswoman, Teresa Paulsen, said in an email: “All ES&S equipment goes through extensive federal and state certification processes, and the company invests significantly in research and development to advance security.”Criticism of poorly functioning equipment surfaced this week, with Texas voters complaining that Hart machines weren’t accurately recording their choices in the heated battle between Republican Senator Ted Cruz and his Democratic challenger, U.S. Representative Beto O’Rourke. The Texas Secretary of State’s office told the Texas Tribune this wasn’t a malfunction but the result of voters making selections before the machines’ screens had time to finish rendering. Hart said on its website that it “proudly stands behind” its voting systems. In a statement, Rolando Pablos, the secretary of state, cautioned against a “disturbing trend where misinformation” could discourage voters from casting ballots.A nationwide overhaul of equipment isn’t likely to happen soon. States have spent most of the money Congress allocated in 2002. There’s also scant competition from outsiders. Technology giants like Microsoft Corp. and Dell Inc. have steered clear of the industry. And the Election Assistance Commission, the independent federal agency Congress created in the HAVA legislation to certify voting machines, lacks authority to force states to adopt its standards.It’s not that voters don’t care. Only about half believe the nation’s elections are “fair and open,” according to a July poll by Ipsos and the University of Virginia Center for Politics. But many aren’t familiar with the workings of the technology undergirding the system or tend to forget about the issue as soon as elections are over, said the Brennan Center’s Norden.The market’s limited size can discourage voting-machine companies from investing in new systems, said Matthew Caulfield, one of the Penn report’s authors. Some accuse private equity firms of loading up portfolio companies with debt and slashing costs to increase margins. But because closely held ES&S, Dominion and Hart don’t disclose financial results, it’s not possible to tell what, if any, role their private-equity owners have played in financial decisions. The companies haven’t issued any debt, according to data compiled by Bloomberg.It’s unclear what allure voting-equipment makers have to private equity. But it’s an obvious signal that “these companies are either very profitable or have the potential to be very profitable,” Patrick said."}