{"id": "Project Stream Makes Google a Player in the Video Game Industry", "paragraph": "This video game shouldn’t run so smoothly.I’m playing Assassin’s Creed Odyssey on a laptop that sometimes struggles to stream Netflix, but the laptop is operating without any hitches, like I’m on a top-of-line PC.I then switch to playing Assassin’s Creed Odyssey on a Chromebook, a laptop that wasn’t designed to ever play video games. The game works just as well.Neither computer comes close to the recommended PC specifications for Odyssey, a graphics-intensive role-playing game that’s expected to be among this year’s biggest sellers. But, the game technically isn’t running on these devices. It’s being delivered via Google’s Project Stream, a game streaming service opened for testing earlier this month that lets gamers play new titles at their maximum graphics settings on devices that normally couldn’t power them. And, as a result, it’s a problem-free experience, regardless of the device used.Google hasn’t yet disclosed an official debut date for Project Stream. And it hasn’t talked about the price. For an idea, Sony’s PlayStation Now game streaming service costs $20 per month to access a library of 650 games, but the company could just as easily charge for individual games.Project Stream lets Google dip its toes in the computer and console gaming without having to create any gaming hardware. Doing so would be expensive and take a lot of time.Still, Google acknowledged the difficulty of building a video game streaming system that can handle, potentially, millions of users simultaneously chasing after monsters and firing blasters. “The idea of streaming such graphically-rich content that requires near-instant interaction between the game controller and the graphics on the screen poses a number of challenges,” said Catherine Hsiao, product manager for Project Stream, said in a blog post announcing the service. “When streaming TV or movies, consumers are comfortable with a few seconds of buffering at the start, but streaming high-quality games requires latency measured in milliseconds, with no graphic degradation.”Many video game insiders consider game streaming to be the future. With streaming, games are run in the cloud, which means that the data-heavy graphics processing (and other computer-intensive tasks) is handled on a company’s server—and not on players’ PCs, tablets, phones or TVs. And while streaming is fairly typical for watching films and TV programs at home, the interactive nature of games (and the historically laggy quality of most Internet connections) has, until recently, made it impractical for video games.Today, Internet speeds are faster and connections more reliable. Streaming technology, meanwhile, has improved. Theoretically, any device with a screen can now be a high-end gaming machine, offering sharp graphics and crisp gameplay.As a result, Sony has already premiered a game streaming service for PlayStation 4 owners. Meanwhile, video game publisher Electronic Arts is working on its own rival while Microsoft plans public trials of its streaming technology next year.It’s a race to be the “Netflix of video games,” but so far, video game companies are the chief competitors. With Project Stream, Google, a company without much gaming pedigree, has quickly become a contender.Project Stream isn’t perfect. It’s bandwidth dependent, meaning if your Internet speeds fluctuate too much, gameplay will suffer. For example, if the Internet connection drops below 25 megabits per second, video game players risk seeing some pixelation on their screens—but that rarely happened to me. Also, at present, Project Stream doesn’t work on mobile devices, including tablets.With Google’s cloud service, games that players save carry over from device to device, so they can easily pick up where they left off. It’s a service that democratizes gaming, letting people experience a game at its highest levels of detail without having to shell out $1,000 or more for a top-tier gaming PC. And Project Stream offers proof of concept to doubters who have been skeptical about whether games would be compatible with streaming.One of the things working in Project Stream’s favor is that it doesn’t require players to download an app or do anything beyond opening a new tab in Google Chrome. (And as of September, that browser had a 62.5% hold on the market, according to Net MarketShare.) Testers and, eventually, subscribers to Project Stream, can be up and playing in seconds as long as their connections are fast enough (every time users fire up the game, the technology quickly checks).Because it’s still being tested, Project Stream isn’t available to everyone. Google welcomes new testers, but they must apply (and be over 17 years old, since Assassin’s Creed: Odyssey, currently the only game being tested, is an M-rated game for mature users only). The Project Stream test will run through mid-January, after which (presumably) saved games will be deleted and players will likely no longer be able to explore Assassin’s Creed: Odyssey’s ancient Greece setting and carry out missions.Google certainly has enough cloud capacity to be a major competitor in video game streaming. Its Google Cloud Platform is one of the top five cloud businesses, serving mainly corporate customers. And it has relationships with video game publishers via its Android mobile division, meaning game makers are more willing to work with it on new projects.Those relationships aren’t as strong as the ones most publishers have with Microsoft or Sony. However, many publishers and online services are rushing to embrace game streaming. Of course, not everyone will succeed. As a result, publishers are willing to work with a wider variety of corporate partners than they have historically.“We believe we’re uniquely positioned to deliver a core subscription of interactive content, by virtue of the depth and breadth of our portfolio,” says Andrew Wilson, CEO of Electronic Arts. “That doesn’t mean we can’t work with Sony and Microsoft and Nintendo and Apple [and Google] with the delivery of [our titles] in the same way I watch Netflix.”What’s critical for game makers is that they still have a direct relationship with people who play their games. Whether the title is played on Project Stream, Microsoft’s Project xCloud or PlayStation Now, video game publishers want to be able to gather data directly from users and be able to tailor games to them individually. To ensure that, players of Assassin’s Creed: Odyssey on Project Stream must first create or log into an account with its publisher, Ubisoft, which maintains customer loyalty and lets the company communicate directly with its customers.“We will see many players coming and trying to do a Netflix like option,” says Yves Guillemot, CEO of Ubisoft. “But I believe there will be lots of services with lots of different types of games. Things are changing often. … What is key is being able to have contact with your player and give them the experience they want.”"}