{"id": "Wanda Ferragamo, Who Built Fashion Giant From Shoes, Dies at 96", "paragraph": "Wanda Ferragamo, who turned her husband’s Italian shoe company into a luxury-goods empire and fulfilled his dream of dressing the customer from head to toe after taking over the business more than 50 years ago, has died. She was 96.She died Friday, according to a person close to Salvatore Ferragamo SpA.The widow of Salvatore Ferragamo, who produced custom-made shoes for actresses such as Audrey Hepburn, Greta Garbo and Marilyn Monroe, lacked any business experience when she took on the running of her husband’s company after he died in 1960.Twenty-four years his junior, she expanded the Ferragamo brand into clothing, perfume, handbags, leather goods, watches and eyewear. Helped by her six children, who have led various divisions, Wanda Ferragamo was at the helm of the Florence-based company for five decades, longer than her husband was after founding it in 1927.“I didn’t think about myself at all — whether I was capable or not,” she said, according to a 2007 interview in Time magazine. “I just went at it with such energy, such goodwill.”The matriarch who headed one of Italy’s most successful family-run companies inherited a business that had about 350 patents and created 20,000 shoe designs, according to Vogue magazine. It pioneered the platform shoe, the steel-reinforced stilettos worn by Monroe in the “The Seven Year Itch” and the suede ballerina flat with ankle straps that Hepburn wore in “Sabrina,” movies released in the 1950s. Celebrities such as Madonna and Charlize Theron became clients under Wanda Ferragamo’s leadership.From the 13th-century palace purchased by her husband as a company headquarters in 1938, she introduced handbags in 1965, menswear in the 1970s and eyewear in the 1990s, according to the company’s website. She also opened single-brand boutiques on New York’s Fifth Avenue and in other cities including Hong Kong, Shanghai, Seoul, Mexico City and Mumbai. A joint venture to sell perfume with Bulgari SpA, now part of Paris-based LVMH Moet Hennessy Louis Vuitton SE, began in 1997. For her contributions to the industry, Wanda Ferragamo received Italy’s highest honor, the Cavaliere di Gran Croce, in 2004.At age 90, she continued to work at her office because “it’s the place where I feel closest to my late husband,” she said in a 2011 interview with Germany’s Die Zeit newspaper. In the same year, the company held an initial public offering, selling its shares on the Milan Stock Exchange.The company had about 4,000 employees and revenue of 1.4 billion euros ($1.6 billion) in its last fiscal year.Wanda Miletti was born Dec. 18, 1921, in Bonito, an Italian village about 129 kilometers (80 miles) east of Naples. Her father was a doctor and the town’s mayor. Her mother died when Wanda was 16.In 1940, at age 18, she met Salvatore Ferragamo when he visited Bonito, his home village, after he had donated money for development projects there. After meeting Wanda, he said, “This girl is going to be my wife,” according to the interview in Die Zeit. They married five months later.The Ferragamos raised their children — who now run the company — in “Il Palagio,” a 30-room villa in Fiesole, near Florence, according to a 1983 story in People magazine.Fiamma Ferragamo, who died in 1998, created the Gancino metal clasp that became the design signature of the company. Ferruccio Ferragamo is chairman; Giovanna Ferragamo is vice chairman; Leonardo Ferragamo manages its investments; Massimo Ferragamo handles U.S. distribution; and Fulvia Ferragamo ran the silk-accessories division until her death in April 2018.In 1995, Wanda Ferragamo opened a museum inside the company’s headquarters as a tribute to her husband. She wrote her autobiography, “Stepping Into the Dream” (2008), co-authored with Jay Mulvaney.“Everything that we do here is always in reverence to him,” she said in the interview with Die Zeit, referring to her husband. “I learned a lot from Salvatore.”"}