{"id": "raceAhead: An Ally For Civil Rights In Birmingham, Alabama", "paragraph": "Since we’re talking about allyship so much these days, (mostly by popular demand, a hopeful sign) I want to share a short video with you that doubles as a master class in speaking up and out.Charles Morgan, Jr. was a young white attorney living in Birmingham Alabama when four little black girls were murdered after a bomb planted by the Klan exploded while they were attending services at the 16th Street Baptist Church. It was Sept 15, 1963.The city had become known by many black residents as “Bombingham” for the constant attacks on their struggles for civil and voting rights, attacks which were entirely unpoliced by the all-white and anti-black police force. In the aftermath of the bombing, the business community and local press fretted about the reputation of the city, blaming “other people” for the terrorism experienced by black people.The following Monday morning, Morgan addressed a white businessman’s club in Birmingham, and delivered a speech that asked a powerful question: Who was to blame for the attacks?Four little girls were killed in Birmingham yesterday. A mad, remorseful, worried community asks, who did it? Who threw that bomb? The answer should be we all did it. Every last one of us is condemned for that crime, and the bombing before it and the ones last month, last year, a decade ago, we all did it.It’s every little individual who talks about the niggers and spreads the seeds of his hate to his neighbor and his son. The jokester, the crude oaf whose racial jokes rock the party with laughter. Every governor who shouted for lawlessness and became a law violator. Courts that move ever so slowly and newspapers that timorously defend the law. It’s all the Christians and the ministers who spoke too late in anguished cries against violence.It goes on for several more minutes and is worth every second of your time. Morgan’s words were a direct affront to the audience, no doubt. But he also described the specific cruelty of Jim Crow and paints a picture that is all-too-familiar today.Birmingham is a city where four little Negro girls can be born into a second-class school system, lead a segregated life, ghettoed into their own little neighborhoods, restricted to Negro churches, destined to ride in Negro ambulances to Negro wards, while local papers on their front and editorial pages call for order and then exclude their names from obituary columns. And who is really guilty?The speech earned him death threats instead of applause. Largely shunned, he moved to Atlanta where his trailblazing work continued to shape the civil rights landscape. He sued to desegregate his alma mater, the University of Alabama; he successfully challenged segregated prisons and juries. In 1969 he forced an election in one county in Alabama that led to the election of six black local officials. Later on, as an ACLU lawyer, he represented both Muhammad Ali in his bid to avoid being drafted in the Vietnam War and Julian Bond after he’d been denied his seat in the Georgia legislature. He died in 2009.It’s not hard to imagine what Morgan would be saying today, but here’s one guess—It wouldn’t include thoughts and prayers. Many thanks to Princeton professor, historian, author and online friend Kevin M. Kruse for flagging this story. Kruse does double duty on Twitter as a debunker of annoying racist myths in history, and he’s an unflagging ally. Be sure to follow him—unless you’re a fan of Dinesh D’Souza.)  \n\n\nAll you gotta do is tell them you’re going to bring the dogs. Look at em run. I want to see the dogs work.\n\n- Eugene 'Bull' Connor, Commissioner of Public Safety, Birmingham, Alabama\n\n"}