{"id": "Two to Tango: Parsing Trump's Argentine Dinner Date with Xi", "paragraph": "Global stock markets were whipsawed this week by conflicting signals from the White House about President Trump’s offer to host a dinner with Chinese president Xi Jinping after this month’s Group of 20 summit in Argentina. Trump inspired a burst of euphoria among investors Thursday morning by tweeting that he had just concluded a “long and very good conversation” with Xi and that discussions with China were “moving along nicely.” Later in the day, his economic adviser Larry Kudlow stoked optimism by telling reporters there may be a “thaw” between the US and China on trade.There was a moment of uncertainty Thursday afternoon, when US attorney Jeff Sessions unveiled the latest of a series of charges of Chinese theft of US trade secrets. But at a rally in Missouri that night, Trump remained upbeat. The Chinese “want to make a deal,” he declared, adding: “Lots of great things are going to happen over the next short period of time. It’s going to work out good.”Word of the G20 meeting, combined with Trump’s upbeat comments and a Bloomberg report late Thursday suggesting White House officials already are drafting terms of a US-China trade deal, spurred a sharp surge in Asian stock markets Friday (Thursday night US time), which spilled over into a 200 point gain in the Dow Jones Industrial average Friday morning. Trump took to the White House lawn and seemed to bless the rally. “We’ve had very good discussions with China,” he told reporters. “We are much closer to doing something.”And then, on Friday afternoon, the White House spin cycle lurched into reverse. Kudlow appeared on CNBC and pooh-poohed talk of a trade breakthrough. “There’s no massive movement to deal with China,” he said. The administration is doing “normal, routine preparation” for Trump’s meeting with Xi. The Dow surrendered the morning’s gains and ended the day down more than 100 points.What’s really going on? Cynics say Trump is trying to talk up the stock market ahead of this week’s midterm elections. Vanity Fair suggests that Kudlow, wittingly or not, had “blown up” Trump’s midterm Hail Mary. True or not, the outcome of those elections will alter the power dynamics when Trump and Xi meet next. If, as many analysts predict, the election produces a “blue wave” that overturns the Republicans’ House majority, will Trump decide its time for a China truce? Or will he simply double down?More China news below.ceo_attribution author=”Clay Chandler” email=”clay.chandler@timeinc.com” twitter=”claychandler”]The ol’ one-… On Tuesday the U.S. slapped sanctions on Fujian Jinhua, a Chinese chip maker, alleging that the company posed a threat to U.S. security. The sanctions require U.S. firms to request permission before exporting components to the company, with the assumption permission will be denied. The prohibition could be a death sentence for Jinhua. Beijing rebuked Washington’s ‘security concerns’, accusing the U.S. of fabricating an excuse to tackle China’s nascent semiconductor industry – a sector vital to Xi Jinping’s vision of Chinese tech dominance. Reuters…two. On Thursday, the Justice Department charged Fujian Jinhua and its Taiwanese business partner with theft of trade secrets, following accusations made by Micron Technologies. Announcing the indictment, Attorney General Jeff Sessions accused Chinese actors of repeated economic espionage and declared, “We’re not going to take it anymore.” FortuneSplit BRICS. Jair Bolsonaro, Brazil’s newly-elected populist president, has been vocal in his opposition to China – earning him the nickname “Tropical Trump”. During his campaign Bolsonaro quipped, “China isn’t buying in Brazil, China is buying Brazil,” and promised stronger relations with the U.S. Chinese investment in Brazil hit $25 billion in 2017, a seven-year high, and China remains Brazil’s largest trading partner. Over on South America’s west coast, Chile is strengthening ties with China, this week pledging to join the Belt and Road Initiative. InkstoneTesla rival in retreat. Cash-strapped Faraday Future, the U.S.-based electric car company founded by Chinese entrepreneur Jia Yueting, has furloughed the majority of its staff, retaining fewer than 100 members on minimum wage. A number of top executives have also resigned, including the last remaining founding members, Dag Reckhorn and Nick Sampson. The turmoil is the result of a $2 billion financing deal turned sour, inked with property developer China Evergrande. Jia Yueting was blacklisted by the Chinese government for debt defaults in 2017, and last month had his shares in self-founded entertainment platform LeShi frozen. The VergeFollow that car! As California granted Waymo permission to test its first fully-autonomous cars, Guangzhou began piloting China’s first autonomous taxi service, Baiyun Taxi, servicing the roadways of Guangzhou University Town (a district home to a cluster of university campuses). Meanwhile Volvo tapped Baidu’s Apollo platform to develop AVs, a day after Ford partnered with Baidu to begin testing AVs in Beijing. ReutersAbuse on Apple’s watch. Apple is investigating claims from a labor-rights group that one of its suppliers in Chongqing is using illegal student labor to manufacture Apple Watches. The group claims it found students between the ages of 16 to 19 were being forced to work at the factory through compulsory internships, a practice which violates both Chinese labor laws and Apple’s own standards. CNNWell, the mayor of Taipei just dropped a trap music video RADIILocal’s recall Kanye West’s year in China SCMP China’s five steps for recruiting spies WIRED American tech firms are winning the R&D spending race with China WSJFive-year-old boy’s 15-page CV grabs China online attention BBCAlibaba feels the pinch from China’s slowing economic growth NYTThe guest list giving a glimpse of Xi Jinping’s thinking about China’s economic future SCMP“The biggest story in Chinese politics”. There’s no word yet on when a meeting of the Communist Party’s Central Committee is going to take place. The meeting should convene this month. Analysts say its delay reveals discord in Party ranks, with members lacking consensus on how China should face growing headwinds. In September, Deng Xiaoping’s son delivered a speech urging China to “keep a sober mind” and “know its place”, advocating a return to his father’s ‘hide and bide’ approach. That contrasts Xi Jinping’s vocal promotion of China as a world leader – a stance that has been walked back in light of the trade war. South China Morning PostSpy games. Tuesday, the Justice Department unsealed an indictment against ten Chinese spies it accused of conspiring to steal aerospace secrets from American and European companies. The indictment was made in 2017. The U.S. has ramped up its pursuit of Chinese spies this year, making an arrest in January, another in September and extraditing a suspect from Belgium last month. The Washington PostThe greater firewall. China is “once again the worst abuser of internet freedom” according to a report from watchdog Freedom House. The report also alleges that China is exporting its model of internet censorship. Freedom House claims China has hosted instructional seminars on censorship for foreign media officials and highlights how Chinese companies have exported sophisticated surveillance tech to countries with poor human rights records. TIMEWill it work? China passed new legislation permitting the trade of tiger bones and rhino horns for use in Chinese medicine, weakening previous regulations that outright banned the trade. The new rules permit the use of rhino and tiger samples harvested from farmed animals. Chinese media argue that the new exceptions will help tackle black market trading but wildlife conservationists fear it will encourage poaching. AFP This edition of CEO Daily was edited by Eamon Barrett. Find previous editions here, and sign up for other Fortune newsletters here."}