{"id": "In Florida Senate Recount Lawsuit, Judge Says No Sign of Vote Fraud by Election Officials", "paragraph": "A judge hearing a lawsuit over the Florida Senate recount already underway said there was no evidence that election officials or workers had engaged in misconduct, and denied a request for an injunction to impound ballots and voting machines while not in use in Broward and Palm Beach counties. Democratic voters predominate in those counties.At last report, Florida Governor Rick Scott remains ahead of current U.S. Senator Bill Nelson by about 12,500 votes or 0.15% of votes cast.The judge encouraged lawyers from both parties to propose a joint plan to deal with voting integrity beyond measures already in place. Attorneys agreed to have three sheriff’s deputies from Broward County present in election offices when the recount wasn’t underway, and who would report only to the sheriff, not to the embattled elections supervisor, Brenda Snipes. The judge approved.The county’s canvassing board chair told CBS Miami that security is already tight. “Nobody is able to move about in these areas without proper documentation, period. They have not presented anything to suggest that someone got into this area and somehow had access to manipulate anything,” he said.During an emergency hearing held in a nearly empty courthouse closed for Veterans Day, Circuit Chief Judge Jack Tuter said to lawyers for both candidates, “I am urging, due to high public nature of this case, to ramp down the rhetoric,” according to several reporters present at the hearing, including CBS Miami.Scott said on Fox News on Nov. 11, “Senator Nelson is clearly trying to commit fraud to try to win this election.” Last week, Scott—referring to attorneys hired by Nelson’s campaign—said, “No rag-tag group of liberal activists or lawyers from D.C. will be allowed to steal this election from the voters in the State of Florida.”Scott has presented no evidence of fraud so far. The governor ordered the Florida Department of Law Enforcement to investigate. A spokesperson on Nov. 9 said the request wasn’t made formally, and no allegations of fraud had been forwarded. A spokesperson told Politico, “We spoke with the Department of State and they indicated they had no criminal allegations of fraud.”Florida Attorney General, Republican Pam Bondi, reiterated a request for the FDLE to investigate. In a Nov. 11 letter, Bondi said she was “deeply troubled” that the law-enforcement agency wasn’t investigating “clearly documented irregularities.” Bondi’s letter listed “reports” of problems without citing their provenance, and provided no specific details.Following Scott’s earliest statements alleging “rampant fraud” on Nov. 8, Nelson’s spokesperson said, “The goal here is to see that all the votes in Florida are counted and counted accurately. Rick Scott’s action appears to be politically motivated and borne out of desperation.”On Nov. 11, the Florida Democratic Party said in a statement that Scott was “doing his best to impersonate Latin American dictators who have overthrown Democracies [sic] in Venezuela and Cuba.”The margin of Scott’s lead is small enough that it triggered a statewide recount, along with two other races, one for governor and one for a state office. This marks the first time Florida has had to recount votes statewide, with all three happening simultaneously. The deadline for the recount is Thursday, Nov. 15. Palm Beach County’s elections supervisor said on Nov. 11 she may be unable to meet that deadline. (In the 2000 George W. Bush/Al Gore election, only votes cast in certain counties were recounted.)An automatic count is underway for those three races in which ballots are rescanned in most counties; a few that rely on digital-only voting recheck results, and have a paper audit trail in case of errors. If the lead remains below 0.25%, state law requires a manual recount. However, in Florida that only includes checking ballots that when scanned record no vote for a candidate or ballot measure in a given race (an “undercount”), or that mark multiple choices (an “overcount”)."}