{"id": "More Than 20,000 Google Employees Participated in Walkout Over Sexual Harassment Policy", "paragraph": "More than 20,000 employees and contractors walked out of Google’s offices around the world Thursday, Nov. 1, organizers said. The group is protesting sexual harassment, misconduct, lack of transparency, and a non-inclusive workplace culture.The walkout included Google offices in 50 cities, where employees walked out at 11:10 a.m. local time, according to a Medium post from organizers. The numbers of walkout participants makes up about 20% of Google’s total employees based on Alphabet’s third-quarter earnings report, and the numbers may even go up, as nine offices haven’t yet given figures for the protest and more Google offices in Europe have walkouts planned.The #GoogleWalkout movement started after the New York Times reported Google paid Android co-founder Andy Rubin $90 million after it learned of a sexual misconduct allegation against him. Rubin left the company with that money and the praise of the parent company, and Google never revealed the allegations against him.In light of the report, Google employees are demanding an end to forced arbitration for issues of sexual harassment and discrimination, a commitment to end pay and opportunity inequality, a publicly-released transparency report regarding sexual harassment at the company, an inclusive and clear sexual misconduct reporting process, the appointment of a Google employee representative to the board of directors, and to elevate the status of chief diversity officer, allowing the position to answer to the CEO and make recommendations to the board of directors. The group has also brought attention to the lack of racial and ethnic diversity and low retention rates among underrepresented groups.Google executives reportedly told the organizers that Google CEO Sundar Pichai will meet with his leadership team Monday to review a plan to address the organizers’ demands, according to the Medium post. Pichai has not pushed back against the walkout writing in an email to staff ahead of the planned event, that “human resources would make sure managers are aware of the activities planned for Thursday and that you have the support you need.”“I understand the anger and disappointment that many of you feel,” Pichai continued in the email. “I feel it as well, and I am fully committed to making progress on an issue that has persisted for far too long in our society…and, yes, here at Google, too.”Fortune reached out to Google for a comment, but did not receive an immediate reply.“We have the eyes of many companies looking at us,” Google employee Tanuja Gupta was quoted saying in the post. “We’ve always been a vanguard company, so if we don’t lead the way, nobody else will.”"}