{"id": "Divers Spot Main Wreckage of Crashed Indonesian Lion Air Jet", "paragraph": "Indonesian divers found the main wreckage of the Lion Air plane that crashed into the Java Sea, a breakthrough in a week-long search for victims and the cockpit voice recorder that holds the key to unraveling the reason for the accident.Divers who have been scouring a 270-square-mile area since the jet crashed on Oct. 29 spotted the Boeing 737 Max 8 jet’s fuselage on Saturday, M. Syaugi, the chief of the National Search and Rescue Agency, told reporters in Jakarta on Saturday. The search crew is focused on retrieving the wreckage now, he said.“We have made major breakthroughs as we have recovered two turbines, one wheel,” Syaugi said. “There are reports of team members seeing the body of the plane.”Indonesian search crews have recovered a flight data recorder, both the engines, a part of the landing gear, body parts of victims and personal belongings since Lion Air flight JT610 carrying 189 people plunged into the sea.Ping locators also picked a faint signal from possibly the cockpit voice recorder, Syaugi said. A diver, who was volunteering in the search operations, died on Friday, he said.The plane nosed downward so abruptly that it may have hit speeds of 600 miles per hour or more before slamming into the sea, according to three experts who made calculations based on preliminary flight-tracking data.It dived with little or no turns and its nose was pointed about 45 degrees below the horizon shortly before the impact, an unusually steep dive for an airliner, according to the analysis of data provided by flight-tracking company FlightRadar24.The plane’s speed will eventually be confirmed by the recovered flight-data recorder, which has not yet been analyzed. Indonesian officials haven’t released any specific details about the aircraft’s track or speed. The crash occurred shortly after the plane took off on a flight from Jakarta to Pangkalpinang.FlightRadar24’s data, which was captured from the plane’s radio transmissions, suggests that the jet was moving at about 630 mph (1,014 kilometers) per hour moments before it hit the Java Sea.The estimate was first computed by Scott Dunham, a former National Transportation Safety Board investigator, who combined the distance the plane traveled horizontally and vertically to arrive at a speed estimate. Dunham, who participated in the 2003 investigation into the destruction of the space shuttle Columbia and dozens of aircraft accident inquiries, conducted the analysis at the request of Bloomberg News.Using a slightly different method, John Hansman, a Massachusetts Institute of Technology aeronautics and astronautics professor, estimated the plane was flying at 540 mph in the final moments before the FlightRadar24 system lost track of it.The high-speed descent — which Hansman said would have made items and passengers on the plane weightless or perhaps even in negative gravity — offers a new insight into the final moments of the crash. Yet it doesn’t provide a clear answer about why the plane went down.“They were just diving at the ground,” Hansman said.A third expert, Jasenka Rakas, a lecturer in engineering and aviation at the University of California at Berkeley, conducted her own analysis of the data and concluded the speed could have been between 586 and 633 mph.FlightRadar24’s raw data suggests that the jetliner was descending at about 350 mph. That figure represented the speed at which the plane was losing altitude and didn’t represent the higher speed at which it was slicing through the air as it angled downward.Dunham, Hansman and Rakas cautioned that the estimates yielded only approximate speeds.However, the estimated speeds were consistent with what would happen when a 737 with its engines running was pointed sharply downward and began accelerating. It was also what would be expected based on the small sample of highly damaged aircraft debris that has been found in the water near where the crash occurred, they said.“If the nose went over pretty heavy and it was still under power, it would pick up a lot of speed,” Dunham said.The accident investigation is being led by Indonesia’s National Transportation Safety Committee. The agency is being assisted by representatives from the NTSB, Boeing as well as the U.S. Federal Aviation Administration.A crash-proof recorder containing data on how the plane functioned and its speed and trajectory has been recovered. Its contents haven’t yet been read out.The pilots on the flight the night before the early-morning crash had reported problems with sensors that calculate altitude and airspeed, an airline spokesman said Wednesday.During the roughly 11 minutes of flight tracked by FlightRadar24, the plane frequently changed altitudes and speeds. While none of those changes were so abrupt they would cause a safety hazard, it suggests that the pilots were struggling to control the plane. Jetliners flying on autopilot are far more consistent.The FlightRadar24 data includes GPS positions, altitude, time and the speed it would have been traveling horizontally across the Earth’s surface. In the final 1.6 seconds before the jet’s track disappeared, 425 feet above the water, it lost 1,025 feet of altitude."}