{"id": "Northern California Officially Has the World’s Worst Air Quality, as Its Fires Continue to Rage", "paragraph": "San Francisco and other cities in Northern California have some of the worst air quality in the world as smoke from the deadly and destructive Camp Fire enshrouds the region with toxic smoke.Air quality conditions in the Bay Area went from “dangerous” to “very dangerous” in San Francisco, Oakland, and other cities Thursday. On Friday, conditions grew even worse, with some readings moving from “very dangerous” to “hazardous”—the EPA’s most severe category of air quality, which triggers “a health warning of emergency conditions.”According to the Bay Area Air Quality Management District, San Francisco’s air quality index stood at 271 Friday afternoon. Another resource, the World Air Quality Index—which draws on data from California’s Air Resources board, put the San Francisco index at 291. Still another, AirVisual, had an air-quality reading of 351 for San Francisco.Other cities in Northern California had even worse air quality readings. Sacramento had an air-quality reading as high as 448 early Friday. Tracy, a city in central California south of the fires, had an air-quality index of 447. Chico, a city near the Camp Fire, registered a 547 reading Friday afternoon, according to the World Air Quality Index. All readings are considered “hazardous.”By any measure, the region’s air was some of the most polluted in the world Friday. While each country measures air quality independently, some global maps track air quality around the world. Delhi and Beijing, two cities with frequently high air-quality indexes, had readings of 179 and 101, respectively. The AirVisual app ranked San Francisco as the global metropolis with the worst air, followed by Lahore, Pakistan, and Delhi.The smoke is being carried by winds from the Camp Fire in Butte County, now the deadliest and most destructive fire in California history. The wildfire has injured at least three firefighters and burned more than 10,000 structures since it began on Thursday, Nov. 8. At least 56 deaths have been reported and 130 people are still unaccounted for.Residents are encouraged to stay indoors and use a respirator mask if venturing outside. Many businesses and consumers have been buying air purifiers to clean toxic particles out of the air, although some of them were selling out in Bay Area stores as well as on Amazon."}