{"id": "You Can Dress Up Your Chickens for Halloween, Just Wash Your Hands, Says CDC", "paragraph": "You can dress up your chicken for Halloween. But please do so carefully to avoid spreading disease, according to the Centers for Disease Control.The CDC advises washing your hands after handling chickens in order to control the spread of salmonella, which can be found on chicken’s bodies and in their droppings—even if the animal isn’t sick. The CDC warns that those who have contact with just the coops or water dishes can contract the illness.A report by the Louisiana news station KNOE earlier this month said the CDC had advised against costuming your pet chickens, but the agency released a statement Thursday saying it’s okay with dressing chickens in Halloween costumes, as long as you’re careful.“Despite news reports to the contrary, the Centers for Disease Control and Prevention (CDC) has not warned people against dressing chickens in Halloween costumes,” the CDC said.The advised statement matches the sentiment of chicken owner Stephanie Morse, who told KNOE, “It’s just about hand hygiene.”“After you touch them, when you go inside make sure you just wash your hands, and you watch where you step,” she told the news station.The CDC’s page for chicken owners says to always wash your hands after handling poultry or anything in their living area, and specifically don’t “kiss your birds or snuggle them and then touch your face or mouth.”The CDC also warns that children under five years-old should not handle chickens at all, as their immune systems are still developing, making them more susceptible to disease. Chickens should remain outdoors, and owners should not eat or drink where their chickens reside.The organization released a notice last week stating that 92 people in 29 states have already been infected with an antibiotic-resistant strain of salmonella due to contact with raw chicken. Twenty-one people have been hospitalized, with no deaths reported.Correction: an earlier version of this article incorrectly said the CDC had warned against dressing chickens in costumes. "}