{"id": "How Apple Wants to Duplicate Its iPhone Success With Higher Prices For iPads and Computers", "paragraph": "As Apple rolled out updated products at its event in New York on Tuesday, analysts quickly noticed a pattern. New versions of the company’s iPad Pro, Mac mini, and MacBook Air all had impressively improved features—along with higher prices than what they replaced.The new entry-level iPad Pro got a larger screen, faster processor, and lost its home button in favor of Apple’s high security facial recognition login system, Face ID. But its starting price jumped to $799 from its predecessor, which cost $599.Likewise, the revamped MacBook Air got speedier and comes with a higher resolution screen than what it replaced, circa 2015. But the new laptop starts at $1,199 versus $999 for the older model, which Apple will continue to sell at that price—at least for now.Finally, the long-neglected Mac mini desktop computer, which comes without a keyboard, screen, or mouse, got a refresh, with its price jumping from $799 for the starter version from $499.In all three cases, Apple may argue that the better specs and features for the updated devices are worth the higher prices. For example, the new entry-level Mac mini comes with 8 GB of RAM and a speedy SSD hard drive compared to 4 GB of RAM and an old-fashioned spinning hard drive on the older model, which debuted in 2014.But tech companies always improve specs when they update products, often without raising prices.Some analysts expected that customers would continue to buy the higher-priced products, lifting Apple’s revenues at a time when overall tech gear sales are stagnant. “While the event provided little surprise, we come away impressed with the offerings and ongoing shift toward offering more content at a higher price point,” CFRA Research analyst Angelo Zino wrote after the event wrapped up.That’s what happened with the iPhone last year, when Apple introduced the $999 iPhone X and raised prices on other new models. Although Apple didn’t sell more iPhones in late 2017 and early 2018 than it did a year earlier, the higher average sales prices led to a 14% jump in revenue.Last month, Apple followed the same strategy, raising the price of the cheapest new iPhone model, the iPhone XR, to $749 from last year’s iPhone 8, which started at a price of $699 in 2017.Apple investors appeared to be taking a wait and see approach. Many features of the new products—though not the price hikes—had been leaked in advance of the event. Apple’s (aapl) stock, which has gained 27% so far this year, mostly unchanged at midday after the event."}