{"id": "How Elon Musk Is Winning Over the Tesla Shorts", "paragraph": "Even before Tesla wowed investors Wednesday with its first significant quarterly profit—$312 million—Wall Street could sense a change in the tides.First, Tesla had suddenly announced Monday that it would report third-quarter earnings this week, instead of in early November as it usually does. The rush seemed out of character for a company that as recently as August was the most shorted stock in America, and whose CEO, Elon Musk, expressed his distaste for earnings calls by berating analysts and then trying to take Tesla private.The hurry, analysts figured, could only mean one thing: Tesla’s earnings would be good, really good, and Musk didn’t want to wait to release them. “Does anybody think that Tesla decided to move up its earnings release date because of bad news?” wrote Andrew Left of Citron Research, a notorious short-seller, in a report published Tuesday.It was a remarkable reversal for Left, who had been loudly shorting—or betting against—Tesla stock for more than two-and-half-years, until this week, when he declared in the report that he was now long Tesla stock. “Plain and simple, Tesla is destroying the competition,” Left wrote. “Like a magic trick, while everyone is focused on Elon smoking weed, he is quietly smoking the whole automotive industry.”In a letter to investors Wednesday, Musk—who has publicly raged against short-sellers—offered concrete metrics of Tesla’s success.The Model 3, which short-sellers warned would bankrupt Tesla, is now helping to drive its profitability, following through on Musk’s promise to turn a profit starting this quarter and every quarter after that.Now, not only is Tesla’s Model 3 the best-selling electric car on the market, it’s the single best-selling car in America, period, by dollar sales. With Tesla producing 4,300 of the car each week, on average, the Model 3’s gross profit margin has climbed above 20%, and Tesla’s overall automotive gross margin is nearly 26%—not far from the holy grail of 30% that Left and other investors dream of.Tesla’s stock rose 12% in after-hours trading following its earnings report.Before the third quarter quarter, Tesla had only turned a profit twice since it went public—once in 2016, when it netted $30 million, and once in 2013, when it generated just more than $11 million in net income.Its $312 million profit in the third quarter is a big swing from the prior quarter, when it lost almost $718 million. From here, investors expect Tesla’s profit to grow exponentially: $112 million in 2019, which stands to be its first profitable year, a gain that is expected to balloon 1055% in 2020, to roughly $1.3 billion.Profitability also puts Tesla’s price-to-earnings ratio—a popular stock valuation metric—in the realm of Earth. While Tesla’s PE was impossible to calculate as long as it was losing money—you can’t divide by a negative number—it’s now trading at about 94 times its expected earnings in 2019. While that’s still extremely high (and several times the average PE ratio for the S&P 500), it’s not so far above the valuations of other high-growth tech stocks. Take Netflix, for example, which trades at 115 times estimated 2018 earnings, and 73 times 2019 earnings. Amazon’s PE, meanwhile, is 96 for this year’s expected earnings and 67 for 2019.Now all Musk has to do is prove that Tesla deserves investors’ newfound bullishness."}