{"id": "Trump Says Stock Market Taking 'A Little Pause' Before Midterms", "paragraph": "President Donald Trump attributed declines in leading U.S. stock indexes to “a little pause” as investors wait to see the results of the midterm elections.“If you want your Stocks to go down, I strongly suggest voting Democrat,” Trump tweeted Tuesday morning. “They like the Venezuela financial model, High Taxes & Open Borders!”The Stock Market is up massively since the Election, but is now taking a little pause – people want to see what happens with the Midterms. If you want your Stocks to go down, I strongly suggest voting Democrat. They like the Venezuela financial model, High Taxes & Open Borders!— Donald J. Trump (@realDonaldTrump) October 30, 2018Stocks fell on Monday after a Bloomberg News report that the administration would move forward with additional tariffs against China in in early December if Trump doesn’t make progress toward resolving its trade dispute during a meeting with Chinese President Xi Jinping. Markets have already been under pressure from concerns over rising interest rates and peak earnings growth. The S&P 500 and Nasdaq indexes are on track for the steepest monthly declines of the record-long bull market.A Democratic takeover of the House might actually be helpful for markets because gridlock “essentially removes the political factor from the market, allowing fundamentals like sales and earnings to do what they usually do,” Talley Leger, an equity strategist at OppenheimerFunds, said by phone.“If Washington is in gridlock, politicians can’t screw things up very much,” he said.In data going back to 1901, stocks have returned more when the government is divided than when it’s unified, according to a report by his firm.Trump previously blamed the Federal Reserve for stock declines, complaining after the central bank raised its benchmark policy rate three times this year, by a quarter-percentage point on each occasion. In an interview last week with the Wall Street Journal, Trump said he “maybe” regretted appointing Federal Reserve Chairman Jerome Powell.Trump said in the interview that Powell “almost looks like he’s happy raising interest rates” and that it’s “too early to tell, but maybe” he regrets appointing him.In his tweet Tuesday, Trump said markets were still “massively up” since his election.The Dow Jones Industrial Average is up more than 33 percent since Trump was elected, though the index has declined 1.12 percent since the beginning of the year.White House economic adviser Larry Kudlow has also argued that politics—rather than the president’s trade policies—are to blame for recent market losses. Earlier this month, he told reporters that stocks may be “gyrating” because investors were worried Democrats in Congress would overturn the president’s economic policies.“Businesses large, medium, and small do not want the tax cut overturned,” Kudlow said."}