{"id": "Here's What the 2018 New York City Marathon Runners Win This Year", "paragraph": "Thousands of runners took the streets Sunday, starting in Staten Island for the 48th TCS New York City Marathon, the world’s largest marathon race. With only 15% of the 100,000 applicants accepted, the NYC marathon, which has runners making their way through all five New York City boroughs, is extremely competitive and also offers some big prize money.U.S. runners who are members of the New York Road Runners pay a $255 entry fee. The cost is $295 for non-members, and $358 for foreign runners. First-place male and female winners of this year’s race will receive a $100,000 prize, with second-place winners taking home $60,000, and third-place winners taking home $40,000. There is a total of $825,000 in prize money.Mary Keitany of Kenya won the women’s race for the fourth time Sunday, while Lelisa Desisa of Ethiopia won the men’s division. Meanwhile, 20-year-old Daniel Romanchuk was the first to cross the finish line in this year’s men’s Wheelchair Division, with a time of 1:36:21. Romanchuk is also the youngest person to win in the marathon, ABC 7 NY reported.The first set of runners, athletes with physical disabilities, took off at 8:30 a.m. E.T., followed by the next wave of runners who started at 9:50 a.m., the third at 10:15 a.m., and the last group taking off at 11 a.m.The first ever race in 1970 had just 55 participants and has since grown to include 55,000 runners this Sunday morning, People reports. Participants include people raising money for charities, racers who qualified on time, or veteran marathon runners, according to Forbes.The four winners of last year’s race also put on their marathon shoes on Sunday morning, with Americans Shalane Flanagan—the first U.S. woman to win the New York marathon since Miki Gorman in 1977—and Kenyan Geoffrey Kamworor aiming to defend their titles, along with the Swiss pair Manuela Schar and Marcel Hug who previously won in the Wheelchair Division.“To be coming back as the defending champion, it’s quite an honor and literally a dream come true,” Flanagan—who ultimately took third place in Sunday’s women’s race—told ABC 7 NY."}