{"id": "California Permits Waymo to Test Driverless Autonomous Cars on Its Streets", "paragraph": "Waymo, the self-driving technology development firm owned by parent company Alphabet, now has the first permit in the state of California to test-drive its autonomous vehicles on public roads without a test driver present in the car, according to a company blog post.Waymo and other companies, including Uber, have been testing self-driving cars on public streets for a while now. The difference is that those cars have a human or two sitting in them, in case anything goes sideways in terms of public safety.The permit news comes at an odd juncture, as competing companies continue to vie for the ability to test self-driving cars on public streets. But there have been some recent measures to curb such advances in the Golden State. Earlier this year, Governor Jerry Brown signed Assembly Bill 87, which was introduced by California Assemblymember Phil Ting and gives law enforcement the authority to impound unpermitted autonomous vehicles (AVs), including those without drivers present in the cars.In California, the DMV has the right to interpret the law as it sees fit. Fortune has submitted a request to the state DMV through Governor Brown’s office in order to better understand the legality of Waymo’s permit.Waymo did not immediately respond to Fortune‘s request for further details about why the company was granted this permit.One reason autonomous vehicles have not been allowed to test on public roadways was highlighted, most recently, in a New Yorker story that detailed how, since California law changed in 2014 to since require companies to report instances in which self-driving vehicles are involved in collisions involving property damage or bodily harm, Google has reported 36 accidents in addition to previous collisions caused by the company’s self-driving cars.Uber’s self-driving cars have claimed at least one life in a fatal accident in March in Tempe, Arizona. A human was inside the car when it struck a pedestrian. The company settled with the deceased’s family.Waymo has already been testing driverless AVs, including taxis, in Phoenix. The company says it will begin its testing in California cities including Los Altos, Los Altos Hills, Palo Alto, Sunnyvale, and Mountain View, where Alphabet has its headquarters."}