{"id": "Your Guide to Winning the Economy Debate at Thanksgiving Dinner", "paragraph": "Family dinner debates are like candied yams: Nobody really enjoys them, but they’re inevitable at Thanksgiving.So if this year’s holiday discussion turns to the U.S. economy, we’ve got you covered. Whether your relatives want to talk about the job market as casual observers or parse Federal Reserve actions like super-nerds, we’ve prepared rebuttals for some of 2018’s most common platitudes.Home EconomicsYour relative says: I’ve read about the strong economy, but prices seem to climb relentlessly, while paychecks can’t keep up. You should’ve seen how much I paid for this turkey.Your response: Let’s talk wages. They’re heading modestly higher at long last, and they’re moving up faster than inflation right now. In fact, price-adjusted median household incomes have finally surpassed 1999 levels over the past two years after taking a major recession-era hit, based on a Census measure. Such gains may have been a long time coming, but they’re reaching the collective pysche: Consumers report feeling confident about their household financial futures across income levels, New York Fed survey data shows.While it’s true that prices are increasing at around 2 percent a year right now, economic policy makers aim for that kind of modest inflation. And as for tonight’s dinner, it’s gotten a little bit cheaper over the past year. Turkey deflation—it’s a thing.One relative says: President Donald Trump has shifted America’s economy into high gear.Another says: What are you talking about? His policies are irresponsible.Your response: Simmer down, you two. Growth has indeed moved higher, helped by tax cuts and higher spending caps. There are nascent signs of more capital investment—one of the main goals of the Trump tax cuts. But business spending cooled recently, and the fiscal sugar high is expected to start wearing off in 2019. So it’s unclear whether Trump’s policies will have lasting benefits. One thing is clear as annual budget deficits approach $1 trillion: They’re already leaving the country more indebted.Armchair ExpertYour relative says: The Federal Reserve is getting a little aggressive with these rate hikes.Your response: Have you seen the unemployment rate lately? It’s at its lowest level since Woodstock, and such a minuscule jobless rate is encouraging employers to raise wages. That’s a good thing, but the Fed wants to make sure that the economy doesn’t overheat, stoking excesses and rapid price gains down the road. Fed rate increases start to bite after a year or more, so policy makers are taking their foot off the gas now, so that they won’t have to slam on the brakes if inflation takes off.Your relative says: The Fed threw around a bunch of free money and should’ve lifted rates sooner.Your response: Show me the inflation. It undershot the Fed’s 2 percent goal for years, and even now, it’s only coming in right around that level on a core basis. Inflation expectations also remain a little on the low side. If the Fed had lifted rates aggressively and early, it might’ve made it harder for it to nudge prices up. Higher prices may sound bad, but if gains are too slow, the country risks deflation and it’s harder for employers to raise wages.Your relative says: The booming stock market proves the U.S. is on the right track.Your response: Equities did see a nice Trump bump, but stocks aren’t necessarily a great indicator of long-term economic activity. The bond market might offer better evidence of sustainably faster growth. And it’s not too optimistic. The fixed-income market’s relatively flat yield curve suggests an expectation that today’s solid economy isn’t on the cusp of an extended boom.Deep NerdYour relative says: The federal funds rate is going to rise above the upper limit on its target range, if the Fed’s Jay Powell isn’t careful.Your response: He’s a man with a plan. Many economists expect the Fed to make another technical adjustment when officials meet in December to keep the funds rate trading within its target range. It does open a question, though: Is reserve scarcity driving the change, and if so, does that mean balance sheet runoff will have to stop earlier than planned? Fed officials don’t think so, but it’s a story to watch in 2019.Your relative says: Quantitative easing didn’t work.Your response: OK, gloves off. The central banking community remains divided on the efficacy of America’s three bond-buying programs after the financial crisis. While “QE did work, and here’s the proof” studies have become a genre of economic research unto itself, at the end of the day, it’s hard to prove a counterfactual. What we do know is that the economy recovered, that interest rates were weighted down and that the Fed plans to keep bond-buying in its toolkit for the next recession."}