{"id": "Uber Wants to Lead the Way on Tracking Sexual Assault and Harassment", "paragraph": "Bringing people together in the real world comes with risk—and Uber wants to be a leader in tracking and understanding the sexual harassment and assault that happens in those spaces.The ridesharing company on Monday debuted what it’s calling a “taxonomy” of sexual offenses an Uber driver or passenger could commit during a ride, which the company aims to use to better track crimes and offenses that occur on its watch. The taxonomy is the first of its kind, according to the National Sexual Violence Resource Center, which developed the system in conjunction with the Urban Institute using Uber data. The organization says creating such a taxonomy is a crucial step because sexual harassment and assault are drastically underreported and are often misunderstood, with no one set of terms or language that means the same thing to everybody.“If we can improve the safety of our platform for women, we can improve it for everybody,” said Uber chief legal officer Tony West.Taking the lead on this initiative is a bold move for Uber, which is still emerging from a period of reckoning over sexual harassment—both on its platform and in the company itself. In perhaps the highest profile incident, an Uber executive once reportedly obtained the medical records of a passenger who said she was raped by an Uber driver in India in an attempt to discredit her claim.Uber also pledged to release a report next year sharing what it found after implementing this system—and the company knows improving reporting mechanisms will likely lead the documented rates of sexual assault and harassment in Uber rides to increase.“We are going to see the metrics go up for a while. But that needs to be understood as building trust in the system. Reporting going up will be a sign that we’re building a system that people trust,” said Tina Tchen, former chief of staff to First Lady Michelle Obama and a leader of TIME’S UP, who advised Uber on this effort. “It’s not the kind of metric that companies are usually going for.”Uber’s taxonomy covers offenses from “staring or leering” to rape. Those categorizations aren’t for Uber’s customers, however; rather than selecting the offense they experienced from, say, a drop-down menu, Uber riders or drivers can report an incident in their own words, and this system will help Uber track whats going on, respond to the incident appropriately, and direct the person to the correct resources. Uber will use machine learning to figure out what type of behavior is being reported, and customer service representatives specially trained in trauma responses will reach out to the customer.It’s a system Uber hopes other companies whose customers and workers interact in the real world—like Airbnb, hotels, and restaurants—eventually adopt. The categorization system has been released publicly in the Uber/NSRVC report in the hopes that it might become something of an open source tool.“With this complex and novel effort, our goal was to develop a set of categorizations that could be used to understand various levels of reported inappropriate conduct at scale ,” West and National Sexual Violence Resource Center chief public affairs officer Kristen Houser wrote in a Medium post. “We also wanted to create a methodology that could be used by other companies providing services that put people together in the real world, and to provide them with a uniform lexicon that would enable them to apply consistent categories to a complex set of misbehaviors.”Uber also hopes that by sharing its efforts on rider and driver safety, its users will know that the company has developed a complex system to respond to these cases and feel comfortable reporting any bad behavior to the company."}