{"id": "The Biggest Shift of the Midterms Wasn’t in Congress—It Was in the States", "paragraph": "Buried beneath the headlines of midterm elections that were all about blue gains in the House and the red hold over the Senate, a major story broke that has escaped much notice. In statehouses across the country, the 2018 elections brought an unequivocal shift to the left. There was no split decision in the states—Democrats gained ground, from Nevada to Wisconsin, from Kansas to Maine.Democratic wins did not come on a massive scale, but the solid and consistent blue trend across the states will have an impact for years to come. Democrats took control of six chambers, seizing the senates of Colorado, Connecticut, New Hampshire, and Maine, and winning control of the Minnesota and New Hampshire houses. Republicans lost four chambers. Democrats also gained seven governorships, capturing Nevada, New Mexico, Kansas, Illinois, Wisconsin, Michigan, and Maine, while losing one in Alaska.This reversed a significant shift to the right in 2016. After Donald Trump’s historic win, Republicans controlled both the governor’s seat and the legislature in 25 states, while Democrats had unified control of only eight states. In the wake of the 2018 midterms, Democrats have come much closer to leveling the playing field, controlling 14 states to the Republicans Party’s 21.For both parties, these results will reverberate for a long time. Even though state governments sometimes escape notice beneath the layers of American government, their decisions are vital to both the key policy issues of today and political battlegrounds of tomorrow.According to exit polls, the single most important issue to voters was health care. The fight to pass and then to repeal Obamacare has dominated national politics for nearly a decade. But state governments have wielded power over how and where the health care law will be put into practice. When the Supreme Court upheld the Affordable Care Act’s basic constitutionality in 2012, it overturned the provision that required states to expand their Medicaid programs dramatically.Blue states eagerly widened their health care safety nets, but many red states did not. Using their control of statehouses to voice their strong opposition to the national law, Republicans have prevented the adoption of Obamacare’s Medicaid expansion in 14 states. State politics matter when it comes to the most controversial issue in American politics right now.State governments and local school boards also wield control over the perennially important issue of education. While federal authorities can incentivize and punish state education departments by dangling or withholding grants, schools are really run at the state and local level. Governors and legislators have decided which states have adopted the national Common Core standards, which are friendly to charter schools, and whether public school students can receive vouchers to attend private schools. On the issue that matters most for many families, what counts the most is who runs a statehouse, rather than who sits in Congress.Lastly, but most critical to the contours of American politics over the next decade, states literally draw the battle lines of our roughest political fights. The power to redistrict resides in the states. A redistricting plan—the map of lines that defines districts in both state legislatures and for Congress—is a bill written by most of the 50 state legislatures. Although some states draw their plans through commissions, in most capitals, legislators and the governor must agree on a map.Until these midterms, Republicans held a huge advantage by controlling so many more state governments. With the authority to draw district lines, they held significant power to determine their destiny when redistricting comes to the states after the 2020 census. Now, unless the 2020 elections bring another rightward shift, Democrats will control redistricting in at least a third of states.The stakes of the congressional elections that have dominated the news this week are undeniably huge. But so too are the stakes in the states. In Washington, D.C., the Democratic joy over retaking the House was tempered by losses in the Senate. In state capitals across the country, a consistently blue wave put Democrats back in power in many of the chambers and governors’ seats that play such a crucial, if quiet, role in American politics.Thad Kousser is the chair of the Department of Political Science at UC San Diego and the co-editor of Politics in the American States. "}