{"id": "California Fires: Poor Air Quality Postpones 'Big Game' Between Cal and Stanford", "paragraph": "Fans of the annual Big Game between Stanford University and UC Berkeley (aka Cal), the San Francisco Bay Area’s biggest football rivalry, will have to wait a few weeks for the rivalry’s next installment. The game is being postponed for the first time in 55 years due to poor air quality from California’s fires, according to the San Francisco Chronicle. Citing health concerns for student-athletes, staff, and fans, Cal athletic officials announced the decision on Friday. Cal was set to host the 121st Big Game in Berkeley on Saturday, but has instead moved the showdown to noon on Dec. 1.Cal athletic officials said in a statement that they had intended to wait until Saturday to make a decision, but forecasting along with results from the Bay Area Air Quality Index indicated that conditions are unlikely to improve enough to safely hold the game.Cal said it consulted NCAA and Pac-12 air quality guidelines and stayed in close contact with Stanford throughout the decision-making process. Tickets purchased for the Nov. 17 game will be honored on Dec. 1.Over the past week, the Camp Fire has torn through 141,000 acres and caused 63 deaths, though more than 600 are still missing. Along with the fatalities, the flames have destroyed nearly 6,500 residences. In the wake of the destruction, the blaze has created some of the unhealthiest air on the planet.“First and foremost our thoughts are with everyone who has been affected by the tragic California wildfires,” Cal head coach Justin Wilcox said in the satement. “While we realize the importance of the Big Game, right now our thoughts are centered around so many who have been so deeply affected. Our primary factors in making the decision to postpone the game were centered around the health and safety of our student-athletes, fans, and everyone involved in putting on the game. We look forward to seeing you in Berkeley on December 1.”Area high school football games were also postponed because of the air quality."}