{"id": "Is Vaping a Way to Quit Smoking? Or Just a Slippery Slope", "paragraph": "As cigarette smoking declines worldwide, tobacco companies increasingly have turned to a new product line to make up for lost revenue: vaping products. Using an e-cigarette, vapers get a hit of stimulating nicotine without resorting to an incinerated stick of tobacco. These products are marketed as less risky alternatives to cigarettes, and some studies show they are, although there isn’t enough long-term data to make a definitive conclusion. Also, they may not be harmless, and some research suggests they lead young users to try traditional cigarettes.Consequently, vaping has provoked one of the most robust debates among public-health specialists in years. Some are pushing for curbs where they don’t already exist, out of safety concerns and fear the popularity of the devices will slow gains in the war on smoking. Others see vaping products as a valuable tool to help smokers quit, and thus as a means for accelerating that fight.Declaring that the U.S. was experiencing an epidemic of teen vaping, the nation’s Food and Drug Administration warned in September that it was considering tightening regulations on e-cigarettes. Officials said vaping among high-schoolers rose 75 percent from 2017 to 2018, according to preliminary data. That meant that about 20 percent of the students were indulging. A single product accounts for much of the boom: the Juul e-cigarette. Created by two product designers who were ex-smokers, the Juul is sleek, so it looks cool, and it’s tiny, enabling the young user to palm it and discreetly take a hit when a teacher (or parent) isn’t looking. And, like many other vaping devices, its refills come in tasty flavors such as mango and mint. The FDA is considering prohibiting flavorings, which, except for menthol, are forbidden in regular cigarettes. In 2017, the agency said it wanted to ensure an industry with the potential to reduce smoking wasn’t stymied by regulation. But in the face of the youth vaping explosion, it gave e-cigarette makers until early November to either face new rules or convince the agency they would combat use of their products by those under 18, who can’t legally buy them. Of about 80 countries that regulate e-cigarettes, 27 — including Brazil, Greece, Saudi Arabia, Turkey and Thailand — ban their sale altogether. Worldwide, the market for vaping products was estimated at about $14 billion in 2017 and is growing rapidly.A Chinese pharmacist and smoker named Hon Lik gets credit for developing the e-cigarette in 2003. It appeared in the U.S. and Europe by 2006. Today, vaping products take many forms and deliver varying levels of nicotine, an alkaloid present in tobacco that is addictive. Early versions looked like regular cigarettes or were housed in sleek, metallic tubes. More recent models are more like fat pens. The Juul resembles a USB flash drive. Inside an e-cigarette, a battery heats nicotine liquid. The puffer inhales nicotine and exhales aerosol. There’s no burning tobacco and thus no smoke or tar. A related line of products, so-called heat-not-burn devices, contain tobacco that’s heated to significantly less than the temperature at which a regular cigarette combusts.The evidence so far suggests that vaping is a safer choice than lighting up. A 2016 scientific paper examining 22 studies concluded that exclusive use of vaping devices produces just 5 percent of the mortality risks associated with smoking. Even if the products help people stop smoking, one concern is that they’ll never give up vaping and so would have been better off quitting another way. Another worry: As the practice becomes increasingly normalized, it will attract more people who never would have smoked. A 2018 review of 800 studies conducted by the U.S. National Academies of Sciences, Engineering and Medicine found “no evidence whether or not e-cigarette use is associated with long-term health effects,” but the practice is too new for there to be significant data. It’s plausible, yet not proven, that e-cigarette aerosols can damage tissue and cause disease, including cancer. The effects on humans of nicotine are not well-studied, although adolescents appear to be particularly vulnerable to it, with some evidence suggesting it can harm brain development. The National Academies’ review found substantial evidence that young vapers are more likely than non-vapers to try regular cigarettes. However, a review of studies commissioned by Public Health England concluded that it hasn’t been established that they become regular smokers."}