{"id": "U.S. Charges Russian for Conspiracy to Interfere in Elections", "paragraph": "A Russian national was charged by the U.S. for allegedly being one of the masterminds behind a conspiracy to interfere in both the 2016 and 2018 elections, marking the first charges related to next month’s congressional midterm vote.The woman, identified as Elena Alekseevna Khusyaynova of St. Petersburg, Russia, allegedly served as the chief accountant for an operation known as “Project Lakhta,” the Justice Department said Friday in a statement. The department identified the operation as “a Russian umbrella effort funded by Russian oligarch Yevgeniy Viktorovich Prigozhin and two companies he controls, Concord Management and Consulting, and Concord Catering.”The charges come as top U.S. law enforcement and intelligence agencies warn Americans about ongoing efforts by Russia, China and other foreign actors to interfere in the 2018 midterm and 2020 presidential elections.The charges announced on Friday centered on a conspiracy that included the creation of thousands of social media and email accounts that appeared to be run by U.S. persons as part of what the conspirators referred to as “information warfare against the United States.”Referring to Khusyaynova, the Justice Department said, “The financial documents she controlled include detailed expenses for activities in the United States, such as expenditures for activists, advertisements on social media platforms, registration of domain names, the purchase of proxy servers, and promoting news postings on social network.”The case appears to be an outgrowth of a larger case filed by Special Counsel Robert Mueller in February, accusing Prigozhin and others of interfering in the 2016 election by pushing divisive social media campaigns that attacked Democratic candidate Hillary Clinton.In that case, Mueller’s office cited examples of Russians who adopted online personas and used Twitter and Facebook posts to sow doubts about Clinton, urge voters to support Green Party candidate Jill Stein and galvanize support for then-candidate Donald Trump.Concord Management and Consulting is fighting Mueller’s earlier charges in court. The company’s U.S. lawyer, Eric Dubelier of Reed Smith, won a significant legal point this week when the presiding judge ordered Mueller’s prosecutors to justify the charges they’d brought against Concord.Of all the legal challenges that have been filed against Mueller so far by other defendants in his Russia probe, Concord’s attack on the special counsel’s charges is the first that appears to have a realistic chance of succeeding.The new charges on Friday say that Khusyaynova, 44, played a central financial management role, in a conspiracy to conduct “information warfare against the United States,” the Justice Department said. The conspiracy, which had a proposed operating budget of more than $35 million, “continues to this day,” according to the statement.“This effort was not only designed to spread distrust towards candidates for U.S. political office and the U.S. political system in general, but also to defraud the United States by impeding the lawful functions of government agencies in administering relevant federal requirements,” according to the department.A criminal complaint against Khusyaynova does not include any allegation that the conspiracy had an effect on the outcome of a U.S. election. The complaint also does not allege that any American knowingly participated in the Project Lakhta operation."}