{"id": "The Latest Threat to Crypto Prices? The Federal Reserve", "paragraph": "Robert Leshner is an interest rates guy. He’s spent years predicting what rate the Federal Reserve will set and, more generally, what the future value of money should be.An economist by training, Leshner sees a problem with the cryptocurrency markets—namely, it doesn’t pay any interest. Unlike fiat currencies, no one will pay you to store your Bitcoin, Ethereum or other digital tokens.As Leshner explained on the latest episode of Balancing the Ledger (see video above), his response was to start a company called Compound, which lets cryptocurrency owners park their digital tokens in exchange for a rate of return.Compound, whose backers include Andreessen Horowitz and Coinbase Ventures, is currently listing only four lesser known tokens but plans to add others soon, including a so-called stable coin. Stable coins are cryptocurrencies pegged to the U.S. dollar on a 1-to-1 basis.In Leshner’s view, stable coins are a hot item right now because they are easy to create and crypto investors are eager to buy them. But he shrewdly points out that stable coins are also a great deal for those who issue them—the buyers are basically lending them money at zero interest, and often paying transaction fees to boot.No wonder, then, that more and more crypto companies are offering stable coins, including the Winkelvoss brothers’ Gemini Coin, and USD Coin, which is supported by Circle and Coinbase. Leshner predicts there may soon be more than 50 stable coins competing in the market—a situation reminiscent of U.S. money in the 19th century when dozens of banks offered their own version of the dollar.Could the Federal Reserve soon put a stop to this by issuing a digital version of the dollar— what many dub a Fed Coin? Leshner thinks this day is far off and, for now, we’re likely to see crypto companies offering token versions of more fiat currencies, which will in turn attract traders and arbitragers to the likes of Compound in search of interest.We asked Leshner if all of this really necessary, given that there is already an enormous and liquid market for currencies in existing foreign exchange market. He argues there are upsides to digital versions of fiat currencies, including their ability to interact with blockchain-based smart contracts.“The advantage of tokenization is it brings transparency and programability to currency,” he said. “When dollars are open to blockchain there’s so much more innovation that can occur. ”While he is optimistic about tokenized currencies, Leshner is skeptical of many cryptocurrencies, which he likens to vapor-ware. He also thinks that a series of interest rate hikes by the Federal Reserve will begin to weigh on the crypto markets.“We’ve always known crypto in an environment of essentially zero or low interest rates. And that’s an environment of easy and loose money where capital has been prolific and looking for returns wherever it was found,” he said. “We’re finally starting to enter an environment of rising interest rates which crypto has never seen before and it’s going to be potentially challenging to the price of a lot of crypto assets just like it will be for a lot assets in general, including equities.”In other words, Bitcoin and other blockchain-based currencies—which were invented in large part as a form of money outside of the existing financial system—may find themselves exposed to the decisions of the Federal Reserve in much the same way as other assets."}