{"id": "Senators Threaten to Regulate Facebook Unless It Makes Fixes", "paragraph": "Senators Chris Coons and Bob Corker warned Friday that Congress would impose new regulations to rein in Facebook Inc. unless the social-media company addresses concerns about privacy and the spread of misinformation on its platform.Speaking in a joint interview on the sidelines of a development forum in Wilmington, Delaware, the two senators said that Facebook probably wouldn’t like what Congress does, so it should come up with a solution first.“If they don’t, if they continue to act as if we couldn’t possibly deign to regulate them, they’ll get regulated and they’ll be unpleasantly surprised with how swiftly it may happen,” said Coons, a Delaware Democrat and member Senate Judiciary Committee. “I think they’ve got a lot of explaining to do.”Revelations about Facebook’s response to manipulation of their social network before and after the 2016 U.S. presidential election, and shifting accounts about breaches of users’ privacy, have battered the company’s reputation and fueled frustration on Capitol Hill. Coons said the company’s leaders should come back and testify before Congress.The latest controversy erupted after a report in the New York Times on Thursday suggested that Chief Executive Officer Mark Zuckerberg and Chief Operating Officer Sheryl Sandberg weren’t as involved with the serious issues facing the company as they should have been and instead were more concerned about defending Facebook’s reputation and embarking on an aggressive lobbying campaign to fend off critics.Zuckerberg testified at a Senate hearing in April, Sandberg in September.“They and others need to come together quickly and figure out how they’re going to deal with this issue or Congress will — and likely the outcome is not going to be particularly good,” said Corker, a Tennessee Republican who is retiring in a few weeks.Read More: Facebook Morale, Hurt by Share Drop, Suffers Another HitThe New York Times report also said that Facebook relied on a Republican public affairs firm that sought to deflect criticism by encouraging reporters to look into rivals like Google and to pursue stories about billionaire financier George Soros stoking an anti-Facebook backlash in Washington. A frequent target of right-wing and anti-Semitic commentators, the 88-year-old Soros has been a critic of Facebook, calling it a “menace” earlier this year.The two senators and other lawmakers released a letter they wrote to Facebook demanding that Zuckerberg respond to the New York Times and other news reports about its practices.Amy Klobuchar of Minnesota and Mark Warner of Virginia were also among those asking Zuckerberg to detail the extent to which Facebook may have collected and spread negative information about elected officials and other critics who were examining the company’s policies.“Both elected officials and the general public have rightfully questioned whether Facebook is capable of regulating its own conduct,” they wrote in the letter released Friday.Facebook issued a lengthy rebuttal to the New York Times article, denying that it asked a public relations firm to pay for or write articles on its behalf or that it pushed journalists to spread misinformation.In the interview, Coons said he expected Congress to come up with privacy rules comparable to the European Union’s General Data Protection Regulation. Rolled out this year, the GDPR forces companies to clearly state when they’re collecting personal data and ask for users’ consent.“I would prefer that the innovative private sector come forward first with a proposal for how they would handle data privacy and some of these very worrying technological developments and let us negotiate and work through it together,” Coons said."}