{"id": "Tesla's Stock Soars 15% After Blowout Earnings as Model 3 Deliveries Rise", "paragraph": "Tesla’s stock surged as much as 15% Wednesday, after posting earnings in the third quarter that blew away Wall Street’s profit forecasts as the company began selling the enough of its new Model 3 cars to push the company well into the black.Where the consensus of analysts called for a loss of 3 cents a share, Tesla posted a profit of $2.90 a share. A year ago, Tesla had posted a net loss of $3.70 a share as Tesla spent heavily to ramp up production of the Model 3. Those losses led Tesla bears, including many short sellers, to doubt the company’s ability to run a profitable business.Skeptics of Tesla had doubted CEO Elon Musk’s assurances that Tesla would become not only profitable in the second half of 2018 but also free cash flow positive. Investors look to free cash flow as a measure of a company’s ability to generate cash to finance its core operations rather than raising capital. Tesla’s free cash flow in the quarter was a positive $181 million after being negative for several quarters.The quarter marks only the third time in Tesla’s 15-year history that it has reported a profit and positive cash flow, according to Reuters. Musk had made a bold bet that sales of the Model 3, which offers many luxury features of the Models S and X but at a lower price, would more than offset the ambitious production line needed to manufacture the cars at scale. Musk has described the challenges of that task as “production hell.”Throughout the past year or so, Musk has also become increasingly vocal about investors shorting Tesla shares—that is, selling borrowed Tesla shares to buy them back at a profit should Tesla’s stock sink. Along the way, some of Musk’s behavior became erratic enough to worry its investors.When Musk tweeted he had found funding to take Tesla private, the SEC sued Musk for misleading investors. Musk settled with the SEC, but the episode caused Tesla’s stock to fall from $379 a share in early August to $250 this month. Bearish investors had added to their short positions in the week before Tesla earnings, but the stock ended up spiking on the company’s surprisingly strong results.Tesla delivered 56,065 Model 3 vehicles to customers during the quarter and 27,710 Model S and X vehicles. At the same time, Tesla’s capital spending was less than analysts were expecting, at $510 million. Tesla added to investors’ optimism by saying it expects to post another profit and to remain cash flow positive in the current quarter.One longtime skeptic of the company, Andrew Left of Citron Research, reversed his position on Tesla this week, saying in a blog post that “the Model 3 is a proven hit and many of the TSLA warning signs have proven not to be significant.” Left had shorted Tesla shares in recent years but now believes in the company. “Plain and simple—Tesla is destroying the competition,” he said.In an interview on Bloomberg TV, Left explained that his doubts about Tesla were driven in part by Musk’s controversial actions, but when he studied the underlying numbers, he decided the company was actually in good shape. “It’s amazing. Elon Musk has made such a sideshow of himself that people—including myself—started forgetting about the underlying business,” Left said, noting Tesla’s numbers showed in fact that it was “completely smoking the competition.”"}