{"id": "102 Million People in U.S. Have Pre-Existing Conditions, Study Says. Here's Why That Figure Is Suddenly Important", "paragraph": "More than 100 million Americans live with pre-existing conditions and are not enrolled in a public health insurance program such as Medicaid or Medicare. And with the 2018 midterm elections just weeks away, those numbers could signal how voters cast their ballots, with Congress debating whether or not to repeal of the Affordable Care Act.If the ACA, also known as Obamacare, is repealed, a total of 102 million individuals—not to mention their immediate families—could face higher health insurance premiums and significant out-of-pocket costs related to their medical care, according to a new study from national health care research and consulting firm Avalere.A pre-existing condition includes most major health conditions, including cardiovascular disease, diabetes, and obesity, as well as a variety of mental health conditions and even arthritis and pregnancy. If you think you have a pre-existing condition, well, you just might. It’s a sweeping categorization that—prior to the ACA’s passage—gave insurers cover to exclude individuals from health insurance coverage.“Protections for pre-existing conditions are the only reason some Americans are able to afford health insurance,” Avalere’s director Chris Sloan said in a statement.President Donald Trump tweeted about the issue on Wednesday, claiming that Republicans will protect those individuals living with pre-existing conditions.Republicans will totally protect people with Pre-Existing Conditions, Democrats will not! Vote Republican.— Donald J. Trump (@realDonaldTrump) October 24, 2018The president’s claim is a strange one, given that Republican lawmakers have been the ones fighting to actively dismantle the Affordable Care Act—not Democrats. It seems possible the Trump administration’s war on Obamacare could be a boon for Democrats come the midterm elections on Tuesday, November 6."}