{"id": "Explaining Amarin's Fishy Stock Slide", "paragraph": "There’s a fishy story rippling through the life sciences today.On Monday, Dublin-based biopharma Amarin stock sank about 7% (and, at some points during the trading day, as much as 15%) following a tug-of-war narrative over its prescription strength fish oil drug Vascepa—and just how much of a benefit the treatment may present in reducing cholesterol and, consequently, fighting cardiovascular disease.Let’s recap. The debate was set off by detailed results published in the New England Journal of Medicine and presented at the American Heart Association (AHA) meeting in Chicago over the weekend that highlighted some impressive ways Vascepa appeared to protect high cholesterol patients from heart-related illnesses and death. The so-called REDUCE-IT study concluded that patients who took the drug, rather than a placebo, experienced a sharp reduction in risk of having serious (and potentially deadly) cardiovascular events such as the possibility of death, heart attack, or stroke. By about 26% across the categories, in fact.Amarin had telegraphed these results in earlier, partial study releases. “The Vascepa fish oil capsule reduced the risk of certain serious cardiovascular events (such as stroke and heart attack) for certain heart patients (those who had high levels of triglyceride fats in their blood and high cholesterol levels being held in check by statins) by 25% compared with placebo. That’s an eye-popping figure when it comes to the heart health space,” as I wrote in September.The fish oil drug’s promise helped Amarin’s stock soar about 600% over the past three months despite Monday’s slide (although that percentage is also attributable to the shares’ historically low prices).But some investors and industry observers are raising their eyebrows over the precise nature of the placebo used in the Vascepa trial. Amarin’s placebo used a mineral oil which could theoretically boost trial participants’ “bad” cholesterol levels. That could, in turn, make the fish oil’s performance in reducing cardiovascular risk appear particularly strong (or so the thinking seems to go among the more skeptical).Those concerns, however, may not derail Amarin’s quest to get the Food and Drug Administration (FDA) to slap a favorable label on Vascepa (which was approved by the agency six years ago) showing serious heart health benefits. Heck, even the investor fretting eroded over the course of the day. And Amarin’s chief executive is expressing nothing but confidence.“We are a science-driven company that is focused on helping patients. With these results, we’re in a position to help millions more patients,” said Amarin CEO John Thero in a statement, adding that the company plans on submitting data to the FDA next year.We’ll find out soon enough how that review goes.Subscribe to Brainstorm Health Daily, our newsletter about the most exciting health innovations."}