{"id": "ThredUP Launches Remade, a Clothing Line Designed for Resale", "paragraph": "The largest online thrift store, thredUP, launched its own clothing line Tuesday, with resale in mind. The clothes come with an incentive for customers to sell the items that they no longer want back to the company, leading to fewer clothes ending up in landfills.Since its founding almost 10 years ago, thredUP has amassed a wealth of data about what styles sell quickly online. When designing its new line, called Remade, thredUP’s team used this information to decide which cuts, colors, and styles should be included.“We leveraged all the data that we have at thredUP around average sell-through, and then used that to pick the right items to produce,” explained James Reinhart, thredUP’s co-founder and CEO.According to this data, a dark-colored wrap dress with small flowers sells better than a lighter design with larger flowers. “We could have picked one or the other,” says Reinhart. “We let the data tell us which one to pick.”The final collection has eight items—t-shirts, a cardigan, wrap dresses, and blouses of varying styles—in sizes XS to 3X, priced from $20 to $50. Each item also comes with a buyback guarantee: if you buy from Remade and sell the item back to thredUP, you’re promised a 40% return of the original value.To help with resales, thredUP said that its clothing is designed to be more durable than what other affordable brands produce. According to to a thredUP post on Medium, Remade’s clothes are made from “consciously sourced high-grade materials, bonded with quality stitching and seams that ensure a longer lifespan across multiple owners.”“How quickly thredUP resells the clothes is part of the Remade experiment,” says Reinhart. He says thredUP expects that each item will ultimately be owned by three to four customers, but the team doesn’t know whether each one will wear the item for a month before returning it, or wear it for a year.Regardless of the time frame, the selling history of each Remade item will be traceable through a QR code printed on the tag.“It makes it very easy for that customer to learn more about that item, but also in a resale environment it makes it very easy which item that is,” says Reinhart.With information about the collection, year, and ownership, thredUP can more easily process the item, price it accordingly, and get it back online for resale. Ideally, consumers won’t cut off the tag (or will save it if they want the 40% return). But Reinhart knows this is part of the learning process.“Maybe we actually need to print it on the fabric somewhere, so that it’s tagless. That’s the nice part about launching experiments and seeing how consumers adopt them,” he says. “We’ll find out.”All Remade items have been produced in factories that passed social responsibility and compliance testing, according to a thredUP post on Medium. The factories also participate in projects to benefit women’s health and education, and the mills are water safety and efficiency compliant.While the ultimate goal is to make Remade items from recycled materials, further reducing the clothing’s environmental impact, Reinhart said this isn’t easy to achieve.“First we want to prove that the value-proposition of buying something with resale in mind works,” he told Fortune, adding, “We’re trying to figure out how do you make resale and reuse accessible, and that doesn’t necessarily always go hand-in-hand with recycled materials.”But, he says, “We’re working on it.”"}