{"id": "Women Allegedly Offered Money to Make 'False Claims' Against Special Counsel Mueller", "paragraph": "Special Counsel Robert Mueller’s office has told the FBI that women were allegedly offered money to make “false claims” about him, CNBC reported Tuesday.The news comes just as conservative commentator Jack Burkman claims to have information about a number of women who were sexually assaulted by Mueller. In a Twitter post Tuesday morning, Burkman said he will reveal the identity of “the first of Special Counsel Robert Mueller’s sex assault victims” on Thursday.Some sad news.  On Thursday, November 1, at the RosslynHoliday Inn at noon, we will reveal the first of Special Counsel RobertMueller's sex assault victims. I applaud the courage and dignity andgrace and strength of my client. pic.twitter.com/wZVQeHD45r— Jack Burkman (@Jack_Burkman) October 30, 2018According to CNBC, a woman told journalists she had been offered $20,000 by Burkman “to make accusations of sexual misconduct and workplace harassment against Robert Mueller.” The journalists then notified the special counsel’s office, who reported the matter to the FBI.“When we learned last week of allegations that women were offered money to make false claims about the Special Counsel, we immediately referred the matter to the FBI for investigation,” spokesman Peter Carr told CNBC in a statement.Burkman could not be immediately reached for comment.In a Facebook video shared Tuesday, Burkman, the host of radio show Behind the Curtain, again announced that he will reveal the identity of the first alleged victim Thursday, adding that there would more.“We’ve interviewed many. The investigation is ongoing. This isn’t something I take any delight in,” said Burkman. “Robert Mueller is a bad guy not just because of what he does inside the courtroom, but because of what he does outside the courtroom.”Under Mueller, the special counsel’s office has been investigating interference of the 2016 elections, along with possible coordination between President Donald Trump’s campaign and Russia. Mueller’s investigation has so far brought charges against a number of Russian operatives and a handful of Trump’s former associates.Burkman has long been a critic of Mueller, calling the investigator “the Devil” and his indictments “an outright joke” on Twitter. In February, Burkman tweeted, “The President has nothing to lose by firing Bob Mueller—nothing.”The conservative commentator is no stranger to controversy, either. According to The Washington Post, Burkman has protested gay athletes in the NFL, offered $25,000 to FBI whistle-blowers with evidence of wrongdoing in the 2016 presidential election, and was physically attacked twice for his various investigations."}