{"id": "Trade War Will Produce 'No Winners,' China's Xi Tells APEC", "paragraph": "China’s President Xi Jinping said a trade war will produce “no winners” and called for nations to uphold a rules-based order led by the World Trade Organization.Implementing tariffs and cutting economic ties “is a short-sighted approach and it is doomed to failure,” Xi said at the Asia-Pacific Economic Cooperation CEO summit on Saturday in Papua New Guinea. Protectionism and unilateralism were overshadowing global growth, and a policy of erecting economic barriers was doomed to fail, Xi said.The growing U.S.-China trade dispute is looming large at the APEC summit this weekend in Papua New Guinea, where U.S. Vice President Mike Pence on Saturday said the Trump administration won’t change course of tariffs until China “changes its ways.” The U.S. has so far imposed tariffs on $250 billion in Chinese imports. In retaliation, China has slapped tariffs on $110 billion in imports from the U.S. and effectively shut off its purchase of key American agricultural exports including soybeans.“Disagreements should be resolved through consultation,” Xi told the forum on a cruise ship anchored off Port Moresby. “Attempts to form exclusive blocs or impose one’s will on others should be rejected. History has shown that confrontation, whether in the form of a cold war, a hot war or a trade war, will produce no winners.”Pence began his speech by saying the U.S. commitment to the Indo-Pacific had never been stronger. He criticized infrastructure funding that saddled developing nations with debt and took a swipe at China’s Belt and Road Initiative.“The United States offers a better option. We don’t drown our partners in a sea of debt,” he said. “We don’t offer a constricting belt or a one-way road.”Xi reminded the audience that Papua New Guinea, a Pacific nation that has been the recipient of large amounts of aid and loans from Beijing, played an important role during World War II.“Mankind has once again reached a crossroads. Which direction should we choose?,” Xi said. “Cooperation or confrontation? The interests of all countries and indeed the future of mankind hinge on the choice we make.”"}