{"id": "Bitcoin Scammers Hijack Twitter Accounts to Run 'Elon Musk' Ads", "paragraph": "The good news is that Twitter has cleaned up some cryptocurrency scams posted on its service. The bad news is the scammers are a step ahead with a new type of rip-off that, like many of the previous ones, uses Tesla CEO Elon Musk as bait.The new scam works like this: Crooks hijack a brand’s Twitter account that has a blue check mark indicating it is authentic. Next, they change the name and the picture on the Twitter account to imitate Musk, and also retweet a series of tweets from Musk’s real account.The hijacked account then becomes a vehicle to promote the scam, in which “Elon Musk” claims to have quit Twitter, and asks people to send Bitcoin so they can receive the proceeds of a big giveaway. The latest brand to have its account hijacked is Farah Menswear, a UK clothing outfit:As you can see in the screenshot above, the brand’s Twitter handle still says @farahmenswear, proving it’s a scam. The tweet also says “Promoted,” which indicates the scammers have paid to put it in users’ Twitter feeds.It’s unclear if the scammers are taking over the brands’ Twitter accounts by guessing the passwords, or by some other means. Farah Menswear didn’t reply to a request for comment, and nor did publisher Pantheon Books, which had its account hacked last week:Umm… Did Pantheon Books account get hacked by a Musk-impersonating bitcoin scammer? pic.twitter.com/UNtbrO4Qhs— Jeff Roberts (@jeffjohnroberts) November 5, 2018In response to a request for comment, a Twitter spokesperson sent a boilerplate statement that included this remark:“We’ve substantially improved how we tackle cryptocurrency scams on the platform, and in recent weeks, impressions have fallen by a multiple of 10 as we continue to invest in more proactive tools to detect spammy and malicious activity. This is a significant improvement on previous action rates.”Despite the progress made in curtailing the crypto scams, some remain frustrated. An employee at a prominent cryptocurrency company, who spoke on the condition of anonymity, said dealing with imposters is an ongoing problem.“I think [it’s improved] a bit but we’re still spending a lot time on whack a mole reporting fakes and scams to Twitter,” said the employee, who added the company had to deal with “a gazillion” fake accounts impersonating a new executive.The employee also expressed frustration that Twitter bans mainstream cryptocurrency companies from advertising on its platform even as scams continue to run rampant.Meanwhile, a prominent tech investor, Jason Calacanis, suggested a way for Twitter to halt the phony Elon Musks in the first place:here is a simple idea that doesn't require any AI @TwitterSupport: don't allow anyone to name their account Elon Musk AND (tweet the word bitcoin/ethernet/giveaway OR post a link to a page with the word bitcoin) without someone from @Twitter Support seeing it first. Welcome!— jason 🦄 🇯🇵 ❤️ (@Jason) November 12, 2018Calacanis’s idea to reduce scams by requiring pre-approval from Twitter would not have to be limited to Musk. Scammers also regularly appropriate the image of other high profile crypto figures, including Ethereum creator Vitalik Buterin, Coinbase CEO Brian Armstrong and Ripple CEO Brad Garlinghouse. The company could make a further dent in scams by vetting anyone who wanted to use their names in a Twitter bio.For now, however, it appears cryptocurrency scams will continue to plague Twitter."}