{"id": "Leaders Can Make Really Dumb Decisions. This Exercise Can Fix That", "paragraph": "The most consequential decision made by an American leader in the past quarter-century was President George W. Bush’s decision to invade Iraq to topple Saddam Hussein’s government in 2003. Remarkably, the decision was made without a formal process, a careful consideration of the consequences through structured deliberations, the solicitation of outside experts’ views, or even a vote of Cabinet officials.Bush later told Bob Woodward why such a process was unnecessary: “I could tell what they thought,” the president recalled. “I didn’t need to ask them their opinion about Saddam Hussein,” adding, “I think we’ve got an environment where people feel free to express themselves.”This perspective reflects two dangerous assumptions for leaders to hold: They know what others are thinking, and those surrounding them share their actual opinions. Yet no leaders are mind readers, and research demonstrates that most employees refrain from expressing challenging views for fear of retaliation or futility. Subsequently, before consequential decisions are made, their vulnerabilities frequently remain hidden and assumptions unquestioned.How can leaders avoid making disastrous decisions? The answer lies in a tool you may have never heard of: red teams.Red teams are exercises that create an environment where employees feel safe and willing to put forth their ideas or concerns about a strategic decision, and that institute a process through which those ideas and concerns are documented to improve the decision. They should be led by a trained, unbiased facilitator, require limited preparation, and are conducted over the course of just a few hours. You may have heard of them by other names: pre-mortem analysis, wicked questions, or weighted anonymous feedback.Broadly speaking there are three types of red teams: diagnostic, contrarian, and imaginative. The first dissects and describes, the second questions and challenges, and the third generates new thinking and expands the limits of what is presently imaginable. Ultimately, they all have the same objective of fostering an environment for open and frank discussion. When employees are hesitant to speak up in front of peers or bosses, exercises can be tailored so participants are awarded anonymity by writing or typing out their views. Affording this anonymity often leads to startling insights.The most meaningful moments of red teaming are when someone offers an “aha” observation. Such an insight stuns the group with its novelty and obviousness, and causes the participants to collectively, instinctually recognize the observation as meaningful or correct. In every exercise with a senior leadership team I have facilitated, there has been at least one such “aha” moment. For instance, I’ve seen a junior manager ask what would happen to the forthcoming strategy if a powerful chief operating officer were to leave her position, and a chief nursing officer identify the most probable cause of a new patient care plan failing—the non-cooperation of doctors. In both instances, the room went quiet and heads nodded in agreement. Once such a breakthrough is made, new initiatives can be developed in order to deal with contingencies.To be most impactful, red team exercises should have two components: open-ended, divergent thinking to draw out still-hidden ideas, followed by convergent thinking in which those ideas are deliberated, weighted, and prioritized to provide a path for revamping a forthcoming decision. It is impossible to force any leader to take action and implement a new approach, but by highlighting shortcomings, these exercises make leaders more aware of the relative consequences of their organization’s inaction.Even when red team exercises elicit new insights on old problems or uncover areas of opportunity, they are sometimes wholly ignored. Leaders become ostriches to this new data out of misplaced concerns that they could suffer from reduced prestige or have their wisdom unduly questioned in the future.But those leaders who refuse to acknowledge or act upon the concerns raised by their employees—the very people closest to the issue—will approach their strategic decision with less information and context to achieve the best outcome. They will also be far less prepared when that decision, once implemented, faces inevitable impediments and complications.Challenges that may have been foreseen, and may seem obvious in hindsight, often remain buried due to a leader’s mistaken belief that their employees either have nothing to offer or will willingly offer their authentic opinions. From the Oval Office to the C-suite, this assumption has proven costly time and time again.Micah Zenko is the director of research and learning at McChrystal Group, and author of Red Team: How to Succeed by Thinking Like the Enemy."}