{"id": "Mister Rogers Stars in His First TV Commercial—For Google", "paragraph": "The voice of Fred Rogers, better known as the host of children’s show Mister Rogers’ Neighborhood, returned to television screens on Tuesday night during the World Series. Rogers, who died in 2003, sang one of his standards, Did You Know, in a commercial for Google’s new Pixel 3 phone, marking the first time the beloved figure’s voice has been used on TV to pitch a product.As children appear on screen in activities like knitting, cooking and paddle boarding, Rogers sings: “You can ask a lot of questions about the world and your place in it. You can ask about people’s feelings. You can learn the sky’s the limit.”Google introduced the Pixel 3 phone line on Oct. 9 in two sizes that feature a camera app fueled by machine learning to improve picture taking. The company is trying to seize market share-or at least some attention-from Apple, which sells far, far more iPhones (by one estimate Apple sold more phones in one week than Google sold all of last year).An agency preparing Google’s ad approached Fred Rogers Productions in Pittsburgh seeking permission to use the song, said Suzanne Masri, director of marketing and communications. Typically, “We really do not license Fred’s music or image for commercials,” she pointed out.But the group was won over by the theme of Google’s commercial, showing children exploring the world and using a smartphone for learning with family and friends, not in isolation, Masri said. “The context of the ad and the use of wonder was really a use of media very much in line with how Fred would have used technology—out in the real world, to discover, to explore,” she said.For Rogers’ cameo, Google (googl) paid Fred Rogers Productions a licensing fee, which Masri declined to disclose. Google declined to comment. The company commemorated Rogers’ show with a Google doodle last month.Rogers was not a fan of commercials on television during his lifetime, though he did create a program in the 1960s sponsored by Horne’s Department Store.He started his iconic children’s show in 1967 and hosted all 895 episodes before ending the run in 2001. The show appeared on public television without any advertising interruptions.Rogers died of stomach cancer in 2003 at the age of 74."}