{"id": "Who’s Going to Make the Most Money Off the A.I. Wave?", "paragraph": "Every major technology wave yields a small number of extremely valuable companies worth tens to hundreds of billions of dollars. Often it’s difficult to predict who the big winners will be when a major new technology emerges. However, if one studies the history of technology, the value and revenue of most technology waves tend to accumulate in two types of companies: those that produce underlying systems or semiconductors, and those that make end-user software or applications. For example, in the PC-era, Intel, which manufactured semiconductors, and Microsoft, which created vertical applications such as Microsoft Office, were the most valuable and profitable winners. (Semiconductors are computer chips and vertical applications are software designed for customized purposes.) In the mobile era, Qualcomm and ARM benefited on the semiconductor and hardware side, while vertical applications like Uber, WhatsApp, and Instagram emerged as companies valued in the tens of billions. Other technology waves that created major semiconductor companies include networking (Broadcom) and gaming (Nvidia).A new technology wave is currently sweeping the world—that of machine learning and artificial intelligence (A.I.). This new technology is likely to follow a similar course, in that the winners in the market will include both semiconductor companies and end-user vertical application companies. Right now, the dominant player in semiconductors for A.I. is Nvidia, whose graphic processing chips have been mostly adopted by the A.I. community. However, Nvidia chips are not optimized for A.I. applications, and a raft of new players, including Cerebras, Graphcore, and Groq, have risen to challenge the incumbent and to carve out a whole new market segment. Just as Intel never quite got its footing in mobile, it is possible Nvidia will also miss the new market trends due to its existing chip architecture being optimized for different purposes (video game and other graphics processing). If history is a guide, a startup will emerge with tens of billions of dollars of market capitalization in this segment. This area is underinvested in from a venture capital perspective, relative to its potential upside.On the software side, vertical applications should win again as well. While there are a number of “horizontal” companies trying to build general purpose A.I., they are likely to fail in the short-term market. The most probable winners in A.I. in the short run are likely to be companies that harness its power for specific end-user applications. There are likely to be three types of winners:First, expect large, data-rich Internet incumbents to dominate. Companies like Google, Facebook, Amazon, and Apple have already been deploying A.I. at scale for ad targeting, search, and voice recognition. These technology companies are far ahead of the curve and have proprietary datasets that they can use to find valuable applications for users. Second, new vertical application startups are emerging. Companies are using A.I. to build new types of applications in various markets, including autonomous vehicles (such as Cruise and Waymo), trucking and logistics (Samsara), health care (Color Genomics, Athelas), and fintech (Affirm, Stripe). A number of these companies will create products significantly better than those of existing vertical incumbents, since A.I. will be at the core of their offerings, versus tacked on. Third, look out for non-tech incumbents adopting A.I. tech to unlock their data. Large companies spanning industries are sitting on treasure troves of data. For example, Starwood Hotels & Resorts has an amazing footprint in real estate and hotels, and can use that dataset smartly for everything from pricing to credit checks on leases. Similarly, Visa, Mastercard, and American Express are sitting on massive datasets that can be applied to various consumer uses in e-commerce and credit. One can imagine these datasets generating new revenue streams if properly leveraged. This may lead to a new private equity model in which PE or large venture firms buy out incumbent companies with the idea of unlocking their data for new uses.As in prior technology waves, the real value should accumulate into a handful of companies: those building the underlying hardware systems and semiconductors and those far building vertical applications of A.I.. This consolidation will likely have ripple effects across the tech industry. Look for private investors to double down on companies producing semiconductors and A.I.-driven applications, and for PE companies to target large incumbents harboring considerable amounts of data. The A.I. wave may have few winners, but those who do catch it are likely to profit considerably.Elad Gil is a serial entrepreneur, technology executive, and angel investor. He is a co-founder of Color Genomics, and an investor in Athelas, Groq, Cerebras, and Stripe."}