{"id": "Saudi Crown Prince Mohammed Bin Salman Calls Khashoggi Murder 'A Heinous Crime'", "paragraph": "Saudi crown prince Mohammed bin Salman said Wednesday that the murder of journalist Jamal Khashoggi was “a heinous crime that cannot be justified,” and those responsible for his death “will be held accountable,” BBC reports.“Saudi Arabia will go and implement all necessary rules and investigate deeply in order to achieve results,” he said, according to CNN. “And to bring to justice those who were responsible for this heinous crime and they will be put before the courts. There’s no doubt.”The crown prince’s comments at the Future Investment Initiative in Riyadh were his first since the Saudi government admitted Khashoggi was killed within the Saudi consulate in Istanbul, Turkey.Khashoggi, a Saudi dissident and American resident, went missing on Oct. 2 after entering the consulate for paperwork related to his wedding. Saudi Arabia first denied any part in his disappearance, then stated that Khashoggi was killed in a “rogue operation” when “discussions” turned physical. The nation has not procured a body, but 18 people have been arrested, according to a Saudi public prosecutor.Two of the crown prince’s closest aides were among five high-ranking officials fired over Khashoggi’s death, CNN reports, although MBS denies any knowledge of the murder.In opposition to the Saudi account of events, Turkish President Recep Tayyip Erdogan said Tuesday that Khashoggi’s death was a “premeditated murder.” Turkish officials have stated since the beginning that Saudi operatives are at fault, claiming to have an audio recording of Khashoggi’s murder and dismemberment.MBS, however, said that Saudi Arabia is cooperating with Turkey. CNN reports that MBS and Erdogan had a phone call Wednesday to discuss Khashoggi.“A lot of people are trying to seize this painful situation to create a rift between Saudi Arabia and Turkey,” the crown prince said Wednesday, according to BBC. “And I want to send them a message: you will never be able to do that.”MBS was speaking at an investor conference known as “Davos in the Desert,” which many executives have boycotted due to the Saudi response to Khashoggi’s death."}