{"id": "Brainstorm Health: Glaxo HIV Drug, Obamacare Downtime, Same Sex Health Coverage", "paragraph": "The evolution of HIV treatment is one of the most striking stories in the life sciences. What was once a near-certain death sentence is now largely a manageable chronic condition thanks to modern science. Treatment regimens that used to require dozens of pills have now been simplified to once-a-day, three-drug combination therapies.Now, the question facing drug makers is: How do you make HIV treatment even more convenient and effective?To that end, companies like Gilead and GlaxoSmithKline (the two market leaders in the space) have been attempting to simplify therapy regimens. And, on Tuesday, GSK-run Viiv Healthcare said that an experimental two-drug combination scored its primary goals in a late-stage clinical trial.What makes the Glaxo treatment unique is that, not only does it contain two (rather than three) drugs—it’s a long-acting medicine that requires just a monthly injection. Theoretically, if the trial results hold up, HIV treatment could evolve from a once-daily pill to a once-monthly shot.GSK shares were up about 1% in Tuesday trading.Read on for the day’s news.Obamacare enrollment begins soon—with scheduled downtime. The open enrollment season for the Affordable Care Act launches on Thursday. But it’s going to come with some technical downtime. The Trump administration has planned (in similar fashion to last year) 12 hours of offline maintenance each Sunday of the open enrollment period, which lasts from November 1 through December 15.Alkermes depression drug faces a reckoning. The Food and Drug Administration (FDA) isn’t mincing words about Alkermes’ experimental depression drug ALKS-5461. A brutal review by the agency slams everything from the treatment’s potential safety to the trial design used by Alkermes (not to mention the data collected under the trial). A panel of FDA advisers are slated to meet and discuss the treatment later this week. It should make for an interesting conversation. (Xconomy)Access to same sex health coverage is growing. A new Kaiser Family Foundation (KFF) report finds that employers are (slowly) offering more health coverage to same-sex spouses. While gay marriage was legalized nationwide in 2015, employers are under no legal obligation to offer health benefits to same-sex couples; KFF’s report highlights several interesting trends, including that: “Large firms (those with 200 or more employees) were more likely to offer coverage to same-sex spouses compared to smaller firms (87% vs 62%). Almost nine in ten (87%) large firms with opposite-sex spousal coverage offered such coverage, 9% did not, and 4% reported they had not encountered this benefits issue.” Read the full report here. (KFF)In ‘Keeping at It,’ Paul Volcker Pulls No Punches, by Alan MurrayGE Just Cut Its Dividend to Almost Nothing, by David MeyerGoogle Workers Are Planning a Walkout This Week. Here’s What They’re Protesting, by Grace DobushWarren Buffett, Sheldon Adelson Face Off Over Nevada’s Energy Supply, by Hallie Detrick Find past coverage. Sign up for other Fortune newsletters."}