{"id": "Facebook's Stock Seesaws as Investors Parse a Mixed Earnings Report", "paragraph": "Facebook’s stock zigzagged after reporting third-quarter earnings that beat profit forecasts 30 cents a share but missed on revenue, as investors grappled with the company’s efforts to maintain its growth while improving the social network’s security.Facebook’s revenue in the quarter rose 33% from the same quarter a year ago to $13.73 billion, missing Wall Street forecasts by $40 million. That revenue growth marks the slowest growth rate in Facebook’s history. A year ago, Facebook’s revenue grew by 47%. Two years ago, revenue was growing by 56%.That slowdown reflects a stagnation in the growth of Facebook’s monthly active users, which grew by 9.6% in the quarter. A year ago, MAUs grew 15.5%. Facebook saw 1.49 billion daily active users in the quarter, which was below analyst expectations of 1.51 billion users.Facebook’s stock initially fell 2% in after-hours trading, before rising as much as 5.6% as investors determined how to read the third quarter’s financial performance. Once Facebook’s executives began a conference call discussing earnings, the stock continued to seesaw, again falling as much as 3.2% and then rising 6.7%.Before Tuesday’s earnings, Facebook’s stock had fallen 19% so far in 2018, compared with a 0.5% decline in both the Dow Jones Industrial Average and the S&P 500 Index.That volatility reflected the ambivalent message that CEO Mark Zuckerberg had for investors. While previous earnings calls have typically involved cheerleading rhetoric about Facebook’s numerous strengths, Zuckerberg was equally clear this time in outlining the challenges the company faces.Zuckerberg rarely mentioned competitors on past calls, but this time said Facebook Watch was “well behind” YouTube and that Apple’s iMessage app was its biggest competitor to WhatsApp and Facebook Messenger. Next year would be another period of “significant investment,” he said, while reassuring investors that Facebook needed to “make sure our costs and revenue are better matched.”Zuckerberg also said that the mid-term elections next week “will be a real test of the protections we have put in place,” acknowledging the role that Facebook unwittingly played in allowing Russia to interfere in the 2016 U.S. elections. “We will never be perfect, but I’m proud of the work we’re doing here,” he said."}