{"id": "3 Ways Russian-Linked Entities Stoked Controversy on Facebook, Twitter", "paragraph": "New charges against a Russian national for allegedly trying to influence the 2016 U.S. presidential elections and upcoming midterms reveal the creative techniques that Kremlin-linked groups have used to sow discontent among Americans.The Department of Justice said Friday that it filed criminal charges against Elena Alekseevna Khusyaynova for her alleged role with the Russian propaganda operation “Project Lakhta.” This operation, according to the complaint, oversaw multiple Russian-linked entities like the Internet Research Agency that lawmakers say spread fake news and ginned up controversy on Twitter and Facebook. Russia has denied any disinformation campaign.Here’s some interesting takeaways from the lawsuit:The complaint alleges that the Russian groups grasped onto polarized issues like gun control, race relations, and immigration to further divide the U.S. populace. They spread both liberal and conservative viewpoints to various groups on social media, tailoring the message to each one, including choosing which publication to share on them. One unnamed Russian cited in the complaint allegedly said, ” If you write posts in a liberal group,…you must not use Breitbart titles. On the contrary, if you write posts in a conservative group, do not use Washington Post or Buzzfeed’s titles.”The Russian groups appeared to practice their own form of racism, with one member reportedly saying “Colored LGTB are less sophisticated than white; therefore, complicated phrases and messages do not work.”The groups apparently discovered that “infographics work well among LGTB and their liberal allies,” while conservatives appeared to be indifferent to graphics.Members of the Russian entities were well versed in summarizing popular news stories and spinning them in a way that would antagonize Americans. The entities created a Facebook group dubbed “Secure Borders” that would aggregate news stories and then sensationalize them to draw emotional responses.Here’s an example of one way the Russian groups discussed among themselves about how to spin a news story about the late John McCain’s criticism of President Donald Trump’s immigration policies.“Brand McCain as an old geezer who has lost it and who long ago belonged in a home for the elderly. Emphasize that John McCain’s pathological hatred towards Donald Trump and towards all his initiatives crosses all reasonable borders and limits. State that dishonorable scoundrels, such as McCain, immediately aim to destroy all the conservative voters’ hopes as soon as Trump tries to fulfill his election promises and tries to protect the American interests.”The Russian groups couldn’t have spread propaganda as effectively if they used their real identities. Instead, they created fake profiles on the social media to do things like promote protests and rallies and to post divisive and hateful content.For instance, the fictitious New York City resident “Bertha Malone” created 400 Facebook posts that allegedly contained “inflammatory political and social content focused primarily on immigration and Islam.”Get Data Sheet, Fortune’s technology newsletter.The “Malone” personal also communicated with an unnamed real Facebook user to assist in posting content and managing a Facebook group called “Stop A.I.” On March 9, 2018, a fake Twitter user named @JohnCopper16 attempted to influence Twitter users by commenting on President Trump’s recent summit with North Korean President Kim Jong Un:  "}