{"id": "Google's Halloween Doodle Will Destroy Your Productivity Today", "paragraph": "Google might be one of the most useful sites on the Internet, but on days like today, it’s the mortal enemy of HR departments.Tuesday’s Google Doodle celebrates Halloween, but instead of doing so with a cute video or fun historical fact, it opts instead for a multiplayer interactive game. And it’s an addictive one.The Great Ghoul Duel lets teams of friends or strangers compete against each other as ghosts trying to collect the most wandering spirit flames in two minutes.The game’s more than just a fun way to while away the working hours, though. It also represents another step by Google into the gaming world. This is the first time a Google Doodle has offered multiplayer gameplay. And it’s the first time users have been able to host a Doodle game on their own, inviting up to seven players.And the game is catching of fast, if social media mentions are any barometer.We've had some hard days recently, so using a google doodle as self care seems somewhat appropriate. pic.twitter.com/Dhtz5CfQ97— Nicholas Cooley (@npcooley) October 30, 2018Peeps bragging about the fortnite wins. But I got the Google doodle wins! pic.twitter.com/aLvkQYnl54— Mr roboto (@EricStrebler) October 30, 2018HAD SO MUCH FUN WITH OFFICEMATES PLAYING THE NEW HALLOWEEN MULTIPLAYER GOOGLE DOODLE HAHAHHA! as though nasa office yung mga naka work from home!!! pic.twitter.com/BiDAE5ZOQn— 👾 chy 👾 ; let's move on from dv3ch1!!! GANBATTE (@ceejayaycee) October 30, 2018Today's Google Doodle is the best ever?! The Great Ghoul Duel is an actually fun multiplayer game with the ghouliest soundtrack! pic.twitter.com/kj4RPfiVf9— Mina 👻 (@MinasMorGhoul) October 30, 2018Google’s gaming interests have increased dramatically recently. Earlier this month, the company began testing Project Stream, a game streaming service that lets gamers play new titles at their maximum graphics settings on devices that normally couldn’t power them. "}