{"id": "Jawboning Won't Revive China's Slowing Economy", "paragraph": "On Friday, China’s financial regulators mounted an extraordinary media blitz to convince investors the world’s second-largest economy remains robust—and isn’t threatened by US tariffs or sky-high domestic debt ratios.The assurances came as China reported third-quarter GDP growth of 6.5% year-on-year, the nation’s slowest quarterly expansion since 2009. They also followed a sharp sell-off in stock markets in Shenzhen and Shanghai Thursday which dragged the composite CSI 300 to 30% below its January high, its lowest level in three years.Economic tsar Liu He vowed China would maintain stable growth, and chided bankers for their lack of faith in the nation’s private firms. “If you analyze China’s economy by focusing only on one thing or one period, you might feel it faces difficulty,” he said. “But if you look at it from a larger historical perspective, the outlook is very bright.”Guo Shuqing, chairman of the China Banking and Insurance Regulatory Commission, decried the market as “out of touch with the fundamentals of the Chinese economy” and declared that the performance of domestic bourses “does not reflect the healthiness of China’s financial system.” Yi Gang, governor of the People’s Bank of China, promised the central bank stands ready to provide liquidity for China’s banking system. Securities regulator Liu Shiyu said the government would take measures to facilitate private equity investments in listed companies, speed up merger approvals and support bond issuance.The jawboning campaign seems to have done the trick—at least for now. Shenzhen and Shanghai indexes closed up more than 2% on Friday, while the Nasdaq-style Chinext index bounced more than 3%.But skepticism abounds. “Talk is cheap,” sniffed Bloomberg columnist Shuli Ren. “Whenever China’s top banking regulators come out to calm the markets, you know their options are dwindling.” The Wall Street Journal’s Nathaniel Taplin warned Chinese regulators have a history of making “splashy announcements” followed by meagre economic stimulus. Hong Kong’s South China Morning Post fretted that China’s “experiment with capitalism” is “in crisis,” while the Financial Times warned that a continued China slump could spread to markets in the rest of Asia.Beijing has allowed its currency, the renminbi, to weaken about 10% relative to the US dollar so far this year—nearly enough to offset the impact of tariffs the Trump administration has imposed on $250 billion worth of Chinese exports to the US. Many analysts worry that, to blunt the impact of Trump’s tariffs, Beijing will abandon its effort to purge its financial system of unprofitable loans.The reality is that China is in a fix. Growth is slowing. Trade relations with the US may yet get worse. Beijing is reluctant to allow the value of the renminbi to fall much further for fear of being branded a currency manipulator and triggering a capital exodus. Throwing more money at inefficient state-owned enterprises will only erode long-term competitiveness. Bullish pronouncements notwithstanding, Xi Jinping and his economic advisors face difficult decisions in the months to come.Huawei in court. CNEX Labs, a Silicon Valley semiconductor start up backed by Microsoft and Dell, is locked in a battle with Huawei. Last year, Huawei filed a lawsuit against CNEX, accusing the San Jose firm of stealing its technology. CNEX, which was founded by a former Huawei employee, has countersued, alleging that Huawei’s Texas-based unit Futurewei has engaged in a multiyear endeavour to steal CNEX technology. CNEX believes Huawei is using lawsuits to demand the release of classified documents. The Wall Street JournalGoogle opens up. Google CEO Sundar Pichai openly discussed the company’s controversial Dragonfly project – a plan to develop a censored search engine for the Chinese market. Pichai claimed tests of the secret software revealed Google could serve 99% of user queries while adhering to China’s strict censorship policies. Google execs have maintained that Dragonfly is an internal project testing a hypothetical Chinese product, but leaked memos have shown the goal was to have a search engine ready to go if the Chinese government approved it. A number of employees have resigned in protest of Dragonfly, saying it represents a forfeiture of Google’s values. FortuneWeChat wobble. Two former WeChat executives have launched their own social media platforms – Pop and Echo – issuing further challenges to China’s instant messaging giant, Tencent. The new apps, Pop and Echo, both focus on communication through photos (like Snapchat, which is blocked in China) and have both secured funding. Tencent is already under pressure; a hiatus on game approvals sent its share price plummeting and has forced the company into a rare restructure. BloombergUnicorn born. Momenta is the first Chinese autonomous vehicle (AV) start up to officially claim unicorn status, having secured $200 million funding in its latest round. The company provides software for AV development, offering products geared towards driving on freeways, in urban areas and a “valet parking” service. TechNodeSigned, sealed, on hold. The Whitehouse announced it intends to withdraw the U.S. from the Universal Postal Union (UPU) – a United Nations organization that determines international postal rates. The UPU, headquartered in Bern, gives more favourable rates to ‘developing’ countries, such as China. In some cases, this allows Chinese manufactures to ship items to the U.S. for less than it costs American producers to post similar products domestically. The Trump administration is threatening to withdraw and issue its own, higher rates to China. The U.S. has a year to negotiate new terms within the UPU. New York TimesLondon to Shanghai. HSBC will become the first overseas firm to list in China as a decades-old plan to link the London and Shanghai stock exchanges comes to fruition. HSBC will be allowed to issue Chinese depositary receipts (CDRs) – which are tradable securities linked to shares listed elsewhere. China launched its CDRs earlier this year, but the initiative stalled when Xiaomi, which was due to be the first to issue CDRs, suddenly withdrew from the scheme. Financial TimesCurrency concerns. The U.S. Treasury declined to label China a currency manipulator in its biannual report on foreign exchange practices, despite President Trump’s frequent accusations that Beijing keeps its currency weak to gain a competitive edge in trade. The softer tone of the Treasury report could help deescalate tensions. However, Treasury Secretary Steven Mnuchin reiterated U.S. concerns over the weakness of China’s RMB. Financial TimesGive it some gas. Exxon Mobil signed a 20-year supply agreement to provide liquified natural gas (LNG) to Zhejiang Provincial Energy Group. Exxon will supply a 1 million tonnes of LNG to Zhejiang Energy annually, starting from 2020. Exxon’s push comes as many other companies are holding back, waiting for the trade war to subside. ReutersChina v America: The end of engagement The EconomistChina arrests former vice finance minister for graft ReutersChina Fines Vaccine Maker Over $1 Billion After Faulty Rabies Inoculation TIMEA New Culprit Is Identified in China’s Choking Smog NYTMeeting ahead: Donald Trump and Xi Jinping have tentatively agreed to a meeting on the side lines of the G20 summit next month, claims an anonymous source. If confirmed, it would be the first meeting between the two state leaders in a year and could signal an attempt to reach a truce in the ongoing trade war. South China Morning PostPlaying defense. On the side lines of an ASEAN security summit in Singapore, Defense Secretary Jim Mattis met with his Chinese counterpart, Wei Fenghe, hoping to smooth over some of the upset caused by Vice President Mike Pence’s speech earlier this month. A previous meeting between Mattis and Wei had been cancelled, with both sides blaming each other for the postponement. During their 90-minute powwow in Singapore, the two reached few agreements. Associated PressTroubled waters. The Hong Kong-Zhuhai-Macau bridge, a $15 billion infrastructure project crossing 33 miles of ocean, is tipped to open on October 23. The bridge is a major component of Hong Kong’s integration with mainland China, which is a controversial process within the former British colony. Xi Jinping is expected to attend the ceremony in Zhuhai, a mainland city bordering Macau, but will not use the bridge to cross to Hong Kong. South China Morning PostAnother tiger trapped. Former internet tsar Lu Wei has pleaded guilty to corruption charges and admitted to receiving up to $4.6 million in bribes. Lu, the former head of the Cyberspace Administration of China, was responsible for overseeing the nation’s severe censorship policies but was placed under investigation last year. Allegations against him stretch back to his time at Xinhua News Agency, where he is believed to have taken hush-money in exchange for withholding negative coverage. South China Morning PostGeely drives solo. Geely moved to ‘correct’ rumors that its chairman, Li Shufu, has family ties to President Xi Jinping. The longstanding speculation has been that chairman Li’s wife is sister to Peng Liyuan, the wife of Xi Jinping. A familial connection like that could have been influential in Geely’s tremendous success. However, a recent filing revealed the name of Li’s wife and it isn’t as people had expected. Reuters This edition of CEO Daily was edited by Eamon Barrett. Find previous editions here, and sign up for other Fortune newsletters here."}