{"id": "After Pittsburgh Shooting, Anti-Semitic Posts Continue to Run Wild on Instagram, Report Says", "paragraph": "A search on Instagram Monday produced a deluge of hateful photos and videos posted in the wake of a deadly shooting at a Pittsburgh synagogue, the New York Times reports.Posts included references to Nazi ideology and more than 11,000 photos and videos included the hashtag #jewsdid911, indicating the religious group was responsible for the terrorist attacks on Sept. 11, the newspaper reported.Instagram, the popular photo-sharing website that is owned by Facebook, is among the social media platforms under fire for its role in emboldening hate speech and the spread of disinformation. Cesar Sayoc, the Florida man arrested last week for allegedly mailing pipe bombs to 13 people, made partisan posts on Facebook that were overtly anti-Democrats, targets of his attacks. Robert Bowers, the man charged with opening fire at the Tree of Life synagogue in Pittsburgh, killing 11, posted his anti-semitic views on Gab, a social media network that has since been taken offline.An Instagram spokesperson said that the company has noticed content related to this weekend’s events and is taking action to address content that violates their user policies.“We are actively reviewing hashtags and content related to these events and removing content that violates our policies, including hate speech,” the Instagram spokesperson said. “We do not allow content that attacks people based on their race, ethnicity, national origin, religious affiliation, or their sexual orientation, caste, sex, gender, gender identity, and serious disease or disability. We will continue to remove this content as soon as we’re aware.”The rise of social media sites such as Instagram has changed the social and political landscape.“Social media companies have created, allowed and enabled extremists to move their message from the margins to the mainstream,” chief executive of the Anti-Defamation League Jonathan A. Greenblatt told the Times. “In the past, they couldn’t find audiences for their poison. Now, with a click or a post or a tweet, they can spread their ideas with a velocity we’ve never seen before.”Instagram’s resilient hate speech is a black eye for the social network that in August revealed its plan to improve the service by keeping bots and other bad actors off the platform. Instagram’s co-founders left the company in mid-October, reportedly over growing tensions with Facebook CEO Mark Zuckerberg."}