{"id": "The 2018 Midterm Elections Are Tuesday. Here's What You Should Know", "paragraph": "Every two years, voters in the U.S. elect a new House of Representatives and one-third of the 100-seat Senate. This Election Day, Nov. 6, is widely seen as a referendum on someone not on any ballot: President Donald Trump. The midterm election — so named because it comes at the middle of the president’s term — will determine whether Trump’s Republican Party retains control in the House and Senate or whether Democrats will gain control of one or both and begin to spell all kinds of problems for Trump.It depends on how quickly votes are counted and how close the races are. Many contested House seats are in eastern states like Florida, North Carolina, Pennsylvania and Virginia; by 8 p.m. Eastern Standard Time, voting in those states and many others will be done. It’s possible that control of the next House could be clear by 11 p.m. EST, when polls close in populous California. If not, a long wait is possible: There are more than half a dozen competitive House races in California, where there’s a prolonged ballot-counting process and many voters cast ballots by mail. Some key Senate races are in western states, so results may not be known until Wednesday, Nov. 7; close races could require recounts that could add many days to the waiting time.At the moment, they hold a 235-to-193 majority in the House (where seven seats are vacant) and a 51-to-49 edge in the Senate. Up for grabs on Nov. 6 are all 435 House seats and 35 of the 100 Senate seats, though many of those are considered sure things for one party or the other.They’re better-positioned to win control of the House than the Senate, according to an analysis by Bloomberg Government. Democrats have had strong showings in elections to fill vacancies in the House since Trump became president, they’ve raised record amounts of campaign contributions and they appear to be performing well in the polls. Many observers expect they will win enough seats to regain control of the House, often referred to as “flipping” it.That’s a steeper challenge for Democrats. To win control, they’d need to retain almost all of their current seats that are being contested. There are 26 of those (including two held by independent senators who typically vote with them), and 10 are in states Trump won in 2016. They’d also have to seize two or more Republican-held seats. There are only nine of those on the ballot this year, six in states Trump won by large margins. But it’s common for the party of the sitting president to lose seats in midterm elections. Since the end of World War II, that party has had a net loss of 26 House seats and 4 Senate seats on average. The best hope for Democrats is that this is a “wave election,” a term used to describe when the close races tend to break one way and that political party makes major gains in Congress.Indicators such as Trump’s low approval rating, Democratic candidates’ “unprecedented” fundraising numbers and polls showing strong support for Democratic House candidates suggest that Democrats could win much more than the 218 needed for majority control. Plus an unusually high number of House Republicans (37, compared with 18 Democrats) are not seeking re-election, making many of those districts more competitive. In the Senate, three Republicans aren’t running for re-election.His ability to get major legislation passed would likely be thwarted, in no small part because the House is where all bills for raising revenue must originate. Plus, his administration would likely face new or re-energized investigations, perhaps including subpoenas, by congressional committees under the control of Democrats. Those investigations include whether the Trump campaign colluded with a Russian effort to undermine the 2016 election. Democrats could also seek to obtain and review Trump’s tax returns — though if so, that doesn’t mean they’d be released to the public.A majority in the Senate is uniquely important because that’s the only chamber that can approve or reject any new Supreme Court appointment by Trump, or any appointment to his cabinet. Control of both the House and Senate would mean that Democrats determine all legislation for the next two years, though Trump could veto any measure before it became law.Trump has been able to do things like renegotiate the terms of the North American Free Trade Agreement, put 10 percent tariffs on $200 billion worth of Chinese exports, cut financial aid for the United Nations and announce that the U.S. would withdraw from the Iran nuclear deal. A Democratic House and/or Senate would have a say in implementing the proposed replacement for Nafta and could challenge Trump’s ability to unilaterally apply tariffs in the name of national security. It also could vote to restore foreign aid and not to re-impose sanctions on Iran. Perhaps the most dramatic thing a Congress under Democratic control could try to do is impeach Trump and remove him from office.A president can face impeachment for “treason, bribery, or other high crimes and misdemeanors,” and that last part gives Congress great leeway. Democratic leaders have mostly steered way from impeachment talk, reasoning that many voters aren’t eager to see a repeat of the political warfare that raged 20 years ago when Republicans sought to remove President Bill Clinton. But a small group of Democratic House members have already proposed impeaching Trump on charges of allegedly obstructing justice, undermining the federal judiciary and violating the ” emoluments clause” of the Constitution by refusing to divest his business stakes before becoming president. If a majority of the House were to approve one or more formal written charges known as articles of impeachment, the Senate would hold a trial. If two-thirds of the senators voted to convict — something that would require cooperation from Republicans — the president would be removed from office."}