{"id": "Worker Scarcity, Tariff Anxiety, and 'Collaborative Robots.' How the Fed's Latest Survey Describes Modern American Businesses", "paragraph": "A closely watched survey of U.S. businesses by the Federal Reserve shows companies generally positive about the pace of economic growth, but also increasingly grappling with two problems that can lead to higher prices or slower growth in the future: a tight labor market and the President Trump’s imposition of new trade tariffs.The Fed’s beige book is based on anecdotal information about the economy that is collected by the 12 regional Fed banks. The latest beige book, which surveyed companies through Oct. 15, showed many are not responding to a tightening labor market with significant increases in wages. The U.S. unemployment rate fell to 3.7% in September, the lowest rate in nearly five decades. But wages grew only 2.8% in September, consistent with wage growth over the past few years.In the Fed report, companies reported moderate economic growth, but increasing problems related to a scarcity of workers. Businesses in Dallas as well as restaurants in Cape Cod said labor shortages would limit future growth. One company in the Philadelphia district said it would start using “collaborative robots.” Companies are offering signing bonuses, flexible hours and extra vacation to lure new workers, but most aren’t raising wages much for now.Other companies indicated a concern about or problems from the trade tariffs that President Trump has imposed. Some companies are raising prices for consumers to cover the increased cost of raw materials caused by tariffs. Others are shifting business strategies to accommodate the impact of tariffs. A display-case manufacturer in Virginia, for example, is working to import materials from other countries than China.“Manufacturers reported raising prices of finished goods out of necessity as costs of raw materials such as metals rose, which they attributed to tariffs,” the report said. “Retailers and wholesalers in some Districts raised selling prices as they continued to see increased costs in transportation and also worried about impending cost increases resulting from tariffs.”President Trump has imposed tariffs on billions of dollars worth of goods from China and other countries, which in turn has brought retaliatory tariffs. Some businesses surveyed by the Fed are expecting tariffs to continue to increase their costs. “New car prices are also expected to increase significantly to cover the burden of recently implemented tariffs,” the Boston Fed said in discussing its survey."}