{"id": "As Camp Fire Pushes Smoke Into San Francisco, These Companies Are Giving Employees (and the Public) Free Face Masks", "paragraph": "With the Camp Fire still raging in Northern California and winds pushing smoke south, San Francisco has the worst air quality in the world as of Thursday, according to IQAir’s world air quality and pollution city rankings. Many people are wearing face masks to keep the smoke and ash out of their lungs as they go about their lives.The California Department of Public Health (CDPH) provides a full explanation about how to choose and best use the correct mask to protect against wildfire smoke, and how often to replace your mask. CDPH recommends particulate respirators, and those masks will bear such ratings as N95 or P100.Most Bay Area stores stocking masks have been running out almost as soon as new shipments arrive. So, for employees who can’t work from home, some companies are handing out face masks to help their workers breathe easier during their commute.Web security company Cloudflare handed out masks in its San Francisco office.It’s crazy outside!! Thank you @Cloudflare for giving us masks! That’s @vcroyle for the record…. pic.twitter.com/6qrsUFc7xX— Daniella V. (@BellaTweetz) November 16, 2018Hazardous air quality is a public health issue, so it makes sense that companies focused on health and wellness are also helping employees, as well as the public, take extra precautions. San Francisco-based telemedicine company Doctor on Demand had masks on hand for employees this week. So did Carbon Health, a San Francisco startup that’s part virtual platform, part primary care clinic.Greg Burrell, Carbon Health co-founder and vice president of clinical product, notes that since primary and urgent care is the company’s focus, it was important to have masks on hand for the staff. “We’re residents here too, and offering a working mask to our patients and our neighbors in this unhealthy air is such a small but effective way that we can help,” he says. “We know there were long lines at the hardware stores, and most are now sold out.”Fire departments across the northern half of the state are giving away free face masks while supplies last. And some companies are also giving away free masks to the public as well.We are giving away 3M particle masks at select Northern California Kelly-Moore Paint stores, while supplies last.  Please find the store nearest you here:  https://t.co/hZak15Yxh1— Kelly-Moore Paints (@KellyMoorePaint) November 15, 2018Kelly-Moore Paint store locations all over Northern California are giving away free masks (limit five per family) while they last. You can find a complete list of participating locations here.I am so happy to see @Starbucks handing out face masks and giving free coffee to their house-less customers. Nice job.— 🐝john sepulvado🐝 (@JohnLGC) November 16, 2018There’s also word that Starbucks has been giving free masks to patrons seeking refuge from the smog. Starbucks did not immediately respond to Fortune‘s request for confirmation and comment."}