{"id": "Brainstorm Health: Pharma CEOs' Midterm Money, Parker Institute Investment, Merck Pfizer Combo Treatment", "paragraph": "Happy Friday, readers! This is Sy.The pharmaceutical industry has persistently been one of the biggest sources of political money in the country—perhaps unsurprising given the billions upon billions of dollars potentially affected by government policy.Drug companies and their allied trade groups pour buckets of funds into specific policy fights. For instance, the industry pulled off a major upset in California back during the 2016 election by defeating Proposition 61—which was meant to cap the state’s reimbursement levels for certain treatments—after spending well over $100 million on the issue.But individual pharmaceutical CEOs dole out plenty of cash themselves to their favored parties and causes. And a new analysis by MarketWatch, fueled by data from Open Secrets, sheds some light on exactly where the money is going among S&P 500 companies’ leaders.The MarketWatch report considers both gross amounts of money donated for the 2018 midterm cycle and the partisan tilt of said donations. For instance, Amazon chief Jeff Bezos is, by far, the biggest spender on the list with nearly $10.2 million in contributions—but $10 million of that was to the nonpartisan veterans’ charity With Honor Fund.Breaking the donations out with partisan lilt built into the methodology paints a more interesting picture. And biopharma executives are among the biggest spenders when you consider ideological leanings, according to the report.For instance, Allergan CEO Brent Saunders, Abbott Laboratories chief Miles White, and Thermo Fisher Scientific head honcho Marc Casper personally gave between $90,000 and $103,000 each to almost exclusively Republican partisan groups. The only heavily Democratic-oriented chief executive from the drug industry was Regeneron’s Leonard Schleifer, who donated $120,000 through the end of August. Express Scripts’ Tim Wentworth, Celgene’s Mark Alles, Pfizer’s Ian Read, Amgen’s Robert Bradway, Eli Lilly’s David Ricks, and Merck’s Ken Frazier (who harshly criticized President Donald Trump’s comments about racial violence in Charlottesville, Virginia), each donated between $112,800 and $250,000 to a mix of partisan groups—though highly skewed towards the GOP.Business leaders regularly donate to all sorts of causes and organizations. But the direction where the money flows can, on some level, be telling.I hope you have a wonderful weekend, and read on for the day’s news.Parker Institute pairs with a new kind of CAR-T biotech. Sean Parker’s eponymous Parker Institute for Cancer Immunotherapy is investing in an upstart biotech trying to create a new kind of CAR-T technology—the kind that uses patients’ immune cells as the basis of modified cancer killing agents. The Xyphos Biosciences partnership reportedly “isn’t trivial,” though the institute is staying mum on hard numbers. (Endpoints)Merck, Pfizer combo cancer drug notches positive kidney data. Merck and Pfizer’s combination therapy of the former’s blockbuster Keytruda and the latter’s Inlyta has reportedly met its main clinical trial goals in a late-stage study of kidney cancer patients, improving both survival rates and delaying the progression of the disease compared with another common cancer therapy. That dual endpoint achievement could wind up being a big factor if the combination treatment is ultimately cleared by the Food and Drug Administration (FDA). (Reuters)Juul is on a hiring binge. In the midst of increasing regulatory scrutiny, e-cigarette and vaping giant Juul is on a major hiring binge, according to the San Francisco Chronicle. In fact, it’s reportedly hiring more than 100 new employees per month as regulators probe its marketing practices, which have been under the spotlight given Juul products’ widespread use by teens and underage Americans. (San Francisco Chronicle)Full Employment? The Economy Isn’t Acting Like It, by Geoff ColvinLas Vegas Becomes the Secret Weapon of Musicians in a Spotify World, by Chris MorrisHow China Aims to Win the 5G Race, by Clay ChandlerInside the Wild West of Scooter Chargers, by Lucinda Shen Find past coverage. Sign up for other Fortune newsletters."}