{"id": "Millennials Are Disrupting Thanksgiving With Their Tiny Turkeys", "paragraph": "Small birds are having a big moment.Tiny turkeys will increasingly grace Thanksgiving tables next week, thanks to the millennial generation’s ongoing campaign to remake American gastronomy. The holiday depicted by Norman Rockwell—Grandma showing off a cooked bird so plump it weighs down a banquet plate—is still common. But smaller families, growing guilt over wasteful leftovers and a preference for free-range fowl have all played roles in the emergence of petite poultry as a holiday dinner centerpiece.“People are starting to understand it’s not natural to grow turkeys up to 30 pounds,” said Ariane Daguin, co-founder and owner of D’Artagnan LLC, a wholesale and e-commerce food company in Union, New Jersey. “In general, that means they were penned up with no room to move around, and that’s why they’re fat like that.”There are signs that wee birds are in greater demand. Inventories of whole hens, which are smaller than males, are down 8.3 percent from a year ago, the latest U.S. Department of Agriculture data show. Whole toms, the males, are up 6.9 percent.Don’t call them capons. They’re not castrated chickens. Nor are they chicks. They’re not babies. They’re just turkeys that weigh in the neighborhood of six pounds.Bell & Evans is working with a breeder to make tiny turkeys that consumers will eat all year. Owner Scott Sechler said the new breed, which isn’t yet sold publicly, “fills out nicely,” unlike other undersized birds, which can be bony.Still, 12- to 14-pound turkeys remain the biggest holiday seller, Sechler said. That may be because some millennials are “still going to Mom’s,” he said.Even Butterball LLC, which sells 30-plus-pound heavyweights, also offers a Li’l Butterball that can be as small as six pounds.HelloFresh SE, in its first Thanksgiving box this year, is selling 12- to 14-pound turkeys from Cargill Inc. designed to serve 10 people who’ve filled up on appetizers. And while Amazon.com Inc.’s Whole Foods said its most popular sizes are a classic 14 to 18 pounds, it also has a smaller version to feed four non-vegan customers.Smaller families are fueling the trend. Last year, 62 percent of American households had just one or two people, compared with 41 percent in 1960, according to the U.S. Census Bureau. The proportion of single-person homes has risen, too.Karen Bell, owner of Bavette La Boucherie butcher shop in Milwaukee, said she sold half her tiny-turkey supply by Halloween. The organic birds are as little as six pounds, Bell said, because customers want less meat.“Family sizes are smaller,” she said. “Celebrating Thanksgiving isn’t like 20-people extended families.”Families are also more spread out than they used to be, an additional reason cooks are considering alternatives such as turkey breasts, which can be just a few pounds, or roasted chicken. Honey Baked Ham Co. has a 2.5-pound baked turkey breast for $34.95. D’Artagnan sells a six-pound capon for $80 to feed five to six people.“The whole bird is not necessarily on everyone’s Thanksgiving table the way it used to be,” said Russ Whitman, a senior vice president at commodity researcher Urner-Barry.With smaller birds, there’s less chance of tossing uneaten meat. Each year, about 200 million pounds of turkey is trashed during Thanksgiving week, according to the Natural Resources Defense Council.“Food waste is becoming an increasingly concerning issue,” said Michael Averbook, a food and drink analyst at Mintel Group. “Leftovers are part of the fun and tradition of the holidays, and this may be a small step for individuals to feel less wasteful and socially responsible.”Meanwhile, home cooks are getting more adventurous with quail—or even squab (young pigeon), a teeny, single-serve bird that makes for a nice Instagram post. Others would rather stick to tradition but just don’t like the taste of poultry. For them, there’s the prospect of tiny deer.“The first Thanksgiving had plenty of turkey but also venison on the table,” Daguin said. “It’s a traditional meat.”"}