{"id": "Humanity Has Wiped Out 60% of Global Wildlife in the Past 45 Years, WWF Report Says", "paragraph": "In nearly 45 years, humanity has wiped out 60% of global wildlife populations, according to a newly released Living Planet Report from the World Wildlife Fund, the animal rights and conservation organization. What’s more, the huge loss of animal life is also a threat to humanity and the planet, scientists say.The WWF’s report comes just weeks after a UN report on climate change warned that global temperatures are rising quickly, and risk rising to 1.5 degrees, which would wipe out most of the planet’s coral reefs and cause severe heatwaves.“We are sleepwalking towards the edge of a cliff,” Mike Barrett, the executive director of science and conservation at WWF told the Guardian. “If there was a 60% decline in the human population, that would be equivalent to emptying North America, South America, Africa, Europe, China and Oceania. That is the scale of what we have done.”According to the report, more than 4,000 mammal, bird, fish, reptile and amphibian species declined between 1970 and 2014. The report added that currently only a quarter of land on this planet has not been severely impacted or damaged by human activity, but is projected to decline to just one tenth of the land by 2050, due to pollution, disease, and climate change, among other factors.Marco Lambertini, the WWF’s director general, called this current crisis “unprecedented,” telling CNN, “It’s mindblowing. … We’re talking about 40 years. It’s not even a blink of an eye compared to the history of life on Earth.”“We are the first generation that has a clear picture of the value of nature and the grave situation we are facing,” the report says. “We may also be the last generation that can do something about it.” The organization, along with conservationists and scientists across the globe, is calling for a global agreement, a “global deal for nature” similar to the Paris Climate Agreement.“Time is running out,” the report says."}