{"id": "Venice Is Flooding Because of Climate Change, But Corruption Is Keeping It Under Water", "paragraph": "More than 75% of the Italian city of Venice was inundated by high tides and extreme winds on Monday and Tuesday, leaving most of the so-called “Floating City” with the worst flooding in a decade. After two days of heavy rain across Italy, Venice, known for its iconic waterways, can hopefully begin to recover.At least 11 people have died across Italy due to severe weather in the past days, including landslides and flooding, according to The Weather Channel. Roughly half of Italy has been impacted by the extreme weather, and more than 5,800 firefighters have been activated to answer more than 7,000 emergency rescue calls across the country.In Venice, where the flood waters are only just now beginning to recede, police tweeted photos of officers rescuing tourists stranded by the rising waters.#29ottobre #maltempo a Venezia poliziotti della questura in aiuto in #piazzasanMarco a turisti rimasti bloccati a causa acqua alta #essercisempre pic.twitter.com/uJUz6GlPEq— Polizia di Stato (@poliziadistato) October 29, 2018Elsewhere in the country, residents and tourists are stranded in areas where downed trees and washed out, debris-littered roadways hobbled travel. In the mountains, heavy new snowfall has blocked some Alpine passes on the border of Switzerland.So why is Venice flooded? One answer is climate change, which has turned the lagoon city’s proximity to the sea problematic in recent years. Some estimates suggest the Mediterranean Sea levels will rise five feet by the end of the century, which could cause the city to flood twice daily. Currently, Venice experiences fairly severe flooding about four times annually.Another reason Venice is flooded has to do with corruption. For decades, city officials have been planning and working to erect a series of flood barriers meant to stave off some of the worst tides and storms that Venetians and visitors to the area are at least somewhat used to tolerating. Construction on underwater flood barriers, known as the Moses project, started in 1966 but didn’t get going in earnest until 2004. (MOSE is an acronym for an acronym for Modulo Sperimentale Elettromeccanico.)Since that time, the project—one of the world’s most complex, large-scale civil engineering projects ever attempted—has been plagued by fraud. In 2014, Venice’s then-mayor Giorgio Orsoni, along with 30 others, was arrested for charges including corruption, illicit party financing, and tax fraud totaling $6.8 billion. Orsoni was accused of taking roughly $635,000 (€560,000) in illicit campaign financing from the consortium behind the flood barrier. Orsoni resigned and received a four-month suspended sentence. He was also required to pay a $17,000 (€15,000) fine, according to the Telegraph.And while that may have been among the higher-profile corruption cases associated with Moses, it was by no means the first. Previous arrests targeted individuals charged with rigging contracts, according to Reuters.If and when the project is finally completed and fully operational, flood gates will go up once the tide reaches 110 centimeters, or roughly 43 inches, according to CityLab. That won’t keep water out of low-lying areas often flooded already, such as St. Mark’s Square, but it should protect much of Venice from flooding for roughly the next three decades, depending on how quickly sea level rises between now and then.The cost of trying to build a flood barrier has already reached staggering heights. The initial budget for Moses of $1.7 billion (€1.5 billion) had, by 2017, corruption costs included, ballooned to a total cost of $6.2 billion (€5.5 billion), according to Italian newspaper La Stampa.Regardless of the troubled history to finish the flood barriers, it’s high time to finalize the project. The regional governor for Veneto, Luca Zaia, said flooding this week could reach the levels of the 1966 flood that engulfed both Venice and Florence. Back then, such storms seemed like more of an anomaly. But today, they are more common—and more devastating—than ever."}