{"id": "Bomb Threat Updates: Joe Biden and Robert De Niro Reported as Additional Targets", "paragraph": "Authorities have launched a broad investigation into the mailing of suspected pipe bombs to leading Democrats, including former President Barack Obama and former Democratic presidential nominee Hillary Clinton. Suspicious packages were also sent to CNN’s New York offices and to a restaurant owned by actor Robert De Niro.Here are the latest developments, updated throughout the day:New York City police removed a suspected mail bomb Thursday from a Tribeca restaurant owned by actor Robert De Niro, who has been a frequent critic of President Donald Trump.New York City police received a call shortly after 4 a.m. Thursday reporting a suspicious package and responded to the Tribeca Grill restaurant owned by De Niro, a New York Police Department official said. The package was removed and was being transported to an NYPD bomb squad facility in the Bronx, the official said.It was addressed to De Niro personally and contained the same type of explosive device found Wednesday in the Time Warner Center, where CNN is located, a person familiar with the incident said.The FBI issued a statement Wednesday describing five of the suspicious devices found this week.“The packages are similar in appearance” and “contain potentially destructive devices,” the FBI said, warning that “it is possible that additional packages were mailed to other locations. The FBI advised the public to remain vigilant and not touch, move or handle any suspicious or unknown packages.”De Niro, the star of “Raging Bull,” “Goodfellas,” “Analyze This” and many other movies, denounced the president with an obscenity at the Tony Awards in June, prompting Trump, while on his way back from the summit with North Korean leader Kim Jong Un in Singapore, to call the actor “a very low IQ individual.”The Federal Bureau of Investigation is probing another suspicious package in a Delaware postal facility. CBS reported that package was addressed to former Vice President Joe Biden.The FBI said in a statement Thursday that it, along with state and local police and postal inspectors, responded to a facility in Delaware to “conduct law enforcement activity” but declined to specify the nature of the investigation.White House Press Secretary Sarah Huckabee Sanders denied that Trump needed to take responsibility for the state of political discourse.“Look, there’s a big difference between comments made and actions taken,” she told reporters at the White House. “The president is certainly not responsible for sending suspicious packages to someone, no more than Bernie Sanders was responsible for a supporter of his shooting up a Republican baseball field practice last year.”She was referring to the shooting of GOP Representative Steve Scalise of Louisiana on June 14, 2017.Former CIA Director John Brennan, the target of the package sent to CNN, tweeted that Trump should “stop blaming others. Look in the mirror.”“Your inflammatory rhetoric, insults, lies, & encouragement of physical violence are disgraceful,” Brenann added. “Clean up your act….try to act Presidential.”He was responding to a Trump tweet that blamed the media for inflaming political divisions.John O. Brennan @JohnBrennan Stop blaming others. Look in the mirror. Your inflammatory rhetoric, insults, lies, & encouragement of physical violence are disgraceful. Clean up your act….try to act Presidential. The American people deserve much better. BTW, your critics will not be intimidated into silence. Donald J. Trump @realDonaldTrump A very big part of the Anger we see today in our society is caused by the purposely false and inaccurate reporting of the Mainstream Media that I refer to as Fake News. It has gotten so bad and hateful that it is beyond description. Mainstream Media must clean up its act, FAST! http://twitter.com/realDonaldTrump/statuses/1055418269270716418The FBI said that additional devices may have been sent to other locations and warned the public not to touch or handle any suspicious packages.A statement from the FBI said that five packages had been discovered so far, including one addressed to former Attorney General Eric Holder. That package didn’t reach its intended destination, but was rerouted to a return address in Florida. Another was addressed to former CIA Director John Brennan, care of CNN.According to the FBI, all five package bore the same return address: an office of Florida Democrat Debbie Wasserman Schultz. Thee devices, which were sent to the FBI office in Quantico, Virginia, for analysis, were mailed in manila envelopes with bubble wrap interior. They each had computer-printed address labels and six stamps.“We ask anyone who may have information to contact the FBI,” FBI Director Christopher Wray said in a statement. “Do not hesitate to call; no piece of information is too small to help us in this investigation.”CNN President Jeff Zucker said President Donald Trump should take his words more seriously when it comes to the news media.“There is a total and complete lack of understanding at the White House about the seriousness of their continued attacks on the media,” Zucker said in a statement issued soon after CNN was allowed back into its New York bureau following a bomb scare. “The president, and especially the White House press secretary, should understand that words matter. Thus far, they have shown no comprehension of that.”Earlier, Trump condemned the attempted attacks without mentioning any of the targets by name.CNN reopened its New York bureau after a suspected explosive device was removed and authorities tested white powder that was sent with the package.“The NYPD has concluded its security sweep and it is now safe to return to the building,” CNN president Jeff Zucker said in a message to staffers. “I so appreciate your patience, as I know what a long day this has been for all of you.”President Donald Trump said the “full weight of our government” is being deployed as part of a ‘major federal investigation’ into the suspected explosive devices sent to former and current government officials as he condemned the attempted attacks.“We’re extremely angry, upset, unhappy about what we witnessed this morning and we’ll get to the bottom of it,” he said at the White House. “We have to unify. We have to come together.”First lady Melania Trump also condemned the attempted attacks on Obama and Clinton. “We cannot tolerate those cowardly attacks,” she said.The Capitol Police’s bomb squad was sent Wednesday morning to the congressional mail sorting facility in Maryland after a suspicious package was reported by staff there, according to a House official who asked not to be identified.The package, which was addressed to Democratic Representative Maxine Waters of California, appeared to be a explosive device, but technicians are continuing to examine it, the official said. While it was discovered Wednesday, investigators were still determining when it arrived.House Sergeant at Arms Paul Irving was preparing a statement and a memo to be sent out to all House member offices concerning security.Investigators were examining the device and its contents, assembled in an effort to look like a explosive mechanism, but which may not have ever actually worked or gone off. One official said it appeared to be amateurish.The suspected explosive devices sent to Clinton, Obama and CNN appear to be “similar” and may have originated from the same source, John Miller, the deputy New York City policy commissioner for counterterrorism, told reporters.“It appears that an individual or individuals sent out multiple similar packages,” Miller said, adding the devices appeared to be pipe bombs in packages that also contained white powder that has yet to be identified.Miller said New York City police officers happened to be in the CNN building instructing employees on how to identify potential explosive devices when the package was discovered in the mailroom.He said that the New York Police Department has sent information to 20,000 private “security partners” in office and apartment buildings, with tips on how to identify and handle suspicious packages.Police removed the device from the CNN office and loaded it into a bomb truck. Then they transported it to a detonation range, inspected it, and are now preparing to send it to an FBI laboratory in Washington.New York Governor Andrew Cuomo said he was just informed that a suspicious package had been sent to his office in Manhattan, adding that the device “has been identified and is being handled as we speak.”“We wouldn’t be surprised” if more devices show up, Cuomo said.New York City Police Commissioner James O’Neill said police recovered a device that appeared to be a live explosive at the CNN office in the city and an envelope containing white powder.“This was clearly an act of terror attempting to undermine the free press and leaders of this country through acts of violence,” New York Mayor Bill De Blasio told reporters. “We’ve seen worse. And we will not be intimidated.”He added there were no other specific or credible threats in New York City at this time.Hillary Clinton, who was the target of one of the suspected explosives, told an audience in Florida “as a person I’m great, as an American I’m worried.”The former Democratic presidential candidate who ran against Donald Trump in 2016 said she is “fine” thanks to the Secret Service’s interception of the package but raised concerns about the political atmosphere.“It is a troubling time, isn’t it?” Clinton said. “And it’s a time of deep divisions and we have to do everything we can to bring our country together.”The suspicious device sent to CNN’s New York office was removed by the New York Police Department’s bomb squad, according to a alert issued by the city’s emergency notification system.Local police say they are investigating a suspicious package found near the Sunrise, Florida, office of Representative Debbie Wasserman Schultz, a former chairwoman of the Democratic National Committee. Overhead video of the building on Sawgrass Corporate Parkway showed the Broward Sheriff’s Office bomb squad on the scene.Wasserman Schultz and another intended recipient of a suspicious package, Hillary Clinton, were slated to appear together Wednesday at a Miami-area fundraiser for House candidate Donna Shalala.The entrance to CNN on 58th Street is cordoned off as police officers and dog swarm the area. Television crews, reporters and onlookers gathered at the police barricades to observe the action. Evacuated workers called loved ones on the street, many promising not to go back into the building today.“It’s scary, but I don’t know what exactly has happened,” said Walter Herrera, a catering contractor with Time Warner who said he was evacuated from the building earlier. “I don’t know what’s going on.”Herrera’s colleague, Luis Calderon, initially thought the alarm was a routine fire drill. Calderon, a chef at Restaurant Associates in the Time Warner building, said he walked out without his coat or bag and has no idea when or if he’ll be allowed to re-enter today.President Donald Trump weighed in on the bomb scares for the first time Wednesday afternoon with a three-word tweet endorsing a comment by Vice President Mike Pence. “I agree wholeheartedly!” Trump said, retweeting the statement from Pence.Earlier Pence tweeted, “We condemn the attempted attacks against fmr Pres Obama, the Clintons, @CNN & others. These cowardly actions are despicable & have no place in this Country.”White House press secretary Sarah Huckabee Sanders, who earlier denounced the attempted attacks on Obama and the Clintons, added a tweet hours later saying, “Our condemnation of these dispicable acts certainly includes threats made to CNN as well as current or former public servants.”CNN is a frequent target of rhetorical attacks by Trump as a purveyor of “fake news.” The network reported that the package was addressed to former CIA Director John Brennan, who works as a contributor to NBC News.The New York Police Department will brief reporters on the suspected bombs Wednesday afternoon at 12:45 p.m. local time, along with New York Mayor Bill de Blasio and New York Governor Andrew Cuomo, according to a tweet from Eric Phillips, de Blasio’s press secretary.The FBI and the U.S. Secret Service are investigating to see whether there are linkages between the devices sent to Obama and the Clintons, as well as the one reported at the CNN bureau in New York.Federal agencies, including the Bureau of Alcohol, Tobacco, Firearms and Explosives, are working with state and local law enforcement to investigate the packages.The New York Police Department’s intelligence, counterterrorism and bomb squad teams are stepping up patrols at locations associated with Obama, Clinton and Soros, as well as media locations in the city and other areas, a police official said speaking on condition of anonymity.New York City also issued an emergency alert to residents on West 58th Street between Columbus and 8th Avenue to shelter in place immediately.Devices addressed to Obama in Washington, D.C., and Hillary Clinton in Chappaqua, New York, were discovered by the U.S. Secret Service, the agency said Wednesday.“The packages were immediately identified during routine mail screening procedures as potential explosive devices and were appropriately handled as such,” the Secret Service said in an emailed statement Wednesday. “The protectees did not receive the packages nor were they at risk of receiving them.”The Secret Service and the FBI launched a broad investigation that included federal, state and local law enforcement agencies. Nick Merrill, a spokesman for Hillary Clinton, said in a tweet that “nothing got to any home.”CNN evacuated its New York bureau in the middle of a broadcast Wednesday morning. Anchors later began broadcasting from a street outside their office.“We condemn the attempted violent attacks recently made against President Obama, President Clinton, Secretary Clinton, and other public figures,” White House press secretary Sarah Huckabee Sanders said in a statement.The incidents followed an earlier discovery when police on Monday “proactively detonated” a pipe bomb found at a residence in New York’s suburbs owned by Soros, the billionaire philanthropist and Democratic donor."}