{"id": "Cyber Saturday—Facebook's 'War Room' Is a Marketing Ploy", "paragraph": "In response to mounting criticism from consumers, citizens, and lawmakers, Facebook is pursuing a public relations blitz. The media giant wants to change people’s perceptions about how it is handling the scourge of misinformation and concomitant threat to elections presented by its websites and apps.Enter the “war room.” Facebook invited journalists from a number of publications—Fortune included—to visit a cramped conference room on the company’s Menlo Park campus inside which a squad of 20-or-so employees is tasked with valiantly defending democracy around the globe—from the U.S., to Brazil, and beyond. The walls and desks are cluttered with video screens and computer monitors. Around them, Facebook’s freedom fighters huddle, clattering away on their keyboards, stemming a tide of malicious, politically-motivated influence campaigns.One moment in Fortune reporter Jonathan Vanian’s account of the war room made me grin widely. A Facebook executive, Samidh Chakrabarti, director of elections and civic engagement for the company, tells Vanian that having everyone in the same room allows for “face-to-face” communication and quick decision-making. A few paragraphs later, we learn why Facebook does not plan to invite collaborators from other misinformation-besieged Silicon Valley companies, like Twitter and Reddit, to take seats in the room. It is easier for these groups to collaborate “virtually” rather than physically, says Nathaniel Gleicher, Facebook’s head of cybersecurity policy. Hmm…Facebook’s war room seems, to this columnist, like a PR stunt. It is reminiscent of the cybersecurity fusion centers that banks and other companies set up to dazzle visitors. Such displays are mostly for show, as the New York Times conveys in an unrelated story. They, you know, look cool.I do not mean to denigrate Facebook’s efforts entirely. To be fair, the company is trying to address the many problems that plague its platforms. And the war room does serve an important purpose: making the company’s behind-the-scenes battles more tangible for its own employees, for regulators, and for the public. Hopefully it does help quench disinformation.Still, the tidy image of the war room comes across as a bit of marketing misdirection. After all, the walls of this room extend far, far beyond Menlo Park. Ask any journalist. As the Times’ editorial board notes in a recent op-ed, Facebook effectively relies on news reporters as an army of unofficial, unpaid, outsourced content moderators, helping to root out spammers, trolls, and propagandists. Companies like Facebook “have all the tools at their disposal and a profound responsibility to find exactly what journalists find—and yet, clearly, they don’t,” the Times writes.Indeed, the real war room has no walls.***Last week I warned readers about the many ways Bloomberg Businessweek’s recent report about Chinese spy chips smells foul. Just yesterday Apple CEO Tim Cook took the unprecedented move of personally calling for Bloomberg to retract the story. So far Bloomberg has not backed down. We’ll continue to track this story and its fallout.Have a great weekend.Robert Hackett@rhhackettrobert.hackett@fortune.comWelcome to the Cyber Saturday edition of Data Sheet, Fortune’s daily tech newsletter. Fortune reporter Robert Hackett here. You may reach Robert Hackett via Twitter, Cryptocat, Jabber (see OTR fingerprint on my about.me), PGP encrypted email (see public key on my Keybase.io), Wickr, Signal, or however you (securely) prefer. Feedback welcome.Rushin’ to the polls. The Justice Department charged a Russian woman named Elena Khusyaynova, 44, with conspiracy to defraud the United States by interfering in the upcoming 2018 election. Prosecutors say she managed financed for a foreign influence operation called “Project Lakhta.” The group allegedly spread misinformation online to incite controversy over divisive social and political issues.Lovely spam! Wonderful spam! Facebook believes that a recently disclosed breach, the biggest known in the company’s history, was caused by spammers, the Wall Street Journal reports, citing unnamed sources familiar with the company’s investigation. The hackers apparently posed as a digital marketing agency.Google censored search engine. Google CEO Sundar Pichai doubled down on the company’s interest in a censorship-friendly search engine for China, codenamed “Project Dragonfly.” Pichai said Google wants to provide people access to information while complying with laws around the globe. Asked about employees’ protests over this project as well as over potential U.S. military work, Pichai said “we don’t run the company by holding referendums.”You’re hired. Stripe has hired Niels Provos, an ex-Googler who spearheaded many security initiatives, such as Safe Browsing, at the search giant, as its head of security. Intel’s new chief software security officer, Window Snyder, has plans to boost the chipmaker’s security in the wake of the Meltdown and Spectre chip flaws. And Microsoft has hired Hemma Prafullchandra, ex-chief technology officer of cybersecurity firm HyTrust, as the tech chief for its Microsoft 365 security and compliance team.I’d like to buy the world a coke. Share today’s Data Sheet with a friend:http://fortune.com/newsletter/datasheet/Looking for previous Data Sheets? Click here.After the curtain. The Washington Post has published the final opinion piece of Jamal Khashoggie, the Saudi Arabian dissident and journalist who is reported to have been dismembered and decapitated at the country’s consulate in Istanbul by more than a dozen Saudi agents. (Saudi Arabia, after denying involvement for 18 days, now claims Khashoggie died in a fistfight gone wrong.) Khashoggie, in his posthumous column, calls for alternatives to the “state-run narrative [which] dominates the public psyche” in the Middle East. I include this excerpt because the Web has become a global battleground for information warfare, and securing cyberspace requires a recognition of that fact.The Arab world is facing its own version of an Iron Curtain, imposed not by external actors but through domestic forces vying for power. During the Cold War, Radio Free Europe, which grew over the years into a critical institution, played an important role in fostering and sustaining the hope of freedom. Arabs need something similar.3 Ways Russian-Linked Entities Stoked Controversy on Facebook, Twitter by Jonathan VanianNew Effort to Stop Human Trafficking Uses Data Analysis to Follow the Money by Renae Reints3-D Printed Guns Aren’t as Dangerous as You Might Think by Avi ReichentalHackers Can Use Your Household Appliances to Trigger Large-Scale Power Outages by Erin CorbettThe Cat-and-Mouse Game Between Regulators and Data Stewards by Robert HackettFacebook Has a New Plan For Fighting Voter Suppression Tactics—And For Once It Involves Deleting Lies by David MeyerInto the aether. Popular Mechanics’ latest installment of “We’ve Been Wrong Before,” a series that explores debunked scientific theories, offers a history of aether, a mysterious element invented by the ancients whose idea persisted, in various forms, until the 19th century. Two scientists, Albert Michelson and Edward Morley, famously failed to prove the invisible material’s existence in an 1877 experiment that involved attempting to measure light moving at different speeds. Albert Einstein would build on the duo’s findings with his theory of relativity. As Popular Mechanics writes, aether, echoes of which resonate in today’s concepts of dark energy and dark matter, “may be the most enduring imaginary concept in scientific history.”At least that we know of…"}