{"id": "Tide's New Packaging Looks a Lot Like Boxed Wine, and the Internet Thinks That's a Problem", "paragraph": "If Procter & Gamble’s marketing team was still feeling hungover from last year’s “Tide Pod Challenge” debacle— an internet epidemic in which teens chronicled themselves popping laundry detergent packets into their mouths like candy — the Twitterverse is serving Tide PR some snarky hair of the dog.P&G announced its new, waste-reducing “Tide Eco-Box” Friday. And although a company spokesperson told Fortune that they’ve “been pleased to see the positive responses from consumers who appreciate the compacted product and the challenges the boxed design is meant to help solve for,” many consumers have been more focused on its spigot feature and uncanny resemblance to boxed wine.Tide pod eaters have finally grown up and graduated to boxed-wine-Tide https://t.co/b4nHzGbqXt— Jessica Valenti (@JessicaValenti) November 12, 2018Tide fights back against kids eating delicious Tide Pods, creates a delicious looking Box of Tide Wine instead.  Chug off!   https://t.co/WvGTjIUqx0 pic.twitter.com/x1wg2Cvtxe— Kmarko (@Kmarkobarstool) November 12, 2018Tide box wine pairs well with a nice sauteed Tide Free & Gentle for your weekly date night pic.twitter.com/5KNn1LikZs— jake, math lover (@watislive) November 12, 2018But no matter how enticing your internet friends’ proposed food pairings may be, detergent should not be considered part of your #CleanEating meal plan.“As you can see in the product images, we’ve put a large laundry detergent bottle on the side of the Tide Eco-Box,” the spokesperson continued. “And we all know laundry detergent is meant to be used for cleaning clothes.”Considering that New York lawmakers asked the company to make its Tide pods look less enticing in February—P&G had already made it taste less enticing in 2015—perhaps the picture of the detergent will be deterrent enough.“Like all household cleaning products, whether your Tide comes in a box or a bottle, it should be stored up and away, out of the reach of children,” P&G said.(Although this may seem like a laughing matter, the Washington Post reports that more than 12,000 people called U.S. poison control centers due to exposure to laundry pods—which is different from the liquid detergent in the Eco-Box—last year.)According to CNN, the much-memed Eco-Box “uses 60% less plastic than shipping an equivalent 150 ounce bottle of Tide since it doesn’t require additional layers of cardboard boxing or bubble wrap. It’s lighter and takes up less space in a delivery truck—saving P&G money on shipping costs.”Time will tell if any of that saved revenue will have to be used for curtailing a #TideWineChallenge."}