{"id": "S&P 500 Has Shed $1.7 Trillion Since Its All-Time High, Wiping Out All Its 2018 Gains", "paragraph": "Tax cuts haven’t been enough to keep the stock market away from trade war fears in 2018.Carrying on a month-long market rout, major indexes tracking U.S. equities—the Dow Industrial Average and the S&P 500—slipped into the red Wednesday amid worries about tariffs and rising interest rates.The Dow fell 2.4% to 24,582 while the more expansive S&P 500 dropped 3% to 2,656 on Wednesday. Another way of looking at it: The hundreds of companies indexed on the S&P 500 have dropped at least $1.7 trillion in aggregate market value to about $23 trillion since the market’s high in September, based on data from S&P Capital IQ.The selloff was triggered in late September by the Fed’s decision to raise interest rates, but concerns about the global economy deepened the trend.“We’ve seen an interesting results as a part of earnings season,” said Jason Draho, head of Americas asset allocation at UBS Global Wealth Management. “Companies that have started reporting show that headline numbers are good, but you are seeing companies that are tied to global trade are saying they might struggle in the fourth quarter or next year.”For instance, construction machinery giant Caterpillar fell 5.6% Wednesday after saying a day earlier that manufacturing costs had risen due to tariffs imposed during the Trump administration.The Fed Beige Book, a survey of the country’s businesses, also revealed growing worries about how tariffs may increase the cost of their materials on Wednesday.Across the pond, Euro zone nations also appear to have felt the fallout from the trade war between China and the U.S. The economy of the Eurozone grew at its slowest rate in over two years in September, based on data from IHS Wednesday.“The slowdown is being led by a drop in exports, linked in turn by many survey respondents to trade wars and tariffs, which appears to have darkened the global economic environment and led to increased risk aversion,” Chris Williamson, chief business economist at IHS Markit said in a report.Only now, the U.S. economy appears to be chugging along, says Draho, with the Fed Beige Book revealing “modest to moderate” economic growth.It’s a sentiment echoed by RBC CEO David McKay in a recent Fortune interview.“I can’t see it,” he said of a potential recession in the near future. “[But] I worry we’ll talk ourselves into a recession. I try not to put a date out there because you might create a problem for yourself.”Meanwhile, the tech-heavy Nasdaq Composite fell in to correction territory Wednesday, as defined by a drop of about 10% since its all-time high."}