{"id": "Georgia Gubernatorial Candidate Stacey Abrams Is the Latest Target of Neo-Nazi Robocalls", "paragraph": "Georgia’s Democratic gubernatorial candidate Stacey Abrams, who would be the first black female governor in U.S. history if she wins, is the latest target of racist robocalls from a white supremacist group.After Oprah Winfrey made a campaign trip to Georgia on behalf of Abrams last week, participating in town halls and canvassing door-to-door, some voters received pre-recorded calls impersonating Winfrey that contained racist and anti-Semitic rhetoric, the Associated Press reported.Georgia’s gubernatorial race has already been a heated midterm race, as election officials in the state, along with Abrams’ GOP opponent Secretary of State Brian Kemp, are facing lawsuits for voter suppression of predominately black and Asian Americans voters.“I stand against any person or organization that peddles this type of unbridled hate and unapologetic bigotry,” Kemp said in a statement reported by CNN about the racist robocalls. “These vile efforts to degrade and disparage others are contrary to the highest ideals of our state and country. We unequivocally condemn this group and their horrible actions.”The neo-Nazi group behind the robocalls The Road to Power is an Idaho-based group that features Nazi imagery and anti-Semitic rhetoric in its podcasts. The group describes itself as “White Nationalist anti-jew” and has sponsored robocalls in support of white nationalist Patrick Little’s failed California Senate campaign, and has also targeted Florida’s black gubernatorial candidate Andrew Gillum.Florida voters first received the calls in early September of a man impersonating Gillum, and speaking in a stereotypical minstrel dialect, which picked up again in late October.Abrams’ Director of Strategic Communication Abigail Collazo said that Kemp and President Donald Trump have both fueled the atmosphere of racist hate around the gubernatorial race, and said “desperation from many dark corners” was contributing to election stealing and cheating based on a culture of fear, according to CNN. She added that Kemp’s sudden decision “to find a conscience as polls are tightening and Georgia voters are making it clear that they reject the kind of hate he and his allies have been spewing around the state” is pathetic.“These automated calls are being sent into homes just days before President Trump arrives, reminding voters exactly who is promoting a political climate that celebrates this kind of vile, poisonous thinking,” Collazo said.The robocalls and Trump’s visit to Georgia come at a time of heightened right-wing violence, as two black people were killed at a Kroger grocery store by a white supremacist in Kentucky, followed by the deadliest attack on Jews in the U.S. at a synagogue in Pittsburgh on Oct. 27."}