{"id": "Brainstorm Health: New Flu Drug Approval, Alexion's RNAi Bet, Trump Signs Opioid Bill", "paragraph": "Happy hump day, readers.There’s a new flu drug in town.On Wednesday, the Food and Drug Administration (FDA) inched closer to a record-breaking year of drug approvals, green lighting the first new antiviral flu medicine with a unique action mechanism in nearly two decades.The drug, Japanese pharmaceutical company Shionogi’s and Roche arm Genentech’s Xofluza (or baloxavir marboxil), is different from existing medication in the sense that it attacks the virus through a different method. In clinical trials, that method—delivered through a single dose, oral drug—was found to relieve flu symptoms in people who had been experiencing them for two days or less faster than a placebo (and in about the same amount of time as other existing options).“If patients see their doctors within 48 hours of symptom onset, one dose of Xofluza can significantly reduce the duration of flu symptoms,” said Shionogi in a statement on the approval.FDA Commissioner Scott Gottlieb hailed the new treatment option while also warning that it shouldn’t be considered a replacement for a flu shot given that the influenza season is now officially upon is.“This is the first new antiviral flu treatment with a novel mechanism of action approved by the FDA in nearly 20 years. With thousands of people getting the flu every year, and many people becoming seriously ill, having safe and effective treatment alternatives is critical,” he said, adding the caveat that, while “there are several FDA-approved antiviral drugs to treat flu, they’re not a substitute for yearly vaccination.”The Xofluza approval isn’t just a milestone for flu drug development, though—it’s a potential landmark for FDA drug approvals at large. It’s the 47th novel medicine (i.e., completely new, rather than generic or combination with an existing treatment) approved by the agency so far this year. That’s just six shy of the all-time record of 53 new drug approvals in 1996, and it’s not even November yet. The FDA has also set a record-breaking pace in generic drug approvals under Gottlieb, who has made rapid clearances a hallmark of his tenure.Read on for the day’s news.Alexion pens RNAi therapy deal. Biotech Alexion has struck a partnership with startup Dicerna to create drugs in the newfangled world of “RNA interference” technology—in other words, therapies that actually “silence” certain genes to combat serious genetic diseases. The deal involves a $22 million upfront payment to Dicerna but could wind up being worth hundreds of millions more if major development and commercialization milestones are met.Amgen slashes Repatha list price by 60%. Amgen’s pioneering “PCSK9” cholesterol drug, Repatha, demonstrated the ability to slash levels of “bad” LDL cholesterol by nearly 70% in clinical trials. Now, its list price is being slashed 60% amid lackluster market adoption and pressure from the public and lawmakers. The once $14,000 per year treatment will now ring in at $5,850. Amgen says the primary reason for the cut is to benefit Medicare beneficiaries who have high prescription drug costs (costs that are likely the main cause of the lower-than-expected Repatha sales). (Bloomberg)Trump signs bipartisan opioid bill into law. President Donald Trump on Wednesday signed overwhelmingly bipartisan legislation meant to tackle the opioid addiction and overdose crisis during a White House event. The so-called STOP Act was passed by Congress earlier in October; it includes provisions to promote research for non-addiction pain therapies and substance use disorder treatments for Medicaid patients. However, some critics have noted the law, while a step in the right direction, doesn’t include nearly as much funding as is needed to make a serious dent in an epidemic that spans coast to coast.It Might Get Loud: Inside Silicon Valley’s Battle to Own Voice Tech, by Brian DumaineFormer Fed Chair Paul Volcker: ‘We’re in a Hell of a Mess’, by Kevin Kelleher‘Suspicious Package’ Prompts Evacuation at CNN’s New York Headquarters, by Chris MorrisTim Cook Slams Tech’s ‘Data Industrial Complex’ Again, by David Meyer Find past coverage. Sign up for other Fortune newsletters."}