{"id": "Stocks Resume Their Selloff as Apple Helps Drag the Dow Down 600 Points", "paragraph": "That stock rally last week after the mid-term election? It’s already over. U.S. stocks tumbled again Monday, led by tech stocks like Apple.The Dow Jones Industrial Average fell 2.3% Monday, while the S&P 500 Index dropped 2% and the tech-heavy Nasdaq Composite slid 2.9%.The volatile selloff in stocks is entering its seventh week, with the Nasdaq having lost 10.5% since the beginning of October. Today’s decline was led largely by Apple, which fell 5% on Monday after Lumentum, an Apple supplier, cut its earnings outlook, adding to concern about weaker demand for iPhones. Earlier this month, Apple warned revenue could disappoint during the holiday quarter.Apple’s size and influence has long made it a bellwether for tech stocks. Once it declined, other tech stocks followed. Amazon fell 4.4%, Alphabet dropped 2.6%, Microsoft fell 2.5%, and Facebook declined 2.4%. Netflix fell 3.1%.A fragile rally began last week after the mid-term election showed Democrats taking control of the House and Republicans gaining more seats in the Senate. But once big-tech stocks began slumping again Monday, the sense of concern spread to other sectors as well.Other industry leaders that were facing bad news also suffered big losses. Goldman Sachs fell 7.5% to a two-year low after a former banker at the firm pled guilty in a financial scandal in Malaysia. General Electric slid 6.9% after its CEO’s efforts to reassure investors fell flat. Larry Culp told CNBC that the company may deleverage its debt burden by selling some assets.Apple and Goldman are both component stocks of the Dow Industrial, helping to drag it down more than 600 points Monday. Whether the declines continue or stabilize depends in good part on whether investors see value in tech stocks at this level or more problems ahead. For now, the bearish view is prevailing.“The FANG trade is dead and the market is struggling to find a replacement,” Peter Boockvar, chief investment officer at Bleakley Advisory Group, said."}