{"id": "Precision Medicine Has Transformed Cancer Treatment. Here’s How to Move It Beyond Oncology", "paragraph": "The 21st century is the century of biology, where we’re seeing tremendous discoveries in science and medicine that are improving quality of life for people around the world. We are already seeing proof of this in oncology, where new treatments have transformed certain cancers from a death sentence to a chronic condition that can largely be managed with medications.One such treatment is precision medicine, an emerging approach for disease prevention that takes into account the individual’s genetics, environment, and lifestyle so that doctors and researchers can more accurately predict which treatment would work best for that person’s particular disease.Although the battle against cancer is far from over, we believe the precision medicine model is beginning to illuminate a path for more targeted research in disease areas beyond oncology. With the knowledge, management, and tools we have in precision medicine for cancer, other disease areas can avoid the same missteps that the cancer treatment community encountered to get where we are today.As co-chairs of the Harvard Business School Kraft Precision Medicine Accelerator, our mission is to collectively conquer the business challenges of precision medicine. We recently held an executive education course that convened senior leaders throughout the health care community to discuss precision medicine business models that will help accelerate scientific research. While we expected that a large portion of participants would be from the cancer treatment world, we were blown away to see that more than half of the participants were from other disease areas.Overwhelmingly, the participants explained how harnessing data is the biggest challenge they face when applying precision medicine to their disease areas. Cancer has struggled mightily with this issue and is just starting to get it right. Today, vast amounts of data exist, however most of the time that data is siloed, fractured, and rarely in a standardized format. Data needs to be clean and harmonized in order to make sense of it. That means building large, digestible clinical datasets that are connected to equally large molecular datasets, then following them over time. It also means applying machine learning to help physicians make better decisions about patient diagnoses and treatment options, while understanding the possible outcomes for each treatment path.A great example of the power this data holds comes from the Multiple Myeloma Research Foundation’s (MMRF) CoMMpass Study, which uses the largest genomic dataset of any cancer. The MMRF sequenced the genomes of 1,100 patients with multiple myeloma and collected each patient’s clinical data over their myeloma journey, which has helped uncover 12 subtypes of the disease.Another example is the Pancreatic Cancer Action Network’s Know Your Tumor precision medicine service, where patients can have their tumor molecularly profiled to receive information about the best treatment options for them based on the biology of their tumor. Their information is then added to a database where researchers can look for patterns that will lead to improved treatment options and patient outcomes.A different but equally exciting model outside of cancer is in treating neuromuscular conditions such as muscular dystrophy. The Muscular Dystrophy Association recently created the neuroMuscular ObserVational Research (MOVR) Data Hub, which serves as a centralized repository of data on multiple neuromuscular diseases. Through the collection of provider-reported data, genomic data, and patient-reported outcomes, MOVR is facilitating a better understanding of the natural history of the diseases to enhance clinical trial design and recruitment.And with Alzheimer’s disease, the Diagnostics Accelerator, which has secured more than $30 million in initial commitments from partners such as Bill Gates, is focused on identifying biomarkers that could help identify patients with or at risk of developing this devastating condition. Efforts like this underpin the key importance of securing the critical data that can lead us to discoveries about the biologic manifestation of disease, just as the scientific community has done with cancer.This brings us to another important piece of the puzzle: funding. New therapies cannot be developed, tested, and brought to market without large investments. Fortunately, venture capitalists have been funding precision medicine ventures, largely in cancer, at record levels. But for rare cancers and other diseases, funding remains a significant challenge. Here, alternative funding models—such as venture philanthropy and for-profit startups that target a specific disease—are emerging. These new models provide great hope that advances in precision medicine will more rapidly spread not only to more disease areas, but also to underserved ones.While we look to advance precision medicine approaches in areas beyond cancer, collaborative business models are urgently needed. New data models, funding approaches, and incentives are all required to change a siloed system. We need to continue to collectively use this information to help streamline the most arduous points in the drug development process for all disease areas.As the chances of survival have been so greatly improved for many specific areas of cancer, it is our duty to help translate those lessons to other disease areas in order to give patients and their loved ones the possibility of more years together.Kathy E. Giusti and Richard G. Hamermesh are faculty co-chairs of the Kraft Precision Medicine Accelerator and faculty co-chairs of the Harvard Business School Executive Education program, Accelerating Innovation in Precision Medicine."}