{"id": "The FDA Approved the First Big New Flu Drug in Almost 20 Years—And Is Approaching a Drug Approval Record", "paragraph": "There’s a new flu drug in town.On Wednesday, the Food and Drug Administration (FDA) inched closer to a record-breaking year of drug approvals, green lighting the first new antiviral flu medicine with a unique action mechanism in nearly two decades.The drug, Japanese pharmaceutical company Shionogi’s and Roche arm Genentech’s Xofluza (or baloxavir marboxil), is different from existing medication in the sense that it attacks the virus through a different method. In clinical trials, that method—delivered through a single dose, oral drug—was found to relieve flu symptoms in people who had been experiencing them for two days or less faster than a placebo (and in about the same amount of time as other existing options).“If patients see their doctors within 48 hours of symptom onset, one dose of Xofluza can significantly reduce the duration of flu symptoms,” said Shionogi in a statement on the approval.FDA Commissioner Scott Gottlieb hailed the new treatment option while also warning that it shouldn’t be considered a replacement for a flu shot given that the influenza season is now officially upon is.“This is the first new antiviral flu treatment with a novel mechanism of action approved by the FDA in nearly 20 years. With thousands of people getting the flu every year, and many people becoming seriously ill, having safe and effective treatment alternatives is critical,” he said, adding the caveat that, while “there are several FDA-approved antiviral drugs to treat flu, they’re not a substitute for yearly vaccination.”The Xofluza approval isn’t just a milestone for flu drug development, though—it’s a potential landmark for FDA drug approvals at large. It’s the 47th novel medicine (i.e., completely new, rather than generic or combination with an existing treatment) approved by the agency so far this year. That’s just six shy of the all-time record of 53 new drug approvals in 1996, and it’s not even November yet. The FDA has also set a record-breaking pace in generic drug approvals under Gottlieb, who has made rapid clearances a hallmark of his tenure.Subscribe to Brainstorm Health Daily, our newsletter about the most exciting health innovations."}