{"id": "Georgia's GOP Gubernatorial Candidate Opens Investigation of Democrats on Eve of Vote", "paragraph": "Georgia Secretary of State Brian Kemp, the Republican nominee for governor in Tuesday’s close election, announced a last-minute investigation Sunday into the party he’s running against “for possible cyber crimes” without citing evidence or details.In a statement, Kemp’s office said there had been “a failed attempt to hack the state’s voter registration system” on Saturday and that an investigation had been opened into the Democratic Party of Georgia. No data was breached and federal authorities have been alerted, according to the statement.The announcement came after an investigative news site, WhoWhatWhy, described vulnerabilities cited by state Democrats but did not allege attempts at hacking. WhoWhatWhy spoke with cybersecurity experts who said that any breach could not be tracked in the voter registration system. Candice Broce, a spokeswoman for Kemp, told the news site that the experts were “wrong” and unfamiliar with the system’s security.Rebecca DeHart, executive director of the Democratic Party of Georgia, said in an emailed statement that Kemp’s claims are “100 percent false” and an “abuse of power.”“This political stunt from Kemp just days before the election is yet another example of why he cannot be trusted and should not be overseeing an election in which he is also a candidate for governor,” DeHart said in the statement.Kemp has repeatedly come under criticism for his handling of the state’s elections system. On Friday, he lost in court when a federal court judge in Atlanta ruled that more than 3,100 voters who the state had flagged as non-citizens and ineligible to vote could participate in the Nov. 6 election as long as they show identification and proof of citizenship.The week before, another Atlanta federal court judge ordered election officials to create a process for contesting the rejection of absentee ballots and applications due to signatures that apparently didn’t match.Asked about the investigation on CNN’s “State of the Union” on Sunday, Stacey Abrams, the Democratic candidate for governor, said she hadn’t heard about it. She called it an attempt by Kemp to distract from the legal challenges to voting restrictions.“He is desperate to turn the conversation away from his failures, from his refusal to honor his commitments, and from the fact that he is part of a nationwide system of voter suppression that will not work in this election,” Abrams said."}