{"id": "Trump to Survey 'Incredible' Fire Damage in California Following Criticism", "paragraph": "President Donald Trump is traveling to California on Saturday to survey damage from the deadly wildfires that have killed 71 people and potentially left more than 1,000 missing, a tragedy he’s blamed on mismanagement of the state’s forests by its Democratic leaders.Trump returned to his criticism of forest management practices as he left the White House Saturday morning for the trip, calling for changes.“It should have been a lot different situation,” Trump said. “Everybody now knows that this is what we have to be doing.”He’s expected to tour the ruins of Paradise, a town all but leveled by the Camp Fire in Northern California. California Governor Jerry Brown said in a tweet that he and Governor-elect Gavin Newsom would join the president and welcomed his visit. In a tweet on Friday night, Trump thanked Brown and said he was looking forward to joining the two men: “We are with you!”The Camp Fire in Northern California is now the nation’s deadliest wildfire in a century. Eight sets of human remains were found Friday and 1,011 people are unaccounted for in Butte County, a number that’s expected to fluctuate, Sheriff Kory Honea said. The fire has burned more than 146,000 acres and was only 50 percent contained as of Friday evening, according to the Butte County Fire Department.Fires near Los Angeles have killed at least three more people.“Nobody’s ever seen what’s going on over there,” Trump said in an interview to be broadcast on “Fox News Sunday.” He added there “could be as many as 600 people killed, up by 400. It’s incredible what’s going on. And burned beyond recognition. They can’t even see the bodies.”Trump has been criticized for his response to the California fires after initially blaming the state’s Democratic-led government for mismanaging forests. He’s threatened to cut off federal funding for firefighting in the state unless its leaders improve forest management.While he has since expressed sympathy for victims and promised federal aid, Trump again criticized forest management in the “Fox News Sunday” interview, which was taped on Friday.“Maybe it contributes a little bit,” Trump said in response to a question from Fox News host Chris Wallace about the role climate change may have played in intensifying California’s regular wildfires. “The big problem is management.”An unnamed governor, he told Wallace, had explained to him that in properly tended forests that are “cleaned out,” fires can be extinguished “right away.”“And then we leave areas un-maintained, he said ‘we’ll lose 100,000 acres before you even know it,”’ Trump said.Local officials in California say Trump’s statements have been demoralizing to emergency workers risking their lives to fight the fires. His remarks are also misleading. The federal government, not the state, owns 57 percent of California’s forests, according to data from the University of California.Trump proposed cutting the U.S. Forest Service’s funding for the national forest system by 19 percent in his latest budget request. Some programs designed to reduce wildfire risk, including restoring forest landscapes, would be eliminated altogether.Officials are looking at the possible role of electrical equipment owned by PG&E Corp. and Edison International in starting the fires. PG&E shares lost almost two-thirds of their value in the week after the Camp Fire erupted, weighed down by the prospect of billions in potential liabilities.The company rebounded Friday after state officials indicated that they were reluctant to let the company go bankrupt, though there’s been no official action yet.Under state law, utilities can be held liable if their equipment triggered a fire, even if they were in compliance with safety policies. PG&E still faces about $17 billion in potential liabilities for fires last year, and Citigroup Inc. estimated the potential for this year’s blazes at about $15 billion. Within the White House, there’s concern about the impact of the fires on the companies and energy markets.The California Department of Forestry and Fire Protection said Friday that the Hill Fire, the smaller of two major blazes in Southern California, was fully contained, while the Woolsey Fire in Ventura and Los Angeles counties was 69 percent contained after torching 98,000 acres."}