{"id": "CNN's Jeff Zucker Blasts Trump's Repeated Attacks on Media and Journalists After Potential Bomb at Network", "paragraph": "Hours after CNN staff evacuated from the Time Warner Center in Manhattan due to the discovery of a suspicious package believed to be a bomb, CNN World President Jeff Zucker issued a scathing statement criticizing President Donald Trump for his attacks on media organizations.In a statement distributed by CNN’s communications arm, Zucker said, “There is a total and complete lack of understanding at the White House about the seriousness of their continued attacks on the media. The President, and especially the White House Press Secretary, should understand their words matter. Thus far, they have shown no comprehension of that.”The president has received ongoing criticism about his statements about the media, starting with his presidential election campaign, in which part of his message was to attack the accuracy and motivation of publications and networks, often targeting CNN, and calling out specific journalists as inaccurate or biased.Just five days ago, before a midterm rally in Montana, Trump praised House member Greg Gianforte for body slamming a reporter from the Guardian in 2017. Gianforte pleaded guilty to the assault.The president’s initial response to potential explosive devices at CNN and sent to former senator Hillary Clinton and Trump’s predecessor, Barack Obama, was adding “I agree wholeheartedly!” to a tweet issued by Vice President Mike Pence.I agree wholeheartedly! https://t.co/ndzu0A30vU— Donald J. Trump (@realDonaldTrump) October 24, 2018White House press secretary Sarah Sanders also tweeted a statement before President Trump, who tweets many times a day, with help from White House director of social media and assistant to the president Dan Scavino.Later the day, however, the president delivered more substantial remarks at a White House event. “The full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice,” he said. “We have to come together, and send one clear, strong unmistakable message that acts or threats of political violence of any kind have no place in the United States of America.”Some critics have noted that Trump did not mention the people whose names were on the package bombs, names he continues to invoke at political rallies.During the 2016 presidential campaign, then-candidate Trump frequently criticized the media, but his rhetoric stepped up after he was elected. In a press conference days before the inauguration, on Jan. 11, 2017, Trump refused to answer a question from CNN correspondent Jim Acosta: “Not you. Your organization is terrible,” Trump said. He continued: “I’m not going to give you a question. You are fake news.”GOP politicians at times pushed back. In February 2017, Trump called a number of media outlets, including CNN, the “enemy of the American People!”The FAKE NEWS media (failing @nytimes, @NBCNews, @ABC, @CBS, @CNN) is not my enemy, it is the enemy of the American People!— Donald J. Trump (@realDonaldTrump) February 17, 2017The late Senator John McCain replied, “That’s how dictators get started,” while Senator Lindsey Graham called the free press part of “the backbone of democracy.”In August 2018, White House Press Secretary Sarah Sanders defended one of Trump’s many uses of the phrase.Trump’s statements stepped up in 2018, however, while the response from those in his party became subdued. This year, Trump has frequently employed the “enemy of the people” phrase, leading two United Nations experts on freedom of expression to release a statement in August that Trump’s attacks on the media could trigger violence against journalists.Hundreds of newspapers in mid-August published editorials on the need for a free press, which Trump responded to by labeling the news media “the opposition party,” and accusing the paper that led the effort, the Boston Globe, of collusion with other publications.THE FAKE NEWS MEDIA IS THE OPPOSITION PARTY. It is very bad for our Great Country….BUT WE ARE WINNING!— Donald J. Trump (@realDonaldTrump) August 16, 2018The Globe received several threats that law enforcement considered serious after the editorials ran, and local police increased their presence at the paper’s offices.Most recently, Jamal Kashoggi, a journalist with The Washington Post, was allegedly murdered in the Saudi Arabian embassy in Turkey. The White House response to this crime has varied day by day and official by official, with Trump at times stating that rogue elements must have been involved and minimizing the importance of the apparent assassination. More recently, the president took a harder line, calling it the “worst cover-up in history,” and suggesting a disruption in relations with Saudi Arabia."}