{"id": "Why the U.S.-China Trade Deficit Keeps Growing Despite Trump's Tariffs", "paragraph": "One of the great ironies of the U.S.-China trade war is that, since March, when president Donald Trump began slapping tariffs on Chinese imports, America’s merchandise trade deficit with China has grown bigger, not smaller.As Financial Times’ Gillian Tett points out in this excellent column Friday, America’s September merchandise trade deficit with China jumped 4.3% to a seasonally adjusted $37 billion—a record high. The increase reflected an 8% rise in U.S. imports from China, while U.S. exports to China remained flat. And that wasn’t a monthly blip. In the third quarter, America’s deficit with China soared to $106 billion, up from $93 billion in the same period last year. For the year to September, America’s trade deficit with China has ballooned to $305 billion, up from $276.6 billion last year.What’s going on? Tett ticks through the reasons for the widening gap: the U.S. economy is firing on all cylinders and sucking in more Chinese imports as it grows; the cost of tariffs have been offset by a weaker Chinese currency; American companies are stockpiling imports ahead of the threat of even higher tariffs. She also cites the explanation of Soren Skou, chief executive of AP Maersk, one of the world’s largest shipping companies: “Chinese companies…find it a lot easier to source substitutes for American products than the US does in replacing Chinese imports.”Tett’s column sports a click-bait headline: “China is winning the trade war with America for now.” But those last two words are a significant hedge. The rising deficit with China is probably a short-term phenomenon, and seems unlikely to persist if Trump follows through with his threat to extend tariffs to all Chinese imports and raise rates from the current 10% to 25% should the two nations fail to reach a deal before the end of the year. Even so, growth in the U.S. deficit so far demonstrates, as Tett notes, “how hard it is to predict the precise consequences of a trade war.”As for the likelihood of the two nations reaching a trade deal, the odds don’t seem to have improved much over the last few days. China has floated a list of compromises it’s willing to consider ahead of the Group of 20 summit in Buenos Aires later this month when Trump and Chinese president Xi Jinping are set to meet for dinner. But Trump has dismissed that list as “not acceptable.” On Saturday, Xi, speaking at the Asia Pacific Economic Cooperation (APEC) forum in Papua New Guinea, declared that a trade war would produce “no winners“—but he offered no indication China is willing to make further concessions. US vice president Mike Pence, filling in for Trump at the APEC meeting, gave no quarter. The U.S. “will not change course until China changes its ways,” he declared. Pence also attacked Xi’s signature “Belt and Road” initiative and warned Asian nations to shun loans from China that could compromise their sovereignty.More China news below.No clause for concern. Canada and China will continue working towards a free trade deal despite implications of the recent USMCA agreement, according to remarks made by Premier Li Keqiang after meeting with President Trudeau on the side-lines of the ASEAN summit this week. The USMCA requires member states to issue a warning before pursuing free trade deals with any ‘non-market economy’ – a clause perceived to have been inserted by the U.S. to prohibit Mexico and Canada from engaging with China. South China Morning PostPolitical bank. China’s central bank has ordered all financial institutions to improve their “political positioning,” to fall in line with President Xi Jinping, and ensure support for the “real economy”. The whipping came as China released weak economic data for October, with new loans dropping nearly 50% from September. Analysts expect there will be new stimulus measures coming. South China Morning PostPig fever. China has been attempting to contain outbreaks of African swine fever for the past three months, claiming that the situation is under control. But this week the government confirmed the disease has spread to over half of the nation’s provinces and has labelled the epidemic ‘very serious’. The virus doesn’t affect humans but it is fatal to pigs. China accounts for 50% of the world’s pig stock and pork prices have spiked since the first outbreak in August. The UN described the chances of the virus being transmitted to other countries in Asia as ‘a near certainty’. Asia TimesStocking up. MSCI will add several onshore Chinese funds, including SF Holdings and 360 Security Technology, to its emerging-markets index. The change will take effect at the end of the month. ReutersMonopoly car. China has launched an investigation into the Uber-Didi tie up to see whether the merger breaches antitrust laws. Uber sold its China business to local ride-share leader Didi in 2016, leaving the combined entity control over roughly 90% of the market. Antitrust regulators flagged the deal when it occurred but no legal progress has been made, possibly because there was no legislation to properly define the ride-hailing industry. TechNodeGreat balls of fire. Never mind the artificial moon Chengdu wants to launch to illuminate the night sky, Chinese scientists now claim to have created an “artificial sun”. The scientists created a plasma six times hotter than the sun’s core. The substance burned at 100 million degrees Celsius for 10 seconds. The experiment is a step towards creating the world’s first nuclear fusion reactor. Sixth ToneUser not found. Nearly 10,000 user accounts across various social media platforms have been deleted over the last three weeks as part of a government censorship drive. The Cyberspace Administration summoned reps from Weibo and WeChat for a dressing down, accusing them of failing to manage content. In a statement, the administration said some of the removed accounts had threatened China’s social mores, while others had distorted the “history of the Communist Party”. South China Morning Post Not buying it. Pinduoduo, the Chinese “social+” ecommerce app that shot from obscurity to a $24 billion IPO in just three years has been accused of cooking its books by short seller Blue Orca. The activist fund alleges PDD’s losses last year were 65% greater than it claimed. PDD has dismissed the allegation. Elsewhere Qutoutiao, another Chinese upstart that rushed to market in September, reported losses in Q3 8886% larger than in the same period last year. The Chinese model of building presence before profit is becoming more and more costly. Financial TimesXi versus Deng, the feud over China ‘s reforms FTAlibaba Sets Singles’ Day Record With $31 Billion in Sales FortuneFor University of Minnesota, Chinese Tycoon’s Arrest Shines Light, Again, on Sexual Assault NYTChina is leading the world to an electric car future BloombergHow ZTE helps Venezuela create China-style social control ReutersChina censorship moves from politics to economics FTCongressional body call for probes into US-China ties FTFine without US. President Trump skipped the ASEAN summit this week, sending Vice President Mike Pence in his place and seemingly contradicting the White House’s assurance that Asia remains of strategic significance to the U.S. While at the summit, Pence didn’t shy from controversy. He lambasted China’s militarization of disputed island territories and remarked, “The South China Sea doesn’t belong to any one nation” – a claim the eponymous China strongly disagrees with. CNBCPacific assurances. Xi Jinping arrived in Papua New Guinea (PNG) on Friday to fanfare worthy of a returning national hero. He is the first Chinese president to make a state visit to the nation, the poorest member of APEC, where Chinese funding is having a huge impact. Australia has raised concerns about growing Chinese influence in the region and recently launched a Pacific infrastructure fund as an alternative to China’s Belt and Road Initiative. The GuardianKindred spirits. Fifteen Western ambassadors in China, under leadership from Canada, signed a letter demanding a meeting with Xinjiang Party Secretary Chen Quanguo as evidence of government oppression in the region mounts. Foreign ministry spokeswoman Hua Chunying accused the diplomats of ‘interfering’ in domestic affairs. Meanwhile, China offered support to Myanmar as global criticism over the Rohingya crisis continues. Premier Li Keqiang told Aung Sang Suu Kyi his government supports Myanmar’s “efforts in maintaining its domestic stability”. Reuters This edition of CEO Daily was edited by Eamon Barrett. Find previous editions here, and sign up for other Fortune newsletters here."}