{"id": "Canada Goose Is Turning the Dressing Room Into a Freezer", "paragraph": "Canada Goose Holdings Inc. wants its customers to know what real cold feels like—from the comfort of a $1,000 parka.The company is adding frigid rooms to some of its stores where shoppers can test the luxury coats in temperatures as low as -25 degrees Celsius (-13 Fahrenheit). A Montreal location, which opened Friday, is the fifth to include the fancy freezer, and Beijing will join later this year as the company rolls out its China expansion plan.“People tell me all the time trying on a Canada Goose jacket was the first time that they ever truly felt warm in cold climates,” Chief Executive Officer Dani Reiss told analysts this week. “With our cold rooms, we are creating that moment even before they purchase.”The rooms have become selfie magnets, some with sculpted ice blocks lining a glass window. They are part of Canada Goose’s plan to increasingly sell directly to consumers after decades of relying on wholesalers. Putting its coats to the test in a subtropical place like Hong Kong also helps the brand tout its authenticity in new markets while it adds lighter products to its collection.“The ability to experience the feel of a coat at a given temperature is a smart concept that goes beyond buzz,” says Greg Portell, lead partner at consultant A.T. Kearney’s retail practice. “They are removing a key barrier to consumer purchase.”While Canada Goose’s small retail network–11 stores to date—and its high prices make the concept workable, it would be a challenge to scale up, Portell says. The company, which used cold chambers at trade shows in the past, first tried one in a store in Tokyo last year. Short Hills, New Jersey, Hong Kong and Boston followed.“People in Tokyo, where it rarely goes below into the minuses, went ‘oh wow, this actually works!”’ says Chief Marketing Officer Penny Brook.For most of its 61-year history, the Toronto-based company sold practical winter gear for use in the Far North. Now it offers dozens of jackets split into five categories that match a temperature range. Its warmest model, a 247-piece parka designed for Arctic expeditions, costs $1,550 in the U.S. and is almost sold out online.“A smart concept that goes beyond buzz.”Customers are escorted to the room by staff who helped them pick out the gear. They can stay as long as they want and get an extra kick from a wind-chill button. On a freezing November morning in Montreal the experience wasn’t so different from walking outside, but tourists and die-hard fans who buy coats in the summer will probably enjoy the cold room more on a sweltering August day.It was certainly a selling point for Rachel Zhang and her boyfriend Guo, who snapped pictures of themselves in Montreal’s cold room, which was a frosty -15 Celsius. They both bought jackets, her second and his fourth by the brand.“It’s fun,” said Zhang, a Montreal resident. “It also reassured me.”The cold room adds to retailers’ ongoing efforts to offer shoppers a memorable experience in brick-and-mortar stores–from Lululemon Athletica Inc.’s running club and yoga classes to Vitamin Shoppe Inc.’s beverage bars–says Deborah Weinswig, chief executive officer of retail think tank Coresight Research.Canada Goose’s Brook sees it as an opportunity to strengthen the brand’s relationship with customers.“We really want to show them what we’re made of,” she says. “This is the perfect way of doing it.”"}