{"id": "Brainstorm Health: Amarin Fish Oil, Athenahealth Deal, Guns and Doctors, Veterans' Health", "paragraph": "Happy Monday, readers!There’s a fishy story rippling through the life sciences today.On Monday, Dublin-based biopharma Amarin stock sank about 7% (and, at some points during the trading day, as much as 15%) following a tug-of-war narrative over its prescription strength fish oil drug Vascepa—and just how much of a benefit the treatment may present in reducing cholesterol and, consequently, fighting cardiovascular disease.Let’s recap. The debate was set off by detailed results published in the New England Journal of Medicine and presented at the American Heart Association (AHA) meeting in Chicago over the weekend that highlighted some impressive ways Vascepa appeared to protect high cholesterol patients from heart-related illnesses and death. The so-called REDUCE-IT study concluded that patients who took the drug, rather than a placebo, experienced a sharp reduction in risk of having serious (and potentially deadly) cardiovascular events such as the possibility of death, heart attack, or stroke. By about 26% across the categories, in fact.Amarin had telegraphed these results in earlier, partial study releases. “The Vascepa fish oil capsule reduced the risk of certain serious cardiovascular events (such as stroke and heart attack) for certain heart patients (those who had high levels of triglyceride fats in their blood and high cholesterol levels being held in check by statins) by 25% compared with placebo. That’s an eye-popping figure when it comes to the heart health space,” as I wrote in September.The fish oil drug’s promise helped Amarin’s stock soar about 600% over the past three months despite Monday’s slide (although that percentage is also attributable to the shares’ historically low prices).But some investors and industry observers are raising their eyebrows over the precise nature of the placebo used in the Vascepa trial. Amarin’s placebo used a mineral oil which could theoretically boost trial participants’ “bad” cholesterol levels. That could, in turn, make the fish oil’s performance in reducing cardiovascular risk appear particularly strong (or so the thinking seems to go among the more skeptical).Those concerns, however, may not derail Amarin’s quest to get the Food and Drug Administration (FDA) to slap a favorable label on Vascepa (which was approved by the agency six years ago) showing serious heart health benefits. Heck, even the investor fretting eroded over the course of the day. And Amarin’s chief executive is expressing nothing but confidence.“We are a science-driven company that is focused on helping patients. With these results, we’re in a position to help millions more patients,” said Amarin CEO John Thero in a statement, adding that the company plans on submitting data to the FDA next year.We’ll find out soon enough how that review goes.Read on for the day’s news.Athenahealth to sell for $5.47 billion. Medical IT firm Athenahealth finally has a buyer. The firm, formerly led by the outspoken (and controversial) Jonathan Bush prior to his resignation, will be snatched up by a pair of private equity firms (Veritas Capital and Elliott Management-affiliated Evergreen Coast Capital) for nearly $5.5 billion in cash. Athenahealth will reportedly be combined with Virence Health Technologies, another IT firm that used to be housed under GE Healthcare and was then bought by Veritas. If you’re wondering whether there’s a connecting thread in all this: Athenahealth’s executive chairman is Jeff Immelt, the former CEO of GE. Athena shares rose nearly 10% in Monday trading. (Wall Street Journal)Landmark Ebola treatment trial set to launch in Congo. A significant Ebola treatment clinical trial is about to launch in the Democratic Republic of Congo, which has been experiencing a deadly outbreak that’s prompted a mass vaccination campaign in recent months. In this case, three different therapies meant to fight Ebola infection will be tested in a randomized clinical trial (it will not include a placebo element, in part because of the highly difficult, and often violent, environment in which it is being deployed). Such an intriguing trial design underscores how difficult the Ebola treatment process is, and how long (and how many more outbreaks) it could take to determine which therapies are most effective. (STAT News)Veterans’ health care. Sunday marked Veterans Day, an occasion to honor Americans who have served in the armed forces. Festivities marking the event (which coincides with the end of World War I) include parades, memoriams, and high-flying speeches. So what about the health services provided to our modern day veterans? Here’s what the U.S. Department of Veterans Affairs itself has to say in an update from less than two months ago: “There are approximately 20 million Veterans in the U.S.—around 18 million men and 2 million women. Of these 20 million, fewer than half receive VA benefits or services. Approximately 6 million Veterans (around 30 percent) receive VHA services… In comparing 2015 and 2016 data, there is a decrease in the Veteran unadjusted rate of suicide from 30.5/100,000 to 30.1/100,000. For some subgroups of the Veteran population, suicide rates are rising. Specifically, for Veterans age 18- 34, suicide rates substantially rose since 2005.”Doctors rebuke NRA over gun violence comments. The National Rifle Association (NRA), America’s main gun lobby, threw down the gauntlet on physicians and academic journals reporting on the public health threat presented by gun violence, telling physicians to “stay in your lane” when it comes to firearm public policy. America’s doctors seem prepared to throw the gauntlet right back, as NPR reports, noting that the vast number of patients, and especially young Americans, treated in their facilities for gunshot wounds makes the issue relevant to their professions. (NPR)Fortune’s Good Fortune, by Alan MurrayFacebook Is the Least Trusted Major Tech Company When It Comes to Safeguarding Personal Data, Poll Finds, by Jonathan VanianGoogle and Microsoft Back Emmanuel Macron’s New Plan to Protect the Internet, by David MeyerWhy SAP Is Buying Qualtrics for $8 Billion, by Adam Lashinsky Find past coverage. Sign up for other Fortune newsletters."}