{"id": "The things you can NEVER put in your bin: New rules on what you can chuck out at home", "paragraph": "By\n\nSahar Mourad For Daily Mail Australia\n\nPublished:\n  19:45 EST, 30 October 2018\n\n | \nUpdated:\n  19:54 EST, 30 October 2018\n\n          75View  commentsA second Australian state is introducing strict new laws that will restrict what residents can and can't throw out in the rubbish.Victoria's state government will introduce a ban on e-waste being dumped into landfill from next year.The law means residents wanting to get rid of old electronic goods will need to drive to a 'designated station' to properly dispose them or be in risk of breaking the law.Victoria is following the lead of South Australia, which made the environmental change back in 2013.  Electronic goods dumped in landfill release damaging toxins into the air. Victoria's state government will introduce a ban on e-waste being dumped into landfill from mid next year (stock)They are following the lead of South Australia who made the environmental change back in 2013 (stock)E-waste is currently growing up to three times faster than general waste, with state governments keen to work on having all the materials recycled. Sustainbility Victoria's CEO Jonathan Leake estimates that the country's e-waste will increase more than 60 per cent to a predicted 223,000 tonnes by the year 2024. 'Australians are high users of technology and among the largest generators of e-waste in the world,' he told Australia's leading waste management CleanAway.'Recycling captures valuable metals as well as plastics and glass, so they can be reused in the next wave of technology rather than mining or making new material.' Stan Krpan, the head of Sustainability Victoria, told news.com.au that e-waste is the fastest growing waste in the world and the amount of waste is expected to double in the next 10 years. 'In the next 10 years, we'll actually double the amount that we're producing,' Mr Krpan said.'Rather than put it in a bin, or a council collecting it and putting it in landfill, you'll need to take it to a designated recycling station.'  Sustainbility Victoria's CEO Jonathan Leake estimates that the country's e-waste will increase more than 60% to a predicted 223,000 tonnes by the year 2024 (stock)'Rather than put it in a bin, or a council collecting it and putting it in landfill, you'll need to take it to a designated recycling station' (stock)E-waste (electronic waste) refers to any item with a plug, battery or cord that is no longer working or wanted.It ranges from mobile batteries, TVs, laptops, tablets and other various electronic devices. The ABC reported that Australia is estimated to produce hundreds of thousands of tonnes of e-waste a year and most of it does not have a dedicated recycling scheme.  All e-waste can contain hazardous materials such as lead, mercury and cadmium to ozone-depleting chlorofluorocarbons (CFCs) and flame retardants.These dangerous chemicals cause environment contamination and when stored incorrectly can cause serious damage.   These substances can leach into soil and groundwater, or release into the air, creating long term environmental contamination issues, according to Sustainability Victoria. 'Many of these substances are particularly dangerous because they do not break down easily, meaning they stay in the environment for a very long time.'   - Phone chargers- IT cords and cables- Printer cartridge- Hard drives- Modems- Scanners- Faxes- Satellite navigation systems- Multi-adapter plugs- Printer- Keyboard- Refrigerator- Washing machine- Dryer- Fluorescent tubes- Light bulbs- Computer hard drives- Internal and CD drives- Monitors- Laptop- Mobile phone- Batteries- Headphones- Computer mice- Web cameras- USBs- iPad- Tablet- Notepads- Palmtops- Television- Camera                                                                                              Source: Sustainability Victoria   Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}