{"id": "MAFS' Telv breaks Derby Day's number one rule while failing to make it into The Birdcage", "paragraph": "By\n\nDaily Mail Australia Reporter\n\nPublished:\n  18:46 EST, 4 November 2018\n\n | \nUpdated:\n  20:08 EST, 4 November 2018\n\n           8View  commentsIt appears that Married At First Sight's Telv Williams failed to secure a ticket to The Birdcage exclusive enclosure at Flemington Racecourse for Derby Day on Saturday.Despite begging fans for a spare ticket to gain entry to Furphy Deck party in VIP area, Telv, 34, was left to mingle in the general admission area.And it's a surprise that the reality star was even permitted entry to the general public area at all, after breaking one of Victoria Racing Club's strictest of rules on the day.Scroll down for videoNo longer a VIP? MAFS' Telv Williams breaks Derby Day's number one rule while failing to make it into The Birdcage ...after begging for a ticket from fans online Showing his apparent flare for fashion, the former TV personality arrived at the event having styled his suit with a pair of white Converse trainers.Although his choice of footwear may seem unexpectedly casual for the occasion, it is also a clear breach of the strict 'gentlemen's dress regulations' the club has set. The VRC website strongly states that men are 'required to wear dress shoes' - and this dress standard is 'strictly enforced throughout the racing season'.A list of 'not acceptable' forms of footwear includes; joggers, sports shoes, track shoes, runners, sandals and thongs.Not permitted! Showing his apparent flare for fashion, the former TV personality arrived at the event having styled his suit with a pair of white Converse trainers - a clear breach of the strict 'gentlemen's dress regulations' the club has set, which states men must only wear 'dress shoes'It is unclear how Telv slipped through security upon his arrival on Saturday while wearing his 'inappropriate' box fresh sneakers.However, once inside the event, attention was mostly fixed on the reality stars that had secured an invite to The Birdcage.While Telv mingled with the public and purchased his own drinks, stars of The Bachelor and The Block were sipping free champagne among the elite.  Taking to his Instagram Stories on Tuesday before the event, the father-of-two pleaded to his fans in an attempt to secure entry into the famous area.Don't celebrities get to enter for free?T aking to his Instagram Stories on Tuesday before the event, the father-of-two pleaded to his fans in an attempt to secure entry into the famous area (Pictured with co-star Dean Wells in Sydney recently) Please? Taking to his Instagram Stories on Tuesday, the father-of-two shared a pleading message to his fans in an attempt to secure entry into the famous event'Is anyone selling a Furphy Deck ticket for Derby Day?' the FIFO worker wrote. Telv then told Daily Mail Australia on Wednesday: 'They sold out so I wanted to buy one as my 2 mates are going; they are tickets to the Furphy Deck.'I'm paying, not asking for freebies.' Remember them? Telv rose to fame on Married At First Sight as the TV 'husband' to Sarah RozaPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}