{"id": "Schoolies revellers splash in the waves and wrapped in blankets after first night of celebrations", "paragraph": "By\n\nAlex Chapman\n\n\nand \nSam Lock For Daily Mail Australia\n\nPublished:\n  18:49 EST, 17 November 2018\n\n | \nUpdated:\n  18:49 EST, 17 November 2018\n\n           4View  commentsNight one of Schoolies is in the books, with teenage revellers across the country seen celebrating the end of their high school studies in rowdy fashion.Torrential rain and intense winds couldn't slow down hordes of school-leavers celebrating at popular beach spots Surfers Paradise and Byron Bay on Saturday night.The cold weather didn't stop a pair of party-goers, who opted for a late night splash in the Byron Bay surf. For others, the chills were too much to bear, with one girl seen wrapped in a warm blanket while walking down the street.Night one of a chilly Schoolies has come to an end, with party-goers seen celebrating the end of the night in their own waysOne girl opted for a splash in the surf at Byron Bay, dressed in shorts and a black tank top despite rain and windsA bold reveller ventured into the waves to splash with her, carrying her out with the water up to his kneesThe two didn't seem to mind the cold weather - seen laughing as they made their way out of the waves for dry landChilling winds appear to have gotten to one girl, who was spotting draped in a warm blanket through the streets of Byron BayThe end of the night had to come eventually, with one couple taking to a shopping trolley on their way homeOne party-goer was seen looking worse for wear, slumped onto a friend's shoulder as she called for a ride home The rain didn't stop the beach-going duo, who were seen knee-deep in the waves early into Sunday morning.One young lady had to be carried out of the waves after she was seen splashing at her partner-in-crime, before hopping on his back.Inevitably, the end of the night saw people making their way home to their hotel rooms.One trio of girls were seen on their phone organising a lift, while another pair took the trip into their own hands a rode a shopping trolley to their accommodation. Teenage revellers refused to let a bit of wet weather ruin their fun as they donned festive outfits (right) despite a torrential downpour of rain and wind. But celebrations became too much for some, with one teen hitting the sand before midnight (left)Crowds of teenage revellers  descended on the Surfers Paradise party strip (pictured) to celebrate the annual end of exams celebrationsOne girl creatively uses a traditional Vietnamese hat to shield herself from the rain (left) as she and her friend dash across the road. Another uses a tarpaulin cover to keep dry (right)Partying teens were seen bare foot and in shopping trolleys as they poured out onto the streets during the night of celebrationsHeavy downpours and wind didn't stop thousands of teenage revellers from descending on the beach spots, though some chose to sport rain coast and ponchos. The rain provided no relief for emergency crews either, who were flat out attending to party-goers as the annual end of exams celebrations kicked off for its first night ahead of a fortnight of inevitable carnage.Emergency crews had their first taste of what's to come - contending with thousands of rowdy graduates who flocked to the usually sunny strip of beaches to let their hair down.Before midnight, the celebrations became too much for one teenage girl who was seen being lifted into an ambulance on a stretcher with a friend by her side.Stylish! These fashionable and practical school-leavers donned a set of ponchos for the evening as they battled against the rain and wet weather Before the night even reached midnight, the celebrations became too much for one girl who was seen being lifted into an ambulance on a stretcher with a friend by her sideThe show must go on: One eager school-leaver appears to be looking for a ride as she braves the rain along Surfers Paradise's party strip in gold sparkly pants and a tropical swimming top as another Schoolie is escorted from the strip by police (right)A severe storm was reported approaching the party strip early Saturday evening, with winds of up to 59km/h recorded at the Gold Coast Seaway just after 6pm.But the rain and cold didn't spoil the night's festivities as teenagers appeared unfazed by the gloomy weather, instead packing into the event to celebrate their final school year with music and dancing. Plenty of selfies were snapped with revealing crop tops, tight singlets and denim miniskirts all popular choices with the teens as they spilled out onto the streets and across the beach ready to let their hair down.But police had bigger concerns to contend with after vowing earlier in the week to crackdown on drug supply to the party scene, making dozens of arrests even before the event officially started.A group of teenagers huddle under a Red Frogs stand as volunteers distribute snacks (pictured) - part of hundreds of volunteers who will be on hand to help those who need respite or medical aid due to the effects of partyingThe rain and cold didn't spoil the night's festivities as teenagers appeared unfazed by the gloomy weather (left), instead packing into the event to celebrate their final school year with music and dancingA group of school-leavers crowd around one young man who is seen lying on the sand after a night of heavy partyingVolunteers (left) and police (right) were on hand to provide some order during the festivities. Nearly 50 arrests were made in Surfers Paradise last year, with dozens of teenagers busted for drug possession and brawlingTrump gets close to see California wildfire devastationP Diddy's late ex Kim Porter plays around with her kidsLouis Klemp tells black woman he belongs to 'master race'Andrew Gillum concedes Florida Governor's raceTouching video shows Winnie-the-Pooh comforting disabled toddlerCell phone video captures men dancing with bikini clad womenHilarious moment a tiny dog confronts mating lionsUS search team find Argentine submarine at bottom of Atlantic OceanTrump heads to wildfire ravaged California to assess damagePaedophile attacks girl 10, before being stopped by passer bySaudi woman posts Twitter clips wearing abaya inside out in protestMother and boyfriend sentenced for the death of 19-months old girlGold Coast Superintendent Mark White said during Schoolies officers will use a range of 'overt and covert' strategies to prevent drug dealing, particularly in the Schoolies precinct.'If people think they come into this event and gain some advantage or push drugs onto young people they are going to be in for a rude shock,' he said. Nearly 50 arrests were made in Surfers Paradise last year during Gold Coast's annual rowdy event, with dozens of teenagers busted for drug possession and brawling. This year, agencies such as the police, the dog squad, mounted police, Red Frogs Australia and State Emergency Services said they were prepared and on hand to help out.Excited teens spilled out onto the streets (left) and across the beach ready to let their hair down as many school leavers test their limitsPolice had bigger concerns to contend with after vowing earlier in the week to crackdown on drug supply to the party scene, making dozens of arrests even before the event officially startedDespite the colder weather, many wore revealing low-cut tops, tight singlets and denim shorts (left). Older revellers were also warned against 'prowling' on younger party-goers, with police saying they will also be keeping a close eye on 'Toolies'Despite an estimated 80 per cent of attendees being underage, most are likely to  drink heavily during the celebrations.Teenagers taking part in the raging two-week-long celebration  have become renowned for disturbing and often dangerous antics.'Many people say \"ban Schoolies, let's just close the airport and anyone under 17 can't come in to Surfers Paradise\" - (but) we can't hold back the tide,' Schoolies Advisory Committee Chair Mark Raeburn told Seven News. 'Our concern is always what goes on in the rooms, but we can't be there,' Mr Raeburn said.Mr Reaburn said his team of 11,000 volunteers was ready to make sure the kids have a great time but do it safely.'It's not a party, what we coordinate is a response (to thousands of students) congregating in Surfers Paradise in what is known as a right of passage,' he said.Eighty per cent of the school leavers who come will be 17-years-old and many were going to push the limits, he said.'(That's) a lot of kids being away from mum and dad for the first time in their lives, with each other, essentially moving out into the big wide world,' he said.And they regularly go beyond what they can cope with both emotionally and physically, he said.'That's why our mantra for the kids is: be safe and watch your mates,' he said.The Queensland Ambulance Instagram page uploaded an image of two officers posing with the 'be safe and watch your mates' posters they have strewn around the city.  The Queensland Ambulance Instagram page uploaded an image of two officers posing with the 'be safe and watch your mates' posters they have strewn around the city (pictured)Queensland paramedics help one party-goer into an ambulance (pictured). Hundreds will be on hand to help those who need respite or medical aid due to the effects of partyingOlder revellers have also been warned against 'prowling' on younger party-goers, with police saying they will also be keeping a close eye on 'Toolies'.'If you want to come to Surfers Paradise and play up, be assured you will be arrested,' South Eastern region Assistant Commissioner Brian Wilkins told the Gold Coast Bulletin.'It's not the place to come and prowl upon schoolies.   'We will have a very strong police presence policing all the schoolies but also all the toolies.' Despite an estimated 80 per cent of attendees being underage, some party-goers who have already left school - in some cases many years ago - join the thousands of teenagers for the annual end of exams celebration. Of the nearly 50 arrests that were made in Surfers Paradise last year during the event, most were 'toolies' rather than students, Gold Coast Schoolies Advisory Group chairman Mark Reaburn said.Despite the inevitable carnage inflicted on the seaside resort town every year, authorities said there was not a lot they could do to stop the kids comingEighty per cent of the school leavers who come will be 17-years-old and many were going to push the limits, Schoolies Advisory Committee Chair Mark Raeburn saidColourful Hawaiian shirts and fruit-themed outfits were popular choices for some of the party-goers at this year's eventHundreds of volunteers will be on hand to help those who need respite or medical aid due to the effects of partying, but they say not all those need urgent help. The Schoolies community safety response, which includes the Schoolies Hub and an ambulance treatment centre, provides school leavers with alcohol and drug-free diversionary activities, safety advice, and support while they party the week away. Closely-watched and cordoned-off party zones with high fences and soft beach sand have been carefully thought out by the organising committee. They provide safe, high security areas for teens to go about their partying and hopefully wear themselves out.    Earlier in the day, plenty of teenagers were farewelled at airports and hotels, as parents helped set them up with the essentials.Cartons of drinks were the number one item on the list it seemed, with parents helping to cart the beverages.Plenty of teenagers were spotted carrying cartons of drinks earlier in the dayEarlier in the evening, teenagers stocked up on necessities, hauling multiple bags of ice over their shoulders, on their heads (right), or in the case of one distressed-looking man in a Hawaiian shirt and pink shorts, tucked under each arm (left)Year after year being a trashy ho seems to be righ...\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}