{"id": "George Calombaris reflects on his 'turbulent' period after underpaying staff and assaulting a fan", "paragraph": "By\n\nErin Doyle For Daily Mail Australia\n\nPublished:\n  18:43 EST, 12 November 2018\n\n | \nUpdated:\n  20:54 EST, 12 November 2018\n\n           1View  commentsHe's been at the centre of several  scandals over the past couple of years. From underpaying staff, to assaulting a teenage football fan and an ongoing bitter dispute with his neighbour, George Calombaris has been making headlines for all the wrong reasons.But it appears the MasterChef judge is doing his best to put the turbulent times behind him, telling The Daily Telegraph on Tuesday that he's made mistakes but now just wants to move on.'Let's not kid ourselves, I flew very close to the sun': Speaking to The Daily TelegraphGeorge Calombaris reflected on his 'turbulent' period... after he hit headlines for underpaying staff, assaulting a teenage fan and feuding with his neighbour'There is no question about it, it was a turbulent time, let’s not kid ourselves, I flew very close to the sun,' George told the publication.'I might be really little but I have a heart of a lion and I don’t want to be a flock of sheep. I want to do things my way and sometimes you are going to make mistakes.' George added that he is looking to the future despite his misgivings in the past, and credited his friends and family for helping him get through.'I have had plenty of time to sit and reflect and I’ve had time to get sense of what I was doing. All I can do is go forward,' he said.Business scandal: The TV personality came under fire late last year when it came to light he was underpaying his restaurant staff, and was forced to fork out $2.6 million in unpaid wagesThe TV personality came under fire late last year when it came to light he was underpaying his restaurant staff.In September 2017, he looked determined to make good on his promise to fork out $2.6million in unpaid wages to his staff within weeks.His company, Made Establishment, announced that it will settle all claims by mid-October after staff were told they could wait up to a year to receive compensation. Another scandal:  In September last year, George pleaded guilty to assaulting a 19-year-old man at soccer game, but the conviction was later overturnedTrouble then followed the Network Ten personality to a sporting ground.Last September, George pleaded guilty to assaulting a 19-year-old man in May of that year during the A-League Grand Final between Melbourne Victory and Sydney FC.Footage captured at the event showed George approaching the fan after he yelled abuse at him over the underpaid wages of his restaurant employees.In the video shown to court, George called the victim a 'big-mouth man' and a 'dodgy c***' before punching him in the abdomen.It was reported in October that George had been fined $1,000 over the incident, however the conviction was later overturned on appeal.Oh dear: In the video shown to court, George called the victim a 'big-mouth man' and a 'dodgy c***' before punching him in the abdomenMeanwhile, George also made headlines earlier this year over an ongoing bitter dispute with his neighbour.George and his wife Natalie Tricarico infuriated their neighbours in Toorak, Melbourne when they built a 'monstrous' gym in their backyard.The couple's 71-year-old neighbour Helen Elsworth claimed the self-contained gym in the garden of his property was robbing her of her privacy.Speaking to A Current Affair, Ms Elsworth said her famous neighbour's gym 'looks like a public toilet' and that she can see it from her bedroom window.'I've got to keep the blinds closed day and night, well all day. Shocking,' she said. 'He's the worst neighbour I've had in my life.' 'He's the worst neighbour I've had in my life.' 'He's the worst neighbour I've had in my life': George also made headlines earlier this year over an ongoing bitter dispute with his neighbour Helen ElsworthEyesore: Speaking to A Current Affair, Ms Elsworth said her famous neighbour's gym 'looks like a public toilet' and that she can see it from her bedroom window. Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}