{"id": "Hobbled Starc unlikely for Pakistan T20s", "paragraph": "By\n\nAustralian Associated Press\n\nPublished:\n  19:53 EST, 20 October 2018\n\n | \nUpdated:\n  19:53 EST, 20 October 2018\n\nMitchell Starc appears unlikely to be risked during Australia's T20 series against Pakistan after having tests on his injured hamstring.The left-arm quick battled tightness in his left hamstring and was used sparingly during the second Test in Abu Dhabi, which Pakistan won to clinch a 1-0 series victory.Starc had precautionary scans on Friday night and is understood to have avoided any serious damage.He will remain in the UAE for the T20 fixtures and has not been ruled out of playing despite Peter Siddle being held over as back-up.However, the sense within the Australian camp is that Starc can benefit from staying on tour because it will allow team medical staff to monitor his recovery.The priority will be ensuring Starc is fit to play in next month's home one-day international series against South Africa and the marquee Tests against India.Starc looms as one of several multi-format stars who must be carefully managed during a cramped summer schedule.T20 skipper Aaron Finch, Mitch Marsh and Nathan Lyon could also feasibly play in all three formats over coming months, forcing selectors to balance requirements for the limited-overs fixtures against the need for red-ball practice.Finch was among Australia's best performers in the UAE Tests but scheduling clashes could leave him playing just one Sheffield Shield round before the first Test in Adelaide.\"You've got to pick your best T20 side and you've got to pick your best one-day side,\" coach Justin Langer said ahead of the T20s.\"If you ask the players, they want to play for Australia. They love playing for their states but you love playing international cricket.\"Australia will play three T20s against Pakistan starting in Abu Dhabi on Wednesday before the final two games are played in Dubai.The tourists are also set to play a warm-up game against the UAE on Monday which has been granted full international status.It will be Australia's first meeting in any format with the nation ranked No.13 on the ICC's T20 rankings.Australian T20 squad: Aaron Finch (capt), Mitch Marsh, Alex Carey, Ashton Agar, Nathan Coulter-Nile, Chris Lynn, Nathan Lyon, Glenn Maxwell, Ben McDermott, Darcy Short, Peter Siddle, Billy Stanlake, Mitchell Starc, Andrew Tye, Adam Zampa.Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}