{"id": "National Trust is embroiled in ANOTHER row over political correctness", "paragraph": "By\n\nDavid Wilkes for the Daily Mail\n\nPublished:\n  18:53 EST, 12 November 2018\n\n | \nUpdated:\n  04:14 EST, 13 November 2018\n\n         381View  commentsThe National Trust was embroiled in another row over political correctness last night after being accused of dropping the terms BC and AD.David Pearson, a member for 32 years, told how his visit to a historic house had been ruined by the omission.A timeline at Avebury Manor in Wiltshire used BCE (Before Common Era) and CE (Common Era) instead of Before Christ and Anno Domini (the year of Our Lord).A timeline at Avebury Manor in Wiltshire (PICTURED) used BCE (Before Common Era) and CE (Common Era) instead of Before Christ and Anno Domini (the year of Our Lord)Mr Pearson, 63, of Haworth, West Yorkshire, said the ‘politically correct’ terms spoiled the visit for him and his wife Elaine, 56.‘I had to ask what they meant. I’m educated to Master’s standard in history so am not a numbskull,’ said the retired banking consultant. ‘I was told they used those terms so as not to offend non-Christians. A member of staff said they’d had an awful lot of complaints about using them.’The trust has also been criticised for asking volunteers to reveal their gender identity and making some helpers wear gay pride badges.Mr Pearson, 63, of Haworth, West Yorkshire, said the ‘politically correct’ terms spoiled the visit for him and his wife Elaine, 56In another row, it was derided for covering up pictures depicting men at Cragside house in Northumbria to highlight ‘a lack of female representation in art’. In the latest controversy, a Church of England spokesman said BC and AD ‘obviously reflect Britain’s Christian heritage’ although both sets of terms were used.Dr Michael Nazir-Ali, former Bishop of Rochester, said using BCE and CE ‘amounts to the dumbing down of the Christian basis of our culture, language and history’.He added: ‘Whether you use CE or AD, the date is actually still the same and the reference point is still the birth of Christ.’ Only ‘aggressive secularisers’ would not like the use of BC and AD, said Dr Nazir-Ali. Mufti Barkatullah, of the Islamic Shari’ah Council, said: ‘Nobody finds BC or AD offensive as a way of denoting periods of time.’A National Trust spokesman insisted: ‘Our editorial style is to use AD and BC.’ He said the charity will look into the use of BCE and CE at Avebury Manor and on some of its 19,000 website pages.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}