{"id": "Coleen Rooney displays her phenomenal frame in low-cut bikini on family holiday in Barbados", "paragraph": "By\n\nRianne Addo For Mailonline\n\nPublished:\n  19:55 EST, 30 October 2018\n\n | \nUpdated:\n  10:09 EST, 31 October 2018\n\n         105View  commentsShe's been soaking up the sun during her scenic Barbados getaway. And Coleen Rooney looked every inch the siren as she frolicked around the Sandy Lane Hotel on the Caribbean island earlier this week.The WAG, 32, proved to be in good company as she was joined by her eldest son Kai, eight, who delighted on a jet-ski ride along the clear blue sea.Sleek: Coleen Rooney looked every inch the siren as she frolicked around the Sandy Lane Hotel on the Caribbean island earlier this week\n\n\n\n\n\nChio dress with lace insertsShop it here...\nBuy now\nShe's constantly jetting off to exotic locations so if there's anyone to turn to for holiday wardrobe inspiration, it's Coleen Rooney!Enjoying a sunny break in Barbados, Coleen was spotted looking beach-chic in a striped Vix bikini and pretty much the white sun dress of our dreams...It's by Chio and we adore the classic cut-out crochet design, cute frill hem and double straps. Click right now to snap up this suitcase-worthy style for yourself! It's a total must-have for any sunny break.You can also shop Coleen's bikini below, plus have a browse through our edit of budget-friendly alternative sun dresses if you're saving up for flights instead...Vix 'Lee' bikini at Simply Beach\nBuy now\nAsos drop waist sun dress\nBuy now\nAsos sun dress with ruffle hem\nBuy now\nEn Creme crochet dress (now reduced to £18 at Asos)\nBuy now\nMelissa Odabash white lace beach cover up\nBuy now\nFormer OK! magazine columnist Coleen cut an effortlessly glamorous figure as she slipped into a monochrome striped halterneck bikini top and matching briefs.Maintaining her chic display, the mother-of-four flashed her lean legs as she rocked a sheer kaftan with crochet embroidery.Coleen tied her tresses into a sleek bun to reveal her naturally radiant complexion while protecting her eyes from the sun in a pair of oversized cat-eye sunglasses.Having fun: The WAG, 32, proved to be in good company as she was joined by her eldest son Kai, eight, who delighted on a jet-ski ride along the clear blue seaWow-factor! Former OK! magazine columnist Coleen cut an effortlessly glamorous figure as she slipped into a monochrome striped halterneck bikini top and matching briefsGlowing: Maintaining her chic display, the mother-of-four flashed her lean legs as she rocked a sheer kaftan with crochet embroideryColeen and Kai have been enjoying the family holiday with mum Coleen, as well as his three younger brothers, Klay, seven, Kit, two, and Cass, eight months.Their trip to Barbados is Coleen's fourth holiday this year. She enjoyed a break on the Caribbean island in May, before heading to Disneyland Paris in June and Portugal in July. Meanwhile, she's been settling into life in the States after husband Wayne signed a three-and-a-half-year deal with with D.C. United in June.Beaming: Kai appeared in high spirits as he returned from a fishing tripA good catch! The eldest son of the Rooney clan beamed with delight as he showed off his fishing netPlaying around: Kit, two, looked as if he was having a whale of a time as he relished on the sandy shoresThe Liverpudlian beauty embraced more US customs as she got into the Halloween spirit by sharing a snap of her three eldest sons perched upon a pumpkin at the Six Flags America theme park in Maryland on Tuesday.Kai wore a comfortable grey tracksuit as he cuddled his younger brothers Kit and Klay.Coleen confirmed her family's move Stateside in July and fans have since seen the Rooney clan touch down across the pond and settle into their new home.  The Halloween snap comes as Coleen is said to be loving her new life across the Atlantic. A source recently told The Mirror: 'Coleen looks to be loving life in the States. Back at home she gets recognised everywhere, but here she goes about her business without being stopped. It’s like she has a normal life back.' Adorable: Meanwhile, she's been settling into life with her brood in the States after husband Wayne signed a three-and-a-half-year deal with with D.C. United in JunePublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}