{"id": "Being bitchy shaped human evolution by making our brains BIGGER, according to a new book", "paragraph": "By\n\nLeah Simpson For Dailymail.com\n\nPublished:\n  18:54 EST, 17 November 2018\n\n | \nUpdated:\n  18:56 EST, 17 November 2018\n\n          32View  commentsForming cliques and gossiping ensured our survival according to a new book, which claims that forming connections by ostracizing people has been beneficial to growing the brain.William von Hippel says in his new release The Social Leap that when our chimp ancestors were forced out of the rain forest and into grasslands 10 million years ago, the need to form new alliances and stay safe from predators encouraged the shift in the way we still socialize today.Eventually forming the first early human species Australopithecus afarensis, about 3 million years ago, the chimp-like forms grew more elastic muscles in their hips, wrists and shoulders to survived in stone-throwing groups.Bitching and ostracizing people started with protecting groups from medical threats but it has continued into modern day despite the necessityThose who ran away from potential danger instead of joining the activity were ostracizedAs upright man developed feelings of shame and guilt did too for hunter-gatherers who failed to bring home enough meatThose who ran away from potential danger instead of joining the activity were ostracized, meaning they may be stone themselves, had little chance of reproduction and ultimately would no chance of surviving alone, psychology professor von Hippel says.Those who didn't join in the stoning of the former group member would have the same done to them.He writes: 'The most important psychological change that enabled us to thrive, rather than just survive, on the savannah: the capacity and desire to work together.William von Hippel writes about bitching in cliques in his new release The Social Leap: The New Evolutionary Science of Who We Are, Where We Come From, and What Makes Us Happy'Fear would have made it awfully tempting to leave the task of protecting the group to others.'Hippel adds in the book that with the more complex lifestyle our brains grew larger – also known as 'social-brain hypothesis' - to cope and as upright man developed about 1.8 million years ago.The evolution brought on the ability to harness fire which also had a positive effect by encouraging more storytelling, modern day gossiping, and also cooking food which enabled us to digest easier and consume more calories.'Fire enabled us to extend our community time past daylight, without the added risk of predation, and in doing so gave us the unique opportunity for socializing and reflecting, as the work of the day was no longer possible,' writes von Hippel. 'Storytelling allows each generation to build on information gathered by their ancestors, as cultures accumulate knowledge about how to deal with their local environment.'Onwards, we were able read human behavior – something more common in humans above the age of four or five years old – and realize other may view the world differently to us.But the revelation that came through 'bitching sessions' wasn't necessarily a good one. With the arrival of the Homo sapien species  we've maintained hostility with those we deem outsiders but there's probably no need for it anymoreChildren aren't able to read humans until they get to around four or five years old. At that point humans may consider lying to stay bonded sociallyThe book claims that it made us aware of feelings of pride, guilt and shame. Something that at the time would have come from a hunter-gatherer not bringing back enough meat. 'These are often referred to as self-conscious emotions, as their development requires awareness of how others are appraising us, and they differ from other social emotions, such as anger and love, in that the focus is inward,' writes von Hippel.Social awareness later encouraged lying in this later Home erectus species, something a chimp is unable to do.Psychology professor von Hippel says gossiping ensured our survival by developing complex emotions and helping the brain growWith the arrival of the Homo sapien species we know today, around 200,000 years ago, we've maintained hostility with those we deem outsiders but there's probably no need for it anymore.There's no longer as much of necessity to certain social situations to protect resources and ensure survival, known as 'the behavioral immune system'.'In a pre-medical world, the threat of disease was much greater than it is today, so we developed psychological adaptations to disease threats,' writes von Hippel.'Dislike and fear kept neighbors apart, and once you don't interact with others anymore, your languages and religions naturally diverge as well. All these processes are self-perpetuating and serve to further group separation.'Comparable to tribalism in modern days, it's prevalent from the playground to politics.But the author states it's probably not an inherited characteristic to be most proud of.'Just because we got smarter doesn't mean we got any wiser,' writes von Hippel. 'For better or worse, we haven't been able to shake many of our ancient instincts.' \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}