{"id": "Dominic Calvert-Lewin insists England Under 21s need to win the European Championships", "paragraph": "By\n\nPress Association Sport Staff\n\nPublished:\n  18:55 EST, 17 November 2018\n\n | \nUpdated:\n  18:55 EST, 17 November 2018\n\nView  commentsDominic Calvert-Lewin admits it is about time the England Under 21s won the European Championships.The Young Lions are one of the favourites for next year's tournament in Italy and San Marino ahead of Friday's draw.The age groups have also won the Under 17 and Under 20 World Cups, the Under 19 European Championships and won three straight Toulon Tournaments and Calvert-Lewin believes the Under 21s need to get in on the act.Dominic Calvert-Lewin says England Under 21s need to win the European ChampionshipsThe Everton striker said: 'I think so, yeah. To get to the semi-finals at the last finals, they did really well, but we're looking to go a step further.'We're obviously looking to go into it and win it, just like we did with the one I took part in the Under 20s World Cup.'We prepared to win that tournament and that's what we set out to do and that's what we achieved, thankfully.England Under 17s pose with the trophy after winning the U17s World Cup in India last year'I've just spoken about the kind of ability we have in the squad. We don't want to waste that, so it's about getting it down and delivering on the pitch and doing it properly. We will take that into the Euros.'Aidy Boothroyd's side beat Italy 2-1 in a friendly on Thursday and face Denmark in Esbjerg on Tuesday as they continue their Euro 2019 build up.Boothroyd guided them to the semi-finals at Euro 2017, losing on penalties to Germany, while Calvert-Lewin scored the winner when England beat Venezuela 1-0 to win the Under 20 World Cup.And the 21-year-old wants to complete a double with the Young Lions.Aidy Boothroyd's England U21s beat Italy 2-1 in a friendly on Thursday evening'Exactly, yeah. That's the aim, that's the goal - it's what we're working hard to achieve,' he said.'Me, personally, I've had that winning feeling, so I know what it feels like to win, so when it comes to it, I'll be ready to deal with the pressures that comes.'That was my first one, but a lot of the lads have taken part in previous tournaments, so I think it's massive to take into the Euros.'\n\t    Share what you think\n          No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards.\n      \nBy posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}