{"id": "Kesha glows in floral-patterned blouse while biking through LA after returning from tour", "paragraph": "By\n\nDailymail.com Reporter\n\nPublished:\n  19:45 EST, 24 October 2018\n\n | \nUpdated:\n  20:00 EST, 24 October 2018\n\n          22View  commentsShe just wrapped up her year-plus Rainbow Tour. And on Wednesday, Kesha enjoyed some well-earned relaxation time as she biked through the streets of Los Angeles.The 31-year-old singer sported a floral-patterned blouse while wheeling her way through what turned out to be a temperate day.Pedal power: on Wednesday, Kesha enjoyed some well-earned relaxation time as she biked through the streets of Los AngelesForm-fitting blue jeans added to the Praying musician's 60s sartorial vibe.Her long blonde tresses blew back behind her neck and glowed in the soft early morning sun.She shaded her eyes with oversized, rose-tinted glasses and painted her lips a pink that matched her top.Snakeskin ankle boots added a bit of a rocker vibe to the otherwise floral look.It looked to be a day of deep thought and effortless pedaling for Kesha who recently returned from Australia. Pretty in pink: The 31-year-old singer sported a floral patterned blouse while wheeling her way through what turned out to be a temperate dayOn October 11, the Woman singer wrapped up her year-plus world tour with a show in Sydney.The concert wrapped up a four performance series on the South Pacific continental mass, which followed four dates in South Korea and Japan.Kesha began her Rainbow Tour way back in September of 2017 with shows in the United States.Over the course of the concert series, the singer played 38 shows, but also took part in The Adventures of Kesha and Macklemore, which featured 30 shows over the course of two months during this past summer. Welcome back: Form-fitting blue jeans added to the Praying musician's 60s sartorial vibePublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}