{"id": "TIM MONTGOMERIE: Cancelling Brexit will be a disaster", "paragraph": "By\n\nTim Montgomerie, Leading Conservative Commentator, For The Mail On Sunday\n\nPublished:\n  19:37 EST, 20 October 2018\n\n | \nUpdated:\n  20:28 EST, 20 October 2018\n\n        1.2kView  commentsWas I affected by the summer heat on that glad confident morning of June 24, 2016? Was it because I’d been up all night, relishing the outcome I had dreamed of but hadn’t expected? Or had that big bottle of celebratory bubbly bought by a friend been, well, a bit too big?I was certainly drunk with excitement when I bumped into Peter Mandelson as he left a TV interview and I arrived for one.Aware this former European Union commissioner would be as deflated by Brexit’s victory as I was giddily delighted, I searched for something positive to say and made what now seems a crazy suggestion: ‘I know the referendum has gone the wrong way for you but I hope you and other people who understand Brussels can help with the negotiations.’Since the referendum, millions of Leavers and Remainers have stayed apart from each otherHe raised his eyebrow, forced a smile and we parted company.And, my goodness, millions of Leavers and Remainers didn’t just part that day, we’ve stayed apart.Even if the likes of Lord Mandelson, Nick Clegg and John Major had wished to help with the divorce, their knowledge was never sought.Perhaps Theresa May already understood what I didn’t grasp – that no die-hard believer in the EU project could stomach giving any support to a separation they hated so much.I fear, however, that the primary explanation for Mrs May’s lack of any interest in building a big Brexit tent was revealed recently.She didn’t even consult her own Brexit and Foreign Secretaries when she formulated her Chequers plan. There are many explanations for the tortuous nature of what we’re all going through, but crippling dysfunction in Downing Street is certainly one of them.Die hard remainers have no interest in giving any support to the separation they hate so muchI can well understand, therefore, what motivated the tens of thousands of people who marched through London yesterday – demanding another referendum and a chance to go back to what we had before our long and ugly national quarrel divided us.But there is no way back. A reversal now would amount to a national humiliation. The world will have watched Britain’s politicians and Government fail to grasp the chance to return to being what most other nations across the globe already are: self-governing.The country that once ran the world’s largest empire would have decided it couldn’t even manage itself. And while Britain would be a shrunken shadow of its former self, you can imagine what Brussels would think of itself.Over many years the EU machine has repeatedly bulldozed over the democratic decisions of member states. Greece’s referendum rejecting the eurozone’s punitive austerity regime didn’t change anything. Ireland, Denmark and the Netherlands have each voted against various EU projects in referendums, but none of the votes caused the EU to alter its plans in any significant ways.But forcing the world’s oldest parliamentary democracy and fifth-largest economy to accept that it can’t survive without Brussels? It would be the biggest ever victory for the belief that has driven the European project from its inception – the idea that nation states and national parliaments should do as Brussels says.You don’t need to be a Leaver to recognise how humiliating such a reversal would be – and Britain wouldn’t be the only democracy that would find itself diminished. Every EU state would note that not-so-Great Britain couldn’t win a negotiation against the Brussels machine.Some have scaremongered about Leave voters rioting if 2016’s result is overturned... this is unlikely, but we'd risk the instant abandonment of trust in British democracyThe we-know-best cockiness that led its unelected bureaucrats to create the ever-widening eurozone would be back, but on steroids.An EU army? Continent-wide systems of taxation? The towering dreams of the EU’s Babel builders would get renewed life.Their first grab would be for the rebate, won by Mrs Thatcher, that Britain gets from its outsized contribution to the EU budget.Rather than getting billions back for public services such as the NHS, we’d need to find at least £5 billion more for Brussels – on top of what we already give. Terms of membership that 17,410,742 Britons rejected two years ago would be on the slippery slope to getting even worse.And let’s return to those 17,410,742 Leave voters – a somewhat bigger number than protested yesterday.Some have scaremongered about Leave voters rioting if 2016’s result is overturned.I think widespread disorder would be highly unlikely. Much more possible is something far worse. Rather than a flash of violent protests, we’d risk the instant abandonment of trust in British democracy.It should never be forgotten that many Leave voters hadn’t voted for many years – or ever. They took part in Britain’s largest ever democratic exercise in the hope that voting might actually make a difference.While, in part, they were motivated by a desire to stem uncontrolled immigration or see more money going to their local hospitals, there was a more general but deeper hunger for a change in direction and national management.When I talk to other Leave voters I hear of the same kind of exhilaration that I felt on referendum night.The victory was no ordinary one for us. All the main party leaders had urged the country to vote Remain.The big banks and global financial institutions had done the same – and warned of blood-curdling consequences of doing anything else. Celebrities. Footballers. Archbishops. Remain had almost every big name on its side. It had the biggest cheque book and the machinery of government. But David felled Goliath.If we end up with Goliath winning, it really would be the worst possible outcome. Leave wouldn’t be the only loser. Leavers, Remainers – the whole country would lose if millions end up turning away from democratic institutions in disgust.Disdain for ‘the system’ – which is already widespread – would intensify. Leave voters, insofar as they might turn up on Election days ever again, would increasingly be likely to back Trump-like candidates who vow to overturn the system rather than to improve it.And the mainstream parties would deserve the contempt. All leading politicians told voters the referendum was a once-in-a-generation event and Parliament would implement what the people decided. While the decision to hold the vote was David Cameron’s, a massive 85 per cent of MPs voted for the parliamentary legislation that made it happen.Leave voters aren’t stupid – despite what is often suggested by some Remainers. It would be one thing for a reversal of Brexit to happen if big cheeses such as Tony Blair, John Major, Nick Clegg and their followers had occasionally lifted a finger to try to honour the result. They haven’t. Instead, the entire British Establishment – from the civil service to the BBC – has spent the past two years fighting to thwart the will of the people on the dangerously insulting grounds that We Know Best.Britain faces a big choice. We can fight the Brexit debate again and again and inject ever more poison into the democratic bloodstream.Alternatively, we can devote our energies to remedying the unhappinesses that are producing political earthquakes all over the Western world. Those unhappinesses include youth unemployment. Immigration policies that depress the wages of the low-paid. And central bank policies that are widening the gap between citizens.We don’t begin to address those problems by resuming membership of an institution which has condemned a generation of southern Europeans to years on the dole. Which, to this day, is at war with itself on whether to open or close its borders.And which – through the one-size-will-never-fit-all policies of the European Central Bank in Frankfurt – is making countries such as Italy poorer and Germany richer.Brexit isn’t going to be an easy path but any attempt to abandon it would be catastrophic for national confidence and democracy.It would be even more crazy than my plea to Lord Mandelson that we might all pull together to make Brexit a success.\n\n\n      Trump stands in the devastating ruins of Paradise and takes a tour of neighborhood incinerated by worst wildfire in state's history as more than 1,000 people are feared missing and death toll hits 74 \n    \nPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}