{"id": "Gigi Hadid heads to fittings for Victoria's Secret Fashion Show after being denied visa last year", "paragraph": "By\n\nDailymail.com Reporter\n\nPublished:\n  18:49 EST, 4 November 2018\n\n | \nUpdated:\n  21:12 EST, 4 November 2018\n\n          35View  commentsGigi Hadid looked happy to be stepping back into her angel wings on Sunday for the annual Victoria's Secret Fashion Show.The 23-year-old was spotted in New York while attending fittings for the yearly lingerie extravaganza.Last year, the model didn't get to walk in the show, which was held in Shanghai, after being denied entry into China.  Angel sighting: Gigi Hadid looked happy as she attended fittings for the annual Victoria's Secret Fashion Show in New York on Sunday after not being able to participate last yearGigi stepped on to the streets of Manhattan with a megawatt smile as she prepared to don her wings once more for the VS show which will film this month and air in December.The 2018 show is being moved back to New York after two years abroad. Last year's show in China was a disaster after a handful of models were denied their visas.Along with Gigi and the models, Katy Perry was also refused entry, causing the lingerie brand to scramble at the last minute to replace the women. Take two: Last year Gigi was denied her visa to get into China and couldn't walk in the 2017 VS show Now that the show is back in the states, Gigi is sure the take the catwalk along with sister Bella and Kendall Jenner. Leaving the fitting, the model looked much more covered up than she will be for the scantily clad runway show.Gigi donned a pair of relaxed fit boyfriend jeans with ripped knees and black booties.In one hand she carried a petite structured orange handbag. Modest look: The model opted for much more covered up ensemble than she will be in for the scantily clad runway show this monthNovember 6: Gigi's graphic T-shirt made a political statement reading 'vote' ahead of the US midterm elections on TuesdayHer makeup on Sunday was simple but glam with a dusty rose matte lip and loose waves of blonde locks. The California girl made a political statement in a white graphic T-shirt by designer Prabal Gurung that read 'vote' in bold letters under a blue tuxedo blazer with black edging. On Tuesday, the US will head to the poles for the 2018 mid-term elections. Rock the vote: On social media, the older sister of Bella Hadid shot a quick selfie video showing off her vote shirt and asked her 44.1 million Instagram fans to 'please vote' in the captionPundits on both sides of the political aisles have called this election the most important in a generation. Celebrities from Gigi to Eva Longoria to Amy Schumer and Emily Ratajkowski have been vocal about mobilizing citizens to vote.On social media, the older sister of Bella Hadid shot a quick selfie video showing off her vote shirt and asked her 44.1 million Instagram fans to 'please vote' in the caption.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}