{"id": "'Can I go to jail for...': The moment Beau Ryan talks about affairs on The Kyle and Jackie O Show ", "paragraph": "By\n\nNick Hadley\n\n\nand \nAlex Michael For Daily Mail Australia\n\nPublished:\n  19:41 EST, 24 October 2018\n\n | \nUpdated:\n  18:02 EST, 25 October 2018\n\n           6View  commentsRetired NRL player Beau Ryan allegedly had a fling with former Hi-5 star Lauren Brant during a stage production back in 2015.And there was a rather awkward moment on Thursday's Kyle and Jackie O Show when the  33-year-old discussed whether it was illegal to have an affair. During the regular 'Google Predicts' segment, in which the hosts must correctly guess what the public has been searching for on Google, Jackie 'O' Henderson posed the question to Beau: 'Can I go to jail for...'  Whoops! There was a rather awkward moment on The Kyle and Jackie O Show on Thursday when Beau Ryan (pictured) talked about affairs... after THAT rumoured 'fling' with Lauren BrantWithout missing a beat, Beau answered: 'An affair?' Jackie later revealed that most people were actually searching for the question: 'Can I go to jail for having a sugar daddy?'The 'Google Predicts' segment usually involves Jackie offering suggestions while Kyle Sandilands plays quizmaster, but Kyle was off sick on Thursday.  Oh, dear! During the  'Google Predicts' segment, in which the hosts must correctly guess what the public has been searching for on Google, Jackie 'O' Henderson posed the question to Beau: 'Can I go to jail for...' Without missing a beat, he answered: 'An affair?' Pictured: Beau RyanBeau was filling in for Kyle on Thursday, something he has been doing quite often in recent months. Back in 2015, Beau landed a role in a Sydney theatre production of Aladdin and his Wondrous Lamp, alongside Lauren Brant.Shortly afterwards, Lauren's then-fiancé Warren alleged he had discovered the pair were having an affair after discovering text messages on her phone.'It's kind of a punch in the stomach. I felt completely sick,' Warren told Woman's Day at the time. Fill-in presenter: The 'Google Predicts' segment usually involves Jackie (pictured) offering suggestions while Kyle Sandilands plays quizmaster, but Kyle was off sick on Thursday By October of that year, the story had blown up to the extent that Beau delivered an apology on The NRL Footy Show.He said: 'I want to apologise to all the people who have been hurt recently. It's been really, really hard for myself and my family and everyone involved.'Ryan also thanked everyone for their 'support' and for respecting his privacy.Shock claims: Back in 2015, Beau (right) landed a role in a Sydney theatre production of Aladdin and his Wondrous Lamp, alongside Lauren Brant (left). Shortly afterwards, Lauren's then-fiancé Warren alleged he had discovered the pair were having an affairDespite this carefully-worded apology, Beau and Lauren have never confirmed or denied the cheating allegations.Beau and his wife Kara - who share two children - are still together and have put the incident behind them.Meanwhile, Lauren has since entered a relationship with ex-AFL player Barry Hall.No comment: Beau and his wife Kara - who share two children - are still together and have put the cheating allegations behind them. Pictured: Beau and Kara RyanPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}