{"id": "Indian car rental owner jailed for five years faces deportation after raping one of his employees ", "paragraph": "By\n\nLaura Hedges For Daily Mail Australia\n\nPublished:\n  18:49 EST, 4 November 2018\n\n | \nUpdated:\n  18:49 EST, 4 November 2018\n\n           1View  commentsA Perth car rental business owner has been sentenced to five years in jail for raping one of his female employees.Guarav Nautiyal, 45, who  moved to Australia in 2015 on a skilled migrant visa, also faces deportation back to India after he has served his sentence.The married father-of-two drove the employee to his home in March 2016 after asking her to join him at a work appointment. Nautiyal then raped the woman, who verbally and physically resisted him.The 45-year-old told the District Court of Western Australia (pictured) he believed the sex was consensual, but Judge Amanda Burrows convicted him of two counts of sexual penetration without consentThe 45-year-old told the District Court of Western Australia he believed the sex was consensual, but  Judge Amanda Burrows convicted him of two counts of sexual penetration without consent, according to the West Australian. Nautiyal sexually harassed the victim on multiple occasions leading up to the incident, the court heard.In a statement, the victim said Nautiyal repeatedly hugged, kissed and touched her inappropriately while at work, leaving her humiliated.'She had expressly conveyed to you her disinterest in you in a sexual manner,' Judge Burrows said.A witness also recounted Nautiyal's inappropriate touching of the victim at a Christmas party, describing him as 'an octopus'.Nautiyal has been sentenced to five years in jail and faces deportation back to India  (stock image)The victim said her confidence had been severely knocked since the attack, adding that she has been suffering from anxiety and panic attacks and been unable to secure another job.'I was happy, confident, giving and loved life. I could make friends everywhere I went,' she said.'But now I feel I've lost myself and that can never be found again.''I feel I've lost myself': The victim said her confidence had been severely knocked since the attack (stock image)Nautiyal has also been issued with a life-long restraining order, preventing him from contacting the victim again, or going within 100m of her.Nautiyal bought the car rental business in Perth with his brother-in-law and had previously held high-level roles at global banks in Saudi Arabia, Qatar and the UAE.His wife of 12 years had been in Dubai – running her own business – when the assault took place. Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}