{"id": "Love Island winner Amber Davies rushed to hospital after drink spiking fears", "paragraph": "By\n\nRod Ardehali For Mailonline\n\nPublished:\n  18:45 EST, 17 November 2018\n\n | \nUpdated:\n  20:15 EST, 17 November 2018\n\n          41View  commentsLove Island winner Amber Davies was rushed to hospital after collapsing outside a pub in her hometown amid fears her drink was spiked.Miss Davies, 22, had been drinking with a friend when she became unwell after being seen stumbling and screaming in a car park in St Asaph, North Wales.Staff at the Plough Inn called an ambulance while Miss Davies' nurse mother Sue, 51, also raced to her aid on Friday night.Amber Davies was rushed to hospital after collapsing outside a pub in her hometown amid fears her drink was spiked. Miss Davies, 22, had been drinking with a friend when she became unwell after being seen stumbling and screaming in a car park in St Asaph, North WalesA source told The Sun: 'She believes her drink was spiked.' One witness at the pub said she had been talking to a man outside before suddenly collapsing.  'She suddenly hit the floor. She was completely unconscious. People came out of the pub to help her and put her in the recovery position,' the onlooker told paper.'She was screaming like she was in agony. Paramedics were asking people if she'd taken anything. But no one saw her taking drugs.'Miss Davies, who was the winner of Love Island 2017 alongside her now ex-boyfriend Kem Cetinary, was taken to the Glan Clwyd Hospital in Bodelwyddan.Doctors treated her for up to three hours before she was allowed home. Earlier in the day, the Welsh model shared photos of her drinking a large glass of wine in the pub on Instagram.  Following her Love Island experience, the star has made efforts to move into TV presenting alongside her lingerie modelling. She is set to star in Dolly Parton musical 9 to 5 in London's West End next year alongside Louise RedknappFollowing her Love Island experience, the star has made efforts to move into TV presenting alongside her lingerie modelling.She is set to star in Dolly Parton musical 9 to 5 in London's West End next year alongside Louise Redknapp.While it is thought she is dating the Diversity dancer Perri Kiely, 22, who was not present when Amber fell unconscious. MailOnline have approached Amber Davies' representatives for comment.\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}