{"id": "Paul Pogba pokes fun at his unique penalty run-up by racing tortoise", "paragraph": "By\n\nSportsmail Reporter\n\nPublished:\n  18:22 EST, 17 November 2018\n\n | \nUpdated:\n  19:11 EST, 17 November 2018\n\n           2View  commentsPaul Pogba and Lionel Messi are currently making the most of their rare break off from football by unwinding in very different ways in Dubai.Manchester United midfielder Pogba, who was forced to pull out of the France squad with a thigh injury, enjoyed a trip to the zoo where he spent time hanging out with the various animals.Pogba also posted a video on Instagram of him mocking his unique penalty run-up, which United fans have seen all too regularly this season.Paul Pogba posted a video on Instagram of him racing a tortoise while on holiday in DubaiPogba poked fun of his unique penalty run-up, which has been seen on various occasions Pogba penalty run vs turtle 🐢 ..I’m not THAT slow 🤷🏾‍♂️😂😂😂#winner#race#dubaiA post shared by  Paul Labile Pogba (@paulpogba) on Nov 17, 2018 at 10:20am PSTIn the social media video, the World Cup winner can be seen jokingly racing against a tortoise, alongside the caption: 'Pogba penalty run vs turtle... I'm not that slow'.After his visit to the turtle sanctuary, Pogba was then seen feeding a baby bear before being mimicked by a monkey.Meanwhile, Barcelona star Messi, who has been absent from national duty since the World Cup, opted for a more leisurely time in Dubai. The five-time Ballon d'Or winner decided to spend some quality downtime with his wife.The Manchester United midfielder feeds a baby bear during his visit to the zooThe France World Cup winner was mimicked by a monkey  as they stick their tongues outAntonella Roccuzzo posted a picture on her own Instagram account of the pair posing for a picture on their holiday, accompanied by the message: 'Night out in Dubai'.Pogba and Messi had been entertained by culinary celebrity Salt Bae in Dubai the night before.The Turkish internet sensation wowed the pair with his meat-cutting skills, and his iconic salt sprinkling style that gave him his popular name.Both players had a go at re-creating his technique, to differing success, and were then fed a slice piece straight from the knife.Barcelona star Lionel Messi enjoyed a night out in Dubai with his wife Antonella RoccuzzoFive-time Ballon d'Or winner Messi shakes hands with culinary celebrity Salt Bae in DubaiPogba was also entertained by the internet sensation during the international break\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}