{"id": "Backlash as Google bans staff from using the F-word in work files and message boards", "paragraph": "By\n\nMark Prigg For Dailymail.com\n\n\nPublished:\n  19:44 EST, 24 October 2018\n\n | \nUpdated:\n  20:01 EST, 24 October 2018\n\n          93View  commentsGoogle has banned employees from using sexually explicit words in work files and message boards, prompting an employee backlash.Files and URLs with words like 'f**k' in them are now forbidden from being shared around, and automatic filters are being used to stop staff seeing them, according to the Register.Staff have accused the firm of being 'misguided' in its attempt to track down and ban the files.Scroll down for video Files and URLs with words like 'f**k' in them are now forbidden from being shared around, and automatic filters are being used to stop staff seeing themOne of the company's software engineers tweeted: 'Google HR, in an attempt to make the workplace more respectful, is cracking down on words like 'f***'. 'A casualty of this over-broad tone-policing of workplace speech is that my shortlink to a policy doc about respectful use of a well-known internal system was itself taken down.'The poster added 'I mean, it's not all that terrible, and it's sensible for people not to swear unnecessarily at each other, but going through and proactively removing obscure links that nobody has ever complained about feels pretty misguided.' In June, Google released new guidelines for employees about what is and isn't considered acceptable on internal messageboardsIn June, Google released new guidelines for employees about what is and isn't considered acceptable on internal messageboards.  Employees were warned that if they behave badly, posting material or comments, or making such comments in person, that doesn't align with the company's values or that 'are disruptive to a productive work environment' they could face discipline.It follows an incident in 2017 where Google fired James Damore after one of his posts to the internal boards caused a national uproar. He argued that women are less suited to engineering than men, biologically speaking — an idea that's been fiercely refuted by experts — and that the true problem with Silicon Valley is how it treats conservatives, a minority political affiliation in the Bay Area. Damore argues he was 'singled out, mistreated, and systematically punished and terminated' after his ten page internal memo on diversity was leaked.Damore was fired in August shortly after the memo went viral and Google CEO Sundar Pichai, who cut a family vacation short to deal with the fall out, released a statement saying the former employee had violated their code of conduct and 'cross(ed) the line by advancing harmful gender stereotypes in our workplace.'   The following is an extract from engineer James Damore's lengthy memoWomen, on average, have more: Note that contrary to what a social constructionist would argue, research suggests that 'greater nation-level gender equality leads to psychological dissimilarity in men's and women's personality traits.' Because as 'society becomes more prosperous and more egalitarian, innate dispositional differences between men and women have more space to develop and the gap that exists between men and women in their personality becomes wider.' We need to stop assuming that gender gaps imply sexism. Men's higher drive for status We always ask why we don't see women in top leadership positions, but we never ask why we see so many men in these jobs. These positions often require long, stressful hours that may not be worth it if you want a balanced and fulfilling life. Status is the primary metric that men are judged on[4], pushing many men into these higher paying, less satisfying jobs for the status that they entail. Note, the same forces that lead men into high pay/high stress jobs in tech and leadership cause men to take undesirable and dangerous jobs like coal mining, garbage collection, and firefighting, and suffer 93% of work-related deaths.    \n\n\n      Trump stands in the devastating ruins of Paradise and takes a tour of neighborhood incinerated by worst wildfire in state's history as more than 1,000 people are feared missing and death toll hits 74 \n    \nPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}