{"id": "Broward counts the wrong ballots for state's Commissioner of Agriculture", "paragraph": "By\n\nDailymail.com Reporter\n\n\nand \nAssociated Press\n\nPublished:\n  18:42 EST, 17 November 2018\n\n | \nUpdated:\n  21:15 EST, 17 November 2018\n\n          53View  commentsFlorida's beleaguered Broward county has made yet another election blunder after it was revealed that officials accidentally mixed in ballots from the Senate race into the recount for state's Commissioner of Agriculture as Florida.Early on Saturday, the recount of 22,000 ballots came to an abrupt stop when officials noticed volunteers had mixed 47 manila envelopes from Friday's Senate recount in with those to be hand counted for the commissioner race, Fox News reported.'It appears there may have been some ballots from yesterday mixed in with the ones for today,' Broward Canvassing Board Judge Deborah Carpenter-Toye said. Early on Saturday, Broward County's recount (pictured) of 22,000 ballots cast in the race for Florida Commissioner of Agriculture came to an abrupt stopOfficials noticed volunteers had mixed 47 manila envelopes from the Senate recount in with those to be hand counted for the commissioner race (Volunteers look over ballots during the hand count at the Broward County Supervisor of Elections office, Saturday)Democrat Nikki Fried prematurely called the race against Republican Matt Caldwell for the Florida Cabinet post of agriculture commissioner, last Saturday. Had the mix-up not been caught, some ballots cast for commissioner may have been counted twice, but Broward County Canvassing Board Attorney Rene Harrod said the issue was caught in time and that none of the 47 envelopes were double counted in that race.Joe Goldstein, a Republican lawyer, demanded that the recount be stopped but the canvassing board voted to continue counting. They also told volunteers that they needed to flag any incorrect ballots from counts on Saturday. Last Saturday, Democrat Nikki Fried prematurely called the race against Republican Matt Caldwell for the Florida Cabinet post of agriculture commissionerJoe Goldstein, a Republican lawyer, demanded that the recount be stopped but the canvassing board voted to continue counting. They also told volunteers that they needed to flag any incorrect ballots from counts on SaturdayThe error is the latest in a series of embarrassing blunders by election officials in the area.On Saturday, Broward County Supervisor of Elections Brenda Snipes was forced to admit that 2,040 ballots had been 'misfiled,' in a video posted by The South Florida Sun-Sentinel. 'We have been trying to determine what could have caused the drop. What we believe is that in the recount area ... I believe those ballots were probably mixed in with another stack,' Snipes told the elections Canvassing Board at midday.'The ballots are in the building. The ballots are in this building. There would be nowhere else for them to be. But they are misfiled in this building.'State officials ordered a manual recount on Thursday after a machine recount showed less votes in the county than the total number of votes reported to the state on November 10.Broward County Supervisor of Elections Brenda Snipes explains to the canvassing board the discrepancy in vote counts during the hand count at the Broward County Supervisor of Elections office in Lauderhill, Fla., on SaturdayLarry Davis, a Democratic attorney who is representing agriculture commissioner candidate Nikki Fried, took the elections supervisor to task over the missing ballots.'Dr. Snipes, with all due respect to you and your office, the ballots being in the building doesn’t get them counted,' Davis said.Snipes said that she believed the totals reported to the state on November 10 were accurate, but that some ballots were misfiled before the machine recount, causing them not to be run through the machines. In the original vote totals as recorded by Broward County on November 8, two days after the election, Nelson was beating Scott, but far fewer votes had been cast in the US Senate race than other statewide races.The Broward Supervisor of Elections website reported 676,706 votes had been counted in Broward in the US Senate race, with the vast majority going to  Nelson over Scott, but 24,763 more votes had been logged for the governor's race, with 701,469 reported at that time, according to the Miami Herald.She said she'd like to send the original vote totals to the state at noon on Sunday, which is the deadline to report official results to the Department of State.Snipes has already been under fire for the way her office has handled the election and recount. On Thursday, her office was two minutes late in submitting the machine recount numbers to the Department of State refused to accept the totals, according to the New York Times. Broward County has historically been a Democratic stronghold, but the machine recount on Thursday had Republican Gov. Rick Scott leading incumbent Democrat Bill Nelson by about 12,600 votes for one of the state's US Senate seats.Florida's history of election woes dates back to 2000, when it took more than five weeks for the state to declare George W. Bush the victor over Vice President Al Gore by 537 votes, thus giving Bush the presidency. Back then, punch-card ballots were punch lines. Photos of election workers using magnifying glasses to search for hanging chads and pregnant chads symbolized the painstaking process.There are no chads this year, but there are plenty of cracks about flashbacks to the Bush-Gore contest. And, just as in 2000, the Republican candidates in the contested races have declared themselves winners and asked for the recount to stop.Add to this a litany of other voting problems: Palm Beach County's tallying machines went on the fritz during the recount due to age and overwork. The electricity went out in Hillsborough County during a machine recount and resulted in an 846-vote deficit. Broward County missed the state deadline to turn in recount results by two minutes.Those glitches led U.S. District Judge Mark Walker to ask why state officials have repeatedly failed to anticipate problems in elections.'We have been the laughingstock of the world, election after election, and we chose not to fix this,' he said. Walker is presiding over several election-related lawsuits that have been filed since Nov. 6.On Friday, election workers in all 67 counties began recounting by hand about 93,000 ballots that were not recorded by voting machines. Many counties finished up the Senate recount on the first day. All results are supposed to be turned in by Sunday at noon. State officials will officially certify the totals next week.\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}