{"id": "Lewis Hamilton arrives in Mexico City in style via helicopter", "paragraph": "By\n\nAlex Martin For Mailonline\n\nPublished:\n  19:39 EST, 24 October 2018\n\n | \nUpdated:\n  20:01 EST, 24 October 2018\n\n          32View  commentsLewis Hamilton touched down in a sunny Mexico City on Wednesday ahead of this weekend's Grand Prix and did so in a style befitting of any Formula One world champion-elect.The Mercedes driver arrived in the centre of the massive metropolis via private helicopter and shared his scenic journey, which concluded on top of a skyscraper, with his Instagram followers.Hamilton wrote: 'Look at how beautiful Mexico is. I love this country and more so its people!'Lewis Hamilton peers out of his private helicopter as it flies over MexicoHe will be hoping the journey to Central America is memorable not only for the great views but for being the site of his fifth world title triumph. Indeed, only a major mishap can stop him sealing the crown at the Autodromo Hermanos Rodriguez on Sunday.Leading Ferrari's Sebastian Vettel by 70 points with just 75 remaining, the Brit only has to finish seventh to guarantee a title win. Even if he fails to score a point, Vettel has to win to keep any hope alive.That is something he has not done since the Belgian Grand Prix in late August with Ferrari and the German both coming somewhat unstuck in recent races due to the constant pressure from Mercedes and Hamilton.Hamilton failed to seal the title at the earliest opportunity, which came last week at the United States Grand Prix. He failed to convert his pole position into a win and eventually finished third behind Kimi Raikkonen and Max Verstappen. With Vettel in fourth, the title race was kept alive for at least another week. Hamilton relaxes in his private helicopter as he travels to Mexico City on WednesdayA view of the Mexico City skyline as he prepares to touch down on a skyscraperThe 33-year-old admitted after the race that Mercedes had fallen short in several areas, leading to their demise, but insisted he was still confident of wrapping up a fifth world title in the coming races.'We just had a debrief,' Hamilton said on Sunday evening, 'and there a lot of things we could have done better today. There were certain things that weren't optimum for us which made it look even worse than it was.'There were a lot of things that were against us today and I have only just discovered certain things which make a lot of sense. Naturally being on the back foot you can blame strategy and a lot of different things, but we just weren't quick enough today.'Collectively we have lost some performance in some areas, but I think we know where it is and we still have three races to go.'Mercedes are 66 points clear of Ferrari in their search for a fifth straight constructors' title. Hamilton enjoys the sunshine after touching down safely on top of a Mexico City skyscraperPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}