{"id": "Cops arrest man parading Ohio shopping center wearing only a TOWEL", "paragraph": "By\n\nJessa Schroeder For Dailymail.com\n\nPublished:\n  18:52 EST, 12 November 2018\n\n | \nUpdated:\n  21:28 EST, 12 November 2018\n\n           5View  commentsA man who  paraded around an Ohio shopping mall wearing just a towel was taken into custody last week shortly before police discovered cocaine and a firearm in the back of his vehicle.Wilbur Rosado was arrested outside the Biddulph Plaza  in Brooklyn after  a concerned shopper reported a suspicious man sporting a towel in the public building.When authorities arrived, they ordered him to drop his belongings and asked, 'why are you out here naked?' Wilbur Rosado (pictured) was arrested outside the Biddulph Plaza in Brooklyn last weekA concerned shopper reported a suspicious man walking around the shopping center in a towel. When police arrived and asked him about his bizarre behavior, he said, 'I don't know, it's the PCP'Police asked Rosado if he had been using PCP. He replied: 'No, not no more'Rosado mumbled back to them: 'I don't know, it's the PCP.'Rosado is pictured above in his mugshot Police inquired about his PCP use and asked if he was high at the time of the bizarre incident. He replied: 'No, not no more.'Shortly after, the officers  searched his car for valuables as they prepared to tow it.While doing so, one of the officers found a unloaded handgun and a stash of cocaine in the trunk.The heavily-tattooed man shouted at the officers and ordered them to stop searching his vehicle.The officer who was searching his trunk also said there were 'some hard rocks' in the bag of coke.Officers searched his car for valuables as they prepared to tow it. They first found an unloaded handgunAn officer then found a large bag of coke with 'some hard rocks' inside Rosado, who became more infuriated, added: 'Put my s**t back in the car!' One of the men told Rosado: 'OK, you want me to put the gun and drugs back in the car?'Rosado said the cocaine was for his 'personal use.' He was jailed and now faces drug and gun charges that have been approved by a grand jury, according to Fox4KC.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}