{"id": "Prince Harry and Meghan Markle leave Fiji and head to Tonga", "paragraph": "By Rebecca English, Royal Correspondent, In Tonga For The Daily Mail and Alex Chapman and Bryant Hevesi For Daily Mail Australia  Published: 19:40 EST, 24 October 2018  |  Updated: 15:48 EST, 25 October 2018   7.4kView  commentsThe Duchess of Sussex made a minor fashion faux pas today when she arrived in Tonga in a striking red dress. Pregnant Meghan Markle, 37, still had the label hanging from her Self Portrait dress as she walked along a red carpet to the sounds of local singers wearing grass skirts at Fua'amotu Airport in Nuku'alofa, the country's capital. The £345 (AU$628 / US$444) bright red floral dress, which mirrored the colour of the Tongan flag, was accompanied by a Christian Dior Clutch and Manolo Blahnik BB pumps. But the returns tag remained on her outfit, and did not appear to be immediately noticed - remaining there for at least five minutes as she was being introduced to a party at the airport following their 90-minute flight from Fiji.Despite making the rare fashion faux pas with the label - which said 'returns will only be accepted if this tag remains attached' - the mother-to-be looked radiant in red, holding hands with her husband Prince Harry. The Duchess of Sussex made a minor fashion faux pas when she arrived in Tonga wearing a striking red dressMeghan Markle had the label still hanging from her red Self Portrait dress as she walked along a red carpet following her arrival in TongaThe Duchess made the minor fashion faux pas on arrival at Fua'amotu Airport in Nuku'alofa, the capital of TongaMeghan looked radiant in a red Self Portrait dress and black heels, holding hands with Prince Harry as they landed following their flight from Fiji\n\n\n\n\n\nSelf-Portrait embroidered midi dressPre-order it here\nBuy now\nSo far, they have visited Australia, New Zealand and Fiji, and today The Duke and Duchess of Sussex touched down in Tonga. Meghan wowed as she stepped off the plane in a red dress – the colour of the Tongan flag. This luxe design is by Self-Portrait, a brand renowned for their effortlessly elegant designs, with signature details including lace, ruffles and mesh panels. Meghan’s custom dress was right on par with its crepe fabrication, which incorporated sheer sleeves and subtle embroidery. She completed her look with her trusty Manolo Blahnik 'BB' pumps, bespoke Christian Dior clutch and delicate stacking rings by Ecksand.Keen to dress like the Duchess? Click (right) to pre-order it now.If you would rather shop around before you buy, head to the carousel below for fabulous variations from the likes of Asos, Principle and Co. Whichever dress you choose, let yours do the talking by teaming it with black or nude accessories.Manolo Blahnik 'BB' pumps at Farfetch\nBuy now\nAsos Design scuba dress (now reduced to £18)\nBuy now\nSelf-Portrait embroidered maxi dress\nBuy now\nPrinciple twist front dress at Debenhams (now reduced to £36)\nBuy now\nCo satin jacquard dress at NET-A-PORTER\nBuy now\nNA-KD lace dress\nBuy now\nThe Duke and Duchess of Sussex touched down in Tonga as they continue their whirlwind 16-day royal tourThe royal couple are spending just one night in Tonga before their first tour as a married couple heads back to AustraliaMeghan arrived in Tonga wearing the red dress, having earlier boarded the flight in Fiji wearing a forest green dressThe couple received an official welcome to the country from Her Royal Highness The Princess Angelika Latufuipeka at the airportThe Duke and Duchess stepped-off the chartered Qantas plane after a short 90 minute flight from Nadi, FijiA close-up of the tag on Meghan's dress (left), and a version of the same tag on another outfit from the same designer (right)The royal couple were welcomed to the country by Her Royal Highness The Princess Angelika Latufuipeka, the only daughter and eldest child of King Tupou VI and Queen Nanasipau'u Tuku'ah. Later on Meghan dazzled in her third outfit of the day - an elegant white full-length evening dress by Theia Couture - as the couple dined with the Tongan royals. Afterwards they attended an official reception and dinner. It came on the tenth day of Harry and pregnant Meghan's 16-day tour of Australia, Fiji, Tonga and New Zealand - and hours after the Duke had been unveiling a memorial for a British-Fijian soldier who died at the Battle of Mirbat. Queen Nanasipau'u Tuku'ah became Tonga's High Commissioner to Australia when her father became King.  Harry and Meghan arrived at Consular House in Nuku'alofa for a private audience with King Tupou VI and Queen Nanasipau'uHarry and Meghan, wearing a white dress, arrived to the ceremony as a band played Imagine by John LennonThe couple are attending an official reception and dinner in Tonga this evening, featuring traditional entertainmentMeghan had changed into the Self Portrait dress while onboard the short 90-minute flight from Nadi, FijiBefore entering the airport's royal suite, the Duchess received flowers from the Hon. Melenaite Tuipelehake, a great-niece of the KingThe pair will be the guests of honour at welcome reception and dinner in Nuku'alofa, with Tonga's King and QueenThe Duchess of Sussex wowed in a customised version of a red Self Portrait dress, when she and the Duke touched down in Tonga on ThursdayMeghan's red dress mirrored that of the Tongan flag. Locals held-up the flag to greet the royal couple to the countryThe Duchess completed her look with a Christian Dior Clutch and Manolo Blahnik BB pumpsThe Duke and Duchess of Sussex had earlier in the day arrived to unveil a statue commemorating Sergeant Talaiasi Labalaba in Nadi, FijiMeghan cradles her baby bump, while her husband Prince Harry gives a speech shortly after touching down in NadiThe Duchess and her husband arrived in Nadi after spending the night on a luxury private island as they took a break from their jam-packed schedule In the official line-up were Semisi Sika, Deputy Prime Minister and Minister for Infrastructure and Tourism, Ambassador Mahe U.S. Toupounia, Secretary for Foreign Affairs and Olita Haina Mo Uta Tupou, Acting Chief Secretary to the Cabinet.The royal couple then walked the red carpet, accompanied by traditional entertainment from Pelehake villagers. Before entering the airport's royal suite, the Duchess received flowers from the Hon. Melenaite Tuipelehake, a great-niece of the King.  Later they will be the guests of honour at another welcome reception and dinner in Nuku'alofa with the King and the Queen, with traditional Tongan entertainment.The visit to Tonga comes after the royal couple unveiled a statue to a hero sergeant in Fiji after spending the night at a lavish five-star resort on one of the country's private islands.  Meghan was wearing a £2,229 (AU$4,073/US$2,876) forest green Jason Wu dress while visiting Nadi, in Fiji's west, on Thursday morningPrince Harry and his wife Meghan arrived in Nadi for the statue unveiling after flying in from Suva on a chartered flightThe soldier's son, Isaia Dere Labalaba, said he was 'very excited to meet Prince Harry (pictured). It is a great honour that he has agreed to do this'The President of Fiji, Major General Jioji Konrote, gave a short speech thanking the couple (pictured) for their visit to the Pacific Island nation at the welcome ceremony and statue unveiling Prince Harry and wife Meghan flew in from the capital Suva to Nadi, in the country's west, for the unveiling, as they continued their marathon 16-day royal tour. The couple had spent the night on the paradise isle of Vatuvara together as they took a break from their jam-packed schedule. Security held back crowds which turned out to catch a glimpse of the pair in Nadi, after a security scare cut short Meghan's visit to the overcrowded Suva Market a day earlier.The royals were given a traditional welcome after stepping off their chartered flight on their last morning in Fiji before flying on to Tonga.  Trump gets close to see California wildfire devastationP Diddy's late ex Kim Porter plays around with her kidsLouis Klemp tells black woman he belongs to 'master race'Andrew Gillum concedes Florida Governor's raceTouching video shows Winnie-the-Pooh comforting disabled toddlerCell phone video captures men dancing with bikini clad womenHilarious moment a tiny dog confronts mating lionsUS search team find Argentine submarine at bottom of Atlantic OceanTrump heads to wildfire ravaged California to assess damagePaedophile attacks girl 10, before being stopped by passer bySaudi woman posts Twitter clips wearing abaya inside out in protestMother and boyfriend sentenced for the death of 19-months old girlThe statue unveiling was the last official engagement in Fiji for the royal couple, before heading to Tonga as they continue their 16-day tour The royal couple walk down the red carpet which had been rolled-out for their welcome to Nadi and the statue unveiling Meghan shares a joke with Fiji's Prime Minister Frank Bainimarama during an official welcome ceremony in NadiThe Duchess appeared relaxed as she took in the welcome ceremony on her and her husband's last day in FijiPrince Harry and wife Meghan are welcomed by Fiji's President Jioji Konrote and first lady Sarote Faga Konrote at NadiThe Duke and Duchess are spending the morning in Nadi for the unveiling before taking a chartered flight to Tonga Prince Harry was again offered the traditional kava drink, which is made from the roots of the pepper plant and has the appearance of muddy waterThe Duke had drunk kava at a welcome ceremony in Suva earlier in the week and he also attended a kava making demonstration while in FijiThe couple walked hand-in-hand as they made their way to the statue unveiling, which recognised a British-Fijian soldier The statue had been covered with a blue piece of velvet, with Prince Harry pulling it off with a flourishPrince Harry is pictured after the unveiling of the statue which commemorates Sergeant Talaiasi Labalaba, a British-Fijian soldier who died heroically in battleMeghan watched on as her husband unveiled the statue which had a plaque noting his unveiling on the couple's visit to FijiMother-to-be Meghan was wearing a $2,400 forest green Jason Wu dress and cradled her baby bump as her husband gave a speech. Meghan was wearing a white dress, by Theia CoutureThe Duchess of Sussex dazzled in her third outfit of the day with a Greek-inspired look as she dined with the King of Tonga tonight - arriving to a band playing Imagine by John Lennon.Hours after arriving on the South Pacific island, Prince Harry and Meghan visited Consular House in central Nuku'alofa for a private audience with His Majesty King Tupou VI and Queen Nanasipauʻu.Afterwards they attended an official Reception and Dinner, followed by traditional Tongan entertainment. The pregnant Duchess was wearing an elegant white full-length evening dress by Theia Couture.The dress, described as a 'cap sleeve beaded silk satin column gown', is said by the designer to 'use the Greek goddess Theia as a source of inspiration' and was embellished with beading and embroideries.The Duke and Duchess of Sussex arrive for the receptionThe visit – which saw Meghan advised to ‘take care of herself’ when she met a Russian doctor - is the most remote part of the couple’s 16-day tour, which also includes Australia, Fiji and New Zealand.In the evening after their arrival, the couple were driven to Consular House for an audience with King Tupou VI and Queen Nanasipau’u before a reception and dinner.At the reception they met an array of dignitaries, including Justice Charles Cato, a New Zealand judge and his Russian wife Miriam.Mrs Cato said: “I asked, how does she feel? She responded, ‘Very well, thank you.’ I said, ‘No visible signs yet!’”That prompted the duchess, who was wearing a dress by Theia, to look down at front of her dress and laugh in agreement. The couple sat for the second time on their brief visit to Fiji on a raised dais for the welcome ceremony, during which Prince Harry again drunk a cup of the national drink, Kava, which is made from the roots of the pepper plant and has the appearance of muddy water.After the ceremony, the President of Fiji, Major General Jioji Konrote, gave a short speech thanking the couple for their visit and congratulating them on the birth of their first child next year. 'Thank you for coming to Fiji and gracing us with your much welcome but very short visit. It's good to know that you promise to come back. May Almighty God be with you now and in the future,' he said.In his speech, the Duke greeted his audience with the traditional 'Bula!''Thank you to the people of Fiji for the warm welcome we have received during our visit. The Duchess and I are leaving with special memories of your beautiful country and look forward to returning in the future,' he said. The couple were then invited to walk down to unveil the statue of Sergeant Talaiasi Labalaba, a British-Fijian soldier who died heroically in battle, which had been covered with a blue piece of velvet.Prince Harry pulled it off with a flourish and then posed for photographs as his wife watched proudly.     Sergeant Talaiasi Labalaba, a Fijian member of the elite British Special Air Service (SAS), single-handedly held off 250 attackers from taking an army base 46-years-ago. Sergeant Talaiasi Labalaba, a Fijian member of the elite British Special Air Service (SAS), single-handedly held off 250 attackers from taking an army base 46-years-ago.Labalaba, renowned as one of the SAS's greatest heroes, gave his life in an epic struggle to defend his fellow soldiers at the Battle of Mirbat, in what is now Yemen, in 1972.Labalaba and eight fellow SAS soldiers were stationed at a British Army training team house just outside the port of Mirbat in Oman.For a year the crack unit had been on a secret assignment, codenamed Operation Jaguar, to protect the Sultan of Oman from an insurgent force, the People's Front for the Liberation of the Occupied Arab Gulf.On the morning of July 19, 1972, 250 of the Front's best fighters stormed the port in a surprise attack that left the nine SAS men pinned down inside their fort.Labalaba, 30, knew that without heavier fire power, the unit faced almost certain annihilation. In a daring break, he sprinted across an exposed 800 yard stretch to reach a 25-pound field gun.The gun usually required three men to operate it, and by the time he reached it Labalaba was soaked in blood from a bullet wound to his jaw.   Prince Harry and wife Meghan walked the red carpet at Nadi airport to their awaiting Qantas charter flightThe Duke and Duchess bid farewell to Fiji as they boarded a flight to the nearby Pacific Island nation of TongaThe royal couple are spending just one night in Tonga before heading back to Sydney, Australia for the closing ceremony of the Invictus Games But the elite soldier, still under heavy fire, spun the cumbersome weapon to face the advancing guerrilla fighters and opened up from close range, decimating them.The Duke of Sussex unveiled a memorial for a British-Fijian soldier who died at the Battle of Mirbat as the royal couple departed Fiji for Tonga.Sergeant Talaiasi Labalaba, of the Special Air Service, single-handedly held off 250 insurgents with a 25-pounder field gun after being shot in the jaw during the battle in Oman in 1972.The Duke of Sussex unveils a statue in honour of Sergeant Talaiasi Labalaba in Nadi, FijiHe was part of a nine-strong SAS team based outside Mirbat when they were attacked by the Popular Front for the Liberation of the Occupied Arabian Gulf (PFLOAG).Sgt Labalaba was posthumously mentioned in dispatches for his bravery in battle.For a year the unit had been on a secret assignment, code-named Operation Jaguar, to protect the Sultan of Oman from the insurgent force.Sgt Labalaba was noted for his bravery in battleOn the morning of July 19, 1972, 250 of the Front's best fighters stormed the port in a surprise attack that left the nine SAS men pinned down inside their fort.Sgt Labalaba, 30, knew that without heavier fire power, the unit faced almost certain annihilation.He sprinted across an exposed 800-yard stretch to reach a 25-pound field gun, which would usually require three men to operate.Ignoring his wounds he continued to hold off the 250 Front fighters for six hours.In SAS: Operation Storm, a book recounting the battle, fellow trooper Roger Cole wrote that the fight would surely have been lost had Sgt Labalaba not taken the 25-pounder.Sgt Labalaba is an enduring legend among Fijians, 1,250 of whom are currently serving in the British Army. Ignoring his wounds he continued to hold off the 250 Front fighters for six hours.Captain Mike Kealy and comrades Tommy Tobin and Sekonaia Takavesi also ran the 800 yard gauntlet to try to save the courageous sergeant's life.They arrived too late, but Labalaba had held off the guerrilla force long enough for the Sultan's Strikemaster jets to arrive.The jets drove back the attackers while reinforcements from nearby Salalah were organised.In SAS: Operation Storm, a book recounting the battle, fellow trooper Roger Cole wrote that the fight would surely have been lost had Labalaba not taken the 25-pounder.The sergeant was posthumously awarded a Mention in Dispatches for his bravery, and his body was returned to England, where it was buried at St Martin's Church in Hereford.A statue to the war hero was erected at the SAS headquarters outside the town in 2009.Labalaba is an enduring legend among Fijians, 1,250 of whom are currently serving in the British Army.The soldier's son, Isaia Dere Labalaba, 53, was at the ceremony and spoke of his pride that Prince Harry would be unveiling his father's statue.'I'm so excited, so happy today. I last saw him (my father) in 1971 when he left for his tour of duty. He was meant to come home again within days when he died. I was just four years and 11-months-old,' he said. 'He was a really family man, my father. I am very excited to meet Prince Harry. It is a great honour that he has agreed to do this.'His comrade Sekonaia Takavesi Wakolo, 75, was with Labalaba when he died and was himself shot in the shoulder by a bullet that just missed his head.'We were blood brothers, we stood side by side. It was the last day of our five month tour. 'We had some rum to celebrate the night before and had packed our belongings and gone to sleep before the handover,' he said. 'It was 4am when the attack started. We thought it would be just another skirmish and they would hear back into the mountains. But it wasn't and we were outnumbered.'He added how 'we have campaigned for a long time for a statue to commemorate him'. 'It is wonderful to have a memorial to him here in Fiji. It is very important to The Fijian people,' he said. 'We were very proud to serve the Crown so it means a lot to us to have Prince Harry here to unveil it. 'His brother Prince William unveiled a statue on Hereford in 2014. 'Labalaba, renowned as one of the SAS's greatest heroes, gave his life in an epic struggle to defend his fellow soldiers at the Battle of Mirbat in July 19, 1972A statue to the war hero was erected at the SAS headquarters outside Hereford, England in 2009The sergeant was posthumously awarded a Mention in Dispatches for his bravery, and his body was returned to England, where it was buried at St Martin's Church in Hereford (pictured)The Duke and Duchess were given an official welcome ceremony in Nadi before unveiling the statue to Sergeant Talaiasi LabalabaPrince Harry and Meghan were given a traditional welcome in Nadi after earlier visiting Suva on the Fijian leg of their 16-day royal tour Security kept crowds a fair distance from the royal couple after a security scare cut short Meghan's visit to the overcrowded Suva Market a day earlierTourism Minister Faiyaz Koya said of Harry and Meghan's trip to Fiji: 'We are proud to host them. This is a worldwide event so it is tremendous for us. They are a couple with global appeal to everyone'. He confirmed that the newlyweds, who are expecting their first child in April, spent last night on the paradise isle of Vatuvara together.This private island boasts it offers 'conscientious luxury to the discerning traveller' and is 'one of the world's most beautiful places'.  It has three secluded and expansive seaside Villas, meticulously crafted with natural textures and materials creating spacious and comfortably elegant environments.Meghan waves to a crowd of adoring onlookers as she and her husband are driven through the streets of Nadi Prince Harry also gave a wave to locals who had their cameras at the ready to capture the moment the royal couple visited The Duke and Duchess have attracted large crowds wherever they have made public appearances on their royal tourThe royal motorcade made its way through the streets of Nadi, as crowds of excited locals watched on 'Vatuvara is one of those islands you will not forget. It showcases the Fijian spirit and what we have as Fijian people. It's absolutely beautiful. Stunning. They would have enjoyed themselves,' Mr Koya said.After the ceremony, the couple boarded their Qantas charter fight for the South Pacific nation of Tonga, the third country they are visiting during their 16-day trip on behalf of the Queen. The royal couple are spending just one night in Tonga before heading back to Sydney, Australia for the closing ceremony of the Invictus Games.They will have two nights in Sydney and will then fly to New Zealand where their tour draws to a close.  Harry and Meghan spent their final night in Fiji on the private isles of Vatuvara, away from throngs of adoring crowds.The royal couple spent Wednesday night on the idyllic Vatuvara Islands, about an hour east of the Fijian capital Suva.Tourism Minister Faiyaz Koya described the island as a paradise which showcases the Fijian peoples' spirit.Though there are no prices on the island's website, a private stay costs about $5,000-a-night, boasting three secluded and expansive seaside villas, meticulously crafted with local materials.Expansive beaches and crystal clear waters greet early risers, with 800 acres of private land available for explorers and even a small, four-hole golf course.Meghan, who revealed earlier in the tour she had been rising as early as 4.30am to do yoga, would have been fully provided for by the island's private classes.The island boasts three secluded and expansive seaside villas, meticulously crafted with local materialsThe island features expansive beaches, crystal clear waters and even a small golf course for the couple to exploreFiji's Tourism Minister Faiyaz Koya described the Vatuvara Island as a paradise which showcases the Fijian people's spiritMeghan was at the bustling Suva Market on Wednesday as part of a solo engagement but her trip was cut down to just six minutesMeghan was at the market to meet female entrepreneurs when the visit was cut short due to a security scareTuesday, October 16: Sydney, Australia - The first day of the tour began and ended at Admiralty House after a visit to the zoo and Sydney Opera House.The royal couple kicked off their tour in Sydney on October 16 with a walkabout, a visit to Taronga Zoo, and a tour of the Opera HouseWednesday, October 17: Dubbo, Australia - The couple flew to Dubbo, in the New South Wales central west, to meet drought affected farmers, followed by a visit to a local school and a community BBQ.The Duchess of Sussex holds an umbrella as Harry makes a speech at a community picnic in Victoria Park in Dubbo on October 17They were greeted by huge crowds of wellwishers in drought-hit Dubbo, where the royal visit coincided with some much-needed rainfallThursday, October 18: Melbourne, Australia - Harry and Meghan arrived in the southern city, visiting Government House and social enterprise café. The Duke and Duchess travelled on an iconic Melbourne tram to South Melbourne beach Harry and Meghan, at the Charcoal Lane Mission Australia social enterprise restaurant in Melbourne on October 18Harry's hug for one young woman at the Royal Botanic Gardens in Melbourne on October 18 reduced her to tears of joyFriday, October 19: Sydney, Australia - Harry and Meghan visited Bondi Beach. The Duke climbed the Sydney Harbour Bridge to officially raise the Invictus Flag.The Duke climbed the Sydney Harbour Bridge to officially raise the Invictus Flag in Australia on October 19Saturday, October 20: Sydney, Australia -  The Duke and Duchess of Sussex travelled by boat to attend the Invictus Games Sydney 2018 Jaguar Land Rover Driving Challenge on Cockatoo Island. In the evening, Harry and Meghan attended a reception at the Opera House.The Duke and Duchess of Sussex arrive for the Invictus Games Jaguar Land Rover Driving Challenge on Cockatoo Island on October 20Sunday, October 21: Sydney, Australia - Prince Harry and the Duchess of Sussex watched some Invictus Games events, including cycling and sailing.The Duke and Duchess of Sussex watch competitors taking part in a sailing event at the 2018 Invictus Games in Sydney on October 21Monday October 22: Fraser Island, Australia - Their Royal Highnesses travelled to Queensland's Fraser Island.The Duke of Sussex with aboriginal man Joe Gala at McKenzie's Jetty on Fraser Island on October 22Tuesday, October 23: Suva, Fiji - Their Royal Highnesses were greeted by a Guard of Honour at Suva airport, before calling on His Excellency The President of Fiji at Borron House followed by a State Dinner.The Duke and Duchess of Sussex wave from the balcony of the Grand Pacific Hotel in Suva, Fiji, on October 23Wednesday, October 24: Suva, Fiji - His Royal Highness laid a wreath at the Fiji War Memorial, and met a number of Fijian war veterans. The Duchess visited the British High Commissioner's Residence and spoke to traders at Suva Market, before a security scare saw Meghan whisked awayMeghan is whisked away by security while visiting a market on October 24 in Suva, FijiMeghan and Harry toured the University of Suva's campus in Fiji on October 24Thursday,  October 25: Nadi, Fiji and Nuku'alofa, Tonga - The Duke and Duchess will travel to the city of Nadi and unveil a new statue. Their Royal Highnesses will take a chartered flight to TongaFriday,  October 26: Nuku'alofa, Tonga and Sydney, Australia - The Duke and Duchess will visit the St George Building for meet the Prime Minister and will travel to The Royal Palace for an official farewell with The King before departing for Sydney, where they will attend the the Australian Geographic Society AwardsThe first week of the couple's trip to Australia and New Zealand saw the couple make a whirlwind trip to Melbourne - including a stop at Government HouseSaturday, October 27: Sydney, Australia - Their Royal Highnesses will spend the afternoon at the wheelchair basketball finals of the Invictus Games, before attending the Closing CeremonySunday, October 28: Wellington, New Zealand - The pair will attend the traditional welcome ceremony on the lawns of Government HouseMonday, October 29: Wellington and Abel Tasman, New Zealand - The Duke and Duchess will meet young people from a number of mental health projects operating in New Zealand and will travel to Abel Tasman National ParkTuesday, October 30: Auckland, New Zealand - Their Royal Highnesses will travel to Auckland, where they will firstly visit the North Shore to dedicate a 20 hectare area of native bush to The Queen's Commonwealth Canopy. They will then join the Prime Minister to visit Pillars, a charity operating across New Zealand. Later that afternoon, The Duke and Duchess will have the opportunity to meet the people of Auckland on the Viaduct Harbour, before attending a reception hosted by the Prime Minister at the Auckland War Memorial MuseumWednesday, October 31: Rotorua, New Zealand - The final day of their Royal Highnesses' tour will take place in Rotorua. Next, The Duke and Duchess will head to Rainbow Springs to learn more about the centre's kiwi breeding programme. Later that afternoon, the Duke and Duchess will head into the city for the chance to meet members of the public gathered thereThursday, November 1: Their Royal Highnesses will return to Auckland that evening, before departing for London the following dayMeghan gave Aussie Rules a crack in Melbourne on October 18, demonstrating solid form for an ecstatic crowd when she was shown how to handballThe Duchess of Sussex battled some rather blustery conditions this afternoon as she touched down in Tonga for the next leg of the royal tour.Meghan, 37, battled the elements as she and Harry disembarked the private jet at  Fua'amotu Airport on Thursday in a £345 ($628AUD) Self Portrait dress.There was further embarrassment for the duchess as eagle-eyed royal watchers noticed the price tag was still hanging off her designer frock.  The red number - a nod to her Tongan hosts - was the second of three new outfits on Thursday for Meghan, after she started the day in a forest green Jason Wu design. Despite making a rare fashion faux pas by leaving the tag on her red outfit, the 37-year-old mum-to-be looked radiant in the red design.She finished off the outfit a Christian Dior Clutch and her Manolo Blahnik BB pumps. Trump gets close to see California wildfire devastationP Diddy's late ex Kim Porter plays around with her kidsLouis Klemp tells black woman he belongs to 'master race'Andrew Gillum concedes Florida Governor's raceTouching video shows Winnie-the-Pooh comforting disabled toddlerCell phone video captures men dancing with bikini clad womenHilarious moment a tiny dog confronts mating lionsUS search team find Argentine submarine at bottom of Atlantic OceanTrump heads to wildfire ravaged California to assess damagePaedophile attacks girl 10, before being stopped by passer bySaudi woman posts Twitter clips wearing abaya inside out in protestMother and boyfriend sentenced for the death of 19-months old girlIt's windy out here! Meghan, 37, battled the elements as she and Harry disembarked the private jet at Fua'amotu Airport on Thursday in a £345 ($628AUD) Self Portrait dressThe Duchess of Sussex wowed in the customised version of a red Self Portrait dress, when she and the Duke touched down in Tonga on Thursday - despite the label hanging off the hemThe dress that was modified by Self Portrait is 'crafted from a super lightweight crepe fabric' and 'features sheer sleeves decorated with button detailing to the cuffs'.The Self Portrait website reads: 'The belted waist emphasises the feminine figure while ladylike floral embroidery and a pleated skirt creates a flattering silhouette'. Meghan made a rare fashion faux pas, when onlookers noticed that the tag of the dress was still visible as she walked across the red carpet.However, the error did not detract royal fans, who were out in force to line the streets to greet the Duke and Duchess some 13 kilometres from the airport.Earlier in the day, Prince Harry and Meghan Markle boarded the plane in Fiji to enjoy a short chartered Qantas flight to Tonga.By Unity Blott Total to date: £117,934.62Day one: Monday 15th OctoberSydney: Arriving at Sydney Airport The couple were in good spirits as they touched down in Sydney on Monday 15th October, hand-in-hand and surrounded by their entourage. Onlookers noticed Meghan appeared to be covering her black and maroon Givenchy coat with a plastic folder - and with good reason, as the couple announced their pregnancy news later that dayOUTFIT TOTAL: £2,810.62Sydney: Walking in the gardens of Admiralty HouseJust hours after announcing their baby news on Monday 15th October, the Duke and Duchess of Sussex were spotted walking in the gardens of Sydney's Admiralty HouseOUTFIT TOTAL: £192.49Day two: Tuesday 16th October Sydney, Taronga Zoo and Sydney Opera HouseThe couple kicked off their long list of engagements with a visit to Taronga Zoo before visiting Sydney Opera House. Tuesday also saw Meghan pay tribute to her late mother-in-law by wearing a pair of her butterfly earrings as well as one of her gold banglesOUTFIT TOTAL: £3,003.86Sydney: Afternoon reception at Admiralty HouseMeghan flawlessly pulled off a costume change as she returned to Admiralty House for a reception hosted by the Governor-General, swapping her white shift dress for a khaki green pleated button-up shirt dress, her most expensive piece of the tour so farOUTFIT TOTAL: £2,218Day three: Wednesday 17th October New South Wales: Dubbo community BBQ, Victoria ParkThe Duchess of Sussex paid homage to Australian fashion in a pair high rise jeans by local brand Outland as she arrived in Dubbo on Wednesday. Meghan, 37, covered the first hints of her baby bump in an oversized white shirt by Maison Kitsune, teamed with an oversized grey check blazer from her friend Serena William's fashion rangeOUTFIT TOTAL: £1,034.95Day four: Thursday 18th OctoberMelbourne: Reception at Government HouseAfter an early start, Meghan started off the day at Melbourne's Government House wearing an elegant 'folded sail' dress from Australian label Dion Lee. She teamed the navy number with a Martin Grant trench coat, which she later removed (pictured)OUTFIT TOTAL: £3,764.23Melbourne: South Melbourne Beach After starting the day in a bussinesslike navy ensemble, Meghan later changed into flats to take a stroll along South Melbourne Beach. The shoes, from eco-friendly label Rothy's, are made from recycled bottles once destined for landfill and cost £110OUTFIT TOTAL: £435.26Day five: Friday 19th OctoberSydney: Bondi BeachDespite the damp and dreary conditions, Meghan looked radiant in a khaki maxi-dress from Melbourne-born designer Martin Grant's 2019 Resort collection - teamed with Castaner espadrilles - as she touched down at Bondi Beach with Prince HarryOUTFIT TOTAL: £1,388Sydney: Macarthur Girls High School The royal couple visited Macarthur Girls High School on the fourth day of their whistle-stop tour of Australia. She wore a blue colour block midi dress from British label Roksanda's pre-AW18 collection, teamed with her trusty Stuart Weitzman pumps and a white gold bracelet from her favourite jewellery designer, Maison BirksOUTFIT TOTAL: £4,886Day six: Saturday 20th OctoberSydney: Opening the ANZAC War Memorial, Hyde ParkHarry and Meghan were greeted by adoring fans as they opened a new extension of the war memorial at Sydney's Hyde Park in a surprise appearance. The couple arrived at Hyde Park with NSW Governor David Hurley, a former chief of the defence forceOUTFIT TOTAL: £2,941.09Sydney: Invictus Games Driving ChallengeHarry and Meghan traded their formal attire for casual looks as they took a boat across Sydney Harbour to Cockatoo Island for a special Invictus Games car challenge. The Duke and Duchess of Sussex took the private vessel from Admiralty House in Kirribilli where they were staying a guest of Governor General Sir Peter CosgroveOUTFIT TOTAL: £1,542.98Sydney: Invictus Games Opening Ceremony In a rare move, Meghan recycled a previously worn item when she joined Harry for the Invictus Games opening ceremony on Saturday night. She dug out a navy Stella McCartney cape dress first wore during the Queen's birthday celebrationsOUTFIT TOTAL: £15,355.62Day seven: Sunday 21st October Sydney: Lunch reception, The Pavilion RestaurantMeghan opted for head-to-toe monochrome when she joined Prince Harry for an Invictus Games lunch with the Australian Prime Minister in Sydney. After skipping an earlier engagement due to exhaustion, she arrived by car to join her husband for a lunch hosted by the Australian Prime Minister at the city's trendy Pavilion RestaurantOUTFIT TOTAL: £1,171Sydney: Invictus sailing race, Sydney HarbourFollowing lunch on Sunday, the couple, who are expecting their first child together in Spring 2019, wrapped up in Invictus Games branded waterproof jackets as they headed out into Sydney Harbour to take in the action at a sailing eventOUTFIT TOTAL: £202.45 Day eight: Monday 22nd OctoberQueensland: Arriving at Kingfisher Bay, Fraser Island The Duchess channelled Pretty Woman in a casual polka dot dress from & Other Stories when she touched down on Fraser Island. The Duchess remained at the luxury resort where she and Harry were staying on the island for a much-needed restOUTFIT TOTAL: £587 Queensland: Exploring Kingfisher Bay, Fraser Island The Duchess of Sussex stepped out in one of her most daring ensembles yet when she sported a thigh-flashing dress on Fraser Island on Monday. Meghan, 37, wore the Reformation 'Pineapple' dress to explore the Australian tourist spot - where temperatures hit a balmy 24°C on Monday - with Prince HarryOUTFIT TOTAL: £166.56Sydney: Garden party at Government HouseMeghan wore a £1,536 Jason Wu ruched-trim sleeveless crepe sheath day dress to a private reception for Invictus Athletes at Government House in Sydney OUTFIT TOTAL: £2,776Day nine: Tuesday 23rd OctoberQueensland: Leaving Hervey Bay AirportThe duchess, who is pregnant with her first child, boarded a Qantas jet on 23 October in an old linen shirt from J.Crew teamed with skinny jeans (pictured), before emerging on the other side in an elegant white dress from Australian label ZimmermannOUTFIT TOTAL:  £567.47 Fiji: Arriving at at Nausori Airport While on board the plane to Fiji, Meghan changed into an unusually demure white dress by Australian label Zimmermann (pictured), a label generally known for its statement prints and fabrics. She emerged at Nausori Airport looking glowing and refreshedOUTFIT TOTAL: £2,773.52Fiji: Black tie reception at the Grand Pacific HotelThe Duchess of Sussex showed off her growing baby bump as she attended a lavish black tie reception with Prince Harry on the first day of their royal visit to Fiji on Tuesday 23 October. She wore a Ginkgo cape dress from SAFiYAA in 'Fijian blue' (pictured)OUTFIT TOTAL: £1,095 Day 10: Wednesday 24 OctoberFiji: University of the South Pacific; local market in SuvaMeghan beamed in a vibrant red gown on Wednesday morning as she walked hand-in-hand with Prince Harry to the University of the South Pacific in Suva (pictured), before visiting a local market. She paired the red number with Castaner espadrillesOUTFIT TOTAL: £1,863Day 11: Thursday 25th OctoberFiji: Departing Nadi Airport The Duchess of Sussex started the day in a forest green Jason Wu design as she waved of her hosts at Nadi Airport in Fiji (pictured), before going on to change her outfit twice after touching down in Tonga. She teamed the dress with her Manolo Blahnik heelsOUTFIT TOTAL: £5,679Tonga: Arriving at Fua'amotu Airport, Nuku'alofa Meghan, 37, battled the elements as she and Harry disembarked the private jet at Fua'amotu Airport on Thursday in a £380 Self Portrait dress, teamed with Manolo Blahnik pumps. There was further embarrassment for the duchess as eagle-eyed royal watchers noticed the price tag was still hanging off her designer frockOUTFIT TOTAL: £380Tonga: Evening reception at the Royal Palace, Nuku'alofa Meghan and Harry met the King of Tonga on Thursday evening for a glittering reception and dinner, formally kicking off the Fiji leg of the royal tour. The duchess stunned in a dress by Theia Couture, described as a 'cap sleeve beaded silk satin column gown'OUTFIT TOTAL: £9,527.36Day 12: Friday 26th OctoberTonga: Meeting with the Prime Minister, Nuku'alofaThe Duchess met with the Prime Minister of Tonga, S. Akilisi Pohiva, with Harry in Nuku'alofa on Friday morning. Meghan wore a striped dress by Australian designer Martin Grant and the Manolo Blahnik BB heels she wore at Prince Louis' christeningOUTFIT TOTAL: £3,042 Tonga: Tupou College, TongatapuMeghan changed into an all-blue ensemble as she and Harry attended the unveiling of The Queen's Commonwealth Canopy at Tupou College on Friday. The pregnant Duchess looked stylish in a Veronica Beard shirt dress and pale blue heelsOUTFIT TOTAL: £2,347.54 Sydney: Australian Geographic Society Awards Just hours after touching down in Australia on Friday, Meghan had changed into a stunning Oscar de la Renta designer gown - teamed with her BB pumps - to attend the Australian Geographic Society Gala Awards at the Shanghai-La hotelOUTFIT TOTAL:  £10,000Day 13: Saturday 27th October  Sydney: Invictus Games wheelchair basketball finalThe Duchess of Sussex wore a £429 Theodore Scanlan crepe knit jacket for the Invictus Games wheelchair basketball final at the Quay centre on Saturday 27th October, teamed with her trusty Outland skinny jeans and favourite Sarah Flint pumpsOUTFIT TOTAL: £605Sydney: Invictus Games closing ceremonyFor the Invictus Games closing ceremony, Meghan wore an Antonio Berardi tuxedo dress which is believed to cost around £1,500, paired with Aquazzura 'Casablanca' pumps and jewellery from new favourite Pippa Small OUTFIT TOTAL: £2,300.42Day 14: Sunday 28th OctoberSydney: Boarding a Royal New Zealand Air Force aircraftThe Duchess of Sussex bid farewell to Australia in a showstopping burgundy dress by Hugo Boss on Sunday. She teamed a cotton jersey dress by Hugo Boss with a Cuyana mini chain saddle bag and her trusty Aquazzura 'Casablanca' pumps againOUTFIT TOTAL: £424.33Wellington: Touching down in New ZealandThe Duchess of Sussex matched her trademark taste for high fashion with a budget black dress as she and Prince Harry touched down in Wellington for the next leg of their tour on Monday. Meghan paired a Karen Walker trench coat with a maternity dress before enjoying a traditional welcome ceremony on the lawns of Government House OUTFIT TOTAL: £2,196.54Wellington: Speech at Government HouseFor her speech at Government House, Meghan wore a navy cocktail dress by New York-based Gabriela Hearst, modified to include delicate cap sleevesOUTFIT TOTAL: £15,994.20Day 15: Monday 29th OctoberThe Duchess of Sussex wore a Club Monaco trench coat over a Jac and Jack jumper and Outland Denim jeans to visit the cafe in Wellington, New Zealand on MondayOUTFIT TOTAL: £1,301.25Wellington: Walking in Abel Tasman National ParkThe royal couple strolled hand in hand in the drizzle at Abel Tasman National Park on Monday October 29th in Wellington, New Zealand. Meghan, 37, wore a raincoat from Falmouth-based brand Seasalt Cornwall teamed with her Outland jeans and trainersOUTFIT TOTAL: £810.46Wellington: Visit to Courtenay Creative Harry and Meghan chatted to actors in costume at Courtenay Creative in Wellington on Monday marking the next leg of their New Zealand visit. The Duchess wore a white tuxedo dress by Maggie Marilyn, a Kiwi designer, teamed with her Manolo BlahniksOUTFIT TOTAL: £520 Day 16: Tuesday 30th OctoberAuckland: Queen's Commonwealth Canopy dedication The Duchess of Sussex donned a $575 (GBP £317) blazer by New Zealand designer, Karen Walker, which she paired with J. Crew Toothpick jeans and $219 (GBP £120) wellington boots by Muck as she arrived arrived to dedicate a 20-hectare area of native bush to The Queen's Commonwealth Canopy in AucklandOUTFIT TOTAL: £527.65Auckland: Pillars charity launch The Duchess of Sussex ditched her Muck wellington boots for trusty Stuart Weitzman Legend stilettos, pairing them with a Brandon Maxwell customised version of the Flutter Sheath dress to launch Pillars children's charity in AucklandOUTFIT TOTAL: £3,608.77Auckland: Auckland War Museum The Duchess recycled a gown which she previously wore back in May 2017 for her first polo event with Harry early in their relationship, teamed with her Aquazzura Deneuve Bow Pumps, as she touched down at the Auckland War Memorial MuseumOUTFIT TOTAL: £3,033 Day 17: Wednesday 31st OctoberRotorua: Welcome ceremonyFor the final official day of the royal tour, the Duchess of Sussex wore a customised navy blue midi dress by Stella McCartney. Meghan also wore her Boh Runga Discologo Gold Earrings, which were given to her as a gift from the Prime Minister of New Zealand, Jacinda Ardern, and a traditional necklace OUTFIT TOTAL: £2,159Rotorua: Government Gardens The Duchess wore a bespoke knitted top and pleated skirt by her wedding dress designer Givenchy, estimated to have cost £2,210, on her final day in New ZealandOUTFIT TOTAL: £2,210Rotorua: Redwoods Tree WalkMeghan rocked casual chic in Mother jeans and a £399 Norrøna oslo lightweight down850 jacket for a forest walk in RotoruaTOTAL TO DATE: £117,934.62Prince Harry was welcomed to the Pacific Island nation by Her Royal Highness The Princess Angelika LatufuipekaPrince Harry proudly displayed his collection of military medals while honouring British-Fijian soldier Sergeant Talaiasi Labalaba.The medals worn by the prince were:  Operational Service Medal Afghanistan tour (left) - a campaign medal currently awarded by the the Ministry of Justice for service by British armed forced personnel.HM The Queen's Golden Jubilee Medal 2002 (centre) - awarded to personnel to celebrate the 50th anniversary of Queen Elizabeth II's accession to the throne. HM The Queen's Diamond Jubilee Medal 2012 (right) - a commemorative medal created in 2012 to celebrate the 60th anniversary of Queen Elizabeth II accession. Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}