{"id": "Scottish football authorities have to be proactive and take action against this violence", "paragraph": "By\n\nKris Commons For The Scottish Daily Mail\n\nPublished:\n  18:50 EST, 4 November 2018\n\n | \nUpdated:\n  18:50 EST, 4 November 2018\n\n           1View  commentsYou can't beat a bit of nostalgia. But, for all the wrong reasons, Scottish football has managed to wind the clock all the way back to the 1980s.Because of the actions of a few mindless idiots, it feels like we're back in the dark ages when stadiums were blighted by hooliganism and violence on a weekly basis.These are not isolated incidents. Anyone who subscribes to that theory needs to open their eyes.Hibs manager Neil Lennon was hit by a coin thrown by a Hearts fans during the derby clashOver the past couple of months, we've seen a linesman have his head split open, Neil Lennon and Alfredo Morelos both being hit by coins and the Hearts goalkeeper punched by a fan.There were also the disgraceful scenes near Murrayfield last weekend when Hearts and Celtic fans were squaring up before their Betfred Cup semi-final.An elderly lady - who was a completely innocent bystander - ended up in hospital after being hit in the face with a bottle that had been thrown.It's scandalous behaviour and it's happening all too frequently. It's getting beyond a joke.In my role as a pundit for Sky Sports, I've lost count of the times I've been walking round the side of a pitch and seen missiles lying on the ground - coins, lighters, all sorts.I've seen this at Rugby Park, Easter Road, Tynecastle - and I'm only talking about over the past year or so.Part of the appeal of Scottish football is its ability to produce the bonkers and the ridiculous. It's why we all love it. But there has to be a line.Football players and managers are human beings. Nobody should ever be assaulted in their place of work. It's ridiculous but, worryingly, it seems to be catching on.As far as the authorities are concerned, it's now or never. They have to be proactive and take action against this violence.Ian Maxwell was appointed chief executive of the SFA largely through politics and back-scratching. The clubs basically manoeuvred him into the role.If ever he wanted a chance to justify his position and present himself as a credible leader, this is surely it. It's time to make a stand.The same applies to Neil Doncaster at the SPFL. He's as incompetent a leader as you'll find and his organisation makes a mess of everything that comes their way.But, together, the two of them have an opportunity on their hands. They can show a united front and demonstrate a desire to tackle this head-on.Alfredo Morelos was also hit by a coin during Rangers' victory over St Mirren on SaturdayThey can't just try and kid us all on with the old party line of: 'Nothing to see here, move along now.' That ship has sailed. They can't turn a blind eye to it.They need to be ruthless and show a bit of backbone. If they don't do that, the situation is only going to become progressively worse.This is a chance for Scottish football to set an example to other countries who also suffer from Ultras and hooliganism.What are we waiting for? Are the authorities just going to let it get to the stage where someone is blinded by a coin or a missile before they actually do something?Punishing clubs won't work. The league table would lose credibility if points were deducted, while financial penalties aren't the way to go as clubs can't be responsible for a minority of idiotic fans.I actually hesitate to call them fans. They are not fans in the purest sense of the word, they are neds who attach themselves to the club.I've heard arguments recently about how it's hard to identify them. I disagree with that, it's actually very easy.These people have a uniform: it's usually black or dark in colour and it's expensive gear. They wouldn't be seen dead in a replica jersey.They are ruining football for all the rest of us. There needs to be a concerted effort to identify them and ban them for life - no ifs, buts or maybes.The Scottish football authorities need to take action against the recent violence at gamesWhen I was playing for Derby County against my former club Nottingham Forest, I had a Zippo lighter thrown at me during the game. You know, one of the big chunky ones. Never mind split my head open, it could have knocked me unconscious had it hit me.There will always be pantomime villains in football and that's why we love it. It's an entertainment industry, but there has to be a line.Some players just accept the abuse because they know nothing will ever be done and no action will ever be taken by the authorities.Neil Lennon has said he could walk away because of it. Some people will see that as motivation to keep abusing him. That's the sort of Neanderthals we're dealing with.I spent Saturday afternoon flicking between the England versus South Africa game at Twickenham and the Scotland game in Cardiff. What a contrast.I remember the Principality Stadium was once described as the world's biggest Wetherspoons. The best part of 70,000 people having a beer together and a good time.You could see Scotland fans dotted all around the stadium. There was no segregation and the place fell totally silent for the kickers. That comes down to respect.Scottish football is a long way off that. But, if Maxwell and Doncaster can sort this mess out, it'll be the best thing we've achieved as a nation for many a long year.The change must come from the very top.I spoke to a good friend of mine over the weekend. I used to play with him at Nottingham Forest and he now works for RB Leipzig.He was watching Celtic against Hearts at the weekend. Yet, despite the result and performance from Brendan Rodgers' side, I could sense confidence in my mate's voice.The Germans fancy it big time on Thursday night and it seems pretty clear now that Celtic Park is not viewed as the fortress it once was.Visiting teams no longer feel intimidated and the only way Celtic can change that is by winning games on a consistent basis.It seems pretty clear now that Celtic Park is not viewed as the fortress it once wasThat's the one thing that has been lacking in the Rodgers era. For all the slick football Celtic have played domestically, they haven't had a really standout home victory in Europe.The 3-3 draw against Pep Guardiola's Manchester City a couple of years ago was thrilling to watch, but it wasn't a win.A real statement victory in Europe is the one box Rodgers still needs to tick. I actually fancy them to do it on Thursday, given how strong their form has been over the past few weeks.If they lose, though, they can kiss goodbye to any chance of European football after Christmas. This is now a must-win. If anyone ever doubted what a good manager Tommy Wright is, just look at his St Johnstone team right now.After a 6-0 thrashing against Celtic at the start of October, Wright's men have won their subsequent four games without conceding a goal.That is a phenomenal response after such a demoralising defeat. The players' morale would have been on the floor.But Saturday's victory against Hibs at Easter Road came on the back of beating Motherwell, St Mirren and Livingston in successive games.All of a sudden, Saints are one of the form teams in the country. It's thanks in no small parts to Wright and his powers of recovery. Tommy Wright is currently doing a fantastic job as manager of St Johnstone Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}