{"id": "4 interceptions help Dolphins beat Darnold and Jets, 13-6", "paragraph": "By\n\nAssociated Press\n\nPublished:\n  18:42 EST, 4 November 2018\n\n | \nUpdated:\n  18:43 EST, 4 November 2018\n\nMIAMI GARDENS, Fla. (AP) - Jerome Baker danced, waved, waggled his index finger and clicked his heels. For a first-year linebacker, it was a surprisingly polished touchdown celebration.Baker bested fellow rookie Sam Darnold, scoring the game's only TD on a 25-yard interception return with 11 minutes left, and a resilient defense helped the Miami Dolphins beat the hapless New York Jets 13-6 on Sunday.Darnold threw four interceptions and took four sacks, and the Jets went 2 for 15 on third and fourth down.The hobbled Dolphins (5-4) endured another wave of injuries and the mysterious departure of safety Reshad Jones, who pulled himself out of the game. But their defense was much improved after three consecutive poor games .\"We never panicked; we knew what our defense was capable of,\" Baker said. \"When we are executing and do our job and play together, we're one of the best defenses out there.\"The quality of the opposition helped the defense dominate, however, allowing Miami to win with only seven first downs.Miami Dolphins outside linebacker Jerome Baker (55) celebrates a touchdown, during the second half of an NFL football game against the New York Jets, Sunday, Nov. 4, 2018, in Miami Gardens, Fla. (AP Photo/Lynne Sladky)Darnold tried to rally the sputtering Jets (3-6) from a 6-3 deficit, but following a punt the rookie took a high snap and made an ill-advised throw to tight end Eric Tomlinson. Baker stepped in front for his first career interception and scored untouched.\"I didn't throw it with confidence,\" Darnold said. \"I just alligator-armed it - threw it a little bit short.\"Much of the game was a slog, but Baker provided a video highlight celebrating with his teammates.\"There is nothing like it,\" he said, game ball cradled under his arm. \"It is the sweetest feeling ever, especially getting in the end zone, seeing your brothers running toward you.\"T.J. McDonald and Walt Aikens made interceptions to end the Jets' final two possessions.\"The guys did a good job of complementary football,\" Dolphins coach Adam Gase said. \"They played together. They did a good job of stopping the run and making it as one-dimensional as possible.\"Miami broke a two-game losing streak and won for only the second time in the past six games. Gase improved to 5-1 against the Jets, including two wins this year.The Jets lost their third in a row and have scored 33 points during the skid. They've dropped nine of their past 10 road games dating to 2017.Darnold went 21 for 39 for 229 yards and a passer rating of 31.8. He came into the game tied for the NFL lead with 10 interceptions , and the four picks were a new high.\"Two for sure he'd like to have back,\" coach Todd Bowles said. \"Back to the drawing board.\"Cameron Wake and Akeem Spence had two sacks apiece for the Dolphins, who had allowed 102 points the previous three weeks.\"Everybody playing together, front to back side to side, and getting a win, that's about as rewarding as it is,\" Wake said.TO THE BENCHJones, whose tendency to freelance has been an issue, watched the second half from the sideline. Gase said he didn't know whether Jones was hurt.\"It sounds like he pulled himself out,\" Gase said. \"I've just got to find out what happened there.\"Jones didn't talk to the media after the game.DOLPHINS SUBMiami totaled only 168 yards, but Brock Osweiler improved to 2-2 as a starter filling in for the injured Ryan Tannehill . Osweiler went 15 for 24 for 139 yards and took four sacks, but his unit committed no turnovers.\"It was just a good old-fashioned fight on the field, and it was fun,\" Osweiler said. \"We won.\"INJURY REPORTDolphins: LT Laremy Tunsil (knee) left in the fourth quarter. ... RT Ja'Wuan James (knee) departed in the first half, but later returned. ... CB Bobby McCain was evaluated for a concussion. ... DE Robert Quinn limped off in the field in the closing minutes.Jets: C Spencer Long aggravated an injury to the middle finger of his right hand and had half a dozen off-target snaps before leaving the game. ... Backup LB Tarell Basham (knee) left the game in the second half.FULL WEEKENDThe field looked worn but was not an issue less than 24 hours after the Miami Hurricanes and Duke played on it in a downpour.NATIONAL ANTHEMDolphins receiver Kenny Stills kneeled during the anthem and Quinn stood with his right fist raised, as they have done before other games.UP NEXTDolphins: play at Green Bay for the first time since 2010 on Nov. 11.Jets: play host to Buffalo on Nov. 11. The teams also meet on Dec. 9.___Follow Steven Wine on Twitter: http://twitter.com/Steve_Wine___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFLMiami Dolphins defensive end Cameron Wake (91) sacks New York Jets quarterback Sam Darnold (14), during the first half of an NFL football game, Sunday, Nov. 4, 2018, in Miami Gardens, Fla. New York Jets offensive tackle Brandon Shell (72) is on the left. (AP Photo/Lynne Sladky)Miami Dolphins quarterback Brock Osweiler (8) looks to pass, during the first half of an NFL football game against the New York Jets, Sunday, Nov. 4, 2018, in Miami Gardens, Fla. (AP Photo/Wilfredo Lee)Miami Dolphins outside linebacker Kiko Alonso (47) intercepts a pass intended for New York Jets wide receiver Deontay Burnett (18), during the first half of an NFL football game, Sunday, Nov. 4, 2018, in Miami Gardens, Fla. (AP Photo/Lynne Sladky)Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}