{"id": "RUTH SUNDERLAND: Amazon must stop treating taxpayers with such disdain ", "paragraph": "By\n\nRuth Sunderland for the Daily Mail\n\n\nPublished:\n  19:38 EST, 24 October 2018\n\n | \nUpdated:\n  19:54 EST, 24 October 2018\n\n         135View  commentsTonight, after the U.S. stock markets have closed, traders will fall silent as they wait for the latest update from the colossal, world-conquering corporation that is Amazon.Sales by the internet shopping behemoth will be stupendous. In the space of a mere three months over the spring and early summer, it rang up revenues of nearly $53 billion. In the most recent quarter it is likely to have done even better.It's a testament to the visionary talent of Jeff Bezos, the founder of Amazon and child of a single mother who became the world's richest man with a fortune of around $150 billion.The latest evidence of Amazon's might is maddening when you consider its derisory £4.67 million bill last year in UK corporation tax, writes RUTH SUTHERLAND ScornBut while this is a true corporate triumph, the latest evidence of his company's might is maddening when you consider its derisory £4.67 million bill last year in UK corporation tax. It is a piffling sum — and one surely driving Chancellor Philip Hammond to distraction as he prepares for his Budget on Monday.For everything about Amazon is big with a capital B — except its British corporate tax bill, which can only be described as insultingly tiny.Yet far from being abashed, the company and the well-paid lobbyists who act on its behalf are brazen in their efforts to maintain tax advantages.In an outrageous attempt to hold Mr Hammond to ransom, an industry group representing the U.S. company and its fellow tech giants have sent a letter threatening to pull investment from this country after Brexit if he dares to put a tax on digital sales (as opposed to the current levy on profits, which are far smaller thanks to clever accounting).Lobbyists for Amazon and its peers even had the gall to depict a digital sales tax as a 'smash and grab raid', as if the Chancellor were threatening to put a stocking over his head and reach for his cosh.Hammond should treat this cheap threat with the scorn it deserves. Amazon is no poor, innocent victim of a larcenous Treasury. It is one of the biggest, richest businesses on this planet. It doesn't take a retail genius to see that the relentless rise of Amazon has coincided with, if not precipitated, the crisis in the British High Street, of which Debenhams is just the latest example.Everything about Amazon is big with a capital B — except its British corporate tax bill, which can only be described as insultingly tiny, writes RUTH SUTHERLAND Of course the wider trend for online shopping is also to blame — but Amazon is on its own in terms of size and influence.Then there are the stories — routinely denied — about underpaid and over-worked warehouse staff. It's no coincidence, perhaps, that Amazon has recently tried to defuse such bad publicity by raising its rates of pay and boasting that it's creating a thousand high-tech roles in the UK.But there is another reason Amazon should be forced to pay a larger amount of tax: it would secure the goodwill of British consumers who continue to have a love-hate relationship with this tax-avoiding American behemoth.Millions of us — me included — are addicts who have come to depend on its speed, convenience and competitive prices. We may like the idea of browsing in a quirky independent bookshop, but our lives are too busy. Instead we feel a shiver of guilt as we click and download a novel instantly to our Kindles instead.The last thing I want is to feel compelled to boycott the company. What I — and I suspect most people — would like is to get my Amazon fix without constantly feeling enraged that it's taking the government, and taxpayers, for mugs.The company and its cheerleaders should remember that it prospers in Britain thanks in large part to our taxes. Who does Amazon think paid to educate its British workforce; or for the NHS that looks after its staff; or the roads on which its vans deliver parcels? An examination of Amazon's statistics is enough to show how inadequate its British tax contribution really is.It employs 575,000 people across the globe, not far off the population of Luxembourg, and its retail operations are merely one element of the business. Most people don't realise Amazon is the biggest investor in the world in so-called cloud computing (where remote servers store vast amounts of data — for a fee).Amazon shares have risen by around 80 per cent in the past year, and its value on the U.S. stock market briefly topped one trillion dollars in the autumn.All of which means there is no sane universe in which it's acceptable for Amazon to pay so little corporation tax here.An examination of Amazon's statistics is enough to show how inadequate its British tax contribution really is, writes RUTH SUTHERLAND The company says it hands over all taxes that are due to the British Exchequer. According to the letter of the law, that's correct. But so what? That does not make the situation morally defensible.The technical reason the firm's tax bill is so small is that corporation tax is levied on profits, not sales. And here's the rub: Amazon's profits are relatively low, because it has been a big investor in this country and can offset investment costs against earnings, to reduce the bottom line.DangerIts sales, however, were a hefty £8.8 billion in the UK in 2017, the relevant period.In any case, there's no need to descend into the dark corners of tax policy to see that the amount it paid to HMRC is minuscule in proportion to the epic scale of its business.Philip Hammond has made no secret of the fact he would like to impose a digital tax. He has held off thus far because he would prefer to act in concert with his international counterparts.The danger is that if the UK takes action alone then tech companies may seek a more congenial regime elsewhere, at the cost of British jobs. But the EU has been hamstrung in toughening its tax regime, mainly because member states like Luxembourg and Ireland have shamelessly courted digital businesses by offering them tax breaks.Treasury officials say Philip Hammond is prepared to go it alone early next year if the EU is still not ready to act.As a first step, he may impose a tax on revenues rather than profits, and later there might be a complicated formula to tax such firms based on the value of UK customers' data.But there is scope for more imaginative solutions to the digital tax dilemma.AbuseCompanies have moved into the 21st century, but governments are still trying to tax them using a system invented for an earlier era.The good news is that the technology which has reaped so much money for companies like Amazon could also enable policymakers to come up with creative forms of tax collection.They could, for instance, levy a micro-tax on the likes of Amazon every time a customer clicks the Buy button. It would soon add up to substantial sums, as well as being impossible to avoid.They might be tempted to raise prices, but the cut-throat competition they created on the internet would limit scope for passing the tax onto customers. The biggest benefit, though, is that it would be easy to collect and hard for firms to manipulate.Also, Amazon began life as a bookshop, so how about a tax based on its UK book sales to fund the public libraries closing at an alarming rate?Before the financial crisis, companies prided themselves on paying as little tax as possible. That is no longer socially acceptable. We have come to recognise that paying the bare minimum amounts to a contemptuous abuse of taxpayers.So yes, Amazon is a welcome investor in this country, but it's time it treated taxpayers with respect. If it continues to show disdain, the Chancellor must step in.\n\n\n      Trump stands in the devastating ruins of Paradise and takes a tour of neighborhood incinerated by worst wildfire in state's history as more than 1,000 people are feared missing and death toll hits 74 \n    \nPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}