{"id": "Australian parents who flee the country with their children could spend three years in jail", "paragraph": "By\n\nKelsey Wilkie For Daily Mail Australia\n\n\nPublished:\n  19:50 EST, 20 October 2018\n\n | \nUpdated:\n  19:55 EST, 20 October 2018\n\n           8View  commentsAustralian parents who flee the country with their children could face up to three years behind bars under new laws.Until now, it has not been a criminal offence for parents to leave the country with their children without permission from the other parent. As of next year, international parental child abduction laws will come into effect,  allowing federal police to track runaway parents down, The Daily Telegraph reported. Parents leaving Australia with their children without permission from the other parent has not be a criminal offence previouslyThe Federal Police will have the power to investigate the parent’s emails and text messages in suspected abduction cases. Extradition will also be possible.Cases where parents flee due to domestic violence will have a defence against the charges.Attorney-General Christian Porter said parental child abduction was traumatic and criminalising it would provide a strong deterrent.He said it also provided a tool for law enforcement to pursue and prosecute.Former Family Court judge Nahum Mushin said international child abduction was worthy of criminal punishment. 'Unilaterally removing a child is very serious and, as such, making it a criminal offence is justifiable.' Australian parents fleeing the country with their children will face up to three years behind bars under new laws that will enable federal police to track them downA prominent case that made headlines across the world involved Brisbane mother Sally Faulkner, who attempted to retrieve her children from Beirut, where they live with their father. There were 80 Australian parents who sought 143 allegedly abducted children taken overseas in the past financial year.About 36 per cent of those children had been taken to New Zealand, while 17.5 per cent had been taken to the United States or United Kingdom. Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}