{"id": "Socialite charged with smuggling python-skin fashionwear into Britain", "paragraph": "By\n\nMartin Beckford for The Mail on Sunday\n\nPublished:\n  18:33 EST, 17 November 2018\n\n | \nUpdated:\n  20:45 EST, 17 November 2018\n\nView  commentsShe leads a life of glamour as one of the ‘rich kids of Instagram’, sharing pictures of high-end designer clothes and supercars for her followers to admire.But heiress and swimwear model Stephanie Scolaro cut a very different image as she appeared in a London court accused of smuggling python-skin fashion accessories into the UK – and of keeping specimens of the endangered snakes in her home.Dressed in plain black trousers and a dark jacket, the socialite was in the dock at Westminster Magistrates’ Court on Friday over allegations of illegally importing baseball caps and bags made of snakeskin from Indonesia.The 26-year-old then advertised the smuggled goods on her fashion website, SS Python, the court was told. She is also said to have kept python specimens in her luxury Marylebone apartment and a Mayfair boutique. If found guilty, she could be jailed for up to six months.Highs... and lows: Miss Scolaro leans against a Rolls-Royce in Los AngelesMiss Scolaro has more than 80,000 followers on Instagram, where she posts images of herself – often scantily-clad – in exotic locations across the globe.Just last week she put up a photo of herself on Rodeo Drive – home to Los Angeles’ most exclusive stores – leaning against a bright yellow convertible Rolls-Royce.She and her sister Lana starred in the Channel 4 reality TV show Rich Kids Of Instagram after flaunting their jet-set lifestyles on social media.Rose Edwin, prosecuting, told the court: ‘The case involves products derived from endangered species, namely a python. Information was received by the UK Border Force involving possible sales of listed species.‘It is believed the item had been exported from Indonesia and imported into the UK without the appropriate import permits. The items were advertised on the SS Python website.’Miss Scolaro is charged with two counts of importing goods with the intent to evade a prohibition, two counts of keeping for sale a species acquired unlawfully and one count of selling a species unlawfully imported.Stephanie Scolaro arriving at Westminster Magistrates Court last weekOne charge relates to the importation of one black travel holdall, five white baseball caps, five black baseball caps and one white backpack ‘derived from python’, and the second concerns five red and one black baseball cap, plus one black holdall. The third charge alleges that she ‘kept for sale’ python specimens at her flat on Baker Street and the fourth that she kept them at a shop on South Molton Street.If found guilty of either of those counts, she faces unlimited fines and up to six months’ jail under the Control of Trade in Endangered Species (Enforcement) Regulations 1997. The final charge is that she sold a ‘baseball cap derived from python species’ at a shop in south London.Scolaro allegedly sold a ‘baseball cap derived from python species’ at a shop in south London (file picture)Her lawyer Rhona Freedman said: ‘The value of the items is less than £20,000, in due course we may get a more precise value.’Miss Scolaro did not enter pleas and was granted bail ahead of a trial preparation hearing at Southwark Crown Court next month.Miss Scolaro – known as Stephy – and Lana are the daughters of an Italian mining tycoon father and a British mother. They attended Mill Hill School in north London, where boarding fees are £33,717 a year, but regularly fly by private plane to family homes in Monaco, Ibiza and New York.Lana, who designs diamond jewellery, once claimed she spent £15,000 a month on clothes and shoes.Stephanie told The Mail on Sunday’s You magazine in 2016: ‘I think the first time I was really aware that we were rich was in my early teens. We were taking a private jet to Monaco and eating sushi from Nobu and something told me that regular kids didn’t do that.’She said she planned to launch a brand of caviar ‘because there’s, like, a real demand, you know?’.\n\t    Share what you think\n          No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards.\n      \nBy posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}