{"id": "Utility emailed woman about problems 1 day before fire", "paragraph": "By\n\nAssociated Press\n\nPublished:\n  18:34 EST, 12 November 2018\n\n | \nUpdated:\n  10:54 EST, 13 November 2018\n\nPULGA, Calif. (AP) - A day before a deadly blaze destroyed a California town, the giant utility Pacific Gas & Electric Co. got in touch with Betsy Ann Cowley, saying the company needed access to her property because its power lines were causing sparks.The cause of the fire is still under investigation. What is known is that it started Thursday near Cowley's property in the tiny town of Pulga, incinerated the neighboring town of Paradise and killed at least 42 people.On Monday, fire investigators declared the area surrounding power lines on Cowley's property, in an oak-filled canyon, a crime scene. Security guards would not let PG&E inspectors pass.Cowley said she was on vacation last Wednesday when she got a surprise email from PG&E. Details of that exchange, described to The Associated Press, combined with the utility's track record in California wildfire history has again brought the company under scrutiny.The email said that crews needed to come to her property to work on the high-power lines, Cowley said. PG&E told her \"they were having problems with sparks,\" she said. They visited her property but she said she wasn't there Wednesday and was not aware of their findings.Cowley was back at the property Monday and expressed gratitude at finding most of the 65 structures on it still standing, just a few hundred feet from the crime scene where investigators worked to determine what had happened to spark the massive fire.Private security guards block the road in Pulga, Calif., Monday, Nov. 12, 2018, to where investigators were trying to determine how the deadly Camp Fire started in Northern California that destroyed the town of Paradise. With the cause of the inferno under investigation, Pacific Gas & Electric Co. came under scrutiny after telling state regulators that it had been having a problem with an electrical transmission line in the area before the fire broke out. Investigators with the state fire agency were at the scene of the transmission line Monday. (AP Photo/Peter Banda)The former landscaper bought Pulga, an abandoned and decrepit historic gold prospecting town, in 2015 and embarked on a project that transformed it into a picturesque private destination. She cleared overgrown brush, patched up buildings and added new ones. With Bay Area artists and architects, she recreated a town, complete with a stage and school house. And then, a year ago, she opened for business, renting out Pulga for corporate retreats.As she reached the site of her own home, she raised her hand to her cheek.\"It's gone,\" she said. 'That's where all my stuff was, but it's not there anymore.\"She paused and picked up a mug that somehow had survived the inferno. \"It's OK,\" Cowley told herself quietly. \"It's OK.\"PG&E declined to discuss the email it sent Cowley with AP, saying it has provided an \"initial electric incident report\" with state regulators and will fully cooperate with any investigations.Publicly, PG&E has said it experienced a problem on an electrical transmission line near the site of the massive fire, minutes before the blaze broke out.In its Friday filing to the state Public Utilities Commission, it said it had detected an outage on an electrical transmission line near the site of the blaze. It said a subsequent aerial inspection detected damage to a transmission tower on the line.The area where CalFire says the blaze started, and where PG&E says sparks were detected on Cowley's property is roughly the same, according to an AP reporter at the site.The utility, which has been criticized and sued in a number of other large and deadly fires across California, had announced before the blaze started that it might shut down power in nine counties, including Butte County where Pulga and Paradise are, because of extreme fire danger. But it never did.Later Thursday, PG&E said it had decided against a power cut because weather conditions did not warrant one.State Sen. Jerry Hill, a Redwood City Democrat and longtime critic of the utility, called the report of troubles on PG&E's lines in the area extremely worrisome.\"If PG&E is found responsible for burning down the state again, at some point we have to say enough is enough and we have to ask should this company be allowed to do business in California?\" Hill said. \"These fires take a spark, and at least in the last few years fires have been caused by negligent behavior by PG&E. We need to see how we can hold them responsible, or look at alternative way of doing business.\"California utility regulators are working with CalFire staff on their own, separate investigation into whether PG&E complied with state rules and regulations in areas that were torched in the fire.The California Public Utilities Commission will be evaluating PG&E's maintenance of their facilities, vegetation management and emergency preparedness and response, said commission spokeswoman Terrie Prosper.This is not the first time PG&E's management practices have come under question in the drought-stricken state.In 2014, regulators ordered the state's investor-owned utilities to set priorities for inspecting and removing dead and sick trees near their power lines, warning that \"climate change has facilitated and exacerbated numerous wildfires\" that have damaged and threatened their facilities.But after a wildfire killed two people, destroyed 475 homes and scorched 70,000 acres in the Sierra Nevada foothills the following year, homeowners and their attorneys questioned whether PG&E had done enough to clear dry trees flanking its power lines. In 2016, Cal Fire ultimately found PG&E was responsible for that fire, after tree maintenance by PG&E and its contractors led to a tree falling on a power line.Investigators have determined that PG&E equipment started several of the 2017 wildfires in Northern California wine country that killed 44 people. The company says it expects to pay more than $2.5 billion.___Burke reported from San Francisco. Associated Press writer Jocelyn Gecker also contributed from San Francisco.Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}