{"id": "JANET STREET-PORTER: If you can’t take a joke, snowflakes, you shouldn’t have joined the human race", "paragraph": "By\n\nJanet Street-Porter For Mailonline\n\nPublished:\n  19:48 EST, 30 October 2018\n\n | \nUpdated:\n  07:04 EST, 1 November 2018\n\n        1.5kView  commentsI honestly believe (as would any rational person) that the editor of Waitrose Food Magazine was joking when he wrote he'd like to run a feature about 'killing vegans one by one'.William Sitwell was responding to a dreary email from a freelance journalist who had suggested a series about 'plant-based meals'.Mr Sitwell's brisk response was 'how about a column called The Honest Vegan, a millennial's diary of earnest endeavour and bacon sandwiches…' Selene Nelson was mightily offended and so were the bosses at Waitrose, who said his words were 'extremely inappropriate and insensitive'.  As a result, Mr Sitwell has had to resign and fellow food writers and chefs have expressed outrage that a joke (albeit in poor taste) has left him without a job. He issued a grovelling statement claiming to 'love and respect people of all appetites, be they vegan, vegetarian or meat eaters'.William Sitwell (pictured) was responding to a dreary email from a freelance journalist who had suggested a series about 'plant-based meals'Pass the sick bag! William Sitwell was guilty of attempting to be IRONIC - a quality that's lost on modern snowflakes who queue every day for the joy of eating a nut burger or tofu wrap on a recycled uncomfortable bench.The devotees who shun almonds and fret about avocados are joyless people for whom every meal is a political statement.Sadly for Mr Sitwell, these are difficult times for anyone who has a black sense of humour. I don't even know if that expression passes the politically correct test any more - perhaps I should say 'darker' humour. If irony is your bag, nowadays you could be guilty of hate speech - make fun of gender fluidity, vegans (and cyclists) at your peril.Most have had a humour bypass.William Sitwell had already stated his growing irritation with the onslaught of propaganda emanating from non-meat eaters - in January he wrote in a newspaper 'vegans are parking their tanks on all of our lawns. And their instruction manuals are coming like propaganda pamphlets dropping from the sky'. In other words, it's war out there in foodie world, and meat eaters had better be scared.I am sure that Mr Sitwell did not want to end of life of a vegan, but in politically-correct 2018, one person's savage retort is another's insult, the source of deep hurt and potential legal action.Once, we regarded people who swore and trashed others publicly as excitingly outspoken - in the 1970's comedians like Richard Pryor sprinkled his act with the n-word, Dennis Lehry- launched his career 25 years ago with No Cure For Cancer - ('it's great having throat cancer because a tracheotomy means you can puff two cigarettes at once') and Larry Amaros joked he knew gay burglars had been round because they re-arranged the cushions.Much of that stuff wouldn't be acceptable today. Especially on university campuses, with their 'safe spaces'. Gays would feel stereotyped. The gender fluid people would feel left out. Cancer victims would be offended and the opioid crisis in the USA means drugs are no longer comedy material.Our use of language and our ability to trade insults is becoming pitifully safe as we strive not to upset each other.It takes a big old beast from another generation to cause maximum offence these days - and his name is Donald Trump.I am sure that Mr Sitwell did not want to end of life of a vegan, but in politically-correct 2018, one person's savage retort is another's insult, the source of deep hurt and potential legal action, writes Janet Street-PorterCommentators in the liberal press and even the Financial Times accuse the President of using over-the- top language in his tweets to stir up his followers and goad them into aggressive acts. But is there really a link between calling the President of North Korea 'rocket man' and the threat of nuclear war? A couple of months later they announced they were in love with each other. It's all posturing and puppetry.When Trump rants in block capitals about migrants being DEALT WITH, he's inadvertently revealing his inability to do anything to stop the thousands of people arriving on the Mexican border from Guatemala, people who are legally entitled to claim asylum in the USA.The more abusive and shouty Trump is, the less powerful he seems. The President is old school, a man who would talk about women as if they were plastic shop display models rather than living breathing humans. Perhaps because attractive women threaten him, maybe because (if we believe Stormy Daniels) a sexual encounter-rather than a brief social interaction in public view - might reveal him to be a less than inpressive specimen. Who feels powerful in their pants? No wonder he's calling her 'horseface'.Only the other week Trump belittled a female reporter from ABC News, saying 'she never thinks' before asking a question.He called Senator Elizabeth Warren 'Pocahontas' because she claimed Native American Indian ancestry - a claim which turned out to be (just about) true.He routinely calls women of a certain age ugly. But most savvy females don't find Trump upsetting - he's typical of white men of his generation in positions of power.Clothing multimillionaire Sir Phillip Green is another posturing ranter of a certain age - accused by several members of staff of racist and sexist remarks and bullying tactics, Green has spent over £500,000 trying to keep details of his behaviour out of the press and god knows how much on legally binding gagging settlements for his victimsHe is alleged to have told one woman he'd like to chuck her out of the window, but she was so fat 'she'd probably bounce back'. He says he's being 'used as a target' and was just indulging in 'banter.'In my opinion, Sir Phillip is more dislikeable for his appalling treatment of the pensioners who worked at BHS and who faced poverty in their retirement because of his mismanagement.I can't get that worked up about insults in the workplace - because men of that generation (and women too) frequently lost their temper when things weren't going according to plan. I certainly did.Millennials need to grow thicker skins and chill – because nowadays most bullies are frightened men of a certain age. Dinosaurs.\n\n\n      Trump stands in the devastating ruins of Paradise and takes a tour of neighborhood incinerated by worst wildfire in state's history as more than 1,000 people are feared missing and death toll hits 74 \n    \nPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}