{"id": "Marine General claims military won't deny access to migrants at border", "paragraph": "By\n\nLeah Mcdonald For Dailymail.com\n\nPublished:\n  18:57 EST, 17 November 2018\n\n | \nUpdated:\n  18:58 EST, 17 November 2018\n\nView  commentsA top official in the Trump administration said the presence of of military troops at the US-Mexico border is ‘not to deny access to migrants’.General Joseph Dunford, chairman of the Joint Chiefs of Staff, said military personnel were there to provide engineering support at points of entry, CBS News reported.He told the Halifax International Security Forum that they are also there to provide logistical and medical support to customs and border police.General Joseph Dunford, chairman of the Joint Chiefs of Staff, said the presence of of military troops at the US-Mexico border is ‘not to deny access to migrants’He said: 'The tasks that we are providing are in support of the Department of Homeland Security.‘And nothing that we are doing is illegal. What we are doing now in support of customs and border police and Homeland Security more broadly is filling legitimate capability gaps that they have with military capabilities’.Dunford said that the migrants would not face American soldiers upon crossing the border.‘Our job is not to deny access to migrants into the United States. Our job is to support the Department of Homeland Security in doing their job,’ Dunford said.Democrats have criticized  Trump's decision to deploy military troops to the border, believing his emphasis on the caravan before the election was a campaign ploy.Meanwhile many of the nearly 3,000 Central American migrants who have reached the Mexican border with California via caravan said Saturday they do not feel welcome in the city of Tijuana.US Border Patrol agents and military pass concertina wire during a tour of the San Ysidro portUS military watch as crew workers add concertina wire to reinforce the the border fenceUS Border Patrol and Defense Department officers guard near the border fence with MexicoSeagulls stand on border structure as brand new concertina wire tops its crest, seen from the Mexican side where the border meets the Pacific OceanTijuana Mayor Juan Manuel Gastelum has called the migrants' arrival an 'avalanche'that the city is ill-prepared to handle, calculating that they will be in Tijuana for at least six months as they wait to file asylum claims.The mayor of Tijuana said Friday that the city was preparing for an influx that will last at least six months and may have no end in sight.Tijuana officials have asked the Mexican government for $4 million to deal with the influxUS border inspectors are processing only about 100 asylum claims a day at Tijuana's main crossing to San Diego.Asylum seekers register their names in a tattered notebook managed by migrants themselves that had more than 3,000 names even before the caravan arrived.The vast majority of migrants are camped at an outdoor sports complex, sleeping on a dirt baseball field and under bleachers with a view of the steel walls topped by barbed wire at the newly reinforced U.S.-Mexico border.The mayor of Tijuana Juan Manuel Gastelum (left) said  that the city was preparing for an influx while US President Donald Trump branded the migrant caravan 'a big con' The city opened the complex after other shelters were filled to capacity. Church groups provided portable showers, bathrooms and sinks.The federal government estimates the migrant crowd in Tijuana could soon swell to 10,000.Rivera said 1,800 Hondurans have returned to their country since the caravan first set out on October 13 and that he hopes more will make that decision.'We want them to return to Honduras,' Rivera said, adding that each migrant must weigh whether to go home, appeal for asylum in Mexico or wait in line to apply for asylum in the Us. The Mexican Interior Ministry said Friday that 2,697 Central American migrants have requested asylum in Mexico under a program that the country launched on October 26 to more quickly get them credentials needed to live, work and study in southern Mexico.Central American migrants wait in line for a donated breakfast at a temporary shelter in TijuanaA Central American migrant boy eats a donated breakfast at a temporary shelter in Tijuana, Mexico, early on Saturday morningHonduran migrant Mauro Hernandez rests inside a makeshift tent at a temporary shelter in Tijuana, Mexico, early Saturday morningThe migrants' expected long stay in Tijuana has raised concerns about the ability of the border city of more than 1.6 million to handle the influx.Tijuana officials said they converted the municipal gymnasium and recreational complex into a shelter to keep migrants out of public spaces. The city's privately run shelters have a maximum capacity of 700. The municipal complex can hold up to 3,000 and as of Friday night there were 2,397 migrants there.Some business owners near the shelter complained on Saturday of migrants panhandling and stealing.Francisco Lopez, 50, owns a furniture store nearby. He said a group of migrants took food from a small grocery a few doors down, and he worries that crime in the area will rise the longer the migrants stay at the shelter.Other neighbors expressed empathy. 'These poor people have left their country and they're in an unfamiliar place,' said Maria de Jesus Izarraga, 68, who lives two blocks from complex.Trump, who sought to make the caravan a campaign issue in last week's elections, took to Twitter on Friday to aim new criticism at the migrants.'Isn't it ironic that large Caravans of people are marching to our border wanting U.S.A. asylum because they are fearful of being in their country - yet they are proudly waving ... their country's flag. Can this be possible? 'Yes, because it is all a BIG CON, and the American taxpayer is paying for it,' Trump said in a pair of tweets.\n\t    Share what you think\n          No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards.\n      \nBy posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}