{"id": "Jacob Rees-Mogg slams 'shameful' university bosses", "paragraph": "By\n\nBrendan Carlin\n\n\nand \nJames Heale For The Mail On Sunday\n\nPublished:\n  19:43 EST, 20 October 2018\n\n | \nUpdated:\n  20:29 EST, 20 October 2018\n\n         144View  commentsBrexiteer Jacob Rees-Mogg has accused university bosses of a 'shameful' attack on freedom of speech after charging Tory students for security for his visit.The Conservative MP also branded the move politically biased, saying it would lead to only 'Corbynite speakers' as they were less likely to attract protests than Right-wing ones.Mr Rees-Mogg addressed Bristol University Conservative Association (BUCA) earlier this year – just two weeks after he was accosted by protesters at the nearby University of the West of England. Jacob Rees-Mogg addressed students at the Bristol University Conservative Association who were charged £500 for extra security by college authorities But it emerged last week that, in the wake of that incident, Bristol University chiefs put on extra security and charged the university's Tory association nearly £500 for it.The bill has allegedly led to the association being 'bankrupted' and forced to stage an emergency auction to raise cash. But Mr Rees-Mogg condemned the move last night and called on university chiefs to meet the cost. He said: 'It didn't occur to me that a university association would have to pay a fee for a speaker to come.'It means you can have Corbynite speakers but not Conservative ones. You cannot have any speaker from the Right because they are more likely to attract protests.Mr Rees-Mogg said the association had been 'bankrupted' and needed an emergency auction to raise the cash'This is really hostile to freedom of speech. If the university does not provide basic security for visiting speakers, what are students paying their fees for?'He suggested charging students for security would make it almost impossible to have elected MPs as their speakers.Bristol University hit back last night, saying it was 'firmly committed to upholding freedom of speech as well as ensuring events are conducted safely'.It said there had been 'safety concerns' about Mr Rees-Mogg's visit and that BUCA had been made aware of that and the £496 cost. A spokesman said: 'Jacob Rees-Mogg praised the professionalism of both security and police on the evening.'\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    We are no longer accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}