{"id": "Kasper Schmeichel fears memory of helicopter crash will stay with him forever", "paragraph": "By\n\nPhil Blanche, Press Association Sport\n\nPublished:\n  18:48 EST, 4 November 2018\n\n | \nUpdated:\n  18:48 EST, 4 November 2018\n\n           4View  commentsKasper Schmeichel fears he will never be able to wipe out the memory of the helicopter crash which killed Leicester owner Vichai Srivaddhanaprabha.The Thai businessman and four others died just outside the King Power Stadium on October 27, moments after Srivaddhanaprabha's helicopter had taken off from the pitch.Leicester goalkeeper Schmeichel, who was part of a delegation from the club who arrived in Bangkok on Sunday to pay their respects to Srivaddhanaprabha, witnessed the accident following the Premier League game with West Ham.Kasper Schmeichel (R) pays his respects at Vichai Srivaddhanaprabha funeral on Saturday'I was on the pitch and I waved him off,' Schmeichel said after the Foxes had returned to action following the tragedy with a 1-0 victory at Cardiff on Saturday.'I saw it all happen. It is something that will stay with me, unfortunately. It's not a nice memory but I've had all the support that I need.'The club has been great and everybody has received the support that they needed.'Schmeichel joined Leicester in 2011, the summer after Srivaddhanaprabha had bought the club.The Denmark international has since played over 300 games for the Foxes and was a huge figure in Leicester's 2015-16 title-winning season, one of the most remarkable underdog success stories in the whole of sport.The Leicester goalkeeper weeps as he and his team-mates observe a minute's silenceSchmeichel reveals he waved off the club's late chairman before seeing his helicopter crashSchmeichel said he was 'shaking' in the warm-up at Cardiff and he was clearly emotional as the Leicester playing squad and staff stood around the centre circle before kick-off to observe a minute's silence.'It was tough,' Schmeichel said.'But we wanted to do it for the chairman and his family. We wanted to be together about this, because we've all lost what feels like a family member.'He brought everybody here and none of this - the memories, this family he's built, the culture he's instilled - would be here without him.Schmeichel fears he will never be able to wipe out the memory of the helicopter crash'When he took over this club it was in a pretty precarious situation, and to build what he has is quite amazing.'It's one thing building a team and a club that can perform on the pitch, but we're more proud of the family that he's created and the feeling he's instilled in everybody being welcome.'It doesn't matter who you are or what kind of position you have at the club. Whether it be player, staff, stadium staff, security - whatever it may be - everyone is equal and part of the family.'The Leicester players and staff flew to Thailand straight after Demarai Gray's second-half strike had secured the points in the Welsh capital.Schmeichel joined Leicester in 2011, the summer after Srivaddhanaprabha (L)  bought the clubThey will return in time to prepare for Saturday's home game against Burnley, the first match to be played at the King Power Stadium since the tragedy.'We talked in the dressing room that there was really no need for game-plans, tactics, all that. It was about controlling our emotions,' Schmeichel said of the Cardiff win.'We've had great times, but this was different. It felt like a cup final. I haven't really known a feeling like it on the pitch.'I was just really glad to have won, because for someone to have an impact on so many lives is quite unique. The impact he's had on my family has been amazing and I'm proud to be part of his family.'Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}