{"id": "Strictly Come Dancing: Danny John-Jules reveals he COLLAPSED in rehearsals", "paragraph": "By\n\nLaura Fox For Mailonline\n\nPublished:\n  19:51 EST, 24 October 2018\n\n | \nUpdated:\n  15:12 EST, 26 October 2018\n\n          25View  commentsStrictly Come Dancing star Danny John-Jules has revealed he collapsed in rehearsals just hours before earning the first ten of the series.The 58-year-old Red Dwarf star made the shock revelation during an appearance on Wednesday's It Takes Two, saying he fainted during a tech run with partner Amy Dowden.Danny's jive earned rave reviews from the judging panel and viewers alike on Saturday, and with a score of 37 out of 40 he placed the highest so far this series.Tough time: Strictly Come Dancing star Danny John-Jules has revealed he collapsed in rehearsals just hours before earning the first ten of the seriesAppearing on the BBC2 sister show, Danny explained to host Zoe Ball he underestimate how much of a toll the gruelling rehearsals were taking on his body, leading to his shock collapse.He said: 'It's cardio, fitness. I haven't moved like that since a long time. You worry about slowing down and if you slow down it's a bit of a no-no.'I did collapse after the second run, the tech run on Friday.'The floor manager looked down at me looking up at the ceiling and asked me: ''Do you want to do another one?''Shocking: The 58-year-old made the shock revelation on sister series It Takes Two with dance partner Amy DowdenDramatic: Danny said a day before the live show he fainted during a tech run, but went on to wow the judges with his jiveHe later added that his knees were screaming 'louder than Amy' during his performance on Saturday.'It was all a blur. When I finished, I looked at Amy and only then I realised it had been good,' he said.'I was still in a daze when I got to the judges and it didn't sink in until a day later when all the messages started coming in from social media.'Doing well: Danny also said his 'knees were screaming louder than Amy' after they finished the stellar routineShow-stopping: Danny's jive on Saturday earned rave reviews from the judges and viewers, who went wild for the energetic routine to Flip, Flop And Fly by Ellis HallDanny's jive on Saturday earned rave reviews from the judges and viewers, who went wild for the energetic routine to Flip, Flop And Fly by Ellis Hall.Earning a ten from Darcy and nines from the other judges, it was the highest score of the series so far, and sent the dancing duo storming through to next week.This week Danny and Amy will take to the floor for a spooktacular Halloween special, dancing an American Smooth to Spirit In The Sky by Doctor and the Medics.Strictly Come Dancing continues on Saturday 28th October at 6:50pm on BBC One. Back soon! Strictly Come Dancing continues on Saturday 28th October at 6:50pm on BBC OneBeaming: Danny still had energy in spades as he left the It Takes Two studio following the interviewJovial: Coffee in hand, Stacey Dooley was also seen making her exit from the studio with dance partner Kevin Clifton close behindPals: The broadcaster was seen jumping into a waiting taxi with her performance partner, ahead of their tango this weekend to the Doctor Who theme tunePublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}