{"id": "Tallia Storm flashes her bra in sheer flame emblazoned top", "paragraph": "By\n\nJoanna Crawley For Mailonline\n\nPublished:\n  19:43 EST, 24 October 2018\n\n | \nUpdated:\n  03:00 EST, 25 October 2018\n\n          47View  commentsShe was enjoying the launch of gritty crime drama Sicario 2.And singer Tallia Storm dressed the part in a edgy outfit as she enjoyed the London bash on Wednesday night.Tallia showed off her figure, and her black lace lingerie, in a sheer top emblazoned with bright orange flame detail. Red hot: Tallia Storm dressed the part in a edgy outfit as she enjoyed the blu ray launch of Sicario 2 in London on Wednesday night She paired her striking top with a pair of loose fitting black PVC trousers and heeled ankle boots.Slicked back locks and huge hoop earrings completed her out-there ensemble as she posed for the cameras. Tallia made waves in the reality world when she stormed Celebs Go Dating following the fall-out of her Brooklyn Beckham heartache.Strike a pose: Tallia showed off her figure, and her black lace lingerie, in a sheer top emblazoned with bright orange flame detailAlthough she didn't find love, she found her feet on the showbiz ladder as she forged friendships with TOWIE's Gemma Collins and Love Island's Muggy Mike.The fiery songstress has dusted herself down after her explosive showdown with her ex Brooklyn in recent months.They came to blows once again when the footballer's son denied they had previously dated on Instagram Live.Edgy: She paired her striking top with a pair of loose fitting black PVC trousers and heeled ankle bootsFuming, Tallia launched a seething attack on the aspiring photographer in an exclusive chat with MailOnline.'We dislike each other,' she told us. 'I couldn't be more angry. It's like he's dumped me again! You dump me once, three years ago, and now you dump me agin!'Why does he feel the need to do it again three years later? Why is he bringing it back up again. It's exhausting!'Party time: The singer and regular party hopper hit the celeb bash with her stylist pal Troy JubuCeleb bash: Love Island's Laura Crane showed off her abs in a black crop top  Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}