{"id": "MATCH OF THEIR DAY: Frank Clark on European glory in his final game", "paragraph": "By\n\nMichael Walker For The Daily Mail\n\nPublished:\n  18:39 EST, 4 November 2018\n\n | \nUpdated:\n  18:54 EST, 4 November 2018\n\n          27View  commentsFrank Clark's last game of football was a European Cup final. It's not a bad way to bow out.It was May 1979 and Nottingham Forest were beating Malmo 1-0 in Munich to complete the fastest of fairy tales.In May 1977 Forest finished third in the old Second Division to scrape promotion. Twelve months later Forest were champions of England. Twelve more and they were champions of Europe.Frank Clark (L) and Larry Lloyd celebrate Nottingham Forest's victory in the European Cup finalNottingham Forest: Shilton; Anderson, Lloyd, Burns, Clark; Francis, McGovern, Bowyer, Robertson; Birtles, WoodcockGoal: Francis 45Manager: Brian CloughMalmo: Moller; Andersson, Erlandsson, Jonsson, Andersson; Tapper, Ljungberg, Prytz, Kinnvall; Hansson, CervinManager: Bob HoughtonReferee: E Linemayr (Austria)Clark's next birthday after Munich was his 36th. Not that he was planning on celebrating it anywhere other than the City Ground.'I didn't think it was my last game,' he says of the Malmo match. 'I'd a year left on my contract. In fact, Brian had offered me another year, to help develop the kids.'Brian was Brian Clough, the legend, manager of Forest.'But then out of the blue Ken Knighton called. I didn't really know him. But he offered me the job of assistant manager at Sunderland.'Clark left for Wearside, ending an incredible four years in Nottingham. They had been as unexpected as the request from Knighton and began, too, with a surprise phone call.Born in County Durham, Clark had been a Newcastle United player since 1962 and won the Fairs Cup (forerunner of the Europa League) in 1969. Then, after 484 Newcastle appearances, in 1975 he was abruptly released.Clark dribbles with the ball during the final at the Olympiastadion in Munich against Malmo'I'd been there 13 years,' he says. 'I was told after the last game of the season, sitting in the dressing room with Keith Burkinshaw, the first team coach. Then (manager) Joe Harvey came in and said: \"Sorry to tell you fellas, we've all been sacked.\" Just like that. No warning.'I was 31, I felt I'd a few years left. But I didn't get many offers: Hartlepool, Doncaster Rovers. Then Brian came on the phone. Dougie Wetherall, who worked for the Daily Mail, he'd told Brian I was available.'Clough and Clark arranged to meet at Scotch Corner. Clark's car broke down in the Tyne Tunnel.'Brian did actually wait,' Clark recalls. 'The first thing he said was: \"What really attracts me to you is you're cheap.\" That gave me a lift! But the contract was sorted, and I never missed a game for two years.'The club that Clark was joining looked nothing like European champions. He made his Forest debut in August 1975 against Plymouth in front of 13,000.Eight months later, seven of the Forest players who would be in the European Cup squad against Malmo lost 3-2 at York City in front of 5,000. Forest came eighth in 1975-76.The defender played the full 90 minutes in what would be his last ever competitive game'I remember York,' Clark says. 'Brian did inherit some good players but, at that time, they didn't look it. Then Peter Taylor came in and that rejuvenated Brian.'Clough and Taylor's magic was such that once promotion had been secured — by a point over Bolton Wanderers — suddenly Forest were winning the First Division rather than losing at York.They bought well — Larry Lloyd, Kenny Burns, Archie Gemmill, Peter Shilton — and Clark says the existing players' confidence leapt.'Brian and Peter showed courage, paying £350,000 for a goalkeeper when no-one else would,' Clark adds of the Shilton purchase.'What they did with Kenny was remarkable. Kenny was a striker with a terrible reputation. The first training session, coach Jimmy Gordon threw him the No 6 shirt, there'd been no explanation he was going to play centre half. \"Oh?\" said Kenny. \"OK.\"'Forest had never won the league and when they were drawn in the European Cup, it was at holders Liverpool.'That was a massive disappointment,' says Clark. 'Not only were they English, they were the best team in Europe arguably.' But Forest progressed. They outplayed the best.Viv Anderson and Clark  parade the trophy after defeating Malmo to complete the fairy tale'Brian was obsessed with playing the ball forward, or moving forward. He'd go berserk with someone who would pass it back when they could move it forward.'Garry Birtles was a difference. They'd sold Peter Withe without a replacement. Amazing really. In desperation they stuck Birtles up front.'It's one of many elements. I think the best managers need a bit of luck. Garry Birtles was Brian and Peter's.'Forest were on their way to Munich and even though they were 2-0 down after 20 minutes at home to Cologne in the semi-final, they still made it. For the final, Trevor Francis was eligible for the first time in Europe. He scored the winner.'We'd gone off the boil a little — I think John Robertson played 70 games that season,' says Clark.'So the performance was a bit of an anti-climax, but Brian said in the dressing room: \"Don't worry, in a few years all people will remember is who got the winners' medals.\"' A 35-year-old free transfer was one of them.Black & White and Red All Over, by Frank Clark. Out now.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}