{"id": "Trump decries violence but calls on media to end...", "paragraph": "By\n\nAssociated Press\n\nPublished:\n  19:53 EST, 24 October 2018\n\n | \nUpdated:\n  22:13 EST, 24 October 2018\n\nMOSINEE, Wis. (AP) - President Donald Trump decried the threat of political violence and called on the media to end its \"hostility\" on Wednesday, hours after authorities intercepted bombs sent to a news network and prominent Democrats who have been the targets of some of his sharpest barbs.Trump's pleas for harmony came as law enforcement officials scrambled to find the perpetrator of the thwarted bomb attacks against former President Barack Obama, Hillary Clinton, CNN and others. The scripted message was a dissonant one for the president, who has repeatedly blasted his political opponents as criminals and argued that they will destroy the country if they win control of Congress in the midterms.\"We want all sides to come together in peace and harmony,\" he said at a campaign rally in Wisconsin. \"Any acts or threats of political violence are an attack on our democracy itself.\"The president noted the unusually subdued tone of his remarks.\"By the way, do you see how nice I'm behaving tonight?\" he said. \"Have you ever seen this?\"Law enforcement authorities have ascribed no motive to the crime. Still, it has prompted immediate debate over whether increasingly personal and hard-edged rhetoric has contributed to a potentially dangerous political climate. Trump critics have blamed him for the tone.President Donald Trump arrives to speak at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)The president did not take any responsibility.Those \"engaged in the political arena\" must \"stop treating political opponents as being morally defective,\" he said. He also referenced high-profile incidents in which conservatives have been accosted in restaurants and public spaces by political critics.He added: \"The media also has a responsibly to set a civil tone and to stop the endless hostility and constant negative and oftentimes false attacks and stories.\"Trump has frequently labeled stories he doesn't like as \"fake news\" and many reporters as \"enemies of the people.\" He has also denounced his political enemies in deeply personal terms and even described those who tried to thwart his second Supreme Court nominee as \"evil.\"Trump spoke to thousands of supporters in a central Wisconsin rally as he looked to boost struggling Republican candidates less than two weeks out from the midterm elections. He visited the tiny city of Mosinee, which has a population of 4,000. He won that part of the state by double digits in 2016.Republicans in the state have been growing increasingly nervous about the prospects of holding onto the governor's office, held by Scott Walker, let alone state Sen. Leah Vukmir's chances of picking up a U.S. Senate seat held by a well-positioned Democratic incumbent.Mindful of the news, Trump refrained from delivering some of the most pointed riffs of his regular routine, including steering clear of two of his favorite targets: Clinton and California Rep. Maxine Waters, whose office appears to have been a target of one of the mail explosives.Trump also skipped his usual litany of insults against his potential 2020 rivals, including former Vice President Joe Biden, whom he often jokes he would be able to easily beat in a fistfight.But he had harsh words for Democratic Sen. Tammy Baldwin, branding her Vukmir's \"radical far-left opponent\" who \"wants a socialist takeover of health care.\"\"You know I'm trying to say that very nicely,\" he told the crowd with a smile. \"Normally I'd scream, 'They want a socialist takeover!'\" he said, mimicking his own bellicose delivery. \"Now I say, 'Wants a socialist takeover,'\" he said, feigning a professorial tone. \"I'm trying to be nice.\"And even though Trump refrained from mentioning Clinton, his crowd couldn't resist. They burst into a \"Lock her up!\" chant during the preshow before he arrived.___Colvin reported from Washington.President Donald Trump speaks at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)President Donald Trump speaks at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)President Donald Trump speaks at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)President Donald Trump and Republican Senate candidate Leah Vukmir gives a thumbs up on stage during a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)President Donald Trump speaks at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)People listen as President Donald Trump speaks at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)President Donald Trump, right, listens as Republican Senate candidate Leah Vukmir, left, speaks during a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)President Donald Trump arrives to speak at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)People watch as President Donald Trump arrives to speak at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)Rep. Sean Duffy, R-Wis., listens as President Donald Trump speaks at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)People listen as President Donald Trump speaks at a rally at Central Wisconsin Airport in Mosinee, Wis., Wednesday, Oct. 24, 2018. (AP Photo/Susan Walsh)As President Donald Trump speak a supporter holds up a sign during a rally Wednesday, Oct. 24, 2018, in Mosinee, Wis. (AP Photo/Mike Roemer)Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}