{"id": "The Bachelor's Nick Cummins is reportedly dating the chicken heiress Lucy Steggles", "paragraph": "By\n\nCaleb Taylor For Daily Mail Australia\n\nPublished:\n  19:40 EST, 20 October 2018\n\n | \nUpdated:\n  20:07 EST, 20 October 2018\n\n          70View  commentsHe brutally double dumped the last two finalists on The Bachelor, telling them he wasn't ready for a long-term relationship. But Nick 'The Honey Badger' Cummins, 31, may have hit the jackpot and found love all his own after his stint on the series. According to The Sunday Telegraph, the ex-Wallabies star has been enjoying a romance with chicken heiress Lucy Steggles after the pair walked the Kokoda Trail together. Scroll down to video The Honey Badger's in love? The Bachelor's Nick Cummins is reportedly seeing the chicken heiress Lucy Steggles after the pair completed the gruelling Kokoda Trail togetherThe pair have been friends for a number of years but their 'friendship turned romantic,' on the 60-kilometre track in Papua New Guinea, according to the report. The curly-haired reality star is said to have met the blonde beauty through Lucy's sister's boyfriend, who is Nick's trainer. Nick had travelled to Papua New Guinea in order to complete the challenging track prior to The Bachelor finale airing in Australia.  Private: Lucy Steggles (pictured) largely stays out of the public eye, but is often frequented at hot spots around Manly. The pair reportedly met through her sister's boyfriend, who is Nick's trainerDaily Mail Australia has reached out for comment.  The report comes after a big month for Nick, who has been fronting Australian media after the controversial airing of the The Bachelor. Appearing on The Sunday Project two weeks ago, Nick was grilled by journalist Lisa Wilkinson who questioned him on his decision to walk from the show single.Nick first admitted that he entered the competition as a 'boy,' and not a man, before Lisa remarked; 'You're meant to be at a place where you're ready for a relationship.'Love is in the air? Nick and Lucy's friendship reportedly 'turned romantic,' while completing the gruelling 60-kilometre track in Papua New Guinea. Pictured here with palsPrior to appearing on the show, Nick was in a five-year relationship with Norwegian artist Martine Thomassen.  Appearing in a follow-up interview on The Sunday Project last week, Nick said the backlash from the double dumping had been intense. 'I consider myself a pretty upbeat energetic dude and then all of a sudden you just get the wind cut out of your sails,' he said. Romantic: Lucy (pictured ) and the ex-Wallabies star are known to be friends and both share an interest in fitness He continued: 'I've never been in a mental space as low as I have been on that show.'During the interview, Nick said he didn't want to lie to the finalists Brittany Hockley, 30, and Sophie Tieman, 25. Nick said: 'I thought, 'I can avoid a whole lot of drama, for me for the girls, and just pick someone'. Or I could just be honest.'He finished: 'She'd be sitting here now. People would be asking if you're in love. And it's like, I didn't want to lie,' he said. 'She'd be sitting here now. People would be asking if you're in love. And it's like, I didn't want to lie': Nick said on The Sunday Project he struggled with backlash on the show. Pictured Brittany Hockley, Nick CumminsPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}