{"id": "Snake bite victim shows how to pan-fry a diamondback rattlesnake after he spent three days in ICU", "paragraph": "By\n\nLeah Simpson For Dailymail.com\n\nPublished:\n  18:58 EST, 12 November 2018\n\n | \nUpdated:\n  03:31 EST, 13 November 2018\n\n         124View  commentsA Texas man who was sent to intensive care after being bitten by a rattlesnake in September got sweet revenge by cooking another one he encountered.Bob Hansler uploaded a video to his YouTube channel in October, showing his approximately 178,000 subscribers how to enjoy the 3ft creature as a delectable meal.The post from two week ago has had more than half a million views and shows the survivalist skinning, bread crumbing and then frying the meat in a Dutch oven with legs on an open fire in the desert.Bob Hansler was bitten by a Diamondback Rattlesnake in SeptemberHe uploaded the rattlesnake cooking video in October to YouTubeRattlesnake venom 'becomes completely inert during the cooking process''We're going to show you how we do it down South,' he says in the clip before using a mixture of milk and eggs for the snake to soak in.The Runge, Texas man sets up his station with hot coals and tips plenty of oil in a separate pan.'This is a western diamondback rattlesnake (that) one of the neighbors dropped off here last night,' he adds. 'They ran this over and brought it to me, so fresh snake.'Hansler makes sure every part of the snake is used by rolling the skin to prepare it for freezing and using later on. Hansler skins the 3ft creature and places the entire thing in a panAfter creating a mixture of eggs and milk he soaks the snake in the liquid for easy bindingHansler then coats it in corn meal by shaking in a Ziploc bagHis YouTube channel shows him chowing down on unconventional meals in various primitive cooking clips so he was treated to the catch by someone who knew of his love for eccentric food.'Waste not, want not,' he says about his intention to tan the skin and cure it later on.To help bind the Quaker yellow corn meal to the snake's surface he drops it in a Ziploc bag to make sure it's well covered then proceeds to cook the animal on both sides in the cast iron spider skillet over the fire.Referring to his preparation as 'catfish style' he adds that it's about achieving a 'golden brown' color rather than keeping it on the heat for a certain period of time.  Hansler reveals he received the snake as a gift from a neighbor Hansler explains how its about browning the snake rather than cooking for a certain timeBut even when the snake is done Hansler's pet dog Huckleberry is unsure of trying the meal that consists of a lot of vertebrae.After peeling the 'back strap' off for the bulk of the meat and then biting between the ribs to show viewers how to tackle eating rattlesnake, his pooch – who Hansler says had tried snake before and is not a picky eater – sniffs it but turns down the offer of tasting.'Reptile itself is a very oily meat,' Hansler says, adding that it tastes similar to alligator.Hansler says the creature also makes a good soup and he would know, his YouTube page also boasts other quirky cuisine videos. In one of them posted four weeks ago, he cooks a rattlesnake inside a cactus.He then eats it with his hands, first peeling the meaty back strap offHe explains the eater should bit between the vertebrae to enjoy the mealBut even Hansler's dog isn't keen to try the mealAfter the demonstration he shows viewers the 17 buttons on the snakes rattle. Every time a snake sheds – which can happen multiple times a year - it adds another button. Hansler expresses how 'remarkable' 17 is considering the snake was fairly mediocre in size.'I wouldn't expect to see a rattle this large for anything under 6-and-a-half/7ft,' he says.Luckily rattlesnake venom 'becomes completely inert during the cooking process' but Hansler wasn't so fortunate a couple of months ago when he was bitten by a diamondback rattlesnake while on a nature walk.    Hansler explains how the snake had 17 rattles which is many for a small snakeHansler (seen with a giant spider on his face) is known for his outdoor adventures'The rattlesnake did not coil in defense or attempt to flee, but instead charged and struck repeatedly,' a GoFundMe page that raised $4,334 for his medical costs states. 'This rattlesnake managed to strike Bob a glancing blow in his left arm before being subdued. The arm began to swell almost immediately and Bob was rushed to the local hospital and shortly thereafter transferred to San Antonio.'Hansler had to endure 'three rough days in ICU and six doses of anti-venom' to recover from the painful bite.While their bites are usually not deadly, they can cause an internal hemorrhage, plus destroy skin tissues and blood cells.The irony of consuming the dead snake was not lost on his fans. 'I'm surprised you didn't throw it on ice after cooking it,' viewer Jon M commented on the video. 'After all, revenge is a dish best served cold.'Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}