{"id": "Reese Witherspoon dons lovely thigh-length navy blue floral frock for weekend jaunt in Santa Monica", "paragraph": "By\n\nDailymail.com Reporter\n\nPublished:\n  19:38 EST, 20 October 2018\n\n | \nUpdated:\n  21:37 EST, 20 October 2018\n\n          17View  commentsShe's one of Hollywood's best-dressed stars.And on Saturday Reese Witherspoon proved that sentiment again when she stepped out in tony Santa Monica.The 42-year-old Walk the Line actress looked quite chic yet relaxed in an airy navy blue number.Pretty! On Saturday Reese Witherspoon proved she is still one of Hollywood's best dressed when she stepped out in tony Santa MonicaThe frock fell to her mid-thigh, which meant her toned legs were on full display. It also featured a white and green floral pattern as well as an incorporated drawstring belt.White low-top sneakers with gold stripes completed her California-friendly look.Accessories included a tan purse slung over her left arm, a straw sun hat, some thick gold hoop earrings and a pair of oversize sunglasses.Cool casual: The 42-year-old Walk the Line actress looked quite chic yet relaxed in an airy navy blue numberBusy day? She also appeared to be listening intently to her phone for some of her outingShe also appeared to be listening intently to her phone for some of her outing.It seems the mother-of-three was quite busy on Saturday, as she also shared a recipe notification to social media.In the post the Louisiana native looks to be rolling out a baked good in a designer kitchen.Enviable gams! The frock fell to her mid-thigh, which meant her toned legs were on full displayWhile she appears to wear a black top, she protects the rest of her outfit with a blue and white floral apron.'Saturdays are for baking biscuits,' wrote the Oscar winner, before adding the plug '(recipe in #WhiskeyInATeacup!)'Of course Whiskey In A Teacup is Reese's new lifestyle book that was released back in September.Multi-talented! It seems the mother-of-three was quite busy on Saturday, as she also shared a recipe notification to social media\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    We are no longer accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}