{"id": "Mariah Carey shares sweet video of her twins singing her latest single ahead of Macau concert", "paragraph": "By\n\nAnnita Katee For Dailymail.com\n\nPublished:\n  19:48 EST, 20 October 2018\n\n | \nUpdated:\n  21:01 EST, 20 October 2018\n\n          49View  commentsShe's currently on the Asia leg of her world tour with her seven-year-old twins Moroccan and Monroe. And ahead of her Saturday night concert in Macau, Mariah Carey shared a sweet video of her kids singing her latest single The Distance. Whilst daughter Monroe took the lead, the 48-year-old diva could be seen in the window singing and dancing along. Scroll down for videos  Stars in the making! Mariah Carey shaded a sweet video of her twins Moroccan and Monroe, seven, singing her latest single ahead of Macau concert on Saturday'S-P-I-R-I-T, it's great to see, we got it, the spirit, hey, hey, let's hear it,' she chanted. And although bringing full energy and proving she had her mother's performing genes, Monroe was heard letting out a big sigh ahead of her solo as if she was over performing the chant.  While the daughter of Nick Cannon gave it her all, her brother Moroccan gave a surprise entrance at the end when he popped out of the curtains.Not her first time: And although bringing full energy and proving she had her mother's performing genes, Monroe was heard letting out a big sigh ahead of her solo as if she was over performing the chantFamily trip: She's currently on the Asia leg of her world tour with her seven-year-old twins Moroccan and Monroe'The S-P-I-R-I-T chant from #TheDistance in beautiful Macao! See you at the show tonight!! #MCLiveInAsia,' Mariah captioned the video.And although spending most of her nights performing, it appears as though it's been a trip for the books. Taking to social media earlier in the week, the We Belong Together singer shared another adorable video with her 7.3 million followers of herself making dumplings with the kids. Bonding: Taking to social media earlier in the week, the We Belong Together singer shared another adorable video with her 7.3 million followers of herself making dumplings with the kidsAdorable: Her seven-year-olds couldn't have looked any cuter, decked out in matching yellow aprons and chefs hats'Making dumplings in Taipei! See you at the show tomorrow! #MCLiveInAsia,' the diva wrote. The 49-year-old stunner looked her usual flawless self, wearing a plunging tight black top and her hair pulled back in a pony.Her seven-year-olds couldn't have looked any cuter, decked out in matching yellow aprons and chefs hats.In the video however, Mariah still seemed a bit confused at to what she was creating.'We are making.... I believe they're dumplings, what are they? Cabbage desserts. It's very intricate work here,' she puzzled, as the kids engaged in some playful bickering. Despite her confusion, the the results were pretty impressive, as she unveiled the cooked results in a follow up clip. Confused: 'We are making.... I believe they're dumplings, what are they? Cabbage desserts. It's very intricate work here,' she puzzled, as the kids engaged in some playful bickeringPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}