{"id": "Ice hockey-NHL's first black player O'Ree still...", "paragraph": "By\n\nReuters\n\nPublished:\n  18:58 EST, 12 November 2018\n\n | \nUpdated:\n  18:58 EST, 12 November 2018\n\nBy Steve KeatingTORONTO, Nov 12 (Reuters) - As the first black player in the NHL, Willie O'Ree's impact on the sport cannot be measured in goals and assists, his contributions by many yardsticks eclipsing those of the hockey legends he will join in the shrine on Monday.Wayne Gretzky, the NHL's record scorer, and Bobby Orr, who twice led the league in scoring as he revolutionized the role of the defenseman, may have changed the way the game was played, but on Jan. 18, 1958 O'Ree changed the face of hockey when he suited up for the Boston Bruins to face the Montreal Canadiens.O'Ree's moment came 11 years after Jackie Robinson broke baseball's color barrier and it would take another 16 years after he stepped onto the ice at the Montreal Forum before another black player followed his path.While his first game has become a cultural cornerstone for the NHL, O'Ree swears he was blind to the significance until he read about it in the newspaper the following day.As an athlete O'Ree's focus was on performance not politics, wins on the ice mattered more than victories away from the rink.His four goals and 10 assists in 45 games over two seasons are not the numbers that gain a player entry into the Hockey Hall of Fame however. By contrast, Gretzky potted five goals in a single game four times.But 60 year's later O'Ree has a deep unvarnished understanding of his moment in history, embracing it and turning it into a life-long calling.BREAKING BARRIERSAs the NHL's Diversity Ambassador for the \"Hockey is for Everyone' initiative, the 83-year-old still criss-crosses North America knocking down barriers and opening doors.At a time when racial tension in the United States is on the rise, O'Ree said the need for tolerance has never been greater.\"I think it is more important now than it ever was,\" he said after receiving his Hall of Fame ring. \"I think a lot of kids are realising now that boys and girls can make a difference. It is entirely up to them.\"I stress on them to stay in school, get an education and believe in yourself.\"There is no substitute for hard work, you only get out of it what you put into it.\"O'Ree lived what he preached.His journey to the NHL was all the more remarkable considering that after being struck in the face by a puck he was left blind in one eye, an impairment that alone should have disqualified him from a professional hockey career.While he could not see out of his right eye, he could hear everything, the racial taunts and slurs spewed at him from the stands and by other players.\"I said: 'Willie, forget about what you can't see and focus on what you can see',\" said O'Ree. \"You can do anything you set your mind to do if you feel strongly about it within your heart.\"MINOR LEAGUESWhile dedication and a single-minded determination carried O'Ree to the NHL, they were not enough to keep in the six-team league.After playing 43 games with the Bruins during the 1960-61 season there would be no more call-ups.Instead O'Ree would spend nearly two decades scratching out a career in the rough and tumble minor leagues before retiring in 1979 at the age of 43.\"When I was 14 I made two goals for myself - play professional hockey and hopefully one day play in the NHL,\" recalled O'Ree, who enters the Hall in the Builders category.\"When I accomplished those two it was kind of the end. I had no idea that there would be the possibility of getting into the Hall of Fame.\"I think we are three individuals within ourselves. I think we are the person we think we are, the person other people think we are and the person who we really are.\"And to find the real person within yourself that's the goal, working towards what you believe in and making things happen.\" (Editing by Ken Ferris)Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}