{"id": "What's her secret? Supermodel Elle Macpherson, 54, looks fresh faced while going makeup free", "paragraph": "By\n\nNick Hadley\n\n\nand \nChloe-lee Longhetti For Daily Mail Australia\n\nPublished:\n  18:47 EST, 4 November 2018\n\n | \nUpdated:\n  19:48 EST, 4 November 2018\n\n         144View  commentsAs one of the world's most famous supermodels she's spent decades strutting the world's biggest catwalks. And it is clear the years have been very kind to Elle Macpherson.The 54-year-old looked remarkably fresh faced when she was spotted makeup free at Melbourne airport on Sunday. Scroll down for video What's her secret? Veteran supermodel Elle Macpherson, 54, looked fresh-faced as she jetted out of Melbourne completely makeup free on Sunday Legs eleven! Clad in a black turtleneck jumper and chic black flared leather trousers, the mother-of-two also showed off her super slender figure Clad in a black turtleneck jumper and chic black flared leather trousers, the mother-of-two also showed off her super slender figure.Elle put her best foot forward in a pair of grey leather Isabel Marant boots and wheeled her own designer suitcase through the terminal.The statuesque stunner had her long blonde locks in loose waves around her shoulders and opted to take off her makeup for her long haul flight home. Elle who is mum to Flynn, 20, and Aurelius, 15, was heading home after attending Derby Day at Melbourne's Flemington Racecourse on Saturday.At the event she put her incredible figure on display in a quirky white Toni Maticevski jumpsuit accessorised with a mermaid train.On the day Elle, who is dating controversial former British doctor Andrew Wakefield, 61, wore natural-looking makeup, including dewy foundation and a glossy lip. Star appeal: Elle who is mum to Flynn, 20, and Aurelius, 15, was heading home after attending Derby Day at Melbourne's Flemington Racecourse on SaturdayElle, who is nicknamed The Body, finessed her look with a white hat and gold framed sunglasses.She added height to her frame wearing towering white embellished heels. The Aussie icon posed at the Lexus Marquee in The Birdcage, appearing in high spirits after flying into Melbourne on Friday.White hot! At the event she put her incredible figure on display in a quirky white Toni Maticevski jumpsuit accessorised with a mermaid trainPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}