{"id": "The side of pregnancy that surprised journalist Natalia Cooper the most", "paragraph": "By\n\nHolly Hales For Daily Mail Australia\n\n\nPublished:\n  19:47 EST, 30 October 2018\n\n | \nUpdated:\n  20:22 EST, 30 October 2018\n\n           4View  commentsShe's the Today show weather presenter who has gained legions of fans thanks to her on-screen spunk and bubbly personality.And now Natalia Cooper has revealed the most surprising part of pregnancy, as she enters her third trimester.   'I can really feel the movements and I can see my belly moving – which is weird and wonderful!' The mother-to-be told Deborah Knight in the latest episode of Nine Honey Mums podcast.Natalia Cooper has revealed the most suprising part of pregnancy to Nine Honey, as she enters her third trimester'My husband's able to touch my tummy and feel the movements as well, which is so nice. It brings your partner into it as well.'Aside from movement, Natalia  admitted the fatigue associated with early pregnancy has forced her to reevaluate her priorities.'You just realise you're not the same as you were before and you have to take your foot off the pedal a bit,' she said. Earlier this month, Natalia revealed to the website how she and now-husband Carl Fox first met at a Perth pub nine years ago.   However, it's not all been smooth sailing for the Perth-native, who admitted the fatigue associated with early pregnancy has forced her to reevaluate her priorities Earlier this month, Natalia revealed to the website how she and now-husband Carl Fox (pictured) first met at a Perth pub nine years agoAlthough the couple have already chosen names their baby, Natalia shared they're planning on keeping the gender of their bundle of joy a secret'Our eyes met across the room – I saw him walk in and was like, straight away, 'I want to talk to that guy, who's that guy?' she said. She said she was 'instantly smitten'. After a seven-year courtship, the couple wed at Merribee House on New South Wales' South Coast in March 2016. Although they've already chosen names the baby, Natalia has said she and her husband are planning on keeping the gender of their bundle of joy a secret.   Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}