{"id": "Poetry, picnics and meditation as London’s bridges are blocked by middle-class army of eco-warriors", "paragraph": "By\n\nBen Fishwick For The Mail On Sunday\n\nPublished:\n  18:42 EST, 17 November 2018\n\n | \nUpdated:\n  18:42 EST, 17 November 2018\n\nView  commentsThousands of middle-class eco-protesters caused chaos in Central London yesterday by staging mass sit-ins across five of the capital’s busiest bridges.Police arrested 85 of the activists, who included students, university lecturers, teachers and civil servants.Their blockade stopped traffic and hindered emergency service vehicles on Southwark, Blackfriars, Waterloo, Westminster and Lambeth bridges.Music teachers, civil servants and retired psychologists are among the protesters that have been trained by the direct action group to get themselves arrestedIt was organised by a new protest group called Extinction Rebellion, which hopes to raise awareness of climate change.Protesters included organic farmer Roger Hallam, a PhD researcher at King’s College London, George Monbiot, a columnist with The Guardian newspaper, and Green Party politician Baroness Jones.Activists caused five bridges across the River Thames to be blocked off during the day of havoc, meant to pressure the government to tackle climate changeThe activists danced, read poetry, had picnics and meditated. Some later moved to Parliament Square where they planted trees.Hundreds of police officers eventually cleared the bridges, but activists last night warned of further blockades. Bristol student Robin Boardman-Pattison, 21, said: ‘We’re not going to stop. We are going to be swarming London with roadblocks.’\n\t    Share what you think\n          No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards.\n      \nBy posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}