{"id": "One Direction's Liam Payne and Louis Tomlinson will come together for Gogglebox special", "paragraph": "By\n\nJabeen Waheed For Mailonline\n\nPublished:\n  19:40 EST, 24 October 2018\n\n | \nUpdated:\n  07:20 EST, 25 October 2018\n\n          63View  commentsFormer One Direction bandmates Liam Payne and Louis Tomlinson are joining forces for a Gogglebox special which will air during Stand Up To Cancer on Friday.And the boys are rather taken with something a little cheeky in a teaser clip for the upcoming show, which was released on Thursday.Louis, 26, can be seen jumping up as he believes he has seen a woman with 'four nipples' on a television show and can't quite believe it.  Reunion: Former 1D stars Liam Payne and Louis Tomlinson discussed a woman with 'four nipples' during their Gogglebox special which will air during Stand Up To Cancer on FridayCaught his attention: Louis, 26, can be seen jumping up as he believes he has seen a woman with 'four nipples' on a television show and can't quite believe itLiam, 25, grabs the remote control and says: 'Hang on, hang on. Tell me when to stop. Let's have a look. This is the only show we have paused so far. This is so funny.'Taking to his Twitter on Wednesday, Liam revealed: 'Tune into @Channel4 on Friday night from 7pm to watch me and @Louis_Tomlinson on #gogglebox for #StandUpToCancer. It’s for a cause that’s close to our hearts, so please give it a watch and donate.'The cause is especially close to Louis who tragically lost his mother Johannah Deakin to leukaemia in December 2016 at the age of 43. Liam, 25, grabs the remote control and says: 'Hang on, hang on. Tell me when to stop. Let's have a look. This is the only show we have paused so far. This is so funny'Back together: The boys have reunited for the charity special of the much-loved programme  Midwife Johannah, who described herself as 'Mummy to 7 stars & 1 little grand star', in her Instagram bio, was devoted to Louis and her grandson Freddie, who was born in January last year.She left behind six other children, Lottie, 18, Felicite, 16, twins Daisy and Phoebe, both 13, and twins Ernest and Doris, both aged three, who she gave birth to prematurely in 2014.   Meanwhile Dani Dyer, 22, as well as her father ‘hardman’ Danny, 41, have also lent a hand to Channel 4's fundraising campaign by appearing in a Gogglebox special.The segment, which will air in full on Friday night, also sees Abbey Clancy, 32, watch the nation's favourite TV programmes, alongside her football husband Peter Crouch, 37, and her dad.Taking to his Twitter on Wednesday, Liam revealed: 'It’s for a cause that’s close to our hearts, so please give it a watch and donate'Tragic: The cause is especially close to Louis who tragically lost his mother Johannah Deakin to leukaemia in December 2016 at the age of 43Special episode: Dani Dyer, 22, as well as her father ‘hardman’ Danny, 41, have also lent a hand to Channel 4's fundraising campaign by appearing in a Gogglebox specialSharing a sneak peak of the show with her 3.3million Instagram followers, Love Island winner Dani posted a snap of her and her dad as they lounged around on a luxury sofa.She captioned the image: 'I absolutely love Gogglebox and couldn’t be more excited to be on it with my dad. 'What an experience it was! Stand Up To Cancer is such an amazing cause and I’m proud to have been asked to be a part of it ♥️.'Famous faces: Abbey Clancy, alongside her football husband Peter Crouch, 37, and her dad, also took part in the showPosting the same cute shot, EastEnders star Danny Dyer wrote: 'Me and my beautiful little soul mate @danidyerxx will be on Gogglebox this Friday night talking a bit of boll**kyness in aid of stand up to cancer. 'We all need to come together and raise some serious readies to try and combat this nasty evil thing that takes far [to] many lives.'Also promoting the upcoming charity programme, Abbey Clancy posted a snap shot of herself with her husband and her dad as they larked around on the show.The mother-of-three wrote: 'Had the best time featuring on my favourite TV show @c4gogglebox with my hubby and my dad! First look: Sharing a sneak peak of the show with her 425,000 Instagram followers, the Britain's Next Top Model star posted a snap of the group as they lounged around on a sofa'Such an amazing cause @standup2canceruk please watch Friday @channel4 and let’s raise some money!'Meanwhile, singer Michael Bublé sang his heart out alongside the Late Late Show host James Corden when taking part in a Carpool Karaoke special for the charity.  Channel 4 released a first look at the fun, musical segment which sees the Haven't Met You Yet hitmaker, 43, joining James Corden, 40, for a singalong.In the preview, the pair gave passionate renditions of Haven't Met You Yet as well as It's A Beautiful Day, even going so far as to sing along with the trumpet solos. Giving it his all: Michael Buble sings passionately with James Corden on a preview of a Carpool Karaoke special for Stand Up To Cancer UKInto it: In the preview, the pair gave passionate renditions of Haven't Met You Yet as well as It's A Beautiful Day, even going so far as to sing along with the trumpet solosEarlier this month Michael explained that the heartache he endured following his son's cancer diagnosis at just three years old changed his 'perception of life', as he admitted that he is now done with fame. Noah, now five, is currently in remission following his battle with liver cancer, but the ordeal has been life-changing for Bublé, who has since questioned his career in showbusiness. Speaking in what he claimed to be his 'last interview' with Daily Mail's Weekend magazine earlier this month, he admitted: ‘It’s been such a difficult exercise. I actually thought I’d never come back to the music business. I never fell out of love with music, I just needed to put it aside.' Watch the full Gogglebox special for Stand Up To Cancer UK, this Friday from 7pm on Channel 4.Emotional: Earlier this month Michael explained that the heartache he endured following son Noah's cancer diagnosis at just three years old changed his 'perception of life'Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}