{"id": "SECRETS OF AN A-LIST BODY: This week: How to get Rachel McAdams’s enviable waist", "paragraph": "By\n\nJames Draper For Mailonline\n\nPublished:\n  18:47 EST, 12 November 2018\n\n | \nUpdated:\n  19:01 EST, 12 November 2018\n\n          11View  commentsShe is one of Hollywood's most attractive women. So it's perhaps not surprising that Rachel McAdams wowed fans when she stepped-out at a red carpet event in LA, recently. There, she commanded attention in a cut-out bodice which provided  the perfect opportunity to show off her waist. Wow-factor: Rachel McAdams wowed fans when she stepped-out at the Breakthrough Prize awards ceremony at NASA Ames Research Center in Mountain View, California, last weekAt 39, the star of the films Mean Girls and The Notebook, makes exercise a big part of her daily life and does yoga, hiking and cycling as often as she can.The Canadian actress is also a regular at Training Mate classes, a gruelling interval circuit run by Luke Milton, a retired Australian rugby star.But how can you replicate her enviable look? Here, we reveal the best approach... WHAT TO TRY- ‘Trunk turns’ target the sides of your waist. Start in a plank position, with your body supported on your hands and the balls of your feet. - Keep your buttocks squeezed tight.- Slowly bring up your left knee towards your right elbow, twisting your torso. - Return to the start and repeat on alternating sides for 60 seconds. - Rest for 30 seconds, then repeat two or three times.Looking good: At 39, the star of the films Mean Girls and The Notebook, makes exercise a big part of her daily life and does yoga, hiking and cycling as often as she can \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    We are no longer accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}