{"id": "Elsa Pataky says society has be 'careful' about the #MeToo movement", "paragraph": "By\n\nAndrew Court For Daily Mail Australia\n\nPublished:\n  18:20 EST, 17 November 2018\n\n | \nUpdated:\n  20:21 EST, 17 November 2018\n\n          47View  commentsThe women of Hollywood have been leading the way with the #MeToo movement. And while Elsa Pataky is supportive of the fight against sexual harassment and assault, the actress also worries that things could go too far.Speaking with Stellar on Sunday, the 42-year-old wife of Chris Hemsworth stated: 'To have change, you must always go to the other extreme, just for people to see it and have a voice. But we have to be careful. ''I feel like men are scared to speak': Chris Hemsworth's wife Elsa Pataky told Stellar magazine on Sunday that  society has be 'careful' about the #MeToo movement Elsa added: 'I feel like men are scared to speak (now) because they don't know what to say, because they feel like we are going to jump on them if they say the wrong thing, the wrong word - even to just talk about the subject.' The blonde beauty is the mother of two twin boys, four-year-olds Tristan and Sasha, and she told the magazine that she doesn't want her them to grow up in fear. 'I have two sons and I don't want my sons to be scared, either.'Hollywood heavyweights: A-lister Elsa is married has been married to Chris Hemsworth since 2010Mum-of-three: Elsa has two sons, Tristan and Sasha, and says she doesn't want them to be 'scared' while growing up. She is pictured with the boys and her daughter, India RoseElsa said that men and women 'need to be on the same page' when it comes to the #MeToo movement and the work that needs to be done against widespread sexual harassment.  The actress's philosophy may be formed by the fact that she is also a mother to a young girl. In addition to Tristan and Sasha, Elsa and Chris are also parents to six-year-old daughter, India Rose.  Expanding their brood? According to a recent report in OK! Australia the Hollywood couple may be considering having a fourth childAnd according to a recent report in OK! Australia the Hollywood couple may be considering expanding their brood. 'Elsa and Chris have spoken about having a fourth child,' a supposed insider told the magazine.(But) they put it on the backburner and agreed that if it happened, it happened, but they wouldn't be actively trying.'  Happy together: Chris and Elsa live with their three children in the Australian coastal town of Byron Bay \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}