{"id": "'Fake heiress' Anna Sorokin appears in court looking dramatically different from her socialite days", "paragraph": "By\n\nMegan Sheets For Dailymail.com\n\n\nPublished:\n  19:55 EST, 30 October 2018\n\n | \nUpdated:\n  23:07 EST, 30 October 2018\n\n           2View  commentsA faux German billionaire heiress charged with defrauding hotels, banks and friends out of hundreds of thousands of dollars was almost unrecognizable from her days on the New York social scene when she appeared in court on Tuesday.  Anna Sorokin, 27, donned an all-beige ensemble courtesy of Rikers Island and wore her hair in a messy bun as she faced the New York State Supreme Court in shackles for the prescheduled hearing.The former fashion magazine intern who pleaded not guilty to grand larceny charges in August, looked furious during the appearance, glaring across the courtroom as she peered over her thick-framed glasses.Anna Sorokin, 27, an alleged grifter charged with defrauding hotels, banks and friends out of hundreds of thousands of dollars, looked dramatically different than she had while playing the part of Manhattan socialite when she appeared in New York State Supreme Court on TuesdaySorokin posed as the daughter of a German billionaire under the name Anna Delvey, using the persona to dupe elite circles in New York's high society from 2013 until January 2017During Sorokin's last court appearance on August 21, Manhattan Assistant District Attorney Catherine McCaw asked a judge for a protective order preventing the defendant from having physical custody of witness emails and documents.'One of the witnesses was concerned that the records might be leaked to the media,' McCaw said. Sorokin's lawyer Todd Spodek responded by requesting that the defense team at least be able to see those documents so it will be able to adequately build her case.  The attorneys came to an agreement wherein Spodek would be able to discuss the documents with his client, but identifying information for the witnesses would be redacted. The defense attempted to make a deal for Sorokin to be sentenced to up to three years in prison back in June, but that proposal was rejected by Judge Diane Kiesel, who said of the defendant: 'I see no remorse.''She seems more concerned about who is going to play her in the movie than what she's done to the people she allegedly took advantage of.' Kiesel added that a sentence of just three years behind bars would serve as a 'mere a slap on the wrist for a crime this serious.'A counter-offer of three to nine years in prison was itself turned down by her defense team, and she now faces 15 years in prison if convicted on all counts.    Sorokin pleaded not guilty to grand larceny in August. The 27-year-old, pictured in court Tuesday with attorney Todd Spodek, could face 15 years in prison if convicted on all chargesNetflix signed a deal to acquire the rights to Sorokin's story in June, and Scandal producer Shonda Rhimes has been tapped to write it.Sorokin posed as Anna Delvey, the heiress daughter of a fictitious billionaire Russian magnate and used the persona to dupe elite circles in Manhattan from 2013 until January 2017.She talked banks into lending her money to start the 'Anna Delvey Foundation' and skipped out on bills at the end of a weeks-long stays in some of New York's finest hotels. She also targeted individuals who she believed would serve her well and got them to pay for things with the promise that she would eventually give them the money back.  Among them was a Vanity Fair picture researcher whom she convinced to pay $62,000 for a trip to Morocco after her own card was rejected.Sorokin denies the charges and insists she was always trying to be seen as a businesswoman.Sorokin is pictured with Giudo Cacciatori, Gro Curtis and Giorgia Tordini at the 2014 Tumblr Fashion Honor. At the time she was going by the name Anna Delvey and posing as an heiressShe claims the dinners, at extravagant restaurants like Le Coucou were business meetings and that it was all going towards the Anna Delvey Foundation, an arts-focused members club she planned to open and still speaks about. In an interview with New York Magazine earlier this year, she said: 'I had what I thought was a great team around me, and I was having fun.' She said that while she had done some things wrong, it 'doesn’t diminish the hundred things I did right'. Prosecutors say Sorokin (pictured in an Instagram post) facilitated her lavish lifestyle by check-kiting - a practice whereby a person deposits bad checks into a bank account then withdraws a cash amount before they bounceProsecutors say she facilitated her lifestyle by check-kiting - a practice whereby a person deposits bad checks into a bank account then withdraws a cash amount before they bounce. In May, Sorokin spoke from Rikers' Island to say it was 'not that bad'. She said she had learned not how 'easy' it was to steal other people's identities by watching financial criminals behind bars.'This place is not that bad at all actually. People seem to think it’s horrible, but I see it as like, this sociological experiment.'There are couple of girls who are here for financial crimes as well. 'This one girl, she’s been stealing other people’s identities. I didn’t realize it was so easy,' she told New York Magazine. Sorokin's case received notoriety from two lengthy articles in Vanity Fair and New York Magazine.Among those who have spoken out about it are some of her alleged victims including staff at the hotel where she stayed. They told how she tipped with $100 bills and gave off an air of extreme wealth. One, who was the receptionist at 11 Howard where Sorokin stayed for a month, told how she once attended a dinner she organized for a large group at Le Coucou which included MaCaulay Culkin. Others described how restaurants began calling them after seeing pictures of them with Sorokin on Instagram and asking to be put in touch with her because she had skipped out on her bills. Sorokin marketed herself as a businesswoman and got people in high society to pay for things such as expensive dinners and vacations while promising that she would pay them backThe truth is that she was born in Russia and grew up in Germany as the daughter of a truck driver. She left Germany in 2011 to move to London where she attended Central St Martin's College as a fashion student.Her father told New York Magazine that they had supplemented her rent and schooling at first and that he was stunned by the news she had been arrested. 'We always paid for her accommodations, her rent, and other matters. 'She assured us these costs were the best investment. If ever she needed something more at one point or another, it didn’t matter. 'The future was always bright,' her parents, who did not want to be identified, said in an email.  Sorokin shoots a glaring look across the courtroom during the prescheduled hearing TuesdayPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}