{"id": "Defiant Erin Molan returns as fill-in sports presenter on Today after NRL Footy Show axing", "paragraph": "By\n\nCandice Jackson For Daily Mail Australia\n\nPublished:\n  19:46 EST, 24 October 2018\n\n | \nUpdated:\n  20:42 EST, 24 October 2018\n\n           2View  commentsShe was unfairly blamed for the downfall of The NRL Footy Show after it was axed earlier this month.But despite Channel Nine insiders predicting Erin Molan's career would suffer as a result of the cancellation, the journalist is standing her ground at the network.The 36-year-old, who is rumoured to have just signed a three-year contract with Nine, has been filling in for Today's sports presenter Tim Gilbert this week.Here to stay! Defiant Erin Molan (right) has returned as a fill-in sports presenter on Today after being blamed for the downfall of The NRL Footy Show. Pictured with Today's Deborah KnightErin replaced longtime Footy Show host Paul 'Fatty' Vautin earlier in 2018 as the network launched a rebrand in an attempt to improve ratings.Ultimately the program couldn't be salvaged and the  show was cancelled after 25 years on air.Due to the recent reshuffle, many fans and TV industry experts pointed the finger of blame at Erin.Taking the blame: Erin replaced longtime Footy Show host Paul 'Fatty' Vautin earlier in 2018 as the network launched a rebrand in an attempt to improve ratings. Unfortunately, the program couldn't be salvaged and many fans and TV insiders pointed the finger of blame at ErinA Nine insider said at the time: 'They’ll have to rest her, I think... There's a stink of failure that'll hang around for a while and that needs to settle.'Despite this withering assessment, Erin's career appears to be thriving since The NRL Footy Show was abandoned by the network.As well as filling in as Today's sports presenter, Erin has continued her commitments as a sports anchor on Sydney's Nine News.Meanwhile, she will continue to host The Sunday Footy Show and will also be part of the commentary team for the NRL premiership season. Onwards and upwards! As well as filling in as Today's sports presenter, Erin has continued her commitments as the sports anchor on Sydney's Nine NewsErin is also reportedly being considered for  Nine's tennis coverage, which begins in  January when the network will host the Australian Open.Back when the NRL Footy Show was axed, Nine's Director of Sport Tom Malone said the network was determined to stand by Erin despite the public backlash.'She's a star, she's a great broadcaster and we love her,' he said at the time.It's believed Erin went on to sign a new contract with Channel Nine just days after the Footy Show was cancelled. 'She's a star': Back when the NRL Footy Show was axed, Nine's Director of Sport Tom Malone said the network was determined to stand by Erin despite the public backlash. Pictured with the former NRL Footy Show lineup at the 2016 Logies in MelbournePublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}