{"id": "The real reasons fuel prices have surged - and petrol companies AREN’T to blame for the rip-off", "paragraph": "By\n\nBrooke Rolfe For Daily Mail Australia\n\nPublished:\n  19:37 EST, 30 October 2018\n\n | \nUpdated:\n  22:22 EST, 30 October 2018\n\n          62View  commentsA spike in the price of crude oil combined with the tumbling value of the Australian dollar is pushing the cost of petrol to near decade high levels.Both the Prime Minister and major petrol retailers claimed they are not responsible for the petrol price hike, and instead pointed the finger at the current market.Prime Minister Scott Morrison warned retailers on Monday the Australian Competition and Consumer Commission (ACCC) would be 'watching them', and dismissed calls to reduce fuel excise.But ACCC CEO Rod Sims told The Australian major oil-exporting countries in OPEC (Organization of the Petroleum Exporting Countries) were to blame and claimed they were acting like a 'cartel'.Blame for the most expensive petrol in more than a decade has been aimed at the simultaneous surging price of crude oil and falling value of the Australian dollarThe ACCC said it was powerless in forcing down prices but threatened to use the 'big stick' on retailers if they failed to ease the burden on their customers.'You can understand people's anger and frustration. Petrol is the ultimate grudge purchase. Everyone has got to buy it and it is causing real pain out there,' he said. While he shifted responsibility to petrol companies to 'do the right thing', Caltex CEO Julian Segal reminded customers 'a significant portion' from sales went 'into Scott Morrison's pocket'.'There are real reasons why these prices have gone up and that simply is crude prices have gone up significantly and the Aussie dollar has gone down,' he told The Australian Financial Review.'You should also remember a significant portion of every dollar that the customer pays is going into Scott Morrison's pocket in the form of excise, for example,' Mr Segal said.Meanwhile, Liberal MP Craig Kelly called on the Government to slash its excise and drive the cost of petrol down 10 cents per litre. Scott Morrison  (pictured) warned retailers on Monday the Australian Competition and Consumer Commission would be 'watching them', and dismissed calls to reduce fuel exciseThe $12 billion a year fuel excise adds an extra 40 cents to the cost of every litre and is levied by the government and used to repair roads and fund infrastructure The $12 billion a year fuel excise adds an extra 40 cents to the cost of every litre and is levied by the  government and used to repair roads and fund infrastructure. Petrol costs have skyrocketed across the nation, with prices in Sydney hitting an eye-watering $1.75 a litre on Monday, Melbourne hitting a 10-year high last month, and Adelaide motorists forking out an average of $1.67 a litre.Queensland MP Luke Howarth accused retailers of profiting from the price, arguing 'most of the price is going to retailers at the moment'.Caltex however suffered a $20million blow to its retail earnings in the September quarter relative to its run rate in the first half.Mr Sims welcomed the ACCC's scrutiny and said he doubted  it would be successful in finding anything of a damning nature.More than 160,000 Australians pledged to boycott petrol stations in a day-long strike on Friday October 26 protesting against rising fuel prices.While many people took part, it was discovered the movement made little difference, prompting the development of a plan to boycott BP and Shell service stations for the rest of the year. Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}