{"id": "A lifeguard who loves Christmas changed his name and cut his ears to look like an elf", "paragraph": "By\n\nKelsey Wilkie For Daily Mail Australia\n\n\nPublished:\n  18:24 EST, 17 November 2018\n\n | \nUpdated:\n  18:32 EST, 17 November 2018\n\n           2View  commentsA vegan lifeguard who is slowly transforming himself into one of Santa's helpers is ready to spread his Christmas cheer across Australia.Jessey The Elf – his legal name – from Ontario, Canada, recently landed in Australia ready to compete in the Lifesaving World Championships.But surprisingly, it wasn't a sleigh that brought him here. Over the past four years, the 24-year-old has been dedicating his life to celebrating the festive season - even having surgery on his ears so they're pointed like an elf.Meet Jessey The Elf – his legal name – from Ontario, Canada (pictured). He loves Christmas and even had surgery on his ears so they point like an elfThe lifeguard legally changed his name from Benjamin Jessey Sales and branded his chest with a snowflake tattoo.'I like Santa, the reindeers but mostly the elf part of it, because the elves make all the toys for the kids,' he told Adelaide Now.  'At first my parents were a little skeptical but they've come around now and my mum loves it.'  The professional athlete said he is excited to compete in the Lifesaving World Championships in Adelaide next week and hopes to bring home the gold.Jessey The Elf, a vegan professional athlete from Canada, (pictured) has been slowly transforming himself in a Christmas elf'I like Santa, the reindeers but mostly the elf part of it, because the elves make all the toys for the kids,' he saidThe professional athlete said he is excited to compete in the Lifesaving World Championships in Adelaide next week and hopes to bring home the gold Elf has won several national lifesaving championships in his home country, but said he hopes to compete in the Olympics in Tokyo as a triathlete in 2020. He told Runners World transforming into an elf helped make his training more fun.  'I used to be really serious and competitive. It would destroy me if I had a bad performance. Now I just enjoy competing and I smile a lot more.''People ask if, psychologically, I actually think I am an elf. It is not to that level. I just think it is cool having such a different name and pointed ears. It's really out there.'The Lifesaving World Championships will be held from November 16 to December 2.New Zealand are the reigning World Champions, they have held that title since 2012. 'At first my parents were a little skeptical but they've come around now and my mum loves it,' he saidElf has won several national lifesaving championships in his home country, but said he hopes to compete in the Olympics in Tokyo as a triathlete in 2020  Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}