{"id": "Sons of murdered Saudi journalist Jamal Khashoggi appeal for return of their father's body ", "paragraph": "By\n\nJessica Finn For Dailymail.com\n\n\nPublished:\n  18:46 EST, 4 November 2018\n\n | \nUpdated:\n  00:18 EST, 5 November 2018\n\n          42View  commentsJournalist Jamal Khashoggi's sons issued an emotional appeal to have their father's body returned home during a sit-down with CNN. Salah and Abdullah Khashoggi said they've been through weeks of agony following his disappearance and the confirmation on his death.'I really hope that whatever happened wasn't painful for him, or it was quick. Or he had a peaceful death,' Abdullah Khashoggi, 33, said during his interview alongside his brother Salah, 35 in Washington on Sunday. There are varied reports as to what happened to Khashoggi's remains. An adviser to the Turkish President says the journalist was strangled and then dissolved in acid.Similarly, the Washington Post, the outlet Khashoggi was a correspondent for, reports his body may have been dismembered to be easily dissolved in acid. They are citing Turkish government sources.His sons say without their father's body, grieving and closure is not possible.    'All what we want right now is to bury him in Al-Baqi (cemetery) in Medina (Saudi Arabia) with the rest of his family,' Salah told CNN. Scroll for video  Abdullah Khashoggi (left) beside his brother, Salah Khashoggi (right) told CNN in an interview Sunday they want their father's body returned for burialJamal Khashoggi's (left, and pictured right entering the Saudi embassy in Turkey on Oct 2) body was dissolved in acid after he was strangled inside the an adviser to Turkish President Erdogan claims. The slain journalist's employer, the Washington Post is reporting similarly'I talked about that with the Saudi authorities and I just hope that it happens soon.' Salah, Khashoggi's eldest son says, despite the misinformation he has received about his father's untimely death, he believes Saudi King Salman bin Abdulaziz when he says those responsible will be found out. 'The King has stressed that everybody involved will be brought to justice. And I have faith in that. This will happen. Otherwise Saudi wouldn't have started an internal investigation,' Salah said.When asked if he was putting his faith in the Saudi King, Khashoggi's eldest son replied 'yes.' Weight of the world: Eldest son, Salah Khashoggi, has to deal with reading between media reports, his large family's inquiries into his father's remains and the investigation into his death, and being the go-between for his family and the Saudi Royal Family, while processing his father's untimely death Salah and Abdullah describe their father as a loving family man, who believed in the direction the Saudi Royal Family is taking the country in. They want people to know he was not a dissedent as has been suggested by Saudi Crown Prince in conversations with Jared Kushner and National Security Adviser John BoltonThe Saudi government's official story behind Khashoggi's killing changed dramatically in the the weeks after he first disappeared in Saudi Arabia's embassy in Turkey on October 2, after going inside for paperwork to marry his Turkish fiancee.On October 4, Saudi government officials said he had left the consulate through a back door. Eventually it became clear that he never walked out. On October 19, the the Saudi's said the Washington Post correspondent was killed in a fist fight inside the consulate.Turkey's President Recep Tayyip Erdogan has claimed that the order to kill journalist Jamal Khashoggi's  came from the highest levels of the Saudi government. What has troubled the journalist's sons the most has been the outright lies surrounding their father's death, and the portrayal of his postmortem legacy.'Jamal was a moderate person. He was liked by everybody. He had differences and common values with everyone,' Salah said, adding that Khashoggi was an 'amazing' father.Jamal Khashoggi leaves behind his two sons, and two daughters, as well as grandchildren, all who are living in the Middle East and are dealing with an unbelievable spotlight 'I see a lot of people coming out right now and trying to claim his legacy and unfortunately some of them are using that in a political way that we totally don't agree with.'Public opinion is important... but my fear is that it's being over politicized. People are throwing analysis that may direct us away from the truth.' On Friday, it was claimed that Saudi Crown Prince Mohammed bin Salman called Khashoggi a 'dangerous Islamist' to Trump officials shortly after he vanished.Salman told Jared Kushner and National Security Adviser John Bolton that Khashoggi was a member of the Muslim Brotherhood during a phone call a few days after the journalist went missing, but before Saudi acknowledged he was dead. While the Muslim Brotherhood is not considered a terrorist organization in the US or Europe, it is considered so in many Arab nations and is perceived to be existential threat to Saudi Arabia.In an op-ed for the Washington Post, Turkish president Recep Tayyip Erdogan (pictured) says that he believes the order to kill journalist Jamal Khashoggi's came from the highest level of the Saudi governmentHis sons say, however that their father is not only not a dissident, but also firmly believed in the direction the monarchy was taking the country in. Khashoggi's family have previously and repeatedly denied that the reporter - a Saudi regime insider turned critic - was a member of the Brotherhood, calling suggestions that he was dangerous 'ridiculous'. Meanwhile Salah, as the family's eldest heir, has bore the brunt of his large family's inquires into his father's death. On top of trying to wrangle media reports and disinformation about Khashoggi's legacy, he is also personally dealing with his father's death.  'Our source is the same source that you have. It is a mystery. This is putting a lot of burden on us- all of us. That everybody is seeking for information just as we do. They think that we have answers, and unfortunately we don't,' Salah said. 'It's difficult, it's not easy. Especially when the story gets this big. It's not easy, it's confusing. Even the way we grieve, it's a bit confusing,' Abdullah said. 'At the same time, we're looking at the media and the misinformation. There's a lot of ups and downs. We're trying to be emotional and at the same time we're trying to get the story, bits and pieces of the story to complete the whole picture. It's confusing and difficult. It's not a normal situation and not a normal death.'Salah says in the meantime he is waiting for the investigation to be over and for the facts to come out. In an op-ed in The Washington Post on Friday, Turkish President Erdogan said: 'We must reveal the identities of the puppet masters behind Khashoggi's killing.' Elsewhere it was claimed that Mohammed bin Salman called Jared Kushner and John Bolton and branded Khashoggi a 'dangerous Islamist'However, the Turkish president said he did not believe that Saudi King Salman had ordered the killing. Erdogan says does not believe 'for a second' that King Salman had ordered 'the hit' on Khashoggi and he also refrained from directly accusing the crown prince.He also said that Turkey's friendship with Saudi Arabia did not mean that it could turn a blind eye to the killing of the journalist last month in the Saudi Consulate in Istanbul. An adviser to Erdogan said last week that MbS, as the crown prince is informally known, had 'blood on his hands' over Khashoggi´s killing. The comments were the bluntest yet from someone linked to Erdogan about Riyadh's de facto ruler's role in the death. In a warning, Erdogan added: 'No one should dare to commit such acts on the soil of a NATO ally again. If anyone chooses to ignore that warning, they will face severe consequences.' Earlier, an advisor to the Turkish President Erdogan said that Khashoggi's body was cut up and dissolved in acid after he was strangled inside the Saudi consulate.John Bolton and Jared Kushner, who took the call, were urged not to abandon US-Saudi ties in the face of the growing scandalYasin Aktay, an official in Turkey's ruling party, said on Friday that it appears Khashoggi's body was dismembered so it would be easier to melt.  Speaking at a business summit in Riyadh, in which he managed to sign business deals worth $50billion despite the killing, Salman said the killing was 'very painful, for all Saudis.'His regime has tried to paint the murder as the work of rogue elements within the Saudi state, which he has pledged to reform, and he called it 'not justifiable'. On Friday, US Secretary of State Mike Pompeo said it would take 'a handful more weeks' before the US has enough evidence to impose sanctions on Saudi Arabia.However, he said the sanctions would focus on individuals responsible for Khashoggi's death, suggesting that the US is following Salman's line and holding 'rogue elements' responsible, rather than the kingdom and its leadership as a whole.'We're continuing to understand the fact pattern,' Pompeo said Thursday during an interview with Missouri-based KMOX news radio.'We are reviewing putting sanctions on the individuals that we have been able to identify to date that have - that were engaged in that murder.The news comes as US Secretary of State Mike Pompeo mulls what action to take against Saudi, and suggested on Friday that sanctions could be ready in a couple of weeks'It'll take us probably a handful more weeks before we have enough evidence to actually put those sanctions in place, but I think we'll be able to get there,' he said, adding that President Donald Trump had vowed accountability for all involved in the 'heinous crime'.The top US diplomat has previously said the killing 'violates the norms of international law.'But Pompeo emphasized, as Trump has, that 'not only do we have important commercial relationships, but important strategic relationships, national security relationships with the Kingdom of Saudi Arabia, and we intend to make sure that those relationships remain intact.'Speaking at a journalism awards ceremony Thursday, Fred Ryan, Publisher and CEO of the Washington Post which Khashoggi wrote for, urged the Trump administration to take a tougher line.'When officials of our government are asked about consequences for Jamal's murder, they often talk about 'balancing our interests in the area,'' he said.'The 'Khashoggi incident' is viewed in some respects as a 'complication' in a far more important strategic relationship.'But Jamal's death is more than a 'complication.' It is vicious, state-sponsored murder of an innocent journalist,' he added, calling on the government to suspend arms deals with Riyadh and not resume 'business as usual' with the kingdom.'If those who persecute journalists get away with their crimes - and are allowed to continue with business as usual - it only invites more of the same,' he said.Hatice Cengiz, fiancee of slain Saudi journalist Jamal Khashoggi, wrote a new opinion piece in The Washington Post on FridayShe said: 'It has been exactly one month since my fiance, the celebrated journalist Jamal Khashoggi, entered Saudi Arabia's consulate in Istanbul never to return. 'Today is also United Nations International Day to End Impunity for Crimes against Journalists. The coincidence is tragic and painful…Hatice Cengiz urged Trump to take strong action against Saudi after Khashoggi's death'As we witness the international outrage at his killing, the perpetrators should know that they can never erase his vision for his beloved country. They have only emboldened it.'It is now up to the international community to bring the perpetrators to justice. Of all nations, the United States should be leading the way. 'The country was founded on the ideals of liberty and justice for all, the First Amendment enshrining the ideals personified by Jamal. But the Trump administration has taken a position that is devoid of moral foundation. 'Some have approached this through the cynical prism of self-interest - statements framed by fear and cowardice; by the fear of upsetting deals or economic ties. 'Some in Washington are hoping this matter will be forgotten with simple delaying tactics. But we will continue to push the Trump administration to help find justice for Jamal. There will be no coverup.'I am not naive. I know that governments operate not on feelings but on mutual interests. 'However, they must all ask themselves a fundamental question: If the democracies of the world do not take genuine steps to bring to justice the perpetrators of this brazen, callous act - one that has caused universal outrage among their citizens - what moral authority are they left with? Whose freedom and human rights can than credibly continue to defend?'At the consulate, I was left at the door alone. I am the one story Jamal did not complete. Now everyone, together, must help finish it and carry the torch of Jamal's soul until his dream is realized.READ THE FULL PIECE HERE Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}