{"id": "Scotland stars moaning about the formation is just weak-minded - David Weir", "paragraph": "By\n\nPeter Rutzler For The Scottish Daily Mail\n\nPublished:\n  18:48 EST, 12 November 2018\n\n | \nUpdated:\n  18:48 EST, 12 November 2018\n\n           1View  commentsFormer Scotland skipper David Weir believes the current crop of international players are 'weak-minded' if they cannot cope with Alex McLeish's formation changes.The national manager has come under fire for his tactical approach following his side's humbling defeat in Israel last month.McLeish has been utilising a back three in an attempt to include Liverpool's Andy Robertson and Celtic's Kieran Tierney, who are both left-backs by trade, in his starting line-up.Alex McLeish has been coming under fire for his tactical approach to Scotland gamesHowever, the system, which had previously proved successful against Albania, was criticised in some quarters following the 2-1 loss in Haifa.Weir, who won 69 caps for his country, insisted it is not formations that win matches, but players.'You look at the best teams and they change formation within the games, with the ball, without the ball,' said the 48-year-old former defender.'Formations are sometimes used as a stick to beat the coach with but he picks that formation to win the game.'He (McLeish) picked that formation and it beat Albania then he picked it and we lost to Israel. Was it the formation that lost to Israel? Or the players? In my mind, it wasn't the formation. It was the players who lost the game.'The players have got to adjust and adapt. And if players are moaning about the formation then they are weak-minded, in my opinion. Because a formation has never lost you a game.'It is players that win or lose a game.' Scotland will be hoping to retake control of their UEFA Nations League group on Saturday when they face Albania in Shkoder.And all eyes will be on McLeish to see whether he will adapt his approach to the Robertson-Tierney conundrum - which is quickly becoming the defining feature of his tenure.McLeish has attempted to utilise a back three in order to get Andy Robertson in the teamWith Stephen O'Donnell withdrawing from the squad through injury, Tierney may fill in at right-back for the Nations League double header.The Celtic stalwart was squeezed in as a left-sided centre-half for Scotland's two previous Nations League matches, while Robertson was deployed as wing-back, with varied success.Captain Robertson said after the Israel defeat that both players were 'playing out of position', leading some to suggest that the Liverpool defender be used as a winger or that one of the two drop out of the starting line-up altogether.Weir, however, insists it is vital that both feature, and that these are the challenges for which managers are paid.'You definitely want both of them in your team in some shape or form,' said Weir.'It is just Sod's law, really, that two of our better players would ideally play in the same position.'That is what managers get paid for, to try to give your team the best chance of winning.'You could say the same about the goalkeepers - Allan McGregor, Craig Gordon, David Marshall in the past.'We have top goalkeepers and maybe in some other positions we don't have that strength.'You need to find a system that allows your strengths to work and hides your deficiencies.' McLeish thought he had found that system when Scotland defeated Albania 2-0 at Hampden in September. But he was left stunned in Haifa last month as Israel, then ranked 55 places below the Scots, ran out 2-1 winners thanks to a Dor Peretz strike and a Tierney own goal.David Weir says Scotland players should not hide behind their manager in upcoming gamesScotland were handicapped by a John Souttar red card but his second-half dismissal was a red herring masking the nature of the defeat, which saw the visitors on the back foot from the first whistle.For Weir, it is a sign of where the national side is now, and they can only reach the next level if they find some consistency.'It is no coincidence we are in amongst Albania and Israel because we have not qualified for a tournament for 20 years - where do we expect to be?' questioned Weir. 'We would love to be with France, Italy and Spain but we're not.'So we have to beat the likes of Albania and Israel to prove that we are capable of going up to the next stage. We are always capable of winning an individual game but we need to do that more consistently. This Nations League gives you an opportunity to progress, so it is a fair benchmark of where we are.'It is not an open draw. It is based on numbers, facts and you can't argue with them. That is the reality of the situation, so we had better get our heads around it. You look at the squad and there are a lot of good players there, who deserve to be playing at big tournaments. But deserving to and doing it are two different things.'You only earn the right by beating the Albanias and the Israels and managing to navigate the next bit as well. It is not easy to get into these tournaments but the only way to do it is by winning games.' As things stand, Scotland can still qualify from their Nations League group even if they lose in Albania this weekend - as long as they beat Israel by two goals or by a narrower, high-scoring result.But for McLeish, having won just twice in eight games since his appointment in February, a positive performance will be key if he hopes to shake off the circling vultures.'It is not unthinkable (that Scotland do not qualify for the semi-finals) because it is possible,' said Weir. 'It is based on what we do. We are still top of the group, so we are still in a good position. But we have Albania away and Israel at home, so it is up to us, up to the performances on the pitch.' BT Sport brings you live coverage from the Ladbrokes Premiership and is the exclusive home of the Betfred Cup. Watch on TV and via the award-winning BT Sport App. For more info visit bt.com/sport Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}