{"id": "Cindy Crawford looks flawless as she shares makeup free snap from bed during 'recovery mode'", "paragraph": "By\n\nDailymail.com Reporter\n\nPublished:\n  19:43 EST, 30 October 2018\n\n | \nUpdated:\n  20:14 EST, 30 October 2018\n\n         122View  commentsShe's considered one of the most beautiful women in the world.And Cindy Crawford proved worthy of the title with aplomb as she shared a beautiful snap of herself makeup free on Monday.The 52-year-old beauty looked flawless even with her hair in disarray as she lay in bed and captioned the photo: 'recovery mode.'Cover girl: Cindy Crawford, 52, shared a beautiful snap of herself makeup free on MondayShe may have been referring to recovering after she spent the weekend in full Halloween party mode.The cover girl attended her husband Rande Gerber's annual Casamigos Halloween party thrown with his business partner George Clooney. Their Saturday night party in Los Angeles was a star-studded event of epic proportions.  The two men were  wearing pilot's uniforms and posing behind the controls of a private jet. Partners in crime: The cover girl attended her husband Rande Gerber's annual Casamigos Halloween party thrown on Saturday with his business partner George ClooneyGorgeous: She upped the glamour with a dramatic winged eyeliner and a red lipstick, while a blue flight attendant hat sat atop her brunette tresses that had been styled into a bouffantThe 57-year-old Syriana actor and his 56-year-old ex-model partner both rocked aviator shades by Privé Revaux for the snap.  Cindy glammed up as a retro air hostess while serving tequila during the flight.The Illinois native looked fabulous in a blue, white and orange shift dress with white calf high boots. She upped the glamour with a dramatic winged eyeliner and a striking red lipstick, while a blue flight attendant hat sat atop her brunette tresses that had been styled into a glamorous bouffant.Meanwhile, Cindy also took to social media to tease her preparations for the event.The 52-year-old beauty captioned  a snap of herself wearing a face mask in Nevada was captioned 'Round 2...'. Other photos showed the 5ft9in stunner wearing a robe while having her hair done and showing off a pair of cute retro white high heeled leather boots. Dressed the part: The Illinois native looked fabulous in a blue, white and orange shift dress with white calf high bootsPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}