{"id": "Jon Cryer cast as villain Lex Luthor in CW's Supergirl series", "paragraph": "By\n\nDailymail.com Reporter\n\nPublished:\n  18:34 EST, 17 November 2018\n\n | \nUpdated:\n  18:34 EST, 17 November 2018\n\n          38View  commentsJon Cryer has been cast in the role of villain Lex Luthor in CW's Supergirl.The 53-year-old actor - who previously won two Primetime Emmy Awards for his role in the CBS comedy series Two and a Half Men - is set to star as the iconic villain in the Warner Bros. Television series, which stars Melissa Benoist as Supergirl.The show's executive producers Robert Rovner and Jessica Queller explained: 'We are enormous fans of Jon Cryer, and he was instantly our dream actor to play the iconic role of Lex Luthor.New face! Jon Cryer has been cast in the role of villain Lex Luthor in CW's Supergirl'Jon is a super-talent, and the fact that he played Lenny Luthor in Superman IV brings an added layer of legacy to his casting. We're beyond thrilled to welcome Jon to the Supergirl family.'The actor previously played Lenny Luthor - the nephew to Gene Hackman's Lex - in the 1987 movie Superman IV: A Quest for Peace.Of course Alexander Joseph 'Lex' Luthor, originally appeared in action comics #23 and has persisted as Superman's arch nemesis ever since. Accomplished! The 53-year-old actor previously won two Primetime Emmy Awards for his role in the CBS comedy series Two and a Half MenCryer will make his debut as the character in the 15th episode of the show's current season.Meanwhile, Melissa previously revealed that the current series of Supergirl would take the show in a new direction.She shared: 'The writers' room is being really great this year. Last season, it was a lot of fire and brimstone and a lot of homages to Buffy the Vampire Slayer, which was great because I was such a big fan of that show.Some super experience: The actor previously played Lenny Luthor - the nephew to Lex - in the 1987 movie Superman IV: A Quest for PeaceThe past: Gene Hackman notably played the super villain in the original superman movies opposite Christopher Reeve's Superman Classic character: Of course Alexander Joseph 'Lex' Luthor, originally appeared in action comics #23 and has persisted as Superman's arch nemesis ever since'This season they really want to thematically tackle more topical stories that maybe mirror what's going on with the state of the world and our country.'There's a lot of anti-alien sentiment at the beginning of Season 4 that Supergirl is going to have to grapple with. I think their main premise is that fear itself is a villain, and can hope conquer it?''Supergirl stands for hope, so we'll see. I think fear is her biggest opponent yet because it's more of a wildfire-type emotion.'Exciting! Meanwhile, Melissa Benoist previously revealed that the current series of Supergirl would take the show in a new direction \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}