{"id": "Parents who let their kids skip school could be fined almost $1600 and slapped with criminal charges", "paragraph": "By\n\nBianca Bongato For Daily Mail Australia\n\nPublished:\n  19:45 EST, 20 October 2018\n\n | \nUpdated:\n  23:48 EST, 20 October 2018\n\n          53View  commentsParents who let their children skip school could be fined almost $1,600 and face criminal charges. The Queensland state government has issued a reminder for parents to ensure their children attend school every day - or face hefty consequences. Parents who fail to comply could be slapped with a $801 fine for a first offence, or up to $1,566 for multiple violations.In the past decade, the  penalty range for parents has increased from $1,413.60.Parents who let their children skip school could be fined almost $1,600 and possibly face criminal charges (stock image)Education Minister Grace Grace said while the fines and charges issued were often a last resort, parents have been prosecuted in the past for failing to comply.Government data revealed that as of August, 16 Queensland parents were charged for allowing truancy, while up to 21 parents were charged last year, according to The Courier Mail.  'Of course, before any referral to police, our schools work closely with families to attempt to improve a child's attendance,' Ms Grace told The Courier Mail. Ms Grace said there is a significant decrease in attendance during the end of the school year.'Unfortunately, the last term of school is typically when we can start to see an increase in unexplained student absences,' she said. 'But it’s very important for parents and carers to continue to send their children to school every day of the school year'. Education Minister Grace Grace (pictured) said that while the fines and charges were often a last resort, parents have been prosecuted in the past for failing to complyThe Queensland government launched an 'Every Day Counts' campaign to improve school attendance.The initiative stresses that all children should be enrolled and attend daily. It also states that schools should actively monitor and implement strategies to encourage attendance.The campaign emphasises that letting children skip school could place them in unsafe situations and impact their employability in the future. Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}