{"id": "Reuters Sports News Summary", "paragraph": "By\n\nReuters\n\nPublished:\n  19:53 EST, 30 October 2018\n\n | \nUpdated:\n  19:53 EST, 30 October 2018\n\nFollowing is a summary of current sports news briefs.Calgary Olympic committee recommends city scrap 2026 Winter Games bidCalgary's Olympic assessment committee on Tuesday recommended the city scrap a bid for the 2026 Winter Games after a funding row with the Canadian government. A full vote of council on whether to officially take the western Canadian city, which previously hosted the Olympics in 1988, out of the running will be held on Wednesday.NBA roundup: Thompson sets trey recordKlay Thompson set an NBA record with 14 3-pointers as part of an NBA-season-high 52-point performance, and the visiting Golden State Warriors stormed to a 149-124 win over the Chicago Bulls on Monday night. The Warriors scored 92 points in the first half -- the most ever by a road team and the second most of all time behind the Phoenix Suns, who had 107 in the first half against the Denver Nuggets on Nov. 19, 1990.Inexperienced Lakers starting to wear on LeBronJust seven games into the season, LeBron James is starting to run out of patience with the mistakes of his young Los Angeles Lakers teammates. The Lakers are 2-5 following a 124-120 loss at Minnesota on Monday night and have given up an average of 122.3 points per game, 29th in the league. The Lakers haven't been able to keep opponents off the boards -- they surrendered 20 offensive rebounds to the Timberwolves -- nor have they been able to shut them down on crucial possessions.Eagles acquire Lions WR Tate for third-rounderThe Philadelphia Eagles acquired wide receiver Golden Tate from the Detroit Lions in exchange for a third-round pick on Tuesday, both teams announced. \"It's been real DETROIT! I'll love ya forever. Philly Philly let's get it!!\" Tate tweeted.Seahawks LB Kendricks gets eight-game suspensionThe NFL decided the suspension for Seattle Seahawks linebacker Mychal Kendricks will be eight games for his guilty plea to federal insider trading charges, the league announced Tuesday. He previously had been suspended indefinitely under the league's personal conduct policy.Wise named PGA Tour rookie of the yearAaron Wise was named the PGA Tour's rookie of the year on Tuesday after posting four top 10 finishes, including his first career win at the AT&amp;T Byron Nelson. The 22-year-old resident of Las Vegas was one of eight rookies to qualify for the FedExCup playoffs but the only one to advance to the season-ending TOUR Championship.Rutgers linebacker charged in double-murder plotRutgers University linebacker Izaia Bullock was arrested Tuesday and charged in connection with a plot to commit murder, according to a news release from Middlesex County Prosecutor Andrew C. Carey and Rutgers University Police Chief Kenneth Cop. Bullock, 22, of Piscataway, N.J., was charged with two counts of attempted murder in the first degree and two counts of conspiracy to commit murder in the first degree. The release notes the charges came after determining that on Monday, \"Bullock initiated a plot to murder the family members of an acquaintance.\"Red Sox pick up Sale's $15 million optionThe Boston Red Sox picked up the $15 million option on left-hander Chris Sale's contract for the 2019 season. Sale will be entering the final year of a five-year deal he signed with the White Sox in 2013. He was traded to the Red Sox in 2017 and went on to finish second in the American League Cy Young voting with a 17-8 record and 2.90 ERA.Tennis: Kasatkina outlasts Wang in Zhuhai openerTop seed Daria Kasatkina overcame a stern test from Wang Qiang in the opening round-robin match at the WTA Elite Trophy in Zhuhai, outlasting the local favorite 6-1 2-6 7-5 on Tuesday. Competing as a top-10 player for the first time, Kasatkina broke her opponent twice to claim the opening set.American sisters sue USA Gymnastics over sex abuse scandalTwo former USA Gymnastics national team members on Monday filed civil lawsuits against the organization, disgraced ex-team doctor Larry Nassar, and the U.S. Olympic Committee for failing to prevent sexual assault of young women in their care. Tasha Schwikert, 33, who won a bronze medal at the 2000 Sydney Olympics, and her sister Jordan, 32, described themselves as Nassar victims during a news conference at a Los Angeles law firm.Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}