{"id": "Sophie Monk kisses a mystery man in Sydney days before undergoing surgery at an IVF clinic", "paragraph": "By\n\nBenge Nsenduluka\n\n\nand \nMarta Jary For Daily Mail Australia\n\nPublished:\n  18:48 EST, 12 November 2018\n\n | \nUpdated:\n  22:28 EST, 12 November 2018\n\n           1View  commentsSophie Monk, 38, was pictured kissing a mystery man on Saturday, just days before undergoing a procedure at an IVF clinic.The former Bachelorette looked smitten as she locked lips with her handsome suit-clad companion outside a bar in Miller's Point, Sydney.The blonde beauty showed off her trim pins in a cleavage-baring metallic dress and open-toe YSL heels.Sealed with a kiss! Sophie Monk, 38, was seen locking lips with a mystery man in Sydney on Saturday just days before undergoing a procedure at an IVF clinic In a statement to Daily Mail Australia on Tuesday, a rep for Sophie confirmed the Love Island Australia host 'is in a relationship' but did not elaborate on her new man's identity.On Instagram, Sophie said she's never been happier after finding new love.'So luck yo have this guy in my life to help me recover,' she wrote alongside heart symbol emojis.Grateful: Sophie told her Instagram followers she feels 'lucky' to have the mystery man in her life'I've never been so happy.' The new couple gazed adoringly at each other while sharing the tender moment.They were seen flirting up a storm as they chatted and exchanged laughs among themselves.Sealed with a kiss! Sophie and her date couldn't keep their hands off each other as they showcased PDASmooches: Sophie looked swept up in the moment as she spent quality time with the mystery manDate night: The pair gazed adoringly at each other during a tender moment, on what looked to be a romantic dateAt one point, the mystery man whispered into Sophie's ear as he held her closely while she flirtatiously placed one hand on his chest as they embraced.The outing took place two days before the former Bardot singer appeared to be taking steps towards having a baby, undergoing a mystery procedure at a Sydney IVF clinic.On Monday afternoon, Sophie shared a confronting video to her Instagram Stories in which she was seen unconscious in hospital after undergoing surgery.Affection: The pair looked comfortable as the mystery man held the former Bachelorette closelyClose bond: The pair were seen flirting up a storm as they chatted among themselves Giggles: Sophie looked to be in high spirits throughout the eveningShe thanked doctors and nurses at Monash IVF, a Sydney In Vitro Fertilisation clinic, and called the team 'angels'.While it is unclear what procedure Sophie underwent, she did reveal that doctors had discovered she has endometriosis.Prior to IVF treatment, women may undergo investigative procedures, such as an endoscopy, to check for conditions such as endometriosis or fibroids - conditions which can make conceiving a child more difficult.  Refreshments: The pair took a moment to order some drinks on the night outComfortable: They looked comfortable and relaxed in each other's presenceLove is in the air! Sophie and her companion were inseparable as they mingled at a Sydney barDuring a candid chat with KIIS FM's Jackie 'O' Henderson in May, Sophie confirmed that she was in the process of freezing her eggs.'It's all booked in. So I go to Spain to do Love Island and I'm going to do a travel special with [best pal] Oscar [Gordon] in Italy, and fly straight back and freeze them,' she said. The process of freezing eggs begins with eight to eleven days of injecting a thin needle filled with a fertility hormone into the soft tissue of the lower stomach. Chic: The blonde beauty showed off her trim pins in a cleavage-baring striped dress and open-toe heelsEggs are then collected with an ultrasound-guided tool that is inserted into the vagina, and once frozen, the eggs can be stored for many years.In an interview with A Current Affair in February, Sophie said that she was still determined to start a family despite breaking up with former Bachelorette winner Stu Laundy, who she previously thought was 'The One'.'I'd love to [have kids] because I know they'd be so loved. I'd love to be a mum but I'm going to have to freeze eggs,' she told reporter Leila McKinnon.Over: Sophie confirmed she split with Stu Laundy (left) in January after initially revealing she'd hoped they'd have a child together within the year The battle for a baby: The outing came two days before the former Bardot singer appeared to be taking steps towards having a baby, as she underwent a mystery procedure at a Sydney IVF clinic on MondayHospital bound: She thanked doctors and nurses at Monash IVF, a Sydney In Vitro Fertilisation clinic, calling her team 'angels'Slightly shocked by the admission that Sophie had thought about fertility treatments, Leila asked if this was just 'a headline' or something she was genuinely considering.  'I've made a plan,' Sophie replied. 'It's just the injections and all of those things...and fitting them into my schedule. I'm definitely doing it.'Sophie, who previously dated Good Charlotte's Benji Madden, Sam Worthington and Jason Statham, chose millionaire pub baron Stu in the grand finale episode of last year's The Bachelorette.During a chat with KIIS FM ahead of the show's premiere, Sophie revealed her baby plans with her chosen suitor.'I told him I want a baby and to get married,' she said at the time. After the show's finale in October, Sophie revealed that she was looking into having Stu's vasectomy reversed. Moving on: In an interview with A Current Affair in February, Sophie said that she's still determined to start a family despite breaking up with Stu, who she thought was 'The One''[The vasectomy] doesn't really matter because it can be reversed pretty quickly or regardless, I could go freeze my eggs and chuck 'em over to wherever he's got his sperm banked,' Sophie told news.com.au.However while the romance was not to be, it appears that Sophie has forged ahead with her plans to ensure she becomes a mother.Whether the former radio star decides to have a child alone is however up for debate, as late last year Sophie admitted that she'd find it 'lonely' to be a single mother.    Missing out: The blonde revealed she felt she was missing out by not experiencing motherhood: 'But now I'm like, yeah, I feel like I'm missing out [by not being a mum]' she said 'If I did it [have a baby] by myself, I think I'd find it really difficult. And also lonely,' she told news.com.au. In September, she revealed she met a new man on a flight after 'three champagnes' in business class and that they kissed mid-air.'We talk everyday on the phone for like five hours,' she told news.com.au.'It's really good but I've only seen him once.'Tough: 'If I did it [have a baby] by myself, I think I'd find it really difficult. And also lonely,' she told news.com.au Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}