{"id": "This is what 58 looks like", "paragraph": "By\n\nFlorence Scordoulis For The Daily Mail\n\nPublished:\n  18:50 EST, 4 November 2018\n\n | \nUpdated:\n  18:50 EST, 4 November 2018\n\nView  commentsVeronica Kumeta lives in Birmingham. She is single and has three children, Michael, 30, Robert, 28, and Trish, 24. She is the founder of the charity Ladies Fighting Breast CancerBOTOX NOT FILLERSEvery year, I get Botox to smooth the wrinkles on my forehead and around my eyes. At almost £300, it’s expensive, but worth it; I haven’t yet found a miracle cream that does the job as well. But I would never again get fillers — I tried them once when I turned 50, but I looked like I had golf balls in my cheeks!LUSCIOUS HAIR PREPI’ve always been known as ‘the girl with all the hair’. However, it has thinned a lot since I hit the menopause. To keep it healthy, I apply Rene Furterer’s Karite Hydra Hydration Shine Mask (£22.95, allbeauty.com) every two months, or a week before a special occasion. It makes such a difference that my hair is almost too soft!Veronica Kumeta, 58, (pictured) revealed her top tips for maintaining a youthful appearanceTRY MICROBLADINGEyebrows are crucial for framing the face. However, mine have become much sparser with age. I get regular microblading to fill in the gaps and add definition. It is a form of semi-permanent make-up, where tiny hairs are tattooed into the skin. It cost me £300 for the initial treatment, then £150 for the annual top-ups (beautissima.com).GOODBYE MEDITATIONI found having hobbies far more beneficial for my mental wellbeing than any meditation. Last year, I founded a charity choir called Surviving Voices & Friends to help women battling breast cancer. We practise every week and have even released a cover of Lean On Me on Amazon (99p, amazon.co.uk). I lost several friends to the illness, so it feels good to be making a difference and helping people.BARGAIN BUYSI would always much rather invest my money in regular beauty treatments than spend it on clothes. You can dress up anything to make it look expensive. Do you look good for your age? reveal your secrets to inspire@dailymail.co.ukPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}