{"id": "Rangers winger Daniel Candeias showed St Mirren disrespect, says Craig Samson", "paragraph": "By\n\nStephen Mcgowan for MailOnline\n\nPublished:\n  18:45 EST, 4 November 2018\n\n | \nUpdated:\n  18:45 EST, 4 November 2018\n\n           3View  commentsCraig Samson has accused Rangers winger Daniel Candeias of showing St Mirren a lack of respect before his disputed red card in Paisley.The Ibrox substitute was initially booked for his celebrations after a stunning 80th-minute strike on Saturday.Saints keeper Samson and defensive team-mate Anton Ferdinand then took exception to the Portuguese blowing kisses their way when Alfredo Morelos sealed the three points for Rangers with the decisive goal in a 2-0 win.Craig Samson has accused Rangers' Daniel Candeias of showing St Mirren a lack of respectReferee Willie Collum showed Candeias a second yellow following an exchange with Ferdinand, a decision Steven Gerrard branded 'embarrassing' after viewing Sky Sports footage of the incident.However, Samson shed some light on the events leading up to the dismissal when he suggested Candeias had shown a lack of class towards a Saints side sliding towards their seventh straight defeat.'When they scored the second goal he ran past and gave Anton (Ferdinand) a bit of stick, telling him to 'shoosh' and blowing him kisses,' said the 34-year-old keeper.Referee Willie Collum showed Candeias a second yellow following an exchange with FerdinandSamson said he made a 'shoosh' gesture and blew kisses at Ferdinand after their second goal'So when he ran past me I just sort of grabbed him and said: \"Look, there's no need to be so disrespectful … you've won the game so just go and celebrate with your team-mates\".'He agreed with me, and he apologised.'But Anton wasn't very happy with what was happening. I don't know what happened between the two of them but I just thought Candeias was lacking a wee bit of class in doing what he was doing.'Watching images of Candeias offering little or no response to Samson, followed by Ferdinand placing his arms around the Portuguese winger's shoulders, Gerrard said: 'So Daniel gets a second yellow card for that? Be serious? What does he get a second yellow card for?Rangers boss described the decision to send the Portugal man off as 'embarassing' afterwards'The second yellow card is embarassing. There's your evidence, that's what you're dealing with.'With little or no clarity as to why Candeias was *actually* sent off, Samson shrugged: 'I've got no idea why he got a second yellow card. All I know is, you don't need to act like he was, rubbing it in and showing a complete disrespect to your opponents.'Anton obviously wasn't happy because of it. I don't know what the two of them said to each other to actually make Candeais get sent off, but there was no need for him to do what he did. He had already won the game - just go and shake hands. You don't need to rub it in like that.'The Gers winger scored a stunning long-ranged effort to open the scoring earlier in the gameAlfredo Morelos netted their second in the dying moments of the game to seal the pointsPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}