{"id": "Rosie Huntington-Whiteley looks every inch the supermodel in plunging top and skintight denim", "paragraph": "By\n\nDailymail.com Reporter\n\nPublished:\n  19:39 EST, 24 October 2018\n\n | \nUpdated:\n  23:23 EST, 24 October 2018\n\n          12View  commentsShe's considered one of the most beautiful women in the world.And Rosie Huntington-Whiteley proved worthy of the title as she was spotted out in Beverly Hills on Wednesday.The 31-year-old looked every inch the supermodel as she rocked a plunging top and skintight jeans during her retail therapy outing.Stunner: Rosie Huntington-Whiteley, 31, was spotted out in Beverly Hills on WednesdayDaring to impress, the Mad Max: Fury Road starlet sported a chic black shirt.Her gorgeous gams were thrust on center stage as the denim pants were form fitting and tucked into knee-high boots.She kept her trademark blonde tresses long and loose as they cascaded over her shoulders. Always a style icon, she paired the sleek look with a trendy handbag and a pair of retro shades. Supermodel: She looked every inch the supermodel as she rocked a plunging top and skintight jeans during her retail therapy outingChic: The Mad Max: Fury Road starlet sported a chic black shirtLeggy lady: Her gorgeous gams were thrust on center stage as the denim pants were form fitting and tucked into knee-high bootsAnd the posting comes after the Mad Max: Fury Road star struggled recently with Jack suffering from sickness and jet lag. Rosie posted a sweet snap of herself holding son Jack with the caption: '5 days of colds, coughs, and jet lag.'Rosie shares Jack with Hollywood actor Jason Statham. They became parents for the first time last year after Rosie welcomed their son in June. Icon: Always a style icon, she paired the sleek look with a trendy handbag and a pair of retro shadesHair story: She kept her trademark blonde tresses long and loose as they cascaded over her shouldersThe Rosie and Jason love story goes way back until 2010 when they laid eyes on each other eight years ago. The IT girl discussed juggling her parenting duties with her modelling work back in March, just under a year into raising her son.She told Harper's Bazaar: 'For every woman, it's a juggle. You start a family and it's like, \"Wow!\" Becoming a mother has been the most humbling experience of my life.'When you have a baby, your whole life changes. Your priorities and what's important is different to before.'Doting mom: Rosie also posted a sweet snap of herself holding son Jack with the caption: '5 days of colds, coughs, and jet lag'Loved up: Rosie shares Jack with Hollywood actor Jason Statham; (pictured 2017)Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}