{"id": "Steven MacLean offered ban for grabbing Eboue Kouassi's groin", "paragraph": "By\n\nJohn Greechan For The Scottish Daily Mail\n\nPublished:\n  19:53 EST, 30 October 2018\n\n | \nUpdated:\n  19:53 EST, 30 October 2018\n\n           6View  commentsSteven MacLean has been offered a two-match ban for grabbing the groin of Eboue Kouassi during Sunday's Betfred Cup semi-final defeat to Celtic at Murrayfield.But the Hearts striker will be clear to face Hibs at Tynecastle on Wednesday as the Jambos have until Thursday to decide whether to contest the charge.The incident was caught on camera, with Parkhead midfielder Kouassi collapsing to the ground before protesting vehemently to referee Willie Collum.Eboue Kouassi falls to the floor in pain after his groin was grabbed by Steven MacleanThe SFA compliance officer cited 36-year-old MacLean on Tuesday, taking note of a change to the rules that now deems any deliberate contact to that area of the body an act of 'brutality'.Hearts boss Craig Levein said he had spoken to MacLean about the incident, although he joked: 'I can't without laughing!'Yeah, we've had a chat. I think he knows he can't do that, eh? I think he knows...'They've changed the rules in the summer. He says he's been doing it for years! I did have a wee chuckle...'Yeah, we knew the rule change. But Steven just seems to like doing it...'Another recent change to disciplinary regulations removes the need for a club to respond to a citing within 24 hours.As things stand, Hearts can sit on their hands until Thursday night's match at Tynecastle is over, then either give notice to contest the charge at a hearing scheduled for Thursday - or simply accept the ban before the hearing gets under way.Veteran forward MacLean made light of the incident in the immediate aftermath of the match, saying it was 'just a laugh' and insisting that defenders had been doing the same to him for years.But Celtic boss Brendan Rodgers described it as 'a stupid thing to do' and said he hadn't seen such an incident since 'Vinnie Jones on Paul Gascoigne'.Kouassi complained to the referee but Maclean went unpunished during the match'He (MacLean) was probably a bit emotional at the time,' said Rodgers. 'He'd been booked at the start of the game so he was probably fired up. We didn't make any comment on it.'It will be up to others to deal with it.'I just think there is no need for it. You don't need to do it. You see all sort of things going on such as standing on players' toes, tugging shirts and what not. The world is changing anyway in many aspects, but I've nothing really to say about it. It will be dealt with.'It never happened to me. I didn't play long enough. I got stamped on once, it hurt I will tell you that, in a youth international game and I can still feel it.'Kilmarnock forward Greg Stewart and Hamilton midfielder Darian MacKinnon have also been handed similar violent conduct charges following their teams' 1-1 draw on Saturday.Accies captain MacKinnon was booked for a challenge on Alan Power but his yellow card has been upgraded to a red following the examination of footage.Stewart has been charged after being accused of headbutting Scott Martin as the pair tangled off the ball.The referee speaks to the players following the incident with Malcean charged retrospectivelyPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}