{"id": "Backup goalie Brossoit, balanced Jets top Coyotes 5-3", "paragraph": "By\n\nAssociated Press\n\nPublished:\n  19:25 EST, 20 October 2018\n\n | \nUpdated:\n  21:11 EST, 20 October 2018\n\nWINNIPEG, Manitoba (AP) - Jacob Trouba was glad to see some different names on the scoresheet.Tyler Myers, Josh Morrissey and Mathieu Perreault each recorded their first goals of the season as the Winnipeg Jets defeated the Arizona Coyotes 5-3 on Saturday.Trouba added a career-high three assists, while Adam Lowry scored his fourth goal of the season and Blake Wheeler contributed an empty-netter. Morrissey and Kyle Connor, who had two assists, are tied for the team lead in points with seven.\"When everyone gets a goal, it feels pretty good when they score,\" Trouba said. \"It's good to see. You want to see everyone jump in and get in there.\"Making his second start of the season for the Jets (5-2-1), backup goalie Laurent Brossoit stopped 42 shots for his second victory.\"We had a little lull in the first (period) and he was there to back us up, especially on those penalty kills,\" Trouba said of Brossoit.Winnipeg Jets' Bryan Little (18) and Arizona Coyotes' Christian Fischer (36) fight for position during second-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)\"Both games he's played he's been extremely good and when (Connor Hellebuyck's) been in, he's been good. You definitely can't look at the goaltenders and expect much more.\"Clayton Keller scored twice and Christian Fischer had one goal for Arizona (2-5). Oliver Ekman-Larsson had three assists.Antti Raanta made 27 saves for the Coyotes, who haven't won in Winnipeg since the Jets moved from Atlanta to Manitoba in 2011.Arizona had a total of eight goals in its previous six games.\"It's good to see some go in,\" Keller said. \"We played hard tonight. We stuck with it. We didn't give up. We were right there. We learned a lot about our team tonight.\"The game was tied 1-1 after the first period and Winnipeg led 3-1 after two.The Coyotes were outshooting the Jets 13-2 in the first period with nothing to show for it until Fischer took a pass from Ekman-Larsson and moved the puck around the front of Brossoit before flipping it into the net with 4:23 remaining.The Jets went almost 14 minutes between their second and third shots, but made a late one count when Morrissey fired the puck from the point. It hit Lowry's blade and went in with 44 seconds left in the period.Arizona had a 16-6 shot advantage in the opening period and went 0 for 2 on the power play.\"Having 16 shots in the first period gets you into it right away,\" Brossoit said. \"But to be honest, I thought even with 16 shots, and they had the majority of the play in our end, I still thought we kept them to the outside and our (defensive) core made it relatively easier on me than the previous game.\"On Winnipeg's second power play, Mark Scheifele sent Morrissey a pass to the high slot and he bent down low and fired the puck in for the 3-1 lead.The Jets have at least one power-play goal in four straight games.Arizona's shot advantage was down to 27-22 after two.Keller made it 3-2 at 3:50 of the third, but Winnipeg responded with Perreault's goal less than two minutes later. A coach's challenge for goaltender interference on Perreault's marker was unsuccessful.Keller netted his second of the game with a shot under the crossbar on Brossoit's stick side for a 4-3 score at 11:53.Arizona had a power play with just over five minutes remaining when Wheeler was penalized for slashing, but Brossoit snapped out his glove to stop a shot by Keller. Wheeler then scored with 42 seconds left.UP NEXTCoyotes: Finish their four-game trip Tuesday against the Columbus Blue Jackets.Jets: Continue their homestand Monday against St. Louis.___More AP NHL: https://apnews.com/NHL and https://twitter.com/AP_SportsWinnipeg Jets goaltender Laurent Brossoit (30) saves a breakaway-attempt by Arizona Coyotes' Michael Grabner (40) during first-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Arizona Coyotes' Christian Fischer (36) scores against Winnipeg Jets goaltender Laurent Brossoit (30) as Jets' Joe Morrow (70) defends during first-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Arizona Coyotes goaltender Antti Raanta (32) saves a deflection by Winnipeg Jets' Brandon Tanev (13) during first-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Winnipeg Jets goaltender Laurent Brossoit (30) saves a shot from Arizona Coyotes' Derek Stepan (21) as Jets' Tyler Myers (57) defends during first-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Arizona Coyotes' Oliver Ekman-Larsson (23), Christian Fischer (36) and Brendan Perlini (11) celebrate Fischer's goal against Winnipeg Jets goaltender Laurent Brossoit (30) as Jets' Tyler Myers (57) looks on during first-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Winnipeg Jets' Tyler Myers (57) scores against Arizona Coyotes goaltender Antti Raanta (32) during second-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Winnipeg Jets' Josh Morrissey (44) celebrates after his shot beat Arizona Coyotes goaltender Antti Raanta (32) during second-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Winnipeg Jets' Jack Roslovic (28), Mathieu Perreault (85) and Josh Morrissey (44) celebrate Perreault's winning goal against the Arizona Coyotes during third-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Arizona Coyotes goaltender Antti Raanta (32) looks back as Winnipeg Jets' Josh Morrissey's (not shown) shot beats him during second-period NHL hockey game action in Winnipeg, Manitoba, Saturday, Oct. 20, 2018. (John Woods/The Canadian Press via AP)Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}