{"id": "Tory HQ on high alert for a snap General Election", "paragraph": "By\n\nMartin Beckford for The Mail on Sunday\n\nPublished:\n  18:44 EST, 17 November 2018\n\n | \nUpdated:\n  20:45 EST, 17 November 2018\n\n          41View  commentsSecret plans for a snap General Election have been accelerated by Conservative HQ after last week’s turmoil.Key marginal constituencies are being offered free campaign managers by Central Office, and candidate selections are being fast-tracked.The Mail on Sunday revealed earlier this year that No 10 advisers had discussed the plan to hold a fresh poll in the event of the Commons voting down Theresa May’s deal.The Conservative Party are considering a snap General Election if Theresa May, pictured, fails to get enough support for her Brexit plan in parliament Several Tory backbenchers are on manoeuvers in an attempt to undermine the PM's positionMrs May is fighting for her political life in an effort to remain at Number 10 this weekend She would go to the country for a ‘Brexit Election’ on the ticket of securing a mandate for a new negotiating platform with the European Union. The party’s canvassing activity in marginals has been ‘ramped up massively’ in recent weeks, sources say.But Tory MPs’ anxieties about another General Election – less than two years after the disastrous campaign that lost the party its Commons majority – will not have been eased by three new polls released this weekend.One for Opinium carried out on Wednesday – as Cabinet Ministers argued over the deal in a marathon meeting with Mrs May – put the Conservatives at 36 per cent, with Labour leapfrogging them to reach 39 per cent.Just a month earlier, Opinium had the Tories on 41 per cent and Labour on 37. Ukip have risen two points to 8 per cent, while the anti-Brexit Liberal Democrats have dropped one point to 7 per cent, in a sign few voters are agitating to overturn the referendum result.Another poll published last night, carried out by Panelbase, put the Tories and Labour neck-and-neck on 40 per cent each.A third poll, carried out by ComRes on Wednesday and Thursday, had the Tories dropping three points to 36 per cent, with Labour remaining on 40 per cent.Nervous Tory MPs will recall that they were enjoying a 20-point lead over Jeremy Corbyn’s Labour party at the start of the ill-fated 2017 Election campaign. \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}