{"id": "PSG's Neymar shows off singing talent following Real Madrid starlet Vinicius Junior's attempt", "paragraph": "By\n\nKate Mcgreavy For Mailonline\n\nPublished:\n  19:54 EST, 30 October 2018\n\n | \nUpdated:\n  13:48 EST, 31 October 2018\n\n           1View  commentsParis Saint-Germain's Neymar showed off his singing talent following Vinicius Junior's attempt.The Brazilian forward posted two videos of himself singing Atrasadinha by Felipe Araujo on to his Instagram story and referred to Vinicius Jr.The Real Madrid starlet had put a video of himself singing the song at the beginning of October on to the social media platform, but he appeared to remove it.Paris Saint-Germain's Neymar showed off his singing talent on his Instagram story on TuesdayThe Brazilian forward posted two videos of himself singing Atrasadinha by Felipe AraujoNeymar seemed to be enjoying himself  as he sang song alongside PSG team-mate MarquinhosOn Tuesday, alongside several laughing crying emojis, Neymar wrote: 'Challenge of @viniciusjunior, I have tried to copy you.' Neymar seemed to be enjoying himself trying to imitate Vinicius Jr's rendition in both clips.The 26-year-old forward managed to get PSG team-mate Marquinhos involved in the second video. PQP!!!! Apareceu um que CANTA PIOR QUE NEYMAR 🙀🙀😢😢😭😭 VAI JOGAR @viniciusjunior 🙏🙏🙏🙏🙏🙏🙏🙏A post shared by  David Brazil (@davidbrazil) on Oct 3, 2018 at 9:07am PDTVinicius Jr shared Neymar's story and responded to him by playing the song but did not sing. The caption read: 'Not today @casemiro @neymarjr'. Neymar has scored 11 goals in 13 appearances for the Ligue 1 side so far this season while Vinicius Jr has played just twice in La Liga for Madrid.The 18-year-old may be involved more under caretaker manager Santiago Solari.Solari said on Tuesday: 'Will Vinicius play more? He is another player in the first-team squad, just like the rest.' Vinicius Jr responded by playing song - the caption read: 'Not today @casemiro @neymarjr'Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}