{"id": "Ariel Winter flashes her toned abs in black halter top and ripped leggings alongside Levi Meaden", "paragraph": "By\n\nDailymail.com Reporter\n\nPublished:\n  19:58 EST, 20 October 2018\n\n | \nUpdated:\n  01:15 EST, 21 October 2018\n\n          18View  commentsShe's never shy to flaunt her famous physique.And Ariel Winter proved on trend as she showcased her genetically blessed figure in Los Angeles on Saturday.The 20-year-old Modern Family star flashed her taur tummy in a black halter top and ripped leggings as she was joined by boyfriend Levi Meaden.Stunner: Ariel Winter, 20, showcased her genetically blessed figure in Los Angeles on SaturdayDaring to impress, the young beauty looked every inch the small screen siren as she sauntered around in the skimpy top and form fitting pants. Meanwhile, Ariel and Levi unveiled their new family member - puppy Cleo - on Instagram last week.'Last weekend we attended @americanhumane’s @herodogawards,' she wrote. 'It was a very special night for us not only because we were invited (and I got to present an award to an amazing human-pet duo), but because we also adopted our new baby girl Cleo who was rescued from Louisiana. 'We’re so in love with this tiny addition to our now family of 6!' she added.Fabulous figure: The Modern Family star flashed her taur tummy in a black halter top and ripped leggings as she was joined by boyfriend Levi Meaden'We are so honored to be able to support and help American Humane. October is #adoptadogmonth so please consider adopting from your local shelter as there are so many beautiful dogs waiting to love and be loved.'Besides rescuing dogs, Ariel recently opened up about what else the loved up couple like to do in the downtime. The hard-working actress opened up about what she likes to do in her downtime during an interview with Composure Magazine out this month.'I’m such a grandma these days!,' she joked.Impressive: Daring to impress, the young beauty looked every inch the small screen siren as she sauntered around in the skimpy top and form fitting pants'My friends all call me squad mom. I probably call my dad, Glenn (coolest dad ever), at least once a day to see if he wants to come over for dinner or go to the bowling alley. I’m a big fan of poker, so whenever I can I try to set up a game. I’ve started cooking, so I love preparing dinner, and I’m addicted to escape rooms. 'We’ve done almost every one of them in LA. I’m also absolutely OBSESSED with my fur kids, so the majority of my free time goes to lying on the couch with the dogs and my boyfriend while we watch The X-Files. 'I try and get to the gym or do boxing whenever I can to stay healthy. In addition to all of that, spending time with my nieces and god-kids is something I try to do as often as I can. They are my whole world!' Saved: 'We also adopted our new baby girl Cleo who was rescued from Louisiana,' she wrote Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}