{"id": "Kim Kardashian shares adorable shot of ten-month-old 'twin' daughter Chicago West ", "paragraph": "By\n\nAnnita Katee For Dailymail.com\n\nPublished:\n  18:19 EST, 17 November 2018\n\n | \nUpdated:\n  18:21 EST, 17 November 2018\n\n         152View  comments She's previously referred to her third child, daughter Chicago West, as her 'twin'.And Kim Kardashian couldn't help but share an adorable video with her ten month old on Saturday.Taking to Instagram Stories, the 38-year-old was seen carrying her daughter and added a butterfly filter to her look.  Mini-me: Kim Kardashian shared an adorable clip of her ten-month-old daughter Chicago West on SaturdayChicago was dressed in a white tie-up top and had her hair tied into tiny space buns. Kim's post comes after she recently revealed on Ashley Graham's Pretty Big Deal podcast that the bub was her 'twin' while describing her as 'such a doll'. Chicago 'looks like, honestly, my twin mixed with Saint. It's like the two of use in her.' Adorable: Chicago was dressed in a white tie-up top and had her hair tied into tiny space bunsThe latest Kardashian-West addition comes as Kim and Kanye welcomed her via a surrogate. Speaking about their choice of having another woman carry their child, the KKW Beauty entrepreneur confessed she was nervous. 'I think I was so nervous to have a surrogate and to have that connection that God was like, \"I'm going to make her look just like you,' she said. Special gift: The latest Kardashian-West addition comes as Kim and Kanye welcomed her via a surrogateHer twin: 'I think I was so nervous to have a surrogate and to have that connection that God was like, \"I'm going to make her look just like you,' she said'I'm happy I was able to carry my first two. I physically can't do it anymore, or it's too much of a health risk for me.'Kim, who's also the mother to North, five, and Saint, two, suffered from placenta accreta in both her pregnancies. 'I think it was the best decision I eve made. I think it was such an amazing experience. I would recommend it for anyone,' she continued.  Family: Kim, who's also the mother to North, five, and Saint, two, suffered from placenta accreta in both her pregnanciesCousins: Kim welcomed daughter Chicago (R)  just two weeks before her youngest sister Kylie Jenner delivered her baby Stormi (L) 'All my fears of everything that I thought was gonna happen, like am I gonna connect? Am I going to feel connected? All of that goes out the door and you just feel instantly connected.'  'Seeing Kylie [Jenner] and Khloe with their big bellies... I don't miss it,' Kim added.'There was a moment where I said, \"Oh, damn, I wish I was doing this with them\". Like I wish we had our sister photo shoot altogether.' Baby on board: 'Seeing Kylie [Jenner] and Khloe with their big bellies... I don't miss it,' Kim added\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}