{"id": "notebook: Bell-Steelers saga could end soon", "paragraph": "By\n\nReuters\n\nPublished:\n  18:58 EST, 4 November 2018\n\n | \nUpdated:\n  18:58 EST, 4 November 2018\n\nThe Pittsburgh Steelers-Le'Veon Bell drama is heading toward a conclusion.According to multiple reports Sunday morning, representatives for the holdout Bell haven't told the Steelers when, or if, the disgruntled running back will show up this season. But the Steelers don't have long to wait to learn of his decision.The team slapped the franchise tag on Bell, which would have paid him $14.5 million this season, but he hasn't signed the contract. He has until the Tuesday after Week 10 -- Nov. 13 -- to sign it in order to play this year. If he doesn't sign, he must sit out the season under terms of the collective bargaining agreement.Later Sunday, ESPN's Adam Schefter reported the Steelers could choose to use the transition tag on Bell after the season, which means Pittsburgh could have a chance to match any offer sheet Bell might receive. And Schefter said the transition tag would pay Bell between $9 million and $10 million, a big cut from the $14.5 million he could have earned this season.--Two of the NFL's best wide receivers entered Week 9 riding two of the league's most talked-about streaks. They both came to an end on the same day.Minnesota's Adam Thielen, the NFL leader in receptions and yards, matched an NFL record by reaching 100 yards receiving in each of the first eight games this season. But Detroit held him to only 22 yards on four receptions -- though he did score a touchdown in the Vikings' 24-9 victory.Atlanta's Julio Jones had 53 catches and 812 yards through seven games this season, but no touchdowns. In fact, the last time Jones did catch a regular-season touchdown was nearly one full year ago. But with 3:45 left to play against Washington, Jones hauled in a 35-yard pass from Matt Ryan for a score to put the cap on a 38-14 Falcons win.--According to a report by NFL.com's Ian Rapoport, \"it would be a major surprise\" if San Francisco 49ers head coach Kyle Shanahan does not name Nick Mullens his starting quarterback for next Monday against the New York Giants.Shanahan said late last week he would take the weekend to decide whether to go with Mullens again or go back to second-year quarterback C.J. Beathard, if Beathard were healthy enough to play.Mullens completed 16 of 22 passes for 261 yards and three touchdowns in a 34-3 win over the Oakland Raiders on Thursday, one of the best debuts by a quarterback in NFL history. His 151.9 passer rating was a record for a player making his NFL debut.-- Oklahoma coach Lincoln Riley, NFL offensive coordinators Josh McDaniels and John DeFilippo, and even Green Bay head coach Mike McCarthy headline the list that Cleveland general manager John Dorsey likely will consider for his team's next head coach after firing Hue Jackson last week, according to a report by Rapoport.The benefit to Riley would be his relationship with quarterback Baker Mayfield, taken by the Browns this year with the No. 1 overall pick in the NFL draft. They spent three years together with the Sooners, and Mayfield won the Heisman Trophy in 2017 in Riley's first year as head coach.McDaniels, who accepted the Indianapolis Colts job in the offseason but backed out to remain in New England, was born in the Cleveland suburb of Barberton and grew up in the area. The 42-year-old coached the Denver Broncos in 2009 and in part of the 2010 season until his firing. He has an 11-17 record as an NFL head coach.--Jameis Winston's benching is all about the rest of this season and has nothing to do with Tampa Bay's concerns about the quarterbacks' $20.9 million option, according to a report.The Buccaneers picked up Winston's fifth-year option in April, but the salary of that fifth season is guaranteed only for injury. Hence the speculation that the Bucs could be sitting Winston out to avoid the risk of him suffering an injury that could trigger the guarantee.But according to Schefter, team sources say that concern is not the reason Winston lost his starting job to Ryan Fitzpatrick. Winston was benched after throwing four interceptions last week, and Fitzpatrick was named the starter for Sunday's game in Carolina.--Less than a day after quarterback Sam Bradford was released by the Arizona Cardinals, ESPN reported several teams are likely to show interest in the 30-year-old now that they will not assume his existing contract after he clears waivers.Bradford, a former Heisman Trophy winner and No. 1 draft pick with the then-St. Louis Rams, was signed to be the starting quarterback in March. He lost the job to rookie first-round pick Josh Rosen. Bradford received a $10 million signing bonus. He earned $2.5 million in base salary and $1 million in playing-time bonuses for a total of $13.5 million in 2018.In 83 career starts, Bradford's teams have posted a record of 34-48-1. He has passed for 19,449 yards, 103 touchdowns and 61 interceptions.--Veteran Miami safety Reshad Jones pulled himself out of the game against the New York Jets, but coach Adam Gase said after the game he didn't know why.\"I'll probably learn a little bit more tonight and try to figure out what's going on,\" Gase said.Jones removed himself after two defensive series in the Dolphins' 13-6 win. He was replaced by rookie first-round pick Minkah Fitzpatrick, who had started at cornerback and slid to safety. Jones did not return and was seen engaged in a number of animated conversations on the sideline, according to multiple reports. He was seen limping on the sideline, but there was no report from the team that he had sustained an injury.--Field Level MediaSorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}