{"id": "'Some coaches have the gift of the gab but I just tell you how it is', says Steven Gerrard", "paragraph": "By\n\nStephen Mcgowan For The Scottish Daily Mail\n\nPublished:\n  19:42 EST, 24 October 2018\n\n | \nUpdated:\n  19:42 EST, 24 October 2018\n\n           4View  commentsThe turmoil at Spartak Moscow, like most turmoil these days, began with a rumpus on social media.Massimo Carrera knew his job was in jeopardy when his own captain Denis Glushakov and defender Andrey Yeshchenko 'liked' a poem criticising him on Instagram.After axeing both players from last month's Europa League defeat to Rapid Vienna, it was ultimately Carrera who got the chop on what has become the new battleground for modern coaches.Steven Gerrard and assistant Gary McAllister enjoy  training on Wednesday morningThe entire coaching staff could be seen laughing as the players warmed up for the sessionNewspapers no longer pay thousands to hear about a striker's heartbreak at being dropped. Disgruntled playmakers don't express their frustrations from under a table in The Dog and Duck on a Friday afternoon anymore. When a team slide down the league now, player disaffection is expressed via the aforementioned Instagram or Twitter.Carrera's fate was inevitable as Spartak plummeted to sixth in the Russian Premier League. Having become the latest victim of Russian cyber warfare, the Italian was sacked on Monday.Steven Gerrard has yet to experience the new frontier in dressing-room dissent, but it's early days.Asked by a Russian journalist  how he might have reacted to the slight which so incensed Carrera, the former England captain offered a rueful smile.'How would I react? Well, my door at the training ground is open every day for the players to come in and criticise me. As long as that criticism is constructive, I would be fine.The Rangers boss cut a relaxed figure during his pre-match press conference as well'I don't think it is a wise move to go on social media and criticise your boss, whether that is in football or any other job out there on the planet. I think you need to show your boss respect.' If the media platform players choose to voice their unhappiness has changed, the need for a manager to command respect never has.In the era of xG analytics and tactical transitions, a dressing-room presence tends to be underplayed now. To brand a coach 'old school' is to paint them as a dinosaur who eschews sports science and date in favour of an old-fashioned rocket up the rear end.Yet when former Rangers No 2 Archie Knox suggested that Gerrard has an air of 'old school' in his direct, uncomplicated approach to setting down his standards and demands, it was neither intended as an insult - nor taken taken as one.'Football doesn't change,' explained the current Rangers boss. 'It's exactly the same as it was 100 years ago. I'm telling these players now what I got told in 1999 by Gerard Houllier and Rafa Benitez.'It doesn't change, winning teams have the same principles, the same tempo, desire, commitment, it's all the same.Rangers players wrapped up warm as they got ready for training on a brisk morningGerrard kept a close eye on proceedings as he looks for another impressive European display'Some coaches try to over-complicate things, they've got the gift of the gab and the silver tongue, but I haven't.'I just tell you how it is, I tell my team how it is and what's expected at this club, and we will go into these tests and give it a go.'I'm not going to stand here and try to change the game of football, it's been going on long before I was created.' Journalists can vouch for Gerrard's refreshing bluntness. There is no blinding people with science. No attempt to portray football as a complicated game only understood by keepers of the game's great secrets. Gerrard performed at a level higher than most, yet prefers to keep things straight and simple.'I have listened to certain people throughout my career and they just talked b******s,' he said, while naming no names.'They did. They are about, they are in the game, the game is littered with a lot of them.But it was not all smiles and Gerrard's frustration did show at times during the morning'I'm not standing here saying sports science is not important, but the eyes don't lie more often than not.'I don't complicate it. I just say the same things that Walter Smith said or Graeme Souness did. I bet if you compared the three team talks, there wouldn't be many differences.' It's a quarter of a century since Smith came to within a whisker of leading Rangers to the Champions League final after going ten games unbeaten in European competition in one season.And that proud sequence could be broken with a positive result over Spartak this evening.There's no comparison between the two feats, of course. Rangers beat English champions Leeds United home and away and drew twice with Marseille - the eventual discredited winners.Nevertheless, victory would give the current Ibrox side a stranglehold on their Europa League group. That Spartak have become the second successive European opponent - after Rapid Vienna - to sack their coach days before travelling to Govan does no harm either.But he looked pleased with the players' efforts on the whole ahead of the big gameSpartak's 3-2 home defeat to Arsenal Tula last Sunday left them seven points behind league leaders Zenit St Petersburg. Spanish fitness coach Raul Riancho, who speaks little or no Russian, will be in interim charge on Thursday.'It's slightly different to the situation with Rapid, as Spartak have made a promotion from within,' noted Gerrard.'The last time it was an entirely new manager, so we were expecting a different philosophy and an entirely different way of playing.'When you promote from within, you normally wouldn't make such drastic changes. Of course, it's very difficult to predict how they will approach it and, indeed, the outcome of the match.'In terms of us, it doesn't change anything.'We are at home, we have a game plan and, whether they have changed the manager or not, it doesn't impact on what we want to do.' Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}