{"id": "Angry Tory MPs tell the Queen that John Bercow cut short their birthday tributes to Prince Charles", "paragraph": "By\n\nBrendan Carlin for The Mail on Sunday\n\nPublished:\n  18:55 EST, 17 November 2018\n\n | \nUpdated:\n  20:21 EST, 17 November 2018\n\n           1View  commentsJohn Bercow was at the centre of a ‘respect for the Royal Family’ row last night after being accused of cutting short Commons’ tributes to Prince Charles on his 70th birthday.Tory MPs were said to be so annoyed that they insisted on protesting to Her Majesty personally about the Speaker’s behaviour.Tory Whip Andrew Stephenson, who each day writes a so-called ‘Dear Queen’ private report to the Monarch on Commons’ proceedings, included the complaint in that day’s letter, sources said.The extraordinary row erupted after Mr Bercow, far left, chaired Wednesday’s Commons tributes on Charles’s milestone birthday. The 41-minute session included glowing praise from Theresa May and Jeremy Corbyn – who revealed he planned to give the heir to the throne a jar of jam from his allotmentThe extraordinary row erupted after Mr Bercow chaired Wednesday’s Commons tributes on Charles’s milestone birthday.The 41-minute session included glowing praise from Theresa May and Jeremy Corbyn – who revealed he planned to give the heir to the throne a jar of jam from his allotment.But Mr Bercow has been accused of not giving enough time for other MPs to deliver their tributes.At one point during the session, he appeared to tell MPs time was short by rebuking some of them for not saying in advance they wanted to take part and reminding them there was legislation to discuss later on.John Bercow, right, applauds with Queen Maxima of the Netherlands after King Willem-Alexander of the Netherlands addressed parliamentarians last monthMr Bercow said: ‘It seems rather curious for an MP not to have put in to speak but suddenly to bob [indicating they wanted to speak]. It is simply not in conformity with our procedures, and we have a Second Reading of a Bill.’The Speaker then hurried up Somerset Tory MP Rebecca Pow, who was brought up on a farm owned by Prince Charles, telling her to speak ‘very briefly please’ as she prepared to make her tribute.But later, Mr Stephenson – whose official title is Vice-Chamberlain of Her Majesty’s Household – is understood to have complained about the Speaker in a letter.This is collected by a messenger each evening, taken to Buckingham Palace and apparently read by the Queen before dinner.A well-placed Tory source said: ‘Her Majesty has been kept fully informed of what’s happened in the Commons Chamber with respect to that particular debate.‘I’m sure the Speaker meant no disrespect to the Royal Family but a number of people had wanted to speak and in a debate like that, he should have exercised some discretion.’Mr Stephenson could not be reached for comment last night.Former Labour MP Janet Anderson, who served as Vice-Chamberlain in 1997-98, lifted the lid on the normally secret communications in her Dear Queen book two years ago. Last night she said: ‘It’s supposed to be a private letter between you and Her Majesty, and Mr Stephenson can really put what he likes in it.John Bercow, far left, was at the centre of a ‘respect for the Royal Family’ row last night after being accused of cutting short Commons’ tributes to Prince Charles on his 70th birthday ‘There’s a special messenger waiting at 6pm to take it across to Buckingham Palace.‘And the Queen reads it each evening before dinner.‘Tony Blair told me once that the Queen loved my letters. I said, “That’s because I used to give her all the gossip”.’Ironically, one of Mrs Anderson’s letters referred to Mr Bercow when he was simply a Tory backbencher as a ‘tiresome little man’.Last night, Mr Bercow denied cutting short the session devoted to marking Prince Charles’s birthday. His spokeswoman pointed out that the day after, he went to the Prince’s Clarence House residence to deliver formally the Commons’ tributes.She said: ‘It is not true the debate was cut short.‘Everybody who wanted to speak was able to do so.‘The Speaker was able to offer His Royal Highness his own birthday wishes the following day when he joined a celebration at Clarence House with the Prime Minister and leader of the Opposition.’A spokesman for the Palace declined to comment last night.\n\t    Share what you think\n          No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards.\n      \nBy posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}