{"id": "Amanda Holden looks in high spirits as she reunites with Cutting It co-star Angela Griffin", "paragraph": "By\n\nMailOnline Reporter\n\nPublished:\n  19:53 EST, 30 October 2018\n\n | \nUpdated:\n  10:08 EST, 31 October 2018\n\n          20View  commentsThey starred alongside each other in the BBC drama Cutting It in the early noughties.And 13 years later Amanda Holden and Angela Griffin reunited as the pair attended fellow actress Lisa Faulkner's Guest Chef Supper Club at J Sheekey Atlantic Bar on Tuesday.The Britain's Got Talent judge, 47, proudly flaunted her toned physique in a trendy checkered dress.Fun times: Cutting It stars Amanda Holden and Angela Griffin have been reunited as the pair attended fellow actress Lisa Faulkner's Guest Chef Supper Club at J Sheekey Atlantic Bar The black and white ensemble showcased her enviably-lean legs with an elegant side split.She styled her blonde hair in a sleek middle-parting and highlighted her age-defying beauty with make-up in neutral tones.Letting her statement dress do all the talking, Holden added height with a classic pair of black court heels.Cutting It: The pair were in the drama series about two rival hairdressers in Manchester, which ran for four series between 2002 and 2005Stunner: The Britain's Got Talent judge, 47, proudly flaunted every inch of her toned physique in a trendy checkered dressWow! The black and white ensemble showcased her enviably-lean legs with an elegant side split as she posed with Angela as well as Nicola Stephenson (M)\n\n\n\n\n\nMonse asymmetric gingham crepe midi dress at NET-A-PORTER\nBuy now\nGingham is often though to be a summer-only style but, paired with a leather biker jacket and suede court heels, Amanda Holden proved this is a trend that can be rocked year-round. The TV star looked sensational as she stepped out for a date night with her husband, Chris. Wearing a asymmetric check dress from Monse and a diamond ring from QVC UK, she getup was beyond glamorous. We love her unique dress. With a cutout shoulder design and a high-low skirt, we've never seen anything like it before. Love Amanda's dress as much as we do? You're in luck - the dress can still be shopped at NET-A-PORTER. Just click right.Alternatively, you can shop the look for less with our roundup of affordable alternatives below. With picks from the likes of NA-KD, Reclaimed Vintage and Baukjen, this is a celebrity style which doesn't have to break the bank.3.1 Phillip Lim gingham dress at Harrods\nBuy now\nNA-KD gingham dress (reduced at £5.68)\nBuy now\nReclaimed Vintage  gingham frill dress at ASOS (Reduced at £29)\nBuy now\nBaukjen 'emi' dress at Next\nBuy now\nHer former co-star, Angela, 42, went for a similarly stylish black and white dress for the occasion.She added a pop of colour to her sophisticated attire with gorgeous plum heels and a vibrant lipstick. Cutting It was a drama series about two rival hairdressers in Manchester, which ran for four series between 2002 and 2005. Pals: Amanda posed with (L-R) Kate Thornton, Nicola Stephenson, Lisa Faulkner and Angela Griffin whilst she styled her blonde hair in a sleek middle-partingFriends: Letting her statement dress do all the talking, Holden added height with a classic pair of black court heelsMeanwhile, Amanda  recently laid bare the heartbreaking details of her stillborn son Theo.The TV judge fought back the tears when she re accounted the harrowing day she lost her baby while she spoke on ITV's This Morning.    She explained: 'There was no reason for Theo’s stillbirth and so I was partly relieved, because I thought, \"Good, we can have another baby.\" 'Part of me was like, \"Oh god, what have I done? Is it something I have done? Was it because I ate those McDonald’s fries the day before?\"'Painful: Amanda recently laid bare the heartbreaking details of her stillborn son TheoPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}