{"id": "Kanye West says he´s `been used´ and distances himself...", "paragraph": "By\n\nPress Association\n\nPublished:\n  19:44 EST, 30 October 2018\n\n | \nUpdated:\n  19:44 EST, 30 October 2018\n\nKanye West has announced he is distancing himself from politics after being used to “spread messages [he] don’t believe in”.In a series of tweets on Tuesday, West said his eyes are now “wide open” and he will focus on his creativity.The 49-year-old rapper met US President Donald Trump at the White House earlier this month, to discuss subjects including criminal justice reform, jobs and gang violence in West’s home town of Chicago.West wore a Make America Great Again cap as he spoke to President Trump in front of reporters in the Oval Office on October 11.My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!To his 28.7 million followers, West tweeted: “I support creating jobs and opportunities for people who need them the most, I support prison reform, I support common-sense gun laws that will make our world safer.“I support those who risk their lives to serve and protect us and I support holding people who misuse their power accountable. I believe in love and compassion for people seeking asylum and parents who are fighting to protect their children from violence and war.”Kanye West has said he is distancing himself from politics (Jonathan Brady/PA)West referred to the conservative commentator Candace Owens, who said that he had designed clothing for her campaign Blexit, encouraging black Americans to quit the Democratic party.“I introduced Candace to the person who made the logo and they didn’t want their name on it so she used mine. I never wanted any association with Blexit. I have nothing to do with it,” West said.“I would like to thank my family, loved ones, and community for supporting my ACTUAL beliefs and my vision for a better world.“My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!”Sorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}