{"id": "Gregor Townsend tells Scotland players to firm up for Fiji test", "paragraph": "By\n\nJohn Greechan For The Scottish Daily Mail\n\nPublished:\n  18:52 EST, 4 November 2018\n\n | \nUpdated:\n  18:52 EST, 4 November 2018\n\n           2View  commentsGregor Townsend has warned his Scotland players to expect a genuine world-class threat from flying Fiji.And he stressed the need for a combination of fight and finesse to subdue rugby's answer to the footballing magicians of Brazil.Townsend believes that the side-stepping South Pacific stars have specifically targeted Saturday's match at Murrayfield as a chance to deliver a statement victory.Gregor Townsend has told his Scotland players to be wary of the threat Fiji will poseThe Scots were left bruised and beaten as they surrendered the Doddie Weir Cup at the first time of asking on Saturday, slipping to an error-strewn 21-10 defeat to Wales in Cardiff.Townsend, who will welcome a number of high-profile exiles back into the fold for Scotland's first fully IRB-sanctioned test of the autumn, is adamant that his team can't play fast and loose in pursuit of a morale-boosting victory this weekend.'We've got to be accurate,' said the Scotland head coach. 'That will be the No 1 thing, accuracy.'Fiji score the most tries - of any team in the world - off turnover ball.'It's a frightening amount, 66 per cent. Most teams are under 15 or ten per cent.Townsend understands that his side will have a tough time against Fiji on Saturday afternoon'They're so good off turnover ball. If we give them that, it will be a tough afternoon for us.'They also have excellent individuals who don't require turnover ball, they just require any ball.'Their set-piece is much improved, they've got a very good front five now.'But that will be the big driver this week - accuracy in whatever we do.'When it was pointed out that Scotland's star playmakers tend to take chances, Townsend insisted with a nod to the 27-22 loss in Suva in the summer of 2017: 'Yeah, well they'll have to be disciplined and accurate this week.'The other thing we didn't do well, when we played Fiji 18 months ago, was cope with the physicality.'They beat us in the contact area. That was very disappointing that day.'So we've got to make sure we're physical and accurate, play to our strengths, put them under pressure and put them into areas they don't want to go.'They would like it to be as open as possible. So would we. But we've got to make sure it's open for us, not open for them.'Fiji have established themselves at tenth in the world rankings, just four places below Scotland - despite being shut out of the old boys' network that would grant them more regular top-level tests and the money to keep players from being poached by richer nations.Townsend is a huge admirer, declaring: 'I believe they are becoming a major threat. I really believe - and I hope it's not in the next couple of weeks - that they can beat any team in the world on their day. They could have a brilliant World Cup.'I see them as similar to Brazilian football. They have the best natural rugby players.'And they're not just all in the back line. Leone Nakawara was voted the best player in Europe last year.'Peceli Yato is a back row at Clermont - and must be one of the best back row forwards in the world.'And then the back line are all outstanding. I don't think Niko (Matawalu) is in the squad and he scored three tries (for Glasgow) on Friday night, which shows you what kind of strength they have.'We can't take them lightly. It's a huge challenge.' Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}