{"id": "Don't honour CPS chief, say two men wrongly prosecuted for rape", "paragraph": "By\n\nTim Stickings For Mailonline\n\nPublished:\n  19:42 EST, 20 October 2018\n\n | \nUpdated:\n  04:23 EST, 22 October 2018\n\n         157View  commentsTwo young men who had to face the ordeal of a Crown Court trial after they were wrongly accused of rape have called for Britain's chief prosecutor to be denied a New Year's Honour. Alison Saunders, who is stepping down as director of the CPS this month, has come under fire over failures to disclose evidence which led to the collapse of numerous rape cases. However she is still expected to receive a damehood, as all her predecessors reportedly have since 1880. Liam Allan and Samuel Armstrong - who were both put on trial for crimes they had not committed - have urged a break with precedent and slammed Saunders over the CPS's 'devastating failures', the Daily Telegraph reported. Alison Saunders (pictured), who is stepping down as director of public prosecutions, has come under fire over failures to disclose evidence which led to the collapse of numerous rape casesThey said: 'We were wronged by a justice system that was supposed to protect us.'In the botched processes that followed, many of us lost jobs, homes and relationships. 'Such devastating failures cannot be allowed to ever happen again. That's why - as victims - we say that the exception must be made to the 'automatic gong principle' for Alison Saunders.'Mr Allan, 23, was accused of rape spent almost two years on bail ahead of a trial at Croydon Crown Court. It collapsed in December after messages undermining the case were found, with prosecutors later apologising for their errors in not disclosing them earler. A review into the collapsed case found more than 57,000 messages were recovered from the complainant's phone, but only some were served in evidence. Student Mr Allan said at the time: 'Every day is just sort of a different battle, you either wake up and you give up on the day or you wake up and you're ready to sort of face the day.'But from start to finish after I was arrested we had hope because we knew the truth, we knew it wasn't true and you have that hope.'Mr Armstrong, 25, who worked as as senior aide for Conservative MP Craig Mackinlay, was cleared in a trial last year of raping a woman in his boss's Westminster office. He said that crucial evidence had been disclosed to his defence team just eight working days before the trial at Southwark Crown Court. Liam Allan (left) and Samuel Armstrong (right) who were both put on trial accused of crimes they had not committed - have urged a break with precedent and slammed Alison SaundersA committee of MPs found earlier this year that Saunders 'did not sufficiently recognise the extent and seriousness' of failures in the disclosure process.The Justice Commitee said the correct disclosure of evidence by the police and CPS is too often seen as an 'administrative headache'. The CPS said in a statement: 'It's fundamentally untrue to suggest the CPS has ever sought convictions at any cost. 'In fact the conviction rate over the last five years has remained steady despite a more complex caseload and challenging financial climate. '‎The police and CPS apologised to Liam Allan for the investigative and disclosure issues in his case. Samuel Armstrong was acquitted by a jury after trial.'We have worked with police to tackle the long-standing and system wide issues around disclosure. Putting this right is our top priority and a comprehensive programme of work is under way to drive lasting improvements.'Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}