{"id": "Harvey Weinstein's dream team: The defense lawyer and former NYPD detective helping mogul", "paragraph": "By\n\nChris Spargo For Dailymail.com\n\n\nPublished:\n  18:56 EST, 12 November 2018\n\n | \nUpdated:\n  01:15 EST, 13 November 2018\n\n          27View  commentsHarvey Weinstein has already had one of the six criminal charges filed against him dropped by the district attorney's office, and a hearing has been set for next month to dismiss the entire case.This is all the result of emails and texts uncovered by defense attorney Ben Brafman and the dogged work of former NYPD detective Herman Weisberg in learning what was happening behind the scenes in the case.Weisberg has also worked for the Manhattan district attorney. The two men have formed a dream team that now looks capable of doing what was once thought to be impossible - help Harvey Weinstein walk free.Scroll down for video Dynamic duo: Attorney Ben Brafman and private investigator Herman Weisberg have managed to dismantle part of the case against Harvey Weinstein (above in June 5 with Weisberg circled)Stand by your man: Weisberg (circled in July) is a former detective with the NYPD who is now a private investigator and has worked with the Manhattan district attorney's officeEarlier this year, The Daily Mail spoke with Weisberg about his new job as a private investigator.He is known as the 'Mistress Whisperer' to some, a man who is able to talk women into settlement agreements and out of their threats to expose the rich men they are battling in court.Weisberg was clear in that interview however that he does not rely on the immoral and potentially illegal tactics of other investigative agencies.'My job as an investigator is to establish the facts and determine the truth and provide that to counsel so they can effectively defend their clients,' explained Weisberg.There is little much he had to say, which is not much of a surprise given how valued discretion is in his line of work. Brafman is the more chatty of the two, and in that interview explained that his job is a very clear one - to prove that specific incidents do not rise to the level of criminal conduct. 'I am not defending behavior,' explained Brafman. Some of the famous faces whose behavior has not been defended by Brafman in the past include Sean 'P. Diddy' Combs, Jay Z, Michael Jackson, Dominique Strauss-Kahn and Martin Shkreli. In all those cases, with the exception of Shkreli, the men were able to walk free.And Brafman is not afraid to go after women who are not involved in the trial but have accused his client of sexual misconduct, most notably Asia Argento.‘The sheer duplicity of her conduct is extraordinary and should demonstrate to everyone how poorly the allegations against Mr Weinstein were actually vetted and accordingly, cause all of us to pause and allow due process to prevail, not condemnation by fundamental dishonesty,' he said after it was revealed that she had sex with a then-underage Jimmy Bennett.He also alluded to the emails and texts which have since been released between Weinstein and his accusers in the criminal case.'We’re seeing email traffic between him and these women at the time they claim they were assaulted which is substantially inconsistent with that type of relationship and more consistent with a friendly, respectful relationship,' explained Brafman.He also admitted that Weinstein was in a difficult place, but has continued to work.'He’s lost everything: work, reputation, family, wealth and he feels he has been betrayed by a lot of people,' said Brafman. 'But he is standing his ground.'Brafman has in the past defended Sean 'P. Diddy' Combs and Michael JacksonWeinstein did have reason to smile last month in court  after the judge agreed to dismiss a charge of criminal sex act against the disgraced mogul that was related to a 2004 allegation.Lucia Evans claimed she had been forced to perform oral sex on Weinstein while attending a meeting at his office in New York.That claim fell apart however after a friend of Evans who was with her night that she met Weinstein told a detective that her friend had willingly performed a sex act on Weinstein in exchange for a film role.That detective then encouraged the witness to keep quiet and, in the presence of her lawyer, informed her that 'less is more.'He also did not report the information, and is now being investigated for these actions.Evans, who was a college student at the time, claims that she never described the assault to the witness.Weinstein had been facing up to 25 years in prison for that charge of criminal sex act, and this could have far greater repercussions at trial, as the defense could use the dismissal of this charge to cast doubt on the district attorney's case.There was not however any conflicting information about a log maintained by Evans as had been reported by multiple outlets prior to the proceedings on Thursday.The witness also revealed that on the night she and Evans met Weinstein the mogul offered them money to expose their breasts.They did not do this at the time, but she said that Evans later told her she exposed her breasts to Weinstein in a hallway.Evans later disputed this claim. Assistant District Attorney Joan Illuzzi told the court that the prosecution would not object to the dismissal, noting that the defendant is still facing five additional charges.'Upon defendant’s request, Judge Burke today lifted a protective order which previously covered the attached letter sent from ADA Joan Illuzzi to Benjamin Brafman on September 12, 2018, regarding mandatory disclosures under Criminal Procedure Law 240.20 and Brady v. Maryland,' as spokesperson for the Manhattan District Attorney said.'Additionally, in light of the newly-discovered and mandatorily-disclosed information contained within the letter, the Court today – upon defendant’s motion – dismissed Count Six of the indictment, concerning a forcible sexual act against a woman in 2004, while granting leave for the People to re-present Count Six to a Grand Jury.'It was then noted: 'The dismissal of Count Six does not affect the remaining counts of the indictment.'Those remaining counts may be dismissed however in a month, which is when Brafman and Weisberg will learn if they managed to destroy the case it took a year to build before it even gets to trial.   Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}