{"id": "Bucs to start Fitzpatrick again in Week 11", "paragraph": "By\n\nReuters\n\nPublished:\n  18:53 EST, 12 November 2018\n\n | \nUpdated:\n  18:53 EST, 12 November 2018\n\nRyan Fitzpatrick will remain the Tampa Bay Buccaneers' starting quarterback for Week 11 against the New York Giants, head coach Dirk Koetter announced Monday.\"I just think he still gives us the best opportunity right now,\" Koetter said of Fitzpatrick, who topped 400 yards for the fourth time in six starts on Sunday against the Washington Redskins but also threw two interceptions and lost a fumble.When asked how long Fitzpatrick will remain the starter, Koetter replied, \"Until we change... I don't know. A guy could get hurt at any time.\"Asked about the importance of evaluating previous starter Jameis Winston as he approaches his fifth-year option in 2019, Koetter indicated the team is still focused on winning and competing this season.\"I understand that, but we're right in there,\" Koetter said. \"It's just barely past the halfway point in the season and there's a lot of football to be played. I don't think it's out of the realm of possibility that we can turn this thing and get on a little bit of a win streak.\"He also lamented turnovers, which have been an issue with both Fitzpatrick (10) and Winston (11), leaving Tampa Bay with a turnover ratio of minus-19, worst in the NFL by six.Fitzpatrick, who turns 36 on Nov. 24, finished Sunday 29 of 41 for 406 yards, plus the three turnovers.The Bucs became the first team since at least 1940 to gain more than 500 total yards (they had 501) and score fewer than six points. They lost 16-3 to Washington while committing four turnovers, all inside the opponent's 30-yard line.It was Koetter's first game calling plays since early in the season, as offensive coordinator Todd Monken had been handling the job. Koetter said he hasn't made a decision who will call plays against the Giants.Meanwhile, kicker Chandler Catanzaro was released on Monday after missing wide right from 30 yards and 48 yards against Washington.Catanzaro, 27, made 11 of 15 on field-goal attempts in nine games and also missed four extra-point attempts (23 of 27) after joining Tampa Bay on a three-year, $9.75 million deal in the spring.The team has yet to sign a replacement kicker.--Field Level MediaSorry we are not currently accepting comments on this article.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}