{"id": "The DOG accused of a hate crime after fouling outside a home in just one of 2,500 cases probed", "paragraph": "By\n\nJake Hurfurt For The Mail On Sunday\n\nPublished:\n  18:48 EST, 17 November 2018\n\n | \nUpdated:\n  20:39 EST, 17 November 2018\n\n         149View  commentsWe all know it’s irritating, unsightly and unhygienic, but one case of dog fouling has been logged by police as a racist hate crime.The incident is among numerous alleged hate crimes uncovered by The Mail on Sunday that critics say are so petty they are undeserving of police time and expense. Further examples in a list of more than 2,500 alleged ‘hate incidents’ logged by the Metropolitan Police in 2015 and 2016 include:Another canine-related case logged as an alleged hate crime says: ‘Suspect’s dog barking at victim'CANINE CLASH A ‘victim’ complained to police that an unknown dog had fouled an area outside their home and they believed this was a racially motivated incident.ALL EARSA woman put her ear up to her neighbours’ door and heard them talking about trying to get her moved out, which she reported as a race-hate crime.POPPYCOCK?One woman said she felt she had been a victim of hate crime after someone reversed into her car because she was displaying a poppy on the front of it.HATE MAIL Another complainant claimed racial abuse because a letter addressed to him had been opened and resealed before he collected it from the Post Office.Last night, David Davies, Tory MP and former special constable, said the recording of such ‘non-crimes’ was a waste of police time.‘This is part of the reason that police struggle to investigate serious offences such as home burglaries,’ he said. ‘People need to start thinking more carefully before they call the police.’The 2,507 hate incidents are revealed in a 118-page document disclosed under Freedom of Information laws.A description of the dog fouling incident reads: ‘An unknown dog has fouled outside of victim address and victim perceived this to be a racial incident.’ Another canine-related case logged as an alleged hate crime says: ‘Suspect’s dog barking at victim.’On another occasion, a supposed victim of racial abuse reported that he ‘believes a letter addressed to him was opened and then resealed before he had collected it from the Post Office’.Several of the claims were over parking disputes or car crashes. One entry says: ‘Unknown suspect has reversed into victim’s car causing extensive damage. Victim perceives to be a hate crime as she had a poppy in front of her car.’Another man claimed that his neighbours were parking only outside his house and were ‘targeting him due to him being black’. Disputes between neighbours feature prominently. One entry says: ‘Victim on hearing her neighbours in their house has put her ear up to their door to hear what they are talking about. In a conversation they have referred to her as [redacted] and made remarks of trying to get her moved out.’Another reads: ‘Witness has had parking issues with her next-door neighbour, their children apparently throw stones and balls over the garden fence. Witness has recently found a dead rat in garden and perceives this to be racist.’On another occasion, a resident in a block of flats reported that a neighbour was racially abusing them by ‘smoking heavily’.Meanwhile, an angry father called police after his daughter lost a tennis match to complain the defeat was due to a racist umpire. ‘Informant feels his daughter was subjected to racial discrimination at a tennis match where line calls went against her,’ the incident log reads.Other arguments involved unhappy customers in shops, pubs and on public transport.They include one person who felt a bus driver had given them a ‘racist look’ and a woman thrown out of a pub for being ‘drunk, aggressive and erratic’ who told police she had been targeted ‘because she is Polish’.In a separate complaint, a pupil struggling in a swimming lesson reported his teacher for ‘faith-based abuse’ for speaking to him in an ‘abrupt manner’.Current rules mean police have to record any allegation described as motivated by prejudice as a hate incident, even if it is insufficiently serious to be regarded as a crime.And control room staff are required to note down the details even if the informant does not want any action to be taken.Scotland Yard has withdrawn claims it has 900 officers dedicated to investigating alleged hate crimes.Met police chiefs were criticised for bragging about the resources during a surge in London murders.One tweet boasted: ‘We have 900+ specialist officers dedicated to investigating all hate crime.’All references have now been removed after the force admitted that while 900 detectives working with Community Safety and Safeguarding Units in each of London’s boroughs have had hate crime training, they devote most of their time to investigating domestic abuse.It said: ‘We found a number of tweets gave the impression 900 officers were “dedicated” to the investigation of hate crime… This information was incorrect and at the first opportunity was removed.’ \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}