{"id": "'Ireland are now World Cup favourites ... but we are still pretty confident', says Hansen", "paragraph": "By\n\nWill Kelleher For The Mail On Sunday\n\nPublished:\n  18:26 EST, 17 November 2018\n\n | \nUpdated:\n  18:26 EST, 17 November 2018\n\nView  commentsAll Blacks coach Steve Hansen is happy for Ireland to be labelled favourites for the World Cup, having beaten his previously all-conquering side.Ireland won 16-9 in an epic Test match in Dublin, and have now beaten New Zealand twice in two years - the only northern hemisphere side to do that in 15 years.And while Hansen was magnanimous in defeat he said the Irish will now grow in confidence ahead of the global tournament in Japan next year.Ireland edged a low-scoring but thrilling match to secure only their second ever victory'I would like to congratulate Ireland,' he said.'They were outstanding. They took their chances and we didn't take ours.'There is a lot of water to go under the bridge before the World Cup. You will make them favourites, so go ahead. As of now they are the number one team in the world.A smartly executed play sees Jacob Stockdale race over for the first and only try of the game'We are one of the challengers. England, Australia, Wales, South Africa - everyone who goes to the World Cup will be.'But what we do know is that Ireland will go there reasonably confident. And they should, they have a good side. We will too, as we have a good side.. England will say the same thing.'I am very proud of our guys too. You couldn't knock the effort even if the execution was not as good as we would have liked - we got beaten by a better team.New Zealand-born centre Bundee Aki celebrates after helping Ireland make a piece of history'When you get beat it hurts. It is quiet, sombre and people are gutted. It is how it should be when you get beaten.'Hansen was seen passing his adversary Joe Schmidt a parcel before kick-off - and the Kiwi boss revealed it was match tickets.'It was 760 Euros,' he said.'I bought some tickets - he was the only bloke I could buy them from. If you buy them you have to pay for them, so I got that out of the way early.' \n\t    Share what you think\n          No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards.\n      \nBy posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}