{"id": "Cardi B showcases baby Kulture Kirari's 'juicy' legs... after complaining about post-baby belly line", "paragraph": "By\n\nAnnita Katee For Dailymail.com\n\nPublished:\n  19:54 EST, 20 October 2018\n\n | \nUpdated:\n  09:54 EST, 21 October 2018\n\n          24View  commentsShe welcomed her daughter Kulture Kiari back in July and is yet to debut her face. But giving her fans little peaks of her little girl, Cardi B (real name: Belcalis Marlenis Almánzar) took to social media on Saturday to showcase her adorable 'juicy' legs.The 26-year-old first time mom had her baby on her chest and inundated her with kisses and love. Scroll down for video  Chunka! Cardi B showcased baby Kulture Kirari's 'juicy' legs after complaining about her Linea nigra on Saturday'Ture, where you get these juicy legs from huh?,' she questioned, adding: 'Where those juicy legs came from? They're so juicy.' Over the video, Cardi captioned 'CHUNKA'. The Bodak Yellow songstress' video comes after she took to social media on Friday to ask her 34.6 million followers if they had any tips on getting rid of the stomach line she was left with from her pregnancy with Kulture. Looking great! Cardi as dressed in a black and white tracksuit that showcased her incredible abs just three months after delivering her daughterDotting mom: 'Ture, where you get these juicy legs from huh?,' she questioned, adding:'Where those juicy legs came from? They're so juicy''Ladies how do you guys get rid of the black line in the middle of your stomach after giving birth?? cause b**ch,' she captioned. Cardi as dressed in a black and white tracksuit that showcased her incredible abs just three months after delivering her daughter.  The rapper's fans stepped in to help with her inquiry, telling her that the line - known as linea nigra or a pregnancy line - goes away on its own.Keeping her private: She welcomed her daughter Kulture Kiari back in July and is yet to debut her face'It took me about a year with all 3 of my kids to finally fade away,' wrote cheri_baby83.Linea nigra typically disappears within a few months after delivery.Cardi gave birth to Kulture Kiari on July 10 and parents her alongside the baby's father and her husband Offset (real name: Kiari Kendrell Cephus)  New parents: Cardi gave birth to Kulture Kiari on July 10 and parents her alongside the baby's father and her husband Offset (real name: Kiari Kendrell CephusPublished by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}