{"id": "Claudio Ranieri reveals he only feels the pressure when he is unemployed because he loves football", "paragraph": "By\n\nJames Sharpe For Mail Online\n\nPublished:\n  18:27 EST, 17 November 2018\n\n | \nUpdated:\n  18:27 EST, 17 November 2018\n\nView  commentsTwo weeks ago, Claudio Ranieri was enjoying trips to the theatre with his wife Rosanna and taking his young grandson Orlando on days out to Legoland Windsor.Quality family time for a 67-year-old man unburdened by the stresses and strains of management. The Italian was without a job, having left Nantes after just one season in charge. A campaign that had started well but ended in conflict.On these shores, though, Ranieri is still a man with the legacy of a miracle worker. Regardless of how prematurely it may have ended at Leicester City, Ranieri is remembered as the hero who led them to their fairytale Premier League title. Who could blame him for sticking with that ending?Claudio Ranieri has admitted that he feels the pressure when he is out of a job not in oneYet here he was, a fortnight later, at his first press conference as Fulham manager, having replaced sacked predecessor Slavisa Jokanovic at a club rooted to the foot of the table and haemorrhaging goals at an unprecedented rate.Why do it? Why risk tarnishing the story with another chapter? To keep Fulham afloat would not be as monumental a feat as winning the title with Leicester but it's a hell of an ask. Leicester were 5,000-1 to win the league. Fulham are odds-on to go down.'I love football,\" was the answer, as Ranieri put two fingers to his temple in the shape of a gun. 'Without football I am without my life.The 67-year-old won the league with Leicester City when there had 5000-1 odds to do it'A lot of you sometimes tell me about there being lots of pressure. \"Are you nervous?\" Yes, when I am without a job. Then I am nervous. Then I am under pressure.'My wife tells me \"Claudio, take a holiday.\" But without a job, I am anxious. When I have a job, I am calm.' It was as though he had never been away. Like the favourite band, back together on one final reunion tour, Ranieri enamoured his audience with hits from the old songbook. Out came the classics. There were 'dilly-dings', 'slowly-slowys', answers in English, French and Italian. It's not pizza for a clean sheet anymore, though. Now, it's a trip to McDonalds. Fulham are the only Premier League team yet to keep one. They must be hungry.Fulham's chairman Shahid Khan will hope Ranieri enjoyed plenty of practice at Legoland. He's got a serious building job on his hands now. The blocks did not come cheap, either. A £100million summer spend and nothing but five points to show for it from 12 games.Ranieri replaced Slavisa Jokanovic who was sacked by Fulham after a 2-0 defeat to LiverpoolRanieri must - somehow - tighten Fulham up at the back while also getting the best out of Aleksandar Mitrovic. All of them, says Ranieri, need his \"fighting spirit\". He played down questions of loaning some of his old title-winners from Leicester in January.\"For me now, it is important to give them my best and try to do with the players the ambition to be safe at the end of the season,\" said Ranieri.\"I have said I don't look behind me. The fairytale, forget it. But in my shoulders, in my mind, there is all my career and I give to my players all my career. My knowledge I will give them. Everything. And I hope they can take my ambition. I am an ambitious man. I hope to stay here a long time.\"The Cottagers have only five points this season and are yet to keep a clean sheet\"For me now, it is important to give them my best and try to do with the players the ambition to be safe at the end of the season,\" said Ranieri.\"I have said I don't look behind me. The fairytale, forget it. But in my shoulders, in my mind, there is all my career and I give to my players all my career. My knowledge I will give them. Everything. And I hope they can take my ambition. I am an ambitious man. I hope to stay here a long time.\"Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group"}