{"id": "Cowboys' issues can be fixed after firing of O-line coach", "paragraph": "\nThe Cowboys took advantage of the bye week by creating a couple of high-profile moves.First, Dallas traded a first-round pick for wide receiver Amari Cooper.Then, the Cowboys fired offensive line coach Paul Alexander.Alexander's firing was somewhat startling considering just two seasons ago the Cowboys were honored for having the league's best offensive line. Tyron Smith, Ronald Leary, Travis Frederick, Zack Martin and Doug Free once comprised the NFL's top front five, and cleared paths for Ezekiel Elliott to rush to rookie stardom. The Cowboys were one of the league's darlings, seemingly destined for postseason glory until they were upset at home by the Packers in the Divisional Round.Dallas is now retooling, starting with its staff. The Cowboys now trot out a group that is 60 percent different, with rookie Connor Williams taking over for the departed Leary, Joe Looney replacing center Travis Frederick (who's out indefinitely while he recovers from Guillain-Barre Syndrome) and La'el Collins replacing the since-retired Free.They've struggled to regain their 2016 and 2017 form. Let's go behind the offensive line to figure out what's going wrong with Big D's front five by looking closely at its last three games.Against Houston, Dallas frankly looked to be the weaker fighter in the ring. The Texans frequently won the surge battle up front and found great success with two-man stunts, from the very first play.\nThe stunt-heavy Texans benefited from the quickness and power of both Jadeveon Clowney and J.J. Watt all night, with Clowney beating tackles with stutter steps and Watt off the line with explosion, blowing up plays if not recording tackles as well. The two caused problems for Dallas all night as part of a hyper-aggressive Texans defense that was the stronger unit.The Cowboys also show an obvious weakness against the better speed rushers coming from wide alignments. Houston presents a massive challenge in this department with Watt and Clowney, which was evident throughout their Week 5 contest.Reach blocks on zone runs also have been a problem for the Cowboys as of late, bringing some sense to the Alexander firing decision. Dallas frequently doesn't win the battle to the outside, whether it's against stunts or just a straight up rush, and there isn't a specific lineman exhibiting these issues -- it's all of them.There's a lack of cohesion with passing off-rushers, too -- perhaps a lack of trust -- among Dallas' linemen. Occasionally, they do a good job. Here, Elliott and Looney pass off twisting blitzers well, more as a result of running into each other than great vision, but it still worked.\nA week later, Smith is a beat slow in passing Jacksonville Jaguars defensive end Calais Campbell off to rookie guard Connor Williams, resulting in pressure in the face of Dak Prescott and an incompletion via a batted ball at the line of scrimmage.\nThe Cowboys like to pull multiple linemen in a variety of scenarios, predominantly on run-pass options and also on traditional runs. They're never crushing, but sometimes they work well enough, like on this 20-yard run by Elliott.\nZack Martin pulls wide and engages Jalen Ramsey, creating an outside wall to an alley, with Williams doing enough to shield Dante Fowler from Elliott. It's enough of an opening for the star back to race through to the outside for a nice gain.The Houston game demonstrated early on that the Cowboys need better blocking from their tight ends because of how involved both Geoff Swaim and Blake Jarwin are in the offense. They also need a higher level of play from two-thirds of their interior linemen: Looney and Williams.Williams continues to adjust to the pro game on the fly, getting stuck on the inside stunt man at times but also shows an encouraging ability to adjust mid-play. Take this inside run, a play during which Clowney reads and reacts by wrapping inside. Williams manages to catch Clowney darting to the inside and hooks enough of him to keep Clowney from getting to Elliott, who bounces it outside for a gain of 14.\nThere are also plays that show how much Williams needs to improve when stacked up against the speed of the NFL. On this play, he pulls from the backside, but fails to identify a target in time (likely looking more inside than out), missing the defender who nearly tackles Elliott in the backfield and falling out of a decent base, which makes him all but useless on a play that very well could have finished in the end zone. It wasn't catastrophic, but left a lot to be desired when considering how close the Cowboys were to a touchdown.\nWilliams needs to get stronger as he continues his career. Occasionally, he's simply outmuscled by a defender he engages. That happened on this run for a loss of two in a matchup with Marcell Dareus.\nLooney won't ever overpower a defender, either, as he receives the blow more than he delivers it, and sometimes it gets him into trouble. His inability to maintain or finish his block on Dareus on this run alters Elliott's path, resulting in a run for no gain.\nHe isn't a glaring issue most of the time, though, making him effective enough to fill Travis Frederick's place -- for now.Seemingly aware of its issues with the front five, Dallas calls a healthy amount of short passes, play-action bootlegs and screens in an effect to both limit the opposing defense's hunger to blitz with reckless abandon, and cut down hits on Prescott, who's under pressure frequently. According to Next Gen Stats, Prescott has been pressured on 31 percent of attempts, tied for 10th most in the NFL among qualified passers.This group is a far cry from the crushing line that earned its billing as the league's best unit in 2016. In fact, the strongest block I saw in the last three weeks came against the Washington Redskins, when Collins teamed with Martin to drive Matt Ioannidis completely out of the B gap and create enough room for Elliott to gain the two yards needed for a first down.\nIt's more of an adequate at best group with a much lower, visible ceiling.Is that a product of Alexander's coaching or a difference in personnel? There's a clear drop-off with Williams and Looney on the interior as opposed to Frederick and a guard such as Leary, who's now in Denver (and on injured reserve thanks to an Achilles injury). But there's also an underlying problem dealing with stunts, both in the vision needed to identify and adjust, and familiarity with teammates to get the job done. Those are fixed over time with familiarity (and resulting trust gained), and also with communication and film study to both fix problems and be able to prepare for upcoming defensive approaches.At this point, with the Cowboys at 3-4 and two games behind division-leading Washington (fresh off a close loss to the Redskins), there's time to fix things. That can explain the firing of Alexander. But it's more than just coaching with this team.Pro Football Focus grades (10th in run blocking, 16th in pass protection) are probably a little too positive, or are an indication of the struggles with which other teams in the NFL are dealing, but it's not a reason for total panic. When accounting for Frederick (if and when he can return), this isn't a bad group. It's just a group that needs work and more time together, which it will receive with former assistant O-line coach Marc Colombo now taking over for Alexander with nine games left.\nMore News >\nMore Videos >More Photos >More Gear >"}