{"id": "Matt Patricia defends decision to practice in snow", "paragraph": "  \nDetroit Lions coach Matt Patricia's decision to practice outdoors in the snow Thursday turned heads among the Lions press corps. Some members of the media questioned why the Lions would take that step when considering the team's hosts the Carolina Panthers for an indoor game in Week 11 and potentially risk injury in the elements. Patricia came ready Friday with a prepared statement backing his decision.\"First, we'll always practice and train in a manner that looks out for our players' ability to prepare each week for opponent, while also taking care of them, including all parameters to the overall health and safety of our team,\" Patricia explained. \"It's always beneficial to our players. It's a great teaching and learning environment.\" The Lions coach pointed out there is a downside to an indoor practice, which is accomplished on artificial turf, when it comes to wear and tear on bodies. \"It affects swelling,\" he said. \"And it really causes the body in different members of our team to have pain or joint swelling that will then cause them further delay in preparing for the game. \"Practicing outside has multiple benefits, provides different elements for us to prepare in and work through in the ground overall preparation of our team.\" Patricia then said the opportunity to work outdoors Thursday allowed the team to focus on fundamentals while in pads. \"Practicing in some of those conditions -- whether it's mud, snow, loose grass, whatever the case may by -- focuses most of the skill players to have to keep their feet underneath them, be able to break with a low center of gravity and play technically sound, which is always good from a fundamental standpoint,\" Patricia said. \"It was a good opportunity to get that done.\" Meanwhile, the Lions have lost three consecutive games and sit on a 3-6 record in Patricia's first year at the helm. While Patricia's approach to going outdoors despite having an indoor game might seem unorthodox to others, the Lions coach made it clear to reporters covering the team that he didn't appreciate the criticism over how he decides to conduct practice. \"There's no more discussion, no more conversation about it,\" Patricia said. \"I'd like to move on and show a little respect to Carolina, the Panthers, coach Ron Rivera, his outstanding team he's bringing up here to play against us, and the challenges we have, in fact, in trying to stop them and prepare for them. \"We're going to be practicing inside today, just so everybody is clear. All right? Make sure everybody is good with all the head coaches in the room on that. Everybody good there?\" If there are lessons to be taken from Friday's press conference, the first is Patricia won't hesitate to fire back at reporters. The second is reporters covering the team on a daily basis should consider bringing heavier winter gear for the next time the Lions elect to practice outdoors. Detroit has two cold-weather road games remaining on the schedule in Week 15 against the Buffalo Bills and Week 17 against the Green Bay Packers. \nMore Posts\nPhoto Essay\r\n"}