{"id": "Surprising fantasy football stats: Week 11", "paragraph": "  \nOnly a few weeks separate you from the fantasy playoffs. You need to stay focused on the facts. Here are some stats with no commentary to help guide you to your next victory:Joe Mixon missed Weeks 3 and 4 due to a knee injury that led to a cleanup procedure. This week he's on the injury list and limited in practice due to a knee injury again. In his two games as the solo back, Giovani Bernard averaged 22.6 fantasy points per game in PPR formats. As the lead back, Mixon averages 4.9 yards per carry and Bernard averages 4.8 YPC also in the lead role. Despite playing in two fewer games, Mixon only has one more rushing and one more receiving touchdown than Bernard on the season.According to Next Gen Stats, Alex Collins sees 8 or more defenders in the box on 36.5 percent of his carries. That is the highest percentage in the league out of any running back with at least 75 carries on the season.Only one quarterback this season couldn't throw for over 300 yards and/or score three passing touchdowns against the Atlanta Falcons. That was Nick Foles in Week 1. Dak Prescott has yet to throw over 300 yards or for three touchdowns in a single game this year.Over his last four games, Matt Ryan threw for at least 330 yards in each outing and has a 10:1 touchdown to interception ratio. Matt Ryan is the only quarterback so far this season with over 3,000 total passing yards and 70-plus completion percentage (71.1).Chris Godwin did not practice on Wednesday or Thursday this week due to an ankle injury that he sustained toward the end of their Week 10 matchup against Washington. Last week, Godwin saw seven targets and Adam Humphries only saw three. However, in the three games prior to that, Humphries had eight or more targets in each game.Two players in the NFL have 100-plus scrimmage yards in eight games this season: Adam Thielen and Saquon Barkley. Barkley is also the only player in the league with 500-plus rushing yards (586) and 500-plus receiving yards (530) on the season.Only two players in the NFL have over 1,100 scrimmage yards and 10 total touchdowns on the season: Todd Gurley and James Conner. Conner's 11 total touchdowns are tied for the most total touchdowns that Le'Veon Bell has ever scored over the entirety of a season.Donte Moncrief caught a touchdown in three of his last four games played. He's gone over 75 receiving yards in four of his last six. He's still only rostered in less than 10 percent of NLF fantasy leagues.Deshaun Watson threw 36 touchdowns over the first 16 games of his career. Only one quarterback threw more touchdowns in their first 16 games, and it was Kurt Warner (39). Patrick Mahomes threw 31 touchdowns over his first 10 games.Adrian Peterson hasn't scored double-digit fantasy points in PPR formats since Week 8, but he's still on pace for 1,195 rushing yards. That would be the seventh 1,000-plus season of his career. Peterson is the only active NFL player with a 2,000-plus yard season (2012). Only seven times in NFL history has any running back hit that mark.From Week 1 through 8, Marcus Mariota threw three touchdowns and five interceptions. Total. Since the team's Week 8 bye, Mariota has thrown four touchdowns and no interceptions in two games. Mariota has two rushing touchdowns on the year. Deshaun Watson, Derek Carr, and Tom Brady all ran in a touchdown when facing the Colts.Andrew Luck has three or more touchdowns in each of his last six games, the third longest streak of that kind in NFL history. Tennessee has yet to allow more than two passing touchdowns in a single game this season.CB Donte Jackson ties for second in the league and leads all rookies with four interceptions. That is tied for the same number of interceptions that Josh Norman put up over the entirety of his four years as a Panther. Chicago leads the league with an average of 1.8 interceptions per game, but Carolina is second, averaging 1.2. Matthew Stafford threw two interceptions last week and has been sacked at least three times in five of his last six outings.Only one rookie has more yards from scrimmage than Kerryon Johnson: Saquon Barkley. Johnson scored 24.9 PPR fantasy points last week at Chicago, the most of his career.Demaryius Thomas was technically on the field in Week 9, but it was the first game in which he was on the field and not a Bronco since 2011. In that game, Jeff Heuerman caught 10 of his 11 targets for 83 yards and a touchdown. That was his second game in a row with a score.Three players have scored multiple 75-plus yard touchdowns since the beginning of the 2017 season: Tyreek Hill, JuJu Smith-Schuster, and Tyrell Williams.Jalen Richard is one of five running backs with at least 45 catches and 400-plus receiving yards. He is the only one of those five with zero touchdowns. In fact, there is only one other running back with at least 200 receiving yards who has yet to hit pay dirt. The last time a running back had over 400 receiving and zero touchdowns was Kevin Faulk in 2003.Ricky Seals-Jones has four or more targets in all but one game this season. Only one tight end who saw at least four targets against the Raiders scored fewer than double-digit PPR fantasy points this season. That was Jake Butt in Week 1.Only once all season has Zach Ertz not scored double-digit PPR fantasy points. It was Week 1 and he scored 9.8 points. Travis Kelce also has double-digit PPR fantasy points in all but one game. He also missed that mark in Week 1.Mark Ingram is the only running back in the league with 30-plus carries who has yet to be tackled for a loss.According to Next Gen Stats, Dalvin Cook recorded the highest speed of the season when he hit 22.07 mph on his 70-yard run in Week 9 against the Saints. However, if you remove that play, Cook averaged 2.1 yards per carry on his other nine carries.Mitchell Trubisky has the second most rushing yards by a quarterback on the season (320), only behind Cam Newton (352). He's also tied for the second most rushing touchdowns (3), only behind Cam Newton (4). And Minnesota is tied for allowing the second most rushing touchdowns to opposing quarterbacks (3). Trubisky is the sixth highest scoring fantasy quarterback in standard scoring.Sammy Watkins has four or more targets in all but one game played this season. He's put up 70-plus receiving yards and/or a touchdown in five of his last eight outings. Last season as a Ram, he caught 39 passes for 593 yards and eight touchdowns. He is 78 yards from crossing last year's yardage total.Aaron Donald leads the NFL with 12.5 sacks. Patrick Mahomes has only been sacked 17 times this season, but nine of those sacks came in the last three games.\nMore Posts\nPhoto Essay\r\n"}