{"id": "Cardinals fire offensive coordinator Mike McCoy", "paragraph": "  \nLess than 12 hours after Cardinals head coach Steve Wilks said it was \"premature\" to talk about changes following the 45-10 loss to the Denver Broncos on Thursday night, Arizona made a move. The Cards fired offensive coordinator Mike McCoy, NFL Network's Tom Pelissero first reported Friday morning, per a source informed of the decision. The team later made the move official.With McCoy out, quarterbacks coach Byron Leftwich is the new OC and play-caller, NFL Network Insider Ian Rapoport reported. \n\"As a head coach, it's my responsibility to make these tough decisions,\" Wilks said during a news conference Friday. \"I try to do everything that I can to make sure that I have the right personnel, most important the right coaches in the right positions. Seven weeks into the season, based off what we were from a standpoint or production on the offensive side of the ball, I felt the need to make a change and thatâ\u0080\u0099s what I did.\"McCoy's seat was scorching hot even before Thursday night's turnover-filled dud. The Cardinals own one of the worst offenses in the league, highlighted by an unimaginative, stale, droning scheme. In a league of high-flying creative attacks, McCoy was stuck in a dreary past. Friday's firing marks the third time in the past 22 months an NFL team has jettisoned McCoy. Last season the Broncos canned the offensive coordinator after just 10 games. This time around the veteran play-caller couldn't even make it to the mid-way point of the season. After a flailing four years in San Diego ended in his termination, and two brief unsuccessful stints to reignite his career as an OC, McCoy shouldn't be on the radar of another young defensive-minded coach looking for a coordinator. Under McCoy, the Cardinals generated a measly 13.1 points per game (31st in the NFL), 156.1 passing yards per game (31st) and are dead last in total yards per game at 220.7 and rushing yards per game at 64.6. Not all of Arizona's offensive problems are on McCoy. The offensive line continues to be a sieve, and rookie quarterback Josh Rosen has struggled through bouts of turnover-prone play, including Thursday night's five-turnover disaster. But the complete offensive ineptitude, lack of preparedness, and an inability to put the talent that is on the roster in spots to make plays falls on McCoy. The most frustrating aspect of McCoy's scheme was the inability to utilize running back David Johnson's dual-threat ability. Instead of getting the running back in space, to the edge, and exploit his matchups in the passing attack, McCoy used DJ as a between-the-tackles battering ram and little else. The Cardinals' 452 rushing yards is their second-fewest through seven games in the Super Bowl era, per NFL Research. Compare the running back's 2016 usage (Bruce Arians) to his 2018 numbers (McCoy): David Johnson 2016: 23.6 touches per game; 132.4 scrimmage YPG; 5.7 scrimmage yards per touch.  David Johnson 2018: 18 touches per game; 71.6 scrimmage YPG; 4.0 scrimmage yards per touch. Inside the #AZCardinals organization, there was frustration about OC Mike McCoy's lack of creativity, inability to get David Johnson going, questions about how much he was putting on Josh Rosen's plate. Going into last night's game, players knew it was time. McCoy fired today.A play-caller that can't utilize the talents of his best players is not long to keep his job. \"You definitely want to be able to try to get David Johnson going in the run game as well as in the pass game,\" Wilks said. \"With Byron [Leftwich] being here before and being a part of that, and understanding some of the success he's had in the past, hopefully we can tap back to some of the things they [were] doing in the past.\"The hope in Arizona is that a change can breathe life into a floundering offense. Making the change this week is sensible. The Cards have 10 days for Leftwich to prepare for the San Francisco 49ers. Arizona then has a bye in Week 9 for the new OC to install more of his plan. After a 1-6 start, handing the reins to Leftwich won't be a cure-all for a team that still lacks depth, has offensive line issues, and needs its rookie QB to protect the ball better. However, it was a needed move. Leftwich begins the play-caller portion of his career 16 months after earning high praise from former Cardinals coach Bruce Arians who praised the former quarterback a future NFL coach in June 2017. The new OC is now charged with helping guide Rosen past the rough portions of his rookie season and putting the signal-caller in advantageous situations. The first of those moves should be to get back to the Arians' style of utilizing Johnson in ideal matchups to take pressure off Rosen. \nMore Posts\nPhoto Essay\r\n"}