{"id": "Jamal Adams: Todd Bowles is not the problem for Jets", "paragraph": "  \nThe Jets hit their lowest point of the 2018 season Sunday when they lost to the Buffalo Bills at home in blowout fashion.The Matt Barkley-led squad outgained New York 451-199, forced two turnovers, dominated time of possession and nearly doubled the Jets' first-down total. One of Buffalo's touchdowns was thrown to an offensive tackle (Dion Dawkins).The ugly loss increased the volume of calls for Todd Bowles' head coaching job. Jets safety Jamal Adams says those calls are nothing but hogwash.\"Again, T. Bowles is not the problem,\" Adams said after the loss, per the New York Daily News. \"I'm going to ride with T. Bowles until the end. I don't care what the fans say. I'm going to support my coach through thick and thin.\"Adams is a young leader of the Jets defense, appointed to such a role almost immediately after he was selected in the first round of the 2017 draft. Bowles is a defensive-minded coach and former NFL defensive back. The connection there is pretty clear.Though Adams has been through a coaching change in his playing career -- LSU fired Les Miles and replaced him with Ed Orgeron during Adams' time there -- the safety is still playing for the first coach of what will likely be a long professional career. Defending him is logical at this point.\"We laid an egg,\" Adams said, per SNY. \"We got our ass kicked. It's as simple as that.\"This wouldn't be all that interesting in a normal set of circumstances, but these comments are coming from a player who also said in the offseason that his team did the \"bare minimum\" in a difficult 2017 season in which they were also coached by Bowles. Here in 2018, the Jets find themselves in a similar situation, even with personnel changes. That would lead one to believe it's a leadership or -- brace for a buzzword -- culture issue.Which is an issue typically remedied by making a coaching change. But with seven weeks left and Adams still in the early stages of his career, there's no reason to throw his coach under the bus -- even if the writing is slowly being inscribed on the wall.\nMore Posts\nPhoto Essay\r\n"}