{"id": "Three things to watch for in Raiders-49ers on 'TNF'", "paragraph": "  \nI know, I know, but you clicked on the link. You're here now. Let's do this together.The Oakland Raiders and San Francisco 49ers meet in a matchup of two teams with two wins combined. It's been a rough football year in the Bay Area, thanks in part to one devastating ACL injury for one team, and a mid-season teardown of sorts for the other.But this is still prime-time football, and as the saying goes, when it's on, it's on. Plus, as long as they escape the traffic, plenty of fans from both teams should make their way to Santa Clara's Levi's Stadium. And who doesn't like football under the lights?!Here are three reasons why you should watch the Week 9 edition of Thursday Night Football (airing on NFL Network, FOX and streaming on Amazon Prime Video). Remember: When it's on, it's on.It'll be on in the final Battle of the Bay, with the Raiders set to move to Las Vegas in 2020 and these teams meeting just once every four years. This had a little more juice in past years, especially when both teams were contenders and when both played in old stadiums that were more relics than modern marvels. Now, only one team plays in an aging venue, and this game is played at the other's home, which is very new and has a history of hosting good TNF games.\nThe last point is important: San Francisco, back in the prehistoric days of Brian Hoyer, went toe-to-toe with the Rams in an entertaining Thursday night contest a year ago. And just two weeks back, the Niners gave the Packers all they could handle on Monday night.This begs the question: Are the Niners at their best when the pressure is on? Is Kyle Shanahan the football equivalent of One-Take Jay?Furthermore, are the Raiders capable of beating anyone other than the Browns? And if so, wouldn't it be great for Jon Gruden to get his second win against a neighbor whom his team's fanbase doesn't very much like, on its turf, on national television?I know, you can't wait for kickoff now. But there's more!Jared Cook is a name you might know. George Kittle, probably not -- but it's in your best interest to get familiar.In what's likely more a product of a quarterback relying on a safety blanket (or defenses turning their attention elsewhere), both of these tight ends are leading their teams in receiving. Cook, a relatively productive tight end over the course of his 10-year NFL journey, is headed toward a career year at 31 years old. He's Derek Carr's No. 1 target, and it's been pretty obvious through seven games, a small glimmer in what has been an otherwise sad season for the Silver and Black.\nThen, across the Bay resides Kittle, a second-year pass-catcher who's already passed his 2017 total. Perhaps even more impressive is the fact he's doing a lot of it without Jimmy Garoppolo, lost to the aforementioned ACL injury. No, Kittle is teaming up with C.J. Beathard, his former college teammate at Iowa. (Tonight it will be Nick Mullens making his first-career start under center).The familiarity is paying dividends, so much that Kittle made it onto Pro Football Focus' mid-season All-Pro team.Which tight end will reign supreme Thursday? Or will they both be stars?Hold your head together so it doesn't explode.Every broadcaster has a page he or she turns to when a game turns to a blowout, and this is mine for this piece. In case the game isn't riveting, there's an additional attraction, one who was for a time the biggest in football.His name: Terrell Owens. You might know him as T.O.\nOwens notoriously became the first in history to boycott his own Pro Football Hall of Fame enshrinement back in August, grabbing headlines and shining a light on the selectors, whom he felt did him wrong in making him wait a few years. On Thursday, he will be honored at halftime and presented with his Hall of Fame Ring of Excellence.Pro Football Hall of Fame president and CEO David Baker travels across the country to give these rings to each of the newest enshrinees with similar ceremonies taking place at each of the Hall of Famers' team's stadiums. Jerry Kramer received his in Green Bay earlier this season; Robert Brazile, too, in Nashville.But none of those men avoided his ceremony and had his own at his college. Owens did, making for a little intrigue with this meeting. (It's important to note there isn't any lingering animosity between the hall and Owens, with the hall keeping its invitation permanently open to Owens and a guarantee to protect his legacy for as long as it exists.)Plus, expect plenty of camera cuts to Owens during the game and commentary on his illustrious career (including how he eventually became a star for the rival Dallas Cowboys) via FOX's Joe Buck and Troy Aikman. Maybe we'll even get another Good Morning Football tie-in.\nMore Posts\nPhoto Essay\r\n"}