{"id": "Raiders' Lee Smith: Players work hard to win right now", "paragraph": "  \nThe Oakland Raiders shipped off former first-round picks Khalil Mack and Amari Cooper in jaw-dropping trades this season. And while management isn't often required to answer to employees in any work environment, there appears to be a rising concern among numerous veteran players in the Raiders' locker room over accountability, specifically as it pertains to head coach Jon Gruden. In an article penned by The Athletic's Vic Tafur, several unnamed sources question Gruden's handling of dissemination of information to the team in the wake of the trades. Cooper, for example, was pulled off the practice field Monday and Gruden didn't inform the team of the trade after the workout session. Instead, players found out about the transaction on their phones or on social media. \n\"The Mack trade was a real stiff jab,\" an unnamed player told The Athletic. \"But the Cooper one was like a knockout punch, especially because we had just walked back in the door from the bye. We didn't want to believe it was coming, and Coach said we weren't going to trade him.\" While Tafur disclosed he spoke to seven players not willing to go on the record, one veteran spoke freely on the current locker room environment. Tight end Lee Smith, who enters his eighth professional season and fourth with the Raiders, expressed concern over the departure of two Pro Bowl players and how it could affect his teammates. \"Of course I'm concerned about the locker room,\" Smith told The Athletic. \"I am a leader on this team and I am under contract next year, but more importantly I care about all my teammates. I care about Rodney Hudson, Gabe Jackson, Derek Carr, Bruce Irvin, all of them. And I know how hard guys work all year. Guys don't work their ass off year-round because they are worried about the team being good in two or three years, they work hard to win. Now. \"Nobody was happy when we traded Khalil. And nobody is happy that we traded Amari. How could you be? You never ever want to trade elite, homegrown talent. But Coach Gruden is thinking long term. It's no secret that he got a 10-year contract. And having five first-rounders in the next two years is pretty good. ... And he has been clear about his open-door policy. If guys have a problem with this trade, they can go sit in his office and tell him.\" Whether players will take Smith's advice to sit down with Gruden and express opinions on the team's current path remains to be seen. But the fact that several of the team's veterans have voiced frustrations off the record should raise alarm at management level, especially for a team sitting on a 1-5 record and in apparent rebuilding process. In the meantime, do yourself a favor and read the full article by clicking here.\nMore Posts\nPhoto Essay\r\n"}