{"id": "Paul Zimmerman was a brilliant, relentlessly authentic legend", "paragraph": "  The conversation turned from the inanity of Time Warner's expense-report system to Bill Walsh and the West Coast Offense, and I piped in immediately, eager to share my first-hand experiences with a living legend. There I was in an upscale South Beach restaurant, six days before Super Bowl XXIX, preparing to hold court at a Sports Illustrated team dinner less than three months after having jumped from the Santa Rosa Press Democrat to one of the greatest magazines on earth. I had spoken with Walsh earlier that afternoon, and I was feeling pretty damn pleased with myself in general. In retrospect, I wasn't investing a whole lot of effort into trying to conceal it.\"Stop talking,\" Paul Zimmerman said abruptly, bringing the conversation to a sudden and awkward halt. I smiled, but the force of nature known as Dr. Z wasn't smiling back. I assessed the situation: At best, he was hazing me. At worst, he detested me. Worst of all, his feelings may have been semi-justified. \"You don't know enough to have an opinion,\" Zimmerman continued, swirling a glass of the gratuitously expensive red wine he'd ordered for the table. \"Let's move on.\"If that had been my last interaction with Dr. Z -- who, like Walsh, was already a living legend on that chilly Miami night in January of 1995 -- I'd still feel quite comfortable writing the following sentence: Zimmerman, who died Thursday at the age of 86, was the greatest football writer of all-time, and it was a privilege to work with him.Blessedly, because I managed to recover from the rookie smackdown I received in that South Beach restaurant and get to know the man, I can say a whole lot more, and I hope you'll indulge me as I reflect back on an American original who not only helped my career immeasurably but also sent me a whole bunch of long, typewritten letters that were funnier and more revealing than, say, the best parts of everything I've ever read on social media, combined.To say that, in the course of writing 13 consecutive Super Bowl game stories for SI and covering the sport for the magazine, I strove to soar to the standard set by Zim would be an understatement. After all, I already idolized the guy when I was grinding away at my college newspaper at UC Berkeley. A couple of years later, his cover story off the San Francisco 49ers' Super Bowl XXIV blowout of the Denver Broncos was so insanely strong, it seemed unattainable: It began with Zimmerman hanging out in Joe Montana's New Orleans hotel room as the just-crowned Super Bowl MVP spoke on the phone to Larry Bird, drank Dom Perignon out of a water glass and broke down film of his epic performance.To sum it up: Zim's story was Montanaesque, and vice-versa.So yeah, after getting my dream job, it was scary enough to be covering pro football alongside all-time greats Rick Telander and Peter King, among other sportswriting monsters. But trying to tread into the domain once ruled by Dr. Z? Let's just say it was a tad humbling, even for someone with an inflated sense of self.Eventually, I allowed some of that humility to show on occasion, and Zimmerman decided I wasn't all awful, and a friendship was born. He probably didn't think of his actions as \"mentoring,\" but the man helped mold me into the journalist I'd always hoped to become -- and increased my understanding of the mission in ways I'll always treasure.First of all, Dr. Z knew the game better than any sportswriter ever, and by passing on 1/10,000th of his football knowledge, he made me smarter. More important, he was a fearless reporter who had a knack for getting his subjects to trust him, for searching for answers until he found the perfect people to provide them, and for instinctively mistrusting authority and the party line in pursuit of what is real and raw and true.If you're young or cynical or have been gaslighted by the current Powers That Be into viewing journalists as the Enemy of the People, you might not appreciate those qualities. I can also assure you that the great Dr. Z would have had zero time for you, and would have abused you on a level far more cutting than he did while hazing me in that South Beach restaurant.And trust me, Zim's biting verbal jabs were a lot more enjoyable when you weren't on the receiving end. Forget, for a moment, about his football knowledge, writing flair and reporting genius -- his no-holds-barred sense of humor alone was legendary.Even though I may not have admitted it to the living legend, I cherished not only the lessons he imparted but any interaction whatsoever, because there was no one else remotely like him, and he never pretended to be anything but his brilliant, flawed and relentlessly authentic self.He also wrote me those long, typewritten letters, so I feel like he at least had some sense of how much his mentorship meant. The Zim I was lucky enough to get to know was every bit as extraordinary in real life as the man who covered football like no other, before, during or since. He was gutsy, gritty and bawdy, teeming with over-the-top quirks and propelled by a ruthless work ethic that was counterbalanced by humor and an indefatigable zest for adventure.Salty to the core, he melted and mellowed later in life, after meeting his true love, Linda Bailey Zimmerman, a.k.a. 'The Flaming Redhead,' as he lovingly referred to her in the insanely entertaining si.com columns that served as his rightful journalistic rebirth at the dawn of a new platform. To be sure, the man would undoubtedly have taken Twitter and other social media by storm as well, but a series of strokes in 2008 left him virtually unable to communicate, robbing us of his incisive insight during the last decade of his life.I learned so much from Dr. Z, and one thing was this: As journalists, we can prepare for a piece with everything we've got, and report our faces off, but until we've followed through on all the leads and opened ourselves up to every possibility, there's no way to know how the story ends.I don't know how Zim's story ends, but I know how I'd like it to: In some sort of afterlife, at a darkened dinner table with cigar smoke and obscenely overpriced wine and a heady discussion about the sport he loved and/or the hell below and heavens above -- and, if all goes well, a moment when he tells a cocky newcomer to shut the hell up, because he hasn't earned the right to weigh in.If that scene ever were to happen, I'd happily be that newcomer. In the meantime, I'm going to try to be the type of journalist Paul Zimmerman was, and hoped to help me become -- and for that I'm not apologizing to anyone.Because, trust me: If the legend were alive, he wouldn't tolerate it.\nMore News >\nMore Videos >More Photos >More Gear >"}