{"id": "Ron Rivera on Panthers' big loss: '[Expletive] happens'", "paragraph": "  \nThe Carolina Panthers were forced to choke down some \"humble pie\" during Thursday's 52-21 loss to the Pittsburgh Steelers, but the team is characterizing the performance as more of an anomaly than a worrying trend.\"At the end of the day this s--- happens,\" coach Ron Rivera said. \"I'm going to put it just like that. Let's be honest about it. It happens. This is my 30th year in the NFL. I've seen games like this. I've been a part of games like this on both sides.\n\"If you get over it and start preparing for the next game you give yourself a chance to get ready to win the next game. ... We're a better football team than we showed.\"The Steelers' dominance on offense en route to delivering the Panthers' largest margin of defeat since 2016 was surprising since Carolina entered the game with the NFL's 12th-ranked defense. However, the Panthers haven't been their normal selves over the last seven quarters. After jumping out to a 35-7 lead against the Tampa Bay Buccaneers last week, Carolina allowed them back in the game by giving up 28 points.Against the Steelers, Carolina surrendered 457 total yards (319 passing, 138 rushing) in allowing 52 points, which tied for the most points given up in franchise history. Carolina's struggles in the secondary played a big part in the blowout loss. According to Pro Football Focus, the Panthers starting cornerbacks allowed 10 receptions on 10 targets for 174 passing yards, two touchdowns and 158.3 passer rating in coverage against the Steelers.While that goes against the Panthers' defensive track record, the team realizes they need to use Thursday's loss as a learning experience.\n\"We also can't pretend it didn't happen,\" Panthers tight end Greg Olsen said. \"It did. It happened for a reason. It happened because there are things we need to get better at. If we don't get better when we play good teams it'll happen again. \"We've got to correct this s---. This stuff just doesn't all of a sudden go away. We've to address a lot of things and get better. If you don't, it lingers and you're in trouble.\"As for Cam Newton, he was the first to admit the Panthers \"got whooped,\" but he isn't questioning his abilities after the loss.\"You're asking my confidence level? Confidence, me?\" Newton said. \"It starts with the inner self, and I have ultimate confidence in myself, knowing I put in a lot of work to make sure that come game day ... I'm ready to rock and roll.\"\nMore Posts\nPhoto Essay\r\n"}