{"id": "Lions' Golden Tate: 'I don't think' I'm getting traded", "paragraph": "  \nAs we barrel towards the 4 p.m. ET trade deadline today, plenty of players will be rumored to be on the move. Few of those discussions will turn into actions. One player possibly available in a trade is Detroit Lions receiver Golden Tate. NFL Network's Tom Pelissero reported on Monday that the Lions have been fielding calls about the YAC-gobbling wideout. The report noted that Detroit wouldn't move the receiver unless it got \"blown away\" by an offer. For his part, Tate doesn't think he'll get a phone call Tuesday notifying him he's on the move. \n\"I don't think so,\" Tate told Dave Birkett of the Detroit Free Press on Monday. \"I feel like I'm a huge part of this organization and this offense especially, so hopefully that's not the case. But again, I do understand it's a business and if it happens then, you know, depends on where they send me.\" The 30-year-old receiver remains the straw that stirs the Lions' offensive drink. Matthew Stafford consistently relies on Tate's ability to break tackles and gain first downs. The reigning Yards After Catch King has long been an extension of a woeful running game, with the Lions using him on a bevy of quick screens. If Detroit jettisoned Tate it would significantly hinder Stafford's operation in the short term. Given that the Lions just traded for Damon Harrison last week, a trade of a central offensive piece would seem counterintuitive. That won't stop teams from inquiring about Tate, however, as they have for some time. NFL Network Insider Ian Rapoport noted that the New England Patriots are in the market for receiver help and could be one team inquiring about the Lions wideout. The reason Tate's even being discussed as a trade option is that he's in the final year of his contract. If Lions GM Bob Quinn doesn't think he can re-sign Tate, getting what he can now could be the smart play. Tate told Birkett he's optimistic the sides have gotten \"closer\" to an extension. His definition of closer, however, remains a point of view.\"Ask (the front office about it), and then I'll speak on it,\" Tate said. \"But I don't want to be the one -- I don't want to draw too much attention in season to all that stuff.\" Just one game out from the division lead, trading a player of Tate's importance would be a slight surprise. But given his age, contract status and the rising salary compensation for receivers of his caliber, it can't be ruled out.  \"I don't think they're going to trade me,\" Tate said. \"If they do, I'll be surprised, but it's a business so I guess we got a few hours. A few hours and we'll see.\" We shall indeed. \nMore Posts\nPhoto Essay\r\n"}