{"id": "Dez Bryant suffers torn Achilles tendon in practice", "paragraph": "  \nRecently signed New Orleans Saints wide receiver Dez Bryant suffered a torn Achilles tendon in practice Friday, sources told NFL Network Insider Ian Rapoport and NFL Network's Tom Pelissero. An MRI scan confirmed the initial diagnosis that was made after practice, a source told Rapoport.Bryant suffered the injury while running a routine route in practice, sources told NFL Network's Jane Slater. He signed a one-year deal with the Saints on Wednesday and practiced with the team for the first time Thursday.Things was just starting to heat up for me... I wonâ\u0080\u0099t question the man upstairs... this is the ultimate test.. thank you everyone for the prayersBryant's season-ending injury is a significant blow to the 30-year-old wide receiver's hopes of resurrecting his career after sitting out most of the year in search of a new team. It's also hurts the Saints' aspirations of strengthening their offense in hopes of challenging for the franchise's second Super Bowl title.Bryant was released by the Cowboys in April after his on-field productivity slipped in 2016 and 2017. The once-dominant physical wideout hasn't surpassed 900 yards since signing a lucrative extension in 2015 -- an extension fueled by remarkable numbers he racked up en route to being named a first-team All-Pro in 2014.After visiting with the Baltimore Ravens and Cleveland Browns during the offseason, Bryant waited until midway through the season before working out for the Saints on Tuesday.Bryant said the chance to play alongside Saints stars Drew Brees, Alvin Kamara and Michael Thomas motivated his decision to sign with New Orleans.\"For one, who wouldn't want to play with Drew Brees?\" Bryant told reporters. \"Not taking away from nobody else, but a guy like Drew Brees. Like I said, you got a guy like Michael Thomas, [Benjamin] Watson, Alvin Kamara, Mark Ingram -- you got those types of guys -- little baby GOATs around here.\"\nWhere the Saints go from here remains to be seen, but there is a hole at the wide receiver position opposite Thomas in light of Friday's news. The Saints signed Bryant with a view to bolster the spot, which hasn't been productive since Ted Ginn went on injured reserve with a knee injury. Ginn last played in Week 4, yet his 22 targets on the season still rank second among the wide receivers on the Saints' roster behind Thomas' 79. Ginn's 12 catches are also tied with rookie Tre'Quan Smith as the second-most among the team's wide receivers. Smith and Cameron Meredith were expected to fill the void after Ginn's injury. But Meredith wasn't targeted once in the past three games before the Saints placed him on injured reserve with a knee injury as the corresponding move to Bryant's signing. Smith has 12 catches for 214 yards and three touchdowns on 20 targets in eight games with four starts, while second-year pro Austin Carr has five catches for 62 yards on six targets. The Saints currently have four wide receivers on injured reserve: Ginn, Meredith, Tommylee Lewis and Travin Dural.\nMore Posts\nPhoto Essay\r\n"}