{"id": "Texans trade for Broncos WR Demaryius Thomas", "paragraph": "  \nDemaryius Thomas thought his days in Denver might be numbered. The receiver was correct. NFL Network Insider Ian Rapoport reported Tuesday that the Broncos are trading Thomas to the Houston Texans in exchange for a 2019 fourth-round draft pick, per sources informed of the deal. The teams are also swapping seventh-rounders, per Rapoport. The Broncos later confirmed the trade.Thomas is the first big-name player to move on the final day trades can be executed. The deadline for swaps is 4 p.m. ET. Thomas will immediately face his former team when the Texans visit the Broncos on Sunday. \"Demaryius had an incredible run here and we can't thank him enough for everything he's meant to the Broncos,\" Broncos general manager John Elway said in a statement. \"He developed into an elite player over the years, establishing himself as one NFL's most productive, consistent and reliable wide receivers. D.T. was a big part of so many wins and memorable moments as a Bronco. Although it's tough to end this chapter, we're excited about the talent we have at the wide receiver position and wish Demaryius all the best with the Texans.\"Denever CEO Joe Ellis also said, \"we look forward to honoring D.T. one day as a Ring of Famer and appreciate his many contributions to the Broncos.\"The Broncos moving the 30-year-old receiver was heavily speculated in recent weeks. Thomas' production has waned this season as his rapport with Case Keenum hasn't materialized. With $14 million in base salary for 2019, it was likely the end of the line for Thomas in Denver. Sitting at 3-5, staring at another lost season, getting a draft pick in compensation made sense. More importantly, jettisoning Thomas opens more opportunities for impressive rookie Cortland Sutton. The second-round pick has displayed great ball skills and an ability to get open, snagging 17 receptions for 324 yards in eight games while playing just 68.7 percent of the offensive snaps. Those numbers should skyrocket with Thomas out of the equation. He's now the clear No. 2 alongside Emmanuel Sanders. Emmanuel Sanders speaking to @1043TheFan on the trade of DT: â\u0080\u009cIâ\u0080\u0099m not happy about that.â\u0080\u009dFor the Texans, adding another playmaking receiver became a need after speedster Will Fuller suffered a season-ending ACL tear in Week 8. Rookie receiver Keke Coutee has also been dealing with a hamstring injury. Putting Thomas next to DeAndre Hopkins gives Deshaun Watson a reliable 1-2 veteran punch at receiver. While DT has lost some of his early-career burst with age, he can still be a playmaker when properly motivated. Thrust back into the playoff race should aid his endeavor. Playing with a faulty offensive line, Thomas' ability to make himself available on quick routes should be relied on heavily in Houston. Thomas will be especially useful in the red zone, where Houston has been woeful this season. Pairing the big bodies of Hopkins and Thomas should give Watson more option in the condensed part of the field. Sitting at 5-3 at the midway part of their season, the Texans are the only team over .500 in the AFC South, but know the Colts, Jags, and Titans are each capable of making a late-season push. Adding to a sometimes-stagnant offense was a necessary move for a Houston team that currently sits at the pole position for a postseason run. \nMore Posts\nPhoto Essay\r\n"}