{"id": "Broncos QB Chad Kelly arrested for trespassing", "paragraph": "  Denver Broncos backup quarterback Chad Kelly was arrested Tuesday morning on a charge of first-degree criminal trespass.According to a press release from the Englewood (Colo.) Police Department, Kelly illegally entered a home and was later chased out by the resident. When searching the area, officers spotted a man matching the description inside a black SUV. The man, identified as Kelly, was then placed under arrest. He is no longer in police custody.Kelly posted a $2,500 bond and is scheduled to appear in court Wednesday.\"We are disappointed that Chad Kelly was arrested early this morning,\" the Broncos said in a statement. \"Our organization has been in contact with Chad, and we are in the process of gathering more information.\"Broncos general manager John Elway further commented on Kelly during a Tuesday radio spot:Elway to @OrangeBlue760: \"We're very, very disappointed in Chad and the situation he put himself into... When the team has a get-together, that's always a good thing... One person put a dent in it... We take it very seriously and will make decisions as we go.\"NFL Network's James Palmer reported that the team get-together was a Western themed Halloween party thrown by linebacker Von Miller. Miller has been hosting the party for years and the event is not an issue with the Broncos. They are handling Kelly's arrest as an isolated incident, Palmer added.The Broncos drafted Kelly in the seventh round of the 2017 NFL Draft, and he beat out Paxton Lynch during the preseason for the backup role behind Case Keenum.NFL Network Insider Ian Rapoport reported that all options -- including release -- are on the table for Kelly.Below is the full press release from Englewood police:On October 23, 2018 at approximately 1:17 a.m., Englewood Police Officers responded to an address in the 3200 block of South Lincoln Street, reference a male standing outside a residence. While officers were responding, they received information that the male was now inside the residence.The male was chased out of the residence by an occupant, and officers began to search the area. A short time later, a male matching the description provided by the homeowner, was located inside a black sport utility vehicle, in the area of the Gothic Theatre.The male, who was identified as Chad Kelly 03/26/94, was placed into custody without incident. As a result of the investigation, Kelly was jailed on the charge of 1st Degree Criminal Trespass, and transported to the Arapahoe County Jail.\nMore Posts\nPhoto Essay\r\n"}