{"id": "Packers trade Ha Ha Clinton-Dix to Redskins", "paragraph": "  \nThe Washington Redskins made a move to bolster an already solid defense. The Green Bay Packers traded veteran safety Ha Ha Clinton-Dix to the Redskins, both teams confirmed on Tuesday.The Redskins are sending a fourth-round pick back to Green Bay in return, NFL Network's Tom Pelissero reported. Much love y'all ï¿½ï¿½The 2014 No. 21 overall pick is in the final year of his five-year rookie contract. Clinton-Dix said earlier this season he didn't expect to be back in Green Bay next season. It turns out he made it only halfway through that prediction. The trade strengthens a Redskins defense that has smothered opponents with its front seven in recent weeks. \nEven if it ends up only a being rental, the NFC East-leading Redskins bolstered the back end of their defense big time by picking up Clinton-Dix. He will slide into the free safety role next to D.J. Swearinger, who is having a Pro Bowl-caliber season. Adding Clinton-Dix to the secondary gives the Redskins the No. 2 and 3 rated safties this season, according to Pro Football Focus grades. Clinton-Dix has never missed a game in his career and started 55 straight regular-season games in Green Bay. For his career, Ha Ha has generated 378 tackles, 25 passes defended, 14 interceptions, 5.5 sacks and three forced fumbles. His range on the back end of the Redskins defense will be a welcome addition to an already stellar D. Sitting at 5-2, with the division title in sights, the time was now for the Redskins to make a move. Meanwhile, the Packers shipped out a player they were poised to lose after this season. Despite remaining in playoff position, Green Bay likely felt getting a mid-round draft pick was worth cutting bait now. The Packers have invested heavily in their secondary in recent seasons, using 2018 first- and second-round picks on corners Jaire Alexander and Josh Jackson, and 2017 second-round picks on corner Kevin King and safety Josh Jones. Jermaine Whitehead and Jones are next up at safety alongside Kentrell Brice. With Clinton-Dix out of the mix, Mike Pettine will rely more heavily on the youngsters moving forward. \nMore Posts\nPhoto Essay\r\n"}