{"id": "Week 9 fantasy streamers: Bring back Ryan Fitzpatrick", "paragraph": "  \nStreaming your starting QB, TE, or D/ST isn't the goal in fantasy football. But, if you're weak at a position where you only have to start one player, picking up usable fantasy weeks from the waiver wire can be a beneficial process. In typical start-one quarterback, tight end, and D/ST 12-team formats, most of your league mates won't -- and shouldn't -- carry a backup QB or D/ST. Positional scarcity leaves the waiver wire flush with plausible weekly starting options based on their matchup and expected game-flow.Simply put, because quarterback and defensive matchups are easier to predict and their output varies less on a weekly basis, sharp fantasy owners have an edge in their leagues if they can stream their \"onesie\" positions (usually their defense) better than their opponent.With six teams on their off date (Arizona, Cincinnati, Indianapolis, Jacksonville, New York Giants, and Philadelphia), we're tracking towards a bye-pocalypse:Floor and Ceiling: Ryan Fitzpatrick, QB, Tampa Bay Buccaneers (87 percent available) vs. Carolina PanthersOutside of one bad game in Chicago (Week 4) that quickly turned into a boat race, the Bucs' quarterback has been fantastic for fantasy regardless of who is at the helm:The \"Tampa Bay QB\" weekly fantasy finishes this season (includes combined* games from Winston and Fitzpatrick):Week 1 - QB1Week 2 - QB6Week 3 - QB4Week 4 - QB23*Week 6 - QB1Week 7 - QB6Week 8 - QB1*Floor: Derek Carr, QB, Oakland Raiders (89 percent available) vs. San Francisco 49ers No Amari Cooper, no problem. Oakland's regular season has been ... tumultuous, to say the least. Still, Derek Carr came out of the Raiders bye week and ripped the Colts for 244 yards and three scores on just 28 attempts -- finishing as the weekly QB3 in fantasy output. Now, Carr faces another layup draw against a 'Niners side that is permitting the seventh-most fantasy points per dropback and the sixth-highest passer rating (94.4). Fitzpatrick is the preferred option of the two, but Carr boasts a reasonable floor against San Francisco.Note: Since Zach Ertz, Evan Engram, Jack Doyle, Eric Ebron, and C.J. Uzomah all out on their off-date this week, tight end is even more of a disaster than usual in Week 9. There is nothing but darkness (and thin fantasy plays) here:Deep: Chris Herndon, TE, New York Jets (98 percent available) vs. Miami Dolphins Even though he's only averaging 53 percent of team snaps, Herndon has scored in three-straight games and now leads all Jets receivers in passer rating when targeted by Sam Darnold (134.5; per Next Gen Stats). However, Herndon will still possess a dangerously low floor until his usage begins to tick up. Per PFF's charts, Herndon has run a pass route on just 31 percent of Darnold's dropbacks over the last three weeks. Still, tight end is a black hole in fantasy this year and anyone with a pulse is playable. The Dolphins allowed 5/56/2 to Lions TEs in Week 7 and were hit for 4/29/2 by Texans' TE Jordan Thomas in Week 8.Deep: Ed Dickson, TE, Seattle Seahawks (99 percent available) vs. L.A. Chargers We got lucky with Dickson in this space last week, and we're forced back to the well once more. Making his 2018 debut after a groin injury claimed the first seven games of his season, Ed Dickson dropped 2/52/1 (on two targets) in Week 8 versus Detroit. However, Dickson only played on 32 percent of Seattle's snaps and ran just seven pass routes in his first game of the season. Nick Vannett remained involved, playing 50 percent of 'Hawks snaps and seeing three targets. Still, at fantasy's thinnest position, Dickson merits Week 9 streamer appeal. We want to get a piece of a white-hot Russell Wilson, who leads all quarterbacks in red-zone touchdown rate, by a mile (45.8 percent).Super Deep: Hayden Hurst and Mark Andrews, TEs, Baltimore Ravens (99 percent available) vs. Pittsburgh Steelers Before their Week 8 game against Carolina, head coach John Harbaugh mentioned it was \"important\" to get 2018 first-rounder Hayden Hurst, \"more involved going forward.\" Baltimore did just that. Last week, Hurst set season-highs in snaps (44 percent), routes run (17), and targets (3). Hurst's touchdown came in garbage-time from Lamar Jackson, but it's certainly nice to see the rookie's usage start to ramp up after a foot injury slowed the start of his season. Still, fellow rookie Mark Andrews remains involved while Nick Boyle is primarily a blocker. Both Andrews and Hurst have super deep streaming appeal in Week 9 against a Steelers secondary that has allowed the fifth-most yards per game (73.1) and ninth-most fantasy points per target to tight ends.Floor and Ceiling: Kansas City Chiefs D/ST (88 percent available) vs. Cleveland Browns The Browns are in complete disarray after firing Hue Jackson and Todd Haley, while promoting Gregg Williams to interim head coach ahead of their Week 9 game against Kansas City. Good luck, Baker Mayfield! The Chiefs have finished as a top-eight fantasy defense in back-to-back games and are in a prime position to make it three-straight in Week 9. The last five defenses to face Cleveland have finished inside of the top-12 scoring D/ST's for fantasy while the Browns have plummeted to 30th in both yards and points per drive.Floor: Dallas Cowboys D/ST (89 percent available) vs. Tennessee TitansTennessee enters Week 9 ranked 30th in points scored per game (15.1), 28th in both yards and points scored per drive, and they've allowed the eighth-highest pressure rate on Marcus Mariota per Next Gen Stats (31.4 percent). On the flip side, Dallas is second-best in points allowed per game (17.6), second-best in points allowed per drive, sixth-best in sack rate (7.9 percent), and eighth-best in yards permitted per drive. Wrap it all up, and we've got an excellent streaming candidate in the Cowboys' D/ST at home in Week 9.Ceiling: Miami Dolphins D/ST (92 percent available) vs. New York JetsIt's by no means all Sam Darnold's fault, but we have to keep targeting the Jets inept offense with our fantasy D/ST's. New York is gaining the fourth-fewest yards per drive (24.7) while Darnold has absorbed multiple sacks and/or thrown multiple interceptions in 6-of-8 starts this season. Miami is far from an elite defense -- they're forcing pressure just 23.6 percent of the time (fifth-lowest rate; Next Gen Stats) -- but if Kansas City and Dallas are off the board, Miami is a fine low-end streamer for Week 9.-- Graham Barfield is the managing editor of fantasy football content at NFL.com. Follow him on Twitter @GrahamBarfield.\nMore Posts\nPhoto Essay\r\n"}