{"id": "Surprising Stats: Week 7", "paragraph": "  \nSeven is supposedly a lucky number. But you can't go through life depending on luck. You need the facts. You need the numbers.Here are some interesting stats that will get you on the path toward creating your own luck.Alex Collins scored two rushing touchdowns against the Titans in Week 6. Prior to Collins, no running back had scored a rushing or receiving touchdown against the Titans. None of the opposing running backs have exceeded 85 rushing yards or 46 receiving yards all year. Melvin Gordon and Austin Ekeler have scored more than one touchdown and/or one of them exceeded 100 yards rushing or receiving in all but one game this season. That was Week 3 in Los Angeles against the Rams.Keenan Allen hasn't gone over 100 receiving yards or scored a touchdown since Week 1. However, the Titans have allowed over 100 receiving yards and/or a touchdown to at least one opposing wide receiver in four of their six games. The only teams who didn't have a receiver hit that mark were the Jaguars in Week 3 and the Bills in Week 5.Deshaun Watson has been sacked a league-high 24 times. That's four sacks per game. The Jaguars haven't sacked the quarterback more than three times in a game, but they have three sacks in three of their last four outings.Blake Bortles has 375-plus passing yards in two of his last three home games. The last time he played the Texans, he completed 21 of his 29 pass attempts for 326 yards, three touchdowns, and no interceptions.In Greg Olsen's first game back from his foot injury, he played in 98 percent of the team's offensive snaps. Among tight ends, only Rob Gronkowski and Zach Ertz play over 98 percent of their team's snaps.Over the last four weeks, Zach Ertz scored 77.8 PPR points, the absolute most for a tight end. That would also make him the eighth-highest scoring wide receiver and ninth-highest scoring running back.The Minnesota Vikings scored two rushing touchdowns in Week 6 against the Cardinals. Latavius Murray scored one, and Kirk Cousins scored the other. Those are the only rushing touchdowns scored by a Viking all year. The Jets haven't yielded a rushing touchdown to a quarterback all year, but they have allowed four rushing touchdowns and one receiving touchdown to opposing running backs.Prior to Week 6, Jermaine Kearse caught seven passes for 71 yards. In Week 6, he caught nine passes for 94 yards, exceeding his season totals after the Jets lost Quincy Enunwa to a high ankle sprain.Tom Brady has six interceptions this year. From 2014 to 2017, he averaged 6.5 per season.Taylor Gabriel leads the team with 22 targets from Week 3 through 6. He also caught all 12 of his targets for 214 yards and two touchdowns over the last two games.Only three times in Derek Anderson's 13-year career has he thrown more touchdowns than interceptions in a season.The Colts sacked the quarterback 19 times this year, tied for the fifth most in the league. They have six interceptions, tied for the tenth most. They also boast four fumble recoveries, tied for the seventh most. None of those turnovers have resulted in a defensive touchdown.Antonio Callaway is only catching 37.5 percent of his targets, but over the last four weeks, his 32 targets are tied with Keenan Allen for the 18th most among wide receivers.Mike Evans still leads the Buccaneers in targets. The only game in which he was not the target leader for Tampa Bay, was in Week 6. That's it.Golden Tate has led the team in targets in all but one game this year. In PPR formats, he leads the team in fantasy points. However, both Kenny Golladay and Marvin Jones Jr. caught a touchdown in three of their last four games.Tyreek Hill hit 21.95 mph and 21.78 mph in Week 1, the fastest speeds of the year according to Next Gen Stats. But at No. 3 is Albert Wilson, hitting 21.74 mph in Week 3. And at No. 4 is Jakeem Grant, hitting 21.58 mph in Week 5.During the preseason, rookie Tre'Quan Smith caught 15 passes for 189 receiving yards and a touchdown. In Week 5 before the Saints' bye, Smith caught only three passes, but they went for 111 yards and two touchdowns. Smith led the Saints in air yards in the game. Prior to Week 5, Smith only had one catch for 18 yards during the regular season.Willie Snead has been on the field for 72 percent or more of the Ravens' offensive snaps over the last two weeks. He's had five-plus catches or scored a touchdown in all but one game this year. In Snead's first year as a Saint, he caught 69 passes for 984 yards and three touchdowns.Michael Gallup led the team's receivers playing in 81 percent of the team's offensive snaps, despite only catching one pass for 27 yards. That's the highest percent of snaps that any receiver has played in all season for the Cowboys.Jamison Crowder only once all season scored double-digit fantasy points in PPR formats. It was Week 3 when he caught four passes for 39 yards and a touchdown. He's already been ruled out for Week 7. Paul Richardson hit double-digits three times this year. In Week 2, 3, and 6. He's doubtful. None of the other wide receivers have gone over 10 fantasy points in PPR settings.Over the last four weeks, Robert Woods averaged 23.4 fantasy points per game in full point PPR formats. That is the third most among wide receivers, only behind Adam Thielen and Davante Adams. This week the Rams will be without Cooper Kupp, who averaged 19.05 fantasy points per game over that same span, the 11th most among receivers.Raheem Mostert played in 40 percent of the 49ers' offensive snaps, as compared to Alfred Morris' 2 percent. Mostert saw 12 carries, Morris saw zero. Mostert's 87 rushing yards was the most by a San Francisco running back since Breida rushed for 90 yards in Week 3.In every game this year either Tyler Boyd or A.J. Green have gone over 85 yards. Kansas City hasn't allowed that many yards to a wide receiver since Week 2.Kareem Hunt put up 171 receiving yards and two touchdowns on just 10 receptions this year. According to Pro Football Focus, he averages 16.0 yards after the catch.Eli Manning threw six touchdowns over the first six games of the season. Only one quarterback who also played in six games this year has less, and that's Josh Allen (2). Only one quarterback failed to throw at least three touchdowns against the Falcons this year, and that was Nick Foles in Week 1.Last week Tevin Coleman played in 57 percent of the team's snaps, while Ito Smith played in 46 percent. In 2017, Devonta Freeman played in 54 percent of the snaps while Coleman played in 42 percent.\nMore Posts\nPhoto Essay\r\n"}