{"id": "Jerry Jones on Cowboys' win vs. Eagles: We needed this most", "paragraph": "  \nPHILADELPHIA -- Jerry Jones was late arriving in the Dallas Cowboys' locker room, the season he bemoaned less than a week ago suddenly saved in the Philadelphia chill. But when he got there, he went right to the heart of his team, to the side-by-side lockers of Dak Prescott and Ezekiel Elliott. \"Wooooo!\" Prescott hooted at the boss. Jones replied in kind: \"Woooo!\" And then Elliott joined in, too, as Jones hugged them both. Wooo, indeed. There are few scenes in the NFL as reliable and telling as a Jones post-mortem after a Cowboys loss, when the owner vents and dissects as he did last week after Dallas lost to the Titans on Monday night. Then, Jones all but promised that big changes were on the way with the Cowboys' playoff chances slipping away. With their first road win of the season, a 27-20 cliffhanger over the Philadelphia Eagles -- who were so lethargic the home fans booed the defending Super Bowl champions -- the Cowboys put a halt, at least temporarily, to the Jason Garrett career post-mortems, the hand-wringing over Prescott's accuracy, the outsized angst that envelopes this team in equal measure with elation. The casket that some cheeky Eagles fans brought to the game to bury the Cowboys in? Instead, stuff it with the coaching wish lists that were drawn up last week. \n\"When you're feeling low and you're seeing the Grim Reaper and then come in and have your team perform the way these guys did, I promise you it's a special feeling,\" Jones said. \"I won't need any wings on that airplane getting back to Dallas.\"At some point, Jones might find a gray area in his feelings about his team, but that hasn't happened yet. With the next four games against the Falcons, the NFC East-leading Redskins, the Saints and the Eagles again, the Cowboys will need a lot more games like this one to stave off the changes that are still glaringly necessary. But in the giddy locker room -- where practically every player was told how proud a coach was of him -- those eternal Cowboys issues were pushed aside for a night. With the NFC East an unsightly mash-up of inconsistency and incompetence, Dallas could not afford to waste a brutally efficient game by Elliott -- who rushed for 151 yards on just 19 carries (7.9 yards per run) -- or a defensive performance that did not allow the Eagles to convert a third down in the first half and stopped them on two drives within the final 3:20 when Philly had a chance to tie the game.Garrett and offensive coordinator Scott Linehan -- whom NFL Network Insider Ian Rapoport reported Sunday was under consideration to be fired by Garrett during the Cowboys' bye week last month -- coached as if their jobs depended on it. They gave the Eagles a heavy dose of Elliott and ran a why-the-heck-not fake punt on fourth down to keep a drive alive, which resulted in a field goal. Not all of the Cowboys' problems are solved, though. If the play calling were more logical, not long after that fake punt Elliott would have gotten at least one touch when Dallas had first-and-goal from the Eagles' 8-yard line immediately after Elliott hurdled Eagles safety Tre Sullivan en route to a 32-yard gain. Instead, the ball never left Prescott's hand. And if Prescott had been more on target early in the game, the Cowboys might have buried the Eagles sooner. Still, the Cowboys are alive again and in the no-middle-ground world they inhabit, no one more so than Jones, that doesn't provoke the most obvious and maddening question -- Where has THIS team been all season? -- but ebullience that the race is still on. \"I know they needed it,\" Jones said of the Eagles, who dropped to 4-5 to tie the Cowboys for second place in the division. \"But no one needed this one more than we did.\" \nThe Cowboys will head to the similarly-desperate Falcons next week before a Thanksgiving Day showdown against Washington as a changed team -- they think. Linebacker Leighton Vander Esch spoke of the energy the team showed in practice this week. The question now is whether the Cowboys can sustain that attitude. \"We had no choice but to win,\" Elliott said. \"We did everything we had to do. I'm proud of these guys for coming into this environment and getting that win.\"Yes, Elliott said, he felt Dallas had saved the season. And, for at least one week, quieted the din of criticism and questions that serve as the soundtrack to every Cowboys season. \"We're the Dallas Cowboys,\" Elliott said, laughing. \"You guys love to make stories. We're used to ignoring that extra stuff.\" Follow Judy Battista on Twitter @judybattista.\nMore News >\n\nMore News >\nMore Dallas Cowboys Videos >More Dallas Cowboys Photos >"}