{"id": "Week 11 injury watch: Will Lamar or RG3 replace Flacco?", "paragraph": "  \nDuring his 11-year NFL career, Joe Flacco has never missed a game for anything less than a season-ending injury. That streak appears likely to end Sunday as the former Super Bowl MVP has yet to practice since suffering a hip injury during the Baltimore Ravens' recent loss to the Pittsburgh Steelers.Officially doubtful, Flacco will force Baltimore to make a difficult decision if he cannot play. Lamar Jackson has served as the backup quarterback and gadget player during the team's first nine games of the season, but it remains unclear whether head coach John Harbaugh and his staff plan to start the 2018 first-round pick this week. Instead, Robert Griffin III could ultimately fill Flacco's shoes despite spending every game this season on the inactive list. Which direction the Ravens choose will say volumes about Jackson's development.In addition to news out of Baltimore, teams across the league find themselves dealing with injury troubles of their own.Buccaneers: Chris Godwin (ankle) - Though the Buccaneers listed Chris Godwin as questionable, he practiced in full Friday, suggesting he will indeed suit up for Sunday's contest against the Giants. Whether Godwin or any of his offensive teammates can match their early season performances with Dirk Koetter now calling plays remains unclear.Chargers: Keenan Allen (hip, finger), Antonio Gates (knee), Mike Williams (groin) - The Chargers removed Keenan Allen from their final injury report despite multiple ailments. Meanwhile, Mike Williams also made it off the report despite a groin injury. Both will play Sunday against the Broncos. Antonio Gates could miss the contest with , however. Los Angeles listed him as questionable.Chiefs: Sammy Watkins (foot) - Sammy Watkins did not participate in Friday's practice, casting doubt as to his availability for Monday's heavily anticipated tilt between the Chiefs and Rams. Still, the extra day could make a difference in the wideout's recovery. Watkins, who also missed last week with his foot injury, compiled 17 receptions for 243 yards and two scores over his last three games.Lions: Marvin Jones (knee) - The Lions have already ruled out a laundry list of key contributors for Sunday's matchup with the Panthers, including lead receiver Marvin Jones. Jones' absence leaves just four healthy full-time wideouts on the roster, headlined by Kenny Golladay.Raiders: Martavis Bryant (knee), Jordy Nelson (knee) - The Raiders will play this week without any of their top wideouts after ruling out Martavis Bryant and Jordy Nelson, both due to knee injuries. Their absences likely mean another busy day for tight end Jared Cook, who leads the team in targets (59), receiving yards (546) and touchdowns (three).Rams: Cooper Kupp (knee) - Though the Rams took some time to confirm it, Cooper Kupp will miss the rest of the season with a torn ACL. Head coach Sean McVay confirmed Friday that Kupp had undergone surgery, which could mean the wideout returns to the fold before the start of the 2019 season. Either way, Los Angeles will use Robert Woods more extensively in the slot moving forward with Josh Reynolds seeing more action in the team's preferred three-receiver sets.Ravens: Joe Flacco (hip) - Though Joe Flacco hasn't missed many games during his NFL career, his status for Sunday appears in serious jeopardy after the Ravens listed him as doubtful with a hip injury. Without Flacco, the rest of the team's offensive starters would feel the effects, especially receivers John Brown and Michael Crabtree. Baltimore has left Robert Griffin III inactive every game this season, but he could potentially start over first-round pick Lamar Jackson if Flacco can't go, though Baltimore hasn't revealed their plans.Steelers: James Conner (concussion) - With Le'Veon Bell officially unavailable for the rest of the season, James Conner will have every opportunity to finish off his breakout campaign. However, the second-year back suffered a concussion during the Steelers' Week 10 game against the Panthers. The team has removed Conner from the injury report, but he has not yet officially received clearance from the concussion protocol.\nMore Posts\nPhoto Essay\r\n"}