{"id": "Injury roundup: Bears place Kyle Long (foot) on IR", "paragraph": "  Kyle Long's season as part of the promising Chicago Bears has hit a snag.Chicago placed Long on injured reserve Saturday. The veteran guard suffered a foot injury late in the Bears' Week 8 win over the New York Jets.Chicago has a few options to replace Long at guard. The Bears could insert Eric Kush in the spot (shifting him from the left side to the ride), or slide Bryan Witzmann, who has experience playing under head coach Matt Nagy, into the starting role. Rookie James Daniels, who has been in the two-deep behind Kush, is also available.Elsewhere in injury and transaction news Saturday:1. The Minnesota Vikings expect to have running back Dalvin Cook (hamstring) on Sunday for a package of plays, assuming he has a good warmup, NFL Network Insider Ian Rapoport reported Saturday night. However, sources tell Rapoport that wide receiver Stefon Diggs (ribs) is a long shot to play.The Vikings elevated receiver and preseason fan favorite Chad Beebe to the active roster and waived tackle Storm Norton.2. The Buffalo Bills downgraded quarterback Derek Anderson and linebacker Tremaine Edmunds to out for Sunday, as both are still in concussion protocol. Nathan Peterman will start under center for the Bills.3. The Arizona Cardinals released quarterback Sam Bradford on Saturday. Bradford signed a one-year, $20 million contract with the Cardinals in the offseason, but lost his starting job to rookie Josh Rosen late in a Week 3 loss to the Bears.4. Houston Texans receiver Keke Coutee (hamstring) has been downgraded to out and will not travel with the team to Denver for Sunday's game against the Broncos, according to the team. The same fate has been decided for corner Aaron Colvin (ankle).5. The Dallas Cowboys will be without receiver Tavon Austin (groin), defensive lineman David Irving (ankle) and linebacker Joe Thomas (foot) in their game against the Tennessee Titans. Less than a week after firing their offensive line coach, they might also be without guard Zack Martin (knee) and defensive end Randy Gregory (knee), who were both listed as questionable in Saturday's injury report. Tight end Geoff Swaim (knee) is doubtful after not practicing all week.6. The Tennessee Titans will not have linebacker Derrick Morgan (shoulder).7. The Los Angeles Chargers placed linebacker Kyzir White (knee) on injured reserve and signed cornerback Jeff Richards with the open roster spot.8. After trading away Golden Tate, the Detroit Lions hosted former Texans receiver Bruce Ellington for a workout Saturday, NFL Network Insider Ian Rapoport reported.9. The Green Bay Packers downgraded wide receiver Geronimo Allison (hamstring/groin) to out against the New England Patriots. Green Bay also signed former Chargers punter Drew Kaser, even though J.K. Scott has not been listed on the injury report.\nMore Posts\nPhoto Essay\r\n"}