{"id": "Next Gen Stats: Week 7 fantasy football matchups", "paragraph": "  \nNow in its third season, Next Gen Stats has quickly exploded. The statistics are featured in game broadcasts, they are leveraged in countless articles, tweets, and podcasts throughout the week, and the Next Gen Stats database is free to access.In this weekly column, we'll dive deep into Next Gen Stats' metrics and explore player and team-based matchups. The goal is simple: Next Gen provides truly unique analytical data we can use to uncover edges when making fantasy lineup decisions. Most importantly, Next Gen Stats' data coffers make us more informed viewers of the game.Let's break down the Week 7 slate through the lens of Next Gen Stats.Key Matchup: Philip Rivers' Career Best Start vs. Titans Up and Down SecondaryPhilip Rivers is off to inarguably the best start of his long, underrated career. The Chargers are (finally) legitimate AFC contenders this season -- thanks in large part to Rivers' stellar play. Per Next Gen Stats, Rivers is the only QB in the NFL to have a passer rating over 100 under pressure, in tight windows (less than one yard of target separation), on quick throws (less than 2.5 seconds), and on deep passes (20+ yards downfield):Per @NextGenStats, here is Philip Rivers' Passer Rating by situation:Under Pressure: 123.4 (first)Kept Clean: 112.4 (ninth)Tight Window Throws: 121.4 (first)Deep Pass: 116.5 (eighth)Under Center: 147.7 (first)Shotgun: 103.0 (seventh)Fresh off an efficient drubbing of the Browns (207 yards, 2 TDs on just 20 attempts), Philip Rivers and Co. travel to London to face an uneven Titans secondary. Whereas Adoree Jackson is playing out of his mind (57.2 passer rating allowed), Malcolm Butler is getting routinely whacked. Butler gave up another TD last week, this time to Michael Crabtree. On the full campaign, Butler has allowed a 13 percent completion rate above expectation (eighth-worst), a 132.1 passer rating (11th-worst), and 11.2 yards per target (12th-worst). Look for Rivers to relentlessly target Butler's coverage in Week 7.Key Matchup: Bears Front Seven vs. Sony Michel Even though they did not show up on the road in Miami in Week 6, Chicago's front seven is obviously still nasty. The Bears are third in sack rate (9.0 percent) despite blitzing at league-low levels, per Next Gen Stats (19.6 blitz rate; fourth-lowest). Chicago is also doing a fantastic job limiting big runs, as just seven percent of rushes against them have gained 10 or more yards. That's the best clip in the NFL. The Bears don't have a single standout run defender, though. They're just doing an excellent job limiting big plays. As a whole, just 13.1 percent of runs against their feisty front have been stuffed for zero gain (or a loss), per Next Gen Stats. That's second-lowest in the NFL.However, this week represents the Bears toughest test to-date. Sony Michel has 80 or more rush yards in three-straight games and he is presently eighth in success rate among all RBs with 15 or more carries in this span. Chicago needs to find a way to plug gaps when the Pats spread the Bears out. Because, per Next Gen Stats -- Sony Michel is third in YPC (7.5), third in gains of 10 plus yards (23.8 percent), and second in success rate (72 percent) when facing a light box (six or fewer defenders). Per Next Gen data, the Bears have allowed just 4.0 YPC and a 50 percent success rate when they have just six defenders in the box (NFL average is 5.0 YPC; 52 percent success rate).Key Matchup: Andrew Luck vs. Air Yards At long last, Andrew Luck appears to be close to fully healthy. Slowly but surely each week, Luck's air yards per pass attempt have risen. Keep in mind, T.Y. Hilton (hamstring) hasn't played a full game since Week 3:Andrew Luck's updated air yards per pass attempt (via @NextGenStats). He's airing it out more and more each week, even though T.Y. Hilton (hammy) isn't healthy:Week 1 - 5.3Week 2 - 4.6Week 3 - 6.2Week 4 - 8.1Week 5 - 8.2Week 6 - 9.1Now, Luck faces a sneaky Bills secondary that is allowing the sixth-fewest air yards per attempt (7.11), the seventh-fewest fantasy points per dropback, and the ninth-worst passer rating (82.1). Buffalo's 2.4 percent completion rate below expectation is 13th-best. T.Y. Hilton is pushing to return this week, but regardless of his health, it's fantastic to have Luck getting back to his normal self.Key Matchup: J.J. Watt Returning to Form vs. Jags Offensive LineHealthy off of scary back and leg injuries in back-to-back years that nearly threatened to derail his career, J.J. Watt has completely returned to his previous form.Among all defenders with 100 snaps on the season, Watt is second in stuffed runs (9), fifth in QB pressures (23), and he's tied for the league lead in sacks (7) -- per Next Gen Stats. What's more, Watt has recorded multiple QB hits in 4-of-6 games and now has a dream matchup in Week 7. When Watt moves over to the defensive right side, he'll face the Jags' replacement for Cam Robinson (ACL) at left tackle. Over the last two weeks, Jags' LT Josh Walker has allowed the most QB hurries per snap in the league (PFF). Look out.Key Matchup: Is This Kerryon Johnson's Breakout Week?This might finally be the week we've all been waiting for. Theo Riddick (knee) is banged up and not practicing out of the Lions bye, perhaps giving Kerryon Johnson the snaps and opportunities he needs to finally have a deserved monster game.On the year, the Dolphins have allowed the sixth-most yards from scrimmage to RBs (166.8), largely because of their shoddy coverage from linebackers. Only the Falcons (8.8) and Chiefs (7.7) are allowing more receptions per game to running backs than the 'Fins (7.2). Per Next Gen Stats, Miami is allowing a cool 106.9 passer rating to receivers out of the backfield (sixth-worst). If Riddick does indeed miss Week 7, his absence would open up 20.0 routes and 6.0 targets per game in the Lions offense. That's an incredibly valuable role for Johnson to roll up.On the ground, Johnson will face a fair task against a Miami front seven that is stuffing runs at or behind the line of scrimmage just 19.7 percent of the time (18th-of-32). The Dolphins rarely stack the box, too, committing eight or more defenders to the tackle box on 18.6 percent of rush plays (11th-lowest rate). It's likely Miami will be unable to stack the box often against a Detroit team that runs 11-personnel (3WR) 60 percent of the time, per Next Gen Stats. If Riddick misses, this sets up as an incredibly attractive breakout spot for Johnson ... until LeGarrette Blount vultures two goal-line TDs.Key Matchup: Adam Thielen's Continued Nuclear PaceOnce again, Adam Thielen finds himself in a blowup spot. As we mentioned in this space last week, Thielen avoids more difficult matchups on the outside because he runs half of his routes from the slot, per Next Gen Stats. As a result, Thielen nuked the Cards (11/123/1) because he primarily avoided Patrick Peterson's lockdown boundary coverage.This week's upcoming burn victim is Jets' slot cover man, Parry Nickerson. New York is allowing the third-most receiving yards per game (133.2) to opposing slot wideouts, per Next Gen data. Just wait. It gets worse (for the Jets). Among the 113 cornerbacks to see at least 15 targets when they are the nearest defender to a receiver, Nickerson (128.9) owns the 15th-worst passer rating and plays press coverage on a lowly 4.8 percent of his snaps, the seventh-lowest rate. Adam Thielen is about to run wild in the slot against the Jets' leaky, free-release slot scheme.Key Matchup: Carson Wentz's Less Aggresive Approach vs. PanthersCarson Wentz is back to balling.Over the last three weeks, Wentz has thrown for 275 yards and/or multiple scores in each game while his 3.9 percent completion rate above expectation in this span is fourth-best (per Next Gen Stats). Wentz's 110.8 passer rating (fourth-best) in this hot-streak largely stems from the Eagles less aggressive aerial approach:Wentz's air yards per attempt have fallen by 2.2 yards year-over-year, creating more efficient throws within the context of the Eagles offense. It's a large part of the reason Wentz's completion percentage is up 8.2 percent, year-over-year, in 2018. This week, the Eagles face a sneaky draw against a Panthers' side that is limiting production in the short and intermediate areas. On throws that travel between 0-19 yards in the air, Carolina has the eighth-lowest passer rating (87.8), they have the ninth-lowest success rate (54 percent), and have permitted the second-lowest yards after catch (3.5) on such throws. Wentz and Philadelphia's white-hot pass offense needs to be precise to beat the Panthers somewhat stingy secondary.Key Matchup: Jarvis Landry's Get-right SpotThis might be the most obvious squeaky wheel, get-right matchup of the season. How bad do you think the Bucs' secondary has been this year? Stone awful, right? They've been worse than that. A lot worse.Tampa is last in passer rating (123.9), last in pass YPA (9.2), last in success rate (56%), last in pass TD rate (8.1 percent), and last in fantasy points allowed per passing dropback (0.66). What's more, no team is allowing more yards per game to enemy slot wideouts than Tampa Bay (172.8) as interior defender, M.J. Stewart, continues to struggle. Among 113 qualifying cornerbacks, Stewart has allowed a 142.7 passer rating when he's the nearest defender to a receiver. That's fourth-worst in the NFL. Landry runs 60 percent of his pass routes from the slot, per Next Gen Stats.It's been a quiet three-week stretch for Landry (4/34/1, 5/69, 2/11 receiving), but he's still commanded 23 percent of team targets and 18 percent of air yards. Both figures are second-most on Cleveland. Additionally, eight of Baker Mayfield's 19 red-zone pass attempts have gone to Landry, too. In fantasy, we chase opportunity over recent production. All in on Landry.Key Matchup: Drew Brees vs. Ravens BlitzDrew Brees and Co. have their toughest test to date in Week 7 on the road in Baltimore. The Ravens have the most underrated defense in the NFL and can beat down enemy aerial attacks from a number of angles. This year, Baltimore leads the NFL in sack rate (10.8 percent), they've held opposing QBs to a 12.0 percent completion rate below expectation (best), and allowed a league-low 65.4 Passer Rating.The Ravens have an incredibly aggressive scheme that utilizes five or more defensive backs on the field nearly 80 percent of the time. With all of their speed on the field, the Ravens blitz at the league's third-highest rate (35 percent). When the Ravens send five or more rushers, they are getting home for the league's second-best sack rate at an enormous 20 percent. Baltimore's 55.5 passer rating allowed when blitzing is third-best behind only the L.A. Chargers and Tennessee.Now, we have a classic strength on strength battle. Drew Brees is elite in a lot of categories, but he's absolutely diced up opponents when facing blitzes this season. I can't wait to see what Brees and Sean Payton have schemed up against one of the league's best defenses:Key Matchup: What is the Key to the Rams Rush Offense?No one can slow down Todd Gurley.After his incredible 2017 season in which he finished with 25.8 PPR fantasy points per game (12th-best all-time), Gurley is re-writing the history books this season. He's averaging a monster 29.0 FPG while his weekly finishes over his last 10 regular season contests are so consistent, they nearly look fake.Now, Gurley faces a Niners run defense that has quietly played fairly well. San Francisco loads the box with the second-most defenders per rush (7.15), leading to their decent 3.96 YPC allowed (tenth-best). Unfortunately for San Francisco, Los Angeles won't allow the 49ers to run their normal defense in Week 7. The Niners send eight or more defenders into the tackle box at the fourth-highest rate (30.2 percent), but the Rams highly-spaced and constant-motion offense open up gaping rushing lanes for Gurley.Head coach Sean McVay has done a masterful job crafting L.A.'s attack. All of Gurley's 129 carries have come out of 11-personnel (3WR) this season, naturally creating space within defensive gaps. As a result, 47 percent of Gurley's attempts come against six or fewer defenders (lowest rate in the league):San Francisco is fine against the run when they get into their normal scheme, but they are getting whacked for 6.3 YPC when they have six or fewer defenders in the box, per Next Gen Stats. That's fifth-worst in the NFL. In fact, 27.3 percent of runs against San Francisco have gained 10 or more yards when they have six or fewer defenders in the box (worst in NFL). Ouch.Key Matchup: Dak Prescott vs. PressureThis has been a common theme in this space all year, but Dak Prescott is really struggling against pressure. It's largely because his receivers can't separate. Per Next Gen Stats, Cowboys' receivers are earning just 2.4 yards of separation at the target point when Prescott is under duress -- the second-worst figure in the NFL. Only Sam Darnold's receivers (2.2 yards of separation) do a worse job at getting open when there is pressure.As a result, Prescott is 29th (of 34) in completion rate, 29th in YPA, and 27th in passer rating when under pressure this season, per Next Gen Stats. That is going to a problem in Week 7. The Redskins have pressured opposing QBs on 31.9 percent of dropbacks (fourth-highest rate in NFL) and generated a 51.5 passer rating when the opposing QB is under duress (average is 58.0). Prescott must get the ball out quickly this week as he can ill afford to hold onto the rock at his usual clip (3.03 seconds; third-slowest time to throw).Key Matchup: How Will Bengals Elect to Cover Tyreek Hill?The primary concern for the Bengals this week has to be Tyreek Hill. Head coach Andy Reid has done a masterful job at utilizing Hill's unique skill-set -- lining up him out wide 55 percent of the time, putting him in the slot on 38 percent of his snaps, and splitting him out in the backfield or in tight at a 6 percent clip. This Next Gen Stats heatmap shows Hill's diverse alignment:I have no idea how the Bengals will try to cover Hill.Stay-at-home right corner, William Jackson, plays press coverage 55 percent of the time (eighth-highest rate) which ... doesn't work against Hill. Left corner Dre Kirkpatrick has been more effective than Jackson this season, but he presses quite often as well (44 percent; 22nd-of-103). This season, Hill has faced press coverage on just nine of his 51 targets. When defenses are silly enough to press Hill, he has roasted them for 6/171/2. What's more, when Hill travels into the slot, he'll face Tony Mcrae -- who is filling in for the injured Darqueze Dennard (shoulder). Mcrae has played 70 snaps in his career. Good luck, Bengals!Key Matchup: Saquon Barkley. That's It. There is not a single better individual matchup for Saquon Barkley than the Atlanta Falcons. Opposing offenses are targeting their running back a monstrous 11.0 times per game against Atlanta, by far most in the NFL. Unsurprisingly, no team is allowing more receptions per game to enemy backs than the Falcons. Atlanta's (lack of) running back coverage certainly isn't a secret. It's been a problem for three years running as the Falcons defense has led the NFL in receptions allowed per game to RBs from 2016-18.Per Next Gen Stats, receivers that line up out of the backfield catch 80.4 percent of their passes against the Falcons hapless coverage (third-highest rate). Saquon is presently second behind only Alvin Kamara in targets per game among RBs (8.5) while Atlanta has coughed up 14/102 (Christian McCaffrey), 15/124 (Kamara), 6/55 (Bengals RBs), 4/75 (James Conner), and 7/40 (Bucs RBs) in Weeks 2-6. Just for fun, the all-time record for receiving yards in a single-game by a running back was set by Marshall Faulk in 1999 (12/204/1 receiving). Checkdown QB Eli Manning will pepper Barkley with targets against the Falcons banged up defense.-- Graham Barfield is the managing editor of fantasy football content at NFL.com. Follow him on Twitter @GrahamBarfield.\nMore Posts\nPhoto Essay\r\n"}