{"id": "LeSean McCoy: 'Who knows' if Bills will trade me", "paragraph": "  \nIf it was the end for LeSean McCoy in Buffalo, it would finish in disappointment. The Bills running back struggled again on the ground, gaining just 13 yards on 12 carries in Monday night's 25-6 loss to the New England Patriots, for a ghastly 1.1 yards per carry average. McCoy dashed for 12 yards on his first carry, but the rest of the way he generated 1 yard on 11 totes, including a bevy of negative rushes. McCoy did pace the Bills with 82 yards receiving on six catches, as Derek Anderson played \"find my dump-off before I get killed,\" but the running back was focused on his ground-game struggles.  \"I ain't expect to have no season like this,\" he said, via ESPN's Mike Rodak. \"I'm not really playing well at all. We're not doing much on offense. ... What do I got, 200 yards? In the [eighth game]? That's never happened to me. Yeah, it's different. It's a different season. I'm 30 years old, playing since when I've been in high school. This stuff [has] never happened to me. It is tough.\" On the season, McCoy has 257 rushing yards on 75 attempts, for a career-low 3.4 yards per carry average. Shady views the struggles as a product of how defenses are approaching a feeble Bills offense. \n \"I still can play,\" he said. \"Defenses know I still can play. You see the way they approach me when I'm in the game.\" Given McCoy's propensity to bounce around in the backfield searching for the big play, battering ram Chris Ivory has actually been better for the Bills offense of late behind a terrible offensive line. McCoy's prosperity to dance in the backfield doesn't mesh with the poor blocking. The confluence of struggle has McCoy's name in the rumor mill as a player who could move before Tuesday's 4 p.m. ET trade deadline. McCoy said \"who knows?\" when asked if he thinks he could be traded, but the running back noted he's not looking to escape a bad offensive situation in Buffalo.  \"This is my team,\" he said. \"They've done a lot to me. Loyalty to me. I'm happy here. But it doesn't matter whether I was here or anywhere else, playing a season like this, you would be mad. I don't think it's a matter of where I'm at. It's just what's been taking place and how things are going offensively.\" A team like the Eagles might benefit from McCoy's skills, but given his age and contract -- even if it's not onerous -- likely wouldn't bring a ton back in compensation. Could Buffalo afford to get rid of an offensive talent on a team devoid of weapons? \nMore Posts\nPhoto Essay\r\n"}