{"id": "Gil Brandt to be inducted into Dallas Cowboys Ring of Honor", "paragraph": "  \nMove over, Captain America. Make room, Triplets. You, too, Mr. Lilly.Former Dallas Cowboys executive Gil Brandt will be the 22nd member of the team's Ring of Honor, owner Jerry Jones announced on Friday. Brandt will be inducted at a ceremony on Nov. 29, at halftime of Dallas' Thursday night game against the New Orleans Saints at AT&T Stadium (Live on NFL Network).\"When Jerry called me with the news, it was on par with walking off the field after winning the Super Bowl,\" said Brandt, who spent 29 seasons in the Cowboys' front office as the team's lead scout and contract negotiator -- his final after the 1989 draft in which he selected Troy Aikman, one of 19 players currently in the team's Ring of Honor, 15 of which Brandt personally acquired via the draft or trade.As the Cowboys' vice president of player personnel, Brandt was responsible for the acquisition of 15 players who went on to be inducted into the Pro Football Hall of Fame and 53 who made at least one Pro Bowl. He scouted Historically Black Colleges before anyone one else did, he converted players from other sports into all-pros and was among the first to scout players from other countries.HONOREDhumbledPROUD#CowboysRingOfHonor#AmericasTeam pic.twitter.com/DXRsfWw0aFHe pulled off two trades -- each for the second pick in the draft -- that netted Hall of Famers Tony Dorsett and Randy White. His 1964 draft produced three Hall of Fame players -- Mel Renfro, Bob Hayes and Roger Staubach -- and the 1975 \"Dirty Dozen\" draft that reaped White also included four other Pro Bowl players.Brandt will become the third non-player to be inducted into the Ring of Honor and will re-join the triumvirate that built an NFL expansion team in 1960 into a league dynasty. Six years after Tex Schramm, Tom Landry and Brandt began laying the foundation, the Cowboys embarked on an NFL-record streak of 20 consecutive winning seasons, including 13 divisional championships, five NFC crowns and victories in Super Bowls VI and XII.\"I hope my heart and legs will be strong enough to survive that moment,\" the 85-year-old Brandt said about the name unveiling later this month. \"To see my name up there with guys like Roger Staubach, Bob Lilly, Drew Pearson, Lee Roy Jordan -- these all-time greats not only with the Cowboys franchise but in the history of our great game -- it overwhelms me.\"This has been quite a year for Brandt, who became a finalist for induction into the Pro Football Hall of Fame in August. He needs 80 percent voting support by the 48-member selection committee that will cast votes the day before Super Bowl LIII in Atlanta. Many believe Brandt's Hall of Fame chances got a boost Friday, although Jones downplayed the significance.\"Gil doesn't need any help relative to the Hall of Fame,\" Jones said. \"That was a wonderful team of people that Gil was a part of -- Gil, Tex, Tom and the owner Clint (Murchison). They were in sync. Two of them are in the Hall of Fame today. It will really be completed when Gil gets in. Gil gets there, period, without the Ring of Honor.\"Follow Andy Fenelon on Twitter @Andy_Fenelon.\nMore News >\n\nMore News >\nMore Dallas Cowboys Videos >More Dallas Cowboys Photos >"}