{"id": "Offensive player rankings, Week 9: Mayfield gets fresh start", "paragraph": "\nI'm not going to sugarcoat it: The Cleveland Browns have already stunted Baker Mayfield's development by about half. And he's been in the building for less than a year. How did this happen?Six games into his young career, Mayfield's 78.9 passer rating ranks 29th out of 34 qualifying quarterbacks, per Next Gen Stats. When comparing passer rating by situation, the No. 1 overall pick ranks in the bottom third when under pressure (28th), against the blitz (29th), on quick passes (25th) and on deep passes (23rd). But you don't need to see these numbers to know that Mayfield, who struggled again Sunday against the Pittsburgh Steelers, has been anything but comfortable. \nAs much as I like the recently fired Todd Haley and Hue Jackson as play designers, their track records should've tipped us off early on that neither was a great fit for developing Mayfield. (The reported tension between the two certainly didn't help matters, either.) Both coaches are creative with formations and putting players in positions to succeed -- Haley did a good job of finding ways to get Jarvis Landry the ball -- but both became household names working with traditional pocket passers. And that's simply not Mayfield. Trying to force the young passer to work between the tackles like an Andy Dalton or a late-career Ben Roethlisberger negates the improvisational skills that made Baker a Heisman Trophy winner.In all honesty, Mayfield dodged a bullet here and I think he knows it. NFL Network Insider Ian Rapoport reported Monday that Mayfield \"won't miss\" Jackson because it was clear the coach wasn't going to be there going forward.The Browns have drafted four other QBs in the first round since 1999 and not one has panned out. There's still plenty of time to prevent Mayfield from suffering the same fate as his predecessors, though, and that responsibility now falls to new offensive coordinator Freddie Kitchens. I'd like to see the first-time play-caller use Mayfield as a point guard, spreading the field and giving him opportunities to make decisions out of run-pass option plays. At Oklahoma with Lincoln Riley, a top NFL head-coaching candidate, Mayfield was doing just that. He did major damage with RPOs, extending plays with his legs and using great field vision to get the ball out of his hands to his playmakers. Just look at the success guys like Deshaun Watson, Patrick Mahomes and Carson Wentz have had early in their careers. Their respective NFL coaches cater the offense to their strengths and in turn, the player and offense thrive. This hasn't been the case with Mayfield in Cleveland.I can relate to Mayfield in terms of operating in an unfamiliar offense as a rookie. At Fresno State, our offense thrived in a quick-rhythm pass game that allowed me to occasionally take shots downfield. When I arrived in Houston, which was a young expansion team in 2002, we ran a downfield passing game with option routes that required me and my receivers to make reads on the fly. Couple that huge learning curve out of the gate with a poor offensive line, and let's just say it wasn't great. I remember how uncomfortable I felt, and I can see Mayfield living those same frustrations.Mayfield has shown flashes of greatness and made the Browns competitive for the first time in several years. He has weapons in the pass game with Jarvis Landry, Antonio Callaway and David Njoku, and running backs Duke Johnson and Nick Chubb are good enough to give the offense balance. I have full confidence that he can turn his season around. More importantly, I have full confidence he can avoid joining that long list of Browns quarterbacks who didn't reach their potential. Regardless of what the Browns \"do\" to him, Mayfield will do fine because of his talent. But, I want to see him get the chance to become the player the Browns envisioned when they drafted him. Come on, Cleveland. Don't mess this one up.Each week in the 2018 campaign, former No. 1 overall pick and NFL Network analyst David Carr will take a look at all offensive players and rank his top 15. Rankings are based solely on this season's efforts. Now, let's get to it -- the Week 9 pecking order is below.NOTE: Arrows reflect changes from last week's rankings.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDropped out: Tyreek Hill, WR, Chiefs (previously No. 13).JUST OUTSIDE THE TOP 15Tyreek Hill, WR, Chiefs: Hill continues to be one of the best deep threats in the NFL. In the Chiefs' win over Denver, Hill hauled in his ninth reception of 20-plus air yards this season. And since 2017, Hill has 13 catches of 40-plus yards (most in the NFL).\nOdell Beckham Jr., WR, Giants: Beckham had a big day in Sunday's loss (eight receptions for 136 receiving yards) and is the reason the 1-7 Giants are still watchable.Julio Jones, WR, Falcons: It feels like the 3-4 Falcons are in a win-or-go-home situation. Sitting behind the Saints (6-1) and Panthers (5-2) in the NFC South, the Falcons need to find a way to get Jones the ball in the end zone. (I feel like a broken record.)Kareem Hunt, RB, Chiefs: The second-year back leads the team in scrimmage yards (854) and scrimmage touchdowns (10) this season.Stefon Diggs, WR, Vikings: Diggs played well against a Saints defense that is improving by the week, with 10 receptions for 119 receiving yards and a TD.Follow David Carr on Twitter @DCarr8.\nMore News >\nMore Videos >More Photos >More Gear >"}