{"id": "Patriots OC: James White a 'really special guy'", "paragraph": "  \nNew England Patriots rookie running back Sony Michel, who leads the team in rushing, avoided a serious knee injury and is on the mend for now. Michel's presence in the backfield will be missed because he has helped the Patriots achieve offensive balance during the team's current four-game winning streak. The Patriots, however, have full confidence in fifth-year pro James White's skillset to help fill the void as a rusher and receiver. \"He's always been a very hard worker, a very diligent guy, knows his assignments very, very well,\" Patriots coach Bill Belichick told reporters Tuesday, via the team transcript. \"Asks questions like a coach would ask them. Has an ability to think really far ahead of what problems could occur on certain fronts or looks or what have you. He does a great job of that.\" With 40 carries through the first seven games, the 5-foot-10, 205-pound White hasn't been relied upon as a rusher. Michel emerged as the featured rusher and leads in rushing with 95 carries for 422 yards and four touchdowns. White, however, has more than proven his worth as a receiver out of the backfield and leads the team in receptions (45), targets (61) and touchdown catches (6) though seven games. And during the team's past four games, White totaled 31 catches for 255 yards and four touchdowns on 41 targets. Impressive production for a running back in the passing game, especially when considering quarterback Tom Brady has a plethora of weapons to choose from on any given down. What has helped White become a trusted weapon and stand out, however, surrounds his versatility, work ethic, experience in the Patriots offensive scheme and ability to absorb information on a weekly basis. \"He does a tremendous job of digesting and jumping into our game plan and knowing it inside and out in terms of his overall preparation,\" offensive coordinator Josh McDaniels said. \"There's not many guys that we've had that have done it to the level he's done it, and we've got a lot of great guys that we can talk about. This guy's a really special guy in terms of how hard he works, the type of preparation he puts in and the type of teammate he is.\" Still, the Patriots will need more than White's receiving skills out of the backfield for the short term. With Michel on the mend, the Patriots have just White and Kenjon Barner as running backs on the active 53-player roster. But whatever the Patriots require of White going forward either as a rusher or receiver, the coaching staff believes he'll accomplish any task without hesitation by placing team needs first. \"He's extremely unselfish, he'll do anything you ask him to do, doesn't matter what it is,\" McDaniels said. \"He wants the team to win and he always puts the team first. He comes to work every day ready to go, notepad open, takes notes, makes sure he understands what's being asked of him and then goes out there and practices hard every single day to make sure that he's on top of his assignments and he's doing the things that he has to do in our game plan to help us win. So couldn't ask anything more from a teammate than James White.\" \nMore Posts\nPhoto Essay\r\n"}