{"id": "Jerry Jones gives Garrett vote of confidence after win", "paragraph": "  \nThe Dallas Cowboys knew their backs were against the wall. A loss to the Eagles would have all but ended their season. A blowout could have gotten everyone fired. Instead of wilting, the Cowboys rode Ezekiel Elliott and a good defense to a road victory in Philly that pulled Dallas one step away from the endless abyss. For at least one week, the Cowboys kept their playoff hopes from going comatose. Owner Jerry Jones cooed about how his team responded to adversity. \"This is particularly rewarding,\" Jones said of the win, via the Dallas Morning News. \"We were being laid to bare. This past week and really building up to this past week, we were being really operated on and looked to see what's there. These guys, these players, and frankly Jason [Garrett] and these coaches, when we really cut really deep in this surgery they came out of here and looked like it's not terminal. Seriously. I'll be real clear about that. \"The criticism and the things that have been pointed to this week, throughout, whether it be the coach, whether it be the quarterback, whether it be any other part of this team, is not terminal. I've looked in the wound, and I like what I see.\" If you are of anti-Garrett sentiment, that quote can only be viewed as Jones searching for a reason to keep a coach most of the fan base has long since soured on. On the other hand, it's a positive that the coaching staff coaxed an inspired performance. Yes, it wasn't flawless, with Dak Prescott struggling for spurts. But the Cowboys leaned on their workhorse Elliott, and earned a needed road win. Desperate times can show a team's true colors. It's a week-to-week league, so while Jones is flying high now, and giving Garrett votes of confidence, we'll check back in four weeks after the Cowboys have gone through matchups against Atlanta, division-leading Washington, NFC-leading New Orleans, and the Eagles again. \nMore Posts\nPhoto Essay\r\n"}