{"id": "Eric Reid grievance against Bengals denied by arbitrator", "paragraph": "  A grievance the NFL Players Association filed on behalf of Panthers safety Eric Reid after his free-agent visit to the Bengals this spring has been denied by an arbitrator, according to sources informed of the decision.Arbitrator Shyam Das ruled the Bengals were within their rights to ask Reid if he was going to continue kneeling during playing of the national anthem, the sources said. The Bengals did not sign Reid, who remained unemployed until the Panthers added him to their roster.The NFLPA had argued the Bengals based their decision to pass on Reid solely on his answer to the question about the anthem. The union believed it was a precondition of employment that violated the CBA, particularly since the NFL had yet to institute its anthem policy requiring players to either stand on the sideline during the anthem or remain in the locker room. The league then put that policy on hold in July while continuing conversations with the players on a resolution to the issue. The sides have yet to reach an agreement on a new policy.Reid has continued to kneel during the national anthem this season while with the Panthers to protest social injustice and racial inequality.Reid, who signed with the Panthers in September, was in a pre-game altercation with Philadelphia safety Malcolm Jenkins ahead of Sunday's win over the Eagles. After the game, Reid accused Jenkins of stealing away the social inequality movement among NFL players and labeled him a \"sellout.\"Reid's collusion grievance against the NFL is still pending and is not expected to be heard in the near future. An arbitrator recently sent Colin Kaepernick's collusion grievance to trial, thus denying the league's request to throw out the case.Statement from NFLPA on Eric Reidâ\u0080\u0099s grievance against the #Bengals being denied. pic.twitter.com/In2Puv2QI5Reid's attorney Mark Geragos, who is also representing Kaepernick, had no comment on the matter. The NFL also did not have any immediate comment on Das' decision.\nMore News >\nMore Videos >More Photos >More Gear >"}