{"id": "Packers' latest loss to Seahawks might usher in end of an era", "paragraph": "  \nSEATTLE -- Clay Matthews swooped in from the side and popped the football free, and teammate Tramon Williams lunged onto the turf to recover it, a heavenly takeaway made possible by two veterans acutely familiar with the Green Bay Packers' heartrending history at CenturyLink Field.Seven seconds into Thursday night's crucial clash with the Seattle Seahawks, the Packers had made a swift and emphatic statement, forcing a Chris Carson fumble and recovering at the Seattle 29-yard line. And as Aaron Rodgers skipped onto the field to take his first snap of the night, the 14th-year quarterback could barely contain his glee.As Rodgers recalled later as he exited the stadium, \"What a way to start. I thought, Here we go! This is gonna be our night.\"\nInstead, to the quarterback's dismay, it was another Seattle nightmare in the making. And history may look back on the Pack's 27-24 defeat to the Seahawks as the night the music died in Titletown.\"We've lost too many games like this -- that's the most frustrating thing,\" Rodgers said following Green Bay's latest coulda/woulda/shoulda setback in a season full of them. \"We've had a chance in almost all our road games -- especially against the Rams and the Patriots, and again tonight. We're right there. But we just can't get it done.\"In the game's early stages, it looked like the Packers had found their mojo in a stadium full of miserable memories. As every green-and-gold loyalist is painfully aware, CenturyLink was the sight of the infamous \"Fail Mary\" in 2012 and, two years later, the place where the Pack -- seemingly Super Bowl-bound -- endured a collapse of epic proportions in the 2014 NFC Championship Game. Thursday's fast start against the Seahawks (5-5), fueled by veterans familiar with those emotional scars, seemed to signal the Packers were hell-bent on taking chance out of the equation. Three plays after Williams' fumble recovery, the Packers were celebrating halfback Aaron Jones' 8-yard touchdown run. Then, with 3:10 left in the first quarter, Rodgers made an insane-in-the-membrane throw that dropped 69,007 jaws in unison at CenturyLink and pushed the Green Bay lead to 14-3, unleashing a 54-yard haymaker -- while on the move and in the air -- to tight end Robert Tonyan.At that moment, the ever-dangerous team led by the planet's most skilled quarterback looked fully capable of disrobing the Seahawks in their home stadium and using the victory as a springboard to Super Bowl contention.Two hours later, Rodgers (21 of 30, 332 yards, two touchdown, no interceptions) and the Packers trudged off the field, flummoxed by a loss that all but eliminated their remaining margin for error in 2018 -- and may well have ushered in the end of an era. With a 4-5-1 record heading into its next game, a Nov. 25 road showdown with the Minnesota Vikings, Green Bay is very much in jeopardy of missing out on the playoffs for a second consecutive season, a development that could bring an end to Mike McCarthy's 13-year tenure as the team's head coach.\nThough McCarthy has guided the Pack to the postseason nines times, including eight consecutive appearances with Rodgers as the quarterback from 2009-2016, the franchise has only one championship to show for it. The window won't stay open forever -- Rodgers turns 35 on Dec. 2 -- and the frustration in the locker room is starting to become palpable.A 29-27 defeat to the Rams in Los Angeles late last month left several Green Bay players enraged at a teammate some regarded as selfish (backup running back and kick returner Ty Montgomery was traded to the Baltimore Ravens two days later). The following Sunday in Foxborough, the Packers seemed on the verge of taking control of a game against the New England Patriots, but a fumble by Jones sent them on a downward spiral.On Thursday, after Green Bay failed to protect a second-half lead it held until 5:08 remained in the game -- and punted the ball away on fourth-and-2 from its own 33 with 4:20 to go, never to get it back -- the inability to put away opponents was a recurring topic of discussion.\"Most definitely, we should have (put them away),\" said Williams, the 12th-year cornerback who returned to the franchise in March after a three-year absence. \"There've been too many games where we didn't finish, where we couldn't maintain momentum. We've just gotta get that win.\" Specifically, Williams was upset that the Packers went down to defeat without Rodgers getting a chance to produce the kind of late-game magic that propelled the team to victories over the Chicago Bears and San Francisco 49ers earlier this season. Going for it on fourth-and-2, to Williams, seemed like a no-brainer.\"I want to go for it,\" he said. \"I want to play to win. We've got Aaron Rodgers. We (should) play to win -- period. We don't want to put it in anybody else's hands. We've got the best quarterback in the league. We've got to put it in his hands and let him do what he does.\"Long before McCarthy's decision to punt, the Packers missed out on an opportunity to parlay their early start into a runaway victory -- something that jibes, thematically, with the franchise's overall philosophy during much of Rodgers' career. Though highly skilled at picking players, former general manager Ted Thompson, who stepped aside after last season, was reticent to make trades or aggressively pursue big-name free agents, an approach which seems to be changing under his successor, Brian Gutekunst.With Packers president and CEO Mark Murphy having taken a more hands-on role since the front-office switch, there's a growing sense that McCarthy might be replaced -- barring a dramatic turnaround in the team's fortunes. If so, he'll surely look back at Thursday's game as one of those that got away.\"You couldn't have asked for a better start,\" Matthews said. \"I know we're young and we've got a bunch of new guys, and a new scheme, but we've gotta make plays, 'cause in this league, close doesn't count. Now we pretty much have to win out to have a shot.\"\nThe Packers got some monster plays on both sides of the ball. Third-year linebacker Kyler Fackrell was a one-man wrecking crew, hounding Seattle quarterback Russell Wilson (21 of 31, 225 yards, two touchdowns, no interceptions) all game in an effort that included three sacks, four quarterback hurries and a deflected pass that Wilson caught for an 11-yard loss.Meanwhile, Davante Adams, who has emerged as one of the NFL's top receivers, caught 10 passes for 166 yards, including a pair of glorious deep balls by Rodgers, totaling 98 yards on those receptions alone. Tight end Jimmy Graham, the prize of Gutekunst's first free-agent class, had a rough return to Seattle, suffering a thumb injury that is feared to be serious and leaving the game for good late in the first half.On the play of the night, Rodgers thought he was hooking up with Graham, only to realize his target was, in fact, a first-year, fourth-string tight end from Indiana State.With the Packers up 7-3 and facing a second-and-10 from their 46, Rodgers took a snap from under center, dropped back and felt the pocket collapse. He pumped the ball once before escaping to his right, pointing his finger downfield while evading several Seahawks in pursuit. As he approached the sideline, just past his own 40-yard-line, Rodgers left the ground as he unleashed a searing spiral toward the goal line, where Tonyan was tightly covered by safety Bradley McDougald.\"That was niiicccee,\" Rodgers admitted afterward, shortly before heading to the team bus. \"I let it go and I stared at it and said, 'Oooooo yeah ...' To be honest, I thought it was Jimmy. I let it go and looked at it and then I said, 'Whoa! That's Bobby.' \"Tonyan's scoring catch seemed to signal that the Packers were on the road to a blowout victory. Yet unlike Rodgers' famous girlfriend, Danica Patrick, this team does not seem comfortable putting its foot on the gas. The Seahawks took the lead 17-14 with 3:22 left in the first half, and though Green Bay reclaimed it on Rodgers' 24-yard pass to Jones with 44 seconds remaining, the Pack would manage only three points the rest of the way.As great as Rodgers' pass to Tonyan was, there was one brutal throw he wished he could have had back, as it directly preceded McCarthy's decision to kick the ball back to the Seahawks. After Wilson's 15-yard touchdown pass to tight end Ed Dickson put Seattle up 27-24 with 5:08 to play, the Packers took over at their own 25, and soon faced a third-and-2 from the 33. Rodgers, after taking a shotgun snap, had rookie receiver Marquez Valdes-Scantling open to his right for what likely would have been a catch-and-run well past the first-down marker.\nThe ball, however, never got there, hitting the turf well short of its target.Asked if he was upset that the Packers punted on fourth-and-2, Rodgers replied, \"I'm mad about the third-and-2. It just stuck to my hand. That's a throw I make 100 times out of 100. Just incredible.\"One person who wasn't mad about McCarthy's decision to take the ball out of Rodgers' hands: Seahawks defensive coordinator Ken Norton Jr. \"Oh my God,\" he said afterward. \"I was like, 'Please! Punt! Punt! Punt!' \"Four running plays and two first downs later, the Seahawks were in victory formation -- and the Packers were down to perhaps their last chance to salvage a season. Rodgers has led them on remarkable runs before, so it would be crazy to completely discount the possibility. Yet Williams, for one, believes that such dire circumstances warrant a go-for-broke attitude that has been missing thus far, and he wasn't afraid to voice it after another heartbreaking defeat.\"I don't want to play a regular game all the time,\" Williams said. \"I want to come out and make a statement. We know what we've got. We're at a point in our season where we have to win. We've got nothing else to do. We've got the best quarterback. We've got too much to be losing games so close. We've gotta get over the hump. And we've got to risk some things to do it.\"If the Packers don't pull it off, there may be some very big changes awaiting them at season's end.Follow Michael Silver on Twitter @mikesilver.\nMore News >\n\nMore News >\nMore Green Bay Packers Videos >More Green Bay Packers Photos >"}