{"id": "Week 8 Trade Calls: Go get David Johnson", "paragraph": "\nWe're about a month away from the fantasy trade deadline, and the fantasy playoffs will be starting shortly after that. It's crazy to think about, but the season always flies by. I offer up several players to trade for and trade away below. Remember, none of these suggestions are because I think a certain player is bad or will be falling off the fantasy cliff. There are just reasons I think their trade market value is in the right position to make a move. Now, let's see what the market has to offer.David Johnson, RB, Arizona Cardinals: If you've been following this column all season, you're well aware I've been advocating to trade Johnson for a few weeks now. Well, life comes at you fast in the NFL. The Cardinals fired offensive coordinator Mike McCoy, who had pulled off the miraculous feat of turning one of the league's most electric players (Johnson) into a 3 yards-per-carry hammer back. Replacing McCoy is Byron Leftwich, who was with the team during Bruce Arians' tenure (you know, when Johnson was a fantasy superstar). It's not likely  Leftwich installs a clone of Arians' scheme, but it'd be hard to imagine one worse than what McCoy was running. Don't go crazy trying to get Johnson, as he's still the running back on a 1-6 team with holes all over the offensive roster, but if the price is right now is the time to make a move for Johnson. Tyler Boyd, WR, Cincinnati Bengals: With so much information available to fantasy players, it's tough to gain an edge when it comes to trades. However, sometimes it's possible to use the mystique or specter of a primetime game to your advantage in a trade. Boyd and the Bengals were absolutely trounced by the Chiefs in front of a national audience on Sunday night. It's the type of performance that can stick in the mind of a fantasy manager who doesn't have NFL RedZone or hasn't had the misfortune of watching several Bengals games this year. Boyd posted just three catches for 27 yards and was largely invisible while Mahomes and Co. marched up and down the field. However, in the five games prior Boyd was averaging roughly seven catches for 86 yards per game, scoring four touchdowns in that span. Boyd's next two games are against the Buccaneers and Saints, two of the worst passing defenses in the league, and his schedule is solid the rest of the way as well. Your league-mates may not bite, but island games have a weird way of skewing people's otherwise more nuanced, informed opinions simply by being the only game holding our attention at that time. It's worth a shot.Josh Gordon, WR, New England Patriots: I know I'm not alone here, as my pal JJ Zachariason listed Gordon as a player to target on The Late-Round Podcast this week (and the fantasy community LOVES Gordon), but Flash looks ready for a massive breakout. Since joining the Patriots in Week 4, Gordon leads the team in air yards share at 24 percent, and this is on just 15 percent of the targets. Over the last two weeks, he's seen 23 percent of the targets, trailing only James White, and he went for 100 yards against the Bears on Sunday, falling just short of scoring a touchdown as well. He was tackled at the one-yard line. Remember when the Patriots passing offense was struggling to start the season? They couldn't pass the ball downfield, as Tom Brady was forcing it to Phillip Dorsett. Well, Gordon has unlocked the full potential of this passing attack and could absolutely explode down the stretch. Get him before it's too late.Patrick Mahomes, QB, Kansas City Chiefs: Now, before you congregate outside my apartment with torches and pitchforks, let me say simply this is merely a suggestion to see what Mahomes might be worth to someone in your league. I am by no means suggesting outright trading away the likely fantasy MVP. However, much like I wrote with the analysis for Boyd above, sometimes it can be beneficial to use the mystique of a primetime performance to help entice another owner in a trade. Mahomes ripped apart the Bengals in front of the nation with another stellar performance. But here's the thing, ever since his white-hot start to the season, other quarterbacks are catching up on a per-game scoring basis. This is natural, as the NFL season has ups and downs for all players. Mahomes will still be great the rest of the season, but if you're playing in a 10- or 12-team league there are going to be other quarterbacks available who can get close to Mahomes' level of production. For instance, over the last four weeks Andrew Luck and Mitchell Trubisky have outscored Mahomes. Over the last two weeks, Mahomes has outscored Brock Osweiler by just 16 fantasy points. Brock. Osweiler. If you have Mahomes and are weak at another position or two, it wouldn't be the worst idea in the world to try and package him for an upgrade at more important fantasy positions, like running back or wide receiver. The benefit you'll gain from those upgrades can likely overcome any loss in points by shipping away Mahomes. You by no means have to shop Mahomes, but it never hurts to see what he might get you in return on the open market. The Raiders passing offense: The Amari Cooper trade rocked the football world this week, and it creates an interesting situation for fantasy purposes. Common wisdom would seem to indicate that with Cooper out of the picture in Oakland, the fantasy fortunes of Jordy Nelson and Jared Cook should rise, right? I don't think that's going to be the case at all, because, well, for most of the season it's been as if Cooper wasn't even there. Cooper posted two or fewer receptions and 17 or fewer yards in four of six games this season. One was cut short due to injury (concussion). Sure, he combined for 18 catches, 244 yards and a touchdown in the other two, but he was basically non-existent in twice as many games. And somehow his departure, freeing up another talented cornerback on the opposing defense, is supposed to help Nelson and Cook? Color me skeptical. I'd try to move any pieces of this passing attack you have hanging around on your roster before the wheels fall completely off the wagon. T.J. Yeldon, RB, Jaguars: Yeldon has been rock-solid filling in for Leonard Fournette the last four weeks, but he's also scored four touchdowns in that span, helping his fantasy output stay robust. Yeldon could be a sell candidate for a number of reasons despite this recent success. For starters, the Jaguars just traded for Carlos Hyde, who figures to join the fray and eat into Yeldon's workload. Also, there might be deep-seeded issues on this Jaguars team, considering they benched Blake Bortles for Cody Kessler last week, and then the team was on the brink of fighting in the locker room. It's tough to read too much into that for fantasy purposes because really it's indicative of nothing that matters directly for fantasy. However, if the team implodes, the scoring opportunities might dry up, and hoping your part-time committee back on a struggling offense scores is a dicey proposition.I have Njoku and Kittle (nonppr) I've been offered Royce Freeman for Kittle. What do you think?You have the right idea here to use your wealth of tight ends as bait for a deal, but I'd aim higher than Royce Freeman. Only two tight ends have more receiving yards than George Kittle currently, and they're named Zach Ertz and Travis Kelce. Maybe use one of those tight ends to get a package of players back, or offer one to a different manager with a need at tight end.Looking to trade Boyd to add RB depth. Can I aim higher than Jordan Howard range?Yes, and you should. Howard is a great player, but his role in the new Bears offense is awful for fantasy. He hasn't seen 15-plus touches since Week 2 and is averaging just 3.5 yards per carry. He's an extremely touchdown-dependent back. Boyd is coming off a down week, but you can do better if you're looking to trade him away. What do you think about Keenan Allen for Dalvin Cook? I see Dalvin's schedule during the playoffs, and it's got me like. pic.twitter.com/JRVuqfit1oAll right, let's square up these playoff schedules. Dalvin Cook goes on the road to Seattle, gets the Dolphins at home, then goes back on the road to face the Lions. Ideally, you'd want more home games, but Miami and Detroit are among the league's most generous defenses to running backs through seven weeks, and are two of the four defenses to allow over 800 yards on the ground thus far. Keenan Allen gets two bottom-six defenses against the pass in the Bengals at home and then the Chiefs on the road before a nasty date with the Ravens in Week 16. It would seem this set-up favors Cook, but he's also missed time with multiple injuries so far this year. It's unclear when he'll come back and how long he'll last. If you're willing to take the risk, this seems like a reasonable trade. I'd probably stay put with Allen, but that could just be me being a giant chicken.Looking for a good wr. Im thinking about sending Keenan allen and nick chubb for mike evans. I have hunt, michel, mack for rbs and obj, golladay, robinson for wrs. What do you think?I think you're on the right track, but I'd target someone other than Mike Evans if you're parting with that much. Evans is a fantastic player and he has a great rapport with Jameis Winston, but that Tampa passing offense is loaded, and we've already seen Evans' target share and overall production dip at times this year as there are so many options for his quarterback to choose from. Maybe go after Julio Jones or Davante Adams. I just think you can shoot higher than Evans if you're willing to offer up Keenan Allen and Nick Chubb. 1ppr...Chris Thompson for Allen Robinson...Chris Carson for Amari CooperChris Thompson for Allen Robinson feels like a wash, as both are banged up, but I think I'd rather have Robinson. As for the Chris Carson for Amari Cooper trade, I'm staying far away from Cooper. He's joining the Cowboys as they head into their bye, but he'll still need time to get up to speed with the team, and then there's the fact that the Cowboys passing attack isn't exactly explosive. Way too much risk for me to give up an even semi-startable fantasy player. Stick with Carson.-- Alex Gelhar is a freelance fantasy writer for the NFL and a full-time law student. You can find him on Twitter @AlexGelhar. \nMore Posts\nPhoto Essay\r\n"}