{"id": "Four things to watch for in Packers-Seahawks on 'TNF'", "paragraph": "  \nBelieve it or not, the Packers and Seahawks are both right in the thick of the wild-card race.That could change drastically, starting with Thursday night's prime-time contest between the two teams at CenturyLink Field in Seattle.The raucous home of the 12s, famous for its noise, plays host to an important Week 11 contest that could go a long way toward determining how January looks. At 4-5 and 4-4-1, the Seahawks and Packers take the field with plenty at stake with more than half of the season already in the past.Here are four reasons to watch Week 11's Thursday Night Football (airing on NFL Network, FOX and streaming on Amazon Prime Video), in case that introduction wasn't enough to whet your palate.Before we even get into 2018's matchup, let's take a trip in the wayback machine to 2014, when these two squads met in the postseason.\nFresh off a blowout win in Super Bowl XLVIII, Seattle faced long odds of getting a chance to repeat when the Packers held a commanding lead late in the NFC Championship Game. Green Bay jumped out to a 13-0 lead after one quarter and extended that to 16-0 by the time Ha Ha Clinton-Dix recorded his second interception of the game. Everything was turning up cheese for the Packers after Russell Wilson's third interception left him with a 0.0 passer rating and Seattle's fans providing nothing more than a concerned buzz. Wilson's fourth interception appeared to seal an upset win for the Packers with less than six minutes left, but then Wilson awoke. The quarterback led the Seahawks to within five points, and history happened when Green Bay's Brandon Bostick botched an onside kick recovery attempt, giving the Seahawks new life.Marshawn Lynch scored the go-ahead touchdown, Seattle coverted the two-point attempt, Green Bay followed with Mason Crosby's game-tying field goal and the two headed to overtime. From there, Wilson blew the lid off the stadium with a pass to Doug Baldwin for a first down, and a heave down the middle of the field to Jermaine Kearse for the walk-off touchdown.The game still lives fresh in the minds of those who remain in Green Bay. They were asked about it during this week's media availability.\"That game will always be frustrating to think about how it went down,\" Aaron Rodgers said this week. \"Yeah that one, the sting's probably never going to go away from that one.\"So why does a game from four years ago matter this week? The answer is obvious: Revenge! Who doesn't love a good revenge game?Seattle is 3-0 against Green Bay at CenturyLink Field since 2012, including the postseason, but the Packers have won the last three meetings. They've done so mostly by throwing the ball, averaging 315 yards per game through the air in their last six meetings.But Rodgers hasn't won in Seattle since 2008, when he was a first-year quarterback and the Seahawks were trotting out former University of Akron star Charlie Frye. A lot has changed since then.Is revenge a dish best served amid a driving rain? Or will conditions stay dry in Seattle? That and more remain to be seen Thursday.Rashaad Penny was drafted as the next bellcow back in Seattle, but for most of his rookie season, he's lingered in the background. Chris Carson has been the go-to guy on the ground -- that is, until Seattle's Week 10 game against the Los Angeles Rams.\nPenny rushed 12 times for 108 yards and a touchdown, pacing a Seahawks rushing attack that hasn't seen this type of per-carry production all season (Carson has broken 100 yards three times, but not at such a high clip in any of those games). His performance earned a glowing review from coach Pete Carroll and a sigh of relief from Seahawks fans who had high hopes for the former San Diego State Aztecs star.How does Penny build on such a performance? By doing something similar against the Packers in Week 11.The Seahawks have been a team that has flirted with competition in some matchups, giving the Rams, Chargers and Bears great tests but also playing down to opponents at times. They needed Phil Dawson to miss a game-winning field goal to win in Week 4 over the lowly Cardinals, and couldn't overcome an early touchdown in the fourth quarter of a Week 1 loss to Denver. The point: Seattle has been good enough to have a better record, but needs to play to its potential.What better way to do so than by taking down a Packers team that is flying high after a comfortable win over the Miami Dolphins last week? And to do so by riding Penny to another 100-yard game in an emphatic win?The path to a wild-card berth has led them to a 4-5 mark through nine games, but truly begins Thursday with a victory over Green Bay. Penny has a chance to play a big part in such a triumph.Green Bay hasn't had a go-to running back in quite some time. At one point it was handing plenty of carries to a receiver named Ty Montgomery. But the future at the running back position seems to have emerged in the form of Aaron Jones.It's unlike a Mike McCarthy offense of the last five years to hand volume carries to one back. Instead, it's been a committee that does a little bit in both the running and passing games. But Jones stands to change that narrative, and one needs to look no further than Week 10 to find the evidence.Jones rushed 15 times for 145 yards and two touchdowns in Green Bay's 31-12 walloping of the Dolphins, looking nothing like the Packers team that fell meekly to the Patriots in Week 9. Optimism is renewed in Green Bay for a team that hits the road with an incredibly important contest against the Seahawks on deck.Their chances of success begin with Jones, who still isn't getting a ton of carries. That seems justifiable when considering the team has Aaron Rodgers lining up behind center.But then, there's this...Aaron Jones is a generational talent pic.twitter.com/CrmbvWctadAnd this...Highest yards-per-attempt averages in modern NFL history among running backs with a minimum of 150 career carries:1. Aaron Jones (6.12)2. Bo Jackson (5.40)3. Hokie Gajan (5.39)4. Jamaal Charles (5.38)And this...I asked Byron Bell if he's ever seen another running back hit the line of scrimmage with as much speed as Aaron Jones. This is some serious praise from Bell. #Packers found a gem: pic.twitter.com/UkPcm12e8uAll because of runs like this:67 yards!ï¿½ï¿½ï¿½ï¿½ @Showtyme_33ï¿½ï¿½ï¿½ï¿½: CBS #GoPackGo pic.twitter.com/IhcU2oullNJones meets a greater test this week in the Seahawks, ranked 18th against the run, than he did against the 32nd-ranked Dolphins. He brings a great reputation to the contest, albeit in a small sample size. Jones' 494 rushing yards come with the best average per carry among all players with 70-plus carries at 6.8, and he's tied for third-most rushing touchdowns since Week 8 with three. The Packers appear to have figured out how to find success on the ground again after missing that element. We spent a point highlighting Penny's contributions, but the Seahawks are a team that wins thanks to its strength in numbers. Seattle is the only team in the NFL to have three different players rush for at least 100 yards in a game this season (Penny, Carson and Mike Davis), with each occupying different roles. Davis leads the team in rushing touchdowns with five, while Carson leads the team in rushing yards (497) and Penny is just now emerging as a contributor. Who will lead the way Thursday -- or will it be all three?They'll need a good ground effort, which includes Russell Wilson as part of a team that leads the NFL in read-option percentage with 104 such attempts (26 more than the next closest: Carolina with 78). Luckily, they've realized this is a key to success, catapulting from the lower third of the league in run play percentage, carries per game and rushing yards to tops in the NFL in all three categories. It has especially jumped in the last seven games, producing six rushing touchdowns in the process.The true key: Defense. Jones faces light boxes (six or fewer defenders) the second most in the NFL with 61.6 percent of carries, trailing only Miami's Kenyan Drake in such situations. Jones ranks at the top or very close to it in yards per rush (7.5, second in the NFL), 10-plus yards perecntage (24.4 percent, first in the NFL) and touchdown percentage (6.7 percent, first in the NFL). But he's facing a defense that includes the league's most effective tackler, Bobby Wagner, who has attempted 69 tackles and hasn't missed a single one (best in the NFL among defenders with 50-plus attempted tackles, per Pro Football Focus).Which will win out? And more importantly, which will grab an important win in an NFC that still has seven realistic contenders for wild-card berths? The playoff picture will gain a bit of clarity after this contest concludes.\nMore Posts\nPhoto Essay\r\n"}