{"id": "Nick Chubb making the most out of increased carries", "paragraph": "  \nCleveland Browns rookie running back Nick Chubb had himself quite the game in Sunday's 28-16 over the Atlanta Falcons.Chubb busted out with 20 carries for a career-high 176 yards, and blistered the Falcons on a team-record 92-yard touchdown run in the third quarter. Chubb was also active in the passing game, hauling in three catches for 33 yards and a touchdown.But more important outside of the individual effort, the Browns snapped a four-game losing skid with Chubb emerging as a focal point on offense.\"It is always great to win no matter what it takes,\" Chubb said after the game. \"I am willing to do anything they ask me to do and I was. Not getting many carries, I still took advantage of the ones I got just to help this team anyway I could. That is still [the same]. Now, I am getting more carries, and I am going to make the most out of all of them.\"Patience has certainly paid off for Chubb in the past two games after the firings of head coach Hue Jackson and offensive coordinator Todd Haley.From Weeks 1-8 with Jackson and Haley, Chubb totaled 52 carries for 318 yards and three touchdowns on 109 offensive snaps, an average of 13.9 snaps per game. He added 10 yards receiving on two catches in that span. Chubb, the Browns' second-round pick, always had the talent. But he had to reach back to his college days to help cope with the transition of coaching personnel until his time came. \"It is like everything that happened at Georgia is happening here,\" Chubb said. \"I had a coach get fired, but he got fired at the end of the season. \"It is tough because you come in with a certain guy as your head coach and you become fond of him and learn his ways of coaching, and then you have to just go a different way. At first, it is tough. You have to get used to it. It happens to all of the guys to kind of switch their mindsets and bond to the new coach, but it takes a while. When everyone finally buys in and resells, great things start to happen.\" Indeed, they do, especially for Chubb. The trade of running back Carlos Hyde to the Jacksonville Jaguars also helped open the door for opportunities as the lead back. \nWith interim head coach Gregg Williams and interim offensive coordinator Freddie Kitchens at the helm, Chubb has blossomed. He has totaled 42 carries for 261 yards and two touchdowns, adding four catches for 38 yards and a touchdown on 79 total snaps, an average of 39.5 snaps per game in the past two games. \"He's a tough runner,\" Williams said. \"He has good vision, and then once he gets out there, he is not easy to bring down and can run away from you. He showed his runaway ability, also, to separate and finish the play. That was excellent.\" Against the Falcons, Chubb rushed for 118 yards against stacked boxes, which signals eight-plus defenders near the line of scrimmage, and he is averaging a healthy 8.2 yards per carry against stacked boxes this season, according to Next Gen Stats. And on Sunday, Chubb became the third Browns rookie since 1950 with 200-plus total yards from scrimmage yards and two touchdowns in a game, joining Ernest Byner (Week 16, 1984) and Pro Football Hall of Famer Jim Brown (Week 9, 1957). With the second half of the season to look forward to, the Browns should feel confident their rookie running back is hitting his stride. \"I feel more comfortable,\" Chubb said. \"My eyes are getting better. I am seeing everything up front at first, but the game is still fast in every one we play. Just a great defense and great players on the other side of the ball and it is always tough, but I am always up for the challenge.\" \nMore Posts\nPhoto Essay\r\n"}