{"id": "Jaguars pin broken coverage vs. Colts on 'brain farts'", "paragraph": "  \nThe Jacksonville Jaguars enter Week 11 ranked first against the pass, allowing 200.6 yards per game. The Jaguars also have surrendered just 12 touchdown passes on the season, the third-least amount in the league. So, what happened in Week 10 when Indianapolis Colts quarterback Andrew Luck shredded the Jaguars defense with 285 yards passing and three touchdowns, all to tight ends, in a 29-26 win? \"To be honest, it has to be just total brain farts,\" Jaguars safety Tashaun Gipson said, via Michael DiRocco of ESPN. \"You're looking at guys running wild in coverages that we've been playing here for the first four years. Even back in 2016, we weren't a great football team, but it wasn't this many consecutive busts week in and week out. The busts came up in the Dallas game, and they've just been a reoccurring theme since then. \n \"What to do about it? I don't know, man. It's hard to blame coaching for busts; but at the same time, everybody got to be accountable in this thing right here for sure.\" After starting the season 2-0, the Jaguars, once regarded as a Super Bowl favorite during the preseason, sit on a 3-6 record and are in the throes of a five-game losing streak where nothing defensively seems to go right. The low point came in Week 6's 40-7 loss to the Cowboys, and the defensive issues throughout the slide extend beyond breakdowns in the secondary. On the season, the Jaguars have just 19 sacks, recording nine sacks in the past five games to go along with 26 quarterback hits in that span. Against the Colts, the Jaguars defense, which recorded the second-most sacks (55) in the league in 2017, didn't record a sack on Luck and managed just two quarterback hits. \"I think that we've got to continue to do things to free our guys up,\" Jaguars head coach Doug Marrone said Monday, via team transcript. \"Teams are doing a better job than they did last year. \"We are not sneaking up on anyone. The ball is coming out quick and things of that nature. We have to put ourselves in some better situations where they are going to have to hold the ball a little longer and do those types of things.\" Meanwhile, there doesn't appear to be an easy fix for Jacksonville despite the team owning the league's top pass defense. Getting starting cornerback A.J. Bouye back would help after he has missed the past two games with a calf injury. But the Jaguars haven't been able to find a consistent pass rush, and as ESPN's DiRocco pointed out, coverage breakdowns have resulted in opponents totaling 24 plays of 20 or more yards during the five-game slide. \"I guess that's the most mind-blowing, head-scratching thing,\" Gipson said. \"It's not like teams are going out there just deliberately beating you. You can take that; that's more acceptable. Those guys get paid, too. But blown coverages are just unacceptable. \"We're not talking about if you're talking about a secondary who claims they're the best. We're talking about just any professional team. You just can't just have guys blowing wide open like that, man.\" The road to improvement for the Jaguars won't get easier in Week 11's contest against the Pittsburgh Steelers, owners of the league's fourth-best offense (419.9 yards per game), third-best passing attack (314.2 yards per game) and fifth-best scoring unit (31 points per game). \nMore Posts\nPhoto Essay\r\n"}