{"id": "John Harbaugh: Challenge rule 'should be changed'", "paragraph": "  John Harbaugh would like to throw the red flag on the challenge rule.The Baltimore Ravens head coach advocated Monday for changes to the rule, saying coaches shouldn't have to win both challenges in order to get a challenge back. Harbaugh made two early-game challenges against the New Orleans Saints on Sunday and lost one of them, preventing him from challenging another call for the rest of the game.\"We've talked about that rule. The rule should be changed,\" Harbaugh said, per the Ravens' official website. \"You shouldn't have to win both challenges to get another challenge back. That's been talked about, and that's been just dismissed by the powers that be. Who knows why? Maybe they could explain it to you in some way that makes sense. But the other thing is, we never challenge unless we think we're going to win it clearly.\"Harbaugh was irked by the rule since it prevented him from having another challenge at his disposal for the final 53 minutes of the game. The veteran coach said he \"absolutely\" wanted to challenge a 1-yard run by Drew Brees on a fourth-and-1 that extended a go-ahead touchdown drive for the Saints in the fourth quarter of their 24-23 victory.\"You have to at least get close to the line of scrimmage,\" Harbaugh said about the play. \"It's not like you put the ball across the plane of a goal line. You can't put the ball across the plane of the first-down marker -- it's got to be forward progress.\"Absolutely would've challenged that. The other thing: You'd like for them to get it right the first time -- that would be the ideal thing.\"Harbaugh isn't the first coach to push for change. In 2017, the Washington Redskins submitted a rules change proposal with the NFL's competition committee to allow coaches to have unlimited challenges as long as they didn't make two unsuccessful challenges. The proposal was not approved by the committee.Having to win both challenges to get one back seems a bit strange even if it's intended to keep the game from bogging down into an interruption-laden, red-flagged mess. The big question is whether Harbaugh's sentiments echo crisply enough among his head-coaching brethren that it gets the ear of the competition committee again.\nMore Posts\nPhoto Essay\r\n"}