{"id": "Offensive player rankings, Week 8: Chiefs boast scariest offense", "paragraph": "\nThe 2018 NFL season has been defined by high-powered offenses. And right now, it feels as if some of them might be unstoppable.As we approach the midway point of the regular season, the NFL has seen more scoring this year than any year in its history. Right now, there are four teams averaging at least 30 points per game: the Kansas City Chiefs (37.1), New Orleans Saints (34), Los Angeles Rams (33.6) and New England Patriots (30.6). Six others have put up at least 27 points per game. As good as these offensive units have been, it's likely that we'll see some of them vying for a championship in January. That got me thinking: Which offenses would I want to face LEAST in the postseason? Here are my top five:\n1) Kansas City Chiefs (6-1): The common theme in this list is these offenses have the advantage when it comes to matchups. The Chiefs more so than any other right now. Led by MVP candidate Patrick Mahomes, the Chiefs make it near impossible for defenses to contain every single one of their weapons. Swiss Army Knife Tyreek Hill is hard to keep out of the end zone even when double-teamed, while tight end Travis Kelce has a leg up on any defender who isn't a CB1. After accounting for those two guys, both in my Top 15 Offensive Player Rankings below, defenses are at a disadvantage before even considering Sammy Watkins (the No. 4 overall pick in 2014) and Kareem Hunt (the No. 3-ranked running back in Maurice Jones-Drew's RB Index). With all of those options at his disposal, Mahomes is most certainly the Chiefs' best offensive weapon. He extends broken plays with his legs and can heave the ball literally anywhere on the field. The icing on the cake in Kansas City is Andy Reid's mad scientist-like play-calling. He has such intricate play designs and, most importantly, the personnel to execute them.2) Los Angeles Rams (7-0): This offense is all about Sean McVay, whose unit has outscored opponents by 107 points this season. The second-year head coach is the best play-caller in the NFL, especially when it comes to using play-action with the threat of Todd Gurley. The running back is in the MVP conversation for the second straight season, tallying 14 total touchdowns through seven weeks -- on pace for 32 by season's end, which would eclipse LaDainian Tomlinson's single-season scrimmage TD record. Jared Goff has been an accurate passer, particularly excelling off play-action: According to Pro Football Focus, Goff boasts a 5:0 TD-to-INT ratio on play-action passes, most recently completing four of his six play-action throws for 64 yards and a touchdown in the Rams' 39-10 destruction of the 49ers. Goff's receivers have been exceptional, as well, with Brandin Cooks stretching the field, Robert Woods recording a career year and Cooper Kupp continuing to be a reliable target in the slot (though he's dealing with some injury issues right now).3) New Orleans Saints (5-1): It's hard to believe, but the strength of this offense isn't Drew Brees, the NFL's all-time leading passer. Rather, this unit centers around running backs Alvin Kamara and Mark Ingram, who combined for an astonishing 3,094 yards from scrimmage in 2017. With Ingram returning from suspension in Week 5, this duo will only get better as the season progresses. Sean Payton is so good at dialing up plays when both guys -- who are both effective when running or catching out of the backfield -- are on the field. Brees also has a tremendous weapon in wide receiver Michael Thomas, who is very underrated -- his great hands, route-running ability and physical play make him a hard player to defend. Not to mention, Brees and Payton have been together for more than a decade. There isn't a defense this duo hasn't seen, and Payton's creativity makes it tough for defensive coordinators to game plan for. 4) New England Patriots (5-2): I recently wrote about how much the Tom Brady-led attack benefits when Julian Edelman is on the field. Since Edelman's return in Week 5, the offense has been executing better than it had in Weeks 1-4 without him. The Patriots have averaged almost 16 points per game more in the last two games than in the previous four. Edelman, Rob Gronkowski (who can hopefully stay healthy) and Josh Gordon all demand attention from opponents, and I haven't seen a defense that can stop ALL THREE simultaneously. (Let me know when you find one.) Just when the running game started to hit its stride, Sony Michel suffered a knee injury in Week 7. Luckily, his MRI came back negative. Even if Michel misses time, he'll provide a boost when he eventually gets back on the field. IF this entire unit is healthy come January, I'm tempted to say we'll also see it in February. 5) Atlanta Falcons (3-4): It's no question that Atlanta boasts the best receiving corps in the NFL with Julio Jones, Mohamed Sanu and Calvin Ridley. And Marvin Hall flexed his muscle on a 47-yard touchdown Monday night. With all four posing as potential deep threats, along with tight end Austin Hooper, Matt Ryan has to be licking his chops every time the Falcons line up in four- or five-wide receiver sets. Again, defenses have trouble defending all these weapons. Without Devonta Freeman, the Tevin Coleman-led run game has been just enough of a threat to open up the play-action pass for Ryan. Like the Rams and Chiefs, the Falcons have found success on play-action passes this season and continued to thrive Monday night against the Giants. According to Pro Football Focus, Ryan threw for more yards on play-action passes on fewer attempts than on all other pass plays in Week 7:Play-action: 13-for-14 (92.9 percent), 195 passing yards, one TD, zero INTs, 142.6 passer rating. Not play-action: 18-for-25 (72.0 percent), 190 passing yards, zero TDs, zero INTs, 93.8 passer rating. This offense is clicking in Steve Sarkisian's second year as offensive coordinator, with Ryan playing at or above his 2016 MVP form.The Steelers and Chargers' offensive units almost broke into the top five. One thing that has hindered both of these groups is the absence of their running backs. While Pittsburgh has a top-notch offense with James Conner in the backfield, Le'Veon Bell (who has yet to report) takes it to the next level. With the Chargers, Melvin Gordon is having a career year, but we saw the impact his absence had Sunday when the Chargers put up a season-low 20 points in their win over Tennessee. Gordon's production has given the Chargers the balanced offense they've been missing since the departure of my colleague LaDainian Tomlinson.Each week in the 2018 campaign, former No. 1 overall pick and NFL Network analyst David Carr will take a look at all offensive players and rank his top 15. Rankings are based solely on this season's efforts. Now, let's get to it -- the Week 8 pecking order is below.NOTE: Arrows reflect changes from last week's rankings.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDropped out: Melvin Gordon, RB, Chargers (previously No. 11).JUST OUTSIDE THE TOP 15Melvin Gordon, RB, Chargers: Gordon, who was out Sunday with a hamstring injury, must play every week to stay in the rankings. There are too many great players in this league to keep him in the top 15.Russell Wilson, QB, Seahawks: Coming off a bye week, the Seahawks (3-3) will be tested by a Lions team that appears to be on the upswing. Wilson must have another good game to keep Seattle rolling.\nOdell Beckham Jr., WR, Giants: With a good performance against the Falcons, OBJ reached 5,000 career receiving yards in fewer games than any other player (54). Julio Jones, WR, Falcons: Another respectable day from Julio -- nine catches for 104 yards -- but still no end zone action.Kareem Hunt, RB, Chiefs: The second-year back has come on strong the last two weeks with four total touchdowns. Hunt's nine touchdowns this season are tied for second-most in the league.Follow David Carr on Twitter @DCarr8.\nMore News >\nMore Videos >More Photos >More Gear >"}