{"id": "Saints open to bringing back Dez Bryant for 2019", "paragraph": "  \nThe whirlwind week that was supposed to mark Dez Bryant's triumphant return to football ended in heartbreak.Bryant suffered a torn Achilles during his second practice with the Saints, and was placed on injured reserve.Bryant, who is set to undergo surgery soon, faces a 6-9 month recovery -- one that complicates his free-agent prospects for 2019. Sources tell NFL.com, the Saints would be open to Bryant coming back, though this is contingent upon the receiver being healthy.\"He'll have a full recovery and I know he still plans on playing,\" Saints coach Sean Payton told NFL Network's Kimberly Jones on Sunday.Veteran wide receiver Brandon Marshall, whose workout earlier this week also impressed the team, is a possible short-term option to replace Bryant. However, no determination has been made at this time. New Orleans did promote Keith Kirkwood from the practice squad Saturday.\nThe Saints liked Bryant, though they knew he wasn't in game shape and needed to lose a few pounds -- perhaps that contributed to the season-ending injury. Bryant's injury ruined a debut that had been months in the making.Bryant turned down a $7 million-per-season offer from the Ravens and a nice offer from the Browns before signing with the Saints. In addition, Bryant received interest from the Redskins, Cardinals and Bills. The Seahawks and Packers also inquired about the veteran receiver early on in the process.Meanwhile, prior to that, Bryant had worked with receiving guru David Robinson on route running for the first time in his career.\"We worked a lot on his ball skills, hand-eye coordination to get his eyes and his confidence back after he put some balls on the ground last year,\" Robinson said. \"And we started seeing a big improvement in his mindset to get him back to the player he was from 2010-2016, when he was one of the best players in the NFL.\"Knowing he's not as fast as he was when he was younger, Bryant worked on route running technically to continue to get open.\"We started seeing more urgency at the top of his routes,\" Robinson said. \"The Cowboys used him only on back-shoulder faces and slants, not using his intermediate route tree. They never really spent time on it. So he spent this offseason working on his craft.\"Now, we'll all have to wait until 2019 to see it on the field.Follow Ian Rapoport on Twitter @RapSheet.\nMore News >\n\nMore News >\nMore New Orleans Saints Videos >More New Orleans Saints Photos >"}