{"id": "What we learned from Sunday's Week 9 games", "paragraph": "  \nHere's what we've learned from Sunday's Week 9 games, which included the Pittsburgh Steelers' victory over the Baltimore Ravens in an AFC North showdown.1. Sunday evening's prime-time duel between two of the greatest quarterbacks the game has ever offered living up to its billing, at least for three quarters. Tom Brady (294 yards, TD) and Aaron Rodgers (259 yards, 2 TDs) each traded blows early on, leading scoring drives of 14 and 10 plays, respectively, to open the proceedings, albeit in different ways. Brady's Patriots burned through the Packers defense with a quick-timing, hurry-up attack, while Rodgers bounced around his pocket, unfurling adlibbed rifles to his receivers. Different strokes for different G.O.A.T.s. But this game turned not on the play of either gunslinger, but on yet another fumble from another Packers running back. One week after Ty Montgomery lost his handle and then his job, Aaron Jones let one slip away in the fourth quarter with the game tied at 17 and Green Bay driving to take the lead. Forced by Lawrence Guy at New England's 34-yard line, the fumble turned into the go-ahead Patriots touchdown within 10 plays. After a Packers three-and-out, Brady found Josh Gordon, who made corner-turned-safety Tramon Williams whiff along the left sideline for a 55-yard touchdown catch-and-run. That was that. Just seven minutes after the Packers were driving to take the lead, they were down 14 points and down for the count. 2. Down Sony Michel and Rob Gronkowski, two of their most important pieces on offense, the Patriots relied on two written-off figures to jumpstart an unsteady attack: Gordon and Cordarrelle Patterson. Gordon was targeted a season-high 10 times by Brady, hauling in five catches for a season-high 130 yards and that long score. His physicality on slants and posts proved difficult for Green Bay's banged-up secondary to deal with. Gordon now has more receiving yards with the Patriots in six games (396) than he had with the Browns from 2015 through 2018 (352). Patterson was on the field for just 13 offensive snaps, but touched the ball on 12 of them, filling in for Michel and James White, who left briefly with what looked like a knee injury. The drive after White departed, Patterson, often lined up in the I-formation, carried the ball five times for 51 yards and scored a rushing touchdown, his first since Week 6 of 2017. White (103 total yards, 2 TDs) returned in the second half to carry some of the load and open up the passing game, but Patterson played a crucial role in helping New England keep pace. As did Julian Edelman, who in addition to catching six passes, threw for a crucial 37-yard first down. This is what the Patriots do on the biggest of stages: Find unexpected ways to surprise and outsmart their opponents. New England hasn't lost since Week 3 and is running away with the AFC East at 7-2. No surprise there.3. Halfway through the season, the Packers find themselves under .500 and 1.5 games back in the NFC North. Part of that is due to mind-numbing errors (see: Crosby, Mason; Montgomery, Ty; Jones, Aaron), but now the injuries are adding up. Green Bay's defensive backs were dropping like flies; Kevin King and Kentrell Brice left with injuries, while Jermaine Whitehead was ejected. That's a bad sign for a unit that just jettisoned Ha Ha Clinton-Dix to the Potomac. Elsewhere, starting right tackle Bryan Bulaga left with a knee injury and starting middle linebacker Blake Martinez was carted off with an ankle injury. In the middle of a brutal stretch of matchups (four road games in five against contenders), the Packers needed a positive result in Foxborough. Instead they lost, in more ways than one.-- Jeremy Bergman\n1. Defense took a back seat at the Mercedes-Benz Superdome. Sunday's game gave fans everything they hoped for in a matchup featuring two of the NFC's top teams and the first contest in league history between two teams averaging 33-plus points in Week 9. The atmosphere throughout the game proved electric with a postseason feel, and these two teams could very well meet again in January.Points came aplenty as the Saints took a 35-14 lead, but the Rams responded with 21 straight points to tie the game in the fourth quarter. Saints kicker Wil Lutz nailed a 54-yard field goal at the 6:23 mark of the fourth quarter to put the Saints up 38-35, and then Drew Brees connected with Michael Thomas on a 72-yard touchdown pass. The box score provides a good indication of how the fireworks flew. In addition to the 45-35 final score, the Rams (8-1) and Saints (7-1) combined for 970 total yards; the Rams averaged 8.2 yards per play; and the Saints averaged 7 yards per play. For individual statistics, Brees and Jared Goff each topped 300 yards passing; Thomas hauled in 12 catches for 211 yards and a touchdown; Saints running back Alvin Kamara totaled 116 yards and three touchdowns.2. There were so many battles to digest, but arguably one that received a lot of attention heading into Sunday surrounded the Saints offensive line against a stout Rams interior defensive line anchored by Aaron Donald. Brees entered Week 9 being pressured on just 15.5 percent of drop backs and sacked just nine times on the season. And with strength against strength on the line, the Saints' front-five more that rose to the occasion. Brees wasn't sacked on the game and the Rams managed just four quarterback hits, while both Saints guards did their jobs of holding back the interior pass rush. The Saints quarterback helped out the offensive line with quick throws, of course, but even on deeper routes, the offensive line did a good job on keeping Brees clean and allowing him to dissect the Rams' secondary. 3. Rams running back Todd Gurley entered Sunday's game averaging 143.8 total yards from scrimmage, but faced a challenging matchup against a Saints run defense ranked first in the league. Still, how Gurley goes, goes the Rams and the elite running back got off to a fast start, scoring a touchdown to tie the game 7-7 in the first quarter. Gurley, however, couldn't get it going the rest of the game. Yes, the Saints jumped out to a 21-point lead before the Rams came back, but even as receiver Gurley had issues en route to finishing the game with 79 total yards (68 rushing). The receiving aspect was a bit of a head scratcher, as Gurley caught six passes for 11 yards on seven targets. Sunday marked just the third time on the season that Gurley didn't total at least 100 yards. The Rams were able to overcome those performances against the Arizona Cardinals in Week 2 and the San Francisco 49ers in Week 7, but failed to do so against a playoff-caliber team. -- Herbie Teope\n1. Thanks to two missed field goals by Broncos kicker Brandon McManus, both coming near the end of the first and second halves, the Texans escaped Denver with their sixth straight victory. After a back-and-forth first half, Houston and Denver dug in in the second, engaging in a punt-fest, save for three drives. Each club rattled off a scoring drive of at least 12 plays in the third quarter, with Denver leaning on rookie runner Phillip Lindsay (84 total yards) and tight end Jeff Heuerman (10 rec, 83 yards, TD) and Houston feeding DeAndre Hopkins (10 rec, 105 yards, TD). Down two with three-and-a-half minutes, the Broncos were the last to touch the ball. Case Keenum converted three third- or fourth-down conversions on a 14-play drive, one that was set back by dumb penalties and poor clock management. It appeared that Denver had struck gold when Keenum completed a fourth-down 18-yard laser down the middle to Emmanuel Sanders, who was strong in his first game sans Demaryius Thomas, bringing Denver into field-goal position. But the Broncos played it way too safe from there, taking up 40 seconds with a short pass to Heuerman and a stuffed run from Lindsay. The result? McManus pushed a 51-yard game-winning field-goal attempt wide right. Given an opportunity to save their hides and get back into the playoff picture, Vance Joseph and the Broncos blew it. 2. Speaking of Thomas, his \"return\" to Denver started hot but ended as cold as the Rockies. Traded to the Texans mid-week for a fourth-round pick, the receiver was targeted early, reeling in three receptions for 61 yards on three first-quarter targets -- but he was barely looked at in the final three frames. Thomas was acquired as the replacement for injured field-stretching threat Will Fuller, but wasn't his role on Sunday, as he was more active in the screen game and shallow crosses. It's going to take some time for Thomas to get acclimated in Houston. There were a few occasions when Thomas didn't know what the play was and, to combat the raucous Broncos fans, Watson was forced to run over to Thomas to explain his responsibility. Those growing pains should be remedied within the week, as will Denver's. Courtland Sutton, expected to have an expanded role with Thomas out the door, dropped a touchdown pass early and was not Keenum's preferred target on Sunday. 3. At the end of Week 2, Houston was languishing at 0-2 while Denver was experiencing its second consecutive 2-0 start. Things are different now. The Texans' trade for Thomas and their subsequent win on Sunday proved that they are going all-in for and are capable of securing the AFC South title. Houston is the first club since 1970 to win six consecutive games after starting 0-3. Bill O'Brien's hot seat is room temperature. The same cannot be said for Joseph, who is at risk of a sacking before the season closes. Joseph's decision to attempt a 62-yard field goal with 18 seconds left in the first half swung the game by six points in Houston's favor. His direction to play it safe at the end of the second sealed Denver's fate, and perhaps his own in the process. -- Jeremy Bergman\n1. Seahawks receiver David Moore couldn't handle a tipped pass on an untimed down that would have given Seattle a chance to send the game to overtime, ending a ferocious Seahawks comeback that fell short. After beating up on creampuffs the past month, the Los Angeles Chargers authored a signature win going into Seattle to beat up on the Seahawks. The Chargers have now won five games in a row and six of its past seven to move to 6-2. Philip Rivers helped generate back-to-back long touchdown drives to give L.A. a quick 14-7 lead, and the Chargers fended off a magical comeback attempt by Russell Wilson. The L.A. offensive line doesn't get nearly enough credit for its solid play. Chargers blockers pushed around the Seahawks defensive front, providing massive holes for Melvin Gordon on the ground. The running back returned from a hamstring injury and looked fresh, galloping over, around and through defenders for 113 yards on just 16 carries for a gaudy 7.1 yards per attempt. The Chargers o-line also gave Rivers (13 of 26 for 228, two TDs) time to repeatedly find Kennan Allen (6/124) on crossers to move the chains. The balanced effort on the road in a hostile environment portends a positive second-half playoff push for L.A.'s other team. 2. The Seahawks powered down the field on the opening drive on the back of Chris Carson. The running back, however, went out of the game with a hip injury midway through the second quarter. Most of Seattle's offensive success went with him. Outside of the chaotic comeback on the final two drives, Russell Wilson and the offense were stymied, going three-and-out four times on the day. For the afternoon, Seattle generated 25 first downs, 15 of which came on three possessions -- the other nine drives earned just 10 first downs. Wilson was sacked six times on the day, several of which came on him attempting to extend the play. The quarterback's pick-six to Chargers corner Desmond King put Seattle in a 25-10 hole deep into the fourth quarter they couldn't overcome. 3. The Chargers earned the win, but the kicking game continues its losing ways. Caleb Sturgis botched two extra point attempts and missed a 42-yard field goal try. Philip Rivers' facial reactions to each miss could fill an entire website. The five points (not counting the Chargers missed 2-point attempt trying to make up for the first miss) would have made life much easier on the blood pressure of Chargers fans. Los Angeles cut replacement kicker Michael Badgley after the rookie went 10 of 10 on boots (three field goals, 7 PATs) the previous two games. Signed to the practice squad, it would be a stunner if the Chargers don't go back to Badgley after Sturgis' disastrous day. -- Kevin Patra\n1. James Conner is the reason the Steelers (5-2-1) are on a roll as we dive into November. The running back broke 100 yards rushing for the fourth straight game, and while he was kept out of the end zone on the ground, he was also Pittsburgh's leading receiver through nearly two quarters. He finished second in receiving yards (seven catches for 56) and added a touchdown, becoming the first player in Steelers history to find pay dirt 10 times in the team's first eight games of the season. Not much more needs to be said, but if that information doesn't give you enough to be convinced, throw on the tape from a recent Steelers game and it will become overwhelmingly apparent that Conner is the lynchpin of this offense.2. Other than Conner, the Steelers did enough to take a game that, for a moment, looked like it was teetering on the edge of getting out of hand. Pittsburgh took a 20-6 lead and appeared to be gaining a significant edge before allowing Baltimore back into it via an 11-play, 75-yard touchdown drive. From there, the Steelers entered a mode that wasn't quite playing not to lose, but playing to preserve the lead. Think of it as rationing supplies: Pittsburgh converted short third downs when needed, didn't take too many chances and wisely handed the ball to Conner when it needed to burn clock. The defining moment of this approach: Roethlisberger took a sack inside two minutes instead of throwing the ball away on third down, keeping the clock running as Pittsburgh gave the ball back to Baltimore. It proved to be wise, and right now, wins -- no matter the fashion -- are and will continue to separate these Steelers from their divisional brethren as they trip over themselves as we approach Thanksgiving.3. The heat is on John Harbaugh after the Ravens lost their third straight, and four of five. Baltimore hasn't looked anything like the team that dominated Pittsburgh in Week 4, and it was most apparent in the fourth quarter, when on multiple occasions a third-down stop would've put them in decent position to attempt to tie the game. The final chance the Ravens (4-5) did get ended up being unsubstantial, as Baltimore wasted first down with a deep heave, took a sack on the ensuing play, burned around 20 seconds moseying back to the line for third down, was flagged for a false start, and then gave us a half-hearted series of laterals before accepting defeat. For a team that could've played the sidelines and moved within 40 yards of the end zone before needing a deep heave -- and needed the win more than perhaps even it realized -- it didn't operate as if that was a chance. Everyone will point to Harbaugh to blame, but execution -- not getting home on third-down blitzes or breaking up Roethlisberger attempts -- was the bigger problem for a team that is reeling entering the bye week.-- Nick Shook\n1. The Vikings' front seven pulled a collective Jason Voorhees on Matthew Stafford, terrorizing the Lions quarterback in a truly dominant performance that once again heralded Minnesota as one of the NFC's top teams. The Vikings' front seven tallied a franchise-record 10 sacks on Stafford, snuffing out a Lions offense that saw a level of success -- until it reached the red zone. Detroit failed to find pay dirt in its three trips to the end zone as Minnesota turned on the pressure and collapsed on Stafford with regularity. Danielle Hunter put in a memorable performance, tallying 3.5 sacks and 3 tackles in addition to scoring a 32-yard touchdown on a fumble recovery off a bumbled dump off from Stafford to Kerryon Johnson. Recent free-agent pickup Tom Johnson had 2.5 sacks and 3 tackles for a loss and Everson Griffen had 1.5 sacks. They managed to pull off this feat without Anthony Barr, who missed the game because of a hamstring injury. The performance underlined how dominant the Vikings (5-3-1) are up front and how much work the Lions (3-5) have ahead of them to fix their offensive line. Offensive coordinator Jim Bob Cooter's animated sideline discussion with his O-line in the first half didn't reverse the team's fortunes.2. Adam Thielen missed out on his chance for history. He was aiming to become the first player ever to record nine consecutive games with 100 or more receiving yards. Unfortunately, with Stefon Diggs not playing because of a rib injury, the Lions' talented secondary found it easy to double-team Thielen and stay all over him in the slot. Thielen was limited to 22 yards on four catches, but he still made a big impact even if it wasn't on the record book. He made a nice 2-yard touchdown catch in the second quarter and he took some pressure off routes for Laquon Treadwell, recent signee Chad Beebe and Kyle Rudolph. Dalvin Cook also was a threat in the short passing game, recording four catches for 20 yards to supplement the 89 rushing yards he tallied.3. Kirk Cousins found moderate success against the Lions defense, but struggled to find rhythm for stretches of the game. He connected on 18 of 22 passes for 164 yards, and a touchdown. In addition, he was picked off by Darius Slay -- a play that eventually led to a Lions field goal. Not having Diggs on the field certainly played a factor in limiting Cousins' effectiveness. Stafford connected on 25 of 36 passes for 199 yards while under a constant barrage of pressure that always intensified as the Lions crept deeper into Vikings territory. With Johnson limited to 37 yards, the Lions had no reliable way to break through Minnesota's stellar defensive effort.-- Austin Knoblauch\n1. The strength of the first-place Redskins (5-3) has been in the trenches, yet the Falcons (4-4) won up front on both sides of the ball. Already playing without left tackle Trent Williams, Washington saw right tackle Morgan Moses and both starting guards go down with injuries during the game. The remaining linemen were guilty of back-breaking penalties, putting Alex Smith and Adrian Peterson behind the eight-ball. Peterson had no room to run, too often taking hits in the backfield before he could gather momentum.A stout defense that had held Christian McCaffrey, Ezekiel Elliott and Saquon Barkley under 100 rushing yards combined was gashed by the tandem of Tevin Coleman and Ito Smith, surrendering more than 7.0 yards per carry through the first three quarters. A team built to jump out to an early lead and take the air out of the football simply doesn't have the firepower to play catchup after falling behind 28-7.2. No one is calling for the head of Atlanta offensive coordinator Steve Sarkisian this season. Matt Ryan's attack found the end zone on four of its first five possessions, with a red-zone interception as the lone exception through the first two and a half quarters. Redskins coach Jay Gruden acknowledged at halftime that his third-down defense was \"a joke,\" but the Falcons do this nearly every week. They are converting roughly half of their third-and-long attempts, including Sunday's 40-yard touchdown to Calvin Ridley. They have also reached pay dirt on 17 of their last 20 trips to the red zone going back to Week 2. Coleman and Smith amassed 148 yards on the ground against a defense that was allowing just 80 rushing yards per game. This is one of the most dangerous offenses in the league, with Ryan playing at a level similar to his 2016 MVP season. Riding a three-game winning streak -- with star linebacker Deion Jones eligible to return from injured reserve in two weeks -- the Falcons maintain realistic hopes for a wild-card berth.3. Julio Jones' scoreless streak is over! Jones broke a Ha Ha Clinton-Dix tackle at the goal line to finish off a 33-yard screen play in the fourth quarter. He nearly scored on a bomb the previous possession, but Josh Norman tackled him with the ball in the air for a 47-yard pass-interference penalty. Jones had his way with Norman, hauling in seven passes for 121 yards and the touchdown against the struggling coverman. For all of the attention over his scoreless streak, Jones is leading the NFL with 116.5 receiving yards per game.-- Chris Wesseling\n1. Coming off a week bathed in total off-field chaos, the Browns (2-6-1) found themselves in a fix against the Chiefs (8-1). After interim head coach Gregg Williams deactivated safety Damarious Randall, Cleveland saw rookie cover man Denzel Ward leave with a hip injury before E.J. Gaines was ruled out with a concussion. The paper thin secondary was overwhelmed right away, giving up chunk plays of 50, 40, 25, 25, 23, 21 and 19 yards in the first half alone. With 375 yards and three touchdowns on the day, Chiefs signal-caller Patrick Mahomes crossed the 300-yard barrier for the eighth game in a row, tying him with Andrew Luck for the longest single-season streak in league lore. Kareem Hunt lashed Cleveland for 141 yards off 19 touches while scoring twice by land and again through the air. Travis Kelce piled up 99 yards and two touchdowns off nine grabs, while Tyreek Hill, Spencer Ware and Sammy Watkins made plenty of plays against a Browns squad that refused to tackle.2. With his mentor Bruce Arians up in the CBS booth, newly appointed Browns play-caller Freddie Kitchens emphasized quick throws for Baker Mayfield. Kitchens also tried to play keep away from the Chiefs with an early 12-play, 75-yard march that milked seven-plus minutes off the clock with eight gallops by the hard-running Nick Chubb (22/85/1). Nice idea, but the Chiefs flew down the field on the following drive to go up 21-9 and shove the Browns into a hole. This was quietly one of Mayfield's better games, with the first-overall pick hitting 29 of 42 throws for 297 yards and two touchdowns. The rookie led a beautiful two-minute scoring drive before the half, but also threw a less-than-pristine pick in garbage-time. We finally saw Duke Johnson get involved with two touchdowns and 86 yards off 10 touches. The Browns aggressively went for two after all three of their touchdowns, but failed each time and felt largely doomed after a blocked punt led to a quick Chiefs touchdown and the 34-15 lead.3. The game featured just three punts all day, while the Chiefs reminded us they simply cannot be slowed on offense. Quick strikes, deep shots and passes into the flats with no defender within a mile all helped the Chiefs do what they've done all year. With a cupcake affair against the Cardinals next week, we're likely to see a 9-1 Kansas City juggernaut roll into Los Angeles to face the Rams in Week 11. The two squads resemble each other in their ability to simply pour on the yardage and points. The defense is concerning, but this Chiefs attack can put up 40 points in their sleep.-- Marc Sessler\n1. Cam Newton's always been a good winner, and the Panthers' performance should give him reason to smile. Newton and the Panthers sliced up Tampa Bay for a franchise-record 35 first-half points behind a balanced effort punctuated by a stout ground game spearheaded by Christian McCaffrey. The second-year running back churned out 79 yards on 17 carries and had two touchdowns. He also netted 78 yards on five catches. Newton had a solid game, completing 19 of 25 passes for 247 yards and two TDs. Carolina's effort in the second half wasn't as impressive as Tampa Bay clawed back into the game, but ultimately this was a game the Panthers (6-2) always should have won handily, and they did. The Panthers' third consecutive victory underlines their candidacy for the NFC South title.2. Newton's offensive supporting cast put on Super Friends-esque performance in the victory. Wide receiver Curtis Samuel channeled his inner Flash when he scored arguably the most amazing touchdown of the season in the second quarter on a well-executed reverse that zigzagged completely around and through a bumbling Bucs defense. In scoring the 33-yard TD, Samuel hit the line of scrimmage at more than 20 mph before running a grand total of 103.85 yards on his absurd odyssey to the end zone, per Next Gen Stats. Curtis Samuel covered a total of 103.8 yards on his 33-yard double-reverse TD run against the Buccaneers in the 2nd quarter.This is the longest distance covered as a ball carrier on a rushing play this season. #TBvsCAR #KeepPounding pic.twitter.com/R3Cen6ACepLater in the first half, tight end Greg Olsen made a spectacular one-handed catch while double-teamed in the end zone on a perfectly threaded 24-yard pass from Newton. There were other nice plays -- Devin Funchess repeatedly squeezed out extra yards on gutsy second efforts on catches and McCaffrey made a spectacular mid-play leap over a defender on a 32-yard reception in the second quarter. When Norv Turner's Carolina crew is clicking, they're just as fun to watch as they are devastating for opponents.3. Ryan Fitzpatrick's latest ascension to Bucs starter wasn't anywhere close to Jameis Winston's four-interception disaster last week. He managed to resuscitate a stillborn offense that had been more or less dormant since Week 3 even if a defensive tourniquet was just as badly needed. The veteran quarterback finished with 24-of-40 passing for 243 yards, four TDs and two interceptions. The performance should keep Fitzpatrick embedded as the starter ahead of Winston -- for now. Still, incremental progress on offense isn't enough to reverse the Buccaneers' litany of woes. Tampa Bay's defensive feebleness is remarkable considering some of the notable names the team brought in during the offseason, but the utter lack of a running game is just as troubling. Peyton Barber and Jacquizz Rodgers were held to a combined 45 yards rushing on 13 carries for the Buccaneers (3-5).-- Austin Knoblauch\n1. This wasn't a game for those who don't enjoy punts, offensive miscues and defenses that occasionally stumbled into turnovers. I know, it doesn't sound appetizing to read about, either, but sometimes that's the way this sport plays. Sunday was a grind-it-out affair between two AFC East teams that probably won't be in the hunt in late December. The Dolphins (5-4) are the better of the two right now, but the margin wasn't as wide as one might expect. Brock Osweiler was frequently pressured and struggled to a line of 15-of-24 passing for 139 yards and a passer rating of 78.3. New York tied a season high with four sacks of Osweiler. On the other side of the field, the Jets (3-6) rushed for 3.8 yards per carry as a team. Their first third-down conversion didn't come until 1:29 in third -- and it was by a facemask on a sack of Sam Darnold. The only thing worse than all of this was, well...2. Sam Darnold. The rookie served up a pair of his classic interceptions both early and late, throwing a bullet into the gut of linebacker Kiko Alonso, and then trying to toss a ball over linebacker Jerome Baker but not putting enough on it, resulting in a crushing pick-six. Darnold also threw an interception that again demonstrated his struggles with seeing underneath defenders in a mistake that was all too reminiscent of past errors. The fourth and final interception was ugly, but out of desperation, so we'll take some of the blame off him. The credit I'll give Darnold in this forgettable game is for both A) still giving it the ol' college -- er, professional try, and B) showing improvement in the department of ball security. On two sacks by Wake, Darnold looked just like he did when he would get sacked and fumble while at USC. He instead held onto the ball, including while he was rolled back onto his head. That's encouraging. The rest of Sunday -- including a passer rating of 31.8 -- not so much.3. The good thing for the Dolphins is they won a game they easily could've lost, securing a victory over a team they should beat. Their defense bounced back after getting ripped to shreds by Deshaun Watson and the Dolphins, and will have those four interceptions to hang above their mantle like a prized catch. The offense, though, leaves plenty to be desired. Tannehill Watch continues as Osweiler shows he's an average quarterback at best, and as the Dolphins rely heavily on Frank Gore to a less than three-yards-per-carry average. This offense needs a jumpstart. Its defense was enough in Week 9.-- Nick Shook\n1. The Bears smothering defense entered Buffalo with a decisive advantage against a lost-at-sea Bills offense. Vic Fangio's unit played to the expectation, clobbering the bevy of underneath tosses and forcing four turnovers, including two first-half defensive touchdowns. Safety Eddie Jackson stripped Bills tight end Jason Croom and dashed for a 65-yard score. Linebacker Leonard Floyd later took a tipped pass to the house. The two scores were more than enough to blow the game open. Corner Kyle Fuller was arguably the most impressive defender on the day, including an interception and three passes defended. On the day, a dominant Bears D generated four takeaways, four three-and-outs, and gave up just nine measly points. The Bears again rested beastly pass rusher Khalil Mack, who is dealing with an ankle injury. It was a smart decision by Chicago. The Bears didn't need Mack this day. Despite not getting overwhelming pressure on Buffalo (zero first-half sacks; four on the day), Chicago has enough playmakers in the secondary to make an offense like Buffalo pay. Getting Mack healthy for the stretch run is the key as the Bears (5-3) continue to lead a hotly contested NFC North. 2. The Bills offense is a wheel-less wagon stuck in a sinking mud. Quarterback Nathan Peterman got the start. With the barren collection of offensive weapons, a porous offensive line and zero run-game, it matters not who starts under center. The turnover-maestro tossed three interceptions, including a pick-six. The first two INT's weren't completely Peterman's fault. The first was bobbled by newly added receiver Terrelle Pryor and popped into a defender's hands. Pryor did nothing to aid the Bills attack (2/17). On the pick-six, receiver Zay Jones was hit at the line of scrimmage as the ball arrived and bounded into the hands of linebacker Leonard Floyd who galloped for the score. Peterman shied away from difficult throws, opting to a smorgasbord of quick, short tosses that did little to keep offensive rhythm. With no deep threat, the Bears could squat on short routes, which led to the three interceptions. A garbage-time QB sneak for a score ended a streak of 39 possessions over 12 quarters without a touchdown for Buffalo. Futility knoweth thy name. As depressing as Peterman's play was the lack of ground game is as concerning for Buffalo. LeSean McCoy continues his putrid play behind a line that can't open holes. The running back generated 1.0 yards per carry 10 totes. McCoy's dancing style isn't conducive to positive plays in this offense. 3. Facing a very good Bills D, the Bears offense wasn't asked to do much and didn't need to with its own defense dominating. Chicago had just 190 total yards and 11 first downs on the day (conversely the Bills' sad offense netted 264 yards and 22 first downs). Jordan Howard scored two rushing touchdowns in the first half, and Anthony Miller has become a reliable target for Mitch Trubisky. The quarterback missed a few throws otherwise the Bears might have put up a 50-burger on the day. Despite not getting much on offense and earning 14 penalties for 129 yards, the important thing for Chicago is that they won a road game they were expected to dominate. Dominate the defense did. Now the schedule heats up for Matt Nagy. The Bears have three straight division tilts, facing the Lions, Vikings and Lions in the next three games. Down the road, matchups with the Rams, Packers and Vikings again loom in what should be a wild ride for the division-leading Bears. -- Kevin Patra\nMore Posts\nPhoto Essay\r\n"}