{"id": "Drew Brees has chance to be 3rd QB to beat all 32 clubs", "paragraph": "  \nNew Orleans Saints quarterback Drew Brees has another opportunity to join Peyton Manning and Hall of Famer Brett Favre in the record books. With a win against the Baltimore Ravens, Brees will become the third quarterback in league history to beat all 32 teams.The record-breaking Brees, however, looks at Sunday's matchup as another contest against a formidable opponent.\n\"Again, you try to make it like any other game, any other opponent,\" Brees told reporters Wednesday, via the Saints' official website. \"You turn on the film and you know you just digest what you see you know. \"Take the name off the helmet and just go off you know what you see on film and they are an extremely talented defense across the board. Front, linebacker corps, back end in secondary. You see they've built that defense to fit those pieces and execution has to be at a premium to beat these guys.\" Brees, who is 0-4 on his 18-year career against the Ravens, knows he and the Saints have a tough task Sunday, and pointed out Baltimore have traditionally boasted a stout defense going back to the days of Hall of Fame linebacker Ray Lewis and safety Ed Reed. This season is no different, as the Ravens rank first in the league in total defense and are the only team in the league to allow less than 300 yards of offense per game. The Ravens also rank first in points allowed per game, surrendering a paltry average of 12.8 points, and are coming off a shutout win in Week 6. The achievements are noteworthy when considering the video-game like offensive production and lit-up scoreboards around the league on any given week. Sunday certainly presents a challenge for the Saints in a matchup featuring an elite offense against an elite defense. But Brees, who recently became the league's all-time passing leader, embraces the opportunity to potentially come away on the positive side of the win-loss column. \"Listen, I would love to beat these guys,\" Brees said. \"They're always a great team when you play them. So you always know it is going to be a slugfest. You do not get to play them all that often, right? It's a once every four-year deal being AFC and NFC, but they're a great team. They're the No. 1 defense in the league right now, so we have got our work cut out for us.\" Meanwhile, Brees has another piece of history he could add to his Hall of Fame credentials. The Saints quarterback enters Sunday with 499 career touchdown passes and needing one more to become the fourth signal-caller in league history to throw 500. \nMore Posts\nPhoto Essay\r\n"}