{"id": "Week 11 Trade Calls: Buy the Bears", "paragraph": "\nWe're nearing the point in the season where it has become prudent to start examining fantasy playoff schedules. People often obsess about this detail far too early in the season when the NFL as a whole remains unsettled. Teams and players change, roles become redefined, and the landscape of Weeks 14-16 can look wholly different in November as opposed to August or September. With that in mind, I highlight a few candidates to trade for or away given favorable or unfavorable fantasy postseason schedules. A quick reminder, though, that the fantasy playoffs shouldn't be an end-all, be-all for determining whom to trade or whom to start in a given week. Be sure to use ALL of the data and information at your disposal to make the most informed lineup and trade decisions possible. Chicago Bears passing game: Mitchell Trubisky is getting comfortable in Matt Nagy's offense and the young quarterback's performance is lifting the whole offense. He's thrown for over 300 yards in four of his last six games, and two-plus touchdowns in five of six. He missed both benchmarks in Chicago's shellacking of the Bills, where the defense scored twice and Trubisky had no reason to chuck the rock around the yard. Allen Robinson's healthy return gives Trubisky a true No. 1 wide receiver again, while Anthony Miller's ascendance gives Nagy a speedy playmaker to serve as a bootleg Tyreek Hill. Making this group even more attractive is the upcoming schedule, which features games against the Lions and Giants before a fantasy playoff run that features games against the Packers, Rams, and 49ers -- three defenses susceptible to the pass. This confluence of a strong run of success and a beneficial upcoming schedule make this entire passing offense worthy of targeting in trades before the deadline closes in. Kirk Cousins, QB, Minnesota Vikings: I'm really not a huge fan of trading for quarterbacks in fantasy, especially if you play in a 10-team, or even a 12-team league. Generally, replacement level starters are available on the waiver wire. However, Cousins has a pretty solid upcoming schedule (including Detroit and Miami in the fantasy playoffs). Cousins entered his bye quietly, with 20-plus points just once in the four games before his week off. That could create a nice buy-low situation if you aren't in love with your fantasy passers or want a potential X-factor in the playoffs. Running back handcuffs: This is a bit of a cop out, as I was struggling to identify some under-the-radar trade for candidates. So instead let this serve as a reminder that now (not the draft in August) is the time to acquire and stash running back handcuffs. Making a one-for-one trade for top-tier backups like Malcolm Brown, Spencer Ware or Rod Smith probably won't fly -- but if you can add a backup of that caliber into a multi-player trade, it could help bolster your squad to stay strong during the postseason. Adrian Peterson, RB, Washington Redskins: First, a tip of the cap to Peterson, who has played superbly this year and silenced many, many, doubters. However, there are mounting reasons for concern for AD's fantasy outlook the rest of the season. For starters, he's been playing through a shoulder injury, but could be getting clear of that (finally). His offensive line has been decimated by injuries, going from one of the better units in the league to a liability. He's posted fewer than 10 PPR fantasy points in four of his last six games. The Washington offense is averaging fewer than 20 points a game, resembling more of the old Alex Smith we saw in Kansas City and not the high-octane, MVP-caliber passer from last year. And finally, the schedule is brutal, as only one of his remaining opponents ranks outside of bottom-12 in terms of fantasy points allowed to running backs. Volume can trump many of these issues, and Washington wants to load Peterson up with carries, especially when leading. But that perfect scenario might be hard to attain for Washington down the stretch.Derrick Henry, RB, Tennessee Titans: Last week, I advocated trading for Dion Lewis, and I still firmly believe if you can make that move you should. Meanwhile, if you're still saddled with Derrick Henry on your roster, now might be the time to flip him for whatever you can get. Like I mentioned last week, the playing time and volume disparity between Lewis and Henry is widening significantly. Henry has found the end zone three times in the last two games despite playing 22 percent of the snaps in that span. If there's a fantasy manager in your league with a dire need at running back who might not be paying too close of attention to the Titans backfield split, float out Henry and see what you can get back. He might be a hard asset to move for leagues full of sharp players who routinely study playing time splits, but there has not been a better time this year to sell Henry than right now.Buccaneers pass-catchers: By recommending this move, understand I'm operating under the assumption that Ryan Fitzpatrick stays under center the rest of the season. This might seem a bit counter-intuitive, but here's my thought process. Fitzpatrick undoubtedly provides a boost to his pass-catchers, but the problem is, much like actual magic, when the Fitzmagic hits we have no idea how or why it's happening. It just ... appears. What I mean by this is Fitzpatrick sprays the ball all over the field with little rhyme or reason to his targets. In Fitzpatrick's five starts, Mike Evans does lead the way with 23 percent of the targets, but five other players own at least 10-plus percent, including Jacquizz Rodgers. This group rises and falls with Fitzpatrick's play, and that volatility, in addition to week-to-week volatility in terms of target share, makes this group really boom-or-bust. People might still be enticed by the idea of getting a piece of the Fitzmagic, and you might be able to come out on the better end of a trade if you need a more consistent option to round out your lineup. Got Aaron Jones, Sony Michel, CMC, Fournette, and Tarik Cohen. Should I test the WR market with Jones and see what I can get or trade Sony Michel away right now for Robert Woods. Can Aaron Jones remain a consistent flex play?Sony Michel is definitely the back to shop in this list. Aaron Jones just emphatically secured the starting job in Green Bay (he played 72.2 percent of the snaps, a season high), while Michel is working his way back from injuries and could become a part of a committee if Rex Burkhead returns soon and carves out a role for himself as well. Trade Brieda, Recieve Wentz?I have Gordon, Conner, Chubb, A Jones, and Rivers is my only QB.I'd either look to the waiver wire or aim higher if you're trading for a quarterback. Running backs are much more injury prone than quarterbacks, and valuable in fantasy. Wentz is only averaging around 21 points per game over the last month. Someone like Mitchell Trubisky (see above) might be a more affordable target and carry higher upside than Wentz.Standard League -Trade Away: Zeke Elliot & Drew Brees (Wentz back up)Trade For: Marlon Mack, Stefon Diggs, and Lamar Miller.Whats the verdict? Win or not enough. Thanks!If you're struggling to fill out a full roster and feel good about it, I think this trade is OK. Personally, I'd rather throw Wentz in with Zeke and keep Brees. I'd also probably feel better keeping Zeke and Brees in general, but I understand this move if depth across the board is your issue.Jordan Howard for Greg Olsen?While I'm in on the Bears passing attack moving forward, I'm still down on Howard. He needs touchdowns to be fantasy relevant in this offense, and those are harder to come by for a back who isn't involved in the passing attack and isn't a home-run hitter. I think this is a solid trade to help you get consistency at one of fantasy's worst positions (tight end). Trade away Edelman for Big Ben (love playoff schedule)? I'd have to rely on Howard at flex if I do this. I also have Wilson.Not a fan of this move at all. I'd much rather stick with a solid player like Edelman at the flex and scour the waiver-wire for streaming candidates at quarterback. There will be good matchups to exploit with that strategy, though it certainly carries more risk.Should I trade Davante Adams, Phillip Lindsay, and Mike Williams for Mike Thomas, Dion Lewis, and Corey Davis? Currently top of my league and Lindsay doesn't make my flex.I feel like your leaguemate won't go for this, but if they do, make this trade right away.In a dynasty league, going for title:Send: Devonta Freeman, AJ GreenReceive: Adam ThielenIf the title is all you're after, I say go for it. This move might hurt in the long term but if you're close and a player like Thielen can put you over the top, win now. Fantasy championships are fleeting, and can't be taken for granted!-- Alex Gelhar is a freelance fantasy writer for the NFL and a full-time law student. You can find him on Twitter @AlexGelhar. \nMore Posts\nPhoto Essay\r\n"}