{"id": "NFL Week 9 game picks: Rams lose first game; Pats top Packers", "paragraph": "\nFranchise quarterbacks playing against franchise quarterbacks -- that's the theme of Week 9.There's the highly anticipated Aaron Rodgers-Tom Brady Sunday nighter at Gillette. Jared Goff brings the NFC's top offense to New Orleans to face the most balanced attack ever generaled by Drew Brees. Philip Rivers and the Chargers against Russell Wilson and the Seahawks should never get third billing ... but it will this weekend. Not surprisingly, each of those games carry weight in the playoff race.Back to Rams at Saints for a moment -- a few big-time receivers will surely figure into the outcome, be it Robert Woods, Michael Thomas or a guy who's played for both organizations, Brandin Cooks. Yet, all three of them combined might fail to equal one receiver's production in the wildest game in the history of this L.A.-New Orleans series. They called him Flipper, and his day in November of 1989 has never been equaled:\nNow, on to more important matters: Did you watch all 375 \"Friday the 13th\" movies on Wednesday night?? Can't miss Jason In Space!On to your thoughts ...@gmfb the Panthers are sixth in @HarrisonNFL power rankings, Iâ\u0080\u0099ll take that. Itâ\u0080\u0099s time to put the Panthers at the adult table! #GMFBNot until they eat their Brussels sprouts.FINALLY! Some respect from ?@HarrisonNFL? for my team! And we added ?@haha_cd6? today! This defense just got even scarier. ?@Redskins? #httr #hailYEAH https://t.co/VpJkeh8OacDefine scarier.For thoughts on the full Week 9 slate, see below. Beyond the premier quarterback matchups, a pair of divisional tilts are worth noting: Lions-Vikings and Steelers-Ravens. Your thoughts are always worth noting: @HarrisonNFL is the place.Elliot Harrison went 13-1 on his predictions for Week 8, bringing his record for the season to 83-36-2. How will he fare in Week 9? His picks are below.Oakland Raiders 23, San Francisco 49ers 208:20 p.m. ET (FOX/NFL Network/Prime Video) | Levi's Stadium (Santa Clara, Calif.)A fun game, if only for how cruddy each of these teams are right now. Gallows viewing, you might say. You know, the Raiders and 49ers have played some cool games in the past. In 2000, Jeff Garcia brought the Niners back from two touchdowns down, late in the fourth quarter ... only to get Tim Brown'd in OT. San Francisco and the then-Los Angeles Raiders opened up the 1994 season on \"Monday Night Football,\" with Jerry Rice continuing his assault on the NFL record books (seven catches for 169 yards and two touchdowns PLUS a 23-yard rushing score on that memorable evening). In 1970, the first year of the AFL-NFL merger, the 49ers needed to beat their Bay Area counterparts to win the NFC West on the last day of the season. They were two of the top teams in the early '70s, although it only felt like one showed up on that day. San Francisco's defense played a near-perfect game, while NFL MVP John Brodie tossed three touchdown passes en route to a, well, 38-7 rout. The 2018 49ers' defense has been up and down, though the unit has definitely shown more flashes than Oakland's D, which ranks 31st in points allowed. I thought this defensive discrepancy would be the difference ... but then Nick Mullens was officially named the starter in place of the injured C.J. Beathard on Thursday afternoon. This made me skeptical of the Niners' ability to put points on the board. Thus, I jumped back in the file and changed the pick. (The magic of internet journalism!)Chicago Bears 17, Buffalo Bills 141 p.m. ET (FOX) | New Era Field (Orchard Park, N.Y.)Want to take the Bills in a home upset. The issue here is that, unlike the Titans team Buffalo bested a few weeks ago, Chicago does have at least a morsel of a passing game. Another thing weighing on your gallant prognosticator? Something known as the Nate Peterman Complex. A rather new phenomenon, which requires forsaking your sensical approach to picking games because you want a much-maligned player to do well, and you happen to love the Buffalo Bills, or something like that. I love Joe Cribbs, Don Beebe and Aaron Schobel as much as the next guy -- heck, more than the next guy -- but ... Bears win. That defense will be too much for Buffalo. Anticipating a knuckleball of a contest, with less-than-stellar quarterback play.Carolina Panthers 34, Tampa Bay Buccaneers 201 p.m. ET (FOX) | Bank of America Stadium (Charlotte, N.C.)\nOn paper ... iPad ... Microsoft Surface Pro ... Android ... iPhone ... papyrus ... calligraphy sheet ... this is a Panther win all the way, right? Not so sure. Ryan Fitzpatrick could either produce four touchdowns or four interceptions. Felt it would be the former earlier in the week, but Fitzmagic's tricks can be like the guy at the local podunk theater who has cards visibly showing up his sleeve (unbeknownst to him). Remember Jets at Chiefs a couple of years ago? Maybe it's better you don't. It might not matter which Bucs passing attack we see if the Panthers' offense motors like it did last week. The greatest sample of classic Norv Turner is found in this little stat: first-down rushing. Carolina leads the NFL with a staggering 5.7 yards per carry. Think Turner's men will keep that up against this Tampa front, dictate the flow of the game and win.Kansas City Chiefs 30, Cleveland Browns 241 p.m. ET (CBS) | FirstEnergy Stadium (Cleveland)Already heard those folks who think this is where the Chiefs fall ... the ultimate trap game. Or, as alternate theorems go, maybe the uber-aggressive Browns defense swamps Kansas City's multiple offense, which is equal parts complex and high school, with plays that typically work to near-perfection. Sounds great. I am still taking Kansas City. While not afraid to predict upsets (I was dumb enough to think the Raiders would play inspired football in London against the Seahawks -- it was close, for half a quarter), I don't see how Cleveland will score enough points with a new OC and rookie QB, especially if this matchup evolves (devolves) into a track meet. Kareem The Hunt will run all over the league's 28th-ranked rushing defense, before carbon freezing them in Gregg Williams buyer's remorse.Miami Dolphins 20, New York Jets 171 p.m. ET (CBS) | Hard Rock Stadium (Miami Gardens, Fla.)While I think the Jets are close to becoming a playoff-caliber group -- and certainly equal to the Dolphins at this point -- picking the home team to win this week. New York's troubles against the run are inexplicable, given the players this team has up front (as well as a safety like Jamal Adams in run support). Miami should work Kenyan Drake and Frank Gore in this contest, similar to what the Fins did in their Week 2 meeting with the Jets -- but with more volume. Give those guys 30 carries instead of 20; don't make Brock Osweiler feel the need to force throws. Drake is averaging 4.9 yards per carry, Gore 4.6. Ride 'em.Pittsburgh Steelers 23, Baltimore Ravens 201 p.m. ET (CBS) | M&T Bank Stadium (Baltimore)Pivotal game in the AFC North -- and, perhaps more than usual, the quarterbacks are key to this outcome. Ben Roethlisberger's road struggles -- at least compared to his typical play at Heinz -- are well-documented. Look no further than the turnoverfest in Cleveland on the opening Sunday of this season. Joe Flacco is not above criticism here, either, as he faltered in Charlotte last week. Flacco tossed two critical whatwashethinking-style interceptions, while not even eclipsing 200 yards on 39 passes. Taking the Steelers in this matchup, as they know that going 0-2 vs. the Ravens could decimate their hopes for winning the division. Pittsburgh is also playing with much emotion right now, understandably.Minnesota Vikings 27, Detroit Lions 161 p.m. ET (FOX) | U.S. Bank Stadium (Minneapolis)\nThe Lions are not tanking. Yes, they just suffered an ugly home loss to Seattle. And yes, in the wake of said loss, they traded Golden Tate. But they also traded for \"Snacks\" Harrison. And the Tate deal -- which netted Detroit a third-round pick -- felt like the kind of purely financial, big-picture move that's common in the NFL's salary-cap era. That said, it's OK to wonder where the spark on this offense will come from -- always thought of Tate as the igniter for this team. For the Lions to win in Minnesota -- and not to sound like a broken Motown 33 here -- they should get their running backs more involved. The lack of usage at times is mind-boggling. What the heck happened with Kerryon Johnson last week? One week after the rookie's 158-yard effort in Miami, the Lions barely ran him. Detroit's defense is suspect. Kirk Cousins will eat Lions defenders alive if they don't get down time, and perhaps fewer possessions to contain the Vikes' offense. Prediction: Adam Thielen passes the 100-yard mark again, on his last catch of the day. More important: Minnesota will be running Dalvin Cook on Sunday. We hope.Washington Redskins 26, Atlanta Falcons 201 p.m. ET (FOX) | FedExField (Landover, Md.)The Falcons produced too much offense for their last two opponents, going over 400 yards in each game. In fact, they've eclipsed that mark -- which is always the sign of a fine day at the office for the QB and OC -- in five of their past six. But Matt Ryan faces a different task this week: a Redskins secondary that is playing better (at least since the Saints loss) and just added another piece in Ha Ha Clinton-Dix. Running on Washington's front these days is no fun, either -- the Redskins rank second in rush defense, with Jonathan Allen and Daron Payne mucking up the line of scrimmage and Zach Brown cleaning up. That's why opponents typically opt to throw on Washington, and why Ryan's play is pivotal to Atlanta's success on Sunday. Other side: Adrian Peterson and Jordan Reed go big this week.Houston Texans 22, Denver Broncos 204:05 p.m. ET (CBS) | Broncos Stadium at Mile High (Denver)A lot of folks will be going with the Broncos at home, especially with the Texans having played nobody during this five-game winning streak. That's fair, as Denver is a tough place to play, even for the league's elite (SEE: Chiefs in Week 4, Rams in Week 6). Against the Dolphins last week, Deshaun Watson came out of the season-long catacombs, resembling the monster he was in 2017. With Demaryius Thomas added to the fold this week, revenge means nothing while attention connotes strategy. How will the Broncos defend DeAndre Hopkins with their former teammate -- former talented teammate -- on the other side? How will Houston capitalize? The sad irony for Broncos faithful would be if Thomas were to catch everything thrown his way, as his occasional drops drove Denver fans to throw their Randy Gradishar football cards at the TV set. (Or maybe it was the Gerald Willhite cards. Or Sammy Winder Starting Lineup figurines.)Key stat: While Denver's defense owns a superior reputation to Houston's unit, the relevant difference in these groups comes on big plays allowed. I'm talkin' plays of 20-plus yards. The Texans have yielded the fifth-fewest in the league -- and they've played one more game than every defense ranked in front of them. The Broncos? Tied for 30th. Oy.Los Angeles Chargers 27, Seattle Seahawks 234:05 p.m. ET (CBS) | CenturyLink Field (Seattle)A lot of people chalked this up as an easy Chargers win back in August. Not so easy now, eh? Most surprising team in the NFL: Seahawks, hands down. Then maybe the Chiefs, because of MVP-to-be(?) Patrick Mahomes. Seattle is a respectable 4-3, something that was predicted by precisely no one. The defense ranks fourth in points per game allowed, also predicted by precisely no one. Meanwhile, the Bolts have dropped just two games, both to top-flight quarterbacks in Mahomes and Jared Goff. That said, their wins have come against Josh Allen, C.J. Beathard, Derek Carr, Baker Mayfield and Marcus Mariota. Meet Russell Wilson, who has played very well this season without taking off out of the pocket much. Where the Chargers are lighting it up: chunk rushing plays. They are getting 10 yards or more on 20 percent of their runs. That's an astronomical figure, and it might be the difference against a team that allows 4.5 yard per carry.New Orleans Saints 31, Los Angeles Rams 284:25 p.m. ET (FOX) | Mercedes-Benz Superdome (New Orleans)The game of the week, if you ask me. Young quarterback making a push for MVP vs. the most prolific passer in the history of the game. Supremely talented quarterback at throwing intermediate routes vs. a man who has made his living off those skinny posts and (especially) seam routes. Long story short: Aaron Rodgers-Tom Brady isn't necessarily the most exciting quarterback matchup of the week. Jared Goff competing against Drew Brees is equal in every respect, save for maybe historical relevance. Goff-Brees feels like a young Peyton Manning facing Dan Marino in 1999. Or a baby-faced Marino going up against Dan Fouts in 1984. (I have that game on DVD. Classic OT thriller.) The difference in this matchup could be the Saints playing at home -- although crowd noise won't be enough if New Orleans can't get to Goff. That's why I like the idea of the Saints offering up an Ingram/Kamara combo platter with all the accoutrements. Did you know that, as unbeatable as the Rams have seemed, they allow the highest percent of rushes gaining 4 yards or more in the NFC? Yep, 51.5 percent of opponent rushing plays pick up easy real estate. It's been a non-factor against most of Los Angeles' opponents -- quite concerning versus these Saints, though.New England Patriots 34, Green Bay Packers 308:20 p.m. ET (NBC) | Gillette Stadium (Foxborough, Mass.)\nThe stellar group of researchers at the NFL West offices -- Jack Andrade, Bill Smith, Eric Lemus and the gang -- put together a book of knowledge on the Aaron Rodgers-Tom Brady faceoff that rivals the booklet that used to be offered on late-night TV by the guy in the Riddler suit promising that the government could bankroll your life. Well, this Packers-Patriots game is so money, it knows it's money -- NBC will hype it up to Madden-Favreian proportions. And the truth is, this matchup is special. Green Bay came a deeper kickoff away from potentially knocking off the undefeated McVays last week. And when the Pack and Pats last faced off, Green Bay pulled out one of the top games of 2014, with a 26-21 win at Lambeau. Both Rodgers and Brady posted passer ratings north of 100 in that contest. Because these two reside in separate conferences, as well as Rodgers' injury history, the future first-ballot Hall of Famers have only played against each another as starters that one time. This is Meeting 2.0 -- similar to Joe Montana and Dan Marino, who only duked it out twice. Ditto Brett Favre and Peyton Manning. Hopefully this Rodgers-Brady bout replicates the Packers-Colts classic from 2004. Since 2014, Brady paces the NFL in touchdown passes; Rodgers is second on that list. More relevant is that Brady is 9-2 during that span at home in prime time, while Rodgers is 3-6 on the road.Non-QB intrigue: How does Green Bay handle James White? If the Packers play in dime coverage, White won't necessarily have the advantage of beating linebackers to the spot Brady is throwing to. White might be the key figure in this game, especially if Sony Michel can't go.Dallas Cowboys 24, Tennessee Titans 138:15 p.m. ET (ESPN) | AT&T Stadium (Arlington, Texas)Cowboys win. Here's why: The Titans struggle to run the football, conventionally anyway, while their sacks-to-pass-attempts ratio is terrible. That alone makes this game in Dallas less than encouraging, matchup-wise. Tennessee averages a paltry 3.6 yards per rush on first down. (The Titans' rushing average on all downs is skewed by Marcus Mariota's 6 yards per run.) So if the running backs can't get by Dallas LBs Sean Lee, Leighton Vander Esch and Jaylon Smith, which is probable, it will be teeing-off time for the Cowboys' pass rush. Then again, Dak Prescott has done a poor job evading the rush, failing to routinely get the football out quickly himself. Like Mariota, he needs to use his legs more. These Titans come to town boasting a top-three defensive unit (by points allowed), despite receiving hardly any support from the offense for the balance of the season. The difference this Monday should come from Ezekiel Elliott, who ranks second in the league in rushing. That, in addition to the home crowd, will assist an already-superior defense.Follow Elliot Harrison on Twitter @HarrisonNFL.\nMore News >\nMore Videos >More Photos >More Gear >"}