{"id": "Amari Cooper already opening up Cowboys' offense", "paragraph": "  \nIt's a small sample size, but Amari Cooper's arrival has already helped open the Dallas Cowboys' offense. In his first two games, the former Raiders receiver leads the Cowboys in targets (18), receptions (11) and receiving yards (133) and is tied for the most receiving TDs (1). Ten of Cooper's 11 receptions have produced first downs -- already second on the team behind Cole Beasley's 23.  \"I expected to come in here and make plays to help this team win, definitely,\" Cooper said, via ESPN.com. \"And obviously they expected me to do the same being that they traded for me. \n\"Obviously we have some things to work on, me and Dak (Prescott). We've talked about it, but we're creating that chemistry. We're going to get better.\" Cooper's stats haven't blown anyone out of the water, but he's helped morph the Cowboys' offense into a watchable product. Since Cooper slid on a Cowboys helmet, the pieces on the Dallas offense have clicked into place much better.Cowboys receivers are generating more space in the two games with Cooper, per Next Gen Stats: Dallas avg. WR separation Weeks 1-8: 2.2 (Last in NFL) Dallas avg. WR separation Weeks 9-10: 3.0 (11th-highest) While 0.8 yards of separation more might not sound like a lot, it's helped keep Prescott out of pushing the ball into tight windows. Prescott's average target separation has gone from 2.9 to 4.0 yards, resulting in an increase in completion percentage from 62.1 to 70.1, according to Next Gen Stats. The Cooper Effect also benefits running back Ezekiel Elliott. The Cowboys have increased their 11 personnel (1 RB, 1 TE, 3 WR) usage by 18.0 percent since the Cooper trade (third largest increase in NFL). In Weeks 1-8 Dallas used three WRs on just 52.7 percent of snaps. The past two weeks that number jumped to 70.7. Elliott has had much more success running out of 11 personnel, thanks to the less loaded boxes. Per Next Gen Stats, Elliott faces stacked boxes (8-plus defenders) on just 2.6 percent of rushes in 11 personnel. All other groupings, Zeke sees stacked boxes 46.7 percent of the time.  \"When you add a guy like (Cooper) who can win one-on-one, doing different things, winning short, winning down the field, winning across the field, intermediate routes, it certainly helps you,\" coach Jason Garrett said. \"It gathers a little bit more attention from the defense and it opens up opportunities for other guys and it benefits you as well.\" The Cowboys have a long way to go to dig themselves out of the early-season hole in a winnable NFC East, but the early returns on the Cooper trade are positive, even if a first-round pick is still a steep price. .@dallascowboys @AmariCooper9 beat every CB the @eagles put on him. If you canâ\u0080\u0099t beat M2M coverage itâ\u0080\u0099s hard to make a living playing WR. #BaldysBreakdowns pic.twitter.com/kSyMA9DtLG\nMore Posts\nPhoto Essay\r\n"}