{"id": "Ben Roethlisberger, Mitch Trubisky among Players of the Week", "paragraph": "\nThe NFL Players of the Week from Week 10 of the 2018 NFL season include a sure-fire future Hall of Famer, an up-and-coming quarterback and a neck-rolled linebacker. AFC Offensive Player of the Week: QB Ben Roethlisberger, PittsburghBig Ben put up big numbers on a big stage. The Steelers quarterback had a perfect passer rating in Thursday night's pounding of the Panthers, throwing for 328 yards and five touchdowns. He became just the second player in NFL history to have at least 300 passing yards and five touchdowns with three or fewer incompletions in a game. This is the 17th time in his career and the second time this season that Big Ben has received Player of the Week honors. \nAFC Defensive Player of the Week: LB Wesley Woodyard, Tennessee In the Titans' upset victory over New England, Woodyard hits Tom Brady thrice and recorded 1.5 sacks in the middle of a Tennessee defense that allowed just 10 points. It was just the second time in the linebacker's career that he tallied more than one sack in a game. Woodyard is on pace for a career-high six sacks. This is the second time Woodyard has taken home Player of the Week honors (Week 8, 2012). AFC Special Teams Player of the Week: K Stephen Hauschka, Buffalo In his team's surprise blowout win over the Jets on Sunday, the Bills kicker made all seven of his kicks. Hauschka knocked in five extra points and two field goals, including a season-high 54-yarder. The 33-year-old veteran is in the middle of a career year and hasn't missed a field goal attempt since Week 1. This is his fourth such honor and his first since Week 4 of 2017.\nNFC Offensive Player of the Week: QB Mitchell Trubisky, Chicago Trubisky's Bears throttled the division-rival Lions thanks to the quarterback's season-best 76.7 completion percentage and 355 passing yards. Trubisky was responsible for four touchdowns, including three in the first half. This is the ascendant second-year stud's first Player of the Week honor and likely the first of many. NFC Defensive Player of the Week: LB Leighton Vander Esch, Dallas The Cowboys' first-round rookie linebacker was all over the field in Dallas' win over the rival Eagles. Vander Esch recorded his first interception and racked up a career-high 13 tackles, the last of which was a shoestring 5-yard loss that set Philly's comeback attempt back. This is the first honor Vander Esch has received in the pros.NFC Special Teams Player of the Week: P Tress Way, Washington Way proved instrumental in setting the Buccaneers back in Washington's 16-3 win over Tampa Bay on Sunday. The fifth-year punter booted five kicks for a net average of 47.8 yards per punt, downing four punts inside the Bucs' 20-yard line. This is Way's first Player of the Week honor. \nMore News >\nMore Videos >More Photos >More Gear >"}