{"id": "Raiders part ways with veteran DE Bruce Irvin", "paragraph": "  \nThe purge continues in Oakland. Nearly two weeks after trading Amari Cooper out of town and four days after the trade deadline passed, the Raiders are parting ways with yet another veteran figure. Oakland announced Saturday that it waived defensive end Bruce Irvin. The Athletic's Vic Tafur first reported the development. Irvin had one year remaining on a four-year contract signed with the organization in 2016, but Oakland owes him nothing after this season. \"Thank you for your part in my journey,\" Irvin said in a tweet Saturday. \"Specifically thank you to Owner Mark Davis, GM Reggie McKenzie, Coach Jon Gruden and the entire Raiders Organization. I will always cherish my experience with the Oakland Raiders. As the season change, so do our roles and I look forward to continuing my journey with the NFL!\"\nIrvin had seen his playing time decrease in recent weeks and saw little action in Oakland's blowout loss to the San Francisco 49ers on Thursday night. The 31-year-old defensive end played just nine defensive snaps and zero special teams snaps in the defeat.\"I know he's frustrated. I'm frustrated,\" Raiders coach Jon Gruden said of Irvin following the game. \"We'll try to solve that as soon as possible. He's a good player. He's a good player.\" Gruden added that Irvin's role was reduced because as an \"edge rusher,\" Irvin didn't fit in Oakland's base 4-3 defense. The pass rusher exits with three sacks, four QB hits and one forced fumble on the season. Irvin's unceremonious exit is the latest in a slew of much criticized transactions made by Gruden since he was handed a 10-year, $100 million contract in January. Gruden played hardball with All-Pro defensive end Khalil Mack and eventually shipped him to Chicago for two first-round picks. Gruden did the same thing with Cooper, who was traded to Dallas in late October for a first-round pick. Unlike those roster moves, the Raiders reap nothing from releasing Irvin, which comes just days after the trade deadline. NFL Network's Tom Pelissero reported Oakland was willing to take a late-round draft pick in exchange for Irvin, but the end's remaining $3.7 million salary proved to be a roadblock to acquiring that compensation. Given that, Pelissero reports Irvin is likely to clear waivers and become a free agent. Irvin could be a boon to a contender in need of pass-rushing help. Already one of his former teammates is on the lookout. ï¿½ï¿½\nMore Posts\nPhoto Essay\r\n"}