{"id": "Giants' Pat Shurmur defends failed two-point attempt", "paragraph": "  \nThere are plenty of opportunities to criticize New York Giants coach Pat Shurmur for Monday night's 23-20 loss to the Atlanta Falcons, from the early-game play-calling, to his red-zone offense unable to take advantage of a porous defense, to his clock management. The choice to go for two after pulling within eight points, however, was a move backed up by the math. \"I just felt like, we'd discussed internally the math on that,\" Shurmur said, via ESPN's Jordan Raanan. \"I felt like we had a good play, and I liked our two-point play selections, and we just didn't quite get it done.\" With the Giants trailing 20-6 with under five minutes remaining, Saquon Barkley scored a touchdown that pulled New York within 20-12. Shurmur then followed the math, going for two points that would have cut the lead to six points. The try failed. That doesn't mean the process was wrong. \"You increase your chances by 50 percent if you go for it and make it there, so that's what you do,\" Shurmur said. \"Because then if you score a touchdown, we just kick the extra point and win. I felt good about the two-point play. You guys saw that, I think we got the ball in there, right? And we just didn't connect on it.\" \nAs we saw with Doug Pederson earlier this month, analytics back up the decision to go for two early, if you're playing to win. Via ESPN's Seth Wilder, the basics of the situation are boiled down to: going for two gives a team a 46 percent chance to win the game; kicking the extra point gives a team a 91 percent chance to tie. Going for two while down eight is playing to win, not tie. The Falcons nailing a 56-yard field goal to go up 11 on the following drive made the decision irrelevant, but New York converting their second two-point try later to pull back within three points late showed the value of attempting the two-pointer early. The biggest critics of Shurmur's decision will point to his offense's ineptitude all night in the red zone, which tells them the coach should have known his two-point play-call would fail. If we're going to use that sort of reductive reasoning, why would the 1-6 Giants ever even take the field? The Giants' best player, Odell Beckham Jr., liked his coach's decision to go for two.  \"I like the call. I love being aggressive,\" Beckham said. \"I don't know if I could be a coach. I'm going for it on fourth. We're going for two. That's why I'm not a coach. I like the call. I'm always going to ride with him. I just wish I could have come up with it.\" As more and more coaches embrace analytical approaches that suggest sound aggressive decision-making, the conflict between old-school and new-school are sure to butt heads again soon. \nMore Posts\nPhoto Essay\r\n"}