{"id": "Rams acquire Jaguars pass rusher Dante Fowler", "paragraph": "  \nThe Los Angeles Rams have their pass rusher. L.A. acquired pass rusher Dante Fowler from the Jacksonville Jaguars in exchange for a 2019 third-round pick and a 2020 fifth-round pick, the Jags confirmed Tuesday. The Rams reportedly outbid the New York Jets and Green Bay Packers for Fowler's services just 30 minutes before Tuesday's trade deadline, NFL Network Insider Ian Rapoport added. The Jaguars were initially asking for at least a second-round pick and change for their former high selection.In a corresponding move, the Rams waived backup guard Jamon Brown.\nIn Fowler, the Rams' defense has its seventh former first-round pick. The 2016 third-overall pick joins Aaron Donald, Ndamukong Suh, Michael Brockers, Aqib Talib, Marcus Peters and Mark Barron on a Super Bowl-contending unit piloted by defensive coordinator Wade Phillips.Having solidified the interior of their defensive line in the offseason with Donald and Suh, the Rams had been searching for months for an edge rusher worthy of a title run. They may have found one in Fowler. It's unclear where Fowler fits in on the roster as of now. L.A. could slot him in for outside linebackers Samson Ebukam and Matt Longacre or defensive tackle Michael Brockers. It's an unceremonious departure from Duval for the former third-overall pick. Fowler couldn't find playing time on a stacked Jaguars defensive line in 2018. He played just 32.7 percent of Jacksonville's snaps through eight weeks, recording just eight tackles, two sacks and a forced fumble.Fowler has had discipline and injury issues. He missed his entire rookie season with a torn left ACL and began this year's training camp on the PUP list with a left shoulder injury. Fowler was suspended for the first game of the 2018 season for violating the NFL's Personal Conduct Policy and was banned for a week during the preseason for jawing with reporters.Fowler is in the final year of his rookie deal after the Jags neglected to pick up his fifth-year option. His stay with the Rams will act as an audition for future employment after the 2018 season. Helping L.A. stay undefeated and the defense get pressure on opposing quarterbacks will go a long way toward a pay day.ï¿½ï¿½ï¿½ï¿½â\u009c¨ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½\nMore Posts\nPhoto Essay\r\n"}