{"id": "Los Angeles Rams triumphantly pull together amid tragedy", "paragraph": "  \nLOS ANGELES -- Jared Goff was in hurry-up mode, exhibiting intense focus amid the surrounding chaos, when suddenly the third-year quarterback made a split-second decision that altered the trajectory of his evening.Driving through the windy, smoke-clogged streets of his neighborhood near the Los Angeles Rams' temporary training facility last Friday night, Goff spotted a large pile of branches engulfed in flames and stopped his car. Like many teammates and other members of the organization, Goff had evacuated his home late Thursday night as a pair of fires spread from the hills of Ventura County to the shores of Malibu, and he'd been hoping to retrieve some belongings before returning to the downtown L.A. hotel to which he'd temporarily relocated.When Goff and his close friend since childhood, Robbie Terheyden, got out to take a look at the mini-blaze, a pair of 14-year-old boys who were carrying buckets of water did double-takes. There was Goff, one of the NFL's hottest quarterbacks, ready to lend a hand as a voluntary first responder.And as if the scene that took place just outside the entrance of the Kardashian Estate, one of reality television's most famous residences, wasn't surreal enough: Watching from the back seat was Goff's proud father, Jerry, who has spent the past 20 years as a firefighter for a Northern California town just south of San Francisco. As Jared would explain Sunday evening, \"Realistically, the area around (the branches) was burned out, and there was a very small chance it could spread to the big tree that was right near it. He knew that, so he let us handle it. I realized we were probably being overly cautious. But I don't finish till the work's done.\" \nOn Sunday at the L.A. Coliseum, Goff and the Rams (9-1) got the job done against a persistent division rival, holding on for a 36-31 victory over the Seattle Seahawks. And following his latest stellar passing performance in a season full of them, Goff had no desire to over-dramatize his brush with public safety. After all, the region -- and particularly the area near the Rams' headquarters -- was reeling from a jarring week that included a mass shooting in a Thousand Oaks bar Wednesday night that left 13 dead and the massive wreckage caused by the still-uncontained wildfires.The quarterback did, however, concede that he, his teammates and virtually everyone else associated with one of the NFL's best teams had been shaken by the events, and that made Sunday's tensely contested triumph over an NFC West rival feel like a significant accomplishment.\"Being able to do what we did today felt really good, especially under the circumstances,\" Goff told NFL.com after the game. \"With all the fires and the madness, and the horrible shooting that happened right by our facility the day before, there's a lot of stuff going on. We want to be a group that can provide regularity, a safe haven and joy, even if it's just for a few hours. It's nice that we could do that today.\"Coming off their first setback of the season, a 45-35 defeat to the New Orleans Saints the previous Sunday, the Rams had an emotional bounce-back week that left them feeling fortified and bonded. As they looked ahead toward next Monday night's showdown in Mexico City with the 9-1 Kansas City Chiefs, which will be preceded by a week's worth of practices in Colorado Springs to allow them to acclimate to the altitude, Goff and his teammates gave high marks to the franchise's collective handling of a disruptive and disarming stretch.\"It was a week for the ages,\" Rams cornerback Marcus Peters said. \"I was in my house Thursday night and saw the fire coming, scared as a mother------, and I got the hell out without even grabbing any stuff. And there were a lot of us who did that. But you know what? The organization took care of us, made sure we had nothing to worry about, and that allowed us to play ball and not stress about that other stuff. And you saw how we reacted -- we didn't even practice Friday, and we came out here and handled our business like professionals.\"\nAdded veteran left tackle Andrew Whitworth, who donated his entire game check -- which totaled approximately $60,000 -- to support relief and recovery efforts for the families of the 12 victims of Wednesday's Borderline Bar and Grill shooting in Thousand Oaks: \"From the top down, this organization was incredible. The majority of guys were uprooted out of their homes on very short notice between 2 and 3 a.m. [early Friday morning], and we were basically told, 'Relax. Don't worry about it. Get yourselves and your families safe, and we'll take care of the rest.' That created a mindset where guys thought, We don't have to worry about ourselves. Just get ready to play and think about how we can help the community.\"The drama early Friday morning included lots of action on a group text compromised of the Rams' coaching staff, with defensive coordinator Wade Phillips sending a 1 a.m. message that he was being evacuated from his home. By the time Sean McVay woke up for work at 4 a.m. Friday, several of his assistants had sent similar texts, and the second-year head coach made a quick decision. \"Sean was amazing,\" assistant head coach/linebackers coach Joe Barry noted. \"He immediately canceled practice Friday and basically said, \"This is more important. Everyone take care of your families, and do whatever you have to do.' \"Later on Friday, an email went out to everyone in the Rams' organization from owner Stan Kroenke, who essentially told his employees to do whatever it took to take care of their families, with a promise that reimbursements would be forthcoming.\"You want to have people know they have some stability for their family -- that the kids are safe, the dogs are safe and all the important things are in place,\" Kroenke said after the game. \"We tried to do the best job we could with it under the circumstances, and everybody responded well. For the players to be able to focus the way they did today, that said a lot.\"The Seahawks (4-5), who narrowly lost to the Rams in Seattle in early October, wasted no time triggering plenty of tension for their hosts and the 72,755 fans at the Coliseum. Fueled by a power-rushing attack that ground out 273 yards (including 92 by ever-dangerous quarterback Russell Wilson), Seattle took leads of 7-0 and 14-7 in the first half and went ahead 21-20 with 4:20 left in the third quarter on Wilson's 23-yard scoring pass to receiver Tyler Lockett.In the end, Goff (28 for 39, 318 yards, two touchdowns, no interceptions) and star halfback Todd Gurley (16 carries, 120 yards, one TD; three catches, 40 yards) gave the Rams enough offensive punch to prevail -- though they lost wide receiver Cooper Kupp to what appeared to be a serious left knee injury -- while All-Universe defensive tackle Aaron Donald (2.5 sacks, five quarterback hurries, one game wrecked) and his fellow defenders held Wilson 35 yards short of a last-minute comeback victory.\n\"For us to stick together and pull this one out,\" Donald said, \"it meant a lot.\"For Goff, who can now look forward to an exciting Monday night duel with his Chiefs counterpart, second-year sensation Patrick Mahomes, there would be no postgame celebration.\"I've slept in three different places the last three nights, and (Monday) we're going to Colorado,\" Goff said before hitting the showers. \"I'd like to grab a few belongings if I can, and I hope I can make it home right now.\"About 20 minutes later, Goff left the Coliseum, hit the freeway and headed for his house. This time, he didn't see anything burning on the drive -- but, once again, he was forced to call an audible.\"Can't go home,\" he said later, via text. \"Too smoky.\"As he went to sleep in his hotel room Sunday night, one thing was abundantly clear: Even in times of stress, these Rams won't be derailed.Follow Michael Silver on Twitter @mikesilver.\nMore News >\n\nMore News >\nMore Los Angeles Rams Videos >More Los Angeles Rams Photos >"}