{"id": "Injury report: Giovani Bernard set to play vs. Saints", "paragraph": "  \nCincinnati Bengals running back Giovani Bernard will play Sunday against the New Orleans Saints. Bernard had missed the last month with an MCL sprain before being listed as active for Sunday.In four games this season, Bernard has 155 yards rushing on 34 attempts and three touchdowns.In other Bengals injury news, wide receiver A.J. Green is expected to miss next week's game against the Baltimore Ravens because of a toe injury that his kept him out the last two weeks, Rapoport reported.Other injuries we are keeping an eye on Sunday, per Rapoport:1. Philadelphia Eagles running back Darren Sproles, who injured his hamstring last week in practice just as he was set to return, is expected to miss multiple weeks with this latest injury. One estimate pegged his return at 3-4 weeks.2. Cleveland Browns tight end David Njoku, dealing with knee and rib injuries, will play against the Atlanta Falcons. Cornerback Denzel Ward (hip) also is active for the game.3. The Pittsburgh Steelers are optimistic running back James Conner will clear concussion protocol ahead of their next game against the Jacksonville Jaguars on Nov. 18. Conner suffered the injury in Thursday's win over the Carolina Panthers.4. Baltimore Ravens quarterback Joe Flacco's hip injury puts his status for Week 11 into question. The team will monitor how he does in practice this week. 5. Detroit Lions running back Kerryon Johnson, battling an ankle injury, will play against the Bears.6. Indiananapolis Colts wide receiver Ryan Grant (ankle) will play against the Jaguars.7. Kansas City Chiefs wide receiver Sammy Watkins (foot) will not play against the Cardinals. It's mostly a precaution, and Watkins should be fine next week. Linebacker Justin Houston (hamstring) returns from a hamstring injury.8. Miami Dolphins wide receiver Jakeem Grant, who has dealt with an Achilles injury the last few weeks and is listed as questionable, should play today.9. The New England Patriots will have running back Sony Michel (knee) back in the lineup Sunday. Michel had missed the last two games. As anticipated,  Rob Gronkowski (ankle/back) will not play.10. Jacksonville Jaguars running back Leonard Fournette (hamstring) is active to play against the Colts.\nMore Posts\nPhoto Essay\r\n"}