{"id": "Browns GM: Gregg Williams a candidate for head coach", "paragraph": "  \nCleveland Browns general manager John Dorsey is keeping options open in his search for a head coach. And the list includes Browns interim head coach Gregg Williams, who took over after the firing of Hue Jackson on Oct. 29. \"I think he deserves that,\" Dorsey told reporters Wednesday regaring Williams being a candidate. Whether Williams, who has gone 1-1 in his current post, warrants serious consideration remains to be seen. And Dorsey declined to comment on if the search would extend into the college coaching ranks, where Oklahoma coach Lincoln Riley has been linked to the Browns.Still, it wouldn't surprise if Dorsey tapped into two organizations he knows very well to find his next head coach. Dorsey spent a lot of years with the Green Bay Packers as a player (1984-89) and in various positions in player personnel (1991-2012). Upon taking over in Cleveland, Dorsey made notable hires from the Packers in Eliot Wolf and Alonzo Highsmith, both of whom spent time with Dorsey in the Packers' personnel department. Wolf currently holds a position with the Browns as assistant general manager, while Highsmith serves as the vice president of player personnel. The current Browns general manager also has ties to the Kansas City Chiefs, where he spent four seasons as general manager (2013-16). Dorsey's knowledge of the Chiefs likely contributed to the recent waiver claim of cornerback Phillip Gaines, who Dorsey drafted in 2014 while in Kansas City. Meanwhile, Dorsey told reporters the Browns' head coaching job is attractive, and he's not wrong. Whoever is ultimately chosen will take over a team with a good foundation on both sides of the football, especially when considering the Browns used the No. 1 overall pick in 2018 to secure a franchise quarterback in Baker Mayfield. The Browns also have defensive end Myles Garrett and cornerback Denzel Ward to build around. \nMore Posts\nPhoto Essay\r\n"}