{"id": "\n        Start 'Em, Sit 'Em Week 8: Running backs\n      ", "paragraph": "Start 'Em & Sit 'Em is the ultimate weekly look at NFL matchups and how they'll affect your fantasy football team. Fantasy superstars such as Todd Gurley and Antonio Brown will not be featured. All player matchups are based on PPR scoring system. NFL researchers Matt Frederick and Michael Florio have contributed to the column. For your final starting lineup decisions, check our weekly fantasy football lineup rankings.Byes: Atlanta Falcons, Dallas Cowboys, Los Angeles Chargers, Tennessee TitansThe Patriots are short on running backs, making White a virtual must-start against Buffalo. The veteran has been a stud for fantasy owners so far this season, scoring 23-plus points in three of his last four games. He should see a healthy workload against a Bills defense that just made Marlon Mack look like Edgerrin James last weekend.Mixon's 8.1-point stinker last week had more to do with game script than his actual performance, so leave that contest behind and start him in what is a get-right game against the Buccaneers. Their defense has allowed an average of more than 32 PPR points per game to enemy running backs on the road so far this season.Lindsay has become what a lot of fantasy analysts (including this one) thought Royce Freeman would become ... a reliable running back. Coming off a 90-yard, one-touchdown performance against the Cardinals, he should remain in lineups against the Chiefs. Lindsay beat them for 79 yards, one touchdown and 15.9 points in Week 4.Carson, fresh off a bye week, should be considered a solid flex starter ahead of this week's game in Detroit. The Lions have been gashed by running backs all season long, allowing over six yards per rush and the sixth-most PPR points per game to the position. Look for Carson to push for his third 100-rushing yard performance of the season.Mack went off and had a career game in last week's win over the Bills, and his snaps and usage totals will make it easier to trust him ahead of a favorable matchup in Oakland. Their defense has surrendered almost six yards per rush and the third-most PPR points to running backs on their home field, so consider Mack a flex starter.Start 'Em: David Johnson vs. San Francisco 49ers, Kerryon Johnson vs. Seattle Seahawks Sleepers: Raheem Mostert at Arizona Cardinals, Jalen Richard vs. Indianapolis ColtsHyde is slated to make his Jaguars debut this week in London, but is he a safe start against the Eagles? The veteran is likely to share the workload with T.J. Yeldon, and a matchup against the Eagles is a tough one. Their defense has allowed just 3.9 rushing yards per attempt and the ninth-fewest PPR points to opposing running backs. Chubb is coming off a solid 14-point performance in a loss to the Buccaneers, and his touch share in the Browns backfield will make it tough to bench him in most leagues. With that said, keep in mind that runners have averaged a mere 3.6 yards per rush and the second-fewest PPR points when facing the Steelers tough run defense.Listed as a sit 'em last week, Collins put up a 7.8-point stinker in a loss to the Saints. I'd beware him this week once again, as he faces a Panthers defense that's allowed just two rushing touchdowns and the seventh-fewest PPR points (19.1 PPG) to enemy running backs this season. Unless you're desperate for a flex, I'd bench Collins. Aside from his 30.1-point performance against the Broncos in Week 5, Crowell has been a non-factor for most of the last month. That trend is likely to continue against the Bears, who have surrendered just 3.4 yards per rush attempt and an average of 18.5 PPR points per game to enemy running backs. I'd keep the Crow on the sidelines.Clement was a hot add off the waiver wire a few weeks ago, but his production has been uneven as he continues to share the backfield work with Wendell Smallwood. He's a tough sell for me against the Jaguars, who have surrendered an average of just 3.8 yards per rush and fewer than 20 PPR points per game to opposing running backs.Sit 'Em: Aaron Jones at Los Angeles Rams, Latavius Murray vs. New Orleans Saints Busts: LeSean McCoy vs. New England Patriots (Mon.), Adrian Peterson at New York GiantsMichael Fabiano is an award-winning fantasy football analyst on NFL.com and NFL Network and a member of the Fantasy Sports Writers Association (FSWA) Hall of Fame. You can follow Michael on Twitter, Facebook, YouTube and Instagram for all of the latest fantasy football news, notes and in-depth analysis!"}