{"id": "Trade! Browns send Carlos Hyde to Jaguars for pick", "paragraph": "  \nCleveland Browns general manager John Dorsey showed throughout the offseason a willingness to make trades. So, it comes as no surprise Dorsey put on his wheeling-and-dealing hat once again ahead of the Oct. 30 trade deadline. The Browns traded running back Carlos Hyde to the Jacksonville Jaguars in exchange for a 2019 fifth-round pick on Friday, both teams announced. ESPN first reported the trade.We've traded RB Carlos Hyde to the Jacksonville JaguarsDetails » https://t.co/UdIhV62vZB pic.twitter.com/ayVJNkKXKnTo make room for Hyde, Jacksonville placed rookie offensive lineman Will Richardson on injured reserve.Hyde originally joined the Browns during the offseason on a three-year deal worth up to $15 million after spending four seasons with the San Francisco 49ers. Meanwhile, the trade impacts the backfield of both teams. For Jacksonville, the arrival of Hyde provides an immediate boost to a Jaguars running game that has been without second-year pro Leonard Fournette since Week 4. \nThe Jaguars' decision to trade for Hyde stemmed from increasing frustration inside the building -- particularly among the coaching staff -- over Fournette's continued absence, NFL Network's Michael Silver reported. Fournette, who will not play Sunday against the Houston Texans, has been dealing with a hamstring injury and played in just two games this season. Silver reported that, in response to the Jaguars' offer on Thursday, Cleveland broached trading for a receiver, but Jacksonville, being thin at the position, was unwilling to part with any of their wideouts.Before the trade, Hyde led the Browns in rushing with 382 yards and five touchdowns on 114 carries, adding 29 yards receiving on six catches. He joins a Jacksonville backfield currently held down by T.J. Yeldon, David Williams and Jamaal Charles, who signed a free-agent deal in Week 6. As for Cleveland, the Browns now have every opportunity to work in rookie Nick Chubb, the team's second-round pick, in the offense with Duke Johnson Sr. Despite limited playing time, the explosive Chubb ranked second on the team in rushing with 173 yards and two touchdowns on 16 carries, averaging a healthy 10.8 yards per carry on just 33 offensive snaps. The Browns' backfield now consists of Johnson, Chubb and rookie Dontrell Hilliard. \nMore Posts\nPhoto Essay\r\n"}