{"id": "NFL Week 7 game picks: Chiefs over Bengals; Saints top Ravens", "paragraph": "\nThe bye weeks are fully upon us, with even more teams off this week than before ...... but that doesn't mean the NFL schedule doesn't carry some sneaky-good games, especially on the intra-divisional front.Start with Texans at Jaguars, a divisional showdown in a division that is anyone's ballgame right now. It's a three-way tie in the AFC South, with all the leaders knotted up -- appropriately -- at 3-3. Whoever loses the Houston-Jacksonville matchup will have two divisional losses, while Tennessee is 2-0 in the South. The 49ers might not be catching the Rams in the NFC West, but don't forget how tough San Francisco played Los Angeles at Levi's Stadium last year. (Who could forget that Thursday night track meet?) Perhaps the biggest divisional bout takes place near D.C., as the Cowboys visit the rival Redskins one week after Dallas' eye-opening beatdown of the Jags. Are these 'Boys for real? That game is for first place (or at least a share of first place) in the NFC East.They all count. Even in October. Now, you folks had some thoughts on this week's Power Rankings ...@HarrisonNFL brother, my skins at 16 and dallas at 14. u counting that game against jax arenâ\u0080\u0099t u lol. just wait. sunday Iâ\u0080\u0099m hoping the skins keep their W streak going! i forgive u man, your hair is WAY better than mine. great work dude ???? #HTTRCanadians are always polite, even when they criticize you.@HarrisonNFL your power rankings are ??????.. the @Redskins at no. 16 and 3rd best in the division according to your rankings, and they lead the division.. what will it take for my boys to get yâ\u0080\u0099all analyst respect?? I guess beat the @dallascowboys huh..Thanks for the thoughts, Will. This is definitely a regular Power Rankings tweet.As for the rest of the NFC East, the Eagles host the Panthers while the reeling Giants try to right the ship against the Falcons on \"Monday Night Football.\" You'll find picks for those games -- and the rest of the Week 7 slate -- below. Your take on any is welcome: @HarrisonNFL is the place.Elliot Harrison went 12-3 on his predictions for Week 6, bringing his record for the season to 60-31-2. How will he fare in Week 7? His picks are below.Los Angeles Chargers 26, Tennessee Titans 149:30 a.m. ET (CBS) | Wembley Stadium (London, England)The Chargers built a passing offense for the ages under Sid Gillman in the old AFL days, even winning a championship with it in 1963. Don Coryell built on it, creating an offensive system that still has tentacles in today's game. The Titans set all that progress back 80 years against the Ravens last Sunday. You can blame Marcus Mariota's elbow or offensive coordinator Matt LaFleur's \"scheme.\" I think allowing five sacks in the first 17 plays might have been a wee bit of a factor. These Bolts don't boast the same pass rush as Baltimore, so that's bright news for Tennessee fans. Unfortunately, Philip Rivers will take advantage of a tired Titans defense that will grow weary of watching its offense punt at Wembley.Jacksonville Jaguars 21, Houston Texans 131 p.m. ET (CBS) | TIAA Bank Field (Jacksonville, Fla.)\nKjjkjhmmnnmmm. Those are the buttons I hit on my keyboard whilst attempting to write something -- anything -- glowing about the Jags' offense. Taking Jacksonville at home in what turns out to be an uber-important matchup in the AFC South, if only because the Jaguars' defense was embarrassed in Dallas. Houston coach Bill O'Brien could plagiarize the Cowboys' game script, utilizing Deshaun Watson's athletic ability a week after the Cowboys (finally) called on Dak Prescott's. The problem: Watson appears all sorts of banged up. He might be mummified by season's end. Speaking of, did anyone see \"The Mummy,\" the newer one, with Tom Cruise? Is it worth two hours? Or is it at least better than watching Blake Bortles chuck it around the yard? (@HarrisonNFL) The Jags must produce some semblance of balance. On that note ... rooting for Jamaal Charles.Philadelphia Eagles 27, Carolina Panthers 201 p.m. ET (FOX) | Lincoln Financial Field (Philadelphia)Going with the Eagles at home in what could be an impactful game come tiebreaker time in late December. If the Panthers are to avoid falling to an NFC East team for the second week in a row (it would be a third, if not for Graham Gano's quads), getting back to Norv Turner basics is the ticket. Namely, Carolina must help Christian McCaffrey create, especially in the running game. The beauty of employing Cam Newton is deploying the mammoth quarterback on the ground, including play fakes. It forces the defense to play 11-on-11, unlike, say, Saquon Barkley with Eli Manning. Carolina only rushed for 81 yards against the Redskins, while McCaffrey posted a lowly 20 yards on eight carries. Keep (start?) pounding, Panthers. Otherwise, the Eagles have both the offensive (especially passing) and home-field advantage.Minnesota Vikings 27, New York Jets 161 p.m. ET (FOX) | MetLife Stadium (East Rutherford, N.J.)How healthy are the Jets' defensive backs? I ask only because Adam Thielen and Stefon Diggs are not going to drop passes with the proficiency of the Colts last week. Remember, Diggs' hands stick to everything. Doubt Latavius Murray will follow in the footsteps of Indy RB Marlon Mack, who delivered a perfect beach volleyball set to New York CB Morris Claiborne for a quick-six. The litmus test in this contest for Gang Green will be if Sam Darnold is forced to try to keep pace with Kirk Cousins; that is, if the game flows toward a flurry of points. When New York has won, it's been the result of mixing a dash of Darnold with several cups of the running game. The Jets are averaging two bills per game on the ground in their wins. Darnold is also getting over 9 yards per throw in those three victories.New England Patriots 26, Chicago Bears 221 p.m. ET (CBS) | Soldier Field (Chicago)Love this matchup. You know the Bears are Ditka-level pissed off over how last week's loss to Miami went down, a glacially-paced disaster if there ever was one. (It was kind of like climate change, though some folks choose to deny that. Not as easy to ignore NFL standings.) Chicago will attempt to tee off on Tom Brady, which is compelling because A) he will most certainly get the ball out quickly in the early goings and b) the Patriots have stunk on the road in two outings, getting manhandled in both Jacksonville and Detroit. The issue for Chicago is whether Mitch Trubisky and the offense can move the ball early. Still waiting for that 125-yard Jordan Howard game. Season high: 82 yards, Week 1.Indianapolis Colts 23, Buffalo Bills 131 p.m. ET (CBS) | Lucas Oil Stadium (Indianapolis)Bad news for fans of interceptions: The Bills are starting Derek Anderson in place of Nathan Peterman, a true master of the art who introduced the across-the-body late throw over the middle to his repertoire last week. There is still hope for some pick-related fireworks, however; Colts receivers react like Andrew Luck is delivering changeups ... or at least, their hands do. Still, look for Indy to prevail. Luck's mobility and pocket awareness will be the key factor against a frenetic Bills pass rush. The Colts have lost all but one of their games, yet they've been at their opponent's doorstep in the fourth quarter every time out. The Bills simply won't feature enough offense to do the same, even with the presumably steadier hand of Anderson at the till. The 35-year-old hasn't posted a passer rating of 90 or better in a start since December of 2014. Tampa Bay Buccaneers 28, Cleveland Browns 171 p.m. ET (FOX) | Raymond James Stadium (Tampa, Fla.)\nNFL uni matchups don't get much uglier than this. Aesthetically speaking, only Jaguars at Panthers could be much worse than this brown/crimsony monstrosity. The quarterback play could fare similarly, depending on which Baker Mayfield and which Jameis Winston show up. Winston started feeling it during that second half in Atlanta, but he'll find this Browns defense is much more talented than the depleted Falcons unit he saw last week. Cleveland must do a better job supporting Mayfield. The rookie has been sacked 10 times in the last two games, while Carlos Hyde couldn't produce diddly poo on the ground. The Browns' O-line play will be the great elixir -- or the nixer -- for their chances in Tampa.Detroit Lions 25, Miami Dolphins 211 p.m. ET (FOX) | Hard Rock Stadium (Miami Gardens, Fla.)When Adam Gase starts angrily citing HIPAA laws, you know things have gone south with his quarterback. Gase's prospective task now is to keep winning with Brock Osweiler under center. The Dolphins might not be a strong team, but they are 4-2 and hanging with the Chargers and Ravens in the early wild-card race. Detroit is trying to do the same in the NFC, but must steal this interconference deal on the road. With three other potential playoff teams in their division, the Lions can't lose to a career backup. Their remaining schedule is too unforgiving to drop this one in Miami. This matchup always reminds me of a sweet Sunday nighter from the Mike Patrick ESPN days, when another backup quarterback in Dave Krieg helped Detroit get hot late in the 1994 season, winning five out of six games before stumbling to Dan Marino and the Fins in Week 17. Still made the playoffs, though. #WayneFontesNew Orleans Saints 24, Baltimore Ravens 204:05 p.m. ET (FOX) | M&T Bank Stadium (Baltimore)Fantastic matchup in Baltimore, with Drew Brees and the Saints' scary passing offense facing the most prolific pass rush in football. Perhaps the coolest aspect of the Ravens' sackapalooza last week in Nashville was that 10 of the 11 sacks came on blitzes. Only three other teams (Green Bay, Arizona and Dallas) have compiled 10-plus sacks on blitzes all season. Marcus Mariota drowned in the pocket before ever identifying where those guys were coming from, or who dunked him. That level of confusion won't be as easy to manufacture against Brees. Sean Payton definitely has his work cut out for him, yet an oversimplified solution would be to use his running backs -- particularly Alvin Kamara -- more than normal. Move those LBs out of the gaps and force them to play in space. Establishing Mark Ingram on the ground early will also force the pass rushers to hesitate.Dallas Cowboys 24, Washington Redskins 214:25 p.m. ET (CBS) | FedExField (Landover, Md.)Perhaps the most compelling game of the week, if only to discover what these teams are. Will we see Dak Prescott take off more, forcing the Redskins to adjust and shortchanging that Ryan Kerrigan-fueled pass rush? Can the Cowboys stifle what has mostly been a lackluster Redskins offense? Where is the Alex Smith from 2017? You know -- the guy who eschewed his career narrative by suddenly throwing deep more successfully than any QB in the NFL. Last week, he failed to average even 5 yards per throw. [Enter upside-down emoji here.] Unless Adrian Peterson really softens up that Dallas front, the Cowboys' defense rules the day.Los Angeles Rams 46, San Francisco 49ers 364:25 p.m. ET (CBS) | Levi's Stadium (Santa Clara, Calif.)This series has a wonderful legacy ... The record for the highest attendance ever for an NFL regular-season game (in the U.S.) was a meeting in 1957 between these franchises (which I still think is legit ... Giants-Cowboys in 2009 has the \"official\" record, but they packed Jerry World with about 30,000 standing-room-only fans that day in a Brett-Favre-sliding-into-Michael-Strahan's-feet-to-give-him-a-record kind of way). How about John Taylor's two 90-yard touchdowns on \"Monday Night Football\" in 1989? Then there was last year's barnburner on Thursday night. Everyone with a football opinion thinks the Rams will win this week, but let's dive into some numbers pertaining to what the 49ers are doing well: They are third in the NFL in rushing at a whopping 142.5 yards per game. Also, 16.2 percent of their runs are going for 10-plus yards. That is high. In the passing game, C.J. Beathard's receivers are getting a ton done on their own, with 891 yards after the catch (seventh in the NFL). Offensively, the Niners can stay with L.A. if they get off to a fast start. Now that we've been glowing in appraisal, San Francisco will lose. The Niners give up too many big plays, and guess who leads the league in big plays? In fact, the Rams average almost 100 yards per game more than the league mean. They're mean.Kansas City Chiefs 36, Cincinnati Bengals 288:20 p.m. ET (NBC) | Arrowhead Stadium (Kansas City, Mo.)\nAll I can hear while typing this out is \"Sunnnnnday niiiight!\" in Carrie Underwood voice. Then Cris Collinsworth waxing poetic about it. Ugh. Speaking of, not sure how many fans realize what a fantastic player Collinsworth was. We're talking about a receiver with four 1,000-yard seasons -- and what could have been two more, if not for a pair of strike-shortened campaigns. He and Eddie Brown, along with running back James Brooks, were hell on wheels for defenses. Kind of like what the Bengals boast now, with the breakout of Tyler Boyd, progression of Joe Mixon and, of course, A.J. Green. Can they score the requisite 30-plus points they'll need to potentially take a road game from this potent Chiefs bunch? While Cincy's defense is full of talented players, the unit's performance has been a conundrum: The Bengals allowed 481 yards last Sunday and are giving up 26.3 points per game. Good luck slowing down Kansas City's rubber-armed QB.Atlanta Falcons 27, New York Giants 248:15 p.m. ET (ESPN) | Mercedes-Benz Stadium (Atlanta)\"No offense ... versus no defense ... it's Monday Night Football!\" I have the 1983 edition of Giants at Falcons on DVD in my vault. With Scott Brunner at quarterback (Phil Simms was always injured in those days) and Butch Woolfolk at running back, Big Blue had big problems on offense. Atlanta's offense was dynamic. Steve Bartkowski led the NFL in passer rating that season, with two solid running backs at his disposal in William Andrews and Gerald Riggs. Unfortunately, the Falcons couldn't stop anyone that season. (Does ... any ... of ... this ... sound familiar?) Usually, bad defense trumps bad offense, i.e., loses games. Looking at this upcoming \"Monday Night Football\" affair, however, the mental state of the Giants seems downtrodden (at best), resigned (at worst) -- at least from the outside looking in. Dan Quinn's relentlessly positive outlook -- and the Falcons being at home -- delivers a win.Arizona Cardinals 20, Denver Broncos 168:20 p.m. ET (FOX/NFL Network/Prime Video) | State Farm Stadium (Glendale, Ariz.)Royce Freeman ... come in, Royce Freeman ... this is Earth ... can you hear us? If so, please report to the front desk to pick up your run blocking and quick change of direction. The Broncos' ground attack has been absent the last two games, and oh has it hurt Vance Joseph's team. Denver should be able to pound the rock against the Cardinals, who just made Latavius Murray look like Terrell Davis. But if Case Keenum receives no run support, Arizona will give him fits. Despite the Cardinals' difficulty stopping the run, their defense is better than its billing (or lack thereof). In fact, I like that group at home. Arizona picks up its second win, unless the new No. 30 in orange goes off. Looking forward to: Josh Rosen versus the Broncos' secondary. Follow Elliot Harrison on Twitter @HarrisonNFL.\nMore News >\nMore Videos >More Photos >More Gear >"}