{"id": "Injuries: Davenport expected to miss about a month", "paragraph": "  The New Orleans Saints suddenly have concerns on the defensive line ahead of Sunday's showdown against the Los Angeles Rams. Rookie defensive end Marcus Davenport is expected to miss about a month with a toe inury, sources told NFL Network Insider Ian Rapoport. After that, they'll judge how it has responded, Rapoport added.\"Davenport would not confirm timeline to me but his right foot is in a boot,\" NFL Network's Jane Slater reported from practice Wednesday. \"He tells me his big toe is banged up and is still seeking opinions on it. He was able to ride the bike today and did finish the Vikings game with it by 'playing differently.'\"Davenport and fellow lineman tell me the big toe is a big deal though because you need to push off it to win battles at the line.\" Davenport's absence will provide a blow to a Saints' pass rush preparing to square off against one of the NFL's top offenses. With four sacks on the season, Davenport has come on in recent weeks as part of a defensive end rotation.Missing Davenport for the next month certainly stings, but the Saints' depth is covered with Alex Okafor, who often rotated with Davenport at right defensive end opposite of Cameron Jordan. The Saints could also lean on second-year defensive end Trey Hendrickson, who hasn't played since the season opener, or defensive tackle David Onyemata, who sometimes lined up at defensive end in 2017.In other Saints injury news, offensive tackle Terron Armstead (knee), wide receiver Michael Thomas (shoulder), center Max Unger (eblow) and wide receiver Cam Meredith (knee) were limited during Wednesday's practice.Here are the other injuries we're monitoring Wednesday:1. The Washington Redskins are optimistic left tackle Trent Williams, who dislocated his thumb vs. the Giants, will play Sunday against the Atlanta Falcons, a source told NFL Network Insider Ian Rapoport.2. Buffalo Bills coach Sean McDermott said if quarterback Derek Anderson is still in the concussion protocol at the end of the week, Nathan Peterman would start and Matt Barkley would be backup. Anderson did not practice Wednesday.3. Carolina Panthers quarterback Cam Newton (shoulder) and tight end Greg Olsen (foot) were both limited in practice. Wide receiver Torrey Smith (knee) did not practice.4. Miami Dolphins quarterback Ryan Tannehill (shoulder) went through drills at practice but did not throw any passes, according to the Miami Herald. Coach Adam Gase ruled him out for Sunday vs. the New York Jets.5. Kansas City Chiefs linebacker Justin Houston did not practice today. He missed the last three games with a hamstring injury. In addition, wide receiver Tyreek Hill (groin) practiced fully.6. Bears linebacker Khalil Mack (ankle) and wideout Allen Robinson (groin) did not participate at practice. 7. Philadelphia Eagles starting cornerback Jalen Mills is dealing with a foot sprain, an injury he suffered in London, sources told Rapoport. He's considered week-to-week.8. New York Jets wide receiver Quincy Enunwa (ankle) sat out practice.9. Vikings wideout Stefon Diggs (rib) and linebacker Anthony Barr (hamstring) did not participate at practice. Running back Dalvin Cook (hamstring), cornerback Xavier Rhodes (foot), and tackle Linval Joseph (ankle/knee) were all limited.10. Patriots wideout Julian Edelman (ankle/illness) did not practice. Tight end Rob Gronkowski (ankle/back) and wideout Josh Gordon (hamstring) were both limited. 11. Niners linebacker Reuben Foster (hamstring), safety Jaquiski Tartt (shoulder), and safety Antone Exum (concussion) will not play Thursday night against the Raiders. Quarterback C.J. Beathard (wrist), running back Matt Breida (ankle), wideout Pierre Garcon (shoulder, knee) and cornerback Richard Sherman (calf, heel) are all questionable.12. Raiders tackle T.J. Clemmings (knee) will not play Thursday night against the 49ers. Guard Kelechi Osemele (knee) and cornerbacks Daryl Worley (shoulder) and Gareon Conley (foot) are all questionable.\nMore Posts\nPhoto Essay\r\n"}