{"id": "NFL Films’ W.I.N. Affinity Group Attends Pennsylvania Conference for Women", "paragraph": "Posted: October 19th, 2018By Kendal Feider\nFootage Research & Acquisition Coordinator, NFL FilmsLast week, 10,000 women and men attended the Pennsylvania Conference for Women at the Philadelphia Convention Center on Friday, October 12, 2018. High school students contemplating their careers to senior level business executives across various industries and professions, attended. The event was brimming with unity, collaboration, support and inspiration.The conference presented insights from countless speakers on topics ranging from leadership, career transitions, and finances, to branding, time management, and living fearlessly. Keynote speakers such as Amal Clooney, Serena Williams, Maysoon Zayid, and Amanda Southworth delivered messages of optimism despite the adversity they have experienced, witnessed, and heard.Along with the speakers and exhibitors, the conference offered small business and tech roundtables, health and wellness workshops, a women-owned business marketplace, and career coaching.What does it feel like to be surrounded by thousands of others cheering for equality? I’d liken it to fans of any cause. A thunderous cry created by countless individuals’ produces impact. Impact on the other team that can leave lasting effects.Generating ripples of impact is certainly a part of the game plan for those who attended the conference.Among the attendees, 18 women from NFL Films attended the conference through the NFL’s W.I.N. (Women’s Interactive Network) Affinity Group in efforts to expand professional and personal development.On the importance of W.I.N.’s participation in the event, Video Editor, Heidi Bahnck said, “it is a great way for women from different parts of NFL Films to share an experience and broaden our horizons together.”Explaining why conferences are a beneficial resource for employees, Bahnck relayed, “conferences get us out of our immediate work environments and expose us to different ideas and opinions.”The Pennsylvania Conference for Women was my first conference as an attendee and first time experiencing that type of event alongside colleagues. There is something to be said for being given opportunities to continually work towards being your best self in both work and life. To get that chance from my employer and alongside women I admire, is an investment I am very grateful for.Careers can be both exciting and challenging, taking on different forms at different stages of our lives. Because of career unpredictability, Cindy Eckert, Founder and CEO of Sprout Pharmaceuticals and The Pink Ceiling/Pinkubator, advises to “treat your career like a jungle gym, not a ladder, and swing toward opportunities.”And with those resonating words, may we swing towards cultural shifts, empowerment, and happier lives, for all.Tags:  affinity group featured nfl films philadelphia win groupEnter your email address to follow this blog and receive notifications of new posts by email.Join 193,417 other followers\n\n\n\n\n\n \n"}