{"id": "What to watch for in Broncos vs. Cardinals on 'TNF'", "paragraph": "  \nRarely do Week 7 matchups conjure copious amounts of conjecture about the potentially dire fates awaiting a team's coaching staff should they fail to win. Thursday's game between the Denver Broncos and Arizona Cardinals is one of the exceptions.Thursday Night Football features two teams dangling above the abyss of irrelevance with coaching staffs in danger of seeing pink-slip casualties amongst their ranks. First-year Cardinals head coach Steve Wilks said his job and others on his staff could be in jeopardy if the team loses. Broncos general manager John Elway said the team is \"fighting for our lives,\" with coach Vance Joseph adding the squad is \"desperate\" for a win.Joseph's fate might be the most precarious of all the head coaches in the NFL. Denver's struggles in 2017 coupled with the team's current four-game losing streak means a win over the Cardinals might be all that stands between him and unemployment. Wilks appears to be in less danger since he's only been a head coach for six games, but offensive coordinator Mike McCoy could see his third team termination in three years if things don't go the Cardinals' way.With so much on the line, here's what to watch for on Thursday Night Football when the Broncos (2-4) play the Cardinals (1-5) at State Farm Stadium in Glendale, Arizona.Going retro might work for cars and clothes, but it's out of style for Case Keenum. The Broncos signed Keenum last offseason under the expectation that he'd continue to showcase the talent that made him the Minnesota Miracle maestro en route to the team's NFC Championship Game appearance.\nSo far, Keenum's looked more like the quarterback he was during his first four seasons in the league than he was in 2017.Keenum's eight interceptions is tied for the NFL lead, and he's thrown a pick in every game this season. With the Minnesota Vikings last year, he only threw seven picks in 15 games.Much of the haphazard ball protection can be blamed on Denver's often abominable offensive line play. After only being sacked twice during the Broncos' two victories, Keenum has been sacked 13 times over the last four games. With guard Ronald Leary out for the season with a torn Achilles tendon and offensive tackle Jared Veldheer sidelined for a third consecutive game because of a knee injury, the Broncos' O-line will need a reputation-defying performance to help Keenum get the protection he deserves.Giving Keenum more time in the pocket could be key for the Broncos' success. Keenum has a passer rating of 22.0 (13 of 41) in tight-window passing this season, per Next Gen Stats. He's also seen his passer rating plummet from 105.9 to 74.0 year over year on passes made under 2.5 seconds. In addition, five of his eight interceptions have come when he's targeting the tight end.Keenum has shown he can perform OK in pocket-collapsing conditions -- he passed for more than 300 yards in losses to the Jets and Rams. Still, he'll need more than a favorable personal history against the Cardinals (five TDs, zero INTs, 97.2 passer rating in two games -- both wins) in order to turn around the Broncos' recent fortunes.Josh Rosen is five games into his NFL career and he's already playing in a revenge game.Perhaps it's a bit much to overhype Rosen's draft night hot take, but the Broncos did decide to draft quarterback terrorizer Bradley Chubb instead of the signal-caller with the No. 5 overall pick last April. At the time, Rosen said having to wait for his name to be called at No. 10 after teams made \"nine mistakes\" would motivate for him.At this point, though, Rosen probably would be fine with a respectable performance against a Von Miller-led Broncos pass rush that has vowed to \"kick their ass\" (which Wilks won't be using as bulletin board material). The Cardinals rank 31st in total offense (220.5 yards per game), with most of that coming in a passing game that has improved since Rosen took away Sam Bradford's starting job.Rosen has made progress over his three starts and has easily eclipsed the numbers Bradford was posting before his unceremonious demotion. Against the Minnesota Vikings last week, Rosen showcased flashes of his first-round pedigree as he combated bouts of ineffectiveness. He finished the game with 240 yards passing and a 67.7 completion percentage but was mostly quiet in the second half as the Cardinals went 0 for 10 on third-down conversions en route to losing.Like pretty much all rookie QBs, Rosen is struggling when under pressure (I know, shocker!). The Vikings sacked Rosen four times, but they struggled to put consistent pressure on him. Rosen ranks first in pressure rate (41.9 percent) and has the league's third-worst passer rating under pressure (33.8). Offensive line standout Justin Pugh is active for the game despite a broken hand, but Chubb, Miller and the rest of the Broncos pass rush could make life miserable for the rookie.Resuscitating the Cardinals' dormant running game would go a long way in improving Rosen's chances of finding success in the passing game.It's staggering to fathom how poorly Arizona's rushing attack has performed, especially when considering how little of an impact David Johnson has made. The Cardinals only have 384 total rushing yards through six games -- the second-fewest ever in the Super Bowl era. Johnson, an All-Pro in 2016, has rushed over 70 yards only once this season behind a run-blocking effort that ranks No. 28 in the NFL by Pro Football Focus.The woes associated with the team's last-ranked rushing offense is a big reason why McCoy finds himself on the cusp of unemployment. The good news for the Cardinals? The Broncos rank last in rushing defense (161.3 YPG). The team has given up a grand total of 593 yards on the ground over the last two games and is the only team in NFL history to allow individual rushers to tally 200 yards in consecutive games (Isaiah Crowell, Todd Gurley).If David Johnson can't get at least 100 yards against the Broncos, the Cardinals are in serious trouble on the ground.The Broncos have had a plethora of issues on offense over the course of their losing streak. Sometimes it's red-zone implosions, other times it's dropped passes, interceptions, sacks or third-down feebleness.Much like the Cardinals, Denver should find some relief on offense via it's running game. The Cardinals rank 31st in rushing yards allowed (151.2 YPG), and that means we should expect to see a lot of Phillip Lindsay and Royce Freeman.Each running back has seen their carries and production take a dip in recent games after a fast start to the season, but at least one of them is primed for a rebound. Still, Lindsay is averaging 5.7 YPC and Freeman is at 4.7 YPC. Arizona's linebacker corps will have to keep an eye on them and not just focus all their attention on Emmanuel Sanders, Demaryius Thomas and Courtland Sutton.If one half or all of the Broncos' rookie running back duo finds success against the Cardinals, perhaps Joseph will be breathing easy in Englewood come Friday morning.\nMore Posts\nPhoto Essay\r\n"}