{"id": "Patrick Peterson aims to be with Cardinals 'for years'", "paragraph": "  \nThe Arizona Cardinals insisted all along they weren't trading Patrick Peterson. The All-Pro cornerback is back on board with that plan. After reports suggested that PP asked to be traded before the Oct. 30 deadline, Peterson tweeted Wednesday that he's \"focused on being part of the solution and heling us turn this around.\" My statement. pic.twitter.com/FG8R7Fa0YAIn the statement, Peterson acknowledges he's frustrated with how the season has gone and doesn't refute the report that he'd asked to be shipped to a contender. \"I'm sorry that I had to take away from this game week but it is what it is,\" Peterson later added in comments to reporters, per ESPN.com. \"I'm ready to move forward. My teammates are ready to move forward.\" Patrick Peterson talked today after practice. Repeatedly said he wanted to put trade talk behind him. Asked why he wanted trade: \"You see the record.\" Asked about if heâ\u0080\u0099d ask for a trade after season, he said he was focused on the game.Trading the lockdown corner never seemed to be in the Cards playbook, however. Owner Michael Bidwill emphatically shot down the idea to NFL Network Insider Ian Rapoport last week. \"I've seen the speculation. But it's not happening. Not happening,\" Bidwill said. Likewise, coach Steve Wilks said Monday, \"We're not trading Patrick. That's out of the question.\" At 1-6, the Cardinals are off to a rocky start and look closer to the No. 1 overall selection than a playoff spot. Yet, Peterson remains one of the best players at his position and quarterbacks continue to shy away from throwing his direction. After 2018, the 28-year-old corner will have two years left on his contract with cap hits of about $11.8 million and $13.1 million, respectively, in 2019 and 2020. The Cardinals want to keep their defensive leader around to help as the offense grows around Josh Rosen. Now Peterson is also cool with that plan. \nMore Posts\nPhoto Essay\r\n"}