{"id": "2018 midseason All-Pro team: Patrick Mahomes rolling", "paragraph": "\nEight weeks into the 2018 NFL campaign, here is my Midseason All-Pro Team, comprised of first-half studs who have made a significant impact at their position thus far:The art of quarterbacking is finding the sweet spot between settling for what the defense is giving you versus taking as much as you can get. In half a season at the helm of Andy Reid's high-octane aerial attack, Mahomes has already thrown for as many touchdown passes as Alex Smith unfurled across a full season with the same personnel in his career-best MVP run a year ago. Put another way, Mahomes has more four-touchdown performances in eight games this season than all Cleveland Browns quarterbacks have managed in 312 games since the franchise returned to the NFL in 1999.\nHow much does coaching matter? Two years ago under Jeff Fisher, Gurley was mired in a historically inept stretch of games without reaching the 100-yard mark. Now he's threatening LaDainian Tomlinson's single-season touchdowns record en route to a second straight Offensive Player of the Year campaign. A complete back in the mold of Walter Payton, Gurley casually sheds tackles, barely breaking stride with decisive, quick cuts and no wasted motion. He boasts the speed to beat angles for home-run plays, the power to drag defensive linemen past the sticks in short-yardage situations and the receiving ability to punish any linebacker attempting to hang with him in coverage. This is the gold standard at his position, a true All-Pro playing at the height of his powers.Case Keenum landed in Denver, where he was able to throw to the venerable-veteran duo of Emmanuel Sanders and (the since-traded) Demaryius Thomas. So why has Keenum missed his Minnesota receivers so dearly? Because Thielen is literally unstoppable, topping 100 yards in eight straight games to begin the season -- a feat no other modern wide receiver can match. He's on a torrid pace that would break Marvin Harrison's single-season record for receptions (143).There's quite a battle ongoing between Hopkins and New Orleans' Michael Thomas for the most likely to become the next Larry Fitzgerald, a perennial All-Pro, postseason legend and surefire Hall of Famer. Like Fitzgerald in Arizona, they both combine exceptionally strong hands with a penchant for contortionist-act catches.\nLike Randy Moss in his prime, Hill allows the rest of the offense to feast, creating large tracts of open land with game-breaking speed that depletes the defensive resources needed to stop Kareem Hunt, Sammy Watkins and Travis Kelce. To be clear, Hill isn't merely a pre-snap distraction or a post-snap decoy. His performances versus the Chargers in Week 1 (seven catches, 169 yards and two touchdowns) and Patriots in Week 6 (seven catches, 142 yards and three touchdowns) were two of the most incredible we've seen by any skill-position player this season.He moves like Kelce and blocks like Gronk. This is Rob Gronkowski's spot whenever he's healthy, but the greatest of all time simply hasn't been himself while playing through ankle and back injuries this season. With apologies to Kansas City's matchup nightmare and Philadelphia's soft-handed Zach Ertz -- a pair of overgrown wideouts -- Kittle has been the most complete tight end in the league this season. As much as I want to reward Rams stalwart Andrew Whitworth, the ageless one has struggled at times with speed rushers this season. That's not the case with Armstead, who many believe is the most athletic tackle since Anthony Munoz was stonewalling speed rushers in Cincinnati throughout the 1980s. Signed away from Cleveland two years ago, Schwartz has been the rock upon which Andy Reid builds his high-powered attacks. Schwartz finally allowed his first sack of the season last week, which is notable because it came against Von Miller, the Broncos' superstar who tends to disappear whenever his dance card shows Schwartz's name.CBS analyst Tony Romo believes Washington's Brandon Scherff has played at an All-Pro level this season, but I can't ignore Martin's sustained excellence as the premier guard in the game. A favorite of O-line scout Brandon Thorn, Marpet is paving the way for a Tampa Bay attack that is averaging 25 more yards than the Rams and 42 more yards than the Chiefs through eight weeks.With their top running back, wide receiver, tight end and offensive tackle in and out of the lineup due to injuries, the Colts have averaged nearly 35 points per game over the past five weeks. For the first time in the Andrew Luck era, they can boast a back-to-back 100-yard rusher to go with three consecutive games allowing zero sacks. As bizarre as it may sound, the strength of this team is the offensive line, led by Kelly.\"I've coached Pro Bowl centers. I've been around Nick Mangold, (Mike) Pouncey,\" offensive line coach Dave DeGuglielmo raved this week. \"I've had some really good, athletic ones, strong ones, smart ones. He's the most complete center I've ever coached. I have no doubt he is the best center in the National Football League. He's the most complete guy. Turn the tape on, find me one better. Strength, athletic ability, intelligence, quickness.\"If the Ravens' Justin Tucker is the master craftsman at the position, Gano isn't far behind. Whereas Tucker had one kick blocked and pushed another wide right with his team's fortunes on the line, Gano drilled a game-winner from 63 yards out in Carolina's thrilling come-from-behind victory over the Giants in Week 5. Late-game theatrics aside, Gano has drilled 28 consecutive field-goals -- and 39 straight at home.The only player to return both a kickoff and a punt for a touchdown, Grant is averaging over 20 yards per touch (including fair catches) on special teams. More than a gadget player, he has also bedeviled opposing defenses as a run-after-catch threat in Adam Gase's offense, turning 20 receptions into 252 yards and two more trips to pay dirt.It has to be a new feeling for Browns opponents, knowing the quarterback and the play-caller have to account for Garrett's fearsome presence on every play. Easy street is closed in Cleveland. Ford is authoring one of the great contract-year runs in recent history, leading all edge rushers in total pressures (sacks plus hits plus hurries) for a defense that offers little resistance otherwise. All hits and hurries are not created equal, however. If one wanted to argue that Khalil Mack's relentless pressure has had a greater impact on the Bears' fortunes, that was certainly true in September and early October. The problem is that Chicago's vaunted pass rush has all but vanished in response to his ankle injury over the past three weeks. \nSingle-handedly putting a lie to the notion that preseason football is necessary, Donald is following last year's Defensive Player of the Year campaign with an even more dominant stretch that has him on pace to shatter the sack record for defensive tackles. Even better, he's pulling off that level of production despite facing double teams on 70 percent of his snaps, per Next Gen Stats. If Watt isn't quite the same unmatched, unstoppable force that he was during an unprecedented pre-injury stretch that included three DPOY awards, he isn't far off. Teaming with Jadeveon Clowney to form a devastating one-two punch for opposing linemen, Watt has racked up eight sacks, five stuffs and four forced fumbles.Donald and Watt have been so astonishingly good for so long that a trio of three-technique tackles -- Fletcher Cox, Geno Atkins and Jurrell Casey -- are losing honors they might have received in a different era.It's long past time to recognize Brown as one of football's most unsung superstars, playing at a Pro Bowl level for his third consecutive season. Although he entered the league as a dynamo with 4.5 speed back in 2012, he's found his niche as a hard-hitting menace, the face of a stout run defense that has held Christian McCaffrey, Ezekiel Elliott and Saquon Barkley under 100 rushing yards combined over the past three weeks. Kuechly is like an incredibly efficient IRS agent, arriving at your doorstep to quickly dismantle your life before moving on to wreck the life of the next ball carrier. Wagner arrives with even crueler intentions. Special mention to Colts rookie Darius Leonard, leading all off-ball linebackers in tackles, sacks and forced fumbles. \nWe continue to hear that Peterson's press-corner skills aren't a great fit for Steve Wilks' zone scheme, yet the seven-time Pro Bowl selection is enjoying what may be his finest season to date. If Peterson was once the game's most physically gifted defensive back, that honor might now fall to Jones, who has been an unqualified success in his transition from safety to cornerback. Why was this difference-making talent going to waste at the wrong position for two straight seasons?Like a highwayman of yore, there's a price to be paid for venturing into Swearinger's territory. The Redskins' defensive tone-setter already has a pair of two-interception games against the Colts and Giants and a strip-sack of Cam Newton. His best performance, however, may have been versus Dallas, when he stuffed Ezekiel Elliott for a loss and forced a fumble on Dak Prescott's fourth-down run. James is a bigger, more physical version of Tyrann Mathieu, making plays at all levels of the Bolts defense. Not just the most disruptive blitzing safety in the league, he boasts the athletic ability and uncanny instincts to match Pittsburgh legend Troy Polamalu's impact at the line of scrimmage.\nHow does one follow up a two-interception performance in his NFL debut? Try this on for size: In Cleveland's 12-9 upset win over Baltimore in Week 5, Ward blocked a Justin Tucker field-goal try, saved another Tucker attempt with a third-down stop, jumped tight end Nick Boyle's route for a goal-line interception and deflected a key third-down pass in the fourth quarter. The league's next great cover corner doubles as a big-play machine.Seattle's rookie sensation earned Special Teams Player of the Week honors for his big-ballsy decision to run out of the end zone, pick up a first down and seal the victory over Detroit in Week 8. Far from a one-trick pony, he has also revived the lost art of the drop-kick kickoff, as well as the coffin-corner punt. Apologies to Rams maestro Johnny Hekker, who helped turn the tide against Green Bay with yet another in a career chock-full of magnificent performances.Follow Chris Wesseling on Twitter @ChrisWesseling.\nMore Posts\nPhoto Essay\r\n"}