{"id": "New Bill Terrelle Pryor makes his case: 'I can ball'", "paragraph": "  \nTerrelle Pryor wants you to know he wasn't cut because of ability or potential to contribute.Well, at least that's what he says.\"I can ball,\" Pryor said, via ESPN. \"I can ball, bro. I'm not being cocky. I just know how I study, how I work, and how I practice. I compete at a high level. I expect high things from myself.\"To Pryor's credit, he has shown he can ball. He posted a 1,000-yard season on a Cleveland Browns team that was missing a reliable option elsewhere.Since then, though, he's amassed 475 yards and three touchdowns in 15 games between 2017 and 2018. A one-year, bet-on-himself contract in Washington fell flat in 2017, and he was cut by the New York Jets after six games this season.When Pryor was released, the thought was he was too injured to contribute to a suddenly depleted receiving corps. That would make his signing with the Bills this week a bit of a head scratcher, but...\"Let's shut that one down how I was [going to be] out for five or six games,\" Pryor said. \"I was going to miss a game, and then I got cut. So I guess, I don't know if I wasn't a part of their plan, or whatever it was.\"The quarterback-turned-receiver deserves credit for doing better than most who attempt to make the conversion. But he's joining a team with disaster-level play at the quarterback position. Just look at Kelvin Benjamin's stat line.This week, Pryor will get less than a week to get acclimated with Nathan Peterman, known more for throwing interceptions than touchdowns, or Derek Anderson if he clears concussion protocol. The Bills face the Chicago Bears, who feature Khalil Mack (though he's battling through an ankle injury) on Sunday.\"The team here [in Buffalo], they made me feel at home from when I walked in,\" he said. \"I'm talking from the cafeteria ladies. They all, when I walked in, said, 'Terrelle.' That made me feel at home I don't really care about the [Bills' 2-6] record because we can easily on this next eight games come together as one, push it and make a great record.\"We can chalk up Pryor as an optimist. We'll see if he and the Bills can turn things around, starting Sunday.\nMore Posts\nPhoto Essay\r\n"}