{"id": "Surprising Stats: Week 10", "paragraph": "  \nThis season flew by. We're already to the double-digits. Fantasy trade deadlines loom. The time is now.Fun stats from last night: Pittsburgh tied its highest point total in a game at Heinz Field. The last time Pittsburgh scored 52 points at home it was November 25, 1984, when they beat the Chargers. Ben Roethlisberger is now only the second player in NFL history to have at least 300 passing yards, five touchdowns, with three or fewer incompletions in a game. Kurt Warner also hit that mark in 1999.But there's a lot of weeks left. You need to win now. Every week there are statistical nuggets that can separate you from the pack:Drew Brees leads the league with a 76.3 completion percentage. Last week against the Los Angeles Rams, he threw for 346 yards, four touchdowns, no interceptions. Over his last three away games (at Minnesota, at Baltimore, and at the New York Giants), Brees averaged only 183 passing yards per game. His only interception of the season was on the road. However, his best fantasy game of the year was at Atlanta when he threw for 396 yards, three touchdowns, and no interceptions. He also ran in two touchdowns. Atlanta allows the third most fantasy points to opposing quarterbacks. Cincinnati allows the fourth most points.In Week 8 before the bye, Alex Erickson played on 77 percent of the team's snaps. He only caught one of his four targets for 5 yards, but he will be on the field. So will John Ross, expected to return from a groin injury. The Saints allow the absolute most fantasy points to opposing wide receivers in PPR formats and the eighth-fewest to opposing running backs.Ito Smith scored a rushing touchdown in four of his last five games. Of this year's rookie class, only Saquon Barkley has more rushing touchdowns than Smith. He did that while only playing in 20.4 percent of Atlanta's offensive snaps. Rookie Calvin Ridley leads the rookie class with seven receiving touchdowns, the next most has only three scores on the season. Smith and Ridley account for 40.7 percent of the Falcons touchdowns.Since 2015, Duke Johnson is the only active running back with over 2,000 combined receiving yards. He has 2,022 to be exact. Last week was only his second time going over 45 receiving yards this year, and he scored for the first time all year.Only two quarterback have yet to throw an interception on the road this season: Aaron Rodgers and Matthew Stafford. Stafford has six interceptions at home. The Chicago Bears and the Detroit Lions defenses are tied with 24 sacks a piece, the seventh most in the league. Stafford was sacked 10 times last week at Minnesota.Detroit held George Kittle, Rob Gronkowski, and Kyle Rudolph to 51 or fewer yards and no touchdowns. Trey Burton only has one game over 50 yards since the team's Week 5 bye, but he did score a touchdown in four of his last five games.Christian Kirk has four or more targets in every game this season except in Week 1. In full-point PPR leagues, he has 1.5 more fantasy point than Larry Fitzgerald and only David Johnson has more fantasy point on the team. However, Fitzgerald has eight or more targets in each of his last three games and scored a touchdown in each of the last two.Chris Conley has yet to eclipse 23 receiving yards this year, but he did score a touchdown in both Weeks 2 and 3. He's played in 70 percent of the team's offensive snaps, only 3 fewer snaps on the season than Sammy Watkins. Watkins is currently not practicing due to a foot injury.James White is the seventh highest scoring running back in full-point PPR formats. In non-PPR formats, he's the eighth highest scoring. In 2017, he was 47th in non-PPR formats. 38th in PPR.In Week 7 and 9, Dion Lewis was the eighth highest scoring running back in PPR formats. In 2017, when he played for the New England Patriots, Lewis was the 13th highest scoring running back on the year, despite not touching the ball 10-plus times in an outing until Week 6.In every game this year, a wide receiver scored a touchdown against the Buccaneers. Paul Richardson was sent to IR this week. Jamison Crowder may come back this week after not playing since Week 3. But Maurice Harris has been on the field for 75 percent of the team's snaps since Week 5. Last week, Harris saw a team-high 12 targets and caught 10 of them for 124 yards. He's yet to score a touchdown.Week 1 at Arizona was the last time that a wide receiver didn't go over 100 receiving yards and/or scored a touchdown against Washington. In each game this year, a Bucs receiver has gone over 100 yards and/or scored a touchdown. In five of their eight games, they scored two or more touchdowns.Three times in his career has Terrelle Pryor gone over 100 receiving yards in a game. All three times were in 2016 and one of those instances was against the Jets. The other two were against Miami and the Giants.Seven quarterbacks have five or more rushing touchdowns since the beginning of the 2017 season: Cam Newton (10), Dak Prescott (8), Marcus Mariota (7), Kirk Cousins, Tyrod Taylor, DeShone Kizer, and Josh McCown (5).Josh Lambo made 100 percent of his field goals and point after attempts this year. However, he's only the 24th highest scoring fantasy kicker because the team didn't ask him to attempt even one field goal in Weeks 5, 6, or 7.From Weeks 4 through 8, Andrew Luck threw a league-high 18 touchdowns. This week could be his sixth game in a row with at least three touchdowns. Carson Wentz threw for three touchdowns against the Jaguars in Week 8.Only one quarterback wasn't able to throw multiple touchdowns on the Raiders this year. That was Case Keenum in Week 2. Philip Rivers has two or more passing touchdown in each game this year. Over his past five games against Oakland, Rivers averages 311.8 passing yards and 2.4 touchdowns per game.In the two games after Amari Cooper was traded to the Cowboys, Brandon LaFell has been on the field for 93 percent of the Raiders' offensive snaps. Jordy Nelson has been out there for 82 percent. Seth Roberts for 58 percent and then it's Martavis Bryant who's only playing on 26 percent of the team's snaps.When Seattle played the Rams in Week 5, Chris Carson carried the ball 19 times for 116 yards, his highest rushing total of the season. But it was Mike Davis who scored the most fantasy points, carrying the ball 12 times for 68 yards and a touchdown. Chris Carson is questionable, and still not practicing due to a thigh injury.Going into Week 10, Jared Goff has the second most passing yards in the league (2,816), only behind Patrick Mahomes. Goff's 20 touchdowns are third, only behind Mahomes and Andrew Luck. His six interceptions are the fewest of those three players.The quarterback for the Miami Dolphins has not been the highest fantasy scoring player on the team since Week 3.In Week 4 Marquez Valdes-Scantling made a huge leap and played in 71 percent of the team's snaps. Since then, he's been in the game on the most or the second most snaps of all the wide receivers on the team. Week 9 was his second 100-yard game of the season and he's seen five or more targets in every game since Week 5.When three wide receivers are on the field, Ezekiel Elliott averages 3.9 yards per carry. When there are two of fewer wide receivers on the field, he averages 5.4 yards per carry. According to Pro Football Focus, Elliott has 14 carries that went for 15 yards or more, the most among running backs. 42.5 percent of his rushing yards have come on those 14 plays.Carson Wentz has yet to throw an interception over the course of his three meetings against the Cowboys. Dallas has only forced two interceptions; only Tampa Bay has fewer (one).Sterling Shepard has seven or more targets in every game this year except Week 2 and he has four games of 75-plus receiving yards. In PPR formats, he's averaging 15.4 fantasy points per game.In his NFL debut, Nick Mullens targeted eight different players. Pierre Garcon had the most at five targets. Then it was Marquise Goodwin and George Kittle with four. Garcon and Kittle scored two of his touchdowns. The other went to Kendrick Bourne, who saw only one other target in that game, although he saw 10 targets in Week 8.\nMore Posts\nPhoto Essay\r\n"}