{"id": "Jason Pierre-Paul 'bringing the house down' vs. Giants", "paragraph": "  \nJason Pierre-Paul is out to prove the New York Giants made a mistake trading him to the Tampa Bay Buccaneers when the teams tilt at MetLife Stadium on Sunday.  \"Honestly, I had this game checked off since I left there, so emotion's running big and I'm coming, man,\" Pierre-Paul said Wednesday, via Art Stapleton of The Bergen Record. \"I'm bringing the house down.\" The Giants traded the 29-year-old pass rusher in March to shed his contract. JPP added that his motivation comes from more than just being shipped out of New York. \"I wouldn't say [I was] hurt. But the fact that the only thing that I got was a phone call [from GM Dave Gettleman], you know what I'm saying -- I didn't speak to no owners, no nothing,\" Pierre-Paul said. \"You know, obviously, I gave a hard eight years at the New York Giants, won a Super Bowl there, it's transition, but the only thing to get was a phone call -- I wouldn't say I was hurt, it was just shocking. But at the end of the day, this is a business league, and at the end of the day, we've got to do our jobs, no matter what team you play for. You're a football player, you're a pro, you've got to do the job to the best of your ability, and that's what I've been doing.\" Pierre-Paul is playing solidly this season for the disappointing Buccaneers, compiling eight sacks in nine games. With one more QB takedown, he'll have the most sacks since injuring his hand in a fireworks accident on July 4, 2015. The Giants as a team have 10 total sacks, second-fewest in the NFL. \"I don't have a chip on my shoulder. Obviously, New York felt like I couldn't get the job done,\" Pierre-Paul said. \"I don't know who makes those decisions, but that's the decision they made, and I got traded. I always told myself, no matter where I go ... I would still be the same player.\" Sunday's game at MetLife Stadium figures to be an emotional one for the player returning to the place he spent his first eight NFL seasons. \"I want to be the great football player I know I can be this Sunday,\" Pierre-Paul said, adding: \"I won a Super Bowl there, so no matter what, that's home for me. You know what I'm saying? Because that's where everything started at, but at the end of the day, if the fans are gonna cheer for me, the fans in New York, it's a great fan base, and I'm pretty sure I'll be thinking a lot of things, but there's a football game going on.\" \nMore Posts\nPhoto Essay\r\n"}