{"id": "Patriots still had interest in Malcolm Butler despite SB benching", "paragraph": "  \nThe untold story of Malcolm Butler's Super Bowl LII benching might, in fact, remain untold. There are still several people directly involved who don't know all the details.But during the free agency period that immediately followed, Butler remained on the Patriots' radar. As the Titans cornerback gets set to face his old team Sunday, it's worth noting that New England was still interested in re-signing Butler at the right price, sources say.Butler ended up signing a five-year, $61.25 million contract in Tennessee, picking the Titans over offers from the Houston Texans and Chicago Bears.But the Patriots -- even with the events against the Eagles that oddly left Butler watching every snap from the sideline -- informed Butler's agent Derek Simpson to reach out to them if he didn't get an offer to his liking. Already paying top corner Stephon Gilmore, the Pats perhaps could have paid Butler around $10 million a year. \nThat fact only adds to the curiosity of a situation that featured both sides having actual good feelings about the other. That was evident this week. \"I can tell you Malcolm is very happy in Tennessee,\" Simpson said. \"He is putting the first half of the season behind him and now he is just focused on being the best he can be and helping the Titans win.\"Butler has struggled some. That came to light nationally against the Cowboys, when he allowed his man to score two touchdowns. That said, sources say his job is not in jeopardy. He needs to play better, but the Titans are going to give him every opportunity to do so. Butler is better than the alternative. Similar to what the Patriots thought, the Titans view Butler as a hard worker who thrives when he clears out the clutter and keeps it simple. When he only worries about his assignment, he can thrive. He takes things personally, which can lead to over-thinking and is obviously aware of the criticism he's receiving. They want him to clear his mind and regain some confidence. They want good things to happen for him. If Patriots coach Bill Belichick and Tom Brady target Butler on Sunday, he'll have his chance for redemption.Follow Ian Rapoport on Twitter @RapSheet.\nMore News >\n\nMore News >\nMore New England Patriots Videos >More New England Patriots Photos >"}