{"id": "Pats' Rob Gronkowski not upset over red-zone targets", "paragraph": "  \nNew England Patriots tight end Rob Gronkowski is on a scoreless drought entering Sunday's game against the Chicago Bears. Gronkowski hasn't caught a touchdown pass since Week 1, a span of five games to mark the longest scoreless streak in a single season for the four-time All-Pro. One of the biggest factors keeping Gronk from scoring is a lack of red-zone targets, as Kevin Duffy of the Boston Herald wrote.Gronkowski, who entered the 2018 season with 76 career touchdowns, said he won't be getting frustrated over his lack of opportunities near the goal line any time soon. \"It is what it is,\" Gronkowski told reporters Wednesday, via the Patriots' official website. \"First off, I've got to get open. I've got to get out there and run better routes, and then I'll start seeing more targets. But whatever play is called, we're scoring points, we're scoring down there. \"Whatever I have to do to help out the team, even if the ball's not going my way, I've just got to do it and just keep grinding. If I keep playing ball, keep doing what I need to do, keep playing better, I might start receiving the targets. That's what it comes down to, so just got to get better and get open.\" According to the Boston Herald, the Patriots targeted Gronkowski 22 times in the red zone in 2017, including the postseason, resulting in six touchdowns despite opponents often bracketing the tight end in coverage. He has only one such target this season. Through six games in 2018, the Patriots have achieved offensive balance with an emerging running game anchored by rookie Sony Michel and the numbers now reflect what the team has shown a preference to accomplish inside the 5-yard line. A total of 58.8 percent of the Patriots' plays inside the 5-yard line are runs, and a commitment to the run extends to plays called inside the 10-yard line, where the Patriots have run the ball 56.2 percent of the time compared to 43.8 percent of passing plays. The formula has clearly worked during the Patriots' three-game winning streak, a span where New England is averaging 39.6 points per game. Additionally, the Patriots have totaled 445 yards rushing and seven touchdowns from Weeks 4-6, with a 114:101 pass-run ratio. The numbers this season are more noteworthy when compared to Weeks 4-6 in 2017, a three-game period when the Patriots passed the ball 123 times and ran it just 67 times with Gronkowski scoring two touchdowns.\nStill, it should only be a matter of time until Gronkowski once again becomes one of the toughest players to defend inside the red zone when considering the complementary pieces around him. The offense received a boost two weeks ago with the return of wide receiver Julian Edelman from a four-game suspension and wide receiver Josh Gordon has come on in recent weeks. And with the running game firing on all cylinders, the Patriots are enjoying success on offense, which is reflected in the win-loss column with a 4-2 record. For Gronkowski, the latter category is what really matters to him and his teammates. \"We've got many good players on the offensive side of the ball and we're just trying to win games,\" Gronkowski said. \"I would say that there's many players on our team, even if they didn't get a pass in the game and we won, they'd be totally satisfied.\" \nMore Posts\nPhoto Essay\r\n"}