{"id": "Injuries: Ben Roethlisberger has fractured index finger", "paragraph": "  \nBig Ben is dealing with a small fracture.Pittsburgh Steelers coach Mike Tomlin said Ben Roethlisberger came out of Sunday's win against the Cleveland Browns with a broken index finger to his non-throwing hand. They do not anticipate it being an issue come Sunday in an AFC North clash with the Baltimore Ravens.It's unclear when Roethlisberger broke the finger but it didn't appear to affect him. He completed 24 of 36 passes for 257 yards and two touchdowns with an interception against the Browns -- the latest efficient showing in what has been a strong 15th season for the future Hall of Famer. While Roethlisberger has dealt with his fair share of injuries, he has not missed a start due to one in more than two years. He suffered a torn meniscus in Week 6 of the 2016 season, and then missed all of one game following surgery.The Steelers (4-2-1) have won three straight since losing to the Ravens (4-4), 26-14, in Week 4.Here are other injuries we're tracking Tuesday.1. Bears standout guard Kyle Long is out 6-8 weeks with a foot injury suffered in Sunday's win over the Jets, sources told NFL Network Insider Ian Rapoport. Long is getting more info, but that's the best estimate right now, Rapoport added.2. Cincinnati Bengals Pro Bowl receiver A.J. Green was seen making his way through the locker room Tuesday afternoon with his right foot in a boot, according to The Athletic. Green told reporters in the aftermath of Sunday's win versus the Tampa Bay Buccaneers that he jammed his toe while making a catch to set up the game-winning field goal.3. San Francisco 49ers quarterback C.J. Beathard (wrist) says he believes he will be ready to play against the Oakland Raiders on Thursday. Beathard hit his hand on another player's helmet last week. 49ers coach Kyle Shanahan said Beathard is not able to play, Nick Mullens will get the start.4. Buffalo Bills quarterback Derek Anderson is in concussion protocol after exiting Monday night's loss. With Josh Allen also sidelined, Nathan Peterman is the last remaining healthy Bills QB.5. The Patriots place cornerback Eric Rowe on inured reserve with a groin injury, sources told NFL Network's Tom Pelissero.6. The Dolphins place defensive tackle Vincent Taylor on injured reserve with a foot injury, a source told Pelissero. Taylor was carted off during Thursday's loss to the Texans.7. The Texans place wideout Will Fuller on injured reserve. Fuller suffered a season-ending torn ACL during Thursday's win against the Dolphins.\nMore Posts\nPhoto Essay\r\n"}