{"id": "Raiders owner Mark Davis: 1-8 record 'is my fault'", "paragraph": "  \nRaiders owner Mark Davis is taking the blame for Oakland's disastrous 1-8 record to open the season. In an expansive interview with ESPN's Paul Gutierrez after Sunday's 20-6 loss to the Los Angeles Chargers, Davis told fans to point the finger of blame toward ownership. \"I always look in the mirror, and the buck stops with me,\" Davis said. \"Where this team is right now is my fault. We haven't been able to build a 22-man roster. We haven't been able to give this team a chance to win because the Reconstruction failed. We failed from 2014 on to have a roster right now.\" Davis' Reconstruction comment was in reference to the 2012 Deconstruction leading into the 2014 rebuild. After one playoff appearance in 2016, the Raiders are right back in deconstruction mode. Davis used the interview to defend coach Jon Gruden continually. The owner dismissed the idea that the Khalil Mack trade was the coach's fault and likewise the Amari Cooper deal. Two centerpieces of the rebuild are gone, leaving little for Raiders fans to be optimistic about moving forward. \"It's been all part of an evolution, but I think it's becoming clearer and clearer to Jon as well that the talent is just not here at this time,\" Davis said. \"The drafts did not help supplement what we were doing in the free-agent market. If you look at our roster now, it's a bunch of free-agent one-year guys that are mercenaries. And they're great guys and they're Raiders. Once a Raider, always a Raider...but we just don't have the overall talent of a 22-man roster.\" Blaming poor drafts heaps blame directly on GM Reggie McKenzie, who's days in Oakland appear numbered if the tea leaves speak true. \"Reggie and I need to sit down and talk and figure out how we are going to go about the future,\" Davis said. \"We've got to look in the mirror and figure out, Where the hell did we go wrong in trying to build this thing? \"We failed. I have failed. But at the same time, we wouldn't have been in the great position we were in without Reggie McKenzie being here.\" Again, Davis did all he could to defend Gruden at the expense of others, including the owner himself. \"I understood it was going to be a lot of work, but Jon has a 10-year contract,\" Davis said. \"I know how hard Jon Gruden works. I know how much he wants to win. And how much days like today are killing him. \"Having Jon Gruden here was the end game for me. Jon's going to be the stability here. Jon's going nowhere. That's just the way it is.\" Through all the changes since the late, great Al Davis died, the one constant has been Mark Davis, the man who handed Gruden a 10-year contract. \nMore Posts\nPhoto Essay\r\n"}