{"id": "Week 10 injury watch: Dez comeback ends after 2 days", "paragraph": "  \nDez Bryant's comeback effort attracted considerable fanfare this week, joining the New Orleans Saints and one of the best passing attacks in the NFL. However, the veteran wideout appears to have suffered a season-ending Achilles injury in practice, ending his return after just two days with the team.In terms of fantasy impact, Bryant's injury doesn't merely affect those who added him to their rosters. The Saints have perilously few wideouts on their active roster, having lost Cameron Meredith to a knee surgery already this week. While Michael Thomas, Tre'Quan Smith and Austin Carr can hold down the fort in the short team, New Orleans will likely have to dip into free agency again to find another contributor.In addition to news out of New Orleans, teams across the league find themselves dealing with injury troubles of their own.Bears: Allen Robinson (groin) - The Bears have managed without top receiver Allen Robinson the past two games. However, all signs point to a return this week against the Detroit Lions. Given the Lions defense has struggled against the pass all year and cornerback Darius Slay will miss the game, Robinson has a fantastic opportunity to bounce back from his injury in a big way.Bills: Josh Allen (elbow) - Josh Allen participated in Friday's practice in a limited capacity, but it remains unclear whether he will return this week. If he can't, the Bills haven't committed to the woeful Nathan Peterman as the starter and could instead turn to recently signed Matt Barkley. Regardless of which quarterback plays, the Jets defense should have a strong afternoon for fantasy players.Chiefs: Sammy Watkins (foot) - Sammy Watkins returned to practice Friday, suggesting that the veteran deep threat has a chance to play Sunday against the Cardinals. Watkins has a well-earned reputation as a streaky fantasy contributor, though the matchup with the Cardinals makes him an enticing start this week. Kansas City officially listed Watkins as questionable.49ers: George Kittle (chest) - Limited in the 49ers' last two practices, George Kittle has extra time to rest and recover given the team doesn't play until Monday night. Assuming he suits up, Kittle looks like a must-start against the Giants defense.Jaguars: Leonard Fournette (hamstring) - After missing the Jaguars' last four games with a hamstring injury, Leonard Fournette looks ready for a full return. The team removed the former first-round pick from the injury report, leaving little doubt that Fournette will see action on Sunday against the Colts. Accordingly, T.J. Yeldon can expect to see fewer touches with Fournette back in the lineup.Jets: Robby Anderson (ankle), Sam Darnold (foot) - Third-year speedster Robby Anderson looks highly unlikely to play after missing practice the entire week. The Jets have officially listed him as doubtful, though Anderson will probably have a different quarterback if he does manage to suit up. Sam Darnold has a foot injury and doesn't expect to play this week. New York might leave him active as an emergency backup, however.Lions: Kerryon Johnson (ankle) - Officially questionable, rookie running back Kerryon Johnson has only managed to practice in a limited capacity all week. While Johnson could still play against the Bears, Theo Riddick stands to gain the most if the Lions leave the rookie inactive this weekend.Packers: Randall Cobb (hamstring) - The same hamstring that kept Randall Cobb out for an extended period before the Packers bye has become a problem again for the veteran wideout. Cobb, listed as questionable, has already yielded targets to rookie receiver Marquez Valdes-Scantling in recent weeks. Look for Valdes-Scantling to garner even more attention if Cobb sits Sunday against the Dolphins.Patriots: Rob Gronkowski (ankle, back), Sony Michel (knee) - After missing last Sunday's game, Rob Gronkowski has only managed to practice in a limited capacity this week. The Patriots officially listed him as questionable, though fantasy players should track his status through the weekend in case of a downgrade. Meanwhile, Sony Michel appears close to a return after missing the past two games with a knee injury. If Michel doesn't make it back Sunday, expect him back in uniform after the team's Week 11 bye.Saints: Dez Bryant (Achilles) - Bryant's ruptured Achilles won't swing any fantasy leagues, but it leaves the Saints thin at wideout. The team worked out Brandon Marshall and Kamar Aiken last week before signing Bryant, and one of those two could end up in New Orleans once an MRI confirms the Achilles tear.Seahawks: Chris Carson (hip) - A hip injury knocked Chris Carson out of last Sunday's game against the Chargers and it has kept him sidelined during practice all week. He looks like a game-time decision heading into Sunday, with Mike Davis in line to see most of the backfield work if Carson cannot go.\nMore Posts\nPhoto Essay\r\n"}