{"id": "Vontaze Burfict fined $112K for hits vs. Steelers", "paragraph": "  \nVontaze Burfict has been fined. Again. In his second game back from a four-game suspension, the Cincinnati Bengals linebacker incurred $112,000 in fines stemming from multiple plays against the Pittsburgh Steelers last week that were constituted as unnecessary roughness. Burfict will not be suspended for the hits, however.These plays include in particular two third-quarter hits on Steelers wide receiver Antonio Brown (11:19) and running back James Conner (5:17).\nThe hits drew the ire of the Steelers, particularly quarterback Ben Roethlisberger, who this week called out Burfict's antics during and after his elbow shot on Brown.  \"When he hits [Antonio Brown] and knocks AB and his [own] guy out, that very next play ... he's standing there, points to JuJu and says 'You're next,'\" Roethlisberger said Tuesday. \"To me that's completely uncalled for and that's where I think I had the biggest issue.\" Right tackle Marcus Gilbert also took issue with Burfict's behavior, calling it \"pathetic\" \"sad,\" and telling reporters \"hopefully one of these days [Burfict] grows up.\"While Burfict avoided suspension, he might not be so lucky next time. Burfict faces the possibility of a suspension if he commits a similar infraction again, a source informed of the situation told Rapoport.This is, of course, not the first time Burfict has been disciplined by the league. Since entering the pros in 2012, Burfict has been fined on at least five separate occasions for a total of $293,608 for the following offenses, per Pro Football Reference: twisting the ankles of opposing players; roughing the passer, unnecessary roughness and a face mask penalty; stomping on an opponent's leg; unsportsmanlike conduct; and now two instances of unnecessary roughness again. Burfict has also been suspended three times to start the season for the last three years for a combined 10 games. The Bengals signed the linebacker to a three-year extension last September. In other fines news...1. Seattle Seahawks safety Bradley McDougald was fined $26,739 for the hit that gave Oakland Raiders receiver Amari Cooper a concussion, NFL Network's Tom Pelissero reported. 2. Denver Broncos safety Darian Stewart was fined $26,739 for the horse collar that injured Los Angeles Rams receiver Cooper Kupp, Pelissero reported. Broncos wide receiver Emmanuel Sanders was fined $10,026 for taunting.3. Philadelphia Eagles defensive lineman Michael Bennett was fined $20,054 for roughing New York Giants quarterback Eli Manning, Pelissero reported. 4. Chicago Bears linebacker Leonard Floyd was fined $30,080 for his body slam of Danny Amendola and a hit to Brock Osweiler's head last week against the Miami Dolphins.\nMore Posts\nPhoto Essay\r\n"}