{"id": "GIFs that help explain Week 8: Baker gets full Browns experience", "paragraph": "  Every game during the NFL season tells a story. GIFs -- pronounced \"gifs\", \"jifs\" or \"gee-oafs\" -- can do the same thing. Let's explain the world of Week 8 through GIFs.Baker Mayfield was drafted by the Cleveland Browns in April, but it wasn't until the last 36 hours that he was truly introduced to The Cleveland Browns Experience. Prior to Sunday's loss to the Steelers, NFL Network Insider Ian Rapoport reported of discord between head coach Hue Jackson and offensive coordinator Todd Haley and possible changes on the horizon. On Monday, both men were shown the door. Gregg Williams, come on down!Yes, there were takes:Baker Mayfieldâ\u0080\u0099s agent should demand a trade. That kid has some magic and theyâ\u0080\u0099re going to ruin him. For the good of the sport, the #Browns should let him go.Settle down, Mike. The Browns still have Mayfield and a lot of quality pieces on the roster. They just need a better head coach and a front office -- and this is important -- that knows when to get out of the way. They'll try again in January.One of the best parts of Saints' prime-time games is the obligatory pregame footage of Drew Brees hyping up his teammates. It's definitely the most likable thing about the future Hall of Famer. Look at Dad go!I should start doing this before tapings of the Around The NFL Podcast. Speaking of which, Gregg Rosenthal said on our show that Brees is his midseason pick for league MVP. At first I thought it to be an overly spicy Mike Greenberg-type take, but it actually makes a ton of sense. Brees' numbers are as great as ever and the Saints are rolling at 6-1. Patrick Mahomes is probably the favorite to bring home football's most prestigious award, but the Chiefs' star better not let up. You know Brees won't.I need one of these guys, less for Gatorade and more for vodka-based cocktails and burritos.There's Aaron Rodgers reacting to Ty Montgomery's fumble that cost the Packers any chance of a dramatic win over the Rams. Rodgers not seeing the field in the final two minutes of a two-point game, against the NFL's lone undefeated team, was a massive letdown of epic proportions. It kind of ruined my Sunday. I'll never forgive Montgomery for it ... and I'm probably not alone. This from Mike Silver's Sunday column:Damn. pic.twitter.com/Hrq2N6pRB8Yikes.At least we were gifted with the return of Fitzmagic on Sunday. Ryan Fitzpatrick replaced an ineffective and turnover-addled Jameis Winston and nearly led the Bucs to a miracle comeback against the Bengals. On Monday, Bucs coach Dirk Koetter announced his decision to return Fitzpatrick to the starting role in Week 9. It's a seismic move for the Bucs, who are now distancing themselves from the quarterback who was supposed to be their franchise rock for 15 years. Remember the hosannas Bucs teammates and coaches were singing for Winston during \"Hard Knocks\" two summers ago? Things change quickly in the NFL. Fitzpatrick, meanwhile, is playing with house money. Feels like he's been doing that for most of his NFL career.Since nobody seems to know what the qualifications for the Comeback Player of the Year are, why don't we just keep giving it to Adrian Peterson until he retires? His 64-yard touchdown run to ice the Giants on Sunday was amazing to watch. At 33, the hitch in Peterson's giddyup is more pronounced than during his prime, but he still got where he needed to be. And to think the Redskins only signed Peterson after a couple injuries hit their backfield in the preseason. Better to be lucky than smart.How the hell are the Giants going to do this? Everyone knows it's time to move on from Eli Manning -- his last two months of play have been hard to watch. Ben McAdoo tried to make the move last year ... and he got fired for his efforts. You think that's on Pat Shurmur's mind while watching Manning stumble and bumble week after week in another lost year at the Meadowlands? It's a dicey situation, to say the least. And don't let the brainless Eli bashers tell you otherwise: Manning is a franchise legend, a two-time Super Bowl MVP who deserves to be treated with a level of respect reserved for only a few. But it has to start with open and honest communication. There seemed to be a scarcity of that in the waning months of the McAdoo era. One \"advantage\" for Shurmur? The majority of Giants fans now seem on board with the idea of moving on from Eli. That's not inconsequential ... especially in New York.Until next week.Dan Hanzus writes two columns a week for NFL.com and hosts the award-winning Around The NFL Podcast. Follow him on Twitter if you want.\nMore News >\nMore Videos >More Photos >More Gear >"}