{"id": "NFL Week 11 game picks: Rams edge Chiefs; Cowboys stay hot", "paragraph": "\nChiefs. Rams. Juicy.Monday night's game promises to be entertaining, no matter what happens. Two of the highest-powered offenses in the league will square off, neither 9-1 team wanting to give an inch. One squad carries talent throughout its roster, led by the best intermediate thrower going right now. The other is an offensive juggernaut, spearheaded by a fearless quarterback who trusts his arm more than any signal-caller since Brett Favre was stacking up MVP trophies.Andy Reid was on the Packers staff that saw Favre put Green Bay on his back and win the game's highest individual honor in three straight seasons. Now he directs Patrick Mahomes, who has taken the league by storm in his first season as a starter. And both will watch L.A. quarterback Jared Goff, who is coached by perhaps the brightest young mind in the NFL. You can't beat this matchup.By my count, those are two of the three premier teams in the league. And then the top-shelf scotch ironically hosts last year's champs in the Superdome. Yes, Eagles at Saints is a dandy, as is Cowboys at Falcons and Vikings at Bears. Oh, yeah -- don't sleep on Titans at Colts.This week's template for football fun, if not nirvana (OK, that is Wild Card Weekend, which isn't that far away) is detailed below. So take a gander, as nearly every game on the slate is a tight matchup. Send your thoughts on any of them: @HarrisonNFL is the place.Elliot Harrison went 7-7 on his predictions for Week 10, bringing his record for the season to 100-46-2. How will he fare in Week 11? His picks are below.Baltimore Ravens 29, Cincinnati Bengals 211 p.m. ET (CBS) | M&T Bank Stadium (Baltimore)Quite frankly, this game is the Bengals' season. Marvin Lewis will be calling the defense following Monday's firing of coordinator Teryl Austin, which takes Lewis way back to the beginning. Cincy's head coach was the Ravens' defensive coordinator from their first year in Baltimore (1996) until 2001, including that incredible 2000 season, when they allowed 165 points and pushed a Tony Banks/Trent Dilfer-led team to the Super Bowl. Lewis doesn't have that same kind of personnel with the Bengals, and he has watched his defense allow the most yards per game in football this season. While we're at it, this game is the Ravens' season, too. They've lost four of five and can ill-afford to fall to 4-6. Staring at the prospect of watching the playoffs from home and having to answer even more questions about their losing streak (with memories of Bengals WR Tyler Boyd knocking them out of the 2017 postseason picture on their mind), they win in Baltimore.Dallas Cowboys 23, Atlanta Falcons 201 p.m. ET (FOX) | Mercedes-Benz Stadium (Atlanta)\nLast year, this same contest devolved into a matchup between then-Cowboys linemen Chaz Green and Byron Bell and then-Falcons pass rusher Adrian Clayborn, with the former pair being woefully outmatched. Dak Prescott was sacked eight times in total, and the Cowboys never had a chance. Unlike in that game, left tackle Tyron Smith and Ezekiel Elliott will be playing, fortifying a Dallas offense that couldn't help its quarterback in the 2017 loss to Atlanta. Can Prescott keep up with Matt Ryan if the league's second-ranked passing offense dials it up? Doubt it. That's why Elliott should get 25 touches, just like he did Sunday night against the Eagles, forcing Atlanta to play more in the box. LB Deion Jones can't get back on the field for the Falcons soon enough.New York Giants 28, Tampa Bay Buccaneers 241 p.m. ET (FOX) | MetLife Stadium (East Rutherford, N.J.)Ryan Fitzpatrick will get the call again this week, despite three more giveaways in the loss to the Redskins. Tampa had no business losing that game, racking up 501 yards of offense, only to put a paltry three points on the board. Even against one of the weakest teams in the league, the Bucs can ill-afford to commit turnovers and miss kicks on the road, with the Giants outfit suddenly feeling itself. Eli Manning was far from prolific in San Francisco, but he capped a late game-winning drive with an on-the-money throw to Sterling Shepard. This week, I like rookie RB Saquon Barkley to take over against a poor Tampa defense that misses Kwon Alexander.Pittsburgh Steelers 26, Jacksonville Jaguars 171 p.m. ET (CBS) | TIAA Bank Field (Jacksonville, Fla.)This is precisely the kind of game the Steelers have generally lost in the Mike Tomlin era: playing down against a struggling opponent on the road after notching a few big wins. Don't forget that these Jaguars are still awfully talented, even though they've dropped five straight games. Doug Marrone finally got Leonard Fournette back last week, and the Jacksonville RB was used plenty (29 touches) in a narrow loss to the Colts. Expect Fournette to see the football at least 25 times again, to limit Pittsburgh's possessions in this game. Jacksonville swept both meetings between these two clubs last year, with the first win (in the regular season) coming on the strength of the secondary, which had five picks, and the second (in the playoffs) because of strong play from Blake Bortles and the offense. The Jags will need all of those elements working this weekend to halt the streaking Steelers.Houston Texans 22, Washington Redskins 161 p.m. ET (CBS) | FedExField (Landover, Md.)Can the Texans extend their winning streak to seven? On paper, it looks like they should, given that Washington is missing key parts on the assembly line up front, while big-time Houston pass rushers J.J. Watt and Jadeveon Clowney will be hitting FedExField this Sunday with 14.5 sacks between them and fresh legs coming off their bye. Washington survived on the road last week by clamping down in the red zone, which is precisely the Texans' weakness ... on both sides of the ball. They are 27th in red-zone scoring and 29th at stopping teams inside their own 20. Important for the 'Skins: how much they get from Alex Smith, who hasn't led the offense to more than 23 points in a game since September.Indianapolis Colts 24, Tennessee Titans 201 p.m. ET (CBS) | Lucas Oil Stadium (Indianapolis)\nTough game to pick here, but I'll go with the home team. Both of these AFC South combatants come into this important matchup hot, with the Titans winning two in a row and the Colts on a three-game streak. At the heart of Tennessee's recent success: a ferocious defense that is allowing the fewest points per game in the NFL. Last week, the Titans got after Tom Brady in a win over the Patriots, adding three sacks to their season total (now 23, a middle-of-the-pack figure). However, Tennessee defensive coordinator Dean Pees will be seeing an offensive line that hasn't allowed Andrew Luck to be sacked since Week 5. Indy is also averaging 401 yards per game during this win streak, with a turnover differential of plus-six. The Colts will be difficult to topple at home.Carolina Panthers 30, Detroit Lions 211 p.m. ET (FOX) | Ford Field (Detroit)One team will come into this matchup after sitting on a blowout loss for nine days, while the other hasn't won a game since Week 7. The Panthers' defense will dictate who wins this game. Carolina allowed 52 points versus the Steelers -- tied for the most in franchise history with a loss to Jon Gruden's Raiders back in 2000, when Oakland was actually good. The Panthers were allowing 22.5 points per game prior to the loss to the Steelers. If the D can get back to playing like that in Detroit, it should be enough. That said, Matthew Stafford could enjoy a field day against those Carolina corners. Ben Roethlisberger went 10-for-10 against them for 174 passing yards and two touchdowns. Yeesh. Another key matchup: Run-CMC vs. the NFL's No. 28 run defense.Los Angeles Chargers 27, Denver Broncos 174:05 p.m. ET (CBS) | Rokit Field at StubHub Center (Carson, Calif.)The Chargers are on a roll, as winners of six straight. The Broncos should be better than their 3-6 record would indicate, though. This could be a fun AFC West matchup. Perhaps it would be tighter if played in the mile-high air, but the soccer pitch at StubHub Center (home to the L.A. Galaxy) will just have to do. Including their Week 7 game in London, the Bolts have gone 4-1 on soccer fields this season. They also fare well in the ground game, the precise area where the Broncos have floundered on defense for much of this season. Vance Joseph's group has buttoned up that weakness over the last three games, however, allowing only 72 rushing yards per game. Houston did run for 98 yards on them last time out, but the Texans' running backs only gained 60 of those yards at 2.2 yards per carry. Philip Rivers < Deshaun Watson, at least in that department. Melvin Gordon and Austin Ekeler are averaging a robust 5.4 and 5.8 yards per tote. Give the Bolts' offensive line a ton of credit, as Rivers is only being sacked 1.3 times per game. Think the Chargers' pass protection will be the difference.Arizona Cardinals 28, Oakland Raiders 144:05 p.m. ET (CBS) | State Farm Stadium (Glendale, Ariz.)The Raiders put up more of a fight last week against the Chargers than they did against the Niners 10 days prior. The Cardinals gave the Chiefs plenty, and then some, before ultimately being done in by an errant screen pass. Tough miscue from Josh Rosen, but even Hall of Fame quarterbacks get picked by savvy linebackers like Justin Houston reading a screen every so often. The kid is showing flashes, even if he's not generating the kind of fawning praise surrounding his opponent in Kansas City, Patrick Mahomes. Remember, Mahomes sat on the bench and learned from an erudite player in Alex Smith for 16 weeks before playing as a rookie. Ugly parts for Rosen: He has suffered too many giveaways, and Arizona still isn't getting the ball down the field enough (only 12 percent of his pass attempts travel 20-plus yards), where his completion percentage is low, resulting in sub-mediocre 6.2 yards per attempt. Bright side: The Cards got David Johnson heavily involved, successfully, last week. Smelling a Jared Cook fantasy bonanza.New Orleans Saints 38, Philadelphia Eagles 264:25 p.m. ET (FOX) | Mercedes-Benz Superdome (New Orleans)\nThis Eagles' offense, as compared to what it was during their Super Bowl season, is ... shall we say ... less than stellar. The run defense seems to have declined, as well. Philadelphia couldn't stop Ezekiel Elliott, even with a depleted Cowboys offensive line. That Dallas unit was without All-Pro center Travis Frederick and rookie OG Connor Williams, while All-Pro OG Zack Martin was playing hurt. Still, Philly couldn't thwart Zeke. That means it's going to be tough sledding against Mark Ingram and Alvin Kamara. The Eagles' secondary is depleted, and it looked that way versus the Cowboys. Going from Dak Prescott to Drew Brees, with Ronald Darby out and Jalen Mills still hobbled by a foot injury ... oh, boy. Facing Brees is not timely at best, disastrous at worst. If the Eagles find themselves in the game in the fourth quarter, Doug Pederson and Jim Schwartz will deserve much credit.Chicago Bears 24, Minnesota Vikings 208:20 p.m. ET (NBC) | Soldier Field (Chicago)Dove into this game on the set of \"The Power Rankings Show\" (shameless plug: Tuesdays at 6 p.m. ET on NFL Network), with my colleague James Jones explaining why we haven't seen more from Jordan Howard in the Bears' offense. Jones feels that Matt Nagy's primary focus is to show the defense something different every play, starting with formations, which can negate consistently running the ball downhill. Save for some truly special running backs, most ball carriers need the consistency of touches to get into a rhythm. Which brings us to the other side of this equation: How much balance can Dalvin Cook provide the Vikings' offense? Khalil Mack got after Matthew Stafford last week. He looks fully healthy after missing a couple games. If there is a weak link to this Minnesota team, the offensive line is it. Kirk Cousins has been sacked 24 times this season (ninth-most in the league). By the way, the Vikes have secured 31 sacks of their own (tied for the league lead), so Mitch Trubisky's mobility will be paramount in this game.Los Angeles Rams 42, Kansas City Chiefs 388:15 p.m. ET (ESPN) | Los Angeles Memorial Coliseum (Los Angeles)Well, what was once an international game has become a home affair for the Rams. A lot of folks watching this game will be concerned about the Chiefs' defense facing perhaps the most dynamic offense in the league. The Rams rank first in net yards per pass attempt (8.6), first-down efficiency (percent of plays gaining four or more yards), 10-yard plays (183), lowest percentage of drives going three-and-out (8.2) and pass plays going for 20 or more yards (50). They are so effective on first down that the success makes the whole operation manageable for Jared Goff. The Chiefs also rank 31st in stopping offenses from gaining 4-plus yards on first down. Thus, at least in this game, first down will be more important than third down. That is a pro football rarity. The Chiefs will be asking a lot of Patrick Mahomes. Look for Andy Reid to call for several designed roll-outs and misdirection plays to neutralize, or at least tame, Aaron Donald's impact.Green Bay Packers 27, Seattle Seahawks 238:20 p.m. ET (FOX/NFL Network/Prime Video) | CenturyLink Field (Seattle)The Packers head into Seattle, where they've played a few humongous games over the years. The 2014 NFC Championship Game immediately springs to mind. Then there was the 2012 \"Fail Mary\" game, when Golden Tate shoved his way into NFL history. If Green Bay is to flip the script and win this time around, then repeating last week's successful performance on the ground -- when they racked up 195 yards versus the Dolphins -- is the ticket. If not, that Seattle crowd will have more of an impact, while the league's seventh-ranked pass defense will be able to employ more personnel on the back end. And the Seahawks' top-rated ground game will win the day. Aaron Jones went an average of 6 yards before inducing contact against Miami, per Pro Football Focus. How about that Packers offensive line?Follow Elliot Harrison on Twitter @HarrisonNFL.\nMore News >\nMore Videos >More Photos >More Gear >"}