{"id": "Injuries: Cardinals' Josh Rosen (toe) in walking boot", "paragraph": "  \nThe Arizona Cardinals are in a wait-and-see mode with rookie quarterback Josh Rosen. Rosen, who suffered a sprained toe on the Cardinals' final offensive play Thursday night, is in a walking boot, NFL Network Insider Ian Rapoport reported. Rapoport adds Rosen doesn't believe the toe injury is considered serious and coach Steve Wilks said the team believes he'll be able to play on Oct. 28 against the San Francisco 49ers.The Cardinals' rookie signal-caller endured a beating in Thursday night's 45-10 loss to the Denver Broncos, as the defense sacked Rosen six times and recorded 10 quarterback hits. Denver's final sack of the night occurred at the 2-minute warning and resulted in Rosen's injury. The fallout from Arizona's loss extended beyond Rosen's injury Friday morning, as theCardinals fired offensive coordinator Mike McCoy. Here's other injuries we're tracking on Friday:1. Buffalo Bills coach Sean McDermott said quarterback Josh Allen (elbow) and Taiwan Jones (neck) have been ruled out for Sunday's game against the Colts.\n2. Minnesota Vikings running back Dalvin Cook will miss his fourth game in five weeks because of a hamstring injury, coach Mike Zimmer said.3. Chicago Bears linebacker Khalil Mack (ankle) is listed as questionable against the Patriots.4. Philadelphia Eagles coach Doug Pederson said cornerback Jalen Mills, who was added to the injury report Thursday with a hamstring, is \"fine\" and good to go. Defensive tackle Haloti Ngati (calf) is still day-to-day. Running back Darren Sproles (hamstring) could practice next week. Pederson also said that he expects to have both offensive tackles Jason Peters and Lane Johnson on Sunday.5. Los Angeles Chargers wideout Travis Benjamin (foot) and kicker Caleb Strugis (quad) are both listed as questionable vs. the Titans.6. Tennessee Titans guard Quinton Spain (shoulder) and safety Kenny Vaccaro (elbow) are questionable vs. the Chargers.7. Denver Broncos safety Darian Stewart's neck injury is not believed to be serious, Rapoport reported. The Broncos believe running back Royce Freeman has a high-ankle sprain but he is scheduled to undergo an MRI later Friday. Vance Joseph said later Friday that his injury is day-to-day and they're optimistic that he can play against the Chiefs next week, according to 9News. Wideout DaeSean Hamilton has an MCL sprain and is expected to miss time.8. Dallas Cowboys linebacker Sean Lee is set to return after missing three games because of a hamstring injury. Lee was a full participant in practice Friday. Wide receiver Tavon Austin will not have surgery at this time after getting a second opinion on his groin injury. He could, however, miss a few weeks, per the team.9. Cincinnati Bengals running back Giovani Bernard (knee) and center Billy Price (foot) will not play in Sunday's game against the Chiefs. Safety Shawn Williams (elbow) is listed as questionable.10. The Jacksonville Jaguars officially ruled out running back Leonard Fournette (hamstring) for Sunday's game against the Houston Texans. Fournette will miss his third straight game. Cornerback D.J. Hayden (toe) also won't play and defensive end Calais Campbell (ankle/hip) and cornerback Tre Herndon (hamstring) are each questionable.11. New York Jets cornerback Buster Skrine (concussion) won't play Sunday against the Minnesota Vikings. Cornerback Trumaine Johnson (quad) and wide receiver Terrelle Pryor (groin) are doubtful. Running back Isaiah Crowell (foot) was limited Friday and is questionable for the game.12. Washington Redskins coach Jay Gruden said wideout Jamison Crowder (ankle) is officially out vs. the Cowboys. Fellow wide receiver Paul Richardson, Jr. (shoulder/knee) is doubtful. Running backs Chris Thompson (rib/knee) and Adrian Peterson (ankle/shoulder) are questionable.13. Indianapolis Colts wide receiver T.Y. Hilton (chest/hamstring) is no longer on the injury report and was a full participant in practice Friday. Colts tight end Erik Swoope (knee) is listed as questionable against the Buffalo Bills.14. Tampa Bay Buccaneers defensive end Vinny Curry (ankle) and defensive tackle Gerald McCoy (calf) have been ruled out vs. the Browns.15. Philadelphia Eagles linebacker D.J. Alexander (quadricep), safety Corey Graham (hamstring), linebacker Nathan Gerry (ankle), cornerback Sidney Jones (hamstring) and running back Darren Sproles (hamstring) have been ruled out vs. the Panthers.16. Cleveland Browns cornerback E.J. Gaines (concussion), wideout Rashard Higgins (knee) and linebacker Joe Schobert (hamstring) have been ruled out vs. the Buccaneers.17. Detroit Lions running back Theo Riddick (knee) has been ruled out. Defensive end Ezekiel Ansah (shoulder) and guard T.J. Lang (concussion) are questionable.18. Houston Texans wide receiver DeAndre Hopkins is off the injury report after being limited in practice all week with a foot injury. Offensive lineman Zach Fulton (ankle) is questionable and cornerback Aaron Colvin (ankle), tight end Ryan Griffin and cornerback Shareece Wright (shoulder/hand/groin) are all out.19. New England Patriots tight end Rob Gronkowski (ankle/back), defensive tackle Malcom Brown (knee), and wideouts Julian Edelman (heel) and Josh Gordon (hamstring) are listed as questionable against the Bears. Offensive tackle Marcus Cannon has been ruled out with a concussion.20. Kansas City Chiefs safety Eric Murray (ankle) and linebacker Tanoh Kpassagnon (ankle) are each questionable for Sunday's game against the Bengals. Center Mitch Morse (concussion) has been ruled out and safety Eric Berry (heel) and linebacker Justin Houston (hamstring) are listed as doubtful.21. San Francisco 49ers wide receiver Pierre Garcon (shoulder, knee) and cornerback Richard Sherman (calf) are questionable to play against the Rams. Wide receiver Dante Pettis (knee) will not play and cornerback Jimmie Ward (hamstring) is listed as doubtful for the game.\nMore Posts\nPhoto Essay\r\n"}