{"id": "Chad Kelly released by Broncos day after arrest", "paragraph": "  \nThe Denver Broncos aren't giving Chad Kelly another chance. The Broncos released backup quarterback Chad Kelly on Wednesday following his arrest on suspicion of first-degree criminal trespassing on Tuesday.Mike Klis of KUSA in Denver first reported the development.The team later announced the move. \"This was a decision that we made as an organization,\" Broncos general manager John Elway said in a statement. \"After reviewing all the information and in talking with [coach] Vance [Joseph] and [Broncos president] Joe [Ellis], we agreed that releasing Chad was the right thing to do.\"Even though Chad's no longer part of our team, we've offered to help him however we can and are supportive of him in every possible way.\"According to a news release from the Englewood (Colo.) Police Department, Kelly stands accused of illegally entering a home before being chased out. A short time later, officers searching the area spotted a man matching the suspect's description inside a black SUV. The man, identified as Kelly, was then placed under arrest. Kelly posted a $2,500 bond and was released from custody.NFL Network's James Palmer added that prior to the arrest, Kelly was involved in a physical altercation with a guest while attending a party hosted by Broncos teammate Von Miller on Monday night. He also got into an altercation with security at the party while being escorted out. From what I've gathered, Broncos players are not happy with Chad Kelly. They're upset he behaved to a level that required him to be escorted out of at a party that is meant to bring the team together and has been going on for a several years now.Kelly fell to the seventh round of the 2017 NFL draft due to injury and a litany of off-field issues that plagued him throughout his college career, including being dismissed from Clemson in 2014. Following an altercation outside of a Buffalo nightclub in 2014, Kelly was charged with resisting arrest, menacing, and several other counts, for which he served 50 hours of community service as part of the non-criminal charges. Kelly's latest criminal issue ended his run in Denver. The backup quarterback could have been weeks away from getting a shot on the field. With Case Keenum's up-and-down play to open the season, fans began to call for Kelly, who impressed during the preseason, to get a chance. Alas, the 24-year-old's off-field actions now wipe out that possible opportunity. The Broncos will roll with Kevin Hogan behind Keenum. \nMore Posts\nPhoto Essay\r\n"}