{"id": "Packers trade running back Ty Montgomery to Ravens", "paragraph": "  \nTy Montgomery's final act in a Green Bay Packers uniform was a fumble that cost Aaron Rodgers a shot at a comeback win against the undefeated Los Angeles Rams. The Packers shipped the running back to the Baltimore Ravens. The return for Montgomery: a seventh-round pick in 2020, per NFL Network Insider Ian Rapoport. \nThe ham-sandwich compensation is a clear indication the Packers were looking to move on from the running back following Sunday's blunder. Given the price, it seems he likely would have been cut had the Packers not found a buyer. Montgomery gets shipped out after the fumble in which he appeared to defy a directive from coach Mike McCarthy to down the ball in the end zone on a kickoff with two minutes remaining. Instead, Montgomery brought the ball out and proceeded to fumble, which wiped out any chance for a comeback. After the game, several Packers players told NFL.com's Michael Silver that Montgomery was seen throwing a tantrum on the sideline after being taken out of the game on a preceeding possession. The theory being that Montgomery disobeyed the coaching command out of spite. \"They took him out (the previous drive) for a play and he slammed his helmet and threw a fit,\" the unnamed player told Silver. \"Then (before the kickoff) they told him to take a knee, and he ran it out anyway. You know what that was? That was him saying, 'I'm gonna do me.' It's a f------ joke.\" Montgomery denied those claims Monday. Tuesday's trade will lead most to believe the unnamed player. \nShipping out the former receiver-turned-running-back provides a needed streamlining to the Packers backfield. Juggling Montgomery, Aaron Jones and Jamaal Williams became an onerous operation for the offense. No back could fully get into a groove. Jones should now see more touches, which he rightly deserves. The second-year back has pop and an incredible first step to turn small gains into chunk plays. Williams and Jones should now split carries with Montgomery gone. For the Ravens, they'd been looking for RB help, per NFL Network Insider Ian Rapoport. They found a modicum of it in Montgomery. With Alex Collins as the lead early-down rusher, Montgomery will likely eat into Buck Allen's pass-catching snaps. Montgomery brings a needed dimension to the Ravens backfield with his dual-threat ability. After the past week, a fresh start can't hurt. \nMore Posts\nPhoto Essay\r\n"}