{"id": "NFL trade deadline tracker: Who's been traded?", "paragraph": "  \nThe NFL trade deadline has passed. Here's a rundown of the notable trades that have been completed since the start of the season along with players who've been drawing interest in the trade market, according to NFL Network Insider Ian Rapoport and NFL Network's Tom Pelissero, Mike Garafolo and Mike Giardi.OCTOBER 30Redskins receive:S Ha Ha Clinton-DixPackers receive:2019 fourth-round pickOCTOBER 30Rams receive:DE Dante FowlerJaguars receive:2019 third-round pick, 2020 fifth-round pickOCTOBER 30Ravens receive:RB Ty MontgomeryPackers receive:2020 seventh-round pickOCTOBER 30Texans receive:WR Demaryius Thomas; 2019 seventh-round pickBroncos receive:2019 fourth-round pick; 2019 seventh-round pickOCTOBER 30Eagles receive:WR Golden TateLions receive:2019 third-round pickOCTOBER 24Lions receive:DT Damon HarrisonGiants receive:\n2019 fifth-round draft pickOCTOBER 23Saints receive:CB Eli AppleGiants receive:2019 fourth-round draft pick; 2019 seventh-round draft pickOCTOBER 22Cowboys receive:WR Amari CooperRaiders receive:\n2019 first-round draft pickOCTOBER 20Jaguars receive:RB Carlos HydeBrowns receive:2019 fifth-round draft pickSEPTEMBER 18Patriots receive:WR Josh Gordon, 2019 seventh-round draft pickBrowns receive:2019 fifth-round draft pick\nDeSean Jackson: Tampa Bay's Pro Bowl receiver recently requested a trade from the Bucs as Jackson hopes to find a team that can better make use of his talents. The team has refused to grant him that request, but that hasn't stopped teams from reaching out to the Bucs. Jackson, 31, is making $11 million this year.Karl Joseph: It's clear that coach Jon Gruden is willing to part ways with anyone -- anyone -- who doesn't fit in his vision for the Oakland Raiders. The safety has struggled to live up to his first-round pick pedigree, and Gruden would probably be more than happy to part ways with him for a late-round pick. Joseph is finally healthy after missing three games with a hamstring injury, which will make a potential trade easier.Pierre Garcon: The San Francisco 49ers wide receiver has struggled with injuries, but he could provide a boost of veteran leadership to any locker room in need of depth at wideout. With the 49ers looking ahead to next season, a late-round pick would provide good value for a receiver who's tallied 230 yards on 21 catches this year.Seth DeValve: With former first-round pick David Njoku providing plenty of pass-catching talent to make DeValve's role somewhat redundant in the Browns' offense, Cleveland was willing to part ways with the 25-year-old. The tight end has struggled with some injuries this season, but he could offer an attractive trade option for a team looking for a tight end.Jamie Collins: Another slow start has made Collins an expendable asset for the Browns. The veteran linebacker could help shore up a defense in need of veteran leadership, and his contract doesn't hold any guaranteed money beyond this season. With the Browns in pick-harvesting mode, it makes sense Collins would be drawing interest.Trevor Davis: Green Bay's depth at wide receiver has made Davis a potential trade option if teams are convinced he can provide value once he comes off injured reserve because of a hamstring injury. The 25-year-old is in the final year of his rookie contract and could provide value for a team looking for receiving depth or help on special teams.\nSam Bradford: The Arizona Cardinals veteran quarterback has been inactive since losing his starting role to rookie Josh Rosen. While Bradford's health is always a concern, he could be an option for teams desperate for a change at quarterback in order jump-start their seasons -- or for any team just looking for a decent backup.Deone Bucannon: If Cardinals general manager Steve Keim was indeed willing to part ways with some of his best assets in order to build for the future, Bucannon should've receive plenty of interest. The blitzing specialist, who's set to be a free agent in March, can add instant pass-rushing street cred to any team looking to improve their QB hunting capabilities in the second half of the season and beyond.Janoris Jenkins: Giants general manager Dave Gettleman has made it clear no one is safe from being traded after parting ways with Damon Harrison and Eli Apple last week. The veteran cornerback hasn't had the best of seasons, but he's definitely worth a trade if a team needs some secondary help.Tyrod Taylor: With the Browns clearly not concerned with pacing Baker Mayfield's development as a starter, the team is looking to get some value out of Taylor. For his part, Taylor wasn't ruling out a potential trade before the deadline, but who would take a chance on him? Perhaps he could be a good fill-in for rookie Josh Allen in Buffalo before assuming a mentor role. Perhaps he's a short-leash option for Jacksonville if Blake Bortles can't turn things around.Bruce Irvin: The Raiders hope to land a late-round pick for the veteran outside linebacker, who has tallied three sacks and six tackles so far this season. The 30-year-old is entering the final year of his contract and is set to make $9 million next year on his current deal.\nMore Posts\nPhoto Essay\r\n"}