{"id": "Week 9's key characters: Steelers need James Conner to stay hot", "paragraph": "  \nWe hang at the midpoint.In the world of screenwriting, the halfway mark of a story is widely viewed as the point of no return.The moment when our hero moves from a world of reaction to action.In \"Star Wars,\" the midpoint comes when Luke Skywalker and friends hit upon Alderaan, only to find that Alderaan has been blown into 10 billion pieces. It's then when the Millennium Falcon is caught in the Death Star's tractor beam, pulled toward an unchangeable fate.The point of no return. It's where 32 teams find themselves -- dug in deep -- with the trade deadline come and gone; with the leafy days of September and October in the rear-view mirror; and with the stretch run laid out ahead toward February's final act.With half our story still untold, let's look at who matters most in the chapter that comes next -- Week 9:Packers rookie cover man Jaire Alexander: Cornerback Denzel Ward has received plenty of credit for his rookie season in Cleveland, but don't look past the work of Alexander, Green Bay's surging first-round cover man.Despite missing time due to a groin injury, the No. 18 overall selection has thrived in Mike Pettine's scheme this autumn as arguably a top-10 talent at his position. Alexander took on Brandin Cooks last Sunday, breaking up a whopping five passes, the most by a Green Bay defender since 2005. Currently rolling as the  highest-graded rookie corner around, per Pro Football Focus, Alexander is turning heads inside the locker room:Interesting nugget from locker room, Davante Adams made it a point to talk to Jaire Alexander this week to \"let him know how much of a player he is.\"\"Because I know what that did for me as a young guy hearing it from Aaron and him letting me know that 'nobody can guard you'\"Alexander also caught the eye of Patriots coach Bill Belichick, who raved about the former Louisville star ahead of Sunday's clash with Green Bay:\"This guy is a really good football player, and I think he's got a great future in this league,\" Belichick said of Alexander earlier this week. \"I think he'll be one of the top corners in the game for quite a while here.\"Patriots runner James White: Alexander will be tasked with handling a Patriots scheme that recreates itself on a weekly basis. One game it's Gronk leading the way, the next it's Julian Edelman. Of late, Tom Brady has leaned heavily on White, New England's high-volume, pass-catching back who leads the club in receptions, receiving yards and scores through the air.\nWith Sony Michel (knee) back at practice after sitting out last week, New England is likely to have more help in a banged-up backfield that asked wideout Cordarrelle Patterson to lead the way Monday night against the Bills. The real story here, though, is White.The hero of Super Bowl LI is averaging 8.2 grabs per game over the past five weeks and will certainly play a major role against Green Bay's defense. Pettine knows he must get to Brady in manic fashion, leaving the Patriots passer to do what he's happily done all year: find White -- arguably the team's most important player on offense outside of the quarterback -- for catch-and-run opportunities in open spaces. It's the matchup to watch come Sunday night.Steelers backfield whirlwind James Conner: Todd Gurley and Adrian Peterson operated as luminaries in Week 8, but I'd quickly put Conner's handiwork alongside them. While Le'Veon Bell takes in games from the couch, Pittsburgh's starting runner has surpassed all expectations. Conner blasted the Browns for 212 yards on 29 touches after torching them for 192 yards in the season opener. The fallout in Cleveland was steep, as Hue Jackson became the sixth straight Browns coach to be fired after a loss to the Steelers.The task for Pittsburgh grows tougher on Sunday against a Ravens team that held Conner to just 19 yards rushing in Week 4. That was then, but the Steelers' back is humming today, leading the NFL with 122.3 ground yards per game since Week 5 and topping all players at his position by forcing a missed tackle on 28.9 percent of his touches, per Pro Football Focus.This matchup is massive as the Steelers can move to 5-2-1 with a win while burying the Ravens at 4-5. Conner's productivity sits at the center of Pittsburgh's fate.Bears coach Matt Nagy: There's plenty to like about Chicago's first-year coach. The Bears are interesting for the first time in eons thanks to a powerful, smothering defense -- but also because of Nagy's abilities as a next-level play-caller.\nThe Bears sit atop the NFC North with an excellent chance to keep rolling. Their next four games include two tilts against the Lions, one against the Vikings and Sunday's bout with the Bills. It's easy to peer past Buffalo with three divisional showdowns ahead, but ask Minnesota about peering too far ahead.The Vikings were slammed by the Bills in Week 3 before Buffalo surprised the Titans two weeks later. Buffalo's offense is the worst we've seen in decades, but this defense can get to the quarterback. It's up to Nagy to keep his Bears players ultra-zoned-in to prevent the dreaded trap game from unfurling at the worst time of all.The next month is critical for a Bears team clinging to playoff aspirations in a crowded and rowdy NFC.New Orleans quarterback-annoyer Cameron Jordan: Let's go back for a second to Pettine, whose Green Bay defense hit Rams passer Jared Goff 20 times last Sunday, per Pro Football Focus, with five sacks on the afternoon. The Packers still gave up 29 points in that agonizing loss, a reminder that Los Angeles can be rattled and still unfurl a waterfall of yardage and points.This week's opponent, the high-flying Saints, must make life uncomfortable for Goff. The pressure falls on pass rusher Cameron Jordan, who will shoulder the load after talented rookie Marcus Davenport was ruled out for up to a month with a toe injury. The first-rounder piled up two sacks in last week's win over the Vikings and would have been a factor against the Rams. Instead, Jordan and Sheldon Rankins will be asked to handle the task, something they should be ready for after making life unbearable last Sunday for Minnesota's Kirk Cousins.Jordan must also help against a Rams ground game that can wipe you out at any moment as Gurley continues his MVP-worthy campaign. The Rams topple teams in so many different ways. Nobody's found a method for slowing them down. The matchup between Rams coach Sean McVay and Sean Payton of the Saints is what we've been waiting for all along. All eyes will go to these two brilliant attacks, but the game itself is bound to boil down to which defense can cause mistakes and dish out lasting punishment.There's no better time for Jordan to arise.Follow Marc Sessler on Twitter @marcsesslernfl. Listen to Marc on the \"Around The NFL Podcast\" three times a week.\nMore News >\nMore Videos >More Photos >More Gear >"}