{"id": "Debrief: Dysfunction rattles Browns again; NFC tightens up", "paragraph": "\nGregg Rosenthal catches you up on everything you need to know as we turn from Week 8 to Week 9.The Browns made the move on Oct. 29 that looked obvious on Jan. 1. Hue Jackson is no longer the Browns' coach, and and it's fair to wonder if the entire organization delayed yet another rebuilding plan for a season just because they couldn't bear to push out Jackson, a fine man by all accounts, on a 17-game losing streak last offseason.The situation between Jackson and offensive coordinator Todd Haley was untenable. NFL Network Insider Ian Rapoport reported Monday that Haley was \"not listening\" to Jackson and \"doing his own thing.\" Owner Jimmy Haslam was believed to be among those \"leaning toward\" keeping Jackson over Haley entering Sunday's game against the Steelers, but ultimately both Jackson and Haley were let go, with defensive coordinator Gregg Williams stepping in as interim head coach. The decision to fire both squabbling parties of a power struggle sounds familiar in Cleveland.This type of dysfunction has been visible to the public with greater frequency since Haslam became the owner midway through the 2012 season, and this latest episode raises questions about whether the organization has learned from its previous mistakes. Haslam has fired coaches Pat Shurmur, Rob Chudzinski, Mike Pettine and Jackson, in addition to executives Mike Holmgren, Tom Heckert, Joe Banner, Michael Lombardi, Ray Farmer and Sashi Brown. It's been a long six years.\nThe Browns appear to have found a good GM in John Dorsey and they have one of the most promising young quarterbacks to enter the league this decade in Baker Mayfield. They have a few extra picks in next year's draft, although all the premium selections that Sashi Brown built up have been used. Myles Garrett, Denzel Ward, Larry Ogunjobi and Emmanuel Ogbah form the core of a talented playmaking defense, but it's worth remembering they will be learning a new defensive scheme next year after Williams is presumably shown the door.Mayfield's presence undoubtedly makes everything better. Mayfield is the perfect point guard to execute some of the wide-open offensive innovations taking the league by storm, and he should make life easier on the next head coach. After all the \"new regime\" press conferences Browns fans have been subjected to over the last six seasons, however, it's fair to doubt the organization's ability to get the next decision for franchise savior right. Especially when they wasted everyone's time after punting out of bounds once again last Jan. 1.Marcus Davenport makes the Saints' defense scarier.There is at least one play every week in which rookie Saints defensive end Marcus Davenport makes it look unsafe for opponents to operate in his vicinity. On one of his two sacks Sunday night in Minnesota, Davenport appeared to use Kirk Cousins as a shovel to dig the Vikings' grave into the field turf. \nSaints defensive tackle Sheldon Rankins added two sacks of his own on Sunday night. The Saints' defense still starts with Cameron Jordan, who is back to playing at his All-Pro level. But the increased impact of Davenport and Rankins helps round out an improving Saints front seven.Consider it a very scary notion for the rest of the NFC that the Saints only required 120 yards from Drew Brees to win comfortably on the road. After also winning in Baltimore, the Saints can relax back at home this week ... against the Rams.The NFC contender gauntlet is here.The Rams face the next two hottest NFC teams over the next two weeks (the Saints and Seahawks) before heading to Mexico City for a matchup with the Chiefs in Week 11. Seattle's four November games do not feature a single opponent with a losing record, including a three-game slalom against the Rams, Packers and Panthers. The Packers are part of the Vikings' stretch of three straight NFC North contests, before Minnesota has road games in New England and Seattle. The Lions' next five games are against NFC foes with winning records. In short: A lot of the best games and drama in the NFC race will happen in the third quarter of the season, with the Rams-Saints in Week 9 setting the table for the battle for home-field advantage. Blake Bortles is far from the only problem in Jacksonville.After a week of Blake-bashing, reality set in during Jacksonville's 24-18 loss to the Eagles in London. Even when Bortles gives the team an above-average effort (24 of 41 for 268 yards with one touchdown and zero picks), this team has plenty of other issues. The offensive line hasn't played well, which happens when a team is on its third-string left tackle. The record-setting contract given to guard Andrew Norwell hasn't paid dividends. The team's receivers dropped five passes Sunday, including a potential touchdown. Keelan Cole fumbled a ball away for the second time in three weeks. The secondary, ravaged by injuries, hasn't been a difference-making group. Even All-Pro corner Jalen Ramsey was beaten by Alshon Jeffery a few times on key third downs and doesn't rank among the top-30 at his position, according to Pro Football Focus.\nWith the game on the line late in the fourth quarter, the Jaguars' offense faced six short-yardage situations near midfield. They called six straight pass plays, which resulted in five incompletions and one successful scramble by Bortles. This is the Jaguars team of coach Doug Marrone's nightmares, too fearful to run the ball in clear running situations and overly reliant on Bortles to make plays. The defense has played good, but not great. Like every defense in 2018, they can't be trusted to get a stop when they absolutely need it. Now 3-5 on a four-game losing streak, making the playoffs will be a steep uphill climb for a team that appeared to have won its Super Bowl in Week 2. The Steelers' defensive improvement is sticking.After a miserable start to the season, the Steelers held the Falcons to 17 points in Week 5 and then held the Bengals and Browns to 512 yards combined. It's a small sample size, but the Steelers have given up the fewest yards per play of any team in football over their last three games. Baker Mayfield threw for 107 yards before a meaningless late touchdown drive in Week 8. Stephon Tuitt was on fire against Cleveland, leading a deep Steelers front seven, and the secondary is no longer giving up big plays, perhaps because Mike Tomlin is no longer giving snaps to cornerback Artie Burns.No one expects this group to be the Steel Curtain against the other AFC contenders. They just need to be good enough and let the offense carry the day, which is essentially the same formula that the other top AFC teams, like Kansas City, New England and Los Angeles, are using. The Steelers are right back on track. Whether the improved Seahawks will make the playoffs.The Seahawks are not the team they were a season ago, when the defense was stuffed with name brands. They are not even the team they were five weeks ago, before weaknesses that calcified into cliches turned into strengths. They are one of the best 10 teams in the NFL.\nThe Seahawks are 4-1 over their last five games, outscoring opponents 99-47 in their four wins. The team's one loss in that stretch was a two-point defeat to the Rams, perhaps the most valuable loss in the NFL this season. The Seahawks left that game understanding they weren't so far away from their goals, especially on offense.The offensive line is no longer a weakness. While it helps the team's pass protection that Russell Wilson has barely averaged 20 attempts per game over the last three weeks, the team's run blocking is undeniably now a strength. Wilson's hit rate on his shot plays each week rivals that of Patrick Mahomes, as does Wilson's touchdowns-per-throw mark (8.8 percent, with Mahomes putting up a league-high 9.1 percent). Chris Carson and Mike Davis are the rugged running combination Pete Carroll didn't see coming, while first-round pick Rashaad Penny gathers dust on the bench. Coordinator Brian Schottenheimer is helping. Getting rid of former offensive line coach Tom Cable may have helped even more. A thin receiver group has been buoyed by the emergence of 2017 seventh-rounder David Moore (11 catches for 221 yards and four scores), the return of Doug Baldwin, the benching of Brandon Marshall and a career year in progress by Tyler Lockett (25 catches for 394 yards and six touchdowns). Like nearly every position on the team, the receivers were more physical than their Lions counterparts during Sunday's convincing road win.Seattle has a brutal stretch of quality opponents coming up, but the overall schedule is favorable when viewed through a different prism. The Seahawks host six of their final nine games at home in front of a dangerously attached crowd that must be thrilled the Pete Carroll party was just given a second life.The return of linebacker K.J. Wright on Sunday added a level of familiarity to an unheralded defense that is showing off Carroll's coaching chops. Safety duo Bradley McDougald and Tedric Thompson are playing above their heads. I don't know if the Seahawks will survive their upcoming gauntlet and make the playoffs, but they are a better team that is more fun to watch than they were a year ago, when all those Super Bowl champion defenders were still on the roster. Whether Carson Wentz can keep this up.On Sunday, Wentz had one of the most impressive games possible, for a day that started with two turnovers. The Eagles' offense is starting to resemble the Seahawks offense of old in an uncomfortable way, counting on the quarterback to create third-down magic on his own in order to keep the ball moving. Losing right tackle Lane Johnson to a knee injury won't help matters. Wentz has been mostly up to the task thus far, playing at a level only a tick below his 2017 pace. At 4-4 heading into their Week 9 bye, the Eagles have a lot of issues to sort out around Wentz in a season full of bad injury luck on both sides of the ball. If the rest of the team and the coaching staff can raise their level, Wentz looks more than capable of picking up the slack. How much better Cam Newton's career would have been if he'd started working with Norv Turner earlier.\nThe Panthers' offense makes sense now when you watch it, which almost never was the case under former coordinator Mike Shula except for the brief brilliance of 2015. Even before general manager Dave Gettleman was fired in 2017, the plan was to stop loading up on plodding power-forward wide receivers and surround Newton with the type of speed threats that would make Cam even more difficult to defend.That vision is being realized. The best game of rookie receiver D.J. Moore's career on Sunday against Baltimore (five catches for 90 yards) should be a sign of things to come, with Christian McCaffrey and Curtis Samuel also providing big plays. This is the first season in Carolina since 2012 where the team's offense ranks higher in efficiency than the defense and most years the offense wasn't even close. With such young players surrounding Newton and offensive coordinator Norv Turner's scheme still taking shape, there is potential here to get a lot better. The South is easily the most likely NFC division to send two teams to the playoffs because the Saints and Panthers can win in so many different ways.Follow Gregg Rosenthal on Twitter @greggrosenthal.\nMore News >\nMore Videos >More Photos >More Gear >"}