{"id": "Injuries: Jimmy Graham suffered broken thumb in loss", "paragraph": "  \nThe mystery on the severity of Green Bay Packers tight end Jimmy Graham's thumb injury should be resolved soon. Graham suffered a fractured thumb in Thursday night's 27-24 loss to the Seattle Seahawks, NFL Network Insider Ian Rapoport reported. While it remains unclear if Graham can play through the injury, results from further testing will help shed light, Rapoport added.On the season, Graham ranks second on the team in receiving with 34 catches for 452 yards and two touchdowns on 57 targets.The Packers have tight ends Lance Kendricks, Marcedes Lewis and Robert Tonyan, who caught a 54-yard touchdown pass against the Seahawks, for depth behind Graham.Here are the other injuries we're monitoring ahead of Sunday's games:1. Baltimore Ravens quarterback Joe Flacco (hip) is listed as doubtful after not practicing this week, and coach John Harbaugh wouldn't rule him out from playing Sunday against the Cincinnati Bengals. Quarterback Lamar Jackson was practicing after missing Thursday's session with a stomach issue. Harbaugh wouldn't say Friday who he will start at QB this week.In addition, running back Kenneth Dixon (knee) has been designated to return off injured reserve. Safety Tony Jefferson (thigh), offensive tackle Ronnie Stanley (ankle), linebacker Tim Young (ankle) and cornerback Tavon Young (ankle) are all questionable. Offensive tackle James Hurst (back) is out.2. Jacksonville Jaguars cornerback A.J. Bouye is off the injury report and will play Sunday against the Pittsburgh Steelers after a calf injury sidelined him the last two games. Defensive tackle Marcell Dareus (triceps) and guard A.J. Cann (hamstring) are questionable. Cornerback Quenton Meeks (knee) won't play against the Steelers.3. Denver Broncos guard Max Garcia suffered a torn ACL in practice Thursday, a source told NFL Network's James Palmer. Linebacker Brandon Marshall (knee) and safety Dymonte Thomas (ankle) will not play vs. the Chargers.4. Tampa Bay Buccaneers offensive lineman Evan Smith suffered torn labrums in both hips and will undergo surgery, per Rapoport. Smith was place in injured reserve earlier this week. Wide receiver Chris Godwin (ankle) is questionable to play against the Giants. 5. Cincinnati Bengals running back Joe Mixon is off the injury report and should be good to go for Sunday against the Ravens. He was a limited participant in practice after missing Thursday's session because of a knee injury. Linebacker Vontaze Burfict (hip), cornerback Dre Kirkpatrick (concussion) and wide receiver John Ross (groin) are all questionable. Wide receiver A.J. Green (toe) is listed as doubtful.In addition, the team placed tight end Tyler Kroft (foot) on injured reserve.6. Atlanta Falcons kicker Matt Bryant (hamstring) will play Sunday against the Dallas Cowboys. Linebacker Deion Jones will not play this weekend as he nears a return from a foot injury that sent him to injured reserve at the beginning of the season.7. Washington Redskins wide receiver Jamison Crowder (ankle) and running backs Chris Thompson (ribs) and Samaje Perine (calf) will not play against the Houston Texans. Cornerback Quinton Dunbar (shin), left tackle Trent Williams (thumb) and kicker Dustin Hopkins (groin) are all listed as questionable.The Redskins activated running back Byron Marshall (knee) off of injured reserve and released wide receiver Brian Quick. 8. Los Angeles Rams coach Sean McVay said Friday that wide receiver Cooper Kupp underwent successful surgery to repair his torn ACL. McVay said the knee did not sustain any additional damage.9. Pittsburgh Steelers offensive tackle Marcus Gilbert (knee) and defensive end Stephon Tuitt (elbow) both have been ruled out for Sunday's game against the Jacksonville Jaguars. Running back James Conner (concussion) is off of the injury report, but he has not been officially cleared from concussion protocol.10. Philadelphia Eagles cornerbacks Ronald Darby (knee) and Jalen Mills (foot), tight end Joshua Perkins (knee) and running back Darren Sproles (hamstring) all have been ruled out for Sunday against the New Orleans Saints. Offensive tackle Lane Johnson (knee) and defensive tackle Haloti Ngata (knee) are both listed as questionable.The Eagles have activated tight end Richard Rodgers (knee) from injured reserve and placed tight end Joshua Perkins (knee) on injured reserve. On Saturday, they placed cornerback Ronald Darby (knee) on IR and activated cornerback De'Vante Bausby off the practice squad.11. Houston Texans cornerbacks Aaron Colvin (ankle) and Johnathan Joseph (ankle/knee), linebacker Zach Cunningham (knee) and wide receiver Keke Coutee (hamstring) are all questionable to play Sunday against the Redskins.12. Oakland Raiders wide receiver Jordy Nelson (knee) and wideout Martavis Bryant are out for Sunday's game against the Arizona Cardinals. Cornerback Gareon Conley (groin) is questionable.13. Tampa Bay Buccaneers defensive end Vinny Curry (ankle), linebacker Lavonte David (knee), safety Justin Evans (toe), running back Ronald Jones (hamstring) and cornerback M.J. Stewart (foot) all have been ruled out for Sunday's tilt against the Giants. Wide receiver Chris Godwin (ankle), center Ryan Jensen and defensive end  Carl Nassib (elbow) are listed as questionable.14. Dallas Cowboys wide receiver Tavon Austin (groin) and defensive end Taco Charlton (shoulder) are both out for Sunday against the Atlanta Falcons. Defensive tackle Maliek Collins (knee) and guards Zack Martin (knee) and Connor Williams (knee) are both questionable after being limited in practice.15. Detroit Lions wide receiver Marvin Jones (knee), tight end Michael Roberts (shoulder) and defensive tackle A'Shawn Robinson (ankle) will not play against the Carolina Panthers on Sunday. Defensive end Ezekiel Ansah (shoulder) is listed as questionable after being limited in practice.16. Carolina Panthers wide receiver Torrey Smith (knee) will not play against the Lions.17. Los Angeles Chargers cornerback Trevor Williams (knee) has been ruled out. Defensive end Joey Bosa (foot) and tight end Antonio Gates (knee) are both listed as questionable.18. Arizona Cardinals safety Budda Baker (knee) and wide receiver Chad Williams (ankle) will not play against the Raiders. Kicker Phil Dawson (right hip), safety Rudy Ford (heel), defensive tackle Rodney Gunter (not injury related), offensive lineman D.J. Humphries (knee), offensive lineman Mike Iupati (back) and defensive tackle Robert Nkemdiche (calf) all are listed as questionable. With Dawson questionable, the team signed kicker Matt McCrane on Saturday.19. New Orleans Saints defensive end Marcus Davenport (toe) and offensive tackle Terron Armstead (shoulder) have both been ruled out.20. Tennessee Titans running back David Fluellen (knee) and wide receiver Taywan Taylor (foot) will not play and wide receiver Tajae Sharpe (ankle) and guard Quinton Spain (ankle) are questionable.21. Indianapolis Colts safety Malik Hooker (hip, illness) was downgraded Saturday from questionable to out for Sunday's game against the Titans. Tight ends Ryan Hewitt (ankle) and Erik Swoope (knee) are each questionable.22. Minnesota Vikings linebacker Anthony Barr (hamstring) and guards Tom Compton (knee) and Mike Remmers (back) are questionable to play Sunday against the Bears. Safety Andrew Sendejo (groin) was ruled out.23. Kansas City Chiefs wide receiver Sammy Watkins (foot) is questionable for Monday's game against Los Angeles Rams after sitting out practice a second straight day Saturday. Center Mitch Morse (concussion) is out and safety Eric Berry (heel) is once again listed as doubtful.24. The Chicago Bears are activating tight end Adam Shaheen (ankle) off injured reserve with tight end Dion Sims heading to IR with a concussion, a source told NFL Network's Mike Garafolo.\nMore Posts\nPhoto Essay\r\n"}