{"id": "Cowboys fire OL coach Alexander, promote Colombo", "paragraph": "  \nThey aren't the Great Wall of Jones they were in 2016, and apparently, that's enough to warrant a termination.The Dallas Cowboys fired offensive line coach Paul Alexander on Monday, the team announced. Assistant OL coach Marc Colombo will replace Alexander, with Hudson Houck serving as an advisor to Colombo.\"While approaching the midpoint of the season, and going through an overall evaluation of our entire operation during the bye week, we felt that this move would serve the best interests of our team moving forward,\" Cowboys coach Jason Garrett said in a statement. \"We have great respect and admiration for Paul and what he has accomplished in a very successful career in the NFL. These are not easy decisions to make at any time of the year, but we will move ahead with the utmost confidence in what Marc Colombo and Hudson Houck will bring to our team in their new roles.\"Colombo, a 10-year NFL veteran with stops in Chicago, Dallas and Miami, has been in his role since 2016. That season, the Cowboys were selected as the league's best offensive line.That hasn't been the case this season, though fingers could probably point elsewhere to identify greater issues for the Cowboys than the offensive line.But someone has to take blame for a Cowboys team that is under increasing pressure, owning a 3-4 record and showing more discouraging play than positive through eight weeks. It's surprising that it falls on the shoulders of Alexander, though, seeing as the Cowboys feature the No. 2 rusher in the NFL in Ezekiel Elliott. Those arguing in favor of the firing can, of course, point to Dallas' sack total of 23. But we as a football society need to acknowledge that QB hits (and sacks) are also a quarterback sack (for more on why, click here).Dallas ranks 10th in the NFL in run blocking, and 16th in pass blocking through eight weeks, according to Pro Football Focus' grades. The Cowboys' rate of pressures allowed (26.6 percent) ranks right near the middle of the league.But it's true that this isn't the crushing offensive line of just a year or two ago. Dallas lost All-Pro center Travis Frederick to an autoimmune disorder before the start of the season, and was forced to fill a hole at left guard with rookie Connor Williams, who has exhibited expected struggles in his first season. Those are two rather large hurdles, and ones Dallas was at least weathering.When things aren't going right in the NFL, changes must be made -- even if it means creating a peculiar scapegoat at the end of Week 8.\nMore Posts\nPhoto Essay\r\n"}