{"id": "NFL to celebrate 100th season in 2019 with 'NFL 100' events", "paragraph": "  \nThe National Football League will celebrate its 100th Season in 2019 with a year-long series of \"NFL 100\" events, initiatives and programming centered around fans, players and communities, it was announced tonight.The historic and unprecedented celebration will salute the millions of fans who love the game; highlight the unifying nature of football and its positive impact in communities; bring together generations of past, present and future players; and look ahead to the NFL's next 100 years. In the coming months, information will be shared about national and local \"NFL 100\" plans and ways fans can join in the celebration.A special \"NFL 100\" logo, unveiled tonight during halftime of the Thursday Night Football game, will be prominently displayed throughout the 100th season -- during celebrations on the field, in stadiums, game broadcasts, NFL Films and NFL Network programming, and digital and social media content. In addition, the \"NFL 100\" logo will be featured on game balls and on every player's game jersey in the neck area. NFL business partners will also use the logo in activations and on an array of merchandise.\"For nearly 100 years, the NFL has been part of the fabric of America, unifying communities and bringing fans together to support their favorite teams and players,\" said NFL Commissioner Roger Goodell. \"We have the greatest fans in the world. Next year, we will join our fans in celebrating what this incredible game means to each of us.\"Additional Background\"NFL 100\" will officially kick off at Super Bowl LIII in Atlanta and will be featured during offseason events like the Draft in Nashville and enshrinement week at the Pro Football Hall of Fame in Canton. The celebration will ramp up during the lead-up to the Kickoff of the 2019 season in September and continue throughout the season, culminating at Super Bowl LIV in Miami.Among the planned celebratory programs:-- Weekends in local team markets will bring together high school football programs with fan festivals and NFL games that celebrate past, present and future players and coaches.-- A blue-ribbon panel of former players, general managers, coaches, NFL historians and media will select the All-Time Team and the 10 greatest coaches in NFL history. The All-Time Team and many other on-field accomplishments will be celebrated throughout next year.-- NFL Media -- including NFL Network and NFL Films -- will offer original programming and content to celebrate the 100th season across multiple platforms.\nMore News >\nMore Videos >More Photos >More Gear >"}