{"id": "What we learned from Sunday's Week 10 games", "paragraph": "  \nHere's what we learned from Sunday's Week 10 slate of games:1. The Cowboys survived a fourth-quarter scoring onslaught and last-second red-zone heave to pull even with the defending Super Bowl champions in the standings on Sunday night, thanks to a heavy dose of Zeke and clutch defensive play from their youngest stars. Though Dak Prescott had one of his more efficient games of the season, Dallas moved the ball best when Ezekiel Elliott was its carrier. Elliott rumbled for a near-season-high 151 rushing yards and scored two fourth-quarter touchdowns to seal the season-saving victory. Hurdling over defensive backs and hitting holes with ease, Zeke played in the spirit of his rookie campaign. On the other side of the ball, Leighton Vander Esch and Jaylon Smith made Cowboys fans forget for a game who Sean Lee was, filling in dutifully for the injured Dallas captain. Vander Esch's game-high 13 tackles and first career interception were the product of sideline-to-sideline hustle and exceptional speed. The rookie linebacker's best play of the night -- and there were many -- came on a third-and-2 with Philly driving to tie the game late in the fourth quarter. Vander Esch beat two Eagles blockers on a toss right to blow up Corey Clement for a five-yard loss when it appeared the Eagles back was headed past the sticks. Philly turned the ball over on downs on the following play, and a last-gasp six-play drive came up nine yards short. 2. Philadelphia's trade-deadline acquisition of Golden Tate didn't pay dividends out of the gate. The YAC master caught a ball on the Eagles' first drive and fielded punts in his debut, but saw just 18 offensive plays and four targets. Tate's lack of production didn't hinder Carson Wentz's play down the stretch. The Philly QB was bothered by Dallas' secondary in the early goings, especially by Chidobe Awuzie and Xavier Woods, but finished with 360 passing yards and two scores. Wentz's connection with Zach Ertz was as strong as ever. The tight end racked up a season-high 14 receptions for 145 yards and two scores and was Wentz's go-to target as Philly tried to tie this one up. An unstoppable red-zone threat, Ertz has recorded at least 10 receptions for the fourth time this season. But perhaps there lies the problem. When the Eagles went searching for a running game on Sunday evening, they couldn't find one. Save for one long run from Josh Adams, Philly averaged 2.8 yards per carry. The Eagles called just 16 rushing plays to 46 passing plays. Last season's Super Bowl-bound Birds boasted a compelling one-two punch of Jay Ajayi and LeGarrette Blount to hammer opponents. This season's Eagles have no such ground threat, rendering them unable to create manageable third downs or take pressure off of their injury-prone quarterback and offensive line. Below .500 with the league's second-toughest schedule remaining, the Eagles are no longer soaring toward the postseason. 3. Speaking of trade-deadline wideouts, Amari Cooper (75 yards) was just one of many Cowboys receivers to move the chains consistently against the Eagles. With Philadelphia missing three starters in the secondary for much of Sunday night (Sidney Jones, Jalen Mills, Ronald Darby), Dallas' maligned receivers fed on open spaces in the Eagles secondary. Cooper, Allen Hurns, Cole Beasley, Michael Gallup and Dalton Schultz each recorded two receptions and at least one of over 10 yards. The Cowboys picked up 14 first downs through the air and went 8-for-16 on third down. Prescott was sacked four times and hurried often behind an offensive line that was, for a time, short its two starting guards after Zack Martin exited briefly with a knee injury. But Martin returned in the second half, and with solid protection, Prescott played with confidence not seen since Dallas' mid-October demolition of Jacksonville. The 4-5 Cowboys will need more of that efficiency in the passing game if they want to stay in playoff conversation. -- Jeremy Bergman\n1. Rams running back Todd Gurley rebounded in emphatic fashion from Week 9's performance where the New Orleans Saints limited him to 79 total yards. Gurley proved once again as he goes, so goes the Rams' offense. The elite running back ran with authority against the Seahawks, pounding out 120 yards and a touchdown on 16 carries. Gurley ripped off chunks of yards, averaging 7.5 yards per carry, and produced 40 yards receiving on three catches for a complete game. Gurley also placed himself among some of the NFL's all-time greats by scoring a touchdown in his 10th straight game on the season. With his TD run in the 2nd quarter of today's game, @RamsNFL RB Todd Gurley (@TG3II) joins @ProFootballHOF Lenny Moore (1964), O.J. Simpson (1975) & Elroy \"Crazy Legs\" Hirsch (1951) as the only players in @NFL history with a TD in each of his team's 1st 10 games to start a season pic.twitter.com/x731WjUkf1With Gurley commanding attention in the running game, quarterback Jared Goff completed 28 of 39 passes for 318 yards and two touchdowns. Goff topped the 300-yard passing mark for the sixth time this season. Brandin Cooks paced the receiving corps with 10 catches for 100 yards, while Robert Woods chipped in with four catches for 89 yards. Cooper Kupp totaled five catches for 39 yards before leaving the game with a knee injury. The initial concern is that he suffered a torn ACL, NFL Network Insider Ian Rapoport reported. The Rams improved to 9-1 to setup a heavyweight matchup against the 9-1 Kansas City Chiefs in Mexico City on Monday Night Football. With a win over the Chiefs and a Seahawks loss this Thursday, L.A. can clinch a second consecutive NFC West title. 2. The Rams entered Week 10 with just 45 penalties on the season, the second-fewest in the league, and averaging five per game. But head coach Sean McVay's team was plagued with 10 uncharacteristic infractions, including five personal fouls, for 102 total yards against the Seahawks. Rams defensive end Dante Fowler, who accounted for a 15-yard facemask penalty and a 15-yard unsportsmanlike infraction, made up for his mistakes late in the game. Fowler came up big with a strip-sack on Seahawks quarterback Russell Wilson, and ultimately recovered the loose ball at Seattle's 9-yard line after it careened off players in the backfield. The Rams took advantage of the turnover on the very next play when Cooks sprinted into the end zone on a sweep to give the Rams a 36-24 cushion before holding on for the win. While the penalties didn't cost the Rams in what was a close game, the lack of discipline kept two Seattle drives alive and led to touchdowns. Los Angeles is well-coached, though, so Sunday could be anomaly and not cause for alarm. 3. Despite the loss, the Seahawks continue to send a message to the rest of the league to pack a lunch pail to face their offense. Seattle basically shrugged off a stout Rams defense en route to pounding out an eye-popping 273 yards rushing on the game, marking the sixth straight week the offense had 150 yards or more on the ground. Rookie Rashaad Penny led the way with a breakout game, totaling a career-high 108 yards rushing, adding a touchdown on 12 carries. Quarterback Russell Wilson, who completed 17 of 26 passes for 176 yards and three touchdowns, also had an exception contest on the ground, rushing nine times for 92 yards. Nevertheless, the loss dropped the Seahawks to 4-5 on the season, including two losses to the Rams in the NFC West. -- Herbie Teope\n1. While the football world remains fixated on that other Los Angeles team -- you know, the one with the dynamic offense, dual-threat running back and souped-up defense -- the Chargers are taking care of business and staking a legitimate claim as the most complete team in the Southland. The Bolts won their sixth game in a row Sunday afternoon, handling the Raiders with lethal patience. After Oakland held them to their first scoreless first quarter of the season, the Chargers stayed the course, feeding their beast (running back Melvin Gordon) and pulling away from the Raiders with two touchdowns on either side of halftime. The networks might gush over that Todd fellow from Thousand Oaks, but Gordon proved Sunday that he deserves as much if not more adulation. Gordon totaled 165 yards on 23 touches and made multiple Raiders miss on a game-sealing 66-yard TD catch-and-run. But his most impressive play of the day was a two-yard gain in the second quarter, when Gordon broke at least three tackles on a fourth-and-1 sweep left to extend what would be L.A.'s first scoring drive. As elusive as he is powerful, Gordon is the perfect avatar from this Chargers team. 2. Ten days of rest and self-reflection paid off for Oakland's defense, which put together its most complete, competent performance of the season against one of the league's most dangerous offenses. The Raiders held Los Angeles to its lowest point total this year and allowed a season-low 335 total yards, thanks to an improved pass rush and interior line play and less disastrous pass coverage. This was a marked improvement for Paul Guenther's guys after the Raiders laid down for Nick Mullens' 49ers on Thursday night and in the ensuing days released veteran pass rusher Bruce Irvin. Oakland sacked Philip Rivers just once but saw good pressure from Maurice Hurst, Shilique Calhoun and Clinton McDonald. The Raiders defense might be made up of spare parts, but they're making it work.Now if only Derek Carr and Oakland's sluggish offense had picked up the slack. The Raiders weren't so bad between the 20s, but shrunk when they entered L.A. territory. Oakland made five trips inside the Chargers' 30-yard line on Sunday and came away with just six points. The last venture toward L.A.'s end zone ended when Carr threw an attempted screen pass into the turf on fourth-and-5 with five minutes left in the fourth quarter and Oakland down two scores. This is a team, or at least a unit, resigned to its fate, which with seven games remaining in the season is a disservice to its supporters. Making matters worse, Martavis Bryant suffered what looked to be a season-ending knee injury, limiting Carr's options going forward to Jared Cook, Jordy Nelson and a sock puppet.3. Chargers special teams update. Back on the roster after a questionable hiatus, rookie kicker Michael Badgley made all four of his kicks in Oakland (two FGs, two XPs). He remains perfect on the season. The bad news? L.A. was schooled on a first-quarter fake punt run from Raiders rookie Johnny Townsend who scampered 42 yards down the left sideline at RB1 speed (20.48 mph, per Next Gen Stats) to extend an early drive. L.A. was thankfully bailed out by the Raiders' unimaginative red-zone play-calling later in the march. -- Jeremy Bergman\n1. The student took down the teacher Sunday in stunning fashion. In a game the Titans likely saw as a test of who and where they are, they passed with flying colors -- and left New England reevaluating things heading into the bye week. Mike Vrabel's defense harassed Tom Brady early and often, pressuring him almost relentlessly, getting a few breaks with some early miscues (Josh Gordon dropped passes, for example) and taking advantage of early stops. Tennessee came out of its corner swinging and landed a wallop of a punch on the Patriots, taking a 17-3 lead into the second quarter and slowly building on it from there. In the end, it was the classic turn-to-Derrick-Henry approach that helped the Titans ice things, riding the big back to chew clock and score a couple game-sealing touchdowns. It truly was a \"team\" win for the Titans, who outplayed the Patriots on both sides of the ball, throwing Tom Brady out of rhythm and attacking with unseen aggression on offense. It produced Tennessee's most emphatic win of 2018.2. Marcus Mariota was night-and-day better than he'd been for much of October, throwing with confidence and precision and scrambling for yards when needed. Mariota found Corey Davis for a beautiful early touchdown, took shots down the sidelines and made decisions with conviction. Gone was the hesitant Mariota of October, and in his place was a quarterback acting as a maestro, a master at the controls utilizing all of his weapons in an efficient manner that kept the Titans' offense moving and the ball out of the Patriots' hands. He and Davis linked up seven times for 125 yards and the aforementioned score, and he also found Jonnu Smith for a touchdown pass before the Titans shifted to the run to ice things. It was extremely refreshing to see from a team that looked lost offensively in recent weeks.3. This is not an excuse, but injuries did hold the Patriots back. At one point, New England was without both of its starting tackles, forcing LaAdrian Waddle to play on each side at separate points of this game. Josh Gordon's finger injury contributed to a handful of drops early and took away his effectiveness later. Julian Edelman left for the locker room with the Patriots trailing late and the game essentially out of hand. But above all, the Patriots were simply outplayed by a team that clearly came into the game hungrier than a starved junkyard dog. Titans threw a strong early punch and maintained the lead built by such a start. They harassed Brady so much, he simply didn't look like himself at all. If these two meet again, though, I'm not sure we'd see a similar result, meaning while it's a great win for Vrabel, I'm not going all in on the Titans after Sunday. It's a good start, though.-- Nick Shook\n1. The Green Bay Packers finally leaned on Aaron Jones. The bruising, explosive running back rewarded Mike McCarthy with a career-high 145 rushing yard day on 15 carries, for 9.7 yards per tote, with two scores. The versatile back chipped in 27 yards on three receptions. In the first half, Jones accounted for 128 of the Packers 207 total yards. A barbwired cannonball, Jones owns a quick first step that allowed him to zoom through big holes of a porous Dolphins defense. His blastoff 67-yard run set up the Packers second touchdown of the day -- a drive in which Jones accounted for all 71 yards and the score. After splitting reps most of the season, Jones saw 72.2 percent of snaps and out-carried Jamaal Williams 15 to three. With Jones rolling, Aaron Rodgers didn't have to shoulder the load, throwing for just 199 yards and two TD tosses to Devante Adams (4/57/2) Packers fans have been begging McCarthy to give Jones the lion's share of snaps for an up-and-down offense. Hopefully, Sunday's workload is an indication of how the Packers will handle the rotation for the stretch run. 2. Winners score touchdowns. Losers settle for field goals. The Dolphins moved the ball early against the Packers but settled for four field goals before Green Bay broke the score open. Miami's red zone offense was disastrous. A botched snap fumble on the opening drive killed a promising start. The Dolphins then settled for field goals any time they got within scoring position. The drive that epitomized the Dolphins day was a 14-play possession that took 7:34 off the clock, in which Miami drove inside the 30-yard-line. A sack, however, led to a punt. Waste. Behind an offensive line missing three starters, Brock Osweiler had little chance to stretch the field (six sacks taken). The dink-and-dunk quarterback then tossed a backbreaking interception on a deep out route -- he doesn't have the arm to make that difficult throw. Frank Gore was the lone bright spot for the injury-ravaged Dolphins offense, generating 90 yards on 13 carries (6.9 YPC). The day allowed Gore to break an NFL record with 14 straight seasons with 500-plus rushing yards. The ageless wonder is the best thing going for the Dolphins. 3. The victory kept the Packers in the postseason hunt at 4-4-1 with upcoming games at Seattle and Minnesota, which will go a long way in determining how the NFC playoff positioning shakes out. With three division games left, Green Bay needs to go on a run to keep pace with the Bears, who currently lead the NFC North. The Dolphins head into the bye week desperately needing to get healthy after watching a bevy of players exit with injury -- including receivers Jakeem Grant (leg) and DeVante Parker (shoulder). The Dolphins sits at 5-5 and still in the thick of a muddled AFC playoff race. Depressing days like Sunday, however, don't shine positive rays on Miami's outlook. -- Kevin Patra\n1. This was the on-field drama Browns fans have waited eons for. Sunday marked a day of definitive growth for Baker Mayfield, who showed off his arm with some of the craftiest throws we've seen yet from the first-overall pick. The rookie authored a perfect first half, completing all 12 of his passes to nine separate targets for 165 yards with two touchdown strikes. He was helped by another rousing performance from fellow rookie Nick Chubb, the ultra-rugged runner who lashed the Falcons for 176 yards and repeatedly dragged defenders for extra real estate. Absolutely the real deal, Chubb brought the house down in the second half with a franchise-record 92-yard touchdown blast. Meanwhile, who would have guessed the most creative play-caller on Cleveland's staff wasn't the exiled Hue Jackson or Todd Haley -- but Freddie Kitchens? The fill-in coordinator kept the Falcons on their toes with unusual three-back formations with Mayfield under center, tight ends lined up behind the quarterback and a fluid mixture of clock-chewing runs and rapid-strike passes. Kitchens has reworked the playbook to give Mayfield quick looks in the flats to offset the team's problematic left tackle situation. On the whole, the most complete game yet from these young Browns -- on both sides of the ball.2. The Falcons took advantage of Cleveland's lone mistake in the first half, an ill-fated option pass from Dontrell Hilliard that missed its target -- Baker Mayfield -- and fell into the arms of safety Damontae Kazee, who rumbled 33 yards to set up a quick Atlanta scoring toss from Matt Ryan to Julio Jones to build a 10-7 lead. Tight end Austin Hooper caught four passes before Ryan (38-of-52 passing for 330 yards and two scores) connected with a wideout, the result of a Browns zone defense that gave Atlanta's quarterback nowhere to go with the ball. Julio Jones piled up 107 yards, but big plays were kept to a minimum by the Browns (3-6-1). The Falcons made a killer mistake of their own at the start of the third quarter when Mohamed Sanu lost the ball stretching for extra yardage after a catch, a gaffe that set up Mayfield's third touchdown of the day off an 11-yard strike to Duke Johnson for the 21-10 lead. It was concerning to see Atlanta fail to punch it in on three straight plays from the Cleveland 1-yard line in the final quarter.3. Sunday served as an ultra-effective recruiting advertisement as general manager John Dorsey searches for Cleveland's next coach. The talent is there, just waiting for the right leader to step in and tug this team toward the promised land. The Falcons, meanwhile, can barely afford another misstep after sinking to 4-5 on the year with a rugged, road-heavy remaining slate featuring tilts against the Cowboys, Saints, Packers and Panthers. In a stocked NFC South, the Falcons realistically need to go 6-1 down the stretch.-- Marc Sessler\n1. It was a tale of two halves for Indianapolis' scorching offense and Jacksonville's reeling defense. The Colts' 29 first-half points were their most since 2014, with Andrew Luck joining Tom Brady and Peyton Manning as the only quarterbacks to toss at least three touchdown passes in six consecutive games. We've always wondered how Luck would fare with reasonable pass protection, a solid supporting cast and an offensive guru dialing up creative play calls. The results have been beautiful, with the offensive line pitching a sack shutout for a fourth straight game.While Blake Bortles played keep away with an effective ball-control attack in the second half, the Colts hung on to win thanks to a forced fumble by cornerback Kenny Moore just as the Jags had reached easy range for the game-tying field goal.2. Released by the Lions in March, Eric Ebron has been one of the league's most productive free-agent acquisitions. Luck's red-zone security blanket scored three first-half touchdowns, including a 53-yard catch-and-run with an athletic pylon dive as the finishing move. Through nine games, Ebron has amassed 10 touchdowns and 463 yards on 39 receptions compared to three touchdowns and 217 yards on 23 catches for all of Detroit's tight ends combined. To be fair to the Lions' decision-makers, Ebron had lost his confidence, needed a fresh start and was due more than $8 million in his option year. Now he's on pace to threaten Rob Gronkowski's tight-end record of 18 total touchdowns, set in 2011.3. Bortles can't be blamed for the latest setback in Jacksonville's five-game funk. He played a clean game Sunday, unfurling a pretty touch pass to Donte Moncrief for an 80-yard score and otherwise checking down to safe receptions in a chain-moving attack led by Leonard Fournette. The power back returned from a hamstring injury to average just 2.2 yards on 24 carries, but was a factor in the passing game with 56 yards on five receptions. Fournette finished with 109 yards and a pair of touchdowns on a whopping 29 touches.The defense, on the other hand, was as soft as room-temperature butter for the bulk of the afternoon, falling prey to blown coverages, pre-snap confusion and undisciplined penalties. It's hard to believe this Jaguars defense is the same one that finished No. 1 in Football Outsiders' advanced metrics a year ago.-- Chris Wesseling\n1. Matt Nagy's offseason plan coalesced in an explosive, entertaining touchdown fiesta in the demolition of a division rival. Mitchell Trubisky enjoyed the best game of his career, repeatedly finding receivers wide open for big plays. Protected well against a limp Lions pass rush, Trubisky did a phenomenal job getting through his progression and tossing pinpoint darts in stride to streaking receivers. The second-year quarterback came out of the gate on fire, completing 14 of 16 passes for 208 yards, two TD passes and a scoring run on four first-half touchdown drives. The Bears offense was on such a roll, they experienced just three third downs the entire first two quarters. Tru finished with a career-high 355 yards passing, three TD tosses, and a 148.6 QB rating. It's no coincidence that Allen Robinson's return from injury coincided with Trubisky's bombardment. The receiver was no match for the Darius Slay-less Lions secondary. ARob burned corners off the line and frequently galloped through open space, generating receptions of 36 yards (TD), 35 yards, 27 yards and 26 yards (TD). With a healthy Robinson, thriving rookie Anthony Miller (5/122/1), Swiss Army Knife weapon Tarik Cohen and Trubisky's weekly improvement, Nagy's offense is surging into the second half of the season. Sunday, it was no contest versus a weak Lions defense. 2. Entering a vital three-game stretch, the Bears put a stamp on their claim for the NFC North crown with a dominant performance on both sides of the ball. Chicago's defense stuck to Lions receivers, who couldn't generate an iota of separation against a stingy Bears secondary. Vic Fangio's league-leading defense in turnovers forced three more (2 INTs, fumble) and sacked Matthew Stafford six times. Khalil Mack returned from injury and took down the quarterback twice. Rookie linebacker Roquan Smith continues to play impressively, gobbling up 10 tackles, one tackle for loss, a sack, and a PBU. With Smith's improved coverage the Bears defense doesn't have a glaring weakness. Against the Bears D, Stafford continued his head-scratching season, continually being forced to hold the ball and throw into tight windows. In what's becoming a weekly occurrence, inability to generate early scores puts the Lions in a deep hole they are unable to dig out of. Outside of some impressive downfield catches by receiver Kenny Golladay, mostly in garbage time, Detroit's offense didn't display the capability of sustaining drives. Sans the chain-moving Golden Tate, the Lions don't have an identity. 3. While the Lions (3-6) dimming hopes essentially died on the Soldier Field grass, the Bears put the division on notice with Sunday's domination. With four more NFC North games down the stretch -- including a rematch with Detroit on Thanksgiving -- Nagy's squad will need to stack similar performances. The biggest negative for the Bears in Week 10 was kicker Cody Parkey. The veteran booter clanged four attempts off the upright -- two PATs and two field goals (41 yards, 34 yards). After a third-quarter touchdown, the Bears opted to keep Parkey on the sideline, instead, converting a two-point try. The misses didn't bite the Bears this week, but against opponents with an actual pulse, they are mistakes that could be costly. -- Kevin Patra\n1. The two-face character of the Redskins' defense showed its stingy side even if the Bucs were their own worst enemy. After getting sent to the woodshed last week against the Falcons, Washington (6-3) found success in capitalizing off the Buccaneers' mistakes in what was a bend-but-don't-break effort in repelling Fitzmagic. An incredible diving interception on the edge of the end zone by Josh Norman on Tampa Bay's first possession foreshadowed the Sisyphus-like effort that plagued Tampa Bay the entire game. Incredibly, Tampa Bay (3-6) was held to a single field goal despite 501 total yards of offense -- the most ever for a team limited to just three points. Two interceptions, two lost fumbles and a pair of missed field goals in conjunction with five pointless treks into the red zone all led to a 1,000-horsepower offensive wheel spin that stymied Tampa Bay's effectiveness beyond the 50-yard line. The Redskins' front seven augmented Tampa's woes, but it was merely just another player in what was a world of frustration for the Buccaneers.2. Alex Smith, unsurprisingly, put in another measured performance that was accentuated by brief moments of awesome. He finished the game with a ho-hum line of 19-of-27 passing for 178 yards and a touchdown. He zipped a few impressive passes while helping the Redskins steadily pull away on the scoreboard, including a nice 6-yard laser to a stretching Josh Doctson in the fourth quarter to put the game away. It was a fairly strong effort considering the Redskins were working with some new faces on the offensive line after last week's injuries. Adrian Peterson had a more subdued game than previous weeks, finishing with 68 yards on 19 carries. While Smith and Peterson provided a steady offensive heartbeat for the Redskins, Dustin Hopkins provided the bulk of the scoring. He kicked a pair of 43-yard field goals and added a 26-yarder. It wasn't the most spectacular of wins, but with Jamison Crowder and Paul Richardson out because of injuries and a fresh-faced O-line tasked with making it all work, the Redskins offense found a way to combat a stingy defensive effort by the Bucs.3. Ryan Fitzpatrick has made a habit out of passing for more than 400 yards and still finding himself in the loss category. He completed 29 of 41 passes for 406 yards in the loss. After the game, Bucs coach Dirk Koetter told reporters he called plays Sunday for the first time all year. It worked for the most part until the team got onto the Redskins' side of the field. It was another frustrating performance for a Buccaneers team that can't generate any consistency on offense. Koetter said he was mulling over whether or not to start Jameis Winston next week, but that probably won't fix what ails the Bucs. Fitzpatrick's two interceptions stung, but the lack of a running game in combination with two lost fumbles and Chandler Catanzaro missing two of three field-goal attempts (30 and 48 yards) are game-breakers in close contests. Koetter keeping his job was one of the biggest post-Christmas surprises of the 2017 season. His future in Tampa Bay looks decidedly bleak unless the Buccaneers can cut down on the mistakes and start winning games over the last six weeks of the season.-- Austin Knoblauch\n1. On a day used to celebrate the nation's veterans, the Saints channeled a little bit of the armed forces and executed flawlessly with military precision en route to their eighth consecutive win, the longest such streak in the league. Everything the Saints did seemed to work against an overmatched Bengals defense. The Saints produced points on their first nine possessions, totaling 509 yards and 33 first downs on the game. New Orleans also averaged a healthy 6.9 yards per play while holding a massive 39:46 mark in time of possession compared to the Bengals' 20:14. Quarterback Drew Brees led the charge, completing 22 of 25 passes for 265 yards and three touchdowns, adding a 1-yard touchdown run. Wide receiver Michael Thomas paced the receiving game with eight catches for 70 yards and two touchdowns. Brees and Thomas made a mark on the NFL record book, too. Brees moved into second place on the all-time touchdown passes list ahead of Hall of Famer Brett Favre. Thomas set the record for most career catches through his first 40 games, a mark previously held by New York Giants wide receiver Odell Beckham (266). Meanwhile, Sunday also saw running back Mark Ingram total 162 yards (104 rushing) and a touchdown. When the Saints have Ingram and Alvin Kamara, who totaled 102 yards (56 rushing) and two touchdowns, going like they were against the Bengals, this offense presents a major headache for defensive coordinators. As a team, the Saints totaled 244 yards rushing and three touchdowns on 47 carries.The Saints improved to 8-1 on the season and opened a two-game lead over the Carolina Panthers in the NFC South.2. On a team full of offensive stars, one of the more underrated storyline on the Saints offense continues to be backup quarterback Taysom Hill. The Saints continue to utilize Hill all over the field as a weapon, but his ability to be utilized as a blocker was on full display against the Bengals. One play in the first half stood out. Hill split wide of the line of scrimmage, and at the snap, Brees connected with Kamara on a screen pass. Hill, who is listed at 6-foot-2, 221 pounds, locked up with a Bengals defender and helped seal the edge for Kamara to gain positive yards. The backup quarterback, who also contributes on special teams, simply can't be viewed as a gadget when he consistently makes football plays. Give credit to Saints head coach Sean Payton for finding ways to get playmakers on the field because how many NFL coaches would utilize their backup signal-caller like the Saints do? 3. The Bengals entered the game ranked at or near the bottom of the league in numerous defensive statistical categories, a recipe for disaster against one of the league's top offenses. Bengals head coach Marvin Lewis' defensive unit simply had no answer to stop the high-powered Saints. And the defense, which allowed an opponent to top 500 total yards for a second consecutive game, got no help from the offense. Quarterback Andy Dalton completed 12 of 20 passes for 153 yards and a touchdown, but the Saints picked off Dalton twice and sacked him four times. Dalton finished the game with a 61 passer rating. Sunday's loss dropped the Bengals to 5-4 on the season.-- Herbie Teope\n1. The Bills (3-7) unleashed an offensive onslaught on the Jets only the Minnesota Vikings could have ever seen coming. With Matt Barkley making his first NFL start since the 2016 season for a Buffalo team mired in a comatosed state since rookie Josh Allen suffered an elbow sprain nearly a month ago, Sunday's performance by the Bills looked like something ripped from the NFL's bizarro world dimension. As strange as it is to fathom, the Bills did indeed jump out to a 31-3 halftime lead. Barkley made a ghost town out of \"New Jack City\" and LeSean McCoy looked like his 2011 self. It was the kind of gridiron beatdown that left the Jets' secondary throwing up their arms in frequent frustration while reminding the Buffalo faithful that Week 3's impressive performance against the Vikings wasn't necessarily a fluke. Barkley wasn't on the roster for the Bills' first win of the season, but he looked as comfortable in Buffalo as a Niagara Falls tour guide despite signing on just 13 days ago. Barkley made an immediate impact, connecting on a 47-yard pass to Robert Foster on the first play from scrimmage before McCoy scampered in for his first touchdown of the season on the next play. From there, Barkley completed 15 of 25 passes for 232 yards and two TDs in an impressive performance that even featured a big-boy touchdown on a 7-yard pass to offensive tackle Dion Dawkins. Pretty impressive for a QB who didn't even manage a snap during his time with the Cardinals last year before losing the Cincinnati Bengals' backup QB job to Jeff Driskel over the summer. All things considered, there's no need to rush Allen back onto the field now that the Bills have a better option than Nathan Peterman at the ready.2. It's anyone's guess as to whether the Jets (3-7) will retain head coach Todd Bowles beyond this season, but Sunday's performance could be exhibit 1A in the argument for new leadership. The Jets' passing defense, which entered the game ranked 13th in the league, looked completely lost in the first half against a Bills team that ranks dead last in passing. Trumaine Johnson and Morris Claiborne were almost helpless in preventing Zay Jones from enacting some sort of second coming of Andre Reed. Jones and Foster caused chaos throughout the game with Jones finishing with eight catches for 93 yards and a touchdown and Foster adding 105 yards on three catches. New York also gave up a total of 212 yards on the ground with its defensive line giving up big runs to McCoy throughout the game. Offensively, the Jets were a dud. Josh McCown, who was filling in for injured starter Sam Darnold, couldn't string drives together for a team that went a forehead-slapping 1 for 12 on third downs. McCown completed a very backup-like 17 of 34 passes for 135 yards and two interceptions. While Bowles' future is tied closely to Darnold's future development, the other 52 matter, too. Surrendering 41 points to a Bills team that had only scored 96 points through the first nine weeks certainly won't help the claim that Bowles deserves a fifth season in Florham Park.3. LeSean McCoy told reporters this week he knows time is running out on his chance to expand on his \"legacy,\" and the running back responded with his best game of the season. McCoy churned out 113 yards and two touchdowns on 26 carries. The Jets struggled throughout the afternoon to contain the 30-year-old running back, who added instant balance to the Bills' attack. McCoy is still on pace to post the lowest numbers of his career, and the Bills sorely needed to find a way to get him to produce more. Sunday's performance goes a long way in helping McCoy and the Bills begin their claw back to respectability.-- Austin Knoblauch\n1. Arizona produced one drive that served as proof that we all aren't insane. It was early, a 12-play, 75-yard march, and it ended in a touchdown pass from Josh Rosen to David Johnson. It was well-balanced, efficient and included attainable down-and-distance situations throughout. Finally, the Cardinals (2-7) were looking like we all thought they should. But then, the usual issues crept back into focus. Rosen was harassed on nearly every play. The Chiefs (9-1) sacked him five times, with four coming as a result of just a four-man rush. Kansas City logged a pressure on 54.5 percent of pass drops. That's not good for the Cardinals, and a tired tale in Arizona for a team that has a promising young quarterback but needs to protect him much better.Lost in this was the play of Johnson, who rushed 21 times for 98 yards and a touchdown, and also led the Cardinals in receiving with seven grabs for 85 yards and another score. He didn't quite look like a gamebreaker Sunday, but he was the clear focal point of the offense for the first time in a long time. 2. Credit the Cardinals defense for being the first opposing unit to play as if it had studied each of Kansas City's games from this season. Arizona blew up a few staples of the Chiefs' offense throughout the game (a shovel pass to Travis Kelce ran into a brick wall of defenders), and even a hurdle attempt by Kareem Hunt that looked all too familiar was stopped dead in its tracks by Budda Baker, who wouldn't be fooled by another highlight attempt. That helps explain the stat line that was much more pedestrian from the Chiefs than we're used to this season. It's encouraging for the Cardinals, but the offense didn't do enough (per usual) and a chance at a massive upset fell short.3. We'll spend just one point on the Chiefs this week because they're just doing more of the same. Arizona had small blips that showed a defense that's better than average, but much like last week against Cleveland, or every week for that matter it was just too much for an opponent to handle. Arizona cut Kansas City's lead to 20-14 in the fourth, but Justin Houston then rushed, read a screen drop, deftly slid back and intercepted Rosen's pass that was intended for Johnson. The Chiefs quickly turned the ensuing possession into six points and it was over from there. This was one of Kansas City's least impressive wins, but even then, it still came rather comfortably.-- Nick Shook\nMore Posts\nPhoto Essay\r\n"}