{"id": "NFL Power Rankings, Week 9: Panthers, Seahawks on the rise", "paragraph": "\nBefore getting into the drama of this past week in the NFL, a tip of the cap to another sport ...Game 3 of the World Series was special. The October tilt reflected the pinnacle of pro sports -- enticing theater with the requisite measure of true grit, a legit battle of attrition. Then, after both teams were spent (and their bullpens taxed), Max Muncy's longball off Nathan Eovaldi brought to a close the longest affair in postseason history.Eovaldi's work evokes memories of the heartiest losing efforts. The guy threw 97 pitches in relief, despite also pitching in the first two games of the series. Boston's pitcher resembled Boston's quarterback, when Tom Brady threw for more than 500 yards in Super Bowl LII -- and lost. Or Troy Aikman, who got hit 20 times in the 1994 NFC Championship Game yet still threw for 380 yards, refusing to give up on Dallas' attempt at the NFL's first threepeat. Or how about any of the Dolphins and Chiefs who survived the longest game in pro football history, the 1971 Divisional Playoff Game?Nice work, MLB. Other tips of the cap go to a pair of Adams -- and an Eric. Adam Vinatieri set the all-time scoring record, surpassing the great Morten Andersen and helping his Colts secure a road win in Oakland. Adam Thielen made pro football history later that night, becoming the first wide receiver to start the season with eight straight 100-yard games.Lastly, Browns at Steelers brought forth some acclaim that was 25 years past due.As a runner: 2,392 yds, 12 TDAs a receiver: 5,572 yds, 31 TDAs a returner: 9,266 yds, 12 TD@ericmetcalf21 could do it ALL. (via @HarrisonNFL + @nflthrowback)?? #CLEvsPIT: Sunday 1PM ET on CBS pic.twitter.com/TnnAIox9qpEric Metcalf's former team is in upheaval, but that doesn't mean they moved up. The Steelers climbed farther up the top 10. For the full league hierarchy, see below. Your hierarchical thoughts are always welcome: @HarrisonNFL is the place.Let the dissension commence!PROGRAMMING NOTE: For more in-depth analysis on the updated league pecking order, tune in to NFL Network every Tuesday night at 6 p.m. ET for \"The Power Rankings Show.\" Want to add YOUR voice? Provide your thoughts in a tweet to @HarrisonNFL, and your comments could be featured on air.\n\nRANK1\n\nRAMS (8-0)\n\n\nPrevious rank:\nNo. 1\n\n The sign of a great team, a \n     Super Bowl team, is when it doesn't play anywhere near its peak performance ... and still wins. That was the \n     Rams\n on Sunday. The defense got rolled early, putting Los Angeles behind the, er, 12-ball at 10-zip. As he always manages to do, Sean McVay deciphered the Rubik's Cube, leaning on \n     Todd Gurley more on early downs to keep an uber-aggressive \n     Packers defense honest. On that front, Gurley somehow piled up nearly 200 yards from scrimmage and a touchdown after a rough start. The focus on Gurley allowed \n     Jared Goff to deliver perfect strikes on intermediate throws against single coverage, which is so difficult to stop (or even hope to stop). \n     \n\nSide note: Gurley could've padded his tally with another score late. He deliberately rammed into a tackler instead, ignoring the goal line in order to help prod the clock to 0:00. It was reminiscent of the first guy I ever saw do that: Brian Westbrook of the \n     Eagles during a late-season win at Texas Stadium back in 2007. Strategery. \n     \n\nUPDATE: After this piece was published, the Rams acquired DE Dante Fowler Jr. from the Jaguars in exchange for a 2019 third-round pick and a 2020 fifth-round pick.\n\nRANK2\n\nPATRIOTS (6-2)\n\n\nPrevious rank:\nNo. 2\n\n No movement for the \n     Patriots, although \n     Saints fans think their team should have leapfrogged New England. Funny how \n     25-6 division wins -- on the road, no less -- are not enough anymore. The \n     Patriots' defense gave up 46 yards on the ground and forced two turnovers to take the pressure off \n     Tom Brady, a la \n     the Dolphins game a month ago. Offensively, \n     James White caught his usual 150 passes (10 for 79), while \n     his touchdown plunge capped off the key drive of the game, pushing a close six-point affair to 18-6 in the fourth quarter. \n     \n\nSide note:\nCordarrelle Patterson ... \n     Cordarrelle Patterson ... got 10 carries. He has more rushing attempts than receptions this season.\n\nRANK3\n\nCHIEFS (7-1)\n\n\nPrevious rank:\nNo. 3\n\n The \n     Chiefs aren't slowing down, and it's not just all about \n     Patrick Mahomes. Kansas City's pass rush took \n     Sunday's game back to 1995, forcing two turnovers from \n     Case Keenum while flattening the \n     Broncos' quarterback five times. Three of those sacks came from \n     Dee Ford, with \n     Breeland Speaks picking up the first full sack of his career. That gives Speaks 1.5 on the season \n     (plus a sack that never was). Ford now boasts a staggering eight on the year. And to think: \n     Justin Houston isn't even healthy right now. Kicker \n     Harrison Butker did miss an extra-point try, yet he and punter \n     Dustin Colquitt have been outstanding this season. OK, enough stalling already ... Mahomes tossed four more touchdown passes.\n\n\nRANK4\n\nSAINTS (6-1)\n\n\nPrevious rank:\nNo. 4\n\n From \n     team off to a rough start to \n     quiet Super Bowl contender. That's the arc of the \n     Saints' 2018 campaign thus far. Three days before Halloween, New Orleans re-entered \n     the house of its playoff horrors -- and proceeded to \n     wallop the Vikings on defense and special teams. \n     \n\nNotable:\nDrew Brees threw for 120 yards, his lowest total since Week 17, 2006, a meaningless game during his first year with the team (he only threw five passes). \n     \n\nAlso notable:\nMarcus Davenport has four sacks. #NotbadforthedudenoonewantedtheSaintstomoveupfor\n\nRANK5\n\nCHARGERS (5-2)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 6\n\n The \n     Chargers -- who, at 5-2 aren't necessarily flying under the radar -- have yet to be considered under the heading \" \n     Super Bowl contenders.\" The wait for \n     Joey Bosa continues, but his return -- \n     whenever it comes -- should take the pressure off what has been a more-than-capable offense. Consider that the Bolts have racked up 18 sacks while recording five games with multiple turnovers in their seven contests without him thus far this season. Can you imagine how good they'll be \n     with him?\n\nRANK6\n\nPANTHERS (5-2)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 7\n\n So many positive tidbits to glean from the \n     Panthers' \n     win over the Ravens. First, there was the confidence with which \n     Cam Newton operated Norv Turner's offense, with a little treat for the field general himself on \n     the QB keeper late. Second, the draftniks' misidentification of \n     Christian McCaffrey was further cemented, with the back proving to be a workhorse in this his sophomore campaign (18 touches Sunday, 136 on the season). Third, love Turner's use of \n     DJ Moore on Sunday, with end-arounds, pitches and typical down-the-field stuff all stemming from Moore's acceleration. No, \n     C.J. Mosley, \n     you did not have that angle.\n\nRANK7\n\nSTEELERS (4-2-1)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 9\n\n\nGreat win for the \n     Steelers, hopefully providing a small bit of solace for a shaken city. This might be a football column, but is there anyone in America who is not tired of mass shootings? Mike Tomlin clearly felt the impact, noting that the synagogue \n     at which 11 people were killed Saturday was \n     no more 800 yards from his house. Pittsburgh's head coach got his team ready to play for the fans and their community, which was more than noticeable. The \n     Steelers' defense gave its best performance of the season, not allowing the \n     Browns to go over the 200-yard barrier as a team until complete garbage time. \n     James Conner (212 yards from scrimmage) nearly matched Cleveland singlehandedly. No Pittsburgh player competed for himself in that game at Heinz Field on Sunday.\n\nRANK8\n\nVIKINGS (4-3-1)\n\r\n\t\t\t\t\t3\r\n\t\t\t\t\t\nPrevious rank:\nNo. 5\n\n CBS Radio analyst Jason Taylor was beside himself over the fact that, with Minnesota down 30-13 and eight minutes or so to go in the fourth quarter of \n     the game against the Saints, the \n     Vikings were walking back to the huddle. I'm with him on that. The sense of urgency wasn't omnipresent for Minnesota, though the team had plenty of time to at least make the Sunday nighter interesting. The Vikes made things far easier for their NFC adversaries than they did \n     last January. Though they rang up a plethora of yards, they couldn't do much of anything else to even be in the contest for most of the second half. \n     Next up: Lions.\n\nRANK9\n\nREDSKINS (5-2)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 10\n\n Washington hums along, sitting comfortably atop the NFC at 5-2. The \n     Redskins' strength continues to be running the football and stopping the run, like they're straight from the 1940s. Actually, in that era, the 'Skins were known for throwing it all over the yard with Sammy Baugh. \n     Alex Smith hasn't been asked to play likewise, and \n     that held true on Sunday, when his yards-per-attempt mark was a scant 5.6. That's OK. Slingin' Sammy -- who could play himself some safety, too -- would've admired \n     D.J. Swearinger's two interceptions of \n     Eli Manning (especially since they came against the rival Giants). \n     \n\nSide note: With 149 rushing yards, the 33-year-old \n     Adrian Peterson is on pace for 1,342 this season. Wow. \n     \n\nUPDATE: After this piece was published, the Redskins acquired S Ha Ha Clinton-Dix from the Packers in exchange for a fourth-round pick.\n\n\nRANK10\n\nBEARS (4-3)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 11\n\n Who knows how strong this \n     Bears team really is? At 4-3, and with both the \n     Packers and \n     Vikings losing last week, Chicago is in the heart of the NFC North race. \n     A two-score win certainly helps boost the perception of this team, although the opponent in said victory is far from a playoff squad. Mitch Trubisky was effective against the \n     Jets in a sense, committing no turnovers while making plenty of hay with his legs. The air attack is still earthbound. The larger question is, when will the \n     Jordan Howard breakout game come? Still zero 100-yard outings on the season, although he was solid against New York's front. \n     Tarik Cohen was a handful.\n\nRANK11\n\nRAVENS (4-4)\n\r\n\t\t\t\t\t3\r\n\t\t\t\t\t\nPrevious rank:\nNo. 8\n\n Make no mistake: The \n     Ravens\ngot drubbed in Carolina on Sunday. That's how it felt, anyway, watching \n     Joe Flacco under pressure, tossing errant balls, while \n     Cam Newton coasted his way through four quarters and into the end zone on an easy-peasy bootleg. Flacco's two interceptions were mind-boggling. The first should have been an obvious throwaway. Instead, the ill-advised throw \n     was picked off right before halftime, setting up a \n     Graham Gano field goal to push the \n     Panthers' lead to 17. The second was a bad decision augmented by a badly underthrown ball, \n      picked clean by Captain Munnerlyn. I enjoyed getting whipped by my brother at Boggle more than watching those throws. \n     \n\nUPDATE: After this piece was published, the Ravens acquired RB Ty Montgomery from the Packers in exchange for a 2020 seventh-round pick.\n\nRANK12\n\nTEXANS (5-3)\n\r\n\t\t\t\t\t3\r\n\t\t\t\t\t\nPrevious rank:\nNo. 15\n\n\nThe Texans keep on winning, with a big assist from the \n     offense for a change ... \n     a Calvin Murphy-level assist. Too old-school? How about \n     a Sam Cassell-level assist? Whatever. The defense has carried Bill O'Brien's team the entire first half of the season. For its part, Houston's D got straight ripped off Thursday night. Slice that \n     Brock Osweiler tuck rule play any way you want -- that should've been six points. The refs \n     weren't on-point.\n\n\nUPDATE: After this piece was published, the Texans acquired WR Demaryius Thomas from the Broncos in exchange for a 2019 fourth-round draft pick.\n\nRANK13\n\nPACKERS (3-3-1)\n\n\nPrevious rank:\nNo. 13\n\n\nThe players are ticked off, and who can blame them? We all lost when \n     Ty Montgomery coughed up that football. Bad ( \n     selfish?) decision to take that ball out of the end zone, producing a painfully anticlimactic ending to what was otherwise a heck of a game. The \n     Packers packed a punch \n     early at the Coliseum, but they couldn't hold the fort late. \n     Jared Goff chewed up the secondary in the second half, and when that wasn't working (mostly due to Green Bay pressure), the \n     Rams leaned on their stud tailback. \n     Packers DC Mike Pettine's game plan called for applying mass pressure to Goff, blitzing early and often, while the front seven clogged running lanes. Eventually, Goff's play-action made Green Bay's back end pay when \n     Clay Matthews and Co. couldn't get home. Two plays resolved the affair: \n     Aaron Donald blowing through single blocking to drill \n     Aaron Rodgers (18-of-30, 286 yards and a TD) on third-and-6. Then \n     Ty Montgomery's fumblerooski. \n     Whadda hell's goin' on out here?\n\n\nUPDATE 1: After this piece was published, the Packers traded S Ha Ha Clinton-Dix to the Redskins for a fourth-round pick.\n\n\nUPDATE 2: The Packers also traded RB Ty Montgomery to the Ravens for a 2020 seventh-round pick.\n\nRANK14\n\nEAGLES (4-4)\n\n\nPrevious rank:\nNo. 14\n\n Back to .500 ... what an up-and-down year for the defending champs, who \n     evened their record Sunday  in London on the strength of the defense. \n     Jordan Hicks was all over the place, posting 12 tackles and 1.5 sacks. \n     Chris Long added two sacks of his own. Free Atomic Fireballs for you if you guessed \n     Josh Adams would be the game's leading rusher. The rookie rang up more yards than he produced all season, then celebrated his 22nd birthday Monday. \n     \n\nSide note:\nJordan Matthews, of all people, was the game's leading receiver, while \n     Corey Clement has barely been getting his hands on the ball. Odd. \n     \n\nUPDATE: After this piece was published, the Eagles acquired WR Golden Tate from the Lions in exchange for a 2019 third-round pick.\n\nRANK15\n\nSEAHAWKS (4-3)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 17\n\n You hear the phrase \"flying under the radar\" in sports enough to make you miss those Jimmy Johnson Extenze commercials. (Note: Please don't read the \n     Chargers blurb.) Yet, I have to say that no team is ... flying ... uh ... is being ignored more than the \n     Seahawks. Seattle \n      has improved to 4-3 after starting the season with two straight losses. Front and center is Ken Norton's defense, which is fifth in points allowed per game, despite being sans \n     Richard Sherman, \n     Kam Chancellor and \n     Michael Bennett. That's the same Norton whom the \n     Raiders -- the \n     Raiders -- didn't want. Cool. \n     \n\nSide note: Got a random call from John Schneider about \n     my Eric Metcalf TBT feature from this past week. Schneider brought in Metcalf in 2001 for the then-struggling \n     Redskins (1-5), without earning much praise from the sportswriter peanut gallery. The 12th-year pro promptly took a first-quarter punt 89 yards to the house. Washington went on a roll, winning four in a row after Metcalf joined and finishing 8-8. Moral of the story: Schneider and Pete Carroll know what they are doing. \n     You can watch the amazing Metcalf here.\n\nRANK16\n\nBENGALS (5-3)\n\n\nPrevious rank:\nNo. 16\n\n It appeared as though \n     Andy Dalton and the \n     Bengals were headed to overtime \n      against the Bucs when the Cincy quarterback missed \n     C.J. Uzomah on that shallow cross with under a minute to play. Then Dalton made a couple of clutch throws to \n     A.J. Green, \n     setting up Randy Bullock. For a guy who still doesn't earn much praise around the league, that's the fourth time in 2018 that Dalton has engineered a game-winning drive in the fourth quarter. Just saying.\n\nRANK17\n\nCOWBOYS (3-4)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 18\n\n The \n     Amari Cooper trade generated enough water cooler talk for Joe Buck to bring it up in the World Series Game 3 broadcast. Now we will all find out how much blame the receiving corps deserves for the passing-game woes in Dallas. While \n     Dak Prescott has not been the most accurate passer (something that's been mentioned a few times in this space), it's not as if the windows he sees are of the larger variety. Cole Beasley: still one of the top Ys around.\n\n\nRANK18\n\nLIONS (3-4)\n\r\n\t\t\t\t\t6\r\n\t\t\t\t\t\nPrevious rank:\nNo. 12\n\n Gonna take a wild guess that \n     Lions fans expected a better effort from their favorite team Sunday, with Detroit fresh off \n     a road victory and having won three of the last four. That run included home Ws \n     over the Patriots\nand Packers, for crying out loud. So, \n     of course Detroit gets \n     thumped by the Seahawks in front of the home folk at Ford Field. Even worse: One week after Matt Patricia's guys piled up 248 yards on the ground, they darn near ignored the run game altogether versus what was the league's 24th-ranked rush defense. #Lions \n     \n\nUPDATE: After this piece was published, the Lions traded WR Golden Tate to the Eagles for a 2019 third-round pick.\n\nRANK19\n\nBRONCOS (3-5)\n\n\nPrevious rank:\nNo. 19\n\n\nThe Broncos got beat in Kansas City, dropping their record to 3-5 on the season with \n     an imposing four-game stretch ahead: vs. \n     Texans, at \n     Chargers, vs. \n     Steelers, at \n     Bengals. Still, none of those teams will be any stronger than the foe Denver just went toe to toe with -- namely, quarterback \n     Patrick Mahomes, who has made every defense he's faced look silly. Similar to their first meeting \n     on Oct. 1, the \n     Broncos stayed with the AFC West leaders throughout. The key sequence this time came with just under six minutes remaining. On third-and-2, from his own 20 and trailing by 10 points, \n     Case Keenum ... checked to \n     Devontae Booker\nbehind the line of scrimmage. Huh?! \n     \n\nUPDATE: After this piece was published, the Broncos traded WR Demaryius Thomas to the Texans for a 2019 fourth-round draft pick.\n\nRANK20\n\nFALCONS (3-4)\n\n\nPrevious rank:\nNo. 20\n\n How about a week off for the most banged-up team in pro football? Many of the \n     Falcons' key parts are currently on IR, yet there are those ( \n     Mohamed Sanu, \n     Matt Bryant and \n     Grady Jarrett, to name a few) who just needed a bye to get healthier for \n     Atlanta's meeting in Washington with the upstart \n     Redskins. \n     \n\nSide note: Who would want to face this \n     Falcons attack come playoff time? \n     Not it!\n\n\nHistorical note: This Sunday's bout is a rematch from the 1991 Divisional Round. Too soon?\n\nRANK21\n\nCOLTS (3-5)\n\r\n\t\t\t\t\t6\r\n\t\t\t\t\t\nPrevious rank:\nNo. 27\n\n Make that two in a row for the pesky \n     Colts, who refuse to go quietly into 2018's night. In fact, at 3-5, they are still right in the thick of the AFC South race. Indy is getting better -- more consistent -- quarterback play than the division-leading \n     Texans. The \n     Titans' offense has been stuck in Tennessee mud all year. The \n     Jaguars are right there with Indianapolis at 3-5, save for the fact Jacksonville is headed in the opposition direction. Then again, that was the \n     Raiders whom \n     Indy toppled Sunday. OK, I'll calm my enthusiasm.\n\nRANK22\n\nTITANS (3-4)\n\n\nPrevious rank:\nNo. 22\n\n A trip across that big pond that's seen its share of history is now history for the \n     Titans, who \n     lost to the Chargers in Week 7 but fared better offensively than they have most of the season. Mike Vrabel's challenge now -- other than \n     stopping himself from going for it on fourth-and-ANYTHING in the near future -- is to ramp up the offense to the defense's level. Tennessee's defensive unit is tops in the NFL in red-zone defense and third in scoring D. Solid.\n\nRANK23\n\nDOLPHINS (4-4)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 21\n\n Another shoddy outing for the \n     Dolphins, who fell apart in the fourth quarter \n     last Thursday in Houston. Adam Gase's defense has disintegrated over the last five weeks, with Miami giving up 167 points during that stretch. That's an absolute ton. The 1973 \n     Super Bowl team didn't allow that many \n     all season. Granted, those days were different in pro football, but take a look for yourself at the coverage the other night. Next up: \n     Jets, at home. Miami rebounds.\n\nRANK24\n\nJAGUARS (3-5)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 23\n\n Well, you can't put that loss on the quarterback. Sure, \n     Blake Bortles checked it down a bunch. He also used his considerable mobility to extend drives. The much-maligned passer didn't carry the offense, but he \n     did carry his end of the bargain. Perhaps he should've walked up to \n     D.J. Chark and handed him that ball in the end zone. Neither Bortles nor the defense received \n     any support on the ground from the RBs: eight carries for 18 yards. Jacksonville is not anywhere close to being the same outfit that earned its way to the AFC Championship Game last season. Not without \n     Leonard Fournette, who was painfully absent once again. \n     \n\nUPDATE: After this piece was published, the Jaguars traded DE Dante Fowler Jr. to the Rams for a 2019 third-round pick and a 2020 fifth-round pick.\n\n\nRANK25\n\nBUCCANEERS (3-4)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 24\n\n Start \n     Ryan Fitzpatrick the rest of the season. Then decide if you want to keep \n     Jameis Winston this spring. That's one way to handle this situation decisively. (Well, unless Fitzmagic pulls a bunch of interceptions out of a hat.) The Bucs picked up Winston's fifth-year option for 2019, but it's guaranteed for injury only. If Tampa does retain the enigmatic quarterback, the team should draft another and make Winston compete. That scenario should include Fitzpatrick, as well, in the way New York re-upped \n     Josh McCown as a fallback option for \n     Sam Darnold growing pains.\n\nRANK26\n\nBROWNS (2-5-1)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 25\n\n At the end of the day, Hue Jackson's 3-36-1 mark was just too big an eyesore. Rankling OC Todd Haley, then laying blame at his feet, probably didn't help Jackson, either. The \n     Browns' offense needed solutions (or, at bare minimum, not making it so easy for defenses to solve), not snipping back and forth. Whatever was going on between the coaches, \n     neither survived Monday's housecleaning. Now, Gregg Williams is in charge (at least for the time being), which brings on new problems to be solved. How will he handle rookie QB \n     Baker Mayfield? Er, how will Mayfield handle \n     him? Will Williams' attention be taken away from the defense, which has immense upside? Fans in Cleveland probably aren't too upset to see Jackson go, but the national perception of Williams is not flattering, given what went down in New Orleans. If the \n     Browns' bleak past is to be water under the bridge, it better flow past the new head coach, too.\n\nRANK27\n\nJETS (3-5)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 26\n\n Another long day at the office for Todd Bowles, who is beginning to not like these NFC North folks. After \n     whipping the Lions on opening day, Gang Green has been ganged up on \n     by the Vikings\nand Bears in consecutive weeks. \n     Sam Darnold struggled against a top-tier Chicago defense, completing less than half of his passes. The dude didn't exactly receive Tempur-Pedic-esque support from his running backs: 19 carries, 35 yards. Get excited.\n\n\nRANK28\n\nCARDINALS (2-6)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 30\n\n\nLarry Fitzgerald played \n     Hall of Fame football Sunday. If I knew how to type the tiny superscript \"2\" that denotes \"squared\" after \" \n     Hall of Fame football,\" I would, because Fitzgerald was already on his way to breakdancing into Canton on the first ballot. Yet, when rookie quarterback \n     Josh Rosen needed chunk yardage late, he went to Larry Legend (the \n     other Larry Legend). Fitzgerald caught a handful of key Rosen heaves late -- from \n     Arizona's second-to-last touchdown to one that required him to \n     go up and take a hit -- to fuel Arizona's comeback win. After the kid (Christian Kirk) hauled in a Rosen fastball \n     in the back of the end zone, there was Fitz, \n     trucking a Niners defender for the two-point conversion. #oldmanstrength\n\nRANK29\n\nGIANTS (1-7)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 28\n\n The \n     Giants move down in a season that continues to sink faster by the week. Pat Shurmur's team is 1-7 if you're scoring at home, although you'd be able to tell that just by looking at the guy. \n     Eli Manning has made enough \n     Eli faces in the last 20 quarters to last a lifetime, although the blame game should \n     not solely focus on New York's quarterback. Manning was under continual pressure Sunday, as the \n     Giants' offensive line saw fit to allow seven sacks and numerous pressures. Yuck.\n\nRANK30\n\nBILLS (2-6)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 29\n\n\nAnother loss for the Bills, who stayed with their division bully for three quarters, but frankly don't have the firepower of late to stay with \n     any team for four. The offense has produced a grand total of nine points the last two weeks, and 35 over the last five games. That's seven points per outing. \n     Todd Gurley has outscored Buffalo by himself this season. The defense does its part, until running on fumes proves too much for a gassed unit. That group stifled \n     Tom Brady and the \n     Patriots' offense for as long as possible Monday night.\n\nRANK31\n\n49ERS (1-7)\n\n\nPrevious rank:\nNo. 31\n\n Disappointing loss for the \n     49ers, who took what seemed to be a commanding 15-3 lead in the fourth quarter, only to let it sail away on them. That's precisely what happened on the last play of the game, when \n     an errant snap fluttered past C.J. Beathard's right shoulder pad, accurately in line with the Niners' ignominious recent history. San Francisco was thrown a bone late in the fourth quarter when a \n     Jermaine Gresham fumble resulted (after official review) in the \n     49ers finding themselves with solid field position and holding a five-point lead with less than five minutes to play. The ensuing five-play, 4-yard drive was as costly as the knuckleball snap.\n\nRANK32\n\nRAIDERS (1-6)\n\n\nPrevious rank:\nNo. 32\n\n The \n     Raiders stay parked in the back lot. Up 28-21 in the fourth quarter, good vibes pervaded the Oakland Coliseum. It was akin to olden times, like when Ken Stabler was throwing floaters to Freddy Stick Hands in the corner of the end zone, or Mark McGwire and Jose Canseco were bashing forearms, or Rich Gannon was peeling off Jerry Rice and Tim Brown to find Jerry Porter downtown. Then the Oakland defense reminded everyone that it was 2018. Hey, at least these guys are still playing for their head coach ... and quarterback.Follow Elliot Harrison on Twitter @HarrisonNFL.\nMore News >\nMore Videos >More Photos >More Gear >"}