{"id": "Lions trade wide receiver Golden Tate to Eagles", "paragraph": "  \nGolden Tate has a new home in the NFC. The Detroit Lions traded the wide receiver to the Philadelphia Eagles on Tuesday for a 2019 third-round pick. Tate announced the news himself on Twitter. Itâ\u0080\u0099s been real DETROIT! Iâ\u0080\u0099ll love ya forever. Philly Philly letâ\u0080\u0099s get it!!Tate was in the final season of his five-year deal in Detroit. NFL Network Insider Ian Rapoport reported that the Lions did not think they could pay him in the offseason, so they sold high. Tate leaves Detroit as the team's leading receiver on the season with 517 yards and three touchdowns on 44 receptions to this name. The veteran wideout saw 26.6 percent of the Lions' targets in 2018. But Tate was the odd man out going forward in a three-man receiving corps that also featured Marvin Jones, who has two years left on his deal, and young up-and-comer Kenny Golladay. \"For more than four years Golden displayed an unwavering commitment to not only his coaches and teammates, but also the City of Detroit,\" Lions general manager Bob Quinn said in a statement. \"The impact he made on and off the field set an example for our team and serves as a testament to his character. We wish Golden and his family the very best in the next step of his career.\"The swap came less than an hour after the Houston Texans traded a fourth-round pick for Demaryius Thomas, a veteran wide receiver whom the Eagles were also reportedly interested in acquiring. \nInstead, Philly has paid a pretty penny for Tate to add to its thin receiving corps. Alshon Jeffery and Nelson Agholor spearhead the pass-catchers, with free-agent acquisition Jordan Matthews, Shelton Gibson and DeAndre Carter rounding the unit. The Eagles have been looking for a third option ever since Mike Wallace suffered a season-ending leg injury in Week 2. Now they have one in Tate, who will likely split time in the slot with Agholor.This is the second major midseason trade Philly has made to improve its offense in as many seasons. Last year, the Eagles traded for Jay Ajayi to add to an already crowded running back room that boasted LeGarrette Blount. That season ended with a parade down Broad Street. Given his expiring contract, Tate will be a one-year rental in Philly. But that the 4-4 Eagles would give up a valuable third-round pick for eight regular-season games' worth of a 30-year-old receiver signals that the team is serious about seizing the NFC East lead back from the 5-2 Redskins, one-upping the contending Cowboys after they acquired a wideout of their own in Amari Cooper, getting back to the postseason and defending their Super Bowl title.Tate and the Eagles will have 12 days to get used to one another before taking the field as Philly's on a bye in Week 9. After that, the Eagles welcome Cooper and the Cowboys to Philly in prime time. Let the games begin in the NFC East. If Tate walks after the season, PHI would likely receive a 3rd or 4th rd comp pick in 2020. Lions chose to make the trade to get that pick now, instead of waiting a year for comp pick. So many teams need weapons for their young QBs...Tate will get big money in the offseason.\nMore Posts\nPhoto Essay\r\n"}