{"id": "NFL Power Rankings, Week 8: Redskins hit top 10; Jags plummet", "paragraph": "\nThe cement is drying, the clay's taking shape. The league's hierarchy continues to set. And \"The Shape of Water\" still shouldn't have won Best Picture. Sorry.The top teams in the Power Rankings are not in flux this week -- and, unlike that movie about flooding your bathroom without the door busting down, the Rams are easily lauded as the best all-around viewing experience in football, moving through their schedule quite swimmingly. The Patriots roll, with a different cast of characters playing the key roles every week. On Sunday, Cordarrelle Patterson and Duron Harmon stepped forward. Meanwhile, Patrick Mahomes remains the NFL's leading man -- and, despite unheralded competition in Philip Rivers, might be the league MVP. By the way, Rivers' team -- and Drew Brees' former team -- keeps winning. Brees' current group of guys does, too, closely chased (again) by those Vikings from the North. Yes, the league's top shelf ... is rounding into shape?What do y'all think?@HarrisonNFL Elliot, big @Chiefs fan and they will be rewarded near the top of your rankings. The @Chargers hype train is in full steam but they have beaten 5 teams with a collective record of 9-24-1. Good team, yes, in the same league as KC & NE in the AFC, not yet.I think Jason just Jedi mind tricked me in there somewhere.NFL didn't want a Sunday night blowout, so it flexed out of Rams-49ers.Good move. Rams won, 39-10.Now, the Chiefs are up 38-10. See? Closer.Solid work, Sam. Although even that point differential didn't hold up in K.C.The Rams and Chiefs can't stop scoring. The Cowboys don't want to go for touchdowns, while the Bills and Cardinals can't produce any. And the fat league middle resembles a parity-driven variety pack. Your varied thoughts are welcome: @HarrisonNFL is the place.Let the dissension commence!PROGRAMMING NOTE: For more in-depth analysis on the updated league pecking order, tune in to NFL Network every Tuesday night at 6 p.m. ET for \"The Power Rankings Show.\" Want to add YOUR voice? Provide your thoughts in a tweet to @HarrisonNFL, and your comments could be featured on air.\n\nRANK1\n\nRAMS (7-0)\n\n\nPrevious rank:\nNo. 1\n\n The \n     Rams charge to 7-0, besting their long-time adversaries from the north. The \n     49ers were no match for a team sitting on the NFL's top shelf, even though the Niners donned the same jerseys they wore in their most recent \n     Super Bowl title season. The usual chatter around the \n     Rams centers around \n     Jared Goff, \n     Todd Gurley and the offense, \n     but on Sunday, it was about the defensive line blowing up the center of the \n     49ers' offense. \n     Aaron Donald posted four sacks and \n     a rip job worthy of Peanut Tillman. While you're watching highlights, check out \n     how fast Donald collapses the pocket, deep in San Francisco territory. Since we're having so much fun with L.A.'s dominance on video ... I never thought this \n     delayyyyyyyyyyyed screen that \n     Goff threw across his body -- and all the way across the field -- would result in Gurley scoring yet another touchdown. \n     \n\nSide note: I have \n     49ers at \n     Rams from 1994 on DVD. Both teams wore the same throwbacks they donned this weekend. L.A. was led by Chris Miller and Chris Chandler at quarterback. Jerome Bettis rushed for over 100 yards. The teams were celebrating the NFL's 75th Anniversary. To think \n     next season is Year 100. Pretty cool.\n\n\nRANK2\n\nPATRIOTS (5-2)\n\n\nPrevious rank:\nNo. 2\n\n The \n     Patriots keep winning, with everyone contributing. \n     On Sunday,\nJosh Gordon made his presence felt -- trucking \n     Bears defenders en route to \n     a near catch-and-run touchdown -- even if he \n     did fail to bat down that Hail Mary ball at the end. Which brings me to \n     Duron Harmon, who deserves kudos for his heads-up approach to \n     that bang-bang play. It was difficult to decipher who made the catch, but Harmon saw that Chicago receiver \n     Kevin White was lumbering forward with the football, a foot away from forcing overtime. That's when Harmon was \n     Duronny-on-the-spot with a stiff tackle. \n     James White must need a stiff drink, considering how many little things he does -- and how many hits he absorbs while doing them.\n\nRANK3\n\nCHIEFS (6-1)\n\n\nPrevious rank:\nNo. 3\n\n Who wants to have a morsel of box-score fun from \n     Sunday night's shellacking of Cincy? Pretend it's 1998, when you still needed to monitor your fantasy team (which featured Tony Gonzalez as your TE and Eddie George as your RB1) by poring over the USA Today sports section. Stat talk: Kansas City ran up 551 yards of offense, an insane number against a defense with the talent level of the \n     Bengals. \n     Patrick Mahomes threw four touchdown passes. \n     Kareem Hunt averaged almost 6 yards per carry and scored three times. Eight \n     Chiefs caught passes from Mahomes, with none going over 100 yards -- that's hard to do when the quarterback chucks it for 358. Going to the other side ... K.C.'s defense might not be of the 1969 variety, but 10 points allowed is 10 points allowed. Bob Sutton's unit gave up all of 239 yards. #ChiefsKingdom\n\nRANK4\n\nSAINTS (5-1)\n\n\nPrevious rank:\nNo. 4\n\n The \n     Saints stay planted in the cleanup spot, with their head coach's stamp all over \n     Sunday's win. Think of Sean Payton calling a successful fake punt on the opening drive. Exhibit B of Payton's panache: Up 21-17 with three minutes to go on first-and-10, a situation in which nearly every team in the league would turn conservative, Brees threw a back-shoulder fade deep downfield to undrafted TE3 \n     Dan Arnold. How about going for it on fourth-and-1, when New Orleans was trailing by three in the fourth quarter and already in field-goal range? (That's not to mention calling for Brees on a quarterback leap over the top.) Then, on the next play, Payton called for a run on a pitch play to his \n     other quarterback, \n     Taysom Hill. That went for 11 yards. Again, protecting a narrow lead with only 2:15 left and the opponent holding a timeout, 90 percent of the coaches in the league would have called a running play on third-and-3, hoping for a 3-yard gain to force the other head coach to burn his last timeout. Payton called for his quarterback to roll out and go for the first down through the air. New Orleans didn't get it, but you get the point.\n\nRANK5\n\nVIKINGS (4-2-1)\n\n\nPrevious rank:\nNo. 5\n\nThis run that \n     Adam Thielen is on, torching the league week in and week out, is edging into historic territory. Thielen recorded 110 yards Sunday, giving him seven straight 100-yard games to start the season, equaling Charley Hennigan's pro football record, set back in 1961 for the AFL's Houston Oilers. And he's threatening more records. There's also the mark for 100-yard receiving performances in a season, which is currently held by Michael Irvin and Calvin Johnson (11), and Marvin Harrison's single-season catch mark (143), set back in 2002. Thielen is on pace for over 150. \n     \n\nSide note:\nXavier Rhodes' injury might be more important than all of the above.\n\nRANK6\n\nCHARGERS (5-2)\n\n\nPrevious rank:\nNo. 6\n\n Whether the \n     Chargers are playing in SoCal or \n     on the Wembley pitch, those powder blues are \n     splennnnndid. They might be the best look in all of pro football. Especially enjoyed \n     Keenan Allen's long-sleeve, monochrome, sky-blue look, if not \n     his meltdown and pylon kick. Meanwhile, \n     Philip Rivers continues to successfully search for any and all receivers, be it \n     Tyrell Williams, \n     Mike Williams or even \n     Antonio Gates, who is 60 years old. \n     The deep ball to Mike Williams was nice. \n     The deep ball to Tyrell was gorgeous and, dare I say, MVP-like. The Bolts have no room above them to move up, though.\n\nRANK7\n\nPANTHERS (4-2)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 9\n\n\nGritty win for the \n     Panthers, who, for the second week in a row, found themselves on the road, trailing an NFC East opponent by multiple scores. Carolina was losing to the defending champs 17-zip in the fourth quarter, then scored touchdowns on three consecutive drives -- marches of 80, 87 and 69 yards. How about the defense? That unit halted the \n     Eagles' final foray with not one but two turnovers. After an apparent \n     Eric Reid interception was overturned by replay, Carolina forced another turnover to end the Philly surge. Clutch.\n\nRANK8\n\nRAVENS (4-3)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 7\n\n Of all the endings Sunday, the one \n     no one could have foreseen was \n     the Ravens losing because \n     Justin Tucker's extra-point try \n     sailed wide right. You would have had far superior odds guessing you wouldn't see Ray Liotta in one of those Chantix commercials. You'd have had a better chance convincing a German that Dirk Nowitzki isn't the best basketball player of all time than correctly predicting Tucker would miss that kick. You'd have been better off prophesying that \n     Ben Roethlisberger won't put on a walking boot at some point this season. (On second thought ...) Small move down for the \n     Ravens, who played mostly well against one of the better teams in the league.\n\nRANK9\n\nSTEELERS (3-2-1)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 8\n\n The \n     Steelers were off this week. Their defense had been \n     on the two weeks before that. Well, as \n     on as it needed to be, allowing only 38 combined points against the \n     Falcons and \n     Bengals. Been saying on \"The Power Rankings Show\" for a month now that Keith Butler's unit merely needs to be viable for this team to go far. While the performances against Atlanta and Cincy were hardly suffocating, think about how well those offenses have played this season. The \n     Falcons scored 104 points over three contests prior to facing Pittsburgh, while the \n     Bengals were averaging over 30 points per game before they fell to Sixburgh. Not bad.\n\n\nRANK10\n\nREDSKINS (4-2)\n\r\n\t\t\t\t\t6\r\n\t\t\t\t\t\nPrevious rank:\nNo. 16\n\n\nHuge win for the Redskins, who, at 4-2, are cruising in the weak NFC East. Weird to call this division weak, huh? Especially for old-time Washington fans who lived though the early 1970s battling Tom Landry's \n     Cowboys, or the '80s against Bill Parcells' \n     Giants or Jimmy Johnson's '90s dynasty in Dallas. Speaking of legacy, \n     Adrian Peterson sure is adding to his. Peterson is on a direct course for 1,000 yards rushing in his 12th season. The list of guys who have reached the 1,000-yard benchmark at that juncture of their career is short and impressive: Franco Harris, Walter Payton, Emmitt Smith, \n     Frank Gore and the baddest \n     Redskins RB of 'em all, John Riggins. Peterson provided enough \n     oomph to a depleted Washington offense to outlast the pesky \n     Cowboys. And by the way, kudos to the \n     Redskins for wearing their whites at home, like they used to. That uni juxtaposed with the Dallas road blues is NFL pageantry, folks. #HTTR #firstplace\n\nRANK11\n\nBEARS (3-3)\n\n\nPrevious rank:\nNo. 11\n\n The opportunities were there for the \n     Bears, who took it to the \n     Patriots\nin the first half Sunday. The second half was a different story, as Chicago was stuck in catch-up mode. Unfortunately, despite the 31 points on offense, the \n     Saints they're not. Before connecting with his wideouts three times on the final drive -- including \n     Kevin White on that startling Hail Mary -- \n     Trubiskers only managed to complete five of his passes to wide receivers. Most of his 22 completions up to that point had been to the backs and tight ends. Even with \n     Taylor Gabriel's resurgence, the \n     Bears must develop an air attack outside.\n\nRANK12\n\nLIONS (3-3)\n\r\n\t\t\t\t\t5\r\n\t\t\t\t\t\nPrevious rank:\nNo. 17\n\n Secure first road win of the season? \n     Check. Climb back into the NFC playoff race? \n     Check. Finally uncover a lead running back? Geez, I hope so. The \n     Lions have gone through Kevin Smith, Jahvid Best, Mikel Leshoure (almost forgot him), \n     Zach Zenner, Joique Bell and \n     Ameer Abdullah while searching for one. Rookie \n     Kerryon Johnson was a huge part of the offense on Sunday, rushing for 158 yards on just 19 carries, adding a couple of catches for good measure. Detroit held the ball for nearly 34 minutes Sunday in Miami, which helps the side of the ball that, well, needs the help.\n\nRANK13\n\nPACKERS (3-2-1)\n\n\nPrevious rank:\nNo. 13\n\n The \n     Packers stay parked at the No. 13 spot after an off week. There are those who still feel this number is unlucky, from fans who note that Dan Marino never won a \n     Super Bowl while wearing it to the two-bit actor with the puffy vest jacket who got whacked by Jason in all the \"Friday the 13th\" movies. Frankly, I am more of a \"Halloween\" guy. If Michael Myers were a Green Bay player, he would probably be too banged up right now to be canoodling with Jamie Lee Curtis. That's why the bye week was so important for the likes of \n     Aaron Rodgers, \n     Randall Cobb, \n     Geronimo Allison and others. \n     \n\nTrivia: Who can tell me who Donald Pleasence was without looking it up? \n     (@HarrisonNFL)\n\nRANK14\n\nEAGLES (3-4)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 12\n\n If the \n     Eagles were in just about any other division but the NFC East, they would not be in fine shape. Not at 3-4, with five of their nine remaining games on the road. Granted, one of those is in London against a reeling \n     Jaguars team. Yet, there is no way Philadelphia, one year after winning the \n     Super Bowl with its backup quarterback, \n     should lose at home with a 17-0 lead and \n     Carson Wentz under center. Even after Wentz was bailed out on that flutter ball \n     Eric Reid intercepted in the red zone, the \n     Eagles couldn't close the deal. A corner was \n     NOT turned \n     in New York, apparently.\n\nRANK15\n\nTEXANS (4-3)\n\r\n\t\t\t\t\t6\r\n\t\t\t\t\t\nPrevious rank:\nNo. 21\n\n Only in the AFC South could the \n     Houston Texans reside in first place. Even diehard \n     Texans fans will tell you this team hasn't been playing well. However, Houston has found ways to win, and that's half the battle in this parity-driven enterprise we watch every week. Noticeable in \n     Sunday's victory: A) \n     Tyrann Mathieu's \n     drive-snuffing pick of \n     Cody Kessler in the fourth quarter, B) \n     DeAndre Hopkins\nwinning a few hands against \n     Jalen Ramsey and C) \n     Lamar Miller rushing for 100 yards. No really, it's true. Look it up, man. Also from the box score: one tackle for \n     Andre Hal. \n     That's the coolest story from this game.\n\nRANK16\n\nBENGALS (4-3)\n\r\n\t\t\t\t\t6\r\n\t\t\t\t\t\nPrevious rank:\nNo. 10\n\n Don't want to overreact to what we all saw at Arrowhead \n     on Sunday night. That was a cruddy performance. (I originally had a more appropriate description there that my editor *wisely* made me take out.) The defense was ... was ... well ... offensive. \n     Bengals fans tweeted early this season about how strong the personnel was on that side of the ball, yet Cincinnati couldn't cover, tackle or buy a third-down stop. Which is nothing major, if you ignore the fact that covering, tackling and stopping teams on third down are three of the major tenets of winning football. Marvin Lewis should instruct his coaches to chuck the game tape. Not worth it. Don't ruin your players' confidence. Next up: \n     the Bucs.\n\nRANK17\n\nSEAHAWKS (3-3)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 18\n\n\nSeahawks fans are feeling mighty confident about their team right now, at least if my Twitter timeline is reflective of a movement. What's odd is that it was those same fans, or presumably many of them, who felt that Pete Carroll's group was going to be headed for a top-five draft pick come April. Most surprising has been the play of the defense, which was thought to be two or three players short of being a solid unit. Through six games, it has held its own, allowing only 19.5 points per game. That is \n     fifth in the NFL. The secondary is playing out of its mind, with Seattle ranking third in the league in both passing yards allowed (206 per game) and passer rating allowed (79.9). Now, it's worth pointing out the quarterbacks Seattle faced: \n     Case Keenum, Mitch Trubisky, \n     Dak Prescott, \n     Josh Rosen, \n     Jared Goff and \n     Derek Carr. One of those guys is playing well. Give you 18 guesses -- and the first 17 don't count -- as to which QB that is.\n\n\nRANK18\n\nCOWBOYS (3-4)\n\r\n\t\t\t\t\t4\r\n\t\t\t\t\t\nPrevious rank:\nNo. 14\n\n The \n     Cowboys can't play for nearly-50-yard field-goal tries on grass, on the road. Not when they have a timeout at their disposal. Either trust the quarterback or don't. Read into that what you will. Speaking of trust, \n     Dak Prescott not trusting his legs until late in the fourth quarter was flat-out vexing. Then when he \n     did take off, subsequent replays showed multiple receivers with steps on defenders. Did you get the feeling that Tony Romo, calling the game for CBS, was trying soooooo hard not to come off as critical of Prescott? What it must be like to watch your replacement miss wide-open reads. \n     The loss to Washington might not have been the defense's best performance, but you can't expect that unit to do everything. Ditto for \n     Cole Beasley. \n     \n\nAmari Cooper trade analysis: The Cooper acquisition undoubtedly upgrades the \n     Cowboys' offense, but at what cost? We know they \n     spent a first-round pick, which doesn't quite put the deal in Roy Williams territory (Dallas also tossed in a 3 in that debacle). On the other hand, even if Cooper's arrival pushes Jerry Jones' team to the postseason, Dallas will lose once there. \n     Jared Goff, \n     Kirk Cousins, \n     Drew Brees, \n     Aaron Rodgers and Cam > Dak. Their coaches are superior, as well. Cooper isn't the missing link, unless the 'Boys intend to draft a QB and force Prescott to compete. Win, \n     Raiders.\n\nRANK19\n\nBRONCOS (3-4)\n\r\n\t\t\t\t\t7\r\n\t\t\t\t\t\nPrevious rank:\nNo. 26\n\n The \n     Broncos rescued their 2018 season \n     Thursday night, then added a few more life preservers by blowing the \n     Cardinals out of the water. The score was 35-3 \n     at halftime. \n     Von Miller and Co. posted six sacks, while taking two turnovers to the house in the first half. As for Miller, \n     he was all motor, as if to send the message that Denver would only waste another season of his prime over his dead body. The poor Cards averaged 2.6 yards per play in the first half. \n     Broncos receiver \n     Emmanuel Sanders (158.3 passer rating) was more effective than any quarterback in this game. Heckuva response to a losing streak, eh, \n     Broncos fans? Word.\n\nRANK20\n\nFALCONS (3-4)\n\r\n\t\t\t\t\t3\r\n\t\t\t\t\t\nPrevious rank:\nNo. 23\n\n Would you believe the \n     Falcons are still in the thick of \n     the wild-card race? They're not exactly sitting pretty at 3-4, but the \n     Packers own the No. 6 seed right now at 3-2-1. Who would've thought \n     Monday night's affair would go scoreless for the first 25 game minutes? That was the case -- until \n     a deep ball produced the evening's first score. Not to \n     Julio Jones or \n     Odell Beckham Jr. or \n     Mohamed Sanu or \n     Sterling Shepard or \n     Calvin Ridley. Nope -- \n     Marvin Hall. \n     Marvin Hall, who had 64 receiving yards coming into the game, nearly equaling that total on one \n     Matt Ryan moonball. Oh, and one more for the road: How about Dan Quinn's \n     backup kicker \n     connecting from 50 and 56 yards?\n\nRANK21\n\nDOLPHINS (4-3)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 19\n\n\nDolphins fans have been all over THE TWITTER about the lack of respect. Understandable, if you look at their winning record -- but NOT understandable when you consider that Miami \n     got blown out in an important game against the \n     Patriots, \n     imploded in Cincinnati,\nbarely escaped the Bears at home (thanks to a \n     Cody Parkey miss), \n     then fell at home to a mediocre \n     Lions team. All of that is why the \n     Dolphins sit in this spot. They are not a bad football team, but how can anyone expect this to be considered a top-10 squad the way they've fared this month ... especially with \n     Brock Osweiler at quarterback?\n\nRANK22\n\nTITANS (3-4)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 24\n\n\nSigns of life in London for the \n     Titans. This space has been admittedly tough on this group, but finally, Tennessee was able to sustain a passing game. Prolific? No. Effective? For the most part. \n     Tajae Sharpe has had nine lives as the \n     Titans' WR1, and he made the most of his ninth Sunday. \n     Dion Lewis performed like the best player on the field. Get those two heavily involved and take advantage of \n     Marcus Mariota's legs -- that's the ticket. Oh boy, did the drops hurt this team, though, especially in the red zone. More importantly: Did you like Mike Vrabel's \n     decision to for two and not OT? Or nah? \n     (@HarrisonNFL)\n\nRANK23\n\nJAGUARS (3-4)\n\r\n\t\t\t\t\t8\r\n\t\t\t\t\t\nPrevious rank:\nNo. 15\n\n This isn't funny anymore. If I ran the Jags, I would call up Terrell Owens and ask him how much he wants for that hyperbaric chamber he employed to get ready for \n     Super Bowl XXXIX. Then I would grab a Ford F-150 or Toyota Tundra from one of the offensive linemen (that's usually what those dudes drive, save for the oddball Jetta-owning center) and haul that sucker over to \n     Leonard Fournette's house. This offense is D.O.A without its stud tailback. \n     Blake Bortles frittered away all the chill vibes from his strong showing in the playoffs, fumbling twice Sunday before getting benched. \n     Keelan Cole lent his quarterback a helping hand(s) -- by not using his.\n\nRANK24\n\nBUCCANEERS (3-3)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 25\n\n\nA long field goal\nwon Sunday for the Bucs. Read that line again, because I can guaran-damn-tee you it's the only time that's been written in Tampa's space in the Power Rankings over the last five years. After clunking an extra point and extremely makeable 40-yarder, \n     Chandler Catanzaro put some modern english on \n     the 59-yard game-winner against the Browns. The make took \n     Jameis Winston off the hook after Winston \n     telegraphed a perfect interception into \n     Jamie Collins' belly, then held the ball for 95 seconds in OT when Tampa Bay could ill-afford a sack. Catanzaro also rescued head coach Dirk Koetter, who pulled off the rare feat of icing his own kicker by throwing a challenge flag in overtime right before the kick, which results in a forced timeout. You see, coaches can't challenge in OT. Koetter should probably know that rule. Never mind. \n     \n\nSide note:\n\"Melt with You\" was a hit song in 1982 by Modern English. #Bucs\n\nRANK25\n\nBROWNS (2-4-1)\n\r\n\t\t\t\t\t5\r\n\t\t\t\t\t\nPrevious rank:\nNo. 20\n\n The \n     Browns\nblew it in Tampa, which \n     would be surprising, given that they controlled the entire second half after falling two touchdowns behind in the first -- but only if you didn't count the penalty-fest Hue Jackson's team threw in that second half. (Yes, his name was included in that sentence on purpose.) Cleveland committed 14 of them for the game, six of which resulted in Bucs first downs. As much as I love \n     Baker Mayfield, he simply can't take \n     that sack in overtime. Sweet revenge for \n     Carl Nassib, even if it's not the kind that \n     compounds at 10 percent per year.\n\nRANK26\n\nJETS (3-4)\n\r\n\t\t\t\t\t4\r\n\t\t\t\t\t\nPrevious rank:\nNo. 22\n\n A few observations from the \n     Jets' \n     37-17 loss to the Vikings: \n     \n\nA) New York has to cool it with the Jekyll-and-Hyde approach to running the football. Sometimes the \n     Jets' ground game reminds me of \n     Tweety Bird on the good stuff; sometimes it just reminds me of Tweety Bird. \n     \nB)\nThat Sam Darnold pick with 8:41 to go put the nail in the coffin. \n     \nC) Hard to live with backup receivers dropping passes. \n     \nD) Those monochrome green jerseys don't bother me much, at least not in this uni matchup. \n     \nE) Still a firm believer in Darnold, who did a whole lot of scratching and clawing Sunday.\n\n\nRANK27\n\nCOLTS (2-5)\n\r\n\t\t\t\t\t2\r\n\t\t\t\t\t\nPrevious rank:\nNo. 29\n\n OK, so the \n     Colts are 2-5. We get it. But you do realize that they are still in the AFC South race, right? The \n     Texans are far from cruising at 4-3, and while Houston did \n     take Indy for a spin a few weeks ago, anyone who watched that nailbiter knows Frank Reich handed the \n     Texans the keys. At worst, the \n     Colts should have ended that afternoon with a tie. The point here is, if -- and it's \n     a very BIG IF -- Indy can run the football half as effectively as it did \n     Sunday (220 rushing yards), the \n     Colts can beat anyone in their division.\n\nRANK28\n\nGIANTS (1-6)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 27\n\n Folks are going to pick on the \n     Giants no matter what, with their 1-6 record and season going nowhere fast. However, on Monday, the defense kept New York in tight the whole night, allowing just 23 points to an Atlanta team that had averaged 34.5 points during its first four home games. \n     Saquon Barkley refuses to give up on any play, even when he loses his feet out from under him. \n     Odell Beckham Jr. caught eight balls for 143 yards and a touchdown, with several of those being contested receptions. Lastly, for all the hating on \n     Eli Manning, the guy was under pressure early and often, yet still managed to pass for 399 yards at over 10 yards per throw. Just an observation.\n\nRANK29\n\nBILLS (2-5)\n\r\n\t\t\t\t\t1\r\n\t\t\t\t\t\nPrevious rank:\nNo. 28\n\n Hey, they \n     are all professionals out there, but ... how do you \n     allow 220 yards rushing to the \n     Colts? Did Edgerrin James steal someone's jersey or something? The front seven, which so often this season has been the teeth of Sean McDermott's team, got beaten at the point of attack repeatedly. That kept \n     Andrew Luck more than comfy. \n     Derek Anderson was decidedly \n     un-comfy. After the offense lost \n     LeSean McCoy and fell behind by multiple scores, it was almost \n     Nathan Peterman time. No, actually, it wasn't \n     that desperate.\n\nRANK30\n\nCARDINALS (1-6)\n\n\nPrevious rank:\nNo. 30\n\n\nCardinals fans have already started lobbying your friendly writer to move their team down to 32. Wish almost granted. Football fans are already speculating about the future of first-year coach Steve Wilks, even if the end of the season is well over two months away. Then there is former offensive coordinator Mike McCoy, \n     dismissed from his duties following \n     another bleak performance from the offense. To think that this team was 8-8 last year with \n     Blaine Gabbert quarterbacking and \n     David Johnson out all season.\n\nRANK31\n\n49ERS (1-6)\n\n\nPrevious rank:\nNo. 31\n\n The \n     49ers wore their old jerseys Sunday, the throwbacks from 1994-95. Of course, they played more like the \n     '55 Niners, who went 4-8. San Francisco might be hard-pressed to reach even that low-water mark, unless they can start blocking better up front. \n     C.J. Beathard was under constant harassment. The \n     Rams' front \n     got to him seven times, with plenty of other pressures to go with it. Sure am glad the \n     49ers were running \n     Alfred Morris up the middle while being down 39-10 in the fourth quarter, though. \n     \n\nSide note: That 1955 San Francisco team was no joke, despite its bleak record. The group had four Hall of Famers -- four! -- in the backfield. Y.A. Tittle was the quarterback. He has been in Canton for decades, along with Joe Perry, Hugh McElhenny and John Henry Johnson (all running backs). McElhenny looked fantastic last I spoke with him. He'll turn 90 this New Year's Eve. NFL history -- \n     49ers history -- is rad.\n\n\nRANK32\n\nRAIDERS (1-5)\n\n\nPrevious rank:\nNo. 32\n\n No, Oakland didn't move up after the bye week. A \n     rested bad team is still bad. Put another way: The \n     Raiders are doing nothing well. They are 28th in scoring, 29th in points allowed. The pass offense is not awful -- 10th in yards per game. Then you realize that \n     Derek Carr is throwing the ball nearly 40 times per game. He will \n     no longer have Amari Cooper to throw the ball to, as you have no doubt heard by now. While it's fair to lament your team selling on the 2018 season, \n     Raiders fans, getting a 1 for an underperforming WR1 who needs to be paid is a heckuva deal.Follow Elliot Harrison on Twitter @HarrisonNFL.\nMore News >\nMore Videos >More Photos >More Gear >"}