{"id": "Parkey practicing kicks at Soldier Field after misses", "paragraph": "  \nAfter watching four kicks bounce off the uprights in a Week 10 home game, give Cody Parkey credit for taking initiative to fix mistakes.The Bears kicker told reporters Wednesday that he plans to return to the scene of the crime and practice kicking at Soldier Field in an attempt to do everything within in his power to make kicks. \"I guess just check all the boxes you can, right?\" Parkey said, via Jeff Dickerson of ESPN \"I mean, it canâ\u0080\u0099t hurt.\" By going to Solider Field to work on kicking, Parkey follows in the footsteps of former Chicago kickers Kevin Butler and Robbie Gould, both of whom would work out at Soldier Field during the regular season to practice kicking. Soldier Field is a 35-mile trip from the teams practice facility, per ESPN. Parkey missed two extra points and two field goals in the Bears' 34-22 win over the Detroit Lions. One attempt clanked off the left upright, while the other three careened off the right upright.  On the season, Parkey has made 13 of 18 attempts for a 72.2 average, which is below his career 84 percentage with four total teams. The Bears, however, haven't lost faith in Parkey after the misses in Week 10, and the team placed their trust in him during the offseason by signing him to a four-year, $15 million deal with $9 million in guarantees.Whether the extra kicks at Soldier Field work in Parkey's favor for Sunday's game against the Minnesota Vikings remains to be seen. But Parkey takes solace in knowing how Green Bay Packers kicker Mason Crosby overcame adversity earlier in the season. Crosby missed four field goals and an extra point in Week 5 before rebounding in Week 6 with a four-field goal performance, including the game-winning kick, to take home the NFC Special Teams Player of the Week award. \"Mason Crosby is a great kicker, and it was really awesome [the way he bounced back],\" Parkey said. \"Hopefully I can go out and do the same thing.\" \nMore Posts\nPhoto Essay\r\n"}