{"id": "Big Ben, Steelers relentless in Panthers steamrolling", "paragraph": "  \nWho needs Le'Veon Bell? The Pittsburgh Steelers' scorching offense put on a steamy performance that left the Carolina Panthers a wrinkled, disheveled mess on Thursday Night Football. Here's what we learned from the Steelers' 52-21 victory to kick off Week 10:1. The Steelers went from zero to thermonuclear on the first snap. Ben Roethlisberger's 75-yard touchdown pass to JuJu Smith-Schuster on Pittsburgh's first play from scrimmage set the blistering tone. An interception by Vince Williams that was returned 17 yards for a touchdown on the first play of the Panthers' ensuing possession stoked the flames that prove too much for Carolina (6-3) to extinguish. Pittsburgh scored on all but one of its first-half possessions en route to scoring 31 points (and it was driving when time expired in the second quarter). The Steelers (6-2-1) kept Roethlisberger on the sideline for most of the fourth quarter after he completed 22 of 25 passes for 328 yards and five touchdowns. His 88.0 completion percentage set a Steelers franchise record and he posted a perfect passer rating of 158.3 for the fourth time of his career (tied with Peyton Manning for the most since 1950). It was a truly dominant performance for Big Ben, who continues to showcase the skills that have made him one of the best signal-callers of his generation. It's amazing to think he was mulling retirement two years ago when watching his performance against the Panthers in conjunction with the rest of his efforts over the Steelers' five-game winning streak. \"We just found ways to capitalize in ways we needed to in order to get a win,\" Roethlisberger told Fox Sports' Kristina Pink after the game.Ben Roethlisberger in Week 10:â\u0080¢ First player with multiple games (2) with a perfect passer rating & 5+ pass TD in Super Bowl eraâ\u0080¢ 6th career game with 5+ pass TD (T-3rd most since 1950)â\u0080¢ Led #Steelers to 52 points (Most points in a game by a Steelers team since 1984)2. So much for the Panthers' defense. Big Ben, Antonio Brown and Smith-Schuster exposed the deficiencies of Carolina's turbid secondary that got little help from its front seven. Pittsburgh's offensive line kept their quarterback TD-tossing fresh by ziplocking him away behind a protective barrier that allowed him to pick apart the Panthers from his favored statuesque pocket pose. With the Steelers' O-line imposing its physical will on the Panthers up front, Pittsburgh's wide receivers ran circles around Carolina's secondary, schooling James Bradberry, Donte Jackson and Eric Reid with harsh effectiveness. Antonio Brown tallied six catches for 96 yards, Smith-Schuster netted three passes for 90 yards and tight end Vance McDonald had four catches for 44 yards. Each had a TD catch during a game featuring the most points ever scored by the Steelers at Heinz Field. \"We gave up plays over the top, which hasn't happened [before],\" Panthers coach Ron Rivera said, whose squad tied the franchise record for the most points allowed in a game.\n3. Christian McCaffrey was the lone bright spot for the Panthers. The second-year running back put in an amazing individual performance even if it was quickly overshadowed by the team's inability to keep up with the Steelers' torrid scoring pace. McCaffrey finished with 138 yards from scrimmage, tallying 77 yards on 14 carries and a TD in conjunction with 61 yards and two TDs on five catches. McCaffrey's ability to add a dynamic playmaker to the Panthers offense played a big part in fueling the team's three-game winning streak prior their headfirst dive into an abyss against the Steelers.4. Does James Conner's concussion spur urgency for a Le'Veon Bell comeback? Conner left the game in the fourth quarter after suffering a concussion and it remains to be seen if the second-year running back is in danger of missing next week's matchup against the Jacksonville Jaguars. Prior to the injury, Conner looked like his normal self, although coach Mike Tomlin was limiting his playing time as early as the second quarter in effort to keep him fresh following just four days of rest. Unfortunately, Conner suffered the concussion after rushing for 65 yards and a touchdown on 13 carries. With Conner's status up in the air, there's an element of Steelerdom that likely will be eager to see Bell return. Time will tell if Bell shows up at the Steelers' facility in the days ahead looking to get in some practice reps.\n5. Pittsburgh's physical dominance extended to the defense. The Steelers sacked Cam Newton five times and pressured him regularly. Newton's pick-six in the first quarter came after Newton threw a last-gasp pass out of the end zone in order to avoid being sacked by T.J. Watt for a safety. Newton later avoided potential disaster when clobbered on a blindsided slobberknocker of a hit by Watt that resulted in a fumble that McCaffrey pounced upon. Cameron Heyward recorded a pair of sacks and Jon Bostic had 10 tackles. In the end, the Steelers were successful in corralling Newton, who finished with 23-of-29 passing for 193 yards and two touchdowns. A week after having his way against the Tampa Bay Buccaneers, Newton simply didn't get the protection he needed to come back against the Steelers. \"We just got whooped, man. We just got whooped,\" Newton said. \"It was a humbling piece of pie. ... At the end of the day, they got the win, and it's hard, but we'll be all right.\"6. Pittsburgh tightens its steel grip on the rest of the AFC North. Upcoming games against the Jaguars and Denver Broncos present winnable opportunities for a team that is very much in the hunt to secure home-field advantage throughout the postseason provided they keep up their dominant ways.\nMore Posts\nPhoto Essay\r\n"}