{"id": "Rams' grand plans; Rodgers vs. Brady; former Bronco fired up", "paragraph": "  \nAs the 2018 NFL season rolls on into Week 9, NFL.com's network of reporters collects the hottest news and notes from across the league, including:-- Gregg Williams' return to the head coach's chair.-- Tom Brady and Aaron Rodgers = Michael Jordan and LeBron James?-- Demaryius Thomas prepares to face old friends.But first, Steve Wyche examines the Rams' team-building approach ...The Los Angeles Rams' acquisition of former Jacksonville Jaguars pass rusher Dante Fowler at this week's trade deadline -- in exchange for a third-round pick in 2019 and a fifth-rounder in 2020 -- continued a trend by the league's only undefeated team to aggressively part ways with draft picks for players who boast an NFL resume.This offseason, Los Angeles surrendered a first-round draft pick in a deal for wide receiver Brandin Cooks. The Rams also made trades for cornerbacks Marcus Peters and Aqib Talib, and added standout defensive tackle Ndamukong Suh in free agency.The additions have paid off, as the Rams enter Week 9 at 8-0. But while the record has been perfect, the roster wasn't. The decision to part with pass rushers Robert Quinn (via trade) and Connor Barwin (via free agency) this spring left a void that interior defenders Aaron Donald, Suh and Michael Brockers could only cover up for so long.\nSo the move was made for Fowler, a former No. 3 overall pick who hasn't lived up to his lofty draft status, but who is expected to pay dividends over the final half of the season. His contract expires after 2018, so this is an audition for Fowler. The Rams didn't mind giving up a third-round pick, because if Fowler pays off, general manager Les Snead said, they're better. If it doesn't work out and the sides part ways, then the Rams still likely will have two third-round picks in the 2019 NFL Draft, because they're expecting corresponding compensatory picks for losing cornerback Trumaine Johnson and wide receiver Sammy Watkins in free agency.\"It drives me nuts when people say that you're going all in to win the Super Bowl this season,\" Snead said. \"You're going all in to maybe give you a millimeter, centimeter, an upper hand.\"Building through the draft leads to sustainability. You've also been able to watch what a team like New England's done. They've used draft picks, but they've also used picks to make trades. They've used free agency. Your whole goal is to acquire players that are going to help Sean McVay and his staff execute in any way possible.\"The Rams did build a nucleus through the draft that includes running back Todd Gurley, Donald, Brockers and safety Lamarcus Joyner. Quarterback Jared Goff was drafted No. 1 overall in 2016 -- don't forget, though, that the rising star was acquired after a trade with the Titans to move up to the top spot.It took McVay, hired in 2017, to improve the perpetually woeful Rams, but he needed supporting pieces, starting with as much offensive help as possible. The Rams' offense ranked last in the league in 2016, which was the team's first season back in L.A., having returned to the city following a 21-year relocation to St. Louis.Left tackle Andrew Whitworth and center John Sullivan were acquired in 2017 free agency. Wide receiver Robert Woods was, too. The Rams traded a second-round pick to Buffalo for Watkins. Los Angeles then went on to win the NFC West, but got knocked off by Atlanta on Wild Card Weekend.The Chiefs signed Watkins to a three-year, $48 million contract this spring -- too rich for the Rams. McVay and Snead pondered waiting for a rookie wideout to possibly fall to them at No. 23 in the draft, but they didn't like their chances that maybe Calvin Ridley would be there. Even if he was, would he immediately measure up to the tsunami of offensive production they'd established?So, they traded a first-rounder for Cooks with every expectation that they'd sign him to a long-term deal. (He ended up inking a five-year, $81 million extension.) McVay wanted him in 2017, but the Rams didn't have the assets to trade for him then.\nL.A. can make a lot of these moves and pay out some hefty contracts in part because Goff is in the third season of a rookie contract that pays him less than $3 million in base salary in 2018. That number is going to radically inflate in a few years -- based on the current quarterback salary escalation, $30 million annually will be the baseline -- but that won't mean the Rams will have to make a massive salary dump to keep Goff.By then, Whitworth, who is now 36, could retire, and Talib could be gone, as well, clearing two contracts at high-salaried positions. Also, the extensions Cooks, Donald and Gurley signed this offseason will be more middle-of-the-pack in terms of dollar value by then, especially with the expected continued increase in the salary cap.That's why, despite all the talk that the Rams are making moves to close the deal this season, Snead said they haven't done anything in a vacuum.\"This isn't just for 2018,\" Snead said. \"We don't want to be 2018 and it's over. What's going on, it's microscopic -- and telescopic.\" NFL: Streamlining the pipeline. The NFL held a first-of-its-kind summit with officials from the NCAA on Tuesday, an initial step toward aligning player safety rules with college and high school levels of the sport, in an attempt to minimize confusion and hasten development as players move up through the ranks.The summit included league owners and general managers, executives from officiating and player safety, a representative from the players' association and NCAA officials. The first goal is to line up rules from the NFL and the NCAA, and then to push that change down to high schools, which will be particularly complicated because only about 75 percent of state high school football associations use the rules set forth by the National Federation of State High School Associations.The group spent most of its time discussing the differences in use of the helmet rules and the cut block, which is banned 5 yards beyond the line of scrimmage in college but has no such restriction in the NFL. That -- according to Rich McKay, chairman of the NFL's Competition Committee -- has sometimes led to NFL players, who have never had to look out for and defend against a cut block downfield, being injured when it occurs in the NFL.\"The idea,\" McKay said, \"is that you try to have unified safety terminology for players so they understand what the foul is and what it isn't, and then teach it all the way down. Beginning with little kids, getting into high school, in college and in the pros. The fact that we have different fouls and talk about them in different ways leads to confusion by the players -- and understandable confusion, I might add.\" -- Judy BattistaThe results: Kickoff returns have dropped from 40.6 percent of all kickoffs last season to 33.4 percent this season (through Week 7). Touchbacks are up to 64.6 percent of all kickoffs, from 56.6 percent last season. McKay said he was surprised that more kicks were not being returned, because the changes have meant that teams are using fewer linemen on the field, meaning there is greater speed available for returns. McKay theorized that because teams anticipated the new rules would lead to more returns, they are instructing their kickers to kick off all the way to the end zone to avoid the return. He believes that as cold and winter weather become factors in distance, there will be more returns.But the Competition Committee was correct about the size of players being used now that wedges are banned. According to the NFL, fewer defensive linemen are being used on kickoff return teams, and almost no offensive linemen are being used, with those players replaced mostly by linebackers. The average weight of kickoff-return players has dropped by 7 pounds. And the speed of kickoff coverage teams has increased by about 1 mile per hour, on both kickoffs that were returned and on those that resulted in touchbacks.  -- Judy Battista* * * * *CLEVELAND BROWNS: Williams settles in. Gregg Williams has never been shy -- and Cleveland Browns players said this week they expect a bit more cursing at practice, now that Williams has taken over as the interim head coach in the wake of the firings of Hue Jackson and offensive coordinator Todd Haley. Williams' appointment raised some eyebrows across many NFL constituencies because he served a one-year suspension starting in 2012 for his admitted role in a bounty scandal while he was the defensive coordinator in New Orleans. Not many people thought Williams would get another chance to be a head coach in the NFL after that, particularly because he was 17-31 in three seasons as the Buffalo Bills' head coach (2001-2003) and he never finished a season with a winning record. \nWilliams, though, was asked if he views the interim job as an audition for his future. He told a story Wednesday -- about how much demand there has been for his services -- that was met with confusion and disbelief in some parts of the NFL. \"Since I left Buffalo, I have had 11 letters sent in to interview for head coaching jobs,\" Williams said. \"In all of them, behind the scenes, I have, and in four of them, I did not even have to show up. Just sign the contract and come. The structure has to be correct. I have my thoughts on how things have to be done. I like things here a lot. I will tell you this, right now, all of my focus and concentration is on this week, and then let's build weeks upon weeks upon weeks and see how much we can. I can't ask for the players to not look ahead if I am looking ahead. They do not do that. This business is too tough to do that type of stuff. You have to go -- today, let's add up each day, continue to press on and do better each day. We will wait and see how the outcome is.\" -- Judy Battista* * * * *DETROIT LIONS: Lions preparing for first game without their former Golden boy. Former Lions wideout Golden Tate -- traded to the Eagles on Tuesday -- just happened to be off to the the best statistical start of his nine-year pro career. Through the team's first seven games of 2018, he was targeted the most (69), had the most catches (44) and naturally hauled in the most receiving yards (517). What's more, his efficiency with the football after catch: In the past 5 seasons, no player in the NFL has been more productive running with the football after receiving it, with Tate leading all players with 2,736 yards (in front of Antonio Brown, Travis Kelce, Leâ\u0080\u0099Veon Bell, and Julio Jones -- in that order). THAT, is impressive.In the case of Tate and the Lions, all good things had to come to an end. Tate is in the final year of his contract, which originated as a five-year deal in 2014 for $31 million. He'll be an unrestricted free agent in 2019.One can argue that outside of former Lions great Calvin Johnson, there hasn't been a pass-catcher Matthew Stafford has relied upon more than Golden Tate when it mattered most -- namely, in third down situations. Since Tate's first year with Detroit, Stafford went to the receiver nearly 28 percent of the time on third down (190 attempts). That's more than any other wideout. In comparison, he went to Calvin Johnson 78 times on third down, second most since 2014. What's more telling since 2014: Golden Tate has 124 receptions in third down situations, good for second in the NFL behind Pittsburgh's Antonio Brown (134 third-down catches). Again, THAT is impressive.All this said, business is business. I spoke with one source close to the team this week who explained the trade in the following manner. Per my source, it was a very difficult decision for the team. There were multiple factors involved. They tried \"hard\" to re-sign him, but it just wasn't going to work. The Lions then received a very \"aggressive\" offer from Philadelphia -- a third-round pick next season -- and it was simply too good of a deal to turn down. It was also noted that coach Matt Patricia and management had grown very close to Tate, making the decision that much more difficult.It's now up to Tate's former teammates to step to the plate and deliver. While it is expected that the usual suspects (Marvin Jones and Kenny Golladay) will get the lion's share of opportunities, two names I am told will see a significantly increased role are TJ Jones and undrafted rookie Brandon Powell out of Florida. Jones is a fifth-year player with just six targets, three catches, and a total of 36 yards receiving this season. Powell, a 5'8\" supposed clone of Golden Tate, saw his first regular season game action in a Week 8 loss to Seattle as a punt returner (he had two returns for eight total yards). He has yet to be targeted this season as a receiver. He did however have an impressive and productive preseason, and is expected to be used in a similar slot capacity to that of Tate.Statistics aside, it may very well be a bigger task replacing Tate in the locker room. Widely respected as a great teammate and fan favorite, other voices will have to increase in volume. Left tackle Taylor Decker told me, \"of course we're sad to see him go ... awesome guy ... obviously he's a great player, very productive, very good at what he does even at his age (31).\" But he also told me the Lions have to move on with a huge divisional game looming on the road against the Vikings in Week 9. Three of the Lions' next four games are in fact, against NFC North foes. Decker also noted, \"we got a bunch of good players in that locker room.\"-- Stacey Dales* * * * *GREEN BAY PACKERS: Rodgers and Brady ... Jordan and LeBron? Trying to pin down Aaron Rodgers on the question of who is the greatest of all time isn't easy. The Packers quarterback remains quick on his feet. Too quick.\"It's tough; different eras,\" he said.Different eras? Sure, Tom Brady is 41, but Rodgers is on the verge of turning 35. They're contemporaries, sort of.\"I grew up born in the '80s watching great basketball ...\"Wait. What?In a mid-week conference call, Rodgers was first asked about the recent Michael Jordan commercial promoting Sunday night's clash of the titans, which will feature Rodgers on one side and Brady on the other. He called that \"humbling.\"But then conversation quickly turned to basketball. Michael vs. LeBron. Who ya got, Aaron?\"... the late '80s and early '90s, and that was Michael's time. Winning six championships, I think most people either loved him or rooted against him, and I was in the loved him category. Loved my local Sacramento Kings, but I was obviously a big Michael Jordan fan.\"\nSo you're on record, Aaron? It's Michael.\"I didn't say that, I definitely didn't say that,\" said the evasive Rodgers. \"I'm a LeBron fan, as well.\"There are no mixed messages, though, when it comes to how Brady feels about his counterpart. The Pats' quarterback said he's been \"inspired\" by the Pack's leader.\"Even for me, I watch his game and it makes me want to get out there and practice and improve, because I think he's so phenomenal with how he manages himself in the pocket,\" Brady said earlier this week. \"His ability to throw the football is unlike anyone in probably the history of the league. So it's just pretty awesome to watch.\"Rodgers says the feeling is mutual. \"I've always been a big fan of his. Just the stuff he does on the field is phenomenal, and then to see him, as he's gotten older in his career, continue to reinvent himself year after year and play at a high level every single season, obviously winning the championships, he's a phenomenal player.\"Any time I get a chance when he's on Thursday night, Sunday night, Monday night, I'm for sure tuning in.\"That's what most of the country will do for Sunday night's Packers-Patriots matchup in Foxborough.-- Mike Giardi* * * * *\nHow much of the playbook Thomas picks up this week will play a role in his playing time, and he's working to maximize both factors. Thomas spent a lot of time during his first practice on Wednesday on the sideline, going over the offense with DeAndre Hopkins. He asked receivers coach John Perry to come to the facility early with him Thursday morning, so the two could put in extra work. DT told me the Texans' playbook is extremely complex, but he added there is carry-over in some terminology between his first head coach in Denver, Josh McDaniels, and O'Brien. Both spent time together in New England under Bill Belichick and share some similarities. Everyone I've spoken with has seen Thomas immediately absorb everything that has been thrown at him. What better way to test yourself than against your former team?-- James Palmer* * * * *KANSAS CITY CHIEFS: Dorsey's former draftees ready for his new team. Browns GM John Dorsey played a big role in building the high-flying Chiefs, who fired him in a stunning move in June 2017 and visit Cleveland on Sunday, days after Dorsey and owner Jimmy Haslam fired coach Hue Jackson and offensive coordinator Todd Haley. But Chiefs players I spoke to Thursday roundly said they didn't think it was weird playing against a team led by the man who drafted Patrick Mahomes, Kareem Hunt, Tyreek Hill, Travis Kelce and 10 other current starters contributing to Kansas City's 7-1 start. As the reigning AFC Defensive Player of the Month, linebacker Dee Ford (another Dorsey pick), put it to me: \"This is the league, man. S--- changes.\"Chiefs coach Andy Reid this week pointed to the role Brett Veach, who was promoted to GM after Dorsey's exit, played in the process of evaluating and trading up for Mahomes, a leading MVP candidate. Now the Browns just have to hope Dorsey's latest QB selection, No. 1 overall pick Baker Mayfield, pans out in similar fashion in an offense now run by interim OC Freddie Kitchens, who has called plays exactly one time: the preseason finale at Detroit. Dorsey has a lot of assets to keep upgrading the NFL's youngest roster, too -- including four picks in the first three rounds of the 2019 NFL Draft.-- Tom Pelissero* * * * *MINNESOTA VIKINGS: People still questioning Kirk Cousins with the Vikings holding a 4-3-1 record atop the NFC North.Vikings quarterback Kirk Cousins has yet to win a playoff game in two tries (in 2012 and 2015, both as a Washington Redskin). With Minnesota currently owning a 4-3-1 record, the criticisms and debates outside of the Vikings' locker room continue.Criticisms and debates aside, Cousins' teammates and opponents have a different take -- one of supreme respect. It's also important to note that Cousins -- now in his seventh pro season -- is having the most efficient season of his career in number of categories. All ranking first in his career: Nearly 43 pass attempts per game, approximately 71 percent completion rate, 315 pass yards per game and a whopping 102.5 passer rating. Pretty impressive.But talk with his teammates, and you'll really understand the impact he has had.Center Pat Elfein told me, \"Kirk, he's a competitor. He's a guy that if you watch him throughout the week getting ready for a game, is dotting his i's and crossing his t's on every single detail imaginable ... he's ready for every situation -- it's not just a coaches responsibility to get the whole offense ready ... Kirk takes it upon himself as well to make sure everyone's on the same page -- he's a real leader in the meeting room and on the field.\"How about the opponents? I talked to Lions defensive tackle Ricky Jean-Francois -- who also happened to play with Cousins in 2015 and 2016 in Washington -- about his thoughts on a quarterback he knows well and is preparing to face this week in Minnesota.\"I was always a fan of his. Always seeing everybody doubting him all the time, I didn't understand why. He always puts up the numbers you wanted him to ... he did anything that any team asked him to do. He just about held every franchise record in the last place he was (Washington). And now people still criticize him. I don't know what else you want him do. I understand everybody wants him to win, but you gotta win as a team, not just as a quarterback ..... he's a good quarterback.\"What Jean-Francois said next however, impressed me most:\"One thing I always loved about him, he stayed humble. No matter all the franchise tags. No matter he got his guaranteed deal. Whatever, he's still that same guy.\"As far as the Lions game planning Cousins and his ninth-ranked total offense in Week 9? Jean-Francois acknowledged all the options the Vikings hav:, \"They have so many weapons -- Kirk's used to them -- Kirk's in 'Toys R Us', with toys -- he has toys any which way or how ... all he's gotta do is be able to get the ball out -- we can't let him get comfortable ... if you let Kirk get comfortable and let that offense get rollin', he can be the All-Pro quarterback that we know he can be.\"-- Stacey DalesLions starting cornerback Nevin Lawson has much respect for wideout Adam Thielen. In a Week 8 loss to the Saints, Vikings receiver Adam Thielen became the first player in NFL history with 100-plus receiving yards in each of his first eight games of a season. Well actually, he tied former Lions great Calvin Johnson for that accomplishment, with Johnson doing it back in 2012. Thus, Thielen can establish sole ownership with another consecutive 100-plus yard receiving game Sunday against Detroit. Think the Lions are ready? I asked Detroit starting cornerback Nevin Lawson for his thoughts on Thielen:\"Thielen is just a savvy veteran. He's very savvy in his route running. Obviously we know that he's not the most athletic receiver, but what he does understand, is his skill set, how to get open. He has great hands. He knows how to catch contested footballs. I feel like he and his quarterback are really on the same page. I feel like he trusts him the most right now.\"The 'most athletic receiver' comment aside, I further asked Lawson to explain what he meant by noting Thielen's ability to catch contested footballs:\"Believe it or not, I feel like he's very physical. He does a lot of dirty work that people don't even recognize for a leading receiver. He's a great blocker ... he'll go down in the box, and go ahead and block safeties, linebackers, defensive ends, whoever he's required to block ... and most receivers aren't doing that, at all -- they're not getting int here and doing that type of dirty work, so I definitely feel like he's a physical player.\"High praise from Lawson, the Lions' defense is up for the challenge of slowing Thielen and company on Sunday.-- Stacey Dales* * * * *NEW YORK GIANTS: New guard unfazed by change of scenery. Jamon Brown was awarded off waivers Wednesday to the New York Giants. Which means he leaves the league's only undefeated team, the Rams, for one of the league's worst.Welcome to New Jersey, Jamon!To his credit, Brown seems to be embracing the opportunity, immediately changing his Twitter profile to \"NY Giants Jamon Brown\" and tweeting this:Headed to the Big Apple!! So thankful for my opportunity to join the .@Giants family! Looking forward to starting this journey!! Letâ\u0080\u0099s do this!! #GoGiants #NYGiants #GiantsPrideCould Brown help the Giants' offensive line? Absolutely. When they return from their current bye, he could be their starting right guard. -- Kimberly Jones* * * * *NEW YORK JETS: Digging into Pryor's departure. On Tuesday, the Bills signed Terrelle Pryor, who was released Oct. 20 by the Jets. Pryor told the Buffalo media he felt \"underused\" by the Jets. To which Todd Bowles offered one of his best lines in his tenure as Jets head coach: \"I think every wideout I've ever known in the history of the game has (thought he has) been underused.\"It was a curious move by the Jets to release Pryor, given the key injuries to Robby Anderson and Quincy Enunwa at wide receiver. Rookie Deontay Burnett, Sam Darnold's former teammate at USC, figures to get more opportunities.Bowles said the Jets would have had to wait four weeks to re-sign Pryor because he was cut with an injury designation. General manager Mike Maccagnan said Thursday that Pryor was released was because of his groin injury, nothing more.Pryor, of course, stayed in the AFC East. The Bills and Jets will meet twice in the final seven games of the season.-- Kimberly Jones\nFocusing on Darnold. This Jets season remains all about Darnold's progress. Bowles and Maccagnan reiterated in recent days that they are pleased with the rookie quarterback. As Bowles said, he sees \"a natural progression each week.\"There have been predictable growing pains. Darnold's 10 interceptions have him tied with Case Keenum and Jameis Winston for the league high. His completion percentage of 55.2 ranks 33rd, just behind fellow rookies Baker Mayfield and Josh Rosen.The Jets are 3-5 for the third consecutive season and in danger of missing the playoffs for the eighth consecutive year. This offseason, they will have around $90 million in salary-cap space, and Maccagnan vowed Thursday to be \"very active\" in free agency. Asked if at some point this is a team that has to win, Maccagnan said, \"Absolutely.\" You can make the argument that point is 2019, and not beyond. -- Kimberly Jones\nMore News >\nMore Videos >More Photos >More Gear >"}