{"id": "Ravens coach John Harbaugh on hot seat in Baltimore", "paragraph": "  \nThe Baltimore Ravens' game against the Steelers on Sunday isn't just important because Baltimore is in third place in the AFC North and losers of two straight. It could also have a serious impact on coach John Harbaugh's future.Pressure is mounting inside the organization on Harbaugh, sources say, as a playoffs-or-bust season is dangerously close to spiraling downward. While a midseason coaching change isn't expected, it hasn't been ruled out, either. A particularly disastrous defeat would send the higher-ups into the bye week with some very real questions and time to ponder their future.Wins need to come or changes will be made.Emotions were especially high after last week's game, a 36-21 loss to the Panthers. While those inside the organization have strong personal feelings for Harbaugh -- he did lead them to a Super Bowl title -- they haven't made the playoffs since 2014. Contractually, the Ravens already put Harbaugh in a win-or-else situation. He received a one-year extension during training camp last year, taking him through 2019. The organization did weigh whether or not to have Harbaugh return after 2017, before deciding he should be back with no changes to his deal. And clearly, the coach is committed to doing everything he can to win with an organization he loves.This offseason, Baltimore spent money in free agency, revamping the receivers room among other things, but the changes haven't made a dent.To make matters more complicated, general manager Eric DeCosta is now in charge, and Harbaugh wasn't his hire. On the field, the defense has been nasty, allowing the fewest points. The roster improved compared to last year.But there is also frustration that rookie quarterback Lamar Jackson, who did have his best game last week, hasn't progressed fast enough. That's but one of the issues.Harbaugh and the Ravens came into the season knowing they needed to win. That's never been more true than right now. Follow Ian Rapoport on Twitter @RapSheet.\nMore News >\n\nMore News >\nMore Baltimore Ravens Videos >More Baltimore Ravens Photos >"}