{"id": "Winners and losers from the 2018 NFL trade deadline", "paragraph": "  \nHowie Roseman and the Philadelphia Eagles front office were into veteran trades before all the cool kids. Sitting at 4-4 with a talented yet incomplete roster, Roseman couldn't help but jump into the action on NFL trade deadline day.The acquisition of receiver Golden Tate on Tuesday augments the Eagles' chances of winning another Super Bowl this year by improving their biggest offensive weakness: wideout depth. The high cost (a third-round pick is heading to Detroit) proves that those in the forward-thinking franchise aren't afraid to make decisions primarily about the present.Tate will be a free agent after this season. While the Eagles will get a jump start on potentially signing him long-term, one of the best slot receivers of this decade will be tempted to test the open market in 2019. If Tate signs elsewhere, the Eagles could get a compensatory pick back for him.Make no mistake: This acquisition is about the next three months, and a Philadelphia squad that couldn't settle on a wide receiver it trusted beyond Alshon Jeffery and Nelson Agholor. Tate remains at the top of his game at age 30, on pace to top 90 catches and 1,000 yards for a third straight season.This is not an explosive Eagles offense, but coach Doug Pederson is an expert at flooding the middle of the field with receivers, and Philadelphia will present challenges with this new trio of wideouts, in addition to tight ends Zach Ertz and Dallas Goedert. The Eagles will need to take a different path to the Super Bowl than they did a year ago, when they cruised to the No. 1 seed in the NFC, but this is a move that serves as a reminder to the rest of the conference that Philadelphia remains very much in the championship picture. Here are the rest of the winners and losers from Tuesday's trades:\nDeshaun Watson, Texans quarterback: The Texans needed another outside receiver after the loss of Will Fuller for the season. They got one in the Broncos' No. 2 all-time leading receiver, Demaryius Thomas, even if Thomas has a much different skill set. The Texans gave up a fourth-round pick and swapped selections in the seventh round with the Broncos partly because, at 5-3, they are in great position to win the AFC South. One year after dealing away left tackle Duane Brown at the deadline, the Texans are buyers and dark-horse Super Bowl contenders in the AFC. The 30-year-old Thomas is no longer as explosive as he once was, and he can struggle with drops, but he's long been well-respected in Denver for his leadership and work ethic. His ability to catch slants and move the chains is perfect for Watson, who is working with an injured rookie in the slot (Keke Coutee) and doesn't have a reliable tight end. Thomas improves the team now and will have to play well for the Texans to keep him at a $14 million base salary next season.The Texans' offense showed signs of life in their Thursday night win over Miami, scoring a season-high 42 points, and can be more reliable if Watson gets the ball out of his hands faster. Thomas will help on that front, starting with what will likely be an emotional matchup in Denver this week.Courtland Sutton, Broncos wide receiver: The trade of Thomas was as much about Sutton's potential as it was Thomas' ability. The rookie outside threat has already shown a penchant for catching jump balls down the field, a key skill when playing with Case Keenum. Sutton has earned 69.2 percent of the team's offensive snaps this season and ranks third in the NFL in yards per reception (19.1). That snap share should approach 100 percent now, as the Broncos' rookie class -- including Sutton, Bradley Chubb, Phillip Lindsay and Royce Freeman -- takes center stage. \nJohn Harbaugh, Ravens coach: It was a swift fall in Green Bay for Ty Montgomery, but he was already headed in the wrong direction in the Packers' backfield. Montgomery only played six offensive snaps before he fumbled away Aaron Rodgers' chances for a game-winning drive Sunday on a kickoff. After NFL.com's Mike Silver wrote about some Packers teammates being upset with the running back/return man, Montgomery said Monday that \"it's tough for me to trust anyone\" in the locker room.Consider it good fortune for Harbaugh, who may be fighting to keep his job. The Ravens (4-4 and in third place in the AFC North) only had to send a 2020 seventh-round pick to Green Bay to obtain the valuable role player. Baltimore's backfield is lacking juice, and Montgomery can absolutely help on passing downs and in the return game. The Ravens already give defensive coordinators a lot to prepare for, with the ways Lamar Jackson can be used on the field; Montgomery should bring the unit even greater flexibility. Jaguars general manager Dave Caldwell: For a former No. 3 overall pick, Dante Fowler was a bust in Jacksonville. There was bad luck involved, as Fowler missed his rookie season in 2015 due to a torn ACL. But Fowler never produced as expected (14.0 career sacks, including 2.0 this year), and he was suspended for violating team rules in August after being handed a Week 1 suspension by the NFL for violating the league's personal conduct policy.Caldwell was ultimately able to salvage a swing and a miss, obtaining a 2019 third-round pick and a 2020 fifth-round pick from the Rams for a player who didn't have a long-term future with the team.Aaron Rodgers' title chances and former GM Ted Thompson's legacy: The Packers dealt safety Ha Ha Clinton-Dix (Thompson's first-round pick in 2014) and Montgomery (Thompson's third-rounder in 2015), getting far lower draft picks in return. (The Redskins sent a 2019 fourth-rounder to Green Bay for Clinton-Dix.) While both moves make some sense in a vacuum -- both players are in the final year of their contracts, and neither was likely to be on the Packers' roster next season -- the departures diminish Green Bay's talent reserves during a playoff run. The Clinton-Dix move is the most disappointing. The fifth-year pro was once viewed as one of the best young free safeties in the league and a core piece of the team, but his play leveled off over the last two seasons. He can absolutely help Washington's secondary, forming a dynamic safety duo with D.J. Swearinger. Clinton-Dix played every defensive snap for the Packers this season for a reason. He's a solid starter at worst, and now the intriguing young Green Bay secondary will get even younger. Coming off a tough loss and entering a difficult stretch of the season, Rodgers can't be thrilled to see yet another veteran Packers teammate leave.Nelson Agholor's fantasy owners: The Eagles traded for Tate in part because Carson Wentz hasn't found receivers open early in downs this season. Agholor has been part of that problem. He's averaging only 9.1 yards per reception and has made a number of mental mistakes throughout the season, failing to top 50 yards in all but two games. Agholor has played more than half his snaps in the slot this season, where he's at his most effective. Tate figures to take some of those inside snaps now, with Agholor lining up even more often as an outside receiver. \nMatthew Stafford and Lions fans: Give Lions general manager Bob Quinn credit for getting a strong return for Golden Tate. Four years of a low-cost third-round pick is worth more than nine games from Tate for a 3-4 team that is not in a title window. With that said, Tate was the team's leader in receptions and yards. He was one of the better free-agent signings in Lions history, more than earning his keep on the five-year, $31 million contract he signed in 2014. This trade makes the 2018 Lions team worse, and it makes Stafford's life more difficult down the stretch. The Lions' passing game had rounded into form over the last month, and Detroit played its top three wideouts (Tate, Marvin Jones and Kenny Golladay) almost exclusively at the position. Fifth-year wideout T.J. Jones figures to be next in line, but that's a steep drop-off from Tate.Any NFC team with a loss: There was already a strong argument to be made that the undefeated Rams were the most balanced team in football before Tuesday, although their lack of an outside pass rush was glaring Sunday against Green Bay. The acquisition of Fowler doesn't change the Super Bowl landscape, but it absolutely gives defensive coordinator Wade Phillips a needed edge rusher to groom.The Rams were thin at outside linebacker entering the year, and injuries have limited some of the options they had. Samson Ebukam (2.0 sacks this season) and Matt Longacre (zero sacks) just aren't impact players, and the desperation the Rams felt can be seen in the price they paid for Fowler: a 2019 third-round pick and a 2020 fifth-round pick. That's a lot to give up for a former No. 3 overall pick whose time in Jacksonville was uneven at best. Follow Gregg Rosenthal on Twitter @greggrosenthal.\nMore Posts\nPhoto Essay\r\n"}