{"id": "QB Index, Week 7: Finally, it's Philip Rivers' year", "paragraph": "\nThis is the Philip Rivers season I've been waiting for, his no-hitter entering the fifth inning that I'm afraid to jinx by writing about.All of Rivers' usual attributes are ever-present. He is throwing his receivers open with the anticipation of someone who already knows how the play is going to end. He's the master of the mid-range game, throwing line drives through zone defenses and teardrops over man coverage down the sideline. He delivers passes just before he's hit, just like he connects on postgame observations that could be stitched, framed and put in your bathroom.\nThe biggest difference this season is the help around Rivers. Second-year pro Mike Williams has added a physical element to an already diverse receiver group. The usually mediocre Chargers running game ranks fourth in yards per carry, with Melvin Gordon and Austin Ekeler on pace for the second-most yards from scrimmage by a backfield duo. Both backs are among the five different Chargers on pace for at least 550 receiving yards. The offensive line, so long a lead apron weighing down Rivers, was transformed by the offseason addition of center Mike Pouncey and the steady overall play of left tackle Russell Okung.Last Sunday's trip to Cleveland would typically be the moment where the wheels came off. (After all, Hue Jackson's only win as a head coach in his first two seasons came against the Chargers.) The Browns' defense entered the game leading the league in takeaways, and the Chargers' offensive tackles have struggled with injuries, a recipe for mistakes. Instead, the only Chargers turnover on an otherwise perfect day came deep into garbage time on a pass that had bounced off of Gordon's hands. Even when Rivers threw a jump ball deep into triple coverage, his receiver (Tyrell Williams) made the catch for him.That Rivers is excelling as his 2004 classmate Eli Manning crashes feels appropriate. Rivers has been the vastly superior quarterback since the day he entered the league -- a mainstay among the top 10 in adjusted yards per attempt, while Manning has cracked that list once. Anyone still arguing Manning's Hall of Fame credentials over those of Rivers is someone whose opinion about football I have very little use for. Life is short. The numbers Rivers has piled up early this season are amazing, even if they are beside the point: 8.8 yards per attempt (third-highest average), 15 touchdowns, three interceptions, second in passer rating (115.1), fourth in QBR and second in DVOA. But Rivers has put up great numbers before. The reason that Rivers' resurgence is the NFL storyline with the highest ceiling is that it's happening at this stage of his football life. Fifteen seasons into a career where Rivers was too often treated like a Chargers fan -- let down by the organization around him -- the 36-year-old father of eight is still chasing that elusive Super Bowl appearance. A deep playoff run by the Chargers -- who have played in only two postseason games this decade -- would allow Rivers to be embraced and recognized like the badass elder statesman he is.Many loyalists on the Rivers/Chargers bandwagon have jumped off out of self-preservation. Fans in San Diego may love Rivers and still watch the Chargers in droves -- but they are understandably ambivalent about the team. Casual fans nationally have grown sick of hearing analysts like me honking every offseason that this is the Chargers' year and treat the team's follies as a punchline.It's often tiring to root for Rivers, a player pushing a boulder up the side of a mountain with a smile on his face even while suiting up for 16 road games a year. That's why I hesitated to even write this latest love letter, for fear that it will be crumpled up and tossed away like in so many other moments when the Chargers appeared to be turning a corner this decade. But failing to embrace this moment would be giving in, turning off the hope that makes sports great. Rivers would never do such a thing.Perhaps Rivers has engendered so many loyalists over the years because he plays the sport as if it could be taken away at any time. He is unfailingly positive and annoyingly competitive. He relishes how lucky he is. As the Chargers head to London this week to face the Titans and the meat of a mostly favorable schedule, I choose not to focus on all the different events that could conspire to break up this latest and greatest season Philip Rivers and his fans have been waiting for. NOTE: This is the Quarterback Index. The QBs are ranked based on 2018 play alone. So what's happened in previous seasons -- and what will happen moving forward -- doesn't matter in this exercise. The next ranking of all 32 starters comes in two weeks.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow Gregg Rosenthal on Twitter @greggrosenthal.The Air Index delivered by FedEx ranks NFL quarterback performances all season long. Check out the FedEx Air NFL Players of the Week and cast your vote.\nMore News >\nMore Videos >More Photos >More Gear >"}