{"id": "Russell Wilson, Seahawks grind out win over Packers", "paragraph": "  \nRussell Wilson found an open Ed Dickson for the game-winning touchdown to cap off the Seattle Seahawks' thrilling 27-24 comeback victory over the Green Bay Packers in Week 11. Here's what we learned on Thursday Night Football:1. Taking advantage of an injury-ravaged defense running on fumes after an impressive third quarter, Wilson led a pair of fourth-quarter scoring drives to keep Seattle in the NFC playoff hunt. Dickson's game-winner came on the heels of back-to-back plays from Tyler Lockett, the latter reception a 34-yard game-changer that went unchallenged by Packers coach Mike McCarthy despite video evidence that the receiver lost possession before the process of the catch was completed.\n2. Falling below the .500 mark in a tightly contested NFC North, the Packers will have to take a long look in the mirror and acknowledge their season-long issues with game management if they miss the postseason for a second consecutive year. Beyond McCarthy's oversight on Lockett's reviewable \"completion,\" he made the head-scratching decision to punt the ball back to Seattle with four minutes remaining and just one timeout in his pocket. The Seahawks promptly picked up a pair of first downs to run out the clock. The predicament isn't new to McCarthy, who has entered the final five minutes of regulation with just one timeout more often than any team in football over the past four years.Asked after the game if anybody in Green Bay's booth wanted to challenge Lockett's catch, McCarthy responded, \"My understanding is they did not.\"3. Aaron Rodgers isn't free from blame. While situational football has been a problem throughout the season, it was a back-breaker at CenturyLink Field, Rodgers' personal house of horrors going back to the infamous \"Fail Mary,\" the blowout loss in the 2014 NFL Kickoff opener and the ignominious collapse in the 2014 NFC Championship Game. Rodgers' extraordinary arm talent was on full display, mixing gorgeous rainbows with off-platform wrist flicks 50 yards downfield to Robert Tonyan and Davante Adams.Pro quarterbacks are ultimately judged, however, by their performance on third downs, in the red zone and in late-game situations. Rodgers came up short on that note, displaying a maddening penchant for holding the ball until he fell prey to drive-killing sacks. How much of that is a natural byproduct of McCarthy's stale offense versus Rodgers' cocksure, improvisational playing style is a long-running conundrum for Packers Twitter to spend hours, weeks and months dissecting. If the riddle doesn't get solved soon, McCarthy will find himself on the hot seat down the stretch.\"The frustration is in the execution,\" Rodgers said. \"The execution just hasn't been great, especially in the situational offense. When you compare it to years past, we've always been good on third down and in the red zone, and we're just not this year. I think that's the combination of a lot of things, but that's the biggest frustration.\"4. Whether it's by way of the franchise tag or a lucrative new contract, impending free agent Frank Clark is going to be a wealthy man at this time next year. Seattle's leading pass rusher has used an explosive first step and relentless pressure to rack up 10 sacks in 10 games this season. He was responsible for two of Rodgers' five sacks absorbed.\"Frankie had another really good game, just causing problems,\" coach Pete Carroll noted after the game.\n5. Fantasy footballers seeking clarity on Seattle's backfield picture are left to decipher 31 touches divided among Chris Carson, Rashaad Penny and Mike Davis. Although Carson was the lead back with 83 yards and a touchdown on 17 carries, Penny escaped several would-be tacklers for another big play and Davis handled third-down duties. Penny might not be a star in the meeting room during the week, but it's hard to ignore his playmaking ability. Until further notice, Carson will remain the starter with Penny as the change-of-pace option and Davis taking over in obvious passing situations.6. Just days after declaring that his knee is finally healthy after four months of pain, Doug Baldwin drew eight targets -- including his first touchdown of the season -- in the game's first 20 minutes. Expect his role to grow in the coming weeks at Carolina then home versus San Francisco and Minnesota.7. Talent recognizes talent. It wasn't until Rodgers personally pleaded Aaron Jones' case that McCarthy finally unleashed his most talented runner as the Packers' featured back. For the second straight week, the explosive second-year back found the end zone twice while topping the century mark in yards from scrimmage. It's perhaps no coincidence that the offense stalled in the second half when Jones became an afterthought. Both of his scores and 88 of his 103 yards came in the first two quarters, as Jones and Davante Adams combined for 21 of Green Bay's first 27 touches.8. Formerly a punching bag for frustrated Packers fans, Kyler Fackrell has emerged as defensive coordinator Mike Pettine's most effective pass rusher. While veterans Clay Matthews and Nick Perry account for $17 million in salary, backups Fackrell and Reggie Gilbert have generated more sacks and QB hits this season. Fackrell set up shop in Seattle's backfield, showcasing impressive closing speed en route to three sacks with another QB hit, a batted pass and a tackle for loss in the run game. He's the first Green Bay defender with a pair of three-sack games in the same season since Matthews accomplished the feat back in 2010.9. Already playing without Perry and cornerback Kevin King, the Packers lost starting defensive linemen Mike Daniels and Kenny Clark and defensive backs Bashaud Breeland and Raven Greene to injuries. An undrafted special teamer, Greene committed a costly pass-interference penalty that led to an easy Seattle touchdown prior to his exit. Attrition is taking its toll on this defense just when McCarthy and Rodgers need it most.10. The Seahawks' victory means the Rams will not become just the second team to secure a division title in Week 11 since the 16-game schedule began in 1978.\nMore Posts\nPhoto Essay\r\n"}