{"id": "Saints-Vikings rematch: Stefon Diggs talks 'Minneapolis Miracle'", "paragraph": "  \nMINNEAPOLIS -- Once again, Stefon Diggs' timing is perfect. He pulls his black Mercedes-Benz S550 next to Revival, one of his favorite local restaurants, and jumps out to find no wait inside. He is wearing red gym shorts, sneakers and a gold hoodie that covers his head, but the waitress immediately recognizes him, more so because of his regular visits than his playmaking abilities as a star receiver with the Minnesota Vikings.We grab a table near the entrance, and Diggs quickly talks up the menu. He loves nearly everything on it, which makes it difficult for him to recommend just one item. Instead, he orders a handful of his favorites and, in no time, the table is covered with plates of dry-rubbed chicken wings, collard greens, mac and cheese, johnnycakes, two cheeseburgers, a fried chicken thigh sandwich and two bottles of grape soda. It comes as no surprise when he says he would love to travel the world sampling food.Amazingly, that might just be the only thing the 6-foot, 191-pounder has not done since making one of the greatest catches in NFL playoff history last January, scoring on a 61-yard catch-and-run as time expired for a 29-24 victory over the New Orleans Saints in the NFC Divisional Round. Since then, he has signed not only a $72 million extension that includes $40 million in guarantees, but also more than 40 endorsement deals.\n\"I wouldn't say my life has changed a lot,\" Diggs says. \"People will stare at me for two minutes and not say anything. Finally, I'll say to them, 'What's up? It's OK. I talk, too.' I want them to know I'm a regular person. I kick it, and I'm super nice to people. I believe you put in good, you get out good, and you treat people with respect. So, I don't ever mind talking to anybody about the play, because that's usually the first thing they bring up.\"That figures to be the case this week more than at any other time, as the Vikings and Saints will meet again in U.S. Bank Stadium on Sunday night for the first time since that dramatic finish. Diggs says he has watched the replay \"a gazillion\" times, and he shakes his head and laughs when told it has more than 4.5 million views on YouTube.To reset the scene: The Vikings squandered a 17-0 third-quarter lead and trailed by one with 10 seconds to play and the ball at their own 39-yard line. They had no timeouts and seemingly no chance of winning when offensive coordinator Pat Shurmur sent in a play called \"Buffalo Right, Seven Heaven.\"\"Buffalo Right\" called for three receivers to line up on the right side of the formation in what's known as a bunch; picture a triangle with one receiver on the line of scrimmage as the point and two receivers behind him as the base. \"Seven\" is the terminology used for corner routes, which would be layered. Tight end Kyle Rudolph would run underneath, receiver Jarius Wright would run deeper behind him, and Diggs would run deeper behind them both. The goal was to have one of them catch the ball near the sideline and get out of bounds to stop the clock and set up a field-goal attempt.\"Jarius is the primary, but as we broke the huddle [QB Case Keenum] said, 'I'm going to give somebody a shot,' and he looked at me,\" Diggs says. \"I didn't think he was going to give it to me, but he threw it. My first thought was, Just let me try to get out of bounds, let me catch it. I jumped in the air and paused in the air to try to high-point the ball and prepare myself to get out of bounds.\"Saints rookie safety Marcus Williams could have ended the game by tackling Diggs immediately after the catch, but instead he went low while Diggs was in the air and completely missed the wideout.\"When he missed and I caught it, I looked at my feet, then I looked at my sideline for a second,\" Diggs recalls. \"I wanted to make sure I kept my feet because I thought I was going to have to fight to get out of bounds. But when I glimpsed and saw my sideline like, \"GOOOOOOOO!\" -- that's when I told myself I'm about to go score a touchdown, a game-winning touchdown. In that split second, I said, I'm going for the goal line. I'm taking it to the crib. I looked inside to see if there was a defender near me, but I was clear. [Williams] had knocked off his own man when he missed me -- otherwise, the guy might have had a chance to make a tackle.\"The play has been dissected so many times we know everything about it, right?\"You might not know that we ran the exact same thing on the previous play and it didn't work,\" Diggs says.Actually, they ran it THREE consecutive times. Keenum threw high to Wright, who had slipped and fallen, on a first-down incompletion. Then he threw low and incomplete to running back Jerick McKinnon on the left side on second down. That set up the decisive score, although the call had some players scratching their helmets.\"I was like, 'We're going to run the same play? Alright, whatever,' \" says Diggs. \"When I scored, the only thing I could think of was to take off my helmet and throw it. I had had a game-tying touchdown before, but never had a walk-off. The energy of it, it felt like a movie, like, 'Gladiator'. Are you not entertained?! In the moment, I was like, 'That's crazy.' I couldn't believe it. Nobody could believe it. It was so funny to see everybody's face. It was like, Did y'all just see what happened?\"Diggs went out with teammates that night, then headed home. He didn't go to bed until 4 or 5 in the morning, saying: \"I was up watching it. I didn't understand what I had done in that moment. I didn't know how big it was. I talked to my family, my little brother, my mom. Everybody couldn't believe it.\"That probably includes Vikings fans, who are accustomed to losing playoff games they were in a position to win, dating to 1975 when the Cowboys won 17-14 after Drew Pearson scored on a 50-yard Hail Mary in the final minute. More recently, Seattle beat them 10-9 in January of 2016 when Blair Walsh missed a 27-yard field goal at home with 22 seconds left; New Orleans defeated them 31-28 in overtime back in early 2010 when Brett Favre threw a terrible interception as they appeared to be driving for a winning field goal at the end of regulation; and with two minutes to go in the 1998 NFC Championship Game, Gary Anderson missed a 38-yard field goal that could have sealed a win over the Falcons and sent the 15-1 Vikings to the Super Bowl.What made Diggs' catch even more special was that it was the first time in NFL playoff history that a game ended with a \"walk-off\" touchdown. The score pushed his Q-Rating from a regional to a national level, and Diggs' infectious personality has made him popular with national companies such as GEICO, which developed a \"sticky hands\" campaign around him.\n\"Everybody has said they've seen the commercial, even people outside of football,\" Diggs says. \"People love to see you do well. For me, I don't change. I'm still laid-back cool. I still kick it with the same people. A lot of opportunities have come my way, and with that comes a lot of responsibility. I understand that. But I do the same stuff. I'm really a homebody.\"When he does go out, he is growing accustomed to the stares.\"People mostly say, 'Thank you,' \" Diggs says. \"I tell them, 'No problem. I was just doing my job. If I could do it 10 times over, I'd do it again.' They're so appreciative and happy. We shared a moment -- how about that?\"Follow Jim Trotter on Twitter @JimTrotter_NFL.\nMore News >\n\nMore News >\nMore Minnesota Vikings Videos >More Minnesota Vikings Photos >"}