{"id": "Dominique Rodgers-Cromartie retiring after 11 seasons", "paragraph": "  \nThe Oakland Raiders are losing another player, this time to retirement. Cornerback Dominique Rodgers-Cromartie announced on Instagram he's hanging up his cleats.  \"Today I retire, today my NFL journey ends, and I thank God for keep(ing) me all these years,\" DRC wrote. \"A kid with one kid and no college offers lasted 11 years in the NFL. I played in Super Bowls, pro bowls, (and) did many more in this leauge. I'm at peace with my decision. Y'all may not understand and that's kool!!! I wanna thank everyone for their support. Never forget MR. Ooouu himself. Yessuh!!!\" A first-round pick by the Arizona Cardinals in 2008 (No. 16 overall), Rodgers-Cromartie earned two Pro Bowl bids and one second-team All-Pro (2016) nod during his 10-plus year career. He played in two Super Bowls, one with the Cardinals and another with the Denver Broncos. The cornerback spent his first three seasons with the Cards before being traded to the Philadelphia Eagles in 2011. After two seasons in Philly, DRC move to Denver where he rejuvenated his career and helped the Broncos reach the Super Bowl. He played the next four seasons with the New York Giants where he was named to the Pro Bowl in 2015. Rodgers-Cromartie signed with the Raiders this offseason. He played in seven games, compiling eight tackles and two passes defended. DRC went from playing 53 defensive snaps in Week 6 for the Raiders to playing zero in Week 8 against the Colts, per Next Gen Stats.  Today i retire, today my nfl journey ends, and i thank god for keep me all these years. A kid with one kid and no college offers lasted 11 years in the NFL. I played in Super Bowls, pro bowls, n did many more in this leauge. Iâ\u0080\u0099m at peace with my decision. Yâ\u0080\u0099all may not understand and thatâ\u0080\u0099s kool!!! I wanna thank everyone for their support. Never forget MR. Ooouu himself. Yessuh!!!A post shared by @ humblecro on Oct 30, 2018 at 8:21am PDT\nMore Posts\nPhoto Essay\r\n"}