{"id": "Rank's 11 Week 9 Sleepers: Target David Moore", "paragraph": "\nListen, I don't get every prediction right. Still, it's hilarious that somebody went through my IG the other day to unearth this gem. Of course, he used the same, \"This didn't age well\" tag. I mean, let's come up with something new. We are more creative as a society. I hope. Although with so many movies and TV shows being remade, maybe we aren't.But I would like to point out that this really has a chance of still coming through for us. Moore got some work last week against the Ravens â\u0080\u0093 including a pair of carries â\u0080\u0093 and did well for himself (5/90 receiving, 2/39 rushing). He didn't break out because the matchup was kind of tough. That shouldn't be much of a problem this week, though. The Buccaneers sounds the \"start everybody\" alarm. When you look at Bye-ageddon this week (six teams on their off date), Moore is a fantastic start. Moore figures to be locked-in with Brent Grimes, which is one of the most advantageous matchups of the week, according to Pro Football Focus.This rookie receiver class has been up-and-down, but we now have three legitimate weekly options. Calvin Ridley had a nice breakout stretch, which Moore could be preparing for. Courtland Sutton looks like he's in a great spot following the Demaryius Thomas trade. Sutton was already coming on strong and working his way into more and more snaps, so it's not too much of a shock to see the Broncos move on from DT. And really, I love Sutton this week, too. But even then, that's not enough to drag me on the IG for this somewhat tepid take. Get me for the other ridiculous stuff I say, because you know I'm going to predict some Julio Jones touchdowns at some point.Here are nine more guys (that's right, I'm counting Sutton as one of my sleepers because I was going to be all about him even before the trade) who can help you this week:I love Fitzmagic. Mostly because he throws it to Mike Evans instead of the other team. Low blow? Maybe. But look at the numbers: When Fitz is the QB, Evans had 483 receiving yards, four touchdowns and his passer rating (when targeted) was 128.5. With Winston, Evans had 287 yards and no touchdowns. Winston's passer rating was 64.9 when targeting him. I'm so glad they made this move, and you also get a lot of value out of Fitzmagic. Really, it was one bad half in Chicago when that defense was humming. You can't be that upset about it. He was the QB1, QB6, and QB4 in those magical first three weeks of the season.It's time for me to breakout Smith again for those of you searching for a quarterback. You know how some leagues have that IR spot? I wish we could keep an extra spot for that, but just for the quarterbacks. I might make that a rule. Because Smith would be my guy. Obviously, I love this matchup against the Falcons who have allowed a top-nine fantasy quarterback in six consecutive games.Listen, I don't know why everyone was so upset with Montgomery after that fumble last week that (might have) cost the Packers a game. You do you, Ty. (Editor's note: Rank is a Bears fan, if you did not notice already.) I love this move for the Ravens. They weren't getting much in the way of running the football. And while they spent a couple of draft picks on tight ends this season, they aren't getting much from that position. So, I like Monty to fill a variety of short-passing roles for the Ravens and get some fantasy burn.The Seahawks were running at a clip of around 100 yards per game in the opening month, but now are churning out nearly 175 rushing yards per game over their last three contests. In fact, no team is more run-heavy over the last month than Seattle. While it takes away the passing volume from Wilson, it does make the passes he's throwing much more effective because of the use of play-action. Per PFF, the 'Hawks have used play-action on 44 percent of their throws over the last three weeks -- the highest rate in the NFL. This is so key for Wilson. Also, he's really found a grove with Moore who played 71 percent of the snaps last week and has four touchdowns in his last three. Moore leads the Seahawks in red zone targets since Week 4. Maybe we're chasing points, but this is a bye-chase.Obviously, he scored a touchdown in Week 8 -- so, that's awesome. But there are other numbers you need to look at that are more telling. He's had seven targets in back-to-back games. That's significant. Miller has also run 67 pass routes which is behind only Trey Burton over the last two weeks. His usage will hinge on Allen Robinson's status (groin), but he's going to end up with a bigger role in this offense sooner rather than later.Jones is in his fifth-year and had semi-breakout of 30 receptions for nearly 400 yards last year. He's going to be the next guy up with Golden Tate now in Philly, and he's worth monitoring. But it's important to note the Lions pass volume had been trending down until last week when they fell behind. And T.J. is clearly the fourth guy on the target totem pole behind Marvin Jones, Kenny Golladay, and Kerryon Johnson. Still, Tate ran most a lot of his routes from the slot and T.J. Jones will likely slide into that mix.Funny story. I wanted to use Dickson on NFL Fantasy Live last week, but was overruled by the producers because there were no highlights of him. Well, guess what? There are now. So, that's awesome. Actually ... it wasn't. The only problem for Dickson is that Nick Vannett is also in the mix and plays more snaps. We want pieces of the Hawks offense attached to a white-hot Russell Wilson. Dickson is a fine, deep bye-week sleeper.Oh man, I wanted to pull the trigger on him last week. I didn't. Heuerman ended up in \"That Helps No One\" purgatory when it should have helped me. Welp. His six end zone targets lead the Broncos this year and he's seen at least one red-zone look in 6-of-8 games. That's great for folks who don't have Evan Engram or that Colts tight end who played for the Lions. Oh shoot, I spaced his name. Wait, Eric Ebron. It came to me. But if you have Ebron, his usage was awful last week. It was disguised because he had a touchdown, but you might need to move on from Ebron.Sam Darnold loves this dude. I'm here for it. Mostly I'm here for the matchup against the Dolphins. Sure, Herndon scoring touchdowns in three consecutive games is fine. And really, the Jets only got that touchdown in Week 8 because Eddie Jackson's ill-timed penalty extended a drive. I mean, we (that's right) had them stopped. But the Dolphins got got (sic) by Michael Roberts for a pair of touchdowns in Week 7 and Matt Zeller of the Texans for a pair in Week 8. And actually, the guy's name was Jordan Thomas, but that random name of Matt Zeller (one of my best friends from my childhood) didn't even phase you. Because the Texans specialize in obscure tight end TDs.\nMore Posts\nPhoto Essay\r\n"}