{"id": "Cohesive Bears line faces toughest task yet in Vikings", "paragraph": "\nThe Chicago Bears are one of the biggest surprises of the NFL through 10 weeks, and a lot of credit is due to the play of second-year quarterback Mitchell Trubisky.Trubisky has engineered an offense that strikes in a variety of methods through the air. Much like how Doug Pederson popularized the run-pass option with 2017's Super Bowl champion Philadelphia Eagles, fellow Andy Reid disciple Matt Nagy, now head coach of the Bears, has Chicago employing quick passes to open receivers underneath. But it's not the only way Chicago is moving the ball via the pass, with Trubisky averaging 2.66 seconds in time to throw, below the league average of 2.73 seconds through 10 weeks.Trubisky has connected with targets at deeper levels by sitting back, surveying and firing. He can do this because his line is giving him plenty of time to work.Chicago ranks fourth in QB pressure percentage at just 19.5 percent of attempts (60 total pressures) -- the three above him are all future Hall of Famers throwing behind the league's best lines: Drew Brees, Tom Brady and Ben Roethlisberger -- and he's been sacked just 18 times. One of those sacks in Week 8 happened because Trubisky was tripped up a yard behind the line while attempting to scramble. This line is doing a bang-up job of keeping defenders off the quarterback.And they're doing so by working well as a group. None of their linemen, save for maybe Cody Whitehair or Kyle Long, is a household name, yet the unit is playing much better than it has in recent years. The quick-strike scheme benefits them some, but opposing defenses aren't shying away from bringing heat -- and the Bears are handling it well.Take this Week 8 blitz pickup, which resulted in an incompletion due to an errant throw from Trubisky, intended for rookie Anthony Miller. New York sends five rushers with a sixth nearby and available to apply pressure, should Trubisky attempt to escape the pocket. Defensive end Henry Anderson twists inside on the rush, seemingly finding an open rush lane, but running back Tarik Cohen steps up to stop him in his path. Whitehair takes on a blitzing linebacker before passing him off to guard James Daniels, then shifting to help Cohen with Anderson as Trubisky unloads with an attempt to drop the ball in the bucket between two defenders.\nHe overthrows Miller, and although it was incomplete, it was a nice illustration of a cohesive group protecting the quarterback.Another good blitz pickup came later in the quarter on another incomplete pass intended for Miller.\nThe Jets send three traditional rushers along with a double corner blitz, and Chicago handles it well. Whitehair picks up Anderson, who rushes outside of him while Leonard Williams twists inside. Whitehair successfully drifts back inside to pick up Williams, while his assistance with Anderson helps Long plant him into the ground, taking out blitzing corner Rashard Robinson in the process. On the other side, tackle Charles Leno Jr. drops quickly enough to get a piece of blitzing corner Buster Skrine, aided by the effort of running back Benny Cunningham.Trubisky gets the ball out before the mass of humans collapses inward, but the pass is just a little too wide of Miller, with the ball glancing off his hand for an incompletion.A decent amount of Trubisky's incompletions are simply errant throws. Pressure is largely a nonfactor in these. Conversely, Trubisky manages to make quick decisions and fire bullets into the catch radius of open targets for completions and, often, a fresh set of downs. It's efficient, and could be even better once Trubisky improves his accuracy.When these attempts succeed, they're gorgeous up front. A four-gap stunt on the part of Anderson is rendered useless on this fourth-down completion to Miller, thanks to the vision of Chicago's linemen. Anderson wraps from the opposite B gap all the way to the C gap, attempting to go around tackle Bobby Massie. He isn't fooled, passing off Tarell Basham to Long while picking up Anderson and pushing him upfield and out of the play. On the interior, Whitehair passes off a stunting Williams to Daniels, and Leno pushes linebacker Jeremiah Attaochu back behind Trubisky, who unleashes a dart to Miller for a gain of 23. At no point in this play was Trubisky even close to being pressured.\nWhen I say Trubisky has time to work, he has plenty of it. On a fourth-quarter completion to Miller for 10 yards, Trubisky had 3.97 seconds before he released the pass to Miller as Attaochu finally caused a pressure at the end of his release.\nChicago is benefiting from two tackles who are agile and strong enough to gain plenty of ground in their pass drops before firmly engaging and maintaining blocks on the edge, which is key to both maintaining pocket integrity and bolstering Trubisky's confidence in the pocket. It's evident in all of the New York tape.Speaking of those tackles, Leno has shown great agility against a variety of rushers. Early in Week 9 against Buffalo, he drops wide to attempt to stop edge rusher Jerry Hughes, who angles inside. Against a slower, less agile tackle, he'd win this battle, but Leno shuffles inside, shields Hughes and stops his desperate spin move in its tracks as Trubisky overthrows Cohen for an incompletion.\nIn watching their last three games, I didn't see a tackle get completely beaten until the second quarter of Week 9, when Shaq Lawson sped around Massie to hit Trubisky after he released the ball for an incompletion. The same goes for the guards, when Daniels was fooled by a nice juke from Kyle Williams, and Daniels still managed to get in the way of Williams. That play ended in a completion for 12 yards. Two key reasons why Chicago does well against rushes of five or more: the blocking of backs, most notably Cunningham, and the aforementioned vision. On this attempt, Cunningham steps up to meet A gap blitzing linebacker Matt Milano, stopping him almost immediately and maintaining his block long enough for Trubisky to step up into the pocket and deliver a pass to Miller for a 19-yard gain. The most impressive part of this play, though, is the way Daniels keeps his head on a swivel. Daniels engages linebacker Lorenzo Alexander, who then drops into coverage, and once he realizes he's without a man to block, looks inside, doubles back and blocks Milano as Trubisky steps up to throw on the run.It's just so pretty.\nChicago does a good job of drawing up plays that include underneath targets in case Trubisky finds himself flustered. Buffalo is one of the league's best defenses, and the Bears hung 41 points on them in part because Trubisky had a ripcord to pull in case of pressure. He did so on multiple occasions to keep drives moving.One went for a touchdown in Week 10 against the Detroit Lions.If we have to identify the worst lineman of the group, it's Witzmann, who is coming off the bench in place of the injured Long. He's done an adequate job, but has also been the lineman who's been beaten the most. Here, he's beaten by Francois' rip move inside, but thanks to Allen Robinson's well-run slant, Trubisky has an easy target to throw to underneath. Robinson caught the bullet and did the rest of the work, sprinting past cornerback Nevin Lawson down the middle of the field for a touchdown.\nEarlier in the same game, he did it again, even when unpressured, dropping and throwing in 2.14 seconds through an open window over Whitehair for a first down.\nFor as much as we see Trubisky missing targets when given time to throw, he makes up for issues on other plays thanks to his athleticism. Especially when rolling out, Trubisky works well when throwing on the run. That helps against stronger defenses that like to send extra rushers, and works even better when Nagy shows a sixth sense and dials up such plays at the right time. Look at this throw. Chicago runs zone action to the left, stonewalling all five rushers to the play side while leaving the backside end unblocked. Trubisky rolls into the expected pressure from the uncovered man, pump fakes and lofts a pass to Taylor Gabriel off his back foot for a gain of 15.\nThis play didn't generate a pressure, per Next Gen Stats, because of the ability of Trubisky to improvise under duress. Even interceptions are usually the result of errant throws and not pressure. On this pass that resulted in a pick in a game that was already well in hand, Trubisky has a clean pocket and time to make a decision. And in keeping with the teamwork displayed by Chicago's front five, Witzmann -- filling in for the injured Long at right guard -- twice helps with rushers, first assisting Whitehair before dropping deeper to get a hand on Alexander, who was slightly winning the rush against Massie.\nTeamwork is a huge reason why this group is effective. No lineman shows a tendency to just sit back when unoccupied. It strengthens the group when facing a variety of rushes, eliminating the existence of a weak link.Their tendency to keep their head on a swivel is clearly something that has been emphasized in practice. Sure, this pass by Trubisky ends in an incompletion, but watch the teamwork between Whitehair and Daniels, who work together to keep Lions defensive tackle Da'Shawn Hand essentially at the line of scrimmage.\nThe point I want to emphasize here is this: Watch the heads of Daniels and Whitehair. While they're both giving at least one hand to Hand (pun unintended), they're both checking their unoccupied side for an additional rusher, who's never even close to arriving. As Daniels slides inside to help with Hand, he's checking his outside. Whitehair does the same while taking most of Hand, peeking inside for somewhere else he might need to help. It's a minute detail, but it goes a long way against heavier rushes, and a great example of how the Bears are succeeding up front.This pops up again in the second quarter of Week 10, with the only downside being Witzmann letting his man go too early, resulting in some late contact with Trubisky. No matter, though, as the pass was completed for a 17-yard gain. And yet again, Whitehair and Daniels identify the blitz and pick it up properly, with Whitehair sliding off Ricky Jean Francois to pick up blitzing linebacker Jarrad Davis, and Daniels dropping off Hand to help with Davis. This keeps the front of the pocket strong, allowing Trubisky to fire a pass to Cohen, who was running a drag, for a nice pickup.Chicago brings one of the best pass-protecting lines into perhaps its toughest matchup of the season in Week 11 against Minnesota. The Vikings rank fourth in the NFL in pressure rate (31.9 percent), second in sack rate (9.4 percent of drop backs), are tied for first in sacks (31.0) and rank 10th in pressures with 105. Next Gen Stats show Trubisky, like most quarterbacks, struggles when under pressure.But Chicago is winning because the Bears aren't allowing Trubisky to be pressured much. That will be key in earning an important NFC North win over the Vikings in Week 11, and beyond.\nMore News >\nMore Videos >More Photos >More Gear >"}