{"id": "Indiana, Purdue both face big tests Saturday before meeting a week later", "paragraph": "Indiana coach Tom Allen understands the challenges his team faces this weekend.\nNo. 4 Michigan is the Big Ten’s highest-ranked team and the one most likely to carry the conference banner into the College Football Playoff, if any team does. The Wolverines have won nine straight since losing to No. 3 Notre Dame and need another win to set up a showdown with No. 9 Ohio State for a ticket to the Big Ten championship game.\nAllen, of course, also knows the refrain echoing throughout his home state: Indiana hasn’t won at Michigan since 1967.\nNone of it matters to the Hoosiers, who ended a four-game losing streak Saturday and now need one more win to become bowl-eligible.\n“We changed our schedule for the very purpose of being at our best in weeks nine, 10, 11 and 12,” Allen said Monday. “We really felt like last year for multiple reasons, it wasn’t just one thing, but for multiple reasons we kind of ran out of juice and did not have the same energy at the end.”\nSaturday’s victory over Maryland should give the Hoosiers (5-5, 2-5 Big Ten) more than just an energy boost.\nThey desperately needed a home win to build some momentum for the home stretch and to give themselves a realistic chance of becoming bowl-eligible for the third time in four years.\nAllen made points perfectly clear to his players last week when he decided to discuss the postseason situation, something he did not do in 2017. Indiana responded to Allen’s message by using Steve Scott’s long run to set up a 42-yard field goal with 2:32 left and then forcing a late turnover to close out the crucial 34-32 win over Maryland.\n\nNow comes the harder part, winning No. 6 at either Michigan this weekend or at home against bitter rival Purdue in its home finale.\n“Anxious for our guys to respond in the right way to be able to build off of this and take momentum into the biggest game of our season,” Allen said. “Our guys understand that.”\nFor programs like Indiana’s, this time of the season can be challenging as speculation runs rampant about bowl destinations and coaching changes.\nJust ask Purdue (5-5, 4-3), which is in a similar predicament, though, in part, for a very different reason.\nThe Boilermakers, who lost at Minnesota on Saturday, also need one win to become bowl-eligible. They host Wisconsin (6-4, 4-3) on Saturday before visiting Bloomington the following week for a potential winner-takes-all regular-season finale.\nThe chatter around Purdue became more complicated after Louisville fired coach Bobby Petrino on Sunday and Boilermakers coach Jeff Brohm immediately jumped to the top of his alma mater’s wish list. Brohm was peppered with questions about the opening Monday and tried to downplay the rumors emanating from his hometown.\n“I have a job, and we’ve got work to do, and a lot of it. We’re going to put forth the effort to do that,” Brohm said. “We’ve got a tough opponent this week, and then we’ve got to go to IU, and we’re going to have to play well, and we’re going to have to play much better than we did last week. So I’m going to stay focused on that, and I’m very appreciative of the job I have right now.”\nBrohm has become a frequently mentioned candidate on the coaching carousel, especially after beating expectations each of his first two seasons at Purdue. Last year, he led the Boilermakers to a bowl game victory and last month Purdue blew out Ohio State in one of this season’s most shocking upsets.\nBut Allen, like Brohm, has only one goal this week: Beating a good opponent this weekend so they don’t have to fret over the stakes next weekend.\n“We know what they’ve accomplished this year,” Allen said, describing Michigan. “They’re really playing at a high level, and Coach (Jim) Harbaugh’s got them doing a lot of great things. So great opportunity, great challenge this weekend.”\n\t130\n\t\t\t\t\t\tAmber Searls-USA TODAY Sports | Amber Searls\t\t\t\t\tHelp | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}