{"id": "Keller scores twice but Coyotes can’t keep pace with Jets", "paragraph": "\nWINNIPEG, Manitoba — Three Jets scored their first goals of the season, defenseman Jacob Trouba had three assists and Winnipeg beat the Arizona Coyotes 5-3 on Saturday.\nTyler Myers, Josh Morrissey and Mathieu Perreault each found the net for the first time. Adam Lowry scored his fourth of the season and Blake Wheeler added an empty-netter. Morrissey and Myers had an assist each and Kyle Connor had two helpers.\nBackup goalie Laurent Brossoit stopped 40 shots for his second victory in two starts as the Jets improved to 3-0-1 on their six-game homestand.\nClayton Keller scored twice and Christian Fischer had a goal for Arizona. Oliver Ekman-Larsson had three assists.\nAntti Raanta made 27 saves for the Coyotes, who haven’t won in Winnipeg since the Jets moved from Atlanta to Manitoba in 2011.\nThe game was tied 1-1 after the first period and Winnipeg led 3-1 after two.\nThe Coyotes were outshooting the Jets 13-2 in the first period with nothing to show for it until Fischer took a pass from Ekman-Larsson and moved the puck around the front of Brossoit before flipping it into the net with 4:23 remaining.\n\"We just have to clean up those penalties.\" — Clayton Keller on after a couple power-play goals hurt the Coyotes in a 5-3 loss to the Jets. pic.twitter.com/ug1zsnKfk3\n— FOX Sports Arizona (@FOXSPORTSAZ) October 20, 2018\nThe Jets went almost 14 minutes between their second and third shots, but made a late one count when Morrissey fired the puck from the point. It hit Lowry’s blade and went in with 44 seconds left in the period.\nArizona had a 16-6 shot advantage in the opening period and went 0 for 2 on the power play.\nWinnipeg got its first power play of the game midway through the second and Raanta stopped all six shots.\nAfter making a couple more big saves, Raanta couldn’t stop Myers’ high shot that made it 2-1 with 5:23 left in the second. Myers had time to move to the net after Trouba drew two Coyotes toward himself.\nOn Winnipeg’s second power play, Mark Scheifele sent Morrissey a pass to the high slot and he bent down low and fired the puck in for the 3-1 lead.\nThe Jets have at least one power-play goal in four straight games.\nArizona’s shot advantage was down to 27-22 after two.\nWow, was Raanta good on that #Yotes PK. pic.twitter.com/LDXR0Ll1FX\n— FOX Sports Arizona (@FOXSPORTSAZ) October 20, 2018\nKeller made it 3-2 at 3:50 of the third, but Winnipeg responded with Perreault’s goal less than two minutes later. A coach’s challenge for goaltender interference on Perreault’s marker was unsuccessful.\nKeller netted his second of the game with a shot under the crossbar on Brossoit’s stick side for a 4-3 score at 11:53.\nArizona had a power play with just over five minutes remaining when Wheeler was penalized for slashing, but Brossoit snapped out his glove to stop a shot by Keller. Wheeler then scored with 42 seconds left.\nCoyotes finish their four-game trip Tuesday against the Columbus Blue Jackets.\t\t\t\t\t\t\tHelp | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}