{"id": "Vikings welcome Everson Griffen back to practice", "paragraph": "EAGAN, Minn. — Everson Griffen was back at practice with the Minnesota Vikings for the first time in almost six weeks, a significant point of progress in returning to his spot at right defensive end and re-establishing his pass-rushing and run-stopping skills in a game setting for the NFC North leaders.\nThe first and most important step, though, was acknowledging his need for mental health treatment in the tough-guy environment of football that has long fostered a mindset of powering through a problem.\n\t“Sometimes you’ve just got to put your pride aside and know when enough is enough. Sometimes you’ve got to take it upon yourself and know when enough is enough and when you can’t handle it,” Griffen said.\nGriffen was a full participant in the workout on Wednesday afternoon, but coach Mike Zimmer said the decision about whether he’d play for the Vikings (4-2-1) on Sunday night against New Orleans would be made at the end of the week. Stephen Weatherly has started in Griffen’s place at right end for the past five games.\n“I feel good. I was able to work out and do the things I have to do, but playing this game of football, it requires more than just working out,” Griffen said. “You’ve got to push somebody, hit somebody, get your timing back.”\nThough Griffen’s reintegration with the defense will be gradual, his welcome by the team was not.\n“It felt great to see my guys, man. I love each and every one of my teammates, and it was just good to see the smiles on their face,” said Griffen, who was taken by ambulance to a hospital on Sept. 22 after a scary series of incidents around the Twin Cities when he threatened violence in a hotel lobby and made repeated comments about people trying to kill him.\n“I had a lot of support from my family, the Minnesota Vikings, the doctors, my teammates, the fans, and you know I want to give my apologizes to people I impacted. I’m sorry if I affected them in any type of way,” Griffen said.\n\t7\n\t\t\t\t\t\tNoah K. Murray | USA TODAY Sports\t\t\t\t\t“I’m just excited to get back here with my team and get back to the grind of things. It’s been hard to be away, but I’m happy to be back. It’s a good feeling right now, and I’m taking one day at a time and one thing at a time to get things back on track.”\nVikings general manager Rick Spielman said the organization was in communication with Griffen’s medical team throughout his hiatus, relying on the professional recommendations regarding his return.\n“This is an illness,” Zimmer said, “and he’s done a good job of helping to get better and continues to try to get better. He is probably going to have to continue to do that, just like we all have to do in life.”\nGriffen politely declined to discuss in detail his treatment plan or specific issues, but said he’d do so in the future to use his public platform as way to positively influence the millions of Americans who struggle with some form of mental illness.\n“You need to ask for help. You need to go out there and find a good support team and do the right things to be able to take care of yourself,” Griffen said.\nSeeking and maintaining a work-life balance was a daily goal that Griffen frequently mentioned during a 10-minute session with reporters, his first such appearance since playing at Green Bay on Sept. 16 in the second game of the season.\n“I learned a lot about the man outside of football. I had a lot of time to reflect on my life and where I want to go and the decisions I made,” he said.\nMake no mistake, though: Being back in the meeting rooms and on the practice field with the Vikings was a cathartic experience.\n“It was awesome, man. Just getting back to life in general, driving my car, doing all the little things,” Griffen said. “You’ve got to appreciate the little things in life.”\n Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}