{"id": "Missouri bounces back to throttle Memphis 65-33", "paragraph": "COLUMBIA, Mo. (AP) — Defense came at a premium in Missouri’s homecoming game against Memphis. The teams combined for 68 points in the first half, and continued to keep the scoreboard operator busy in the second.When it was all said and done, Missouri rolled over Memphis. Drew Lock threw for 350 yards and four touchdowns on 23-for-29 passing, and Missouri defeated Memphis 65-33 in its homecoming game on Saturday.After losing three straight Southeastern Conference contests, Missouri (4-3) responded with a much-needed victory. It jumped out to a 21-0 lead less than six minutes into the game, and never relinquished it.“I thought the offensive staff leading up to today, they did a heck of a job of putting together a game plan, finding a way to get us some matchups,” Missouri coach Barry Odom said. “Some one-on-one matchups. And formationally, we were able to do some things that really gave us an advantage.”Albert Okwuegbunam took advantage of one-on-one coverage multiple times throughout the contest. He caught six passes for 159 yards and three touchdowns and Jalen Knox had five catches for 104 yards and a score.All of Memphis’ scoring came without star running back Darrell Henderson, who exited the game after four carries in the first quarter. He was seen riding on a stationary bike and left to the locker room in the second quarter.Henderson entered the game leading the nation with 1,133 rushing yards, 15 total touchdowns and 10.3 yards per carry. Tony Pollard and Patrick Taylor Jr. split carries the rest of the way, and Memphis’ rushing attack was limited to 4.6 yards per carry.Missouri sprinted out of the gates by blocking a punt on Memphis’ first drive and Christian Holmes intercepted Brady White’s pass for a 42-yard touchdown return on Memphis’ second drive.Memphis (4-4) climbed back with 17 straight points, but Missouri responded with 20 consecutive of its own. Missouri’s defense slowed down the visiting Tigers in the second half, and the home Tigers cruised to their first victory since Sept. 15 against Purdue.THE TAKEAWAYMemphis: Contrary to its close game against No. 10 Central Florida last week, Memphis looked thoroughly outplayed against Missouri. Memphis fans will be closely watching the status of Henderson’s injury.“Not the showing we wanted to have,” Memphis coach Mike Norvell said. “Got off to a slow start, turned the ball over, had miscues in every phase and gave up too many explosive plays defensively and had some missed assignments that really cost us.”Missouri: The Tigers broke out of their three-game losing streak in a big way. Lock and the Missouri offense found its form, and the Tigers look to carry momentum into the second half of SEC play.TURNING POINTAfter 17 unanswered Memphis points, Missouri faced a fourth-and-1 on its own 34. Lock completed a pass to Jonathon Johnson. The next play was a 58-yard touchdown pass to Albert Okwuegbunam. Missouri scored 20 consecutive points to open up its lead.“It’s a pretty gutsy call,” Lock said. “The tides turned. We picked that up, we scored. Came back, scored again. The momentum swang in our way. It was a big point in the game.”HENDERSON HURTAgainst Missouri, Henderson spent more time riding the bike than running the ball. Memphis coach Mike Norvell described the injury as a “tweak” and declined to be more specific. Pollard was prepared to come in relief.“It’s a ‘next man’ mentality,” Pollard said. “That’s how we go about things. You’ve just got to be ready when your number’s called.”UNLOCKEDLock threw for just one touchdown and five interceptions in his previous three games. The last time he tossed for over 300 yards and four touchdowns came against Wyoming in week two, when he compiled 398 yards and four touchdowns.“I thought he was smart with the ball,” Odom said. “He’s continuing to grow, he’s such a talented kid and player. In-game adjustments, I thought, was maybe one of the best ways that he’s done up to this point.”UP NEXTMemphis has a bye week before facing East Carolina on Nov. 3.Missouri returns to conference play with a home matchup next Saturday against No. 14 Kentucky.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}