{"id": "Tyler Reddick gives Earnhardt another Xfinity championship", "paragraph": "HOMESTEAD, Fla. (AP) — Tyler Reddick opened Dale Earnhardt Jr.’s first season in retirement with a victory and closed it with a championship.Reddick won the Xfinity Series finale Saturday at Homestead-Miami Speedway to claim the title in NASCAR’s development series. Reddick was perhaps a long shot behind Christopher Bell and Cole Custer, but with team owner Earnhardt watching from his pit box, he drove away from the contenders and bookended his rookie season with two massive trips to victory lane.“I just knew we had to execute. I thought we had a chance if we just made it to Homestead, it rewards my aggression,” Reddick said. “We hit the wall a lot but the car kept in one piece, enough for me to get to the end. It was an up and down year. We did everything we had to do in the playoffs and we wound up with the championship.“We can hang our hats on that and people will say others were more consistent. We got it when it counted.”The 22-year-old began this season with a victory at Daytona International Speedway in which he beat JRM teammate Elliott Sadler in the closest finish in NASCAR history. His next win was in the finale with everything was on the line.It was Reddick’s final race for JR Motorsports, which won its second consecutive Xfinity championship and third in five years. Reddick is moving to Richard Childress Racing next season and will race against JRM.But he got one final party with his team, albeit without the massive Xfinity championship flag. The flag got caught under his tires as Reddick waved it out his window during celebratory burnouts and he was left with the tattered, burnt remains.“I’m really sad my flag didn’t last very long. I already ripped it apart,” he said. “But I was determined to get to fourth gear and burn this thing down. I picked a really good time to get my life together and win a race.”Earnhardt marveled at how Reddick commanded the top lane of the track. Reddick was able to make the No. 9 Chevrolet stick along the outside wall when other drivers could not and didn’t falter even when his car bounced off the concrete several times.“Tyler had the speed and the nerve to run the laps he needed to keep the lead,” Earnhardt said. “I’m telling you, to run on that fence like he did at the end of that race, it takes some precision. He did such an amazing job doing that. He earned the victory. He earned the championship.”Custer won the pole and the first two stages of the race, but his title hopes were dashed by questionable pit strategy that cost him the lead, the victory and the title. He finished second behind Reddick in a Ford for Stewart-Haas Racing.Daniel Hemric didn’t contend at Homestead and finished fourth in the race, third in the championship standings.Christopher Bell did briefly challenge but was passed by both Reddick and then Custer in the final stage. A late flat tire dropped Bell to 11th, and he finished last in the championship field. Bell won a series-high seven races this season, the most for an Xfinity regular since Earnhardt Jr. also won seven times in 1998.The Xfinity Series is where NASCAR’s future stars are groomed and the championship field Saturday represented all three manufacturers, four different teams and four drivers in their 20s.It was the final event for Sadler, a JR Motorsports driver who is calling it a career after 23 seasons. He toasted his crew with beer at his race car after the race.Brett Moffitt won the Truck Series title Friday night in a caution-free race, and Reddick’s run also was free of yellow flags. Chevy and Toyota each have a championship this weekend, and Ford will try to claim its first Cup title since 2004 on Sunday.Ford’s Stewart-Haas Racing claimed the Xfinity owners championship and had another chance Sunday at a title with Kevin Harvick in NASCAR’s final four.“We’re proud as an organization to win an owners championship, but we wanted to do it with our driver and win a drivers’ championship,” team co-owner Tony Stewart said. “You take the lump but the goal was to win Cole a driver championship.”Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}