{"id": "Shohei Ohtani becomes 3rd Angel to win AL Rookie of the Year", "paragraph": "He truly is the American League’s Greatest (rookie) Sho-man.\nShohei Ohtani’s one of a kind season was enough to edge out Miguel Andujar and Gleyber Torres from the New York Yankees to win the Jackie Robinson American League Rookie of the Year award, Major League Baseball announced Monday. Ohtani is only the third Los Angeles Angels player to win the award, joining Mike Trout and Tim Salmon.\n\nOhtani received 25 of 30 first place votes and 137 total votes, compared to second-place Andujar who received 89 total votes. His elite play on both the mound and in the batter’s box has drawn plenty of comparisons to Babe Ruth.\n\"This is something we haven't seen since Babe Ruth so I'm inclined to say [Shohei] Ohtani is the Rookie of the Year…\"\nCarlos Peña makes the case for the @Angels two-way star to take home the @officialBBWAA AL Rookie of the Year award. #MLBNow pic.twitter.com/XUT1gZBonh\n— MLB Network (@MLBNetwork) November 12, 2018\nShoTime had already been named AL Rookie of the Year by Baseball Digest, as he went 4-2 as a pitcher in the 10 games he started, ending with a 3.31 ERA, 1.16 WHIP and 63 strikeouts over 51 innings. Although his season was cut short due to injury, his batting numbers were still comparable to that of his Rookie of the Year finalist counterparts in far fewer at-bats.\nShohei Ohtani is just the fourth Japanese-born player to earn Rookie of the Year honors. pic.twitter.com/mGD3pDISAj\n— MLB Stat of the Day (@MLBStatoftheDay) November 13, 2018\nHe led all A.L. rookies (min. 300 PA) in OPS (.925), on-base percentage (.361), and slugging percentage (.564) and posted the best rates of at-bats per home run (14.82) and RBI (5.34). Ohtani’s dangerous splitter left batters dumbfounded as they hit .036 (2/55) against it.\nSho me some hardware!\nCongratulations to Shohei Ohtani for being named a finalist for AL Rookie of the Year 🏆@Angels | @MLBonFOX pic.twitter.com/Jd2QfGNSIA\n— FOX Sports West (@FoxSportsWest) November 5, 2018\nAmong his other meaningful accomplishments this season, Ohtani became the first player in Major League history with 20+ home runs and 50 pitching strikeouts in the same season. He joined Ruth as the only players to hit 15 homers while pitching at least 50 innings in a season. He is also the second-fastest Angels rookie to reach 20 home runs, doing so in 91 non-pitching games this season.\nOhtani underwent Tommy John surgery after the season to repair his damaged UCL, taking him out of consideration to pitch in 2019. However, the 24-year-old is expected to be able to rejoin the team as a hitter early in the season. During the award show announcement on MLB Network, Ohtani said his recovery process has been going well and may even be a bit ahead of schedule.\nWill Shohei Ohtani be crowned the 2018 @officialBBWAA AL Rookie of the Year?\nThe @Angels star joined Greg, @Plesac19 and Carlos to chat before tonight's big announcement. pic.twitter.com/c6K2APqjM5\n— MLB Network (@MLBNetwork) November 12, 2018\nAdditionally, Ohtani was the only player in the Majors to have multiple games of two home runs and a stolen base. Also, on Sept. 5 at Texas, he became the second rookie in A.L. history to record four hits, four runs, two home runs and a stolen base in a single game.\nOhtani now joins Ichiro Suzuki and Kazuhiro Sasaki as only the third Japanese player to win AL Rookie of the Year.\t\t\t\t\t\t\tHelp | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}