{"id": "Titans saying all the right things about handling success", "paragraph": "NASHVILLE, Tenn. (AP) — The Tennessee Titans are saying all the right things about learning how to handle success.After beating defending Super Bowl champion Philadelphia earlier this season, the Titans lost three straight. Now they’ve rebounded with back-to-back wins, including Sunday’s 34-10 rout of the reigning AFC champ in New England, and are saying all the right things on staying focused after a big victory.Lots of clichés.“It’s just another step,” quarterback Marcus Mariota said of the big win. “If we just sit here and feel good about ourselves, the next week we’re not going to play very well. It’s nice to build off of it. It’s a great win for us. But, this is not where we want to be and not where we want to go. So, we have to continue to work.”Three-time Pro Bowl defensive lineman Jurrell Casey said beating last year’s Super Bowl teams doesn’t matter.“We got to keep on building week in and week out and get ready for the next opponent coming up next week,” Casey said.That’s a very different tone than the one they had after knocking off the Eagles.There were demands for respect issued by two-time Pro Bowl left tackle Taylor Lewan and 2017 All-Pro safety Kevin Byard after the Titans knocked off the Eagles on Sept. 30. Then they went on the three-game skid.So rookie head coach Mike Vrabel said after the win over the Patriots that he must do a better job helping the Titans handle success than the last time.On Monday, Vrabel said keeping the Titans focused will be easy. All he has to do is start ticking off all the things the Colts (4-5) are doing well: winning three straight, averaging 29 points a game and not allowing a sack in three games.“For me, to try to stand up here and make something up, I won’t have to do that …,” Vrabel said. “So, it won’t be hard for me to look for clips of Indianapolis playing good football.”The Titans (5-4) also have never beaten Andrew Luck, losing all nine games against the quarterback. They swept the Colts last season for the first time since 2002; Luck missed both games with a shoulder injury that put him on injured reserve.Tennessee’s offense has been showing signs of growth in the Titans’ last two wins and is coming off its best performance under first-year coordinator Matt LaFleur. The Titans scored touchdowns on their first two drives for the first time this season and scored a season-high 17 points in the first quarter and nearly matched their previous best in a game by halftime with 24.That pairs nicely with the NFL’s stingiest scoring defense, now allowing only 16.8 points per game. The Titans also rank sixth in total yards allowed, 10th against the run and sixth against the pass.The Titans, who lost three losses by a combined nine points, visit the Colts and then division leader Houston before finishing the season with four of their final five games at home where they are 3-1 this season. Tight end Jonnu Smith says they have to keep stacking wins.“It means nothing if we can’t keep the momentum and get the win the next week,” Smith said.Notes: Vrabel said RB David Fluellen did not tear an ACL when he went down untouched, but will be out this week.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}