{"id": "Indiana Supreme Court rules in favor of FanDuel, DraftKings", "paragraph": "INDIANAPOLIS (AP) — Online fantasy sports providers FanDuel and DraftKings can use the names and statistics of college football players without consent and compensation because the material has news value, the Indiana Supreme Court said Wednesday.The court in a unanimous ruling rejected the claims of former players Akeem Daniels and Cameron Stingily of Northern Illinois and Nick Stoner of Indiana, who argued the companies violated their right of publicity by using their names and statistics without consent and compensation.The use of the material without consent by FanDuel and DraftKings, the defendants in the case, does not violate Indiana’s right of publicity statute “because the use falls within the meaning of ‘material that has newsworthy value,’ an exception under the statute,” said the opinion written by Justice Steven David.“Defendants’ use of players’ names, images, and statistics in conducting fantasy sports competitions bears resemblance to the publication of the same information in newspapers and websites across the nation,” David wrote.R. Stanton Dodge, DraftKings’ chief legal officer, issued a statement saying “sports statistics — and the ability for all fans to freely access them — have always been at the center of the American sports fan experience.”“As previous generations engaged with statistics by reviewing box scores and batting leaders in the newspaper, the modern sports fan engages with statistics by and through playing fantasy sports contests. We have maintained, and are pleased that the Indiana Supreme Court agrees, that sports fans engaging with statistics online in fantasy sports contests does not violate the publicity rights of athletes under Indiana law,” Dodge said.Phone messages seeking comment were left for attorneys representing the players.The players originally filed suit in a state court, but FanDuel and DraftKing got the case moved to federal court in Indianapolis, where the case was dismissed because of the newsworthiness exception. The players then appealed to the 7th U.S. Circuit Court of Appeals, which sent the case back to the Indiana Supreme Court to decide the question of whether the defendants needed the players’ consent to use their names pictures and statistics.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}