{"id": "Conference season takes a toll in the Pac-12", "paragraph": "There’s talk every season about how the Pac-12 cannibalizes itself.Just last week, Oregon coach Mario Cristobal used the word following the Ducks‘ 34-20 loss to Washington State in Pullman. Then Oregon fell 44-15 on the road at Arizona on Saturday, which was marked by dramatic conference upsets.After the chaos, the Cougars were still the only one-loss Pac-12 team left, and they have only a longshot of making the College Football Playoff.Conference coaches often point to parity in the Pac-12 as the reason that it’s difficult for a league team to rise to the top of the national conversation. And yes, it seems antithetical that parity might be hurting the Pac-12, but the heart of the issue is the schedule.It’s notable that no Pac-12 school has played in the CFP championship game since Oregon faced Ohio State following the 2014-15 season, the first year of the playoff. The ACC and the SEC are the only conferences to have teams represented in the playoffs each year since.Coincidentally, the three other Power 5 conferences, including the Pac-12, play a nine-game conference schedule, one more than the ACC and SEC.The nine-game league schedule has been criticized because it’s obviously more difficult, and there’s less likelihood that a team will finish undefeated — which lowers the odds of getting coveted playoff berths. That challenges a conference where some key matchups are played late.Stanford coach David Shaw pointed to how some Pac-12 teams will play a grueling stretch of consecutive conference games without an off week, while other conferences schedule less taxing nonconference games later in the year. Late season nonconference games in the Pac-12 tend to be against higher-profile opponents, like Notre Dame, he said.“My point, for the longest time, is to make sure all the conferences have very similar ways to schedule,” he said. “That’s the only way we can truly evaluate or compare.”Washington coach Chris Petersen agreed the tough schedule has an impact, but said ultimately the playoffs should be expanded to include the possibility of a two-loss team making the field.“Well, I think if there’s that much parity, and you know you’re going to have a team with at least two losses and you’re out, it definitely hurts you. The answer is, if you’re going to take a league that’s got a lot of parity and you think it’s still a really good league, you’ve got to take the league champions,” he said. “You’ve got to expand that situation, but we’re not there yet.”Parity becomes a focus on a day like last Saturday, when upsets ruled.— Oregon State pulled off the biggest, winning a conference game for the first time since 2016 with a 41-34 overtime victory on the road at Colorado.— Unranked Arizona downed the visiting Ducks, giving then-No. 19 Oregon back-to-back losses and three total league losses.— Arizona State toppled USC 38-35, ending the Trojans‘ 19-game winning streak at the Coliseum and edging Clay Helton closer to the hotseat.— California defeated Washington 12-10 without scoring an offensive touchdown.— Washington State’s 41-38 win over Stanford was also technically an upset because the Cardinal were a 3-point favorite at home.Cougars coach Mike Leach also pointed to the nine-game conference slate, while also suggesting the playoffs should be expanded. But he also said he believes the Pac-12 is really that good.“I think our conference is the hardest one to win in every week,” he said on Tuesday’s Pac-12 teleconference.Ultimately, that parity may end up hurting Washington State because losses are dropping the Cougars’ conference opponents out of the rankings. The Pac-12 had five teams in the AP Top 25 last week, and now there are just two.The taxing nine-game conference schedule could be hurting the Pac-12 more generally in the postseason. Last year, the league went just 1-8 in bowl games.Critics also point to frequent Thursday and Friday night games, as well as late-night Saturday starts, that are dictated by the Pac-12’s television contracts. That means East Coast viewers don’t necessarily see key games, putting the league’s teams and star players at a disadvantage when it comes to poll voting or postseason award consideration.Utah coach Kyle Whittingham, whose team popped up to No. 16 in the rankings with a win over UCLA on Friday night, said he can’t concern himself too much with how the Pac-12 stacks up against the other conferences.“Don’t really worry about that to be honest with you,” Whittingham told reporters Monday. “The Pac-12 is competitive and everybody is beating each other up, but our world is the Pac-12 and so I don’t really focus on any other stuff.”Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}