{"id": "Panthers proving they can win without throwing the ball deep", "paragraph": "CHARLOTTE, N.C. (AP) — Cam Newton and the Panthers are proving they can win without throwing the ball deep down the field.\nThe 2015 league MVP has attempted 16 passes — and completed just three — that have travelled longer than 20 yards in the air this season, according the NFL’s Next Gen stats. That’s far fewer than most other NFL quarterbacks. Kansas City’s Patrick Mahomes, for instance, has completed 17 of 42 passes beyond 20 yards, with eight of those going for touchdowns.\nNewton said the lack of vertical passing game isn’t something he’s concerned with entering Sunday’s home game against the Ravens (4-3), especially with his team 4-2 this season.\n“When you are moving the ball, people say why aren’t you taking many shots downfield?” Newton said. “When you take too many shots downfield and it’s not there and you start forcing the ball, they say why can’t you protect the ball? So our thing is we turn our ears to mute and take what the defense is giving us. When we have opportunities to take shots down the field trust and believe nobody loves touchdowns more than I do — and if it’s there I’m going to take it.”\nAdded Newton: “If not, you just live to fight another day.”\nCoach Ron Rivera likes that approach, saying he is just fine with how Newton is playing. Newton has completed 11 touchdown passes this season and has four interceptions and has a solid 94.7 QB rating.\n“I think the quarterback is very efficient with (the ball) right now,” Rivera said. “There’s no reason to panic.”\nThe formula seems to be working for the Panthers, who are winning games behind Newton’s heroics.\nThree weeks ago against the Giants the eighth-year QB rallied Carolina back in the final seconds, leading a drive that set up Graham Gano‘s winning 63-yard field goal. This past Sunday Newton brought the Panthers back from a 17-0 deficit on the road against the Super Bowl champion Eagles with three TD drives to finish the game, earning him his 10th career NFC Offensive Player of the Week honor on Wednesday.\nRivera said when the game is on the line Newton has the same mentality as Michael Jordan, a six-time NBA champion who many still consider the best basketball player of all time.\n“He’ll come up and say, ‘Put it in my hands, coach. Trust me,'” Rivera said of Newton. “Michael Jordan used to say, ‘Certain guys want the ball when it’s crunch time. Other guys just don’t seem to come off the picks the way they’re supposed to.’ I’ve told that to Cam, and Cam has always wanted the ball.”\nAlthough the Panthers still looking stagnant at times on offense — including the first three quarters against the Eagles when they managed just seven first downs and no points — Newton seems adjusting well to new offensive coordinator Norv Turner’s scheme, which features more check downs and screen plays than the Panthers have typically run in the past.\n“When we get into the logistic things of football, and what the defense is giving and what they aren’t, you can’t just go down and chuck the football downfield and just expect, ‘Well, we didn’t take shots in the game,'” Newton said. “That’s not what good teams or offenses do. We don’t let the defense dictate to us, we dictate to the defense. So that’s been our approach.”\nWith the emphasis focused on shorter routes, Newton is completing a career-high 65.6 percent of his passes, well above his career average of 58.9 percent.\nSo while Newton says he likes the big play as much as anyone, he seems fine with Turner’s philosophy — as long as the Panthers are winning games.\n“Whatever Norv and his offensive staff calls it’s my job as the quarterback to execute it,” Newton said. “If I see anything otherwise, it’s my job to make the proper audible. If not, then run the play.”\n Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}