{"id": "Redskins have scored 1 2nd Half TD this season", "paragraph": "ASHBURN, Va. (AP) — Locked in a 7-7 tie against the Dallas Cowboys, the Washington Redskins took the second-half kickoff and drove to first-and-goal at the 9.\nOn first down, Alex Smith had tight end Jeremy Sprinkle open in the end zone, but they were not on the same page and the throw was incomplete. On third down from the 1, Adrian Peterson took a handoff and ran into teammate Vernon Davis, resulting in a 2-yard loss.\nWashington settled for a field goal. Smith and Co. earned another first-and-goal at the 9 in the fourth quarter — and again wound up with just a field goal.\n“We’re obviously struggling when it comes to scoring touchdowns,” coach Jay Gruden said after practice Wednesday as the Redskins prepare to face the New York Giants. “We do have to get better on offense punching the ball in.”\nThe problems in the red zone last Sunday did not wind up hurting the Redskins. They beat the Cowboys 20-17 to improve to 4-2 and extend their lead atop the NFC East.\nBut it is a recurring theme, particularly in the third and fourth quarters.\nGruden’s offense has managed only a single second-half TD all season — and that lone such score was entirely meaningless, reducing Washington’s deficit to 43-19 in a blowout loss at the New Orleans Saints in Week 5.\n“Some of the plays, we’ve missed. We are beating ourselves up over it a little bit. So move on, learn from them and then try to attack the Giants appropriately. Stick with the plan,” Gruden said. “Guys are doing good overall, got some wins, but I know we can do a lot better offensively.”\nHis players cite their own execution as the biggest flaw so far.\nOn that first-and-goal play in the third quarter against Dallas, Smith said he thought Sprinkle would flatten out the route and head toward the sideline, but Sprinkle instead “kept running for the corner.”\nOn that ensuing third-and-goal play, which Peterson said should have been “a walk-in touchdown,” he faulted himself for “not being patient and letting Vernon get across. I would have rubbed right off him and walked into the end zone, pretty much. That is what’s hurting us the most.”\nSmith’s numbers have dropped off from last season, when he led the NFL with a career-best 104.7 passer rating, averaged 8 yards per attempt and completed 67.5 percent of his throws for the Chiefs, who traded him to the Redskins. With Washington, his rating is 91.9, his yards per attempt are down to 7.1, and his completion percentage is 63.3.\n“There’s a lot of room improvement for us out there, especially offensively as a unit. We’ve left some plays out there, for sure,” Smith said.\nPutting some blame on work he still needs to do to jell with new teammates, even though the season is more than a third over, Smith said: “Without a doubt, you’re going to go through some things for a first time out there. You’d love to avoid that, but sometimes it’s unavoidable.”\nNotes: WR Jamison Crowder (ankle), Peterson (shoulder), CB Quinton Dunbar (shin), LG Shawn Lauvao (calf) and LB Zach Brown (illness) missed practice. WR Paul Richardson (knee, shoulder) and RB Chris Thompson (rib, knee) were limited participants. … Thompson, who missed the game against Dallas, said he thinks he will be active at New York. “As long as I keep feeling good throughout the week, then I plan on playing Sunday.”\n Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}