{"id": "UCF comes in at No. 12 in 1st College Football Playoff rankings of season", "paragraph": "If you don’t like the first College Football Playoff selection committee rankings, don’t worry. Saturday’s slate of huge games guarantees major changes are coming next week.\nAlabama, Clemson, LSU and Notre Dame were the top four teams in the initial CFP rankings Tuesday night.\nAfter meeting for a day and a half at a hotel outside Dallas, the 13-member selection committee released the first of its five weekly top 25s before the four-team field is set for the semifinals on Dec. 2.\nMichigan was fifth, followed by Georgia and Oklahoma. Washington State was eighth, the highest-ranked Pac-12 team. Kentucky was ninth.\nOf course, the final rankings are the only ones that matter, but the playoff picture will be reshaped this weekend. Four games matching top-20 teams are on tap Saturday, including Alabama at LSU and Georgia at Kentucky.\nWest Virginia, 13th in the CFP, is at Texas, which is 17th. Michigan hosts Penn State, which came in at 14.\nThe first top four teams were no surprise. The same teams are Nos. 1-4 in the latest Associated Press poll, except with Notre Dame third and LSU fourth.\nOregon athletic director Rob Mullens, who is in his first season as committee chairman, said LSU’s FBS-leading six victories against teams with winning records gave the Tigers the edge over undefeated Notre Dame. The Irish play at Northwestern (5-3) on Saturday.\nUCF was the highest ranked team from outside the Power Five conferences at 12th. The highest ranked team from the so-called Group of Five conferences at the end of the regular season is guaranteed a spot in the New Year’s Six bowls. The Knights, riding a 20-game winning streak, earned that spot last year, beat Auburn in the Peach Bowl and proclaimed themselves national champions.\nUCF has yet to beat a team that currently has a winning record. The strength of schedule held the Knights back, Mullens said. “But you balance that against what you see when you watch the games,” he added.\nLast season, UCF started 18th and rose to 12th by the final rankings.\nIf form holds, two of the top four teams in the first CFP ranking of the season will go on to play in the national semifinals.\nCoaches began downplaying the significance of the rankings even before they were revealed on national television.\n“I didn’t even know that was tonight. I didn’t realize that was going on,” Georgia coach Kirby Smart told reporters. “But I should have talked to my team about that. I didn’t bring it up to them. So who knows what they’ll be thinking tonight.”\nRanking teams is a time-honored tradition in college football, going back to first Associated Press poll in 1936. But what, if anything, can be learned from the first four years of CFP rankings?\nOf the 16 teams the committee ranked in the top four of its initial rankings from 2014-17, half made the playoff. No team ranked third in the first CFP rankings has ever made the playoff.\nThe very first committee rankings, in 2014, had just one eventual playoff team. They included three teams from the Southeastern Conference (though not the one that eventually made the playoff) along with Florida State.\nThat year, the committee first showed its willingness to rank a team that had lost a game ahead of an unbeaten team, like it did Tuesday with LSU and Notre Dame.\nIn 2014, unbeaten defending champion Florida State dropped to No. 3 behind once-beaten Oregon in the committee’s third rankings. It seemed to send a signal the committee would be different from traditional polls that tended to honor win-loss record above all. The second-to-last rankings had Florida State at fourth, behind three teams that had already lost. The Seminoles went into the Rose Bowl semifinal as the No. 3 seed and lost to Oregon.\nAmong the eight teams over the past four seasons that were part of the initial committee top four but did not make the playoff, only one was unranked on selection Sunday. Texas A&M in 2016 was somewhat of a surprising No. 4, and then proceeded to lose three of its final four games.\nThe playoff team that made the longest climb from first committee ranking to final was Ohio State, which started 16th in 2014 and made the semifinals as the fourth seed — and won the championship. Iowa, which has already lost two games, was No. 16 in Tuesday’s rankings.\nThe last two seasons, none of the eventual playoff teams were ranked worse than sixth (Ohio State in 2016) in the committee’s first ranking.\n Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}