{"id": "Reagor scores 2 nifty TDs for TCU in a 16-9 win at Baylor", "paragraph": "WACO, Texas (AP) — TCU was down to its third quarterback and last scholarship running back. Fortunately for the Horned Frogs, they still had speedy playmaker Jalen Reagor on the field.\nReagor turned a screen pass into a 65-yard score and later had a 37-yard touchdown on a fourth-and-1 reverse run as the injury-plagued Frogs beat Baylor 16-9 on Saturday, keeping the Bears from reaching bowl eligibility in their home finale.\n“The way season has gone, I have to do things like this,” Reagor said. “When those injuries happened, I thought, all right, I’ve got to empty the tank more.”\nReagor got the go-ahead score with 2 minutes left in the third quarter when third-string running back Emari Demercado took a direct snap. TCU’s last healthy scholarship running back started right and then flipped to Reagor sweeping the other way. Reagor had a wide-open lane to the end zone.\nTCU (5-6, 3-5 Big 12) can get to a bowl for the 16th time in coach Gary Patterson’s 18 seasons with a win at home next Saturday night against Oklahoma State.\n“That was a gutsy win,” Patterson said. “Want to know what kind of heart and what this program is about, you just need to watch that ball game. There wasn’t any reason why we should have won.”\nTCU fifth-year senior QB Grayson Muehlstein had completed only one pass in his seven career games before starter Michael Collins left the game with a right ankle injury late in the first quarter. That was just another injury in a long list for the Frogs, who have had at least 36 players miss much or all of the season.\nMuehlstein was 11-of-15 for 137 yards and the TD to Reagor, who matched a school record with a TD catch in six consecutive games.\n“All I had to do was throw a quick little short pass, and he did all the rest,” said Muehlstein, who admitted his heart rate accelerated a bit when he realized he was going into the game.\nReagor made the catch near the line of scrimmage, briefly reversed backward and then spun away from a defender. He sprinted down the left sideline for a 65-yard TD and a 9-6 lead upheld on a replay review after he almost got knocked out of bounds inside the 5.\nCharlie Brewer threw for 163 yards and had a 7-yard TD run when he leaped over one of his blockers for Baylor (5-6, 3-5). But Brewer also had one of the two Bears fumbles that led to TCU points.\n“As I told our seniors I thought it was a game we had every opportunity to win,” Bears coach Matt Rhule said. “I know how badly our team wanted to win for our seniors and to be able to send them off the right way.”\nBrewer’s fumble recovered by Corey Bethley on the first play of the second quarter set up the Reagor TD catch. Brewer had ended the first quarter with consecutive runs of 15 and 11 yards, the first converting fourth-and-11.\n“Just a miscue. Obviously something that can’t happen,” Brewer said of the fumble.\nBaylor running back John Lovett fumbled on the second play of the game, setting up Jonathan Song‘s 29-yard field goal.\nBIG PICTURE\nTCU: Muehlstein managed the game when forced into the action. Collins made his fourth start since Shawn Robinson‘s shoulder injury that needed surgery. Collins wasn’t putting any pressure on his right foot and Patterson said he’s probably doubtful next week.\nBaylor: While the Bears still have another chance to get bowl eligible, they really wanted to get that done in the home finale for 10 fifth-year seniors who remained through a sexual assault scandal that rocked the school more than two years ago, and led to only one win in Rhule’s debut last season.\n“Heartbreaking honestly,” Bears senior right tackle Patrick Lawrence said. “Me and my first class played the first game in McLane (Stadium), and just really would have been a storybook ending to go get it done against TCU.”\nEXTRA POINTS\nThe Bears blocked a punt in the first quarter, and blocked the extra point after Reagor’s TD screen play. The seven blocked kicks this season match Baylor’s 1984 total for the third-most in school history. The record is 13 in 1980. … TCU defensive end Ben Banogu, a potential first-round NFL draft pick who returned for his senior season, had 10 tackles, including four tackles for loss and a sack.\nUP NEXT\nTCU home vs. Oklahoma State.\nBaylor plays Texas Tech next Saturday at the home of the NFL’s Dallas Cowboys and the site of the Big 12 championship game.\n \nHelp | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}