{"id": "Struggling with Italy, Immobile is still a threat for Lazio", "paragraph": "ROME (AP) — Having recently lost his starting job for Italy, Ciro Immobile remains a constant scoring threat in Serie A.Perhaps with an eye on regaining his place with the Azzurri, Immobile scored twice and also hit the post to help Lazio beat Spal 4-1 on Sunday.Lazio had lost 3-0 at home to Inter Milan on Monday.“We needed a reaction after the ugly performance against Inter and I’m just pleased that I could help the squad when we really needed it,” Immobile said.Immobile’s brace gave him eight goals for the season, good for second in the league behind Genoa’s Krzysztof Piatek.Immobile was joint top scorer with Inter Milan’s Mauro Icardi last season, with 29 goals apiece. He also led the league with 22 goals for Torino in 2013-14.With Italy, though, Immobile has gone scoreless for more than a year, contributing to the Azzurri’s failure to qualify for the World Cup. He also failed to make an impact at the 2014 World Cup after his breakout season with Torino.“(Italy coach Roberto) Mancini knows me and has always called me up,” Immobile said. “There are always choices to make but I’m always available.”Lazio remained level on points with fourth-placed AC Milan, which won 1-0 at Udinese thanks to a last-gasp winner.Spal is 15th, six points clear of the relegation zone.Immobile opened the scoring with a volley from a corner midway through the first half.Mirco Antenucci quickly equalized for Spal by tapping in a cross from Manuel Lazzari, then Immobile completed his brace with a shot that looped in following a big deflection off a defender.“I want to dedicate the goals to my wife, who always follows me, even to away games, and to tell her that I love her very much,” Immobile said in an impromptu dedication at the end of an on-pitch interview.Danilo Cataldi scored with a blistering effort near the hour mark and Marco Parolo also found the target from beyond the area in the 70th.Immobile then nearly had a hat trick but his header hit the post.CLEAN SHEETThere was late drama at Udinese as Milan scored the winner seven minutes into stoppage time.The game appeared to be heading for a goalless draw when Udinese defender Bram Nuytinck was sent off deep in stoppage time for a terrible tackle on Samu Castillejo.Milan immediately made the most of its numerical advantage as Alessio Romagnoli fired home Suso’s assist after a rapid counterattack.The flag was up for offside but the goal was eventually allowed after consultation with the video assistant referee.Both sides had their chances in an entertaining match that was littered with errors and it was the first time Milan managed to keep a clean sheet since April 15 against Napoli.Milan forward Gonzalo Higuain limped off in the first half with a back injury.SIRIGU’S SAVESTorino goalkeeper Salvatore Sirigu has saved four out of five penalties since the start of 2018 in Serie A — the best rate in Europe’s top five leagues.However, Fabio Quagliarella turned in the rebound from Sirigu’s save for Sampdoria’s only goal in a 4-1 loss to Torino.Andrea Belotti scored twice for Torino, which also got goals from Iago Falque and Armando Izzo.Sirigu is competing with AC Milan’s Gianluigi Donnarumma for the starting job with Italy.Torino is in seventh place.OTHER RESULTSSixth-place Sassuolo beat last-place Chievo Verona 2-0 with an opener from Federico Di Francesco and an own-goal from Emanuel Giaccherini.Atalanta came from behind to win 2-1 at Bologna and Parma and Frosinone played to a 0-0 draw.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}