{"id": "Bucks make franchise-record 22 3s in 144-109 win over Kings", "paragraph": "MILWAUKEE — Giannis Antetokounmpo is taking his game to another level.\nHe had his second triple-double this season with 26 points, 15 rebounds and 11 assists to help the Milwaukee Bucks rout the Sacramento Kings 144-109 on Sunday.\n\t“A great win for the team,” Antetokounmpo said, deflecting any sense of personal satisfaction. “When I drove the ball, they were wide open. I passed it, and they knocked down everything.”\nThe Bucks improved to 8-1 — the best nine-game start in franchise history. They set a season high for points in a game and also set the franchise record for 3s made with 22.\nCoach Mike Budenholzer was happy his team followed Antetokounmpo’s lead.\n“Hopefully, one of the keys to Giannis being great is everybody around him being great,” the Bucks first-year coach said. “We can also talk about a lot of other guys who played well, too. So, that’s a great sign for Giannis and a great sign for us.”\nSeven other Bucks were in double figures. Eric Bledsoe scored 17, Ersan Ilyasova 15, Malcolm Brogdon and Pat Connaughton each had 13, Tony Snell and Khris Middleton each had 12 and John Henson 10.\n“Coach Bud (head coach Mike Budenholzer) wants me to make plays and find them,” Antetokounmpo said. “That is what I am going to keep doing. It feels great.”\nAntetokounmpo completed the triple-double with his 10th assist when he found Connaughton in the corner for 3 and a 108-82 lead as time expired in the third quarter. Antetokounmpo finally went to the bench with 7:48 left in the fourth and the Bucks comfortably ahead 118-90.\n\nHe pushed the lead to 78-54 with two thunderous dunks seconds apart in the third quarter. He slammed one home and then dunked again on a pass from Middleton after a turnover by De’Aaron Fox on the Kings’ ensuing possession.\nAntetokounmpo’s first triple-double came against the Philadelphia 76ers on Oct. 24th when he had 32 points, 18 rebounds and 10 assists.\nJustin Jackson set a career-high with 22 points, Buddy Hield had 19 and De’Aaron Fox 15 for the Kings who had their five-game winning streak snapped.\nJackson felt the team was still upbeat despite the most lopsided loss this season. The Kings had lost 149-129 at New Orleans on Oct. 19.\n“We just went 3-1 on a four-game road trip,” Jackson said. “Obviously, it hurts a little bit to lose like that, but I think we’re extremely happy of how we played this road trip.”\nThe Bucks started to take over with 12-2 run in the second quarter, keyed by seven points from Malcolm Brogdon, and led 72-48 on Ersan Ilyasova’s 3 with 49 seconds left before the half.\nIlyasova scored 15 points and Antetokounmpo and Eric Bledsoe each added 13 as the Bucks surged to their best first half of scoring so far this season and led 72-50 heading into the third. Both teams let in fly from behind the arc. Milwaukee made 11 of 29 3-point attempts, including three by Ilyasova, to Sacramento’s 6 for 19.\n\nTIP-INS\nKings: Hield came in with five straight games of 20 or more points. … Willie Cauley-Stein went to the bench with his fifth foul at 9:13 of the third.\nBucks: G Sterling Brown was recalled from the Wisconsin Herd of the G League. The Bucks sent him to their affiliate to get some playing time.\nFROM BEYOND THE ARC\nThe Bucks set a franchise high with 56 three-point attempts.\n“Obviously, just to get up to 56 3-point attempts is a lot, but that’s what they do,” Kings head coach Dave Joerger said. “They were effective.”\nSTAT LINE\nThe Bucks’ 144 points are the team’s most in a non-overtime game since scoring 147 against the San Antonio Spurs on March 18, 1979.\nUP NEXT\nKings: Host Toronto on Wednesday.\nBucks: Play at Portland on Tuesday.\n \n Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}