{"id": "Nuggets mired in 3-game slump with Rockets arriving in town", "paragraph": "DENVER (AP) — Nuggets coach Michael Malone kept the mood light at practice Monday and the lectures to a minimum.No reason to get too worked up over Denver’s current three-game skid. After all, this is the same bunch that began 9-1 for one of the best starts in franchise history.Malone’s missive to his team: Rediscover that resolve.“It’s too early in the season to have their heads down and have it be gloom and doom,” said Malone, whose team hosts James Harden, Chris Paul and the Houston Rockets on Tuesday night. “We’re young. Some of these guys are in moments they haven’t been in before. That’s my job, to teach and keep this team moving along in the right direction.”Given their recent history, there’s a sense of early season urgency. That’s understandable since the Nuggets missed the playoffs by a game in each of the last two years. They don’t want piled-up losses in November to come back and haunt them in April.Especially since everything was going so smoothly out of the gate. But the Nuggets (9-4) have followed a two-point loss in Memphis with two straight defeats at home —112-110 to Brooklyn on Friday and 121-114 to Milwaukee on Sunday, where 7-footer Brook Lopez hit eight 3-pointers.“The first thing is to acknowledge it for what it is — a couple really close losses,” said Nuggets center Mason Plumlee, whose team had only one skid that reached as high as three games a season ago. “But I wouldn’t call it a tailspin. We have another opportunity (against Houston) to get back on track.”This is a Nuggets team that a week ago was being billed as one of the surprises in the West. They knocked off Boston in a game where Jamal Murray erupted for 48 points. Murray took some heat, though, for shooting at the buzzer in his bid to reach 50.In the three losses since the Celtics contest, he’s scored a combined 45 points.It’s also been an up-and-down stretch for standout center Nikola Jokic, who’s gone from taking one jumper against Memphis — a long 3-pointer at the end — to bouncing back with 37 points against Brooklyn to scoring 20 against Milwaukee. He also had a late turnover against the Bucks — one of three Nuggets miscues over the final 3:04 with the team leading by a basket.“There’s not like a big disconnect,” Plumlee said. “We have to execute better on both ends in late-game situations. It’s unexpected because we executed so well early and often in that winning streak. We did last year, too. It will be better.”On Monday, the Nuggets spent the early portion of practice reviewing game film. Like always, Malone showed footage and asked for volunteers to give their input. And like always, one of the hands that shot up belonged to injured point guard Isaiah Thomas.His words carry a lot of weight even if he can’t take the floor as he recovers from hip surgery.“The guys understand his body of work, the player he has been, and the player he will be again,” Malone said. “His leadership, his voice, his encouraging guys, his getting on guys, I think it’s invaluable.”Just Thomas’ way of being a leader. There remains no timetable for his return.“You need a guy like that in the locker room,” guard Monte Morris said. “When it’s good, he’ll tell you. When it’s bad, he just tells us. We definitely appreciate him.”One early surprise has been the play of the bench, with Morris, Trey Lyles, Plumlee and Malik Beasley giving the Nuggets a lift. Case in point: Morris had a career-high 10 assists against the Bucks.“Our fun is creating turnovers and getting out into the transition, giving the fans at Pepsi Center what they came to see — fast basketball,” Morris said. “If we can defend like we’ve been doing and get out in transition, it will be fun. We’ve been having fun all year.”This losing stretch, Plumlee reasoned, is just a tiny hiccup.“But we’re a good enough team where that shouldn’t be the case,” Plumlee said. “We’ve got to be sharper. I’m looking forward to seeing how we respond.”NOTES: Will Barton (surgery to fix core/hip muscle injuries) and rookie Michael Porter Jr . (back surgery) were at practice Monday shooting jumpers.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}