{"id": "Atletico tops 4th-division club Sant Andreu in Copa del Rey", "paragraph": "MADRID (AP) — Atletico Madrid overcame tough conditions on a wet artificial turf to beat fourth-division club Sant Andreu 1-0 on Tuesday to open its Copa del Rey campaign.Portugal forward Gelson Martins scored a 33rd-minute winner for the visitors, which played without Antoine Griezmann and most of its regular starters.Atletico also didn’t have coach Diego Simeone on the bench as he served the first of a three-game suspension following a rant in a Copa match against Sevilla last season.Under heavy rain on a challenging field, Atletico controlled the game despite the absences, but its opponent put on a good fight and nearly got the equalizer in the end. The club from Barcelona had three good chances in the final minutes, including a close-range header that hit the crossbar.“We allowed them to stay in it,” Atletico goalkeeper Antonio Adan said. “The series is still open and we will have to finish it off in the match at home.”Martins scored from inside the area for his first goal since joining Atletico in the summer. He was making his sixth appearance with the club.Sant Andreu is the only fourth-division club still left in the Copa del Rey. It also faced Atletico in the Copa five years ago, losing 4-0 at home and 2-1 in Madrid.“We had a couple of chances to equalize,” said midfielder Ton Alcover, one of the players who also faced Atletico five years ago. “We played a great match.”Simeone used most of the players the club signed in the offseason, including Martins, Adan, Santiago Arias, Rodrigo, Thomas Lemar and Nikola Kalinic.MINA SAVES VALENCIAValencia escaped defeat against third-division club Ebro thanks to a pair of second-half goals by Santi Mina.Ebro played a man down from the 29th after Tiago Portuga was sent off with consecutive yellow cards, but the hosts opened the scoring with Amelibia in the 62nd. Mina helped Valencia rally with goals in the 71st and 80th minutes.Ebro is last in its 20-team third-division group, with eight points from 10 matches.It was only the second win for Valencia in 14 matches in all competitions this season. It also has lost only twice, with 10 draws, including five straight entering Tuesday’s game.The round of 32 is the first to include the top two tiers of Spanish clubs.Real Madrid makes its Copa debut at third-division club Melilla on Wednesday, with interim coach Santiago Solari on the bench for the first time after the dismissal of Julen Lopetegui.Barcelona starts its campaign at third-tier club Cultural Leonesa later on Wednesday.OTHER MATCHESIn other round-of-32 matches, Levante drew 1-1 at second-division team Lugo, while Leganes tied visiting Rayo Vallecano 2-2 after trailing by two goals in an encounter of top-tier clubs.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}