{"id": "Saints, Brees piling up points at franchise-record rate", "paragraph": "NEW ORLEANS (AP) — The dynamic Saints running back duo of Mark Ingram and Alvin Kamara agree that the word “savage” best describes New Orleans’ offense.Certainly, the Saints are scoring so often, and in so many ways, it’s enough to bruise defenders’ egos.“I’m glad we don’t have to play them,” Saints linebacker Alex Anzalone said Monday, a day after New Orleans broke the 50-point mark in a victory over Cincinnati.Even by the lofty standards offensive-minded coach Sean Payton and record-setting quarterback Drew Brees have set since joining forces in 2006, New Orleans is putting points on the board with exceptional proficiency.The Saints have never averaged better than 34.2 points per game for an entire season. That mark was set by New Orleans’ 2011 squad that featured Brees and four skill players that each gained more than 950 yards from scrimmage: tight end Jimmy Graham, receiver Marques Colston, and running backs Darren Sproles and Pierre Thomas.The 2018 Saints, who host defending Super Bowl champion Philadelphia on Sunday, currently lead the NFL with an average 36.7 points through nine games. Maintaining that pace for the rest of the regular season would put them third all-time in scoring behind the 2013 Denver Broncos (37.9 points per game) and the 2007 New England Patriots (36.8). And the way the Saints are playing, their current scoring average could very well increase before the season is out. They’ve scored at least 40 points in five of nine games so far.They’ve also added yet another potential receiving target, signing veteran Brandon Marshall on Monday.“He’s got good length and size. He’s another big target,” Payton said of the 34-year-old Marshall, who became a free agent when he was released by Seattle on Oct. 30. “I thought size was important but (also) experience and someone that we felt had strong hands.”Eleven different Saints have gotten in the end zone this season, including Brees, who dove over the pile at the line of scrimmage for his third rushing TD this season during Sunday’s 51-14 triumph at Cincinnati. The 39-year-old QB also is having one of his most efficient seasons, completing 77.3 percent of his passes for 21 TDs and only one interception.Brees’ completion rate arguably has been aided by his decision to often throw shorter passes, particularly to Kamara, who has 55 receptions for 473 yards and three TDs. But Brees asserts that Saints’ offensive production has stemmed in no small part from their ability to methodically sustain drives with high-percentage plays.“It pays dividends as the game goes on,” Brees said. “You wear a defense down. … We say, ‘Don’t get bored with the (short) completions, the four-yard runs. They result in big plays if we keep it up.”A case in point is Brees’ 72-yard game-breaking touchdown pass to receiver Michael Thomas in the final minutes of a Week 9 victory over the Los Angeles Rams, whose defenders crashed down to swarm Kamara on the play.During the Payton-Brees era, the Saints have more often than not been a pass-heavy team. But not this season. New Orleans ranks eighth in yards rushing and seventh in yards passing.“We’re hoping to have balance,” Payton said. “Our offensive line has played well. We’ve been consistent rushing the football. I feel like Drew’s playing at high level. … Having that ability to rush or pass is something that can help.”And while Brees is in the twilight of his career, New Orleans is enjoying major production from two of its younger skill players.The 23-year-old Kamara has 1,109 yards and 14 TDs from scrimmage on mix of runs and receptions. Thomas, 25, has caught 78 passes for 950 yards and seven TDs.Saints right tackle Ryan Ramczyk is in only his second NFL season, but said even he can see the Saints’ offense is “definitely special.”“The cohesiveness up front really helps us out. And then guys like Mark and Alvin and Drew, Michael — all those guys around us — are special athletes,” Ramzcyk said. “When we come together, we can make a lot of great things happen.”And that takes a lot of pressure off the Saints’ defense, which yielded 48 points in a season-opening loss, but since has been good enough to help New Orleans win eight straight. Next up are the Philadelphia Eagles (4-5).“We don’t have to be super heroes,” Anzalone said. “Things aren’t going to always go our way, but we just have to give our offense a chance, and we’ve been able to do that these past eight games.”Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}