{"id": "Gophers lose 53-28 to previously winless Nebraska", "paragraph": "7\n\t\t\t\t\t\tBruce Thorson-USA TODAY Sports | Bruce Thorson\t\t\t\t\tLINCOLN, Neb. — Nebraska built a four-touchdown lead in the first half and survived some nervous moments in the second before pulling away to beat Minnesota 53-28 on Saturday, giving Scott Frost his long-awaited first win as Cornhuskers coach and ending a program-record 10-game losing streak.\n\t“It’s long overdue, man,” Frost said. “This feels great. This is what it’s supposed to feel like.”\nA week after squandering a late 10-point lead at Northwestern and losing in overtime, the Huskers (1-6, 1-4 Big Ten) scored on three of their first four possessions on their way to a 28-0 lead.\nMinnesota made things interesting, though, scoring on three possessions in a row spanning the halves, with backup quarterback Tanner Morgan replacing Zack Annexstad to open the third quarter and leading two straight touchdown drives to pull the Gophers to 28-22.\nAdrian Martinez hit Stanley Morgan Jr. for a 35-yard TD and passed to him again for a 2-point conversion to make it 36-22. The Huskers stopped Minnesota on fourth-and-goal at the 3 and then chewed 7 minutes off the clock before Barrett Pickering kicked a 32-yard field goal to make it a three-possession game with 7:53 left.\n“That’s how this whole year has been. We’re going to have to play well for four quarters,” Frost said. “We’re getting better every day. We’re still not so good we can sleep on a lead or not play our best. So proud of this team. They could have quit a long time ago. They could have shut it down. This team every week does more of what we ask them, does it better, keeps getting better. That was a pretty good show out there today.”\nNebraska rushed for 383 yards and totaled 659. Devine Ozigbo ran for 152 yards, Martinez for 125 and Maurice Washington for 109.\nMartinez completed 25 of 29 mostly short passes adding up to 276 yards and three TDs. Stanley Morgan caught 10 balls for 163 yards, both career highs.\nThe Gophers were without running back Shannon Brooks, who was arrested last weekend on suspicion of misdemeanor assault for an altercation with his male roommate. Brooks, who was medically cleared to play after rehabbing an offseason knee injury, didn’t make the trip.\nTanner Morgan was 11 of 16 for 214 yards and Annexstad 9 of 20 for 135. Gophers coach P.J. Fleck said Annextad had to leave the game because of an internal injury in his midsection. He was taken to a hospital for treatment.\n“Congratulations to Coach Frost,” Fleck said. “It’s a big deal, everybody remembers your first. This team should be 5-1 or 4-2. We didn’t stop them tonight at all. We didn’t tackle well. We didn’t set an edge.”\nTHE TAKEAWAY\nMinnesota: A quarterback controversy may begin unfolding this week. Morgan gave the Gophers a spark. The Minnesota defense had no answer for Martinez and Co., though.\nNebraska: The defense’s depth issue continues to show up in second halves. The Huskers seemed to tire for the second straight week. This team is much like Frost’s teams at Central Florida. It’s all about the offense.\nUP NEXT\nMinnesota hosts Indiana on Oct. 26.\nNebraska hosts Bethune-Cookman on Oct. 27.\n Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}