{"id": "Spanish league and federation split over 2nd game in US", "paragraph": "MADRID (AP) — Another game, another argument.The sports and entertainment group backing the Spanish league’s bid to take a regular-season soccer game to the United States says it was contacted by the Spanish federation to discuss holding a separate game — the Super Cup final — in the country.The federation, which has raised its concerns over the planned Barcelona-Girona league game near Miami in January, denied the claim by the Relevent group on Sunday. The federation said it had never sought the help of any company to take the “Supercopa” to the U.S.In Spain, the league oversees the first and second divisions, while the federation organizes tournaments such as the Super Cup and the Copa del Rey.The Super Cup pits the Spanish league champion against the Copa del Rey winner in a one-match final at the start of the season. This year’s game was played between Barcelona and Sevilla in Tangier, Morocco.The federation told The Associated Press it was Relevent that proposed having the Super Cup game in Miami in 2019. The federation said it had rejected the offer.It said Relevent recently invited federation president Luis Rubiales to a dinner in New York as he was in the city for other business, but the federation denied this was to discuss the Super Cup game. The group’s proposal had already been rejected by then and the meeting never happened.The league’s idea to play games in the U.S. to promote its brand has been supported by many but has also been met by criticism from soccer officials and some fans and clubs in Spain. The dispute has become a tug-of-war among the several stakeholders, with all sides trying to weigh-in and defend their ground.This latest dispute seems unlikely to improve the situation.“It is scandalous to offer the Spanish Super Cup in the USA to the same organization that has a partnership with LaLiga (Spanish league) while telling LaLiga it can’t stage a match stateside,” Spanish league president Javier Tebas told the AP in a league email written in English.“It’s clear that there is an inherent problem with a process when the federation deciding on approval is negotiating a similar deal concurrently,” Tebas claimed. “When it comes to the LaLiga match in the US, decisions and opinions by the governing bodies haven’t been based on what’s in the best interest of football globally, but how it impacts self interests and leverages business negotiations on unrelated matters.”The federation is yet to approve the league’s request over the Barcelona-Girona game. While asking for clarification about the plan, the federation argued the league failed to show the overseas game would comply with Spanish and international regulations and TV broadcast contracts.It also said the regular-season match away from Spain could harm the other 18 league clubs.The Super Cup game doesn’t affect other teams but Spanish fans would face a lengthy trip across the Atlantic for both matches. The league has offered compensation packages for Girona fans willing to watch the game in the U.S., including paid trips to Miami and partial reimbursement of season-ticket packages.The FIFA Council recently opposed the league game plan after receiving a request to take a stance from CONCACAF and the federations in the United States and Spain, which both have a say on whether the game can be played, along with European governing body UEFA. FIFA’s permission for the match is not mandatory but its opposition was a setback for the league.The league said it is prepared to appeal to the Court of Arbitration for Sport if FIFA somehow prohibits the match, and it is also ready to go to court in Spain if the Spanish federation rejects its request to play abroad. The federation hasn’t yet made a final ruling.The league last week launched a campaign to show that American fans are behind the game, asking them to sign an online petition showing their support.The league has a 15-year partnership with Relevent to promote soccer and bring games to the United States. The group operates the International Champions Cup, a tournament played around the globe during the European offseason in July and August.Staging the game in the U.S. is seen as an important step for the league to continue expanding internationally and to close the gap on the powerful English Premier League.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}