{"id": "StaTuesday: Rams can’t pick on Packers CB Jaire Alexander", "paragraph": "7\n\t\t\t\t\t\tJake Roth | USA TODAY Sports\t\t\t\t\tThe Green Bay Packers envisioned Jaire Alexander as their starting cornerback of the future when they selected him in the first round of this past year’s NFL draft.\nIt didn’t take long for that to come to fruition in 2018, as Alexander has started three games this season, including this past Sunday in Los Angeles.\nHowever, Alexander had missed the past two games with a groin injury. Perhaps that’s why, combined with his rookie status, Jared Goff and the Rams appeared to be picking on Alexander. The first-round pick more than held his own.\nAlexander had five pass breakups against the Rams, which was the most for any Packers defensive back in over a decade. Before Alexander’s performance, only two Green Bay players (for a total of three times) had recorded five or more passes defensed (a PD = passes broken up + interceptions) in a game since 1999.\nIn that timespan (passes broken up/defensed is a recent statistic and pro-football-reference.com currently traces it back through 1999), Alexander is just one of eight rookies to have 5+ passes defensed in a game — Dee Millner did it in back-to-back weeks in December 2013 — which is even more impressive considering how often quarterbacks target inexperienced cornerbacks.\nOf the nine such instances by a rookie, only two had five pass breakups — Alexander and Seattle’s Marcus Trufant in 2003.\nSince 1999, but not including this season, there have been 85 games of a player recording 5+ passes defensed. That comes out to an average of 4.47 per season. However, in this pass-heavy era, the average number of such games this decade is just 3.14 (again, not including this season). Through Week 8, Alexander is the only player in 2018 to have a game with five PD.\nOn four occasions in 2017 did a player have 5+ PD, three in 2016 and ’15 and just one in 2014.\nOf the 23 times it has occurred since 2011, just eight (including Alexander) were all on pass breakups.\nOf the 67 players who have recorded a game with 5+ PD since 1999, only two players — Anthony Henry and Quintin Jammer — did it three times and just 15 (including Green Bay’s Mike McKenzie) own two such games.\nAfter Sunday’s game, perhaps Alexander now will get more respect from opposing quarterbacks, making it harder for him to reappear on this list again.\nDave Heller is the author of Ken Williams: A Slugger in Ruth’s Shadow (a Larry Ritter Book Award nominee), Facing Ted Williams – Players From the Golden Age of Baseball Recall the Greatest Hitter Who Ever Lived and As Good As It Got: The 1944 St. Louis Browns\n \n Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}