{"id": "Braves’ Ronald Acuña Jr. caps historic season with NL Rookie of the Year award", "paragraph": "There was hype, plenty of hype. Ronald Acuña Jr. didn’t just meet it, he torched it in one of the historically great seasons for a player barely out of his teens.\nNow the Braves phenom has the hardware to show for it, beating out the Nationals‘ Juan Soto and Dodgers‘ Walker Buehler on Monday night, taking 27 out of 30 first-place votes for the National League Rookie of the Year award.\nHe is the eighth player in franchise history to be named ROY, and the first since Craig Kimbrel in 2011.\n“First of all, I would like to give thanks to God, my family, my parents and to all my teammates who’ve always supported me from the first day that I got the call to the big leagues,” Acuña Jr. said. “This award represents all our hard work as a team this season.”\nAcuna, 20, entered the season directly in the spotlight after being named everyone’s minor league player of the year as a 19-year-old in 2017. When he made his MLB debut in late April series in Cincinnati, the Venezuelan outfielder did not disappoint.\n🗣️ RONALD ACUÑA JR. IS NL ROOKIE OF THE YEAR 🗣️\nThe Pheñom beat out Juan Soto and Walker Buehler for @Braves' eighth ROY and first since Craig Kimbrel in 2011.#Braves | #ChopOn pic.twitter.com/OFzOL9qH0h\n— FOX Sports: Braves (@FOXSportsBraves) November 12, 2018\nHe hit his first home run in his second game, a 416-foot blast and delivered one of the Braves’ most memorable moments in their return to the postseason, becoming the youngest player in history to hit a grand slam when he went deep off fellow finalist Buehler in Game 3 of the NLDS vs. the Dodgers.\nIn all, Acuña hit .293/.366/.552 with 26 homers — including one in five straight games — 26 doubles and four triples with 64 RBI and 16 steals. Since the franchise moved to Atlanta in 1966, no first-year player has ever had a wRC+ higher than Acuña’s 143, with 1990 ROY David Justice coming closest at 138.\nAt every turn, Acuña seemingly linked his name with greats both past and present.\nHis 26 homers were better than the likes of Hank Aaron, Johnny Bench, Ken Griffey Jr., Willie Mays, Eddie Mathews and Frank Robinson in their first seasons. Acuña’s 144 OPS+ is the second highest since World War II for a rookie 20 years or younger, bested by only Mike Trout‘s 168 in his ROY season of 2012.\n✅ Ronald Acuña Jr. (2018)✅ Craig Kimbrel (2011)✅ Rafael Furcal (2000)✅ David Justice (1990)✅ Bob Horner (1978)✅ Earl Williams (1971)✅ Sam Jethroe (1950)✅ Alvin Dark (1948)\nThe list of @Braves Rookie of the Years, which now has a simply Pheñomenal addition. pic.twitter.com/bk8dSCGb3s\n— FOX Sports: Braves (@FOXSportsBraves) November 12, 2018\nOh, as for that postseason grand slam? At 20 years, 293 days, Acuña broke the record set by Hall of Famer Mickey Mantle, who hit a grand slam in Game 5 of the 1953 World Series at 21 years, 349 days.\nIn any other year, he would have been a runaway winner. But joining Acuña in nearly every one of those historical nuggets was the Nationals phenom of their own in Soto, who didn’t turn 20 until the season’s end.\nSoto hit .292/.406/.517 with 22 homers, 25 doubles and a triple, and while he and Acuña tied with 3.7 fWAR, his OPS+ was just two points below Acuña’s at 142. But that figure was still better than a laundry list of HOFer who won ROY, including in Orlando Cepeda, Mays and Bench.\nWho can forget this 🚀?\nRelive the first home run of Ronald Acuña Jr.'s Rookie of the Year season, a 416-foot blast.@Braves | #ChopOn pic.twitter.com/Kuc4iK12cL\n— FOX Sports: Braves (@FOXSportsBraves) November 12, 2018\nMeanwhile, Buehler was sensational for National League champion Dodgers’ rotation with a 3.04 ERA, 151 strikeouts and an 8-5 record over 137 1/3 innings.\nIn the last 50 years, only seven rookies had a better ERA+ than Buehler’s 148 and three of them, Jose Fernandez (2013), Mark Fidrych (159) and Hideo Nomo (149) were named ROY in their respective leagues.\nWith that star-studded list of finalists, Acuña stood out by all but carrying the Braves offense to the NL East crown after three straight 90-loss seasons.\nWhile All-Stars Ozzie Albies and Nick Markakis struggled in the second half, with 67 and 88 wrC+s, respectively, Acuña hit 71 percent above league average, and when Freddie Freeman cooled in August with a 115 wRC+, Acuña had his best full month of the season (190).\nAcuña’s Rookie of the Year added to Atlanta’s haul of postseason awards as Freeman, Markakis and Ender Inciarte all won Gold Gloves and Freeman was named the Defensive Player of the Year at first base.\nThe Braves may not be done, either, as Tuesday night Brian Snitker is a finalist for NL Manager of the Year along with the Brewers’ Craig Counsell and the Rockies Bud Black.\n\nFollow Cory McCartney on Twitter @coryjmccartney and Facebook. His books, ‘Tales from the Atlanta Braves Dugout: A Collection of the Greatest Braves Stories Ever Told,’ and ‘The Heisman Trophy: The Story of an American Icon and Its Winners.’ are now available. Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}