{"id": "Agent: Realmuto won’t sign long-term deal with Marlins", "paragraph": "MIAMI (AP) — The agent for catcher J.T. Realmuto says his client has informed the Miami Marlins he won’t sign a long-term contract, increasing the likelihood the team will trade yet another All-Star.The Marlins have said they’d like a lengthy deal with Realmuto, but they’re coming off their ninth consecutive losing season and in a rebuilding phase that will probably continue for several years. Realmuto doesn’t become eligible for free agency until after the 2020 season and would command a considerable return in a trade.“I think he will definitely be wearing a different uniform by the start of spring training,” said his agent, Jeff Berry, on MLB Network Radio on Tuesday.A new deal with Realmuto would send a signal the team’s roster might no longer be a revolving door as players depart when they become too expensive. But the catcher asked to be traded a year ago when the Marlins dismantled under new CEO Derek Jeter, and a 98-loss season apparently didn’t change Realmuto’s desire to play elsewhere.“J.T. has informed the Marlins’ ownership, he has informed their front office, he’s not going to sign an extension in Miami,” Berry said. “You could keep him for two years or not. It makes sense, when you have one of the more valuable trade assets in baseball, to move him. Period.”The Marlins declined comment.Realmuto, 27, made the All-Star team for the first time this year and had 21 homers and 74 RBIs, both career highs, while batting .277. He had a $2.9 million salary this year after losing in arbitration, and he is eligible for arbitration this winter and again following the 2019 season.Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}