{"id": "Bears look for confidence in upcoming game", "paragraph": "LAKE FOREST, Ill. (AP) — Whether it’s due to a leaking defense or quarterback Mitchell Trubisky‘s ill-advised throws into pass coverage, the Chicago Bears are in need of a confidence infusion.\nPlaying a 3-4 New York Jets team with its own struggles could go a long way in solving this, but the 3-3 Bears say they’ve reached a point where they’re only concerned with what they control in their search for answers.\n“We can’t dwell on the past,” linebacker Danny Trevathan said. “We’ve just got to keep moving forward. It’s a long season. We’re not in a bad situation.”\nIt could be a better situation if the defense regains its swagger. Two straight losses and 69 total points allowed put the defense on its heels.\n“A lot of guys are probably a little down today, probably are disappointed but not discouraged,” cornerback Prince Amukamara said. “We know that we’re a team that’s going to continue to fight.”\nPlayers had a talk from defensive coordinator Vic Fangio aimed at keeping up spirits.\n“So right now we’ve just got to continue to build off that and don’t let the confidence and swagger go away because that’s when things really get bad for us,” safety Eddie Jackson said.\nThe defense can trace its downfall to Khalil Mack‘s ankle injury. Although he has continued playing, he hasn’t been the same force as in the first four games.\nMack couldn’t practice Wednesday, and coach Matt Nagy said it’s likely Mack will take the same route as last week when he rested Wednesday and Thursday, practiced on a limited basis Friday and then played.\n“We’ve got to pick up the slack,” Trevathan said.\nChicago’s defense is now ranked No. 12 after being in the top five much of the season’s first quarter. The Bears are eighth in sacks (19) after leading through four games.\n“It plays its part,” Jackson said of Mack’s injury. “It definitely plays its part, especially when a guy like Mack when he’s out.”\nThe Bears were hardly a poor pass rushing team before Mack came via trade from Oakland. They tied for seventh in sacks with 42 last year and played the same defense under Fangio with virtually all of the same players.\nSo they say getting pressure on Jets rookie quarterback Sam Darnold Sunday with Mack limited shouldn’t be considered impossible.\n“It’s a team, it’s 11 guys on the defensive side of the ball,” Jackson said. “So when a guy like (Mack) goes out, we’ve got to put him on our back and just show him, like, it’s not just you, it’s going to be all of us.”\nOffensively, Trubisky and the passing game could benefit if the Bears begin to run the ball more effectively. Their ranking as the sixth-best rushing team is deceiving because Trubisky has accounted for 245 yards, mostly on scrambles.\nJordan Howard averages 3.5 yards and has 90 carries, but last year after six games under former coach John Fox he was averaging 4.2 yards a carry and ran 28 more times. The effect of a struggling running attack has been apparent when the Bears had leads against the Dolphins and Patriots before losing.\n“We need to finish,” guard Kyle Long said. “We’ve had leads in all of (the losses) and we haven’t been able to score more points to extend the lead on offense.”\nNagy called a better running attack a matter of timing up the blocks in a new offense.\n“All of it, the guys are trying, and I know our numbers are skewed a little bit from the quarterback runs, but for the most part we feel like we need to create more of an identity there,” Nagy said of the running attack.\nTrubisky looked at the positive side of the passing game. The Bears scored 31 even while he spent much of the time scrambling and throwing on the run, so if they can complete some from the pocket they’ll be ahead of the game.\n“Basically as how I described it, as playing backyard football, me running around just trying to find completions and not being very sound with my footwork and drop-backs,” Trubisky said.\nWith Kansas City last year as offensive coordinator, Nagy went through a much worse stretch with six losses in seven games before the Chiefs made the playoffs.\n“There was never any panic, never,” Nagy said. “There is not going to be any panic here, either.”\nNagy pointed out the Bears also won three straight earlier.\n“Good people stick together,” Nagy said. “They rally through this kind of stuff and you just keep playing.”\nNOTES: Wide receiver Allen Robinson (groin) did not practice. Robinson in Sunday’s game aggravated the injury he suffered two weeks ago. … Guard Eric Kush (neck) did not practice. Cornerback Marcus Cooper (hamstring) had limited participation in practice. … Linebacker Roquan Smith has been listed by the Bears as suffering from a wrist injury, but he was able to practice Wednesday.\n  Help | Press | Advertise With Us | Jobs | RSS | Site Map\nFS1 | FOX | FOX News | 21st Century FOX | FOX Supports | FOX Deportes© 2018 Fox Sports Interactive Media, LLC. All rights reserved.\nUse of this website (including any and all parts and components) constitutes your acceptance of these TERMS OF USE and PRIVACY POLICY.\nAdvertising Choices"}