{"id": "Cleveland Orchestra fires concertmaster, top musician after sex harassment investigation", "paragraph": "The Cleveland Orchestra fired William Preucil, its concertmaster of 23 years, and Massimo La Rosa, its principal trombonist, after a three-month investigation concluded that both men engaged in sexual misconduct.The investigation, conducted by the New York law firm Debevoise and Plimpton, was launched in August in the wake of a Washington Post article that reported allegations about Preucil and two other classical musicians. Preucil had been suspended from the orchestra since the article appeared; La Rosa was suspended in September. Investigators spoke to more than 70 people, including current and former orchestra members, leadership and staff, and musicians outside the orchestra.[Classical music is rife with harassment, say dozens of artists]The investigators’ report, released Wednesday, stated that 11 women had told credible stories of sexual misconduct by Preucil, 60, that took place between 1996 and 2007. The youngest woman was 17 at the time of the alleged abuse. Preucil’s behavior included requesting sexual favors as payment for lessons, exposing himself, and in one case “engaging in sexual activity with a junior female colleague who was too afraid to stop the encounter due to Preucil’s forcible conduct and position of authority,” according to the report.[Read the full 12-page report]Seven women described sexual misconduct by La Rosa, 43, between 2010 and 2012, including inappropriate touching over and under their clothes, and partially removing students’ clothing, or his own, during lessons.“The investigators found that Mr. Preucil and Mr. La Rosa engaged in sexual misconduct and sexually harassing behavior with multiple female students and colleagues over a period of years while employed by the Orchestra,” the orchestra said in a statement. “Moreover, the abusive conduct by both performers was made possible by their positions of power within the Orchestra and in the broader world of classical music. According to the investigation, women who were victims were intimidated by Mr. Preucil and Mr. La Rosa, and were afraid to take action after they were subjected to the unwelcome behavior.”Preucil admitted to investigators he had had sexual contact with three students, and said that his behavior was wrong. He also admitted to telling a sexually explicit story to a female violinist. But he denied other misconduct.“Based on the number of detailed and consistent reports that Debevoise received . . . many of which were corroborated by witnesses,” the report continued, “Preucil’s denial that he engaged in additional misconduct is not credible.”La Rosa admitted to attempting to kiss a student during a lesson and also admitted that he sometimes touched students, though he said he did so purely for pedagogical purposes. “La Rosa did not engage in the same behaviors with male students,” said the report.Neither Preucil nor La Rosa responded to requests for comment.“The numbers are shocking, and it made me sick to my stomach to read the report,” said Andre Gremillet, the orchestra’s executive director. “It’s devastating.”Gremillet apologized for “the reprehensible behavior of two members” of the orchestra. “I think we have done the right thing by publishing the entire report,” he said. “It was important for us for people to understand how thorough this process has been.”In The Post’s initial article, which appeared in July, violinist Zeneba Bowers said Preucil assaulted her in his Miami hotel room after a lesson when she was a fellow at the New World Symphony, the country’s leading training orchestra for young professionals, in 1998. Other musicians confirmed Preucil’s reputation for inappropriate advances. Earlier this month, the Cleveland Plain Dealer reported two women made additional allegations against Preucil, including another former fellow of the New World Symphony who said he assaulted her in a Miami hotel room in 2005.“I would like to thank the other women who came forward, whose courage and fortitude has truly impressed me,” Bowers told The Post on Wednesday. “I thank the Cleveland Orchestra for conducting a thorough investigation. I hope that this will help begin to change this aspect of the working environment in the music business and in our society at large.”The concertmaster is generally considered the leader of the musicians of the orchestra, second to the conductor, and tends to be the highest paid. Preucil was widely held to be one of the best concertmasters in the country.Two other high-profile musicians accused of harassment in The Post’s article had already lost their positions. In August, the Royal Concertgebouw Orchestra in Amsterdam cut ties with its chief conductor, Daneile Gatti, whom two women in The Post’s article accused of misconduct. Also in August, Bernard Uzan, the stage director and artists’ manager, resigned as co-director of the young-artist program at the Florida Grand Opera; turned over control of his agency to his daughter, Vanessa; and announced he was leaving the opera field. Four women in The Post article accused Uzan of sexually harassing behavior, including inappropriate language, propositions and groping.[Leading orchestra dismisses conductor Gatti after harassment allegations]Cleveland Orchestra officials said they were not aware of the allegations against Preucil that The Post reported. “Debevoise found no evidence that anyone in Orchestra management knew about specific instances of Preucil’s sexual misconduct other than the allegation that was publicized in 2007 by the Cleveland Scene,” the report said. “However,” it continued, “ former Orchestra leadership should have done more to investigate the reports about Preucil’s behavior.”As for La Rosa, the report stated that the orchestra was approached about his behavior on at least three occasions, twice by universities. In one case, the orchestra was unable to investigate because the student did not make a formal complaint. La Rosa was issued a warning.Gremillet said the orchestra will improve its whistleblower policy and create an anonymous hotline that will provide a better process for future complaints. “It’s a clear message that none of this will be tolerated,” he said.But he declined to discuss the report’s conclusion that the orchestra could have done more in the past. “The report speaks for itself,” he said. “That’s why we’re releasing it.”"}