{"id": "\n\n\n\nCrunchyroll\n\n\n\n\nTragedy and Healing: Why Maquia Makes Us Cry\nRelated Article", "paragraph": "Maquia: When the Promised Flower Blooms is, in many ways, a landmark film. For its director and scriptwriter, Mari Okada (Anohana, Toradora!, Dragon Pilot: Hisone and Masotan), it marks her directorial debut—and the story she has said is “what I’ve always wanted to write as a writer.” As a work of art, it exists in significant part thanks to the herculean efforts of the staff that worked alongside Okada to bring her vision to life, particularly animator Toshiyuki Inoue, and represents a monumentally, perhaps even historically, impressive production. As an anime, it joins hits like Your Name and artistic phenomena like Liz and the Blue Bird as part of a growing wave of original anime films reaching larger and larger audiences around the globe.But, perhaps most importantly, it’s a special film because of the story it tells, the way it tells it, and its success in doing so. So what of Maquia? What is this film, a story implied to be more than just another in Mari Okada's prolific oeuvre, like?To put it simply: Maquia is deceivingly grand and marvelously personal. The opening to to the film feels like the setup to a story we’ve seen from Okada (and anime) many times over. There’s the cheerful, protagonist-like girl who leaps into the water, yet the titular heroine is not her, but instead a quiet, timid girl who feels alone. There’s the spying-on-a-romantic-nighttime-meeting that implies unrequited love, yet such drama is immediately whisked away. There’s a violent invasion by forces on dragons, and yet the prologue ends with a young girl and a baby looking at the sunrise together.Such is the nature of Maquia. It is a film of fantastic scale—spanning years, lives, deaths, cities, countries, politics, war, and ambitions—but these broad motions are merely the cradle in which the film’s true heart rests.But I’m getting ahead of myself.Maquia is difficult to sum up efficiently, but perhaps the best way to consider it is as a fictional biographical film. Although it doesn’t start with the character Maquia’s birth and doesn’t end with her death, the almost vignette-like structure of the movie and the frequent time-skips grant Maquia a very different kind of vibe than most anime films. As the film runs on, it provides a variety of answers. There’s the practical, mundane Mido and her recognizable, relatable mothering of her two sons—covering things as simple as disciplining the boys for procrastinating on their chores to more difficult ones like being a solid rock after the death of the beloved family dog. There’s the tragic tale of Leilia, her rape and subsequent pregnancy, and the nonetheless unbreakable and life-giving bond she shares with her daughter. And there’s the beautiful sequence where Ariel’s wife, Dita, becomes a new mother with Maquia’s help, completing the circle with the delicate gesture of Maquia’s grandson grasping her finger just as a baby Ariel did.Through all of this runs the biography of Maquia’s own journey as a mother. She learns from the other mothers she comes across, from her own experiences, and from the wider circumstances of her world. “Mothers don’t cry.” “I’ve only thought about Ariel.” “You won’t forget.” “I’m happy I loved Ariel.” Despite everything—despite her bittersweet parting from Ariel, despite Klim’s attempts to erase her past, despite the fact that she will outlive almost everyone she loves—she comes to the end of the film… and she weeps for her son.It is a very beautiful, as is the entire film—delicately lit, gracefully directed, and vibrantly animated—which is appropriate. Such beautiful things ought to be shown in beautiful ways. Every gorgeous shot, every carefully animated gesture, leads to this moment. All along, the story has been paved with beauty so that when we arrive at the scene where Maquia breaks her mother’s promise not to cry, we have been prepared to join her.Yet what’s most key to remember about this moment, and about Maquia as a whole, is that the emotion is only the tip of the iceberg. We may leave the theater or take out the Blu-Ray with teary eyes, but to say that Maquia is simply something that caused us feels seems a disservice to the film. Certainly, it is an emotional journey as much as a narrative and thematic one, but to stop at the emotion itself and to fail to investigate further the source of Maquia’s effects is, I think, a mistake. At the same time, the answer of what that source might be is beyond what I can say. It will be different for me than it is from you. I can say that Maquia is as much a call to empathy for mothers as it is a celebration of their unique role in the lives of those they nurture, and that may be true. But is it why you are crying with Maquia at the end of the film?I can’t answer that.However, you can. If you’ve seen Maquia and have felt yourself moved by it, I hope you will take some time to think about why. And then, maybe, just as Maquia taught Ariel to love and to be kind, perhaps her movie will teach you something as well. After all, isn't that what mothers do?REVIEW ROUND-UP+ A sweeping, immersive story tightly intertwined with its themes+ Visually gorgeous in every way+ Pretty score that works so well you barely notice it- Loses narrative focus a bit in the back half---\nRead More »\n"}