{"id": "", "paragraph": "Saudi Arabia, Shi’ism and the Illusion of Reform\nby Robert G. Rabil – @robertgrabil \nOctober 30, 2019The emergence of the Kingdom of Saudi Arabia is inextricably associated with the Wahhabi school of Islam. The Saudi-Wahhabi pact goes back to the eighteenth century when Sheikh Muhammad ibn ‘Abd al-Wahhab (1703-1792), the founder of the Wahhabi-Salafi school of Islam traveled to Diriya, the stronghold of the Saudi tribe, and struck a deal with its chief. The pact served the interest of both parties by expanding their respective political and religious influence throughout the regions of Najd and Hijaz.Basing his ideas on the writings of classical Salafi scholar Ibn Taymiyyah , al-Wahhab rejected shirk (idolatry, polytheism) and bid‘ah (heretical religious innovation), which he believed permeated the holy land of Islam. He believed in the return to the authentic ways of the salaf al-salih (pious ancestors) and advocated tawhid (oneness/unity of God) and transcendence of God. He called for unity and the purification of Islam. His puritanical movement became known as the Muwahhidun. Significantly, he justified leveling the charge of takfir (unbelief) on those he considered engaged in shirk. For example, the failure of Muslims to observe all the pillars of Islam was tantamount to committing kufr (unbelief). His definition of tawhid centered on Muslims’s exclusive worship toward God alone. In other words, it was Kufr to associate any other being or thing in the Worship of God.   This constituted for him the divide between Islam and kufr, and between tawhid and shirk. In this respect, the Shi’a, and their offshoot sects such as Alawis, Ismailis, and Zaydis, were considered as the worse of mushrikoun (polytheists) for they have associated worshipping God with venerating the infallible descendants of Prophet Muhammad. More so, Shi’a traditions, among other Islamic and non-Islamic traditions, such as tawassul (supplication), Shafa’a (intercession of prophets and Imams), tabarrruk (seeking of blessings) and ziyara (visiting the tombs of venerated religious figures) only deepened the Wahhabi identification of Shi’ism with polytheism and idolatry. The corollary of this identification made warfare against Shi’ism a Wahhabi religious duty.Between the years 1794-1802 the Saudi-Wahhabi movement destroyed many holy shrines in today’s Iraq, including the Prophet Grandson Imam Hussein’s shrine in Karbala in 1802. Imam Hussein’s martyrdom in 680 at the hands of Umayyad Caliph Yazid at Karbala was most formative for Shi’a ideology and tradition. This martyrdom became central to Shi’a identity, tradition, and theology because it epitomized Imam Hussein’s opposition to tyranny, oppression, and the struggle against the chronic injustices of the world.During the campaign (1902-1932) of Saudi chief Abd al-Aziz to conquer Najd and Hijaz thousands were killed and maimed, including many Shi’a. In 1927, Wahhabi scholars issued a fatwa (religious edict) calling for the expulsion of Shi’a from al-Ahsa in the Eastern province of Saudi Arabia unless they consented to the destruction of their mosques and their conversion to Wahhabism. This anti-Shi’a religious strand became the official view of the monarchy when King Abd al-Aziz proclaimed the establishment of his kingdom in 1932 and made Wahhabism its official religious establishment.Correspondingly, the Shi’a, as a minority in the kingdom comprising around fifteen per cent of the population and residing mostly in the oil-rich Eastern Province, have been religiously and institutionally discriminated against. Their religious customs, including Ashoura commemoration of the martyrdom of Imam Hussein, were forbidden, the publication and distribution of their religious texts were outlawed, their call to prayer banned, and their centers of religious studies closed. No less significant, they were vilified in textbooks.The early expression of their grievances was manifested in their heavy participation in the 1950s in the labor riots of the oil fields managed by the Arabian American Oil Company (Aramco). The riots were brutally suppressed by the Saudi National Guard. Subsequently, apparently inspired by the success of the Iranian revolution in 1979, Shi’a demonstrated in the Eastern province. The government violently suppressed the demonstrations, arrested Shi’a leaders and forced a number of Shi’a activists into exile. It was at this time that a cleric Sheikh Hassan al-Saffar, supported by the followers of religious scholar Mohammad al-Shirazi, established the opposition group the Organization of the Islamic Revolution (Munazzamat al-Thawra al-Islamiyya).Saudi harsh treatment of their Shi’a community began to change in the 1990s, following the invasion of Kuwait by Iraq and the deployment of American troops to the Kingdom. This change apparently stemmed no less from American deeper involvement in the Middle East than from the failure of both Saudi policy of oppression and Shi’a policy of protestation. Sheikh al-Saffar changed the name of his organization to al-Haraka al-Islahiya (Reform Movement), and in 1993 a leader of the Shiite opposition in exile, Tawfiq al-Sayf, led a large delegation of Shia to meet with King Fahd. Meaningfully, King Fahd conceded to some Shi’a demands including permitting them to practice previously banned religious rites, some Shi’a to return from exile, and to guarantee the safety of those returned. Significantly, the King ordered the revision of a school text book that had referred to the Shi’a as a heterodox sect. The new edition added the Twelver Shiite School of Islam to the four Sunni schools of Islam.This slow and circumspect yet important transformation in the relationship between the monarchy and its Shi’a community gained momentum following the American liberation of the Shi’a from the yoke of Saddam Hussein’s oppression in 2003. Many Shi’a activists signed a statement, titled “Partners in the Homeland,” and submitted to Crown Prince Abdullah. The statement emphasized the loyalty of the Shiites to the Kingdom and called for their integration into Saudi society by removing institutional and social discrimination against them. Moreover, when the Crown Prince became King in 2005, many Shiite leaders and clerics went to the capital to pledge their allegiance to him. Many Shi’a believed that the new King would turn a new page in his relationship with the Shi’a community at large.It’s noteworthy, however, that a minority of Shi’a, including the militant group Hizbollah al-Hijaz, opposed Shi’a engagement with Saudi authorities. The kingdom has designated Hizbollah al-Hijaz as a terrorist organization and blamed it for several terror acts, including the 1996 Khobar Towers bombing. Conversely, many Wahhabi religious scholars maintained their disparaging views of the Shi’a and opposed any rapprochement with them. Even Saudi religious reformer Sheikh Safar al-Hawali disparaged the Shi’a and called the Shi’a Islamist party Hezbollah of Lebanon the party of the devil.King Abdullah had to walk a fine line between improving the conditions of the Shi’a, opposing what he saw as Iranian encroachment across the Middle East, and curbing the power of his religious establishment that stood as a hurdle to his reforms. He focused on bolstering the Kingdom’s defenses, enhancing scientific research, fighting al-Qaeda, and curbing the power of the Wahhabi religious establishment as a precondition to enunciate significant reforms. He removed a popular Wahhabi cleric, Sheikh Saad Bin Nasser al-Shathri, from the country’s High Council of Religious Scholars because he criticized the king’s decision to allow male and female researchers to work together in the newly established mixed gender King Abdullah University of Science and Technology. Similarly, he sacked the head of the Commission for the Promotion of Virtue and Prevention of Vice, whose puritanical agents try to enforce the behavioral application of Islamic law. Significantly, he tried to break the monopoly of the power of Wahhabi clerics within the Council of Senior Scholars, who issue official religious rulings, by including in the 21-member Council representatives of all four schools of Sunni Islam (Shafi’I, Hanbali, Maliki and Hanafi schools of jurisprudence). Though he did not include in the Council any Shi’a cleric, he increased Shi’a representation in the Consultative Assembly of Saudi Arabia.Shi’a cleric Sheikh Nimr Nimr.Unfortunately, King Abdullah’s reforms not only came to a screeching halt but regressed following the eruption of Arab Revolutions across the Arab world. Protests erupted in the Eastern province few days after widespread protests started in Bahrain on February 14, 2011. The province is only a 30-minute drive across the causeway from Bahrain. In a show of force, the Saudi interior minister Prince Muhammad bin Nayef vowed to crush the protests with an “Iron Fist.” In the following days and months, Saudi authorities clamped down on the protests, killing a number of them, and arresting dozens of them including the preeminent Shi’a cleric Sheikh Nimr Nimr.In the meantime, feeling threatened by the swift spread of Arab revolutions, the monarchy felt the need to be further legitimized by the religious establishment. On March 6, 2011 the Council of Senior Scholars issued a fatwa acclaiming the rule of Saudi royals and banning demonstrations. Excerpts of the fatwa read:The Council praises Allah Almighty for what He has bestowed upon the Kingdom of Saudi Arabia with unity of words and action on the basis of the book of Allah and tradition of the messenger, under the wise leadership of legitimate allegiance… Since the Kingdom of Saudi Arabia is based on the Qur’an, Sunnah, the pledge of allegiance, and the necessity of unity and loyalty, then reform should not be by demonstrations and other means and methods that give rise to unrest and divide the community…The Council affirms prohibition of the demonstrations in this country…It is what practiced by the Prophet (peace be upon him) and followed by his companions and their followers.Since then, in order to maintain absolute power, the monarchy has renewed its firm commitment to its Faustian pact with the Wahhabi religious establishment. This resolve for maintaining absolute power has taken a critical dimension with the ascension to power in 2015 of King Salman and his son crown prince Muhammad bin Salman, who essentially managed to wield effective power in the kingdom. On January 2, 2016, Sheikh Nimr, along with 47 Saudis, was executed for being convicted of terrorism offences. Sheikh Nimr was a vocal critic of the monarchy. But he was not a terrorist.This is the background against which Prince Muhammad launched his so-called campaign of reforms, which have been no more than a window dressing to his attempt at modernizing and controlling the Kingdom. Fundamentally, Muhammad’s reforms have not introduced any systemic change to the Kingdom’s austere social structure and laws. Under the pretext of fighting corruption, he detained dozens of princes and wealthy Saudis so that he could clip their wings and take a hefty portion of their fortune. He arrested the women activists who campaigned for allowing women to drive. He kidnapped Lebanon’s Prime Minister for not being tough enough on Hezbollah. He has waged a brutal war in Yemen initially foregrounded in Wahhabi proselytizing among Zaydi Shi’a. He arrested dissenting scholars. And most recently, he most likely ordered the gruesome dismembering of the journalist Jamal Kashoggi for being critical of his policies.Clearly, Prince Muhammad does not tolerate any form of dissent. His absolute power rests on his ability to both check the power of his family members and to maintain the loyalty of the religious establishment. Washington cannot influence the Kingdom’s religious establishment, but it can prod the royal family to remove Prince Muhammad from power in the interest of the welfare and reputation of the Kingdom. In 1964, the royal family forced King Saud to abdicate in response to his blunders. At the same time, the Trump administration should use the inexcusable murder of Kashoggi to persuade the Kingdom to renew the path of slow but steady systemic reform that began under late King Abdullah. As such, Washington can better maintain its strategic relationship with Riyadh. Otherwise, the Trump administration, besides forsaking its moral compass, will definitely make United States complicit in Prince Muhammad’s present and future misfortunes and catastrophes involving Sunni-Shi’a sectarianism and a possible war with Iran instigated as much by Wahhabi theological views of Shi’ism as by geopolitical considerations.Robert G. Rabil is a professor of Political Science at Florida Atlantic University. He is the author most recently of The Syrian Refugee Crisis in Lebanon : The Double Tragedy of Refugees and Impacted Host Communities (2016); Salafism in Lebanon : From Apoliticism to Transnational Jihadism (2014); and White Heart (2018). He can be reached @robertgrabil .*The views expressed in this article are personal and do not reflect those of Florida Atlantic University.*The views expressed in this article are also not the views of Syria Comment, which has consistently argued against US-backed regime-change. It is worth reading Yezid Sayigh’s “The Warior King,” in which it is argued that Mohammed bin Salman will weather the Khashoggi murder, his tightening grip over Saudi security explains why. \nEugene\nsaid: \r\n\t\r\n\t\t\t\t\t\nU.S.complicity, that’s a good one. One ego maniac telling other ego maniacs what’s better for them. Considering the cast of ego maniacs in power today, they hold the fate of human kind in their grasp, which revolves around rich’s, be it which ever currency is in play. Considering that the U.S. and its allies have so much in common with the blundering in the MENA today, while the bogymen put forth as the evil ones, who have indeed, become a force, like uncorking the bottle and letting the genie out, or more like opening Pandora’s, box have achieved what they haven’t. If the blundering doesn’t cease, the so-called allies will betray each other, which is already moving behind the curtain. Can it be prevented? Depends whether the U.S. opens its eyes.\n\r\n\t\r\n\t\t\t\t  October 31st, 2018, 4:47 am \n\nGhufran\nsaid: \r\n\t\r\n\t\t\t\t\t\nIt goes back to the time defying principles of us foreign policy in the midd east which rotate around support for Israel and antagonization of Iran. That led to major inexcusable blunders. Oil is a motivating factor but it is less important now after the usa surpassed Saudi Arabia in oil production and new technologies helped reduce the need for massive oil supplies.\nHuman rights violations only seem relevant when the offender is a planet that does not orbit the  manufactured sun crafted by the defense- industrial complex, just ask Yemeni children !!\n\r\n\t\r\n\t\t\t\t  November 5th, 2018, 11:21 pm \n\nName (required)\n\n\nMail (will not be published) (required)\n\n\nWebsite\n\n\nComment\n\n Notify me of follow-up comments by email. Notify me of new posts by email.\n\n\nJoshua LandisCo-Editor:Matthew Barber - University of Chicago PhD Student Email: mtb@uchicago.eduFollow @Matthew__Barber\nGuest Author:Aron Lund - Editor of Syria in Crisis:  Email:\r\naron.lund.syria@gmail.comFollow @aronlund\nGuest Author:Ehsani:  Follow @EHSANI22\nGuest Author:Aymenn Jawad Al-Tamimi - Syria Analyst:  Email:\r\naaj892@hotmail.comFollow @ajaltamimi\n© Syria Comment"}