{"id": "Australia's big finance firms struggle to restructure under inquiry cloud", "paragraph": "5 Min ReadSYDNEY (Reuters) - Struggling to adjust in the face of a damning inquiry into the financial sector, two of Australia’s top banks shelved plans for share market spin-offs on Wednesday while its biggest wealth manager faced an investor revolt over a cut-price asset sale. In a surprise change of plan, leading lender Commonwealth Bank of Australia said it would no longer include  Colonial First State Global Asset Management in a planned share market float and would instead sell Colonial to Japan’s Mitsubishi UFJ Financial Group (MUFG) for $2.9 billion. “Strategically, selling it reduces the attractiveness of the impending float of CBA’s wealth management and mortgage broking businesses as (Colonial) was the cherry on that particular cupcake,” said Hugh Dive, chief investment officer at Atlas Funds Management.  Third-ranked Australia and New Zealand Banking Group Ltd meanwhile pulled a listing of a New Zealand vehicle and equipment leasing unit as it posted its second decline in annual profit in three years.. ANZ gave no reason for cancelling the IPO, except to say it decided against it after conducting a review of the business. ANZ shares are down 9 percent so far this year, a sign of soft investor demand for bank stocks amid the negative headlines. Wealth manager AMP, which has had a particularly torrid experience during the Royal Commission inquiry into financial sector misconduct, sought to defend the fire sale of its life insurance arm after an investor outcry. Fund manager Merlon Capital Partners called AMP’s sale “preposterous” and “inept” and threatened to lobby other investors to overthrow the board - many of whom were only appointed earlier this year after others were forced out because of revelations at the inquiry. AMP shares slumped to a record low when the sale was announced last week, and they are down more than 50 percent this year. Since the start of this year, the Royal Commission inquiry has drawn a direct causality line between the banks’ high profitability and the widespread misconduct exposed at the banks and other large, vertically integrated financial firms. Among the revelations, the inquiry found banks lending without doing basic checks to ensure customers could afford loans, uncovered how they have taken fees from customers’ accounts without providing them with services, and exposed lending referral programs that incentivized staff to commit fraud. The backlash has resulted in more than A$60 billion ($42.5 billion) being wiped from the collective market value of the “big four” banks and AMP as investors brace for a regulatory overhaul once the inquiry concludes in February. Those five firms have already sold $12 billion in assets over the past two years, not including CBA’s MUFG deal.  CBA’s asset sales to Asian interests in the past year will total about A$8 billion, including the MUFG deal.     CBA said it decided to sell Colonial instead of including it in a listing of non-core assets after MUFG made an approach. It said the Japanese bank was paying the equivalent of 17.5 times Colonial’s annual net profit, far higher than the multiples seen for similar asset managers on the Australian share market. The Sydney-based bank has been the most criticized of Australia’s Big Four lenders, although Colonial was spared. CBA has been under more pressure than other banks to build up its cash reserves after agreeing to pay a record A$700 million penalty to settle money laundering charges. Despite the setbacks, banks are likely to continue exiting from non-core businesses, either through share market listings or private sales, as public sentiment calls for simpler, more customer-focused operations. “Whilst they have been precipitated by the events of the Royal Commission and by all of the focus upon the banks, it does make some strategic sense to have separate financial institutions focusing on different activities and doing them well,” said Thomas Clarke, a professor of management at the University of Technology, Sydney business school. “There is a rationale to it, it’s not just panic. They will be smaller banks but hopefully they’re going to be better managed ones.” ($1 = 1.4114 Australian dollars) Editing by Simon Cameron-MooreAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}