{"id": "Vying for Vuitton: China's e-commerce rivals seek luxury stranglehold", "paragraph": "8 Min ReadPARIS (Reuters) - China’s online giants Alibaba (BABA.N) and JD.com (JD.O) are taking their battle for relevance in the lucrative luxury goods market to a new level, as they aim to crack e-commerce tie-ups with top brands that usually shun selling through third parties. From Hugo Boss (BOSSn.DE) to La Perla underwear, the online shopping giants have recruited dozens of labels since launching their rival luxury sites in mid-2017, touting their access to a trove of consumer data and their grip on local payments systems in the world’s biggest market for high-end fashion. But some of the most prized names have so far remained aloof, and the race is on to attract the likes of LVMH’s (LVMH.PA) Louis Vuitton: a brand notorious for only selling its handbags and other wares through its own stores and websites. Both are banking that even elusive outsiders will tire of trying to fly solo in China, where potential clients shop far more by mobile phone apps than in the United States or Europe, and those in smaller, far-flung cities are hard to reach.  “It’s a matter of time,” said Xia Ding, the head of fashion at China’s No.2 e-commerce player JD.com and of its luxury site Toplife, adding the platform had held talks with all major brands. That echoes a similar message from its bigger competitor Alibaba and its Luxury Pavilion platform. As they chase labels, the firms are willing to go where the likes of Amazon (AMZN.O) will not. That includes giving them control over their image and prices - some of which, like $97,926 Tiffany (TIF.N) jewels, have reached eye-watering amounts - while offering advantageous fees compared with Western equivalents. And while some brands like Italy’s independent Armani signed up early on to both sites, the platforms have since devised more elaborate deals to win over and retain others. Alibaba is developing a specific app for Chinese travellers with its most significant luxury client to date, Cartier-owner Richemont (CFR.S) and its Net-A-Porter online shopping portal, and it teamed up with Italy’s Moncler (MONC.MI) to sell a collection of its fancy puffer jackets designed solely for Pavilion. Alibaba, behind mass market shopping sites Tmall and Taobao and YouTube equivalent Youku, has already bagged distribution or content-sharing alliances ranging from U.S. coffee behemoth Starbucks (SBUX.O) to Walt Disney (DIS.N). JD - which counts Tencent Holdings Ltd (0700.HK), owner of social media platform WeChat, as an investor - also has partnerships with the likes of Walmart and Alphabet Inc’s Google (GOOGL.O), helping it gain a foothold beyond China and Southeast Asia.  In luxury, it has cracked some top brands at LVMH’s rival, Paris-based conglomerate Kering (PRTP.PA), signing Balenciaga, known for its luxury sneakers, and fashion house Saint Laurent on to Toplife.  Vuitton, one of the market leaders in the luxury sector with annual revenues estimated at more than 9 billion euros, is fiercely protective of its distribution as a means of controlling prices and supply. That has helped Vuitton, and a handful of rivals such as Hermes HMRS.PA, maker of $10,000-plus Birkin bags, sustain their status at the upper end of the luxury hierarchy, a high-margin sphere to which others like Britain’s Burberry (BRBY.L) aspire.  In China, Vuitton - like Kering’s Gucci or Hermes - has ventured online but on its own terms, with a WeChat store and a standalone e-commerce site launched in 2017 that it says is doing well, though it does not publish earnings.  “Everyone told me you couldn’t go it alone in China, that no-one went to a ‘brands.com’ and I think we’ve proven that to be incorrect,” Ian Rogers, who runs the digital operations at parent LVMH. “When you have a product people really want, they’re going to get it the way that’s possible to get it.” Chinese customers are critical for Vuitton and its peers, already accounting for at least a third of all industry sales. Many are starting to spend more at home rather than on overseas trips, encouraged by government measures such as cuts in import duties, leading labels to lower prices accordingly. But while Vuitton has stores in 20 Chinese cities, it is relying like rivals on online sales to reach clients beyond that base.  “A third of potential buyers are in cities where there are no luxury stores. Their only access to products is e-commerce,” said Sebastien Badault, Alibaba’s managing director for France.    The group says it can give luxury brands visibility and access to those areas, and also crunch data from its more than 600 million online shopping clients to help them identify pockets of demand.  LVMH did not comment on what it would take for Vuitton to join forces with either of the Chinese players. The two offer some subtly different services, with JD also handling inventories and storage for those who want it, or offering to ease brands’ set-up within WeChat, a platform with a billion users.  The sites offer to share client data and take commissions per sale, which at Alibaba’s Luxury Pavilion sit at up to 5 percent, Badault said. That is in line with the broader online shopping sector in China, but lower than the 12-15 percent average on U.S. or European equivalents, he added. JD declined to give details. Other LVMH brands have already taken the plunge, including several cosmetics labels such as Benefit, which retails on Tmall. Upscale fur house Fendi has experimented with a pop-up store on JD’s Toplife - a method used by the group to lure brands in.  “We’re open to doing that because we know it’s an education process,” Ding said, adding that JD had constant exchanges even with the reticent brands like Vuitton, Hermes and Gucci. “We are invited by them to give lectures, to share our findings and experience.” Hermes has already signaled it could cave eventually - a major departure for a brand that also only sells in its own networks. Gucci has made its red lines clear, demanding more of a crackdown on fake luxury goods circulating on the likes of Tmall.  JD and Alibaba will still have to persuade brands that their platforms can deliver. They aim to eventually reach a universe of 200 to 250 luxury labels, up from the 80 Toplife expects to have by year end or the 75 Pavilion now boasts.      Moncler, which launched on Pavilion in late September, said in October it was happy with the project, though the impact on sales volumes was “not yet” material. But luxury players are also increasingly open about their struggle to break China’s online market alone.  “Our business is on fire and when I look at the e-commerce that we do (in China) it’s basically peanuts,” Fabrizio Cardinali, chief operating officer at Italy’s independent Dolce & Gabbana, told a Financial Times Business of Luxury conference earlier this year.  “We need to find a way to break through, and it’s not just for us, it’s for everybody.” Reporting by Sarah White and Pascale Denis; Editing by Alex RichardsonAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}