{"id": "RPT-Top U.S. funds seek sunset rules on dual-class share listings", "paragraph": "5 Min Read(Repeats without change) By Ross Kerber BOSTON, Oct 23 (Reuters) - A trade group representing top U.S. pension funds and asset managers, including BlackRock Inc and T. Rowe Price Group, will ask stock exchanges to limit how long companies may operate with unequal voting rights for shareholders. The move is meant as a compromise to solve one of the trickiest issues in American corporate governance, said Ken Bertsch, director of the Council of Institutional Investors, based in Washington, D.C., which organized the effort. Past calls to bar dual-class shares have gone nowhere even as the shareholding structures remain popular in initial public offerings of technology companies and have led to controversies at larger firms including Facebook Inc. Shares of this kind are widely held by big funds despite their concerns that the limited voting rights can lead to insular boards and poor corporate oversight. Large investors “need to participate in the market, so they want a systemic solution” rather than foregoing shares of particular companies, Bertsch said. Specifically the trade group will ask New York Stock Exchange parent, Intercontinental Exchange Inc, and Nasdaq Inc to require in their listing standards that companies seeking to go public using multiple share classes with unequal voting rights have plans to equalize them within seven years, according to letters seen by Reuters that the trade group plans to send on Wednesday. Companies could extend the structures another seven years if authorized by shareholders, voting on an equal basis, under the trade group’s proposal. “Investors should be allowed to make an informed choice about investing in a company with a multi-class structure,” Nelson Griggs, President of Nasdaq Stock Exchange, said in a statement. Eliminating the choice of using multiple share classes could lead companies to “stay private or sell themselves. Those outcomes preclude retail public investors from participating in the company’s growth.” Intercontinental Exchange spokeswoman Lisette Kwong declined to comment. In addition to the large asset managers, the Council’s membership includes top state pension funds such as the California Public Employees’ Retirement System and the Florida State Board of Administration which oversees retirement assets. The Council has pressed for an end to dual-class systems in the past, and for action by regulators, to little effect so far. Stock index providers have taken a range of stances on the question of whether to include shares of companies with unequal rights. The Council’s latest effort accepts that some companies with unequal voting rights would continue that way. Such companies would include cloud-storage provider Dropbox Inc, Snapchat parent Snap Inc, and meal-kit maker Blue Apron Holdings Inc, which all have gone public since last year with little or no voting representation for certain investors. In all the council said 19 percent of IPOs on U.S. exchanges last year had at least two classes of stock with different voting rights. Some technology executives argue the unequal structures give business leaders more leeway to focus on long term goals rather than answer to short term Wall Street expectations. Critics respond that the setups leave shareholders with little recourse when problems emerge, especially over the longer term. The issue came to a head in May at Facebook, where a majority of outside investors backed a measure to revamp its voting structure amid concerns about how the company had handled content and privacy issues, but the vote had no impact given the majority control of voting rights by company founder and CEO Mark Zuckerberg. In a statement provided by the Council, BlackRock co-founder and vice chairman Barbara Novick said that “BlackRock believes that equal voting rights are a fundamental tenet of good corporate governance.” Donna Anderson, head of corporate governance at T. Rowe Price, said in an interview there are signs that time limits for multiple share classes will catch on. She cited a growing number of IPOs with the feature and supportive comments about such limits from U.S. SEC commissioner Robert Jackson in February. “We’re in a potentially unique moment of consensus,” she said. Reporting by Ross Kerber; editing by Clive McKeefAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}