{"id": "KDP comes first in Iraqi Kurdistan election", "paragraph": "2 Min ReadERBIL, Iraq (Reuters) - The ruling Kurdistan Democratic Party (KDP) came first in a parliamentary election in the semi-autonomous Kurdistan Region of Iraq, winning 45 seats, the election commission said on Sunday, positioning it to lead the next regional government. A year after a failed bid for independence, Iraq’s Kurds voted last month in a parliamentary election that could disrupt the delicate balance of power in the region. Announcement of the results was delayed for three weeks after the Independent High Elections and Referendum Commission said it received and was investigating 1,045 complaints of electoral violations. The KDP’s historic rival and junior coalition partner in government, the Patriotic Union of Kurdistan (PUK), was in second place with 21 seats, the commission said in a news conference. With opposition parties weak, the KDP and PUK are likely to extend their almost three decades of sharing power, but the results suggest that Masoud Barzani’s KDP will take a dominant position in Kurdish politics. On Sept. 30, election day, the PUK said it might not recognize the results of the election due to what it described as electoral violations but then appeared to backtrack, injecting uncertainty into the process. Election observers also said there were irregularities. The two parties, who fought a civil war in the 1990s but more recently have taken to sharing power, have recently come out of a grueling political battle in Baghdad, where they competed for the presidency of federal Iraq. The PUK came out on top with the election of Barham Salih. The largest Kurdish opposition party, Gorran, or Movement for Change, was a distant third with 12 seats.  There are 111 seats in the Iraqi Kurdistan Parliament with 11 reserved for minority groups. Reporting by Ahmed Aboulenein; Additional reporting by Hesham Hajali in Cairo; Editing by Alistair Bell and Bill TrottAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}