{"id": "RPT-China hopes trade expo will highlight import clout as U.S. dispute rages", "paragraph": "5 Min Read(Repeats Friday story ahead of opening of trade fair on Monday) By John Ruwitch and Chen Aizhu SHANGHAI/BEIJING, Nov 2 (Reuters) - China, dubbed ‘the workshop of the world’ for its sprawling supply chains and huge export capacity, is hoping to manufacture something new next week at a huge trade fair in Shanghai next week: import orders. The Nov. 5-10 China International Import Expo, or CIIE, is an attempt by Beijing to counter mounting criticism of its trade and business practices by bringing thousands of foreign companies together with Chinese buyers to demonstrate the importing potential of the world’s no.2 economy. At its core, the event is symbolic. When Chinese President Xi Jinping opens the expo with a speech on Monday morning, few expect him to announce bold new policies of the kind that many foreign governments and businesses have been seeking. Instead, people involved in planning meetings have said they expect state-owned companies to arrive with orders to do deals, possibly even with quotas, so that the expo will end with China something to show the world. No officials from the United States — China’s top trading partner — will be present as their trade dispute rages, but over 100 U.S. firms will be exhibiting their wares. With political pressure to deliver, some deals are likely to be toothless memoranda while others will re-hash previous orders, executives and diplomats say. Qatargas and China’s CNPC, for example, are expected to sign a supply contract that formalises a billion deal agreed in September, according to an energy executive with direct knowledge of the matter. “It’s a protocol signing, to show support to the trade fair,” said the executive. The long-term contract is worth roughly $39 billion based on current spot market prices. CNPC is also expected to sign at the expo an oil supply deal for 2019 with Saudi Aramco, a regular deal the parties normally review and renew annually around November, said the executive. Both CNPC and Qatargas did not immediately respond to request for comment. A similar agreement is likely from state-owned China National Chemicals Corp, or ChemChina, for one of its annual crude oil and refined fuel agreements, said a separate trading executive with knowledge of the matter. Presidents or prime ministers from 18 countries are travelling to Shanghai for the event, ranging from Russia and Pakistan to the Cook Islands, though none from major Western nations. Government ministers from several other countries are also coming. The European Union, meanwhile, pressed China to take concrete steps to further open its market to foreign firms and provide a level playing field. Several roads in Shanghai have been repaved ahead of the event, and security has been beefed up. Some Western diplomats and businesses have been quietly critical of whole idea of the expo, which they see as a propaganda stunt. “Here are all of these foreigners bringing their spices for the emperor,” said one person. But Xu Bin, a professor of economics and finance at the China Europe International Business School in Shanghai, said he thinks China’s leaders have come to realise this year they may ultimately be unable to appease all concerns. “I think Xi Jinping would not expect any positive reaction from Western countries this time, or in the near future,” he said. “But he still wants to do it to show the relatively poor countries and even rich countries that, look, you know, we are going to buy these things from the world. Do you want a share?” Exhibitors from around 140 countries and regions will be on hand, including 404 from Japan, the most of any country. From the United States, some 136 exhibitors will attend, including Google, Dell Inc, Ford and General Electric. A handful of countries are being represented by a single exhibitor selling one product. For Iraq, it’s crude oil. Iran, saffron. Jamaica will be marketing it’s famed blue mountain coffee and Chad is selling bauxite. Tiny São Tomé is selling package holidays. The expo may symbolise China’s willingness to import more, but at a practical level, companies that don’t have China experience may be in for a shock, said a Latin American diplomat. “People think they are going to come here with meat or chicken and start importing it tomorrow. That’s not going to happen,” he said. “It doesn’t work like that here.” Additional reporting by Michael Martina in Beijing; Editing by\nKim CoghillAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}