{"id": "Trump, Obama tout clashing visions of U.S. as elections near", "paragraph": "6 Min ReadWASHINGTON (Reuters) - Republican Donald Trump and Democrat Barack Obama made duelling election appearances on Sunday, offering sharply different views on the country’s problems but agreeing on the high stakes for voters in the final 48 hours of a tight campaign. With opinion polls showing dozens of tight U.S. congressional and gubernatorial races in Tuesday’s election, the current and former presidents said the results would determine what kind of country Americans live in for the next two years. “This election will decide whether we build on this extraordinary prosperity we have created,” Trump told a cheering crowd in Macon, Georgia, warning that Democrats would “take a giant wrecking ball to our economy.” Trump campaigned with Georgia Secretary of State Brian Kemp, who is in a tight race with Democrat Stacey Abrams for the governor’s office. Obama condemned Trump, without addressing him by name, and Republicans for what he described as their divisive policies and repeated lies. He hammered Trump and Republicans for repeatedly trying to repeal his signature healthcare law while at the same time claiming to support the law’s protections for those with pre-existing conditions. “The only check right now on the behaviour of these Republicans is you and your vote,” Obama told supporters in Gary, Indiana, during a rally for endangered Democratic Senator Joe Donnelly. “The character of our country is on the ballot,” he said. Trump and Obama are the most popular figures in their parties, and their appearances on the campaign trail are designed to stoke enthusiasm among core supporters in the late stages of a midterm congressional election widely seen as a referendum on Trump’s first two years in the White House. Opinion polls and election forecasters have made Democrats favourites on Tuesday to pick up the 23 seats they need to capture a majority in the U.S. House of Representatives, which would enable them to stymie Trump’s legislative agenda and investigate his administration. Republicans are favoured to retain their slight majority in the U.S. Senate, currently at two seats, which would let them retain the power to approve U.S. Supreme Court and other judicial nominations on straight party-line votes. In the midst of a six-day national blitz of rallies ahead of Tuesday’s election, Trump will also appear later on Sunday in Tennessee, which hosts a vital U.S. Senate race. HARD-LINE RHETORIC In the final stages of the campaign, Trump has ramped up his hard-line rhetoric on immigration and cultural issues including warnings about a caravan of migrants headed to the border with Mexico and of liberal “mobs.” He repeated those themes in Georgia, urging voters to “look at what is marching up - that’s an invasion.” He said Democrats encouraged chaos at the borders because it was good politics. Ronna McDaniel, head of the Republican National Committee, said on ABC’s “This Week” program that the media had chosen to focus on Trump’s immigration rhetoric but the president was also emphasizing economic and job gains under his presidency. The Labor Department on Friday reported sharply better-than-expected job creation in October, with the unemployment rate steady at a 49-year low of 3.7 percent and wages notching their best annual gain in almost a decade. But in Indiana, Obama said Republicans were taking credit for the economic renewal that started under his presidency. “You hear those Republicans brag about how good the economy is, where do you think that started?” he asked. Obama also appeared later on Sunday in his old home state of Illinois, which hosts a competitive governor’s race and several tight U.S. House of Representative races. Obama’s appearance on the campaign trail is his second in three days. In the battle for the Senate, Democrats are defending seats in 10 states that Trump won in the 2016 presidential election, including a handful that he won by double digits. U.S. Senator Chris Van Hollen, who heads the Democratic Senate campaign arm, said it was “remarkable” that Democrats were even in striking distance of capturing the Senate given the unfavourable map they faced. “The fact we still have a narrow path to a majority is a sea change from where we were two years ago,” he said on ABC. “These are some very close races and they are in states where Trump won big.” As of Sunday morning, almost 34.4 million people had cast ballots early, according to the Election Project at the University of Florida, which tracks turnout. That is up 67.8 percent from the 20.5 million early votes cast in all of 2014, the last federal election when the White House was not at stake. For all Reuters election coverage, click: here Graphic: A look at battleground states: here Graphic: Can Democrats regain control of the House? here: All election coverage - here Reporting by John Whitesides; Editing by Lisa Shumaker and Susan ThomasAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}