{"id": "Yields steady, volume low with spate of data ahead", "paragraph": "3 Min ReadNEW YORK (Reuters) - Yields on U.S. Treasury bonds were steady in light trading on Tuesday as investors held off on making big moves ahead of this week’s spate of economic data. Yields were up modestly on the day, aided by a recovery in equities after Monday’s sell-off and a raucous month driven by U.S. stock market volatility. Daily trading volume was at its lowest in more than a week ahead of the ADP private payrolls report and the Treasury refunding announcement due on Wednesday, the Markit PMI Manufacturing Index and the ISM Manufacturing Index on Thursday, and the U.S. non-farm payrolls report on Friday. “Treasuries are following the stock market right now. The volume has been relatively light and I think it will remain so until the jobs number on Friday and the election next week,” said Lou Brien, market strategist at DRW Trading.  Trading volume of the Chicago Board of Trade 10-year U.S. Treasury note composite bond future was down by nearly 100 percent on Tuesday afternoon from Monday’s high. The yield on the benchmark 10-year government note was up around 2 basis points, as were yields on the 30-year bond and two-year note. Treasury yields have fallen in October as companies have reported that tariffs, rising borrowing costs and a slowdown in China hurt earnings in the third quarter and are expected to do the same in the fourth. Stock prices, and yields, were driven lower following a Bloomberg report on Monday that Washington was preparing to announce tariffs on all remaining Chinese imports by early December if talks next month between Trump and his counterpart President Xi Jinping failed to ease a trade war. The report sparked a wild ride on Wall Street on Monday, with the Dow Jones industrial average .DJI falling more than 900 points from its high and the benchmark S&P 500 .SPX closing within a whisker of confirming correction territory. U.S. Treasury debt, a safe-haven investment, rises in price in times of volatility. The sell-off was stanched on Tuesday after Trump - in an interview with Fox News Channel late Monday - said he expected “a great deal” with China on trade, but warned new tariffs would be imposed if a deal was not possible. On Wednesday, the Treasury will make its quarterly refunding announcement. Analysts expect that two-, three-, and five-year note auctions will be increased by $1 billion a month, and that seven-, 10- and 30-year bond auctions will increase by $1 billion a quarter. Reporting by Kate Duguid; Editing by Susan Thomas and Richard ChangAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}