{"id": "Hacking allegation shows peril of Georgia Republican's twin election roles", "paragraph": "5 Min Read(Reuters) - The Republican candidate in Georgia’s governor’s race, who also oversees the state’s elections, accused Democrats on Sunday of trying to hack voter registration systems, a move analysts said highlighted the inherent conflict between his twin roles. The contest between Georgia Secretary of State Brian Kemp and Democrat Stacey Abrams, who is vying to become the United States’ first black female governor, had already become a flashpoint for allegations of voter suppression. Kemp drew more national attention to the contest early on Sunday with a statement making the hacking allegation but offering no supporting evidence. State Democratic Party officials quickly denied the charge. They called it an abuse of power two days before Tuesday’s elections when Americans will determine which party controls the U.S. Congress as well as pick governors in 36 states including Georgia. “It looks pretty suspicious, and I would say that regardless of which party it was,” said Alan Abramowitz, a professor of political science at Emory University in Atlanta. “It’s just one more example of the kinds of problems that can occur when the person who is in charge of running the elections in the state is not only a partisan elected official but is a party’s candidate for the highest office in the state.” Voter suppression allegations became an issue in the campaign partly because of a state law requiring an exact match of voters’ names on ID cards and rolls, down to hyphens. Two federal courts on Friday issued rulings rejecting some of Kemp’s election enforcement moves. Kemp’s charge on Sunday appeared to result from a report made to his office and the FBI on Saturday by a Georgia businessman with an expertise in software, according to David Cross, a lawyer representing several Georgia voters who have sued the state over its decision not to use paper ballots. “We expected the secretary of state would take that seriously and would take whatever remedial actions needed to be taken, and we were surprised to see that the response was to accuse the Democrats of hacking,” Cross told reporters on Sunday. Cross said the businessman, Richard Wright, had approached him with the information, which Cross turned over to Kemp’s office on Saturday morning. He also said Wright had passed the details to the state Democratic Party. Wright could not be reached for comment on Sunday. Kemp’s office did not respond to questions on Sunday about Cross’ statements. Kemp’s office said in a statement on Sunday it launched the investigation late on Saturday and that it had notified the Department of Homeland Security (DHS) and the FBI. “We opened an investigation into the Democratic Party of Georgia after receiving information from our legal team about failed efforts to breach the online voter registration system and My Voter Page,” Kemp’s office said. “We are working with our private sector vendors and investigators to review data logs.” It was not the first time that Kemp alleged that Georgia’s voting systems had been hacked. In 2016, he said a DHS computer made an unsuccessful attempt to breach the firewall guarding Georgia’s voter data. He complained on Facebook at the time that the agency had “been less than forthcoming” in responding to his allegation. The DHS inspector general in June 2017 said Kemp’s complaint was without merit. A DHS official said in an email that the department was aware of the latest allegation. The official declined to say if the agency was investigating. The FBI declined to comment. Democrats rejected Kemp’s charge. They contend he has been lax on securing voter data and that his office previously improperly disclosed private information on 6 million Georgians. “This is yet another example of abuse of power by an unethical Secretary of State,” Rebecca DeHart, executive director of the Georgia Democratic Party, said on Sunday. Kemp’s latest allegations were met with skepticism from cyber security experts, who noted that identifying who is behind a particular hack was time-consuming and extremely difficult. “Does the Georgia Secretary of State have the forensics capability and expertise necessary to investigate their own potential breach?” Alex Stamos, Facebook’s former security chief, asked on Twitter.  Stamos said he believed FBI and Justice Department specialists would be better positioned to investigate any hack. Former U.S. President Jimmy Carter, a Democrat, urged Kemp last month to step down from his election oversight role, saying keeping it while campaigning “runs counter to the most fundamental principle of democratic elections.” Kemp has refused to step down and has said he is fairly applying Georgia’s laws. For all Reuters election coverage, click: here Reporting by Joseph Ax and Jim Finkle in New York; Additional reporting by Christopher Bing in Washington; Editing by Scott Malone and Peter CooneyAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}