{"id": "RPT-India iPhone sales to fall for first time in four years-researcher", "paragraph": "3 Min Read(Repeats story first published on Saturday with no changes to text) BENGALURU, Nov 3 (Reuters) - Apple’s iPhone sales are set to dip by around a quarter in India’s holiday season fourth quarter, putting them on course for the first full-year fall in four years, industry research firm Counterpoint said on Saturday. The Cupertino, California company’s struggle to break through with India’s 1.3 billion consumers swung more sharply into focus this week after Apple blamed a disappointing set of sales forecasts on a handful of big emerging markets. Chief Executive Tim Cook said after publishing third quarter results that sales were flat in India in the fourth quarter, which includes a month-long festive season culminating this week in Diwali - a bumper period for electronics sales. Neil Shah, research director at HongKong-based Counterpoint Research, said on Saturday its channel checks pointed to numbers for the quarter in the range of 700,000 to 800,000 units, down from about a million a year ago. For the whole of 2018, Apple was set to sell about  2 million phones - a drop of about a million from last year, he said, as Indians baulk at high prices for the devices, driven by trade tariffs and a weak rupee. “Sales are set to drop for the first time in four years,” Shah said. “If you look at Q3 - it was 900k last year and this (year) is almost 450k. “Iphones have gone costlier and the features and specs aren’t that compelling. The install base of android has grown vastly; the new customer base (for Apple) is not coming.” Cook on Thursday called the company’s problems in India “speed bumps along a very long journey” and most analysts say that the prestige of Apple’s brand should allow it to claim back lost ground as Indians’ spending power continues to grow. Shah said that, while more than half the phones sold this year were older iPhone models, high selling prices meant Apple’s Indian revenue should still be flat or slightly higher than a year ago. (Reporting by Nivedita Bhattercharjee, editing by Patrick Graham)All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}