{"id": "Rugby-Ireland coach Schmidt relishes victory of the heavyweights", "paragraph": "3 Min ReadDUBLIN, Nov 17 (Reuters) - Ireland’s top of the rankings clash with New Zealand lived up to its “heavyweight” billing on Saturday, coach Joe Schmidt said as he delighted in a collective victory he was quick to share with his squad and coaching staff. The Six Nations champions laid down a massive marker ahead of next year’s World Cup by beating the All Blacks in commanding fashion to record just their second victory over the world champions in more than 100 years. “The way it had been built up as one v two, I thought it was a heavyweight clash and I just thought it was a fantastic test match,” Schmidt told a news conference after the 16-9 win. “It was an incredibly collective, hard-earned win... I’m incredibly proud of the group of Irish players who went out and did what they did tonight.” That collective effort was underlined by the fact that Ireland’s backline was shorn of the influential Conor Murray and Robbie Henshaw, while they also lost flankers Sean O’Brien and Dan Leavy to injury over the last week. As well as notching their 17th win in the last 18 games and marking two years unbeaten at home, Ireland also became the first team, apart the British and Irish Lions, to leave the All Blacks try-less since 2014. Schmidt credited the “super job” done by his defence coach, former England rugby league and union international Andy Farrell, and also singled out forwards coach Simon Easterby and scrum coach Greg Feek for their efforts. “I know a lot of people thought that our lineout was a bit flimsy last week but I thought our first half lineout was a fantastic platform to springboard into the game, as was the scrum. Greg Feek is a bit of an unsung hero there as well,” he said. “I’m lucky, I’ve got a team behind the team who do a super job.” However Schmidt was typically modest when asked about his role in the brilliant lineout move that led to the game’s decisive and only try for Jacob Stockdale. “I mostly steal them from other people. I’m always on the look out, I’m always keeping my eye out. I watched the (New Zealand) Mitre 10 Cup, they’ve always got a couple of good ones,” he said. “I’ve come up with some incredibly poor moves in my time.” (Reporting by Padraic Halpin Editing by Toby Davis)All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}