{"id": "Microsoft sales and profit beat estimates on cloud growth", "paragraph": "4 Min Read(Reuters) - Microsoft Corp (MSFT.O) beat Wall Street estimates for revenue and profit in its first quarter on Wednesday, as more businesses signed up for its Azure cloud computing services and Office 365 software. Microsoft shares have tripled since Satya Nadella became chief executive in 2014 and refocused the company on building data center software and services. The stock, which has risen more than 21 percent over the past 12 months, gained 1.9 percent in after-hours trading following the earnings report. Much of Microsoft’s recent growth has been fueled by companies moving to the cloud from on-premise data centers, helping it to beat analysts’ profit targets for more than two years. Commercial cloud revenue, which includes Azure sales, hit $8.5 billion, up 47 percent from the year-ago quarter. The growth margin for that business rose to 62 percent from 58 percent in the year-ago quarter and 59 percent in the prior quarter. Amazon.com Inc (AMZN.O) leads in cloud infrastructure services with a second-quarter market share of over 30 percent, according to market research firm Canalys, but Microsoft’s share rose to 18 percent from 16 percent in the previous quarter. Azure revenue rose 76 percent over the year, slower than the 89 percent rise in the previous quarter. Blair Hanley Frank, principal analyst at technology research and advisory firm ISG, said investors have been alerted to Azure’s slower growth. “Seeing that number decline to 76 percent where it was in the 80s and 90s is interesting. It’s not yet clear what that means,” Frank said. “Obviously Microsoft is going to see some fall in growth rate as the revenue grows.” Mark Sami, vice president at consultancy firm SPR, said Microsoft’s “mature hybrid cloud offering” helps to fuel growth and leaves rivals like Amazon “playing catch up.” Microsoft’s focus on fast-growing cloud applications and platforms is helping it beat slowing demand for personal computers that has hurt sales of its popular Windows operating system. Revenue from Microsoft’s personal computing division, its largest by revenue, rose 14.6 percent to $10.75 billion. That figure beat the consensus analyst estimate of $10.13 billion. The unit includes Windows software, Xbox gaming consoles, online search advertising and Surface personal computers, but gaming is the growth driver with revenue up 44 percent from a year ago. Microsoft forecast strong revenue for that division in the holiday quarter, of $12.8 billion to $13.2 billion. “Xbox has the key gaming community and monetization capability,” said Nadella. Revenue at Microsoft’s productivity and business processes unit, which includes Office 365, rose 18.6 percent to $9.77 billion, topping analysts’ average expectation of $9.40 billion, according to Refinitiv data. Microsoft estimated revenue of $9.95 billion to $10.15 billion for that unit in the current quarter.     Overall, the Redmond, Washington-based software company’s revenue rose to $29.08 billion from $24.54 billion, above analysts’ average estimate of $27.90 billion, according to Refinitiv data. Net income rose to $8.82 billion, or $1.14 per share, in the quarter ended Sept. 30 from $6.58 billion, or 84 cents per share, a year earlier.  Analysts had expected earnings of 96 cents per share. Reporting by Vibhuti Sharma in Bengaluru and Jane Lanhee Lee in San Francisco; Editing by Bernard Orr and Richard ChangAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}