{"id": "Djokovic backs Federer in preferential treatment row", "paragraph": "3 Min ReadLONDON (Reuters) - World number one Novak Djokovic leapt to the defense of great rival Roger Federer on Monday after claims that the Swiss enjoys preferential treatment on Tour. Frenchman Julien Benneteau caused a stir during an interview on French radio station RMC Sport on Sunday in which he said tournament referees were often kinder to Federer when it came to scheduling his matches. Benneteau was particularly referring to the Australian Open where he said 20-time Grand Slam champion Federer played “12 or 13” of his 14 matches at Melbourne in the past two years at night, so avoiding the often scorching temperatures. He also suggested Federer’s Laver Cup project, an exhibition team event in which Australian Open tournament director Craig Tiley is also involved, represented a conflict of interest. Asked for his thoughts after his round-robin victory over American John Isner at the ATP Finals on Monday, Djokovic said Federer had earned the right for special treatment. “In the end of the day, in a way he deserves the special treatment because he’s six-time champion of Australian Open and arguably the best player ever,” Djokovic told reporters. “If he doesn’t have it, who is going to have it? People want to see him play on the center court, and they want to see him play in showtime, the best hours, which is 7:30 at night in Rod Laver Arena. “I understand Julien’s point because sometimes it does seem that maybe certain players get more favored year after year in certain tournaments. On the other side, you have to understand that Federer is a driving force of tennis in terms of revenue, in terms of attention. “Julien and guys like him are also benefiting from tennis, because of Roger, because of what he has done for the sport.” Isner went even further, saying the likes of Federer, Djokovic and Rafael Nadal should get even more privileges. “If anything, maybe they should get more special treatment because those guys, the top players, have made other players below them a lot of money,” the American said after his 6-4 6-3 defeat. “It is like the Tiger Woods effect in golf. So that is how you can look at a guy like Roger. He is men’s tennis in my opinion. He deserves everything and more that he’s ever had.” Six-time champion Federer is back in action, in the night session, at the ATP Finals on Tuesday when he takes on Dominic Thiem, aiming to hit back after losing to Kei Nishikori in his opening group match on Sunday.  Reporting by Martyn Herman, editing by Pritha SarkarAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}