{"id": "Amgen posts higher quarterly EPS, Repatha sales fall short", "paragraph": "3 Min Read(Reuters) - Amgen Inc (AMGN.O) on Tuesday said stock buybacks lifted its third-quarter earnings per share, but operating income fell as expenses rose and sales of some key products declined. Total revenue for the quarter rose 2 percent from a year earlier to $5.9 billion. Operating expenses, including research and product launch costs, increased 7 percent to $3.58 billion. Sales beat expectations by about $100 million, due to older drugs like kidney medication Sensipar and anemia drug Epogen, but “Repatha looked a little weak,” Mizuho analyst Salim Syed said in a research note. Amgen last week said it slashed the U.S. list price for cholesterol drug Repatha by 60 percent to $5,850 a year, mainly to reduce out-of-pocket costs for patients on Medicare, the federal government’s health plan for seniors. Citing solid fourth-quarter expectations, the company raised its full-year earnings forecast to between $14.00 and $14.25 per share from a previous outlook of $13.30 to $14.00. That puts the midpoint above Wall Street estimates of $14.01.  Adjusted earnings per share at the world’s largest biotechnology company rose 13 percent to $3.69 for the quarter, exceeding Wall Street analysts’ average estimate by 24 cents,  according to Refinitiv data. Adjusted operating income fell 2 percent to $2.97 billion. Repatha sales totaled $120 million, down from $148 million in the second quarter, and short of the $166 million forecast by analysts. Sales of blockbuster white blood cell booster Neulasta fell 6 percent to $897 million. That trend could accelerate as rivals introduce “biosimilar” versions of the infection fighter, with a second competitor possibly approved by U.S. regulators later this week. Aimovig, the migraine drug launched by Amgen in May, saw sales of $22 million. Amgen, which recently reached a deal with U.S. pharmacy benefit manager Express Scripts Holding Co (ESRX.O) on coverage of Aimovig, is currently discussing terms with other payers including health insurer Anthem Inc ANTM.O, commercial operations chief Murdo Gordon said on a conference call. He said 100,000 patients have so far been treated with Aimovig, and a growing number are getting coverage from their insurance plans, rather than receiving free medication from Amgen in the form of samples or patient assistance programs.  Amgen said it now expects total revenue for the year of $23.2 billion to $23.5 billion, up from $22.5 billion to $23.2 billion. The company’s shares, which rose half a percent to close at $189.08 in regular trading, were up slightly at $189.45 after hours. Reporting by Deena Beasley; Editing by Bill Berkrot and Diane CraftAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}