{"id": "U.S. Treasury's Mnuchin spoke with China Vice Premier Liu - WSJ", "paragraph": "3 Min Read(Reuters) - U.S. Treasury Secretary Steven Mnuchin has resumed discussions with China Vice Premier Liu He, with the two speaking by telephone on Friday, the Wall Street Journal reported on Monday, citing sources.  The conversation did not lead to any breakthrough to resolve the tariff dispute between the world’s two largest economies, the WSJ reported.  A U.S. Treasury spokesman did not immediately respond to a query about the report. The development comes as China President Xi Jinping and U.S. President Donald Trump plan to meet on the sidelines of a G20 summit that is being held in Argentina at the end of November and early December. Earlier this month, after a phone conversation with Xi, Trump said he thought the United States would make a deal with China on trade but stood ready to levy more tariffs on Chinese goods if no progress is made. Asked about the report of the call, and whether the two countries were getting ready to resume talks, Chinese Assistant Commerce Minister Li Chenggang told reporters that during the Xi-Trump call both sides had reached many concensuses on the trade issue. “At present, both countries economic teams are having contacts about putting into effect the consensus of the two countries leaders,” Li said. “We hope that this work, with the hard efforts of both sides, can achieve positive progress,” he added, without elaborating.             Trump has imposed tariffs on $250 billion of Chinese goods to pressure Beijing to stop intellectual property theft and forced technology transfers, improve market access for U.S. firms and cut China’s high-tech industrial subsidy programme - major shifts away from China’s state-led economic model. The tariff rate on $200 billion in Chinese goods is set to increase to 25 percent from 10 percent on Jan. 1. Trump has also threatened to impose tariffs on all remaining Chinese imports, about $267 billion worth, if China fails to address U.S. demands.  Mnuchin in October said that China needed to identify concrete “action items” to rebalance the two countries’ trade relationship before talks to resolve their disputes could resume.  Reporting by Kanishka Singh in Bengaluru and David Lawder in Washington; Additional reporting by Ben Blanchard in Beijing; Editing by Cynthia Osterman & Simon Cameron-MooreAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}