{"id": "Protests after Pakistan frees Christian woman sentenced to death over blasphemy", "paragraph": "5 Min ReadISLAMABAD/LAHORE (Reuters) - Pakistan’s Supreme Court on Wednesday freed a Christian woman from a death sentence for blasphemy against Islam and overturned her conviction, sparking angry protests and death threats from an ultra-Islamist party and cheers from human rights advocates. New Prime Minister Imran Khan issued a warning to the religious right late in the evening that any prolonged blockade of streets would be met with action. Asia Bibi, a mother of four, had been living on death row since 2010, when she became the first woman to be sentenced to death by hanging under Pakistan’s draconian blasphemy laws, which critics say are too harsh and often misused. She was condemned for allegedly making derogatory remarks about Islam after neighbours objected to her drinking water from their glass because she was not Muslim. Bibi has always denied committing blasphemy. The case has outraged Christians worldwide - Pope Francis said he personally prayed for Bibi - and has been a source of division within Pakistan, where two politicians who sought to help Bibi were assassinated. Chief Justice Saqib Nisar, who headed a special three-judge bench set up for the appeal, cited the Koran in the ruling, writing that “tolerance is the basic principle of Islam” and noting the religion condemns injustice and oppression. In overturning her conviction, the ruling said the evidence against Bibi was insufficient. Bibi did not appear in the courtroom and her whereabouts were a closely held secret for fear of attacks on her and her family. Many have speculated they will be forced to leave the country, but there was no confirmation of their plans. Her lawyer called the court ruling “great news” for Pakistan. “Asia Bibi has finally been served justice,” lawyer Saiful Mulook told Reuters. “Pakistan’s Supreme Court must be appreciated that it upheld the law of the land and didn’t succumb to any pressure.” Supporters of Islamist political party Tehreek-e-Labaik (TLP) immediately condemned Wednesday’s ruling and blocked roads in major cities, pelting police with stones in the eastern city of Lahore. Street protests and blockades of major roads were spreading by mid-afternoon, paralysing parts of Islamabad, Lahore and other cities.  One of the TLP’s top leaders called for the death of Nisar, the chief justice, and the two other judges on the panel. “They all three deserve to be killed. Either their security should kill them, their driver kill them, or their cook kill them,” TLP co-founder Muhammad Afzal Qadri told a protest in Lahore. “Whoever, who has got any access to them, kill them before the evening.” He also called for the ouster of Khan’s new government of and for army officers to rise up against powerful military chief General Qamar Javed Bajwa, who he said “should be sacked from the army”. Khan addressed the nation in a televised speech on Wednesday night, supporting the court ruling and warning the ultra-Islamists not to disrupt the nation. “We will not allow any damages to occur. We will not allow traffic to be blocked,” Khan said. “I appeal to you, do not push the state to the extent that it is forced to take action.” The TLP was founded out of a movement supporting a bodyguard who assassinated Punjab provincial governor Salman Taseer for advocating for Bibi in 2011. Federal minister for minorities Shahbaz Bhatti was also killed after calling for her release.   In November, TLP staged a crippling blockade of Islamabad after small changes to a religious oath taken by election candidates, which it said were tantamount to blasphemy. Seven people were killed and more than 200 wounded in clashes with the police and TLP’s supporters only dispersed after striking a deal with the military.   In February, Bibi’s husband, Ashiq Masih, and one of her daughters met Pope Francis shortly before Rome’s ancient Coliseum was lit in red one evening in solidarity with persecuted Christians, and Bibi in particular. The pope told Bibi’s daughter: “I think often of your mother and I pray for her.” Christians make up only about 2 percent of Pakistan’s population and are often discriminated against. Dozens of Pakistanis - including many minority Christians or members of the Ahmadi faith - have been sentenced to death for blasphemy in the past decade, though no one has been executed. Rights groups say the blasphemy law is exploited by religious extremists as well as ordinary Pakistanis to settle personal scores.  Additionally, at least 65 people have been murdered over blasphemy allegations since 1990, including a 23-year-old student beaten to death on his university campus last year. “This is a landmark verdict,” said Omar Waraich, deputy South Asia director for Amnesty International. “The message must go out that the blasphemy laws will no longer be used to persecute the country’s most vulnerable minorities.” Writing by Kay Johnson; Editing by Nick Macfie and Alex RichardsonAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}