{"id": "New Zealand coach Hansen says Ireland best in the world", "paragraph": "3 Min ReadDUBLIN (Reuters) - New Zealand coach Steve Hansen said Ireland were the best in the world and cast them as favourites for next year’s World Cup after his team were beaten 16-9 in a battle between the two top-ranked sides in Dublin on Saturday.   Going in search of their 12th victory in 13 matches this year, with their only blemish a 36-34 home loss to South Africa, the southern hemisphere champions came up short in most areas as Ireland ran out deserving winners. “I said this at the beginning of the week, you’ve the two best sides in the world playing each other, so as of now they’re the number one team in the world. I guess they are favourites (for the World Cup),” Hansen told a news conference. “I thought they played outstandingly well, they deserved to win and they took the opportunities they got. We just got beaten by a better team.” Given they had just recorded only their second ever victory against the winners of the last two World Cups and nearly every Rugby Championship in between, Ireland coach Joe Schmidt took his fellow countryman’s prediction with a large pinch of salt. “The World Cup in 11 months’ time?” Schmidt said, opting instead to focus on his team’s next match against the lowly United States in a week’s time. “I think he (Hansen) probably enjoys a bit of a banter. For us to be favourites when they’ve been the world number one team for nine years and continue to be the world number one team. We’ll take tonight and we’ll leave 11 months for 11 months’ time.” Ahead of the final game of their season in Italy next week, Hansen was left to rue some poor discipline early on that cost his side nine penalties in the first half and handed the Six Nations champions the initiative that they refused to let go. “Our discipline in the first half let us down a bit. Some of the penalties in the first half were just dumb, avoidable penalties,” he said. “When you start to have to chase the game, in what is a really very tight game, you start to force things a little bit when you don’t have to. When you play a very good rugby side, it comes back and bites you.” Additional reporting by Padraic Halpin; Editing by Toby DavisAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}