{"id": "British finance watchdog to quiz polling firms over hedge fund clients", "paragraph": "3 Min ReadLONDON (Reuters) - Britain’s financial watchdog is to meet with polling companies to check if private polls for hedge funds need regulating during events like the Brexit referendum campaign. Andrew Bailey, chief executive of the Financial Conduct Authority, has asked to meet the British Polling Council (BPC) and the sector’s voluntary oversight body, the Market Research Society (MRS), to see how the FCA’s regulatory remit could interact with the sector. “It would also be useful for this discussion to explore what, if any, actions may be required of BPC and MRS members,” Bailey said in a letter to the polling companies made available to the media. Parliament’s Treasury Select Committee has expressed concerns that during the Brexit vote in 2016, polling companies provided broadcasters with surveys while at the same time selling data privately to hedge funds which could then trade on the information. Sterling, for example, fell sharply when it became clear that the referendum outcome was in favor of leaving the European Union. Nicky Morgan, chair of the Treasury Committee, told the BPC in September that polling firms faced a conflict of interest that was not being managed. On Thursday she welcomed the FCA’s intervention. “I have asked the regulator to update the committee on whether the current private polling rules are sufficient to mitigate the risk that market abuse rules could be breached, whether the BPC and MRS will take actions, and whether greater regulatory oversight may be needed,” Morgan said. BPC President John Curtice has dismissed Morgan’s views of the polling industry and has challenged her to substantiate her claims or withdraw them. “If, however, it is felt to be undesirable for a hedge fund to commission polls ... because they might acquire an undesirable ‘trading advantage’ in undertaking their market activity, then perhaps it is their ability to commission such polls that needs to be regulated,” Curtice told Morgan in a letter earlier this month published on the BPC’s website. The Alternative Investment Management Association, a hedge fund industry body, said there was an incredible demand for exit polling data and any discussion of this issue should recognize that. “Our members commit significant resources to understanding and complying with the law, and based on the advice AIMA have been given the organization is unaware of any laws that exist that would declare alternative data sets such as this as illegal,” AIMA said. Reporting by Huw Jones. Editing by Jane MerrimanAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}