{"id": "Canadian PM Trudeau says in talks with Pakistan over Asia Bibi", "paragraph": "3 Min ReadOTTAWA (Reuters) - Canadian Prime Minister Justin Trudeau said on Monday talks were underway with Pakistan over a Pakistani Christian woman whose acquittal on blasphemy charges against Islam last month sparked days of protests in the South Asian country. Asia Bibi, who spent eight years on death row in Pakistan before being released, is in protective custody because her life is in danger from those who disagree with the acquittal. Bibi’s husband, Ashiq Masih, has appealed for help to Britain, Canada, Italy and the United States. “We are in discussions with the Pakistani government,” Trudeau said in an interview with Agence France Presse in Paris, where he attended a ceremony marking the end of World War One. His comments were confirmed by a spokesman in Ottawa.  “There is a delicate domestic context that we respect which is why I don’t want to say any more about that, but I will remind people Canada is a welcoming country,” he added.  While AFP said the discussions were about potentially offering Bibi and her family asylum, this was not confirmed by the spokesman in Ottawa. On Tuesday, Pakistan’s foreign ministry said Bibi’s situation was discussed when Foreign Minister Shah Mahmood Qureshi was called by his Canadian counterpart the previous day. “Foreign Minister Qureshi said Asia Bibi is our national and Pakistan fully respects her legal rights,” ministry spokesman Mohammad Faisal said on social network Twitter. Islamists have threatened to stir up protest in Pakistan if Bibi is permitted to leave. The government has indicated it will bar her from travelling abroad. On Tuesday, the ultra-Islamist Tehreek-e-Labaik Pakistan (TLP) party that led the protests said it strictly opposed her release and any permission for her to go abroad. “It is a stance of the millions of Pakistani Muslims,” TLP spokesman Ejaz Ashrafi told Reuters. Last week, Canada urged Pakistan to ensure Bibi’s well-being and Foreign Minister Chrystia Freeland said the government was “extremely engaged in this issue”. Bibi was convicted of blasphemy in 2010 after neighbours said she made derogatory remarks about Islam when they objected to her drinking water from their glass because she was not Muslim. She is a Protestant and denies committing blasphemy. TLP supporters closed roads in major cities in Pakistan during three days of demonstrations against Bibi’s acquittal at the end of last month.  Bibi’s lawyer, Saiful Mulook, fled to the Netherlands this week because of fears for the safety of his family. Reporting by Steve Scherer; Additional reporting by Asif Shahzad in ISLAMABAD:; Editing by Tom Brown and Clarence FernandezAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}