{"id": "Countering global protectionism, Pacific trade pact nears takeoff", "paragraph": "3 Min ReadWELLINGTON (Reuters) - A landmark 11-country deal that will slash tariffs across much of the Asia-Pacific region will come into force at the end of December, New Zealand said on Wednesday, a rare bright spot for global commerce as the U.S.-China trade war intensifies. The deal moved forward after Australia become the sixth nation to formally ratify the deal, alongside Canada, Japan, Mexico, New Zealand and Singapore. “This triggers the 60 day countdown to entry into force of the Agreement and the first round of tariff cuts,” said New Zealand Trade and Export Growth Minister David Parker. His country is responsible for official tasks such as receiving and circulating notifications made by members of the pact.  The original 12-member deal was thrown into limbo early last year when U.S. President Donald Trump withdrew from the agreement to prioritize protecting U.S. jobs.. The remaining nations, led by Japan, finalised a revised trade pact in January, called the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP).  The deal will reduce tariffs in economies that together amount to more than 13 percent of global gross domestic product (GDP)  - a total of $10 trillion. With the United States, it would have represented 40 percent. “As protectionist moves strengthen across the world, the importance of free and fair rules is growing more and more,” Japanese Economy Minister Toshimitsu Motegi told a news conference in Tokyo.  He added that Japan would continue be “a flag-bearer for free trade.” The success of the deal has been touted by officials in Japan and other member countries as an antidote to counter growing U.S. protectionism. They hope that Washington would eventually recommit to the pact. Trump’s economic agenda, however, remains focused on China as a trade war between the world’s two largest economies shows little sign of abating. Trump on Tuesday warned he is ready to impose additional tariffs on Chinese goods if an agreement with Beijing could not be reached. The United States has already imposed tariffs on $250 billion worth of Chinese goods, and China has responded with retaliatory duties on $110 billion worth of U.S. goods. The trade war threatens to check global economic growth, though signatories to CPTPP said the deal would be a boon for several sectors. Australia said the agreement will boost agricultural exports, set to be worth more than A$52 billion ($36.91 billion) this year despite a crippling drought. The five member countries still to ratify the deal are Brunei, Chile, Malaysia, Peru and Vietnam.  While most of the remaining parties to the agreement have vowed to ratify the deal, Malaysian Prime Minister Mahathir Mohamad said he was still weighing its benefits. Peru’s deputy trade minister Edgar Vasquez told Reuters he expects Lima will ratify the agreement before 2019. “One of the countries that will benefit the most is Peru,” said Vasquez. Reporting by Charlotte Greenfield and Praveen Menon in WELLINGTON,; Additional reporting by Colin Packham in Sydney, Yoshifumi Takemoto in Tokyo, Mitra Taj in Lima, Joseph Sipalan in Kuala Lumpur; Editing by William Maclean, Shri Navaratnam & Kim CoghillAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}