{"id": "SK Hynix warns of more chip price falls, capex cut as trade tensions bite", "paragraph": "4 Min ReadSEOUL (Reuters) - SK Hynix offered a downbeat outlook for semiconductors on Thursday, warning prices of flash memory chips will fall further until early next year from over two-year lows, hit by waning smartphone sales and weaker Chinese demand. The South Korean firm, a key Apple Inc supplier and the world’s No.2 memory chipmaker by sales, also forecast lower capital spending for next year, as escalating Sino-U.S. trade tensions make it tough to predict demand. SK Hynix shares fell as much as 5.2 percent on Thursday to their lowest level since August 2017 despite the company posting record quarterly operating profit and sales. The shares pared losses to trade 3.0 percent lower by 0410 GMT. “Given global economic uncertainties and under the assumption that we will keep working on the inventories, we expect that investment will be adjusted to a lower level than this year,” Myoung Young Lee, SK Hynix’s executive vice president, told analysts. Lee did not elaborate on the size of its 2019 investment saying the company’s business plans are not complete, but added that it would set up quarterly investment plans instead of an annual budget to better respond to demand uncertainty. Hynix, which spent around 10 trillion won ($8.8 billion) as capex in 2017, has planned to invest at least 30 percent more this year to boost output, hoping to ride on the coattails of the industry’s two-year supercycle of tight supply and soaring prices. But some chip prices have already started falling and are set to end the unprecedented industry boom and soaring profits for chipmakers around the world, analysts say. SK Hynix joined a growing list of chipmakers sounding caution on the industry outlook, as they wrestle with excess inventory due to weakening demand for smartphones, cryptocurrency mining devices and consumer electronics. Chipmakers including Texas Instruments Inc and STMicroelectronics offered disappointing forecasts this week, hammering tech sector shares and roiling global stock markets. “Tough times are ahead until roughly the first half of next year, but we will have a clearer picture early next year when chipmakers lay out their investment plans,” said Lee Wang-jin, analyst at Taurus Investment and Securities. Average prices of NAND flash memory chips, used in smartphones and memory cards to store data, are down sharply to levels seen in early 2016, and expected to continue to slide until the first quarter of 2019, SK Hynix said. It expected DRAM price increases would slow through the first quarter of next year and then remain flat or rebound afterwards. DRAM memory chips are used in servers, gaming PCs and cryptocurrency mining devices to process large amounts of data. SK Hynix said its July-September operating profit rose 73 percent to a record 6.5 trillion won, beating a 6.3 trillion won average forecast from 19 analysts, according to Refinitiv data. Sales rose 41 percent to a record high of 11.4 trillion won compared to the same period a year ago. Reporting by Ju-min Park and Heekyong Yang; Writing by Miyoung Kim; Editing by Stephen Coates and Muralikumar AnantharamanAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}