{"id": "Baidu's fourth-quarter sales goal misses estimates as regulation, trade fears bite", "paragraph": "4 Min ReadBEIJING/SAN FRANCISCO (Reuters) - Chinese search engine operator Baidu Inc on Wednesday forecast fourth-quarter sales below analyst estimates, saying new regulations and uncertainty surrounding a Sino-U.S. trade spat has prompted clients to cut back on advertising. U.S.-listed Baidu, often compared to Alphabet Inc’s Google, also reported a sharp decline in its operating profit margin in the third quarter, as the firm invests heavily in autonomous driving and artificial intelligence (AI). The figures come as Chinese technology companies weather the impact of new regulations, such as the suspension of new online game licenses and measures to censor content deemed undesirable. At the same time, ongoing tit-for-tat import tariffs between the United States and China has created economic uncertainty. Baidu said it expects advertising in areas such as real estate, finance and e-commerce to be negatively affected. The firm “began to feel the impact of policy changes... as well as general uncertainties from a potential trade war,” Chief Financial Officer Herman Yu said on an earnings call with analysts. “We expect this trend to continue.” Baidu also expects revenue impact from an ongoing cleanup of illegal medical advertising, which emerged in 2016 and which led to regulation that slashed the number of eligible advertisers. Subsequent restructuring has seen Baidu sell cash-burning units. The firm expects October-December revenue of 25.48 billion to 26.72 billion yuan, versus 23.6 billion yuan in the same period a year prior. The forecast compared with the 27.6 billion yuan average of 17 analyst estimates compiled by Refinitiv. Baidu shares were down 1.4 percent in after-hours trade. The stock has fallen more than 20 percent since the start of the year, amid a broader sell-off of Chinese technology shares. “In general there will be some challenges, in particular in the internet gaming sector, that will impact ad spending,” said senior analyst Raymond Feng at Pacific Epoch. “[But] advertising momentum for Baidu’s news feed will continue and that creates more time for investors to wait for the next developments on AI and autonomous driving,” he said. Baidu’s investors were shaken earlier this year after Alphabet Inc said it planned to re-launch its Google search engine in China almost seven years after leaving the market in protest over censorship. Asked about Google’s possible entry, Baidu Chief Executive Officer Robin Li on Wednesday said, “I don’t think a non-China-based company has that kind of competence to compete.” Though Baidu’s fourth-quarter forecast is below estimates, its revenue in the third quarter of 28.2 billion yuan beat estimates by 2.4 percent. Li attributed the performance to improvements in its search platform and news feed using AI. Baidu is one of China’s biggest names in AI, and this month became the first Chinese firm to join an AI ethics group alongside members such as Google and Apple Inc. Net income rose 56 percent in July-September, also slightly above estimates, though operating margin fell to 16 percent from 21 percent. Excluding gains from divesting its financial services business, Baidu posted adjusted earnings per share of 19.01 yuan versus the 16.70 yuan analyst estimate. Li said the impact of new regulation and trade fears could extend beyond 2018, but that, in the long term, “I’m still very optimistic about the future of Baidu and the future of China.” Reporting by Cate Cadell in Beijing and Jane Lanhee Lee in San Francisco; Editing by Christopher CushingAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}