{"id": "Thousands of caravan migrants take shelter in southern Mexico", "paragraph": "5 Min ReadTECUN UMAN, Guatemala (Reuters) - Thousands of Central American migrants travelling together to enter the United States have hunkered down in shelters in a southern Mexico city along its border with Guatemala, according to local officials.   The migrants pose a tough challenge to the Mexican government’s pledge to stop the illegal travellers’ plans to press ahead to the U.S. border. More than 5,100 migrants have been registered in three shelters in the Mexican border town of Ciudad Hidalgo, while another 2,000 had camped out for the night in the town’s central square, said Gerardo Hernandez, head of the local government’s emergency services. “It’s really full. You can’t even walk, there’s just so many people,” he said referring to the plaza. “So far, they’re all peaceful, thank God.” In a statement on Saturday night, Mexico’s federal government said “nearly 900 migrants” had arrived by unauthorised means, while 640 had been processed after being allowed to cross into the country via the international border crossing on the Suchite River that divides Guatemala from Mexico. Earlier in the day, the presidents of Honduras and Guatemala said about 2,500 migrants had either already been repatriated to Honduras or were in transit back home, many using free bus tickets doled out by Guatemalan police. Throngs of people continued to wait on the bridge border crossing, where on Saturday morning many pressed for limited opportunities to plead their case to immigration officials, while many others opted to cross the river illegally, either on  jury-rigged rafts or by swimming. The migrant rights group Pueblos Sin Fronteras also counted thousands of mostly Honduran migrants nearby Cuidad Hidalgo, although the figures did not exactly match. Some 2,000 Honduran migrants were already back home after giving up on continuing to Mexico, Guatemala’s President Jimmy Morales said at midday press conference in Guatemala City alongside his Honduran counterpart, President Juan Orlando Hernandez. Hernandez said about 500 migrants were in transit back to Honduras, a roughly 12-hour trip by road. “We are working to provide a peaceful and safe return trip and avoid that these movements keep happening in the future,” said Morales.  The leaders of all three countries have come under intense pressure from U.S. President Donald Trump, who for days has warned that the caravan must be stopped. Trump has made it a political issue in the Nov. 6 mid-term U.S. congressional election, threatened to cut off regional aid, close the U.S.-Mexico border and deploy troops there if Mexico failed to halt the migrants. Hernandez noted that migrants from elsewhere in the region had joined the caravan, along with others from “outside the region,” though he did not cite specific nationalities. He added that planes would be used to fly children back home. The migrants seemed confused over their next moves while it was equally unclear how Mexican authorities would react to so many unauthorised arrivals. “This is not a caravan anymore. This is an exodus,” said Ruben Figuerora of the Mesoamerican Migrant Movement, standing on the muddy bank of the Mexican side of the Suchite river, as a line of young male migrants walked past him after crossing on a raft. Most of the migrants spoken to by Reuters said their ultimate goal was to reach the United States. Some said they hoped to stay in Mexico, but that they had no idea how to get the documents needed to do so. Others decided they needed more time to determine what comes next.  “For now we’ll wait,” said Honduran migrant Alexander Alvarado. Most of the people now caught trying to enter the United States illegally hail from Honduras, El Salvador and Guatemala,  among the poorest and most violent countries in the Americas. The caravan members ranged from farmers and bakers to housewives and students. Osman Melgar, who nursed a bleeding gash on his shin, suffered when he fell as dozens of people packed on the bridge began fleeing Mexican police using tear gas, according to several eyewitnesses. Many, including 40-year-old Adriana Consuelo, paid raftsmen 25 pesos ($1.30) to ferry them across the river on vessels constructed of giant rubber tires with wooden planks tethered across them. After making it across the river to Mexico, Conseulo headed to a taco restaurant to eat saying, “No one checked my documents.”  Reporting by Delphine Schrank; Additional reporting by Sofia Menchu in Guatemala City and David Alire Garcia in Mexico City; Writing by David Alire Garcia; Editing by Tom Brown and Daniel WallisAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}