{"id": "Trump seeks end of Florida recount; Democrats win Arizona U.S. Senate seat", "paragraph": "6 Min ReadTAMPA, Fla./WASHINGTON (Reuters) - U.S. President Donald Trump on Monday urged Florida election officials to end a recount and declare his fellow Republicans the winners of disputed races in last week’s elections, while Democrats picked up a U.S. Senate seat in Arizona. U.S. Representative Kyrsten Sinema declared victory and Republican opponent Martha McSally conceded after multiple media outlets called the closely contested Arizona race for the Democrat. Sinema will succeed Republican Senator Jeff Flake, a frequent Trump critic, who did not seek-election. The results will not affect Republican control of the 100-member Senate. Republicans have won at least 51 seats and Democrats 47 in the elections, with results in Florida and Mississippi still outstanding.  In Florida, leads by the Republican candidates in the races for a U.S. Senate seat and the governor’s office shrank as more ballots were tallied following last Tuesday’s elections. State law mandates recounts in elections where the margin of victory is within 0.5 percentage point. As Florida officials scrambled to review more than 8 million ballots by Thursday, Trump, without providing evidence, cast doubt on the recount process. Trump called for an end to the recount even though state rules allow election officials to wait 10 days for absentee ballots submitted by registered voters living outside the United States, including active-duty military personnel. A machine recount began over the weekend in the race between outgoing Republican Florida Governor Rick Scott and Democratic U.S. Senator Bill Nelson, with another recount under way for the Florida gubernatorial race between Republican Ron DeSantis and Democrat Andrew Gillum. Republicans are eager to cement victories in a key battleground state after maintaining their control of the U.S. Senate in last week’s congressional midterm elections, while Democrats are eyeing another possible state governorship win. Each party accused the other of trying to subvert democracy. Scott on Sunday asked a Broward County judge to issue an emergency injunction calling for law enforcement to seize all voting machines, tallying devices and ballots when they are not being used until the end of the recount and any related litigation. Broward County Circuit Judge Jack Tuter, who on Monday rejected Scott’s request for the emergency injunction, urged both sides to be restrained in their public statements as the state faces a repeat of its dramatic role in the 2000 U.S. presidential vote recount. “I am urging because of the highly public nature of this case to ramp down the rhetoric,” Tuter said. “Wait until these counts are over and there’ll be time to litigate.” Trump repeated his complaints over the Florida races in a Twitter post on Monday.  The president instead called on state authorities to go with the initial vote count totals. Trump alleged voter fraud had taken place, but provided no evidence. “The Florida Election should be called in favour of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!” he wrote.  Studies have found no evidence of large-scale voter fraud in the United States, although courts have found evidence through the nation’s history of policies intended to suppress voting by minorities. “The fact is that there is no evidence of fraud,” said Marc Elias, the lawyer representing Nelson’s campaign in the recount. “Both judges and the state law enforcement officials have said that.” Nelson on Monday called on Scott to recuse himself from playing any role in overseeing the recount. The Florida secretary of state’s office said it had received reports that election officials in Bay County, a Republican-leaning county home to some 183,500 people that was hard hit by Hurricane Michael, allowed some residents to cast ballots by email and fax. State law makes no provision for voting in that way. “Supervisors of elections are independently elected constitutional officers and it is each supervisor’s responsibility to adhere to the law,” state spokeswoman Sarah Revell said in an email. Florida law gives local election officials until the Saturday after an election to submit their first round of unofficial election results. It is common for elections supervisors to process results well after election night. The Florida Department of Law Enforcement, which has said it will review allegations of criminal fraud, has stated that it had no active investigations. Scott has said he won the Senate race even as the ballots are tallied again, telling Fox News on Monday: “I want to make sure there’s a free and fair election. But there’s laws. Comply with the laws.” Georgia’s gubernatorial race also remains undecided. Several U.S House of Representative races are also still too close to call after Democrats seized control of the House in last week’s elections. Reporting by Letitia Stein in Tampa, Florida, and Susan Heavey in Washington; Additional reporting by Makini Brice, Mark Hosenball and Lisa Lambert in Washington and Zachary Fagenson in Miami; Editing by Scott Malone, Alistair Bell and Peter CooneyAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}