{"id": "Brazil's BRF turnaround will take at least 2 years -CEO", "paragraph": "4 Min ReadNEW YORK, Nov 12 (Reuters) - Investors will not see the results of a turnaround in Brazil’s BRF SA, the world’s largest poultry exporter, in the short term, the company’s chief executive officer Pedro Parente told Reuters on Monday. “Realistically, it will not happen in less than two years,” Parente said in an interview in New York, adding that one of his biggest challenges as CEO is to “manage investors’ expectations.” Parente was brought in from his former role as CEO at state-run Petrobras to design and implement a turnaround plan at BRF after food safety and corruption scandals eroded BRF sales. In April Parente was made chairman of the company, before taking on the additional CEO role. He is due to step down as CEO in mid-2019 and be replaced by Chief Operating Officer Lorival Luz. Management has said publicly it expects margins to stop falling next year and reach their historical average, estimated in the low double digits, in 2020. Only by 2021 could margins rise above that level, they have said. In April, BRF shares touched their lowest level since December 2009. They have risen over 10 percent since, but are still down about 45 percent so far in 2018. “I’m not using shortcuts, and I’m not interested in showing good quarters numbers if they are not sustainable,” Parente said. Parente and Luz said they expected to reduce industrial costs by 30 percent in a process forecast to take about a year. The key to recovery will be the Brazilian domestic market, Parente said, which should be the company’s backbone to sustain profitable operations. One important segment is food service, where BRF has been losing market share after former management fired most of its sales staff in a cost-cutting drive. Parente also said BRF was “concerned” about the potential harm to its Middle East exports after president elect Jair Bolsonaro said he planned to move the Brazilian embassy in Israel from Tel Aviv to Jerusalem. BRF and other Brazilian food processors have bet big on halal meat exports to Muslim countries in recent years. “We have seen outspoken reaction by Arab countries, so we hope that to be campaign rhetoric,” Parente said. Parente said BRF’s debt to EBITDA ratio was 6.7 times, with the target of lowering it to 3 times by the end of 2019. After the company reduces its leverage to the desired levels, it will probably go back to expansion, mainly in the Middle East and Asia, Parente added. It is looking to build a producing unit in Saudi Arabia to comply with new local content requirements in the country. In the meantime, BRF has been selling assets in Europe, Thailand and Argentina. Parente and Luz said that was proceeding well, with the European and Thai operations likely to go to a single buyer, since the bulk of production in Thailand is exported to Europe. Five bidders are expected to deliver binding proposals for the assets, they said. In Argentina, BRF is considering proposals in the first phase of the sale from buyers interested in the whole business and others eyeing parts of it, to decide which is the best alternative, Luz said. BRF expects to raise 3 billion reais ($796 million) with the sale of the units, part of the 5 billion reais it wants to raise to repay debt. The remaining 2 billion reais will come from the sale of a fund of receivables, real estate and reduction of inventory. BRF’s ideal inventory should be around 40,000 tonnes in products, but after the European Union blocked imports from 12 of its plants, it reached 140,000 tonnes, Luz said. The company has been reducing the inventory, which is now close to 85,000 tonnes, he added. ($1 = 3.7674 reais) (Reporting by Tatiana Bautzer and Rodrigo Campos, additional reporting by Simon Webb, Editing by Rosalba O’Brien)All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}