{"id": "Camila Cabello comes out on top at MTV Europe Music Awards", "paragraph": "3 Min ReadBILBAO, Spain (Reuters) - Cuban-American singer Camila Cabello was the top winner at the MTV Europe Music awards on Sunday night, with “Best Song,” “Best Artist,” “Best Video” and “Best U.S. Act” in a show that featured a stellar performance from Janet Jackson. Cabello, 21, who already led the pack at the MTV Video Music Awards in August, urged her fans in the United States to vote in the 2018 midterm elections as she walked the red carpet in the northern Spanish city of Bilbao. The singer, who rose to fame as a member of the girl group “Fifth Harmony,” formed on the U.S. edition of the X-Factor,  said she relished being seen as a role model. “I feel like the message for me has always been just like do what makes you happy, even if it’s scary, it’s worth it to take the risk because your happiness is your responsibility,” Cabello said. “That’s always been my message and I talk about it a lot but I feel like it’s a good message. And yes, very important, go vote!” she said.  Jackson, who received a “Global Icon” award, sang hits of her 40-year career over four stages and surrounded by African drummers, flame torches, firebreathers and more than 20 dancers. The show took place at Bilbao’s exhibition center and was hosted by Hailee Steinfeld, who performed “Back to Life,” a song that will feature on the soundtrack of her forthcoming movie Bumblebee. One of the hits of the night was Spanish Flamenco-inspired artist Rosalia singing “Malamente” after rolling on stage in a gigantic truck. Five-time winners of MTV Europe Music Awards, English rock band Muse also made a splash by performing “Pressure” from Bilbao’s world-famous soccer stadium San Mames. Other notable performances included Bebe Rexha singing “I’m a Mess” while in a bathtub surrounded by nurses and 100 dancers and Halsey performing “Without Me” surrounded by rainfall. The show was opened by Nicki Minaj with her new hit “Good Form,” followed by her collaboration with Little Mix “Woman Like Me.” Minaj also received the awards for “Best Look” and “Best Hip-Hop.” American D.J. Marshmello, who won “Best Electronic,” closed out the night alongside Anne-Marie with their hit “FRIENDS” and alongside Bastille with “Happier.” The performance was also among the public as hundreds of Marshmello inflated balls flooded the venue for the finale. Other winners included Dua Lipa, who took the “Best Pop,” Shawn Mendes who won “Best Live” and 5 Seconds of Summer who received “Best Rock.” Additional reporting by the Madrid bureau; Writing by Julien Toyer; Editing by Sonya HepinstallAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}