{"id": "Republican DeSantis secures Florida governor's seat after rival Gillum concedes", "paragraph": "3 Min ReadTAMPA, Fla. (Reuters) - Democrat Andrew Gillum, who had sought to become Florida’s first black governor, conceded on Saturday, after a recount showed he had no way of catching his Republican rival Ron DeSantis, an ally of President Donald Trump.  Gillum, the 39-year-old liberal mayor of Tallahassee, had initially conceded the race on the night of the Nov. 6 election  to DeSantis, a conservative former congressman. But Gillum later withdrew that concession when the results showed the two were close enough to trigger an automatic recount.  “This has been the journey of our lives. We’ve been so honoured by the support that we’ve received,” Gillum said in a video statement. “Stay tuned, there will be more to come. This fight for Florida continues.” DeSantis, 40, said on Saturday on Twitter, “This was a hard-fought campaign. Now it’s time to bring Florida together.”  After a machine recount ended on Thursday, official results showed DeSantis with a lead of 33,683, or 0.41 percent. That margin appeared impossible for Gillum to overcome by Saturday. “We wanted to make sure that every single vote including those that were undervotes, overvotes, as long as it was a legally cast vote we wanted those votes to be counted,” Gillum said in his video statement on Saturday. His stance echoed similar appeals from fellow Democrat U.S. Senator Bill Nelson. Numerous legal challenges were filed in Florida over how to deal with certain ballots and the deadlines for counties to review them. A recount is continuing in the race between Nelson and his challenger for the Senate seat, outgoing Republican Governor Rick Scott. After an electronic recount was completed on Thursday, Scott held a narrow lead. Officials have until noon on Sunday to tally any votes missed by electronic voting machines. That recount has become the subject of an intense political battle with Republicans including Trump claiming without evidence that the process was marred by fraud. Both parties and their supporters filed multiple lawsuits challenging the process, with Republicans urging a strict standard on which votes were counted while Democrats contested rules that they saw as disenfranchising voters. The drama of counties across the state recounting ballots brought back memories of Florida’s 2000 presidential recount. In that election, the winner of the White House hung in the balance for weeks before the U.S. Supreme Court stopped the counting and Republican George W. Bush triumphed over Democrat Al Gore. Reporting by Letitia Stein; Additional reporting by Julia Harte in Washington; Writing by Daniel Wallis, editing by G Crosse and Cynthia OstermanAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}