{"id": "Wall St. rebounds, dollar gains as euro swoons on Draghi", "paragraph": "5 Min ReadNEW YORK (Reuters) - U.S. stocks climbed back on Thursday after a massive sell-off the day previous, with strong earnings encouraging investors to venture into risky bets again, while the dollar gained on the euro. Oil prices were bolstered by the rebound in equities markets and as Saudi Arabia’s energy minister signaled major producers may need to intervene in crude markets to support prices. The euro fell to a two month low after European Central Bank chief Mario Draghi reaffirmed that the bank’s 2.6-trillion euro ($2.97 trillion) asset purchase program will end this year and interest rates could rise after next summer, even though the economic outlook has darkened and political turmoil looms in Italy. While equity investors were reassured by positive earnings from Microsoft Corp (MSFT.O) and strong advertising revenues from Twitter Inc (TWTR.N) they also voiced some caution about whether the broader pullback was over. “You can’t look at it blindly and say earnings are turning the market around and we’re all clear. A lot of people are skeptical of any kind of action in the market right now, especially to the upside. That’s why volume is light today,” said Robert Pavlik, chief investment strategist, senior portfolio manager at SlateStone Wealth LLC in New York. Even the most optimistic investors were cautious. “Quarterly reports are providing better-than-expected earnings, revenue and guidance. That triple play is instilling confidence in investors,” said Peter Kenny, founder of Kenny’s Commentary LLC. But, he added, “We need other drivers to provide stability to the market after this meaningful sell-off we’ve seen in the last five weeks.” Investors are looking for further strong results for the remaining two thirds of S&P 500 companies that are yet to report, as well as a resumption of share buybacks by companies that have already reported.  They are also awaiting third-quarter U.S. GDP data that is due out on Friday. If the reading is lower than expectations investors will worry about economic growth but if it is much higher they will fear a faster pace of U.S. interest rate hikes, Kenny said. The Dow Jones Industrial Average .DJI rose 401.13 points, or 1.63 percent, to 24,984.55, the S&P 500 .SPX gained 49.47 points, or 1.86 percent, to 2,705.57 and the Nasdaq Composite .IXIC added 209.94 points, or 2.95 percent, to 7,318.34. [.N] In the previous day’s session the indexes had plunged, confirming a correction for the Nasdaq as disappointing forecasts from chipmakers and weak home sales data had fueled jitters about economic and profit growth. During its trading day, the pan-European STOXX 600  had darted in and out of positive territory before closing up 0.51 percent, while the MSCI’s gauge of stocks across the globe .MIWD00000PUS gained 0.75 percent. The dollar index .DXY rose 0.17 percent, with the euro EUR= down 0.17 percent to $1.1372. Draghi said he was confident the European Commission and Rome would come to a compromise over Italy’s budget plans, but the euro had reversed earlier gains after he said the monetary union remained fragile. Currency dealers were also unwinding Swiss franc CHF= and Japanese yen JPY= safety trades and Italian and Spanish bonds held their ground. The Japanese yen weakened 0.15 percent versus the greenback at 112.43 per dollar, while Sterling GBP= was last trading at $1.2816, down 0.50 percent on the day. MSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS closed 1.24 percent lower, while Japan’s Nikkei .N225 lost 3.72 percent. U.S. Treasury yields rose from three-week lows as equities gained, though anxiety about ongoing stock volatility continued to give some support to safe-haven U.S. government debt prices. Benchmark 10-year Treasuries US10YT=RR last fell 1/32 in price to yield 3.1262 percent, from 3.124 percent late on Wednesday.  U.S. crude CLcv1 rose 0.25 percent to $66.99 per barrel and Brent LCOcv1 was last at $76.63, up 0.6 percent on the day. Spot gold XAU= dropped 0.1 percent to $1,231.82 an ounce due to the strong dollar and the equities rebound.  Additional reporting by Caroline Valetkevitch in New York, Amy Caren Daniel in Bengaluru, Kate Duiguid in New York, Marc Jones and Christopher Johnson in London and Swati Patel in Sydney; editing by Larry King and Nick ZieminskiAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}