{"id": "Hamilton takes U.S. pole with fifth title in sight", "paragraph": "4 Min ReadAUSTIN, Texas (Reuters) - Lewis Hamilton took a big step toward clinching his fifth Formula One title after putting his Mercedes on pole position at the U.S. Grand Prix on Saturday with Ferrari rival Sebastian Vettel starting fifth. The Briton, who will be only the third driver to win at least five titles if he scores eight points more than Vettel on Sunday, will share the front row with the German’s Finnish team mate Kimi Raikkonen. Vettel qualified second, and just 0.061 slower than Hamilton, but has a three-place grid drop after failing to slow sufficiently while red flags were being waved in Friday practice. The pole was a record-extending 81st for Hamilton, his third in a row in Austin and ninth of the season and he did it with a time of one minute 32.237 seconds — a track record. “That was very important, that was close,” said the Briton as he waved at the throng of fans on an overcast and gusty afternoon at the Circuit of the Americas with rainclouds gathering. “Once we went into that last run, I knew it was quite edgy between us. It was going to require solid laps. The first one was decent but not good enough. The second one was just that little bit better. “The Ferraris are obviously really quick.” Ferrari had looked the faster team in the second phase of qualifying, with Raikkonen top of the timesheets and Vettel second. There was also very little between them in the final shootout, with the top three separated by less than a tenth of a second. “After the weeks we had I’m pretty pleased we are back in range. Today has been surprisingly close, I don’t think we expected it to be that close,” commented Vettel, who vented his frustration over the team radio after crossing the line. Vettel will have his work cut out on Sunday at a racetrack where  Hamilton has won five times in the last six years. The Mercedes driver is also on a roll, with six wins in the last seven rounds. Another win on Sunday would be Hamilton’s fifth in a row, and Vettel — also a four times world champion — would have to finish second to keep the championship alive to Mexico the following weekend. Hamilton’s team mate Valtteri Bottas will share the second row with Red Bull’s Australian Daniel Ricciardo and neither will be easy for Vettel to get past. Ricciardo’s team mate Max Verstappen would also have hoped to be in the mix but the young Dutch driver will start 13th after suffering suspension damage in the first phase of qualifying. “Something broke,” he exclaimed over the radio. Force India’s Esteban Ocon will start sixth, with Renault’s Nico Hulkenberg seventh and Romain Grosjean in eighth place for Haas, Formula One’s only U.S. team. Vettel’s future Ferrari team mate Charles Leclerc will line up ninth for Sauber while Force India’s Mexican Sergio Perez, who has plenty of local support, qualified 10th. Belgian Stoffel Vandoorne qualified last but will move up the grid thanks to engine penalties applied to the Toro Rossos of Pierre Gasly and Brendon Hartley, who will go to the back of the field.  Reporting by Alan Baldwin, editing by Pritha Sarkar/Peter RutherfordAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}