{"id": "Thai junta and Thaksin-backed populists face off before 2019 poll", "paragraph": "5 Min ReadBANGKOK (Reuters) - Battle lines are being drawn between Thailand’s military government and the populist movement led by ex-premier Thaksin Shinawatra as both sides attempt to outmaneuver the other before a general election due in 2019. The junta has promised to hold the much-delayed election as early as February, a test of its promise to restore democracy amid widely held concerns that it aims to maintain a grip on power in Southeast Asia’s second-biggest economy.   The race is again expected to pit Thaksin’s “red shirt” followers against the military and royalist establishment, which seized power in successive coups in 2006 and 2014. Thaksin’s camp, which has won every election since 2001, has been unable to assert control over non-elected bodies, particularly the judiciary and the military, prompting bouts of street protests and coups. In a move widely seen as an attempt to cripple support for Thaksin and his allies, the junta last month ordered the Election Commission to investigate whether he is still controlling the popular Puea Thai Party from exile abroad, and possibly disband it. “They are afraid of us,” Puea Thai veteran Watana Muangsook told Reuters, referring to the junta’s efforts to undermine the influence of his party and allies. “The only way they can beat us is that they have to play beyond the rules. If they follow the rules they will lose.” The Shinawatra clan faces pressure elsewhere, too. Thaksin’s son, 38-year-old Panthongtae Shinawatra, was indicted last month for an alleged money-laundering offense dating back to 2004. He pleaded not guilty. Yingluck Shinawatra, Thaksin’s sister and prime minister for nearly three years, fled Thailand last year to avoid conviction in a criminal negligence case she says was politically motivated. The junta has sought her extradition from Britain. Eight core members of Puea Thai are also facing legal action for allegedly breaching a junta ban on political gatherings of more than five people. Authorities have confiscated and banned the distribution of thousands of calendars featuring a picture of Thaksin and Yingluck, which were being handed out in several places in northeastern Thailand this month.  Thaksin said in a rare interview with NHK TV recently “pro-democracy camps” could win some 300 of the lower house of parliament’s 500 seats in the coming election. That comment prompted the military government to order an official probe into his links with the party.     Puea Thai members deny Thaksin’s involvement in the running of the party and say they have been “following the law”.        As Puea Thai faces the threat of dissolution, at least three back-up parties have been launched - Puea Tham Party, Puea Chart Party, and Thai Raksa Chart Party - all of which have executives who are former members and allies of Puea Thai. The junta has denied targeting Thaksin and his allies, saying government agencies have been proceeding legally. “I don’t see the singling-out of Thaksin and the Shinawatra family,” said government spokesman Puttipong Punnakan. Pro-Thaksin parties say they are further disadvantaged by the new constitution, written by an army-appointed committee, which critics say is designed to prolong the military’s influence over politics for years through unelected bodies and other mechanisms. Thaksin and his allies, who champion populist policies such as a subsidized rice scheme and basic healthcare, remain immensely popular especially in the rural north and northeastern provinces. Experts say it is this enduring support that could prove a huge challenge for the junta at the polls.   “The problem for the authorities who want to dissolve Puea Thai is not the party banner but its durable support bases,” said Thitinan Pongsudhirak, director of the Institute of Security and International Studies at Chulalongkorn University. “If the party is dissolved, its support bases will likely just shift to proxy parties,” Thitinan said, adding that legal moves against the Thaksin camp could even embolden voters if they see them as unfair political persecution. The Puea Thai Party remains optimistic of the party’s chances in next year’s elections despite the pressure it faces. “If this was a 100-metre race, (the military) started at 80 meters while we started at zero,” Watana said. “But if the people rejected the military and dictatorship ... perhaps a landslide victory is still possible.” Writing by Kanupriya Kapoor; Editing by John ChalmersAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}