{"id": "Rich Asians crazy about securing wealth spark family office boom in HK, Singapore", "paragraph": "6 Min Read (This November 4th story corrects job title in paragraph 15) By Sumeet Chatterjee HONG KONG (Reuters) - Rich Chinese and other Asians are increasingly seeking more control of their wealth, driving a rapid rise in the number of so-called family offices, or private investment vehicles, being set up in Hong Kong and Singapore.  As the wealthy target greater investment diversification and as business owners hand over the reins to successors, family offices are sprouting in the Asian financial hubs, taking advantage of incentives such as tax breaks and residency being offered. The family office is a relatively new concept in Asia, with less than 500 such entities, compared to thousands in the West. There is no precise number available, given the private ownership structure and secrecy around these businesses.     They offer a one-stop solution to managing the wealth of the rich, including investments, charitable giving, taxation and wealth transfer. Staffed by bankers, fund managers, lawyers and tax practitioners, some even provide overseas private schooling and travel arrangements as add-on services. The rich are favoring family offices as they get personalized attention and are able to have a bigger say in their wealth management. “This year the activity for setting up family offices is definitely more,” said Lee Wong, Swiss private bank Lombard Odier Asia’s head of family services. “The growth of family offices in Asia should continue on its current trajectory.” Asia Pacific had 814 billionaires at end-2017, accounting for 38 percent of the global billionaire population, with China minting two new billionaires every week, a report by UBS and PwC said last month. That momentum was aided by the boom in Hong Kong for initial public offerings which saw a record $27.7 billion raised in the first nine months of 2017 mostly by Chinese tech firms, turning many founders into millionaires and billionaires. Six private bankers on average estimated the number of new family offices in Asia had risen 15 percent in the first three quarters of this year over the year-ago period. This could pick up pace with a worldwide wealth transition of $3.4 trillion expected over the next two decades, as per the UBS/PwC report.      Asian family offices are evolving from being just investment focused to offering a platform for dispute resolution and succession planning, as the new generation in the family-owned businesses expand into newer areas, bankers said. Buoyed by the growth prospects, private bank units of global firms including Citigroup, Credit Suisse, HSBC, and UBS are looking to expand family office services, headhunters and bankers said. Stephen Campbell, chairman of the global family office group at Citi Private Bank, which serves over 1,500 family offices globally, said the bank had seen “dramatic growth” in the number of its clients, including in Asia. Citi plans to make a new Hong Kong-based hire in its Asia Pacific family offices team, he said. Credit Suisse’s Asia Pacific head of wealth planning Bernard Fung said due to the surging demand from North Asia for family offices the bank would set up a team for this service in Hong Kong by the first quarter of 2019, adding to its Singapore hub. “Offshore Chinese wealth will continue to grow, so family offices business is going to be a multi-year trend,” said Ivan Wong, co-head for North Asia at HSBC Private Banking. HSBC Asia private bank will add 700 people by 2022, and some of those new hires will focus on family office clients, he said. UBS declined to comment. Some of the regional financial firms are also looking to grab a bigger share of the business.  Bank of Singapore plans to hire six more bankers for a team set up in May to provide support to independent asset managers, including family offices in Hong Kong, said Derrick Tan, its global market head of Greater China and North Asia. The increased activity is also being helped by tax exemptions and other incentives offered by Hong Kong and Singapore. The number of family offices in Singapore quadrupled between 2015 and 2017, the Monetary Authority of Singapore said in response to a Reuters query, adding those funds can avail of “fund tax exemption schemes” if they satisfy the conditions.  The city-state was depicted as a playground for the super-rich in the Hollywood hit film “Crazy Rich Asians”. Singapore Economic Development Board’s assistant managing director Kelvin Wong said European families were also keen to access growth opportunities in Asia by establishing satellite family offices in the region. Hong Kong plans to introduce a new structure that will offer “more flexibility and choices” in setting up funds, including those managed by family offices, said a spokesman for the Financial Services and the Treasury Bureau.  “The regulators have been very welcoming to family offices setting up here because that creates spinoffs for the economy as well,” said Dawn Quek, a tax principal at Baker McKenzie Wong & Leow in Singapore. Reporting by Sumeet Chatterjee; Additional reporting by Anne Marie Roantree in Hong Kong and Anshuman Daga in Singapore; Editing by Muralikumar AnantharamanAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}