{"id": "Russia pledges 'balance' if U.S. quits nuclear pact; Trump eyes more weapons", "paragraph": "6 Min ReadMOSCOW/WASHINGTON (Reuters) - Russia said on Monday it would be forced to respond in kind to restore the military balance with the United States if President Donald Trump carried through on a threat to quit a nuclear arms treaty and began developing new missiles. But Moscow signalled it may be willing to give some ground, with a senior official telling Trump’s national security adviser, John Bolton, that Russia was ready to address U.S. concerns about how the 1987 Intermediate-Range Nuclear Forces Treaty was being implemented. In Washington, the U.S. president reiterated his concern about the treaty and said the United States would build up its nuclear arsenal. “Russia has not adhered to the agreement. ... Until people come to their senses - we have more money than anybody else, by far. We’ll build it up,” he told reporters at the White House. “Until they come to their senses. When they do, then we’ll all be smart and we’ll all stop.” Asked if that were a threat to Russian President Vladimir Putin, Trump said: “It’s a threat to whoever you want. And it includes China, and it includes Russia, and it includes anybody else that wants to play that game. You can’t do that. You can’t play that game on me.” Trump said China, too, should be included in the accord.  The U.S. president drew a warning of “military-technical” retaliation from Moscow after saying on Saturday that Washington would withdraw from the Cold War-era pact that rid Europe of land-based nuclear missiles. Signed by then-President Ronald Reagan and reformist Soviet leader Mikhail Gorbachev, the treaty required the elimination of all short- and intermediate-range land-based nuclear and conventional missiles held by both countries in Europe. Its demise could raise the prospect of a new arms race, and Gorbachev, now 87, has warned that unravelling it could have catastrophic consequences.  Kremlin spokesman Dmitry Peskov called Trump’s withdrawal plan a matter of deep concern for Moscow. “Such measures can make the world more dangerous,” he told reporters on a conference call.  Despite repeated Russian denials, U.S. authorities believe Moscow is developing and has deployed a ground-launched system in breach of the treaty that could allow it to launch a nuclear strike on Europe at short notice. Trump said the United States would develop equivalent weapons unless Russia and China agreed to a halt in development. China is not a party to the treaty. Peskov said Putin had repeatedly warned that the demise of the treaty would compel Moscow to take specific military steps. “Scrapping the provisions of the INF treaty forces Russia to take measures for its own security because what does scrapping the INF treaty mean?” said Peskov.  “It means that the United States is not disguising, but is openly starting to develop these systems in the future, and if these systems are being developed, then actions are necessary from other countries, in this case Russia, to restore balance in this sphere.” Bolton had talks in Moscow with Nikolai Patrushev, the secretary of Russia’s Security Council, and Foreign Minister Sergei Lavrov. In comments released after his meetings, Bolton denied Russian allegations the United States was using the threat of treaty withdrawal to blackmail Russia.  Washington had not yet taken any decision on deploying missiles in Europe targeting Moscow in the event that the INF treaty is scrapped, Russia’s RIA news agency quoted him as saying. Bolton said Russia was violating its commitments under the pact, an allegation Moscow has denied.  In any case, he added, a bilateral treaty no longer met today’s realities because unlike in the Cold War, multiple states are now developing intermediate-range nuclear missiles. Those states, he said, include China and North Korea. “The next step is consultations with our friends in Europe and Asia,” Bolton was quoted as telling Ekho Moskvy radio station, adding that consultations with Russia would continue. The INF treaty required the United States and the Soviet Union to forgo all nuclear ground-launched ballistic and cruise missiles with a range of 500 to 5,500 km (310 to 3,415 miles), eliminating an entire category of weapon. As a result, the Soviet Union scrapped hundreds of SS-20 missiles armed with nuclear warheads. Many of them had been pointed at Europe. NATO’s decision to station Cruise and Pershing nuclear missiles in Europe provoked waves of protests in the 1980s from  campaigners who felt that would turn Europe into a potential nuclear battlefield. The European Union called the INF treaty “a pillar of European security architecture” that had resulted in the destruction of almost 3,000 nuclear and conventional warheads and continued to play an important non-proliferation role.  “The United States and the Russian Federation need to remain engaged in constructive dialogue to preserve the INF Treaty,” Maja Kocijancic, the EU’s spokeswoman for foreign affairs and security policy, said. “The world doesn’t need a new arms race.” French President Emmanuel Macron spoke to Trump on Sunday to stress the importance of the treaty, his office said on Monday. The German government regretted Trump’s decision, saying NATO would now have to discuss the development. China also condemned Trump’s move, saying it was wrong to  pull out of the treaty unilaterally. Reporting by Andrew Osborn and Maxim Rodionov in Moscow and Jeff Mason in Washington; Additional reporting by Vladimir Soldatkin and Tom Balmforth in Moscow, Joseph Nasr in Berlin, Sudip Kar-Gupta and Michael Martina in Beijing; Writing by Christian Lowe; Editing by David Stamp and Peter CooneyAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}