{"id": "Samsung slashes capex, calls end to chip boom after record third quarter", "paragraph": "5 Min ReadSEOUL (Reuters) - Samsung Electronics Co Ltd slashed 2018 capex by more than a quarter on Wednesday and warned of lower profit until early next year, calling an end to a two-year boom in memory chips that fueled record third-quarter profit. Graphic: Samsung Electronics' earnings IMG - tmsnrt.rs/23JLkmD The downbeat forecast by the world’s biggest maker of memory chips and smartphones adds to investor jitters over waning global demand for mobile and other electronics devices that roiled world stock markets this month. Graphic: Samsung Electronics' operating profit growth interactive - tmsnrt.rs/2OW0c5E The South Korean technology giant said it expected a quarter-on-quarter earnings decline in the fourth quarter due to weak demand for memory chips and higher smartphone marketing spend during the year-end holiday season. “Looking further ahead to 2019, earnings are forecast to be weak for the first quarter due to seasonality, but then strengthen as business conditions, particularly in the memory market, improve,” Samsung said in a statement. Analysts said the capex cut should ease concerns over further supply growth and price declines, as prices of some memory chips have already fallen to over two-year lows and rivals are set to start new production lines next year. Samsung, one of the industry’s biggest buyers of chip-manufacturing tools, said its capital spending this year would drop by 27 percent to 31.8 trillion won ($28 billion) from a record 43.4 trillion won last year. “NAND (flash memory) chip prices will further decline through the first half of next year ... (as) Toshiba’s  new production line will start and Hynix starts mass production of one of its NAND lines,” said Song Myung-sup, an analyst at HI Investment & Securities. “Oversupply is expected to continue.” Samsung, however, sought to assuage investor concerns of a steep downturn in the chip market, citing solid demand from servers as cloud-based data services grow fast. A Samsung executive said the company believed it was at the “start of a virtuous up-cycle” in chip sales to the server industry. “Temporary price changes can repeat but fundamentally we have a very strong demand base for memory,” Chun Sewon, senior vice president of Samsung’s memory marketing, told analysts. Samsung also said it was considering converting some of its NAND production lines to make DRAM chips next year, rather than add capacity amid a glut of NAND flash chips.  Samsung reported a record 17.6 trillion won operating profit in the July-September quarter, in line with the company’s estimate. With chip prices weakening after years of stellar growth, analysts expect Samsung’s fourth-quarter profit will decline by 4 percent from the third quarter’s record, according to Refinitiv data. That will be still up 11 percent from a year ago, helped by efficiency improvements and cost-cutting in the chip business, which accounts for nearly four-fifths of Samsung’s operating profit. “Since Samsung continues to reduce the costs of (semiconductors), it is not very likely to witness a so-called hard-landing situation,” said Avril Wu, senior research director at DRAMeXchange. Higher server demand would help the memory chip market regain stability after the first quarter of next year, Samsung said, chiming with the outlook given by South Korean peer SK Hynix last week. Samsung’s semiconductor business booked a 37 percent rise in operating profit to 13.7 trillion won, while the mobile business posted a 33 percent fall to 2.2 trillion won. Squeezed by competition with Apple Inc in the premium segment and with Chinese rivals in other segments, Samsung’s smartphone business saw profit fall to the lowest level since the first quarter of 2017. It plans to share details of its development of foldable smartphones at a conference early next month, hoping the model will help revive its premium cache. Samsung said third-quarter revenue rose 5.5 percent to 65.5 trillion won, slightly ahead of its guidance.  Shares in Samsung, which has $265 billion in market value, fell 1.2 percent. The stock has fallen 16 percent so far this year.     Reporting by Heekyong Yang and Ju-min Park; Writing by Miyoung Kim; Editing by Stephen CoatesAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}