{"id": "Factbox - What to watch out for in Poland's local elections", "paragraph": "2 Min ReadWARSAW (Reuters) - Voters in Poland will cast ballots on Sunday in a local election likely to earn the ruling nationalist Law and Justice (PiS) party more influence over regional affairs. Below are some facts about the election and its significance. - Voting for regional assemblies, mayors and councils starts at 7 a.m. local time (0500 GMT) and closes at 9 p.m. (1900 GMT). Exit polls are expected out shortly after voting ends. A second round of the election will be held on Nov. 4 in towns where no candidate wins more than 50 percent of votes. - Provincial assemblies There are 16 regional assemblies, with 30-50 members each. The assemblies draw up the region’s budget, decide on large investment projects and oversee the disbursement of EU aid. In the last local election in 2014, PiS won some 26.9 percent of assembly votes, compared with 26.3 percent for the Civic Platform, now the main centrist opposition party that was in government at the time. Because of local party coalitions, PiS currently controls only one regional assembly, in southeastern Poland, despite winning the race in five of them in 2014. One opinion poll, by IBRIS pollster and conducted for the Fakt newspaper, showed in September that PiS could win 31.9 percent of assembly votes, giving it a shot at controlling three out of 16 assemblies. Provincial assemblies decide how EU structural aid is divided up and approve large infrastructure projects. They oversee some 31 billion euros worth of EU aid. - City hall chiefs and councils Roughly 2,500 city and town mayors are elected, including the mayor of Warsaw. Out of more than a 100 city mayors, ten belong to the ruling Law and Justice (PiS) party. Mayors oversee roads, utilities, local transport, public housing an local investment, as well as education and culture. Reporting by Justyna Pawlak; Editing by Ros RussellAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}