{"id": "Short interval between pregnancies linked to increased risks for mom, baby", "paragraph": "5 Min Read(Reuters Health) - Women who wait just a short time to become pregnant after delivering a child may put themselves and their next baby at greater risk for adverse events, a new study suggests.  “We found for women of all ages, pregnancy within 12 months after a live birth come with risks,” said study leader Laura Schummers, currently a postdoctoral fellow at the University of British Columbia. The study was part of Schummers’ dissertation at the Harvard School of Public Health.  When Schummers and her colleagues started the study, they thought they might find lower risks in the older women. That’s because most of these short interval pregnancies in older women are by choice: the women are at an age where their fertility is waning and they want a chance to have more than one child, Schummers said.  “Women who are 35 and older do quite often plan to have closely spaced pregnancies,” Schummers said. “Among younger women, the pregnancy is less often planned if it’s closely spaced. If someone has a baby and six months later they discover they are pregnant, perhaps that’s not intended. We thought because older women more often plan to have their pregnancies closer together they might not have the increased risks that are due to unintended pregnancies.” As it turned out, there were fewer complications among the babies carried by older women, compared to younger women. But there was still a slight increased risk when the spacing between pregnancies was short, the authors reported in JAMA Internal Medicine. But contrary to what the researchers had expected, short intervals between pregnancies - six versus 18 months - were linked with higher risks for death and serious complications (such as transfusions of three or more units of blood, being put on a ventilator, being transferred to an intensive care unit, or organ failure) for older women, but not younger women. To look more closely at the impact of interpregnancy intervals, Schummers and her colleagues turned to the British Columbia Perinatal Data Registry, a database which contains a summary of information gleaned from obstetrical and newborn medical records. In the end, the researchers were able to take a closer look at 148,544 pregnancies that occurred over a 10-year period. While the study is interesting, it’s not clear how well it would apply to U.S. patients, said. Dr. Tarun Jain, an associate professor of obstetrics and gynecology at Northwestern University’s Feinberg School of Medicine and a fertility specialist at Northwestern Medicine. “I think it’s important to be aware that these findings might not be generalizable,” he said.  “Another important point,” Jain said, is that while shorter interval between pregnancies was associated with higher risks for older women, “the risk was still relatively low.”  Jain, who was not affiliated with the new research, added, “You have to balance that against the fact that as you get older the probability of getting and staying pregnant decreases. If you wait too long it may be hard to get pregnant at all.” Dr. Leena Nathan often finds herself discussing that balance with her older patients.  “Many of my patients are older than 35 when they have their first child,” said Nathan, an assistant clinical professor in the department of obstetrics and gynecology at the University of California, Los Angeles, and medical director of UCLA Community OBGYN Practices. “And many of them do have short interval spacing between pregnancies because they are worried about their fertility. It is certainly a discussion during the postpartum visit after the first delivery.” Nathan doesn’t expect the 40-somethings to put too much time between pregnancies. “In my moms who are older than 40, I counsel them about fertility rates and genetic mutations as they continue to age,” said Nathan, who was not involved with the new research, said in an email. “These patients generally are very motivated and will take good care of themselves in order to have a healthy subsequent pregnancy even if it is less than an 18-month interval. I don’t discourage a shorter interval pregnancy in these patients.” SOURCE: bit.ly/2yJj11Y and bit.ly/2yGgMfS JAMA Internal Medicine, online October 29, 2018.All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}