{"id": "Trump, Europeans call Saudi account of Khashoggi death inadequate", "paragraph": "7 Min ReadELKO, Nev./ISTANBUL (Reuters) - U.S. President Donald Trump joined European leaders on Saturday in pushing Saudi Arabia for more answers about Jamal Khashoggi after Riyadh changed its story and acknowledged that the journalist died more than two weeks ago at its consulate in Istanbul.  Saudi Arabia said early on Saturday that Khashoggi, a critic of the country’s de facto ruler Crown Prince Mohammed bin Salman, had died in a fight inside the building. Germany called that explanation “inadequate” and questioned whether countries should sell arms to Saudi Arabia, while France and the European Union urged an in-depth investigation to find out what happened to the Washington Post columnist after he entered the consulate on Oct. 2 for documents for his marriage. Turkish officials suspect Khashoggi, a Saudi national and U.S. resident, was killed inside the consulate by a team of Saudi agents and his body cut up. The Khashoggi case has caused international outrage and frayed political and business ties between Western powers and U.S. ally Saudi Arabia, the world’s No.1 oil exporter. Asked during a trip to Nevada if he was satisfied that Saudi officials had been fired over Khashoggi’s death, Trump said: “No, I am not satisfied until we find the answer. But it was a big first step, it was a good first step. But I want to get to the answer.” In an interview with the Washington Post, Trump said that “obviously there’s been deception, and there’s been lies.”  Trump’s comments about the Khashoggi incident in recent days have ranged from threatening Saudi Arabia with “very severe” consequences and warning of economic sanctions, to more conciliatory remarks in which he has played up the country’s role as a U.S. ally against Iran and Islamist militants, as well as a major purchaser of U.S. arms.  He had earlier called the Saudi narrative of what happened to Khashoggi credible.          Riyadh provided no evidence on Saturday to support its account and made no mention of what had become of Khashoggi’s body.          As Saudi Arabia faced intensifying international scepticism over its story, a senior Saudi official laid out a new version of the death in which a team of 15 Saudi nationals sent to confront Khashoggi had threatened him with being drugged and kidnapped and then killed him in a chokehold when he resisted. A member of the team then dressed in Khashoggi’s clothes to make it appear as if he had left the consulate. French Foreign Minister Jean-Yves Le Drian called for a full investigation into the killing and German Chancellor Angela Merkel, in a joint statement with her foreign minister, said the Saudi account was not enough. “We expect transparency from Saudi Arabia about the circumstances of his death ... The information available about events in the Istanbul consulate is inadequate,” the Germans said.  German Foreign Minister Heiko Maas called into question the sale of arms to Saudi Arabia.  Canada’s Foreign Minister Chrystia Freeland said Riyadh’s explanations lacked consistency and credibility.  Trump said it was possible that Prince Mohammed had been unaware of the circumstances around the death of Khashoggi, 59.  For Western allies, a main question will be whether they believe that the prince, who has painted himself as a reformer, has any culpability. King Salman, 82, had handed the day-to-day running of Saudi Arabia to him. Trump, who has forged close ties with Saudi Arabia and the crown prince, said he was concerned that it was unclear where the journalist’s body is.     According to the senior Saudi official, the Saudi team rolled up Khashoggi’s body in a rug, took it out in a consular vehicle and handed it to a “local cooperator” for disposal. One of the operatives then donned Khashoggi’s clothes, eyeglasses and Apple watch and left through the back door of the consulate in an attempt to make it look like Khashoggi had walked out of the building, the senior Saudi official said. Turkish investigators are likely to find out what happened to the corpse “before long”, a senior Turkish official said earlier on Saturday. Officials told Reuters in Turkey on Thursday that Khashoggi’s remains may have been dumped in Belgrad Forest adjacent to Istanbul, and at a rural location near the city of Yalova, 90 km (55 miles) south of Istanbul,      Turkish sources say the authorities have an audio recording purportedly documenting Khashoggi’s murder inside the consulate. Pro-government Turkish newspaper Yeni Safak, citing the audio, said his torturers cut off his fingers during an interrogation and later beheaded him. Trump said no one from his administration has seen video or a transcript of what happened inside the consulate. Khashoggi’s Turkish fiancée, Hatice Cengiz, tweeted in Arabic: “They have taken your body from this world, but your beautiful smile will stay in my world forever.”             Saudi Arabia had previously denied that Khashoggi died in the consulate.  But the Saudi public prosecutor said on Saturday that a fight broke out between Khashoggi and people who met him in the building, leading to his death. Eighteen Saudi nationals had been arrested, the prosecutor said. Saudi state media said King Salman had ordered the dismissal of five officials, including Saud al-Qahtani, a royal court adviser seen as the right-hand man to Prince Mohammed, and deputy intelligence chief Ahmed Asiri. The crisis prompted the king to intervene, five sources with links to the Saudi royal family told Reuters. The king also ordered a restructuring of the intelligence service, to be led by Prince Mohammed, suggesting the prince still retained wide-ranging authority. The dismissed official Qahtani, 40, rose to prominence after latching onto Prince Mohammed, becoming a rare confidant in his inner circle. Sources say Qahtani would regularly speak on behalf of the crown prince and has given direct orders to senior officials including in the security apparatus. The New York Times reported on Saturday, citing U.S. and Saudi officials, that Qahtani created the strategy behind the deployment an online army to harass Khashoggi and other critics of the kingdom on Twitter. People close to Khashoggi and the government said Qahtani had tried to lure the journalist back to Saudi Arabia after he moved to Washington a year ago fearing reprisals for his views. Asiri joined the Saudi military in 2002, according to Saudi media reports, serving as spokesman for a coalition backing Yemen’s ousted president after Prince Mohammed took Saudi Arabia into that country’s civil war in 2015. He was named deputy chief of foreign intelligence in 2017.     Reporting by Jeff Mason and David Dolan; Additional reporting by Tuvan Gumrukcu in Ankara, Stephen Kalin in Istanbul, Yara Bayoumi and Yeganeh Torbati in Washington, Marwa Rashad and Hadeel Al Sayegh in Dubai, Nadine Awadalla and Yousef Saba in Cairo and Thomas Escritt in Berlin; Writing by Chris Sanders; Editing by Daniel Wallis and Alistair BellAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}