{"id": "Iraq PM sworn with partial cabinet as lawmakers disagree", "paragraph": "3 Min ReadSULAIMANIYA, Iraq/BAGHDAD (Reuters) - Iraq’s new Prime Minister Adel Abdul Mahdi was sworn in on Wednesday with only a partial Cabinet after lawmakers failed to reach a consensus on key postings including interior and defense. A rowdy parliament session to approve Abdul Mahdi’s government list created more uncertainty for Iraq, months after an inconclusive election, with parties and blocs wrangling over appointments. The new premier faces the daunting task of rebuilding much of the country after a devastating war against Islamic State, as well as solving acute economic problems and power and water shortages. Eight ministries have yet to be decided, ahead of a Nov. 2 deadline. Among the 14 ministers who were sworn in, Thamer Ghadhban became Oil Minister and veteran Kurdish politician Fuad Hussein Finance Minister. Ghadhban replaced Jabar al-Luaibi, who was recently made head of the new National Oil Company. Ghadhban helped resuscitate a flagging oil industry after the U.S.-led invasion of Iraq that toppled Saddam Hussein in 2003. He was interim oil minister from 2004-5 and a former energy advisor to outgoing premier Haider al-Abadi. Abdul Mahdi was initially expected to nominate a full 22-member cabinet, including the defense and interior ministers.  But lawmakers from Moqtada al-Sadr’s bloc Saeroon, Abadi’s Nasr Alliance, Vice President Ayad Allawi’s Wataniya, and Sunni Muslim blocs left the room before voting on the remaining eight posts could take place. “We decided to withdraw from the session, because we are not satisfied with the rest of the cabinet candidates,” said Nasr lawmaker Ali Sined. “It’s enough to approve 14 ministers.” Parliament will reconvene on Nov. 6 to vote on the remaining ministers, Speaker Mohammed al-Halbousi said.  The unruly parliamentary session underscored the difficulties faced by Abdul Mahdi as he seeks consensus over his cabinet.  A May general election saw Saeroon come first after campaigning on an anti-corruption platform. After uncertainty over the results, lawmakers eventually voted in President Barham Salih, the first time in modern Iraqi politics they picked a president, premier or parliament speaker without a backroom deal. On Wednesday, however, some lawmakers accused proposed ministers of being former Saddam stalwarts, or corrupt. The U.S. invasion of Iraq in 2003 and subsequent sacking of all of Saddam’s Baath party officials stoked sectarian tensions, which then exploded into civil war. Under a de facto power sharing agreement, Iraq’s presidency is now traditionally held by a Kurd, the premiership by a Shi’ite and the parliament speaker is a Sunni. Earlier in the day, a Sunni Arab parliamentary bloc pulled out of talks on forming the government. Reporting by Ahmed Rasheed in Sulaimaniya and Ahmed Aboulenein in Baghdad; writing by Raya Jalabi; editing by John Davison, James Dalgleish and Rosalba O'BrienAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}