{"id": "Zverev will not play in revamped Davis Cup finals", "paragraph": "3 Min ReadLONDON (Reuters) - Germany’s Alex Zverev says he will not take part in a revamped Davis Cup finals showpiece event in Spain next November. Changes to the 118-year-old team event will see the competition turned into a week-long competition taking place in November, with 18 nations battling for the title. The first two editions will take place in Madrid’s La Caja Magica, the current venue for the Madrid Open. Men’s Tour the ATP have also announced the start of a rival World Team Cup to begin in Australia in January 2020 with the likes of world number one Novak Djokovic and 20-time Grand Slam champion Roger Federer likely to prioritize it. The 21-year-old Zverev, regarded as one of the players to lead men’s tennis into a new era, said he would still be available for the Davis Cup qualifying round in February but said he would not play in the November finals week, suggesting the date was a bad choice for most players. Germany host Hungary in February in Frankfurt and must win to qualify for the Madrid finals. “I’m not going to play Davis Cup in November,” world number five Zverev told reporters after his win over Marin Cilic at the ATP Finals on Monday. “I am going to play in February in Germany, in Frankfurt, I’m going to do that. “The Davis Cup has some serious issues to think about. One of them is the dates. I think the date is very important and I think none of the top players will play, except Rafa (Nadal) because it’s in Spain. “I’m very, very sure that a lot of top players will not play. We’ll see how it goes.” American John Isner, beaten by Novak Djokovic on his ATP Finals debut, said he supported the idea of revamping the Davis Cup but said organizers needed to think again about staging the finals at the end of a grueling season. “The format’s unique. I, for one, don’t like the date. I think that’s the big beef with players now,” the 33-year-old told reporters. “Let’s say the top 20 players that end their season in Paris (Masters at the end of October or early November), and then go home, usually that’s the end of the season. And to try to gear up for Davis Cup after this event, it would be pretty tough, mentally and physically. The date’s not ideal.” Zverev was more positive about the ATP’s World Team Cup. “Hopefully, it’s going to be a good event,” he said. “Obviously, it’s in the first week of the year, so it makes sense to play, and it’s in Australia as well. “So it’s not bad schedule-wise.” The International Tennis Federation (ITF) announced in August that its proposals to breathe new life into the Davis Cup had been backed by the majority of national federations. Investment group Kosmos, led by Spanish international footballer Gerard Pique, has signed a 25-year partnering deal with the ITF to revamp the Davis Cup with a total investment of $3 billion being plowed into tennis. Reporting by Martyn Herman; Editing by Ken Ferris and Pritha SarkarAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}