{"id": "U.S. stocks edge higher ahead of midterms, Fed; dollar falls", "paragraph": "4 Min ReadNEW YORK (Reuters) - Energy and financial stocks pushed U.S. equities higher on Monday, on the eve of U.S. midterm elections to determine whether President Donald Trump’s Republican Party retains control of the U.S. Congress and ahead of a meeting of Federal Reserve policy makers. Choppy trading in oil left prices mixed after five days of heavy losses as the United States imposed a range of sanctions aimed at curbing oil exports by Iran. The Trump administration’s decision to re-impose sanctions on Iran’s exports lifted oil prices for much of the day, boosting many U.S. shares. But the Nasdaq index fell, pressured by slumping shares of Apple and Amazon. Nikkei reported Apple has told two smartphone assemblers to halt plans for additional production lines dedicated to the lower-cost iPhone XR. Investors were also cautious ahead of the U.S. midterm elections. Opinion polls show the Democratic Party could win control of the House of Representatives after two years of wielding no practical political power in Washington, with Republicans likely to hold the Senate. “What’s spooking the market is not Congress or Senate,” said Gregory Perdon, co-chief investment officer at Arbuthnot Latham, “what’s spooking the market is the volatility of Trump,” which might not be tempered by any change in Congress. The Dow Jones Industrial Average .DJI rose 190.87 points, or 0.76 percent, to 25,461.7, the S&P 500 .SPX gained 15.25 points, or 0.56 percent, to 2,738.31 and the Nasdaq Composite .IXIC dropped 28.14 points, or 0.38 percent, to 7,328.85. The pan-European STOXX 600 index lost 0.16 percent and MSCI’s gauge of stocks across the globe gained 0.10 percent. Emerging market stocks rose 2.60 percent.  Oil prices fell, despite Washington’s temporary exemption to eight countries allowing them to keep buying Iranian oil amid sanctions. Brent crude futures settled at $73.17 per barrel, up 34 cents or 0.47 percent. U.S. crude oil futures settled at $63.10 per barrel, down 4 cents or 0.06 percent. U.S. Treasury yields were lower as investors covered short positions ahead of midterm elections and braced for $83 billion worth of government debt supply tied to the November refunding this week. With the Federal Reserve meeting on Wednesday and Thursday, investors were also concerned about prospects for tighter U.S. monetary policy after strong economic data. Benchmark 10-year notes last rose 3/32 in price to yield 3.2027 percent, from 3.214 percent late on Friday. The 30-year bond last rose 11/32 in price to yield 3.4353 percent, from 3.454 percent late on Friday. Sterling touched a two-week high against the U.S. dollar then pared gains to trade at $1.3048, up 0.60 percent. The British currency got a boost from a Sunday Times report that an all-UK customs deal will be written into an agreement governing Britain’s withdrawal from the European Union. The U.S. dollar softened against a basket of major currencies as investors, cautious ahead of the elections, took profits after three straight weeks of gains. The dollar index fell 0.24 percent, with the euro up 0.25 percent to $1.1414. Analysts cited pre-election caution after the greenback has rallied more than 7.0 percent from April lows. “Much of Trump’s pro-growth, pro-markets agenda has arguably been enacted in the first two years of his presidency while he’s had the backing of both the House and Senate,” said Craig Erlam, senior market analyst at Oanda. Reporting by Rodrigo Campos, Kate Duguid and Richard Leong in New York, Sruthi Shankar in Bengaluru and Christopher Johnson in LondonAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}