{"id": "Ex-Adidas executive found guilty in U.S. college basketball bribery scheme", "paragraph": "3 Min ReadNEW YORK (Reuters) - A former Adidas AG executive was found guilty on Wednesday of taking part in a scheme to bribe high school basketball players to attend Adidas-sponsored universities, defrauding universities and U.S. college basketball’s governing body. James Gatto, former head of global sports marketing for basketball at the athletic wear company, was convicted of wire fraud by a jury in Manhattan federal court, following the first trial to emerge from federal prosecutors’ wide-ranging probe into corruption surrounding the National Collegiate Athletic Association that has ensnared prominent coaches. Merl Code, a former consultant for Adidas, and Christian Dawkins, who worked at a sports management company, were on trial alongside Gatto and were also found guilty of taking part in the scheme. Gatto was convicted on all three counts against him, while Code and Dawkins were each convicted of both of the two counts against them. Each count carries a maximum sentence of 20 years. The defendants are scheduled to be sentenced on March 5. “We cooperated fully with the authorities during the course of the investigation and respect the jury’s verdict,” Adidas said in a statement. “We have strengthened our internal processes and controls and remain committed to ethical and fair business practices.” “We are obviously disappointed in the verdict, but respect the jury’s decision,” said Steve Haney, Dawkins’ lawyer. Gatto’s lawyer, Michael Schachter, could not be reached for comment. Code was represented at trial by his father, attorney Merl F. Code, who also could not be reached. Prosecutors had accused Gatto of working to arrange bribes for student athletes to attend North Carolina State University, the University of Louisville, the University of Kansas, and the University of Miami, which have basketball teams sponsored by Adidas. As a result of the scheme, prosecutors said, universities unwittingly extended athletic scholarships to students who were not eligible to play under NCAA rules, which forbid student athletes from being paid. In a statement posted on the school’s website, University of Kansas Chancellor Douglas Girod and Director of Athletics Jeffrey Long said the school was continuing to work with prosecutors on matters related to the case and did not comment directly on the verdict. The other schools could not immediately be reached. The defendants’ lawyers argued during the trial that it was not a crime to violate NCAA rules, and their clients’ actions were intended to help the universities attract star players, not defraud them. Reporting by Brendan Pierson in New York; Editing by Tom Brown and Chris ReeseAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}