{"id": "U.S. networks drop 'racist' Trump ad as critical elections near", "paragraph": "6 Min ReadWASHINGTON (Reuters) - NBC, Fox News and Facebook pulled an ad by President Donald Trump’s campaign that critics had labeled racist as a bitter election fight for control of the U.S. Congress headed on Monday for an unpredictable finish. Tuesday’s elections, widely seen as a referendum on Trump, have been portrayed by both Republicans and Democrats as critical for the direction of the country. At stake is control of both chambers of Congress, and with it the ability to block or promote Trump’s agenda, as well as 36 governor’s offices. A surge in early voting, fueled by a focus on Trump’s pugilistic, norms-breaking presidency by supporters of both parties, could signal the highest turnout in 50 years for a midterm U.S. election, when the White House is not on the line. The 30-second ad, which was sponsored by Trump’s 2020 re-election campaign and which debuted online last week, featured courtroom video of an illegal immigrant from Mexico convicted in the 2014 killings of two police officers, juxtaposed with scenes of migrants headed through Mexico. Critics, including members of Trump’s own party, had condemned the spot as racially divisive.  CNN had refused to run the ad, saying it was “racist.” NBC, owned by Comcast Corp, said on Monday it was no longer running the ad, which it called “insensitive.” Fox News Channel, which Trump has repeatedly named his favorite broadcaster, also said it would no longer run the spot. Fox News, a unit of Twenty-First Century Fox Inc, said it had made the decision after a review but did not elaborate. Facebook Inc said it would no longer allow paid promotions of the ad, although it would allow users to share the ad on their own pages. Trump batted away reporters’ questions about the networks’ decision to drop the ad. “You’re telling me something I don’t know about. We have a lot of ads, and they certainly are effective based on the numbers we’re seeing,” Trump said as he departed Joint Base Andrews in Maryland for a rally in Cleveland. Asked about concerns that the ad was offensive, he replied: “A lot of things are offensive. Your questions are offensive.” After Ohio, Trump headed to campaign against vulnerable Democratic U.S. senators in Indiana and Missouri at the end of a six-day pre-election sweep that has featured heated rhetoric about immigration and repeated warnings about a caravan of Central American migrants moving through Mexico toward the U.S. border. “The contrast in this election could not be more clear,” Trump told supporters in Indiana at a rally for Republican Mike Braun, who is facing incumbent Democratic Senator Joe Donnelly in a tight race. “If you want more caravans, vote for Democrats tomorrow.” Opinion polls and election forecasters favor Democrats to pick up the minimum of 23 seats they need on Tuesday to capture a majority in the U.S. House of Representatives, which would enable them to stymie Trump’s legislative agenda and investigate his administration.     Republicans are favored to retain their slight majority in the U.S. Senate, currently at two seats, which would let them retain the power to approve U.S. Supreme Court and other judicial nominations on straight party-line votes. But 64 of the 435 House races remain competitive, according to a Reuters analysis of the three main nonpartisan U.S. forecasters, and control of the Senate is likely to come down to a half dozen close contests in Arizona, Nevada, Missouri, North Dakota, Indiana and Florida. Democrats also are threatening to recapture governor’s offices in several battleground states such as Michigan, Wisconsin, Ohio and Pennsylvania, a potential help for the party in those states in the 2020 presidential race. Trump, who frequently warns of voter fraud and has asserted without evidence that millions of fraudulent votes were cast in 2016, said on Twitter on Monday that law enforcement should be on the lookout for “illegal voting.” Democratic former President Barack Obama delivered doughnuts to campaign volunteers in a House district in suburban Virginia, where Democrat Jennifer Wexton, a state senator, is challenging Republican incumbent Barbara Comstock in a fiercely contested race. Obama said the country’s character and its commitment to decency and equality were on the ballot on Tuesday. “All across the country, what I’m seeing is a great awakening,” he said. “People woke up and said: ‘Oh, we can’t take this for granted. We’ve got to fight for this.’” About 40 million early votes – including absentee, vote-by-mail and in-person ballots – will likely be cast by Election Day, according to Michael McDonald, a professor at the University of Florida who tracks the figures. In the last such congressional elections in 2014, there were 27.5 million early votes. McDonald estimated that 45 percent of registered voters would cast ballots, which would be the highest for a midterm election in 50 years. “The atypical thing that we’re seeing is high early vote activity in states without competitive elections or no statewide elections,” McDonald said in a phone interview. “There’s only one explanation for that: Donald Trump. He’s fundamentally changed how people are following politics.” Full election coverage: here Reporting by John Whitesides; Additional reporting by Joseph Ax and Kenneth Li in New York, Steve Holland in Washington and Roberta Rampton at Joint Base Andrews, Maryland; Editing by Scott Malone, Frances Kerry and Peter CooneyAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}