{"id": "Malaysia prepares austerity budget amid strains on fiscal deficit", "paragraph": "4 Min ReadKUALA LUMPUR (Reuters) - Malaysia’s new government is set to deliver an austerity flavoured first budget on Friday, having unearthed more debt left behind by the previous administration, and needing extra revenue after ditching an unpopular consumption tax.  The surprise election defeat of Najib Razak in May ejected the United Malays National Organisation from power for the first time since Malaysia’s formation six decades ago, ushering in a new political era, but not a new economy. Having accused Najib of understating the country’s debt, Malaysia’s new leaders revised it up to 1 trillion ringgit (£188.2 billion) and with economic growth slowing they are now struggling to meet fiscal deficit targets. To stave off the risk of sovereign credit rating downgrades, Finance Minister Lim Guan Eng’s maiden budget is expected to contain new taxes and spending cuts, and he has warned Malaysians that they should be prepared to make sacrifices. The new government has to cover a revenue shortfall arising from its decision to scrap the goods and services tax (GST) and reintroduce fuel subsidies - both done to fulfil election campaign promises. Prime Minister Mahathir Mohamad last week forecast a widening fiscal deficit and slower economic growth over the next two years, laying the blame on the alleged misrule of Najib’s government.  “Definitely there will be cuts to spending,” said Julia Goh, a Kuala Lumpur-based economist with UOB Bank. Axing GST left Malaysia even more dependent on gas revenue, and “obviously that is something rating agencies are less favourable of,” she said.   Local ratings firm Malaysian Rating Corporation (MARC) said the cuts to operating expenditure are likely to be in emoluments, pensions and gratuities, and debt service charges.  Cuts to development spending are expected from cost savings from infrastructure projects. Mahathir has already announced the suspension of at least $20 billion worth of public infrastructure projects. Economists said other cuts could come from making the re-introduced fuel subsidies more targeted and gradually reducing  a cash aid programme called ‘BR1M’ that was introduced by Najib to help low income households.  Najib is facing multiple charges of corruption, money laundering and abuse of power, mostly related to a defunct state fund, 1Malaysia Development Bhd. The former leader has denied any wrongdoing, and has accused his successors of trying to belittle his economic successes, which included reducing the fiscal deficit for eight straight years through to 2017. OCBC economist Alan Lau said revenue and expenditure in the 2019 budget would decline as a percentage of GDP from this year’s budget, and that fiscal consolidation could get harder.  “In the short-run, the fiscal situation may look less bright as the government may most likely overshoot its initial fiscal deficit target for 2018 at 3.4 percent of GDP,” Lau said, before dipping slightly to 3.3 percent in 2019. The government has already said it would not be able to meet the 2018 deficit target of 2.8 percent set by Najib. Other than spending cuts, the government is also expected to introduce new sources of revenue. Mahathir sought to offset the cost of ditching the goods and services tax with a new tax system, but it is only projected to cover half the lost revenue, leaving a shortfall of about 20 billion ringgit.  Ratings firm Moody’s had said in May that the decision to scrap GST was credit negative.  Malaysia may consider introducing some specific taxes on e-commerce and soda or sugar consumption in a bid to increase its revenue, according to RHB Bank. Other analysts have the government could seek to boost revenues through higher taxes for the rich and by streamlining of corporate tax incentives. Reporting by Joseph Sipalan; Editing by A. Ananthalakshmi and Simon Cameron-MooreAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}