{"id": "Obama, Clinton among targets of suspected bombs ahead of U.S. election", "paragraph": "6 Min ReadWASHINGTON/NEW YORK (Reuters) - Former U.S. President Barack Obama and former Secretary of State Hillary Clinton were among the targets of suspected package bombs delivered to several high-profile Democrats and CNN, which   the FBI said it was investigating as an act of terrorism. At least eight suspicious parcels were intercepted before  reaching any intended recipients, including Obama’s attorney general, Eric Holder, former CIA Director John Brennan and prominent Democratic Party donor George Soros. Two packages were sent to California Congresswoman Maxine Waters, the FBI said. Investigators were trying to track down another suspicious parcel they believe was addressed to Obama’s vice president, Joe Biden, a federal official told Reuters late on Wednesday.  None of the eight packages detonated, and nobody was hurt. There was no immediate claim of responsibility. But news of the bomb threats heightened tension in a nation deeply polarized ahead of elections on Nov. 6 that will decide whether Democrats take control of one or both houses of Congress from Republicans and deny President Donald Trump the majority his party now holds in both. Some leading Democrats were quick to accuse Trump himself of stoking the potential for political violence by frequently engaging in hyper-partisan, vitriolic rhetoric. Trump told a political rally in Wisconsin on Wednesday his government would conduct “an aggressive investigation.” “Any acts or threats of political violence are an attack on our democracy itself,” Trump said. “We want all sides to come together in peace and harmony.”  But he said the media has a responsibility “to stop the endless hostility and constant negative and oftentimes false attacks and stories.” The first package, which turned up on Monday, was addressed to Soros, the billionaire financier and frequent target of right-wing conspiracy theories. The parcel intended for Holder ended up rerouted to the return address printed on all the packages - the Florida office of U.S. Representative Debbie Wasserman Schultz, who formerly chaired the Democratic National Committee, according to the Federal Bureau of Investigation. The FBI said late on Wednesday it had confirmed that two additional packages, similar in appearance to the others, were addressed to U.S. Representative Waters, a veteran Democratic congresswoman from Los Angeles and also an outspoken Trump critic. An earlier FBI statement said the other packages consisted of a manila envelope with a bubble-wrap interior containing “potentially destructive devices.” Each bore a computer-printed address label and six “Forever” postage stamps. Other officials said the devices contained in the envelopes were all similar to one found in the mailbox of the Soros home and later detonated by police. At least one bomb was packed with shards of glass, one federal source said. The U.S. Secret Service intercepted packages addressed to Obama at his Washington home and to Clinton, the 2016 Democratic nominee for president, at her home in New York state.  The CNN bureau in New York received a package addressed to Brennan, who has appeared as an on-air CNN analyst, leading police to evacuate the Time Warner building in a busy Manhattan neighborhood near Central Park. It contained an envelope of white powder that experts were analyzing, Police Commissioner James O’Neill said. The package to Clinton was found late on Tuesday while the one addressed to Obama was recovered early on Wednesday, both during routine off-site mail screenings, the Secret Service said. Obama and Clinton were not at risk, they said. “So far the devices have been what appeared to be pipe bombs,” John Miller, the New York City police deputy commissioner for intelligence and counterterrorism, told a news conference. An FBI-led Joint Terrorism Task Force of federal, state and local law enforcement agencies “will continue to work to identity and arrest whosoever is responsible for sending these packages,” FBI Director Christopher Wray said in a statement.  All of the targets are frequently maligned by right-wing critics. Trump has repeatedly criticized CNN as “fake news” and disparaged the mainstream news media as an “enemy of the people.” “There is a total and complete lack of understanding at the White House about the seriousness of their continued attacks on the media,” CNN President Jeff Zucker said in a statement read on CNN. “The president, and especially the White House press secretary, should understand that their words matter. Thus far they have shown no comprehension of that.”   U.S. Democratic leaders in Congress said Trump’s call for unity rang “hollow” because of his past statements condoning acts of violence. Last week, Trump, who has joined other Republicans in accusing Democrats of encouraging “mob” tactics, heaped praise on a Montana congressman who assaulted a reporter in 2017. At an event in Austin, Texas on Wednesday, Brennan also faulted Trump for frequent inflammatory rhetoric, saying the president “too often has helped incite some of these feelings of anger, if not violence, when he points to acts of violence.” “He should not be beating the tom-toms of anger and animosity and war,” said the former CIA chief, whose security clearance was revoked by Trump after he criticized the president’s summit earlier this year with Russian President Vladimir Putin. Trump at the Wisconsin rally called attention to “how nice I’m behaving tonight.”  “Have you ever seen this? We’re all behaving very well and hopefully we can keep it that way, right?” Reporting by Makini Brice and Jonathan Allen; Steve Holland, Doina Chiacu, Mark Hosenball and Susan Heavey in Washington, Gina Cherelus and Gabriella Borter in New York; Writing by Susan Heavey and Daniel Trotta; Editing by Bill Tarrant and Clarence FernandezAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}