{"id": "How Hyundai Motor, once a rising star, lost its shine", "paragraph": "11 Min ReadSEOUL/DETROIT/CHONGQING, China (Reuters) - At a near-empty Hyundai Motor (005380.KS) showroom in the Chinese mega city of Chongqing, the store manager is grumbling about his shortage of customers and a lack of bigger, cheaper SUV models popular in the world’s largest auto market. Even with discounting of as much as 25 percent, his dealership was selling barely a hundred vehicles a month, said the manager surnamed Li. A nearby Nissan (7201.T) dealership was selling about 400 vehicles a month, a store manager there said. “The sales are simply poor,” Li told Reuters. “Look at the Nissan store next door, they have tens of customers while we just have two.” An hour’s drive away is Hyundai’s massive $1 billion manufacturing plant, which opened last year with a target to produce 300,000 vehicles per year. But with sales weak and the Chinese auto market slowing sharply, the factory is running at roughly 30 percent of capacity, two people with knowledge of the matter said. The sources asked not to be identified because the information was not public.     Hyundai, the world’s 5th largest automaker, declined to comment on the Chongqing plant’s production or the showroom’s sales but said it is “closely cooperating” with local partner BAIC (1958.HK) to turn around the China business. BAIC did not respond to requests for comment. Hyundai’s woes mark a major reversal for the automaker which was an early success story in China as it quickly and cheaply rolled out popular new models into a surging market. In 2009, Hyundai and partner Kia’s combined sales ranked third in China after General Motors (GM.N) and Volkswagen (VOWG_p.DE).  The South Korean duo now ranks ninth and its market share in China has more than halved to 4 percent last year, from more than 10 percent at the beginning of this decade. Executives and industry experts say Hyundai conceded its once stronghold in the low-end segment to fast-growing Chinese rivals such as Geely (0175.HK) and BYD (1211.HK).  Foreign rivals not only defended their turf in premium segments but also kept pricing competitive for mass-market models, squeezing Hyundai’s positioning as an affordable foreign brand, they said. In the United States, the world’s second-biggest auto market, Hyundai’s market share fell to 4 percent last year, near a decade low.  Hyundai ran into problems in China and the United States for similar reasons: It missed shifts in consumer tastes, especially the surge in demand for SUVs, and it sought higher prices than its brand image could command, four Chinese dealers and half a dozen former and current U.S. dealers, executives and employees said.      In a statement to Reuters, Hyundai said it is addressing its problems in its key U.S. and Chinese markets, revamping designs, launching new SUVs and giving regional units more autonomy to quickly develop products tailored to local tastes.   Japanese rivals such as Honda (7267.T), long a role model for the Korean automaker, have also struggled to adapt to the industry’s emerging challenges including self-driving cars and electric vehicles. Last month, Hyundai posted a 68 percent plunge in third-quarter net profit and reported its operating margin shrank to 2.7 percent in the January-September period. In 2011, Hyundai’s operating margin of 10.3 percent was the industry’s highest after Germany’s BMW.Hyundai’s lack of a strong SUV line-up in key markets has also hurt. Last year, SUVs accounted for just 36 percent of Hyundai’s U.S. sales, compared to GM’s 76 percent and the industry average of 63 percent, according to U.S. market research firm Autodata Corp data. “One of our challenges back then, and I know it would continue to be a challenge, was that the management at (headquarters) was really big on sedans,” said Ed Kim, a Hyundai U.S. product manager between 2004-2008 who is now vice president for California-based auto consultancy Auto Pacific. “(U.S.) product planning staff, marketing staff really wanted more truck products, more SUVs, but in so many cases, it was very difficult to convince management.” Hyundai America Chief Operating Officer Brian Smith acknowledged the automaker was “caught a little off guard” with a rapid market shift toward big vehicles.  But a slew of new planned SUVs including a “crossover” pickup truck in 2020 will help drive a “slow, steady” recovery in sales, Smith told Reuters in an interview. Hyundai has also in recent years hired several new designers to revamp design for next-generation models, he said. Asked if Hyundai will be able to return to its record market share of 5.1 percent in 2011, Smith said: “It’s going to take a few years.”         Hyundai made a crucial mis-step with its flagship Sonata sedan four years ago when it decided to dial back distinctive design features including its sporty, fluid curves. The redesign contributed to falling sales, U.S. dealers and former Hyundai executives said. Scott Fink, who owns the biggest U.S. Hyundai dealer by volume, vividly recalls the moment when Hyundai brought about 20 U.S. dealers to its headquarters in Seoul to show off the new Sonata before its 2014 U.S. launch. “I’ll never forget it. They pulled the sheet off of it and there were 20 people in the room and not one person clapped,”  Florida-based Fink told Reuters. The design was too conservative and mainstream, falling flat with dealers and consumers, he said. “Then, more than anything else, it just became a price war,” Fink said. In 2007, the Sonata was 10 percent cheaper than Toyota’s popular Camry sedan but by 2014 it cost more, according to U.S. market research firm Edmund.com. Hyundai, which sold nearly 200,000 Sonatas in the U.S. market in 2010, sold just 131,803 units last year.    Hyundai did not comment on the design changes or the cool response to the unveiling of the Sonata design described by Fink.  Back in the Chinese city of Chongqing, dealers at four Hyundai showrooms visited by Reuters say the new Encino SUV, based on its small South Korean SUV Kona and launched this year in China, missed the mark.  Global automakers often tweak designs for the Chinese market, adding features such as bigger, more luxurious rear passenger zones to cater to buyers, many of whom have drivers. “We don’t sell Encino. It simply doesn’t fit the Chinese market,” said another store manager surnamed Liu at one of Hyundai’s first dealerships in Chongqing. “Most Chinese prefer bigger, cheaper and prettier cars.” Hyundai had a target of producing 60,000 Encinos a year, one source with direct knowledge of the matter said. But just over 6,000 Encinos have been sold in the six months since its April launch, regulatory filings show. During a recent earnings call, vice president Koo Zayong said Hyundai will also shorten its development period for new models in China, where market trends are changing fast, driven by the rise of young customers. Hyundai created a division dedicated to improving Chinese products in August, and replaced its China operation head in July.  But the China recovery will likely be “gradual” given an economic slowdown and intensifying competition from rivals, Hyundai said in a statement to Reuters. Company officials, dealers and analysts expect the task of leading a revival will fall heavily on Hyundai’s third generation leader, Euisun Chung. Chung, 48, was promoted to executive vice chairman in September, moving him a step closer to succeeding his octogenarian father and current chairman, Mong-koo Chung, who has been absent from public view and key internal meetings for the past two years. The elder Chung is credited with catapulting Hyundai to the big leagues by drastically improving product quality and rapidly building production capacity at home and abroad.  Under his tight grip over the sprawling conglomerate and centralized decision making, Hyundai shunned partnerships and made everything in-house, from steel to key components such as engines and transmissions. But Hyundai also invested less than rivals in research and development. Last year, Hyundai Motor spent just 2.6 percent of its revenue on R&D, compared with 6.7 percent for Volkswagen, 3.8 percent for Toyota and 3.6 percent for BYD, according to their annual reports. In a break from tradition, the younger Chung has been investing in start-ups, hiring outsiders and forming partnerships with self-driving tech firms and others.  Last year, Hyundai appointed a chief innovation officer from Samsung Electronics to oversee a division on ride-sharing, robotics and artificial intelligence.  Euisun Chung has had some early setbacks. At the 2011 Detroit auto show, he unveiled Hyundai’s new brand vision - modern premium - to revamp its value for money image, and four years later announced the automaker’s first premium brand, Genesis. U.S. sales of Genesis fell 45 percent year-on-year to 9,281 vehicles from January to October.  Chung declined an interview request from Reuters. Nick Reilly, a former chief executive of GM Korea, told Reuters that Hyundai’s brand image has certainly gone up but still is “not anywhere near a premium brand”. “So I think they have to go back to the mentality to be very price-competitive in order to maintain the volumes,” he said. (For a graphic on 'Hyundai Motor's falling profit' click tmsnrt.rs/2PhXXJp) (For a graphic on 'Hyundai Motor's market share in China & U.S.' click tmsnrt.rs/2EO1gDU) (For a graphic on 'Hyundai Motor's market share' click tmsnrt.rs/2OJzWeA) (For a graphic on 'Hyundai Motor's falling profit' click tmsnrt.rs/2OIuHvJ) Reporting by Hyunjoo Jin in SEOUL, Ben Klayman in DETROIT and Yilei Sun in CHONGQING; Additional reporting by Ju-min Park, Heekyong Yang in SEOUL, Norihiko Shirouzu in BEIJING and Paul Linert in DETROIT; Editing by Soyoung Kim and Lincoln Feast.All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}