{"id": "Trump says U.S. to exit landmark nuclear arms pact, Russia threatens retaliation", "paragraph": "5 Min ReadELKO, Nev/MOSCOW (Reuters) - President Donald Trump said Washington would withdraw from a landmark Cold War-era treaty that eliminated nuclear missiles from Europe because Russia was violating the pact, triggering a warning of retaliatory measures from Moscow. The Intermediate-Range Nuclear Forces Treaty, negotiated by then-President Ronald Reagan and Soviet leader Mikhail Gorbachev in 1987, required elimination of short-range and intermediate-range nuclear and conventional missiles by both countries. “Russia has not, unfortunately, honored the agreement so we’re going to terminate the agreement and we’re going to pull out,” Trump told reporters on Saturday after a rally in Nevada. Russian Deputy Foreign Minister Sergei Ryabkov said on Sunday that a unilateral withdrawal by the United States would be “very dangerous” and lead to a “military-technical” retaliation.  Gorbachev, now a frail 87-year-old, said it would be a mistake for Washington to quit the treaty, and it would undermine work he and U.S. counterparts did to end the Cold War Arms race. “Do they really not understand in Washington what this could lead to?” Interfax news agency quoted Gorbachev as saying. A Kremlin spokesman said Russian President Vladimir Putin would seek answers about the planned withdrawal when he meets John Bolton, Trump’s national security adviser, for scheduled talks in Moscow this week. U.S. authorities believe Moscow is developing and has deployed a ground-launched system in breach of the INF treaty that could allow it to launch a nuclear strike on Europe at short notice. Russia has consistently denied any such violation. Trump said the United States will develop the weapons unless Russia and China agree to a halt on development. China is not a party to the treaty. The arms control accord, signed by Reagan and Gorbachev in a ceremony at the White House, bans land-based medium-range nuclear missiles capable of hitting Europe or Alaska. It ended a Cold War-era crisis, when the Soviet Union installed nearly 400 nuclear warheads pointed at western Europe. The United States had responded by stationing Pershing and Cruise missiles in Europe.  But this provoked a wave of protests from anti-nuclear campaigners, who felt the deployment turned Europe into a potential nuclear battleground.  In the early 1980s, hundreds of thousands of protesters gathered in Bonn, West Germany, and campaigners formed a protest camp at Greenham Common, in Britain, the site of Cruise missiles. Russian Deputy Foreign Minister Ryabkov, in comments reported by state-controlled RIA news agency, said if the United States withdrew, Russia would have no choice but to retaliate, including taking unspecified measures of a “military-technical nature”. “But we would rather things did not get that far,” RIA quoted him as saying. TASS news agency quoted him as saying withdrawal “would be a very dangerous step”, and it was Washington and not Moscow that was failing to comply with the treaty.  He said the Trump administration was using the treaty in an attempt to blackmail the Kremlin, putting global security at risk. “... We will, of course, accept no ultimatums or blackmail methods,” Interfax quoted him as saying. Asked about Trump’s comments in Beijing on Monday, Chinese foreign ministry spokeswoman Hua Chunying said a unilateral withdrawal would have a negative impact on many sides. She urged the United States to “prudently” handle the issue and to “think thrice before acting”.  “What needs to be stressed is that talking about China on the issue of unilaterally pulling out of the treaty is completely mistaken,” she said. British defense minister Gavin Williamson, in comments reported by the Financial Times, said London stood “resolute” behind Washington over the issue, and that the Kremlin was making a mockery of the agreement. However, another NATO member, Germany, voiced misgivings. German Foreign Minister Heiko Maas said that for 30 years the treaty had been a pillar of Europe’s security architecture. “We now urge the United States to consider the possible consequences,” of quitting the pact, Maas said on Sunday. Trump has in the past threatened to tear up international agreements but in the event has not carried through. Republican Senator Bob Corker, chairman of the Senate Foreign Relations Committee, drew a parallel with the NAFTA trade pact, which Trump threatened to tear up, before a reworked version of the deal was brokered last month. “This could be somewhat like the fact that they were going to end NAFTA, and then ended up negotiating some small changes,” Corker said on CNN’s “State of the Union.” “So this could be something - just a precursor - to try to get Russia to come into compliance.” Corker said quitting the treaty had not come up in a talk with Trump’s Secretary of State, Mike Pompeo.  Reporting by Jeff Mason; Additional reporting by Idrees Ali and Polina Devitt, and Michael Martina in Beijing; Writing by Christian Lowe in Moscow; editing by Richard BalmforthAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}