{"id": "Democrats tie Trump's rhetoric to spate of suspected bombs", "paragraph": "5 Min ReadMILWAUKEE/MOSINEE, Wis. (Reuters) - The undercurrent of rage that has been driving U.S. politics for the past few years surfaced on Wednesday in a series of suspected bombs sent to prominent U.S. Democrats and the news outlet CNN less than two weeks before congressional elections. None of the devices went off and no injuries were reported, but a number of top Democrats were quick to label the threats a symptom of a coarsening brand of political rhetoric promoted by President Donald Trump, who also condemned the acts. Police intercepted six suspected bombs sent to targets including Trump’s 2016 presidential rival, Hillary Clinton, former President Barack Obama and prominent political donor George Soros. Law enforcement agencies were investigating. During his presidential campaign, Trump regularly urged his supporters to chant “Lock her up,” a threat to jail Clinton, and supported conspiracy theories that Soros plays an underhanded role in influencing U.S. politics. Trump has also disparaged the mainstream media and criticized CNN as “fake news.” At a political rally in Wisconsin on Wednesday night, Trump sought to project a message of unity, pledging to find those responsible for the suspected bombs and calling on Americans to come together. “You see how nice I’m behaving tonight? Have you ever seen this?” he asked the crowd in Mosinee, Wisconsin. “We’re all behaving very well and hopefully we can keep it that way.” Democrats were having none of it, saying the Republican president had little credibility to act as a unifying figure. “President Trump’s words ring hollow until he reverses his statements that condone acts of violence,” Senate Democratic leader Chuck Schumer and House Democratic leader Nancy Pelosi said in a statement earlier in the day. “For years now, Donald Trump has been calling for the jailing of his critics and has lauded violence against journalists,” said U.S. Representative Bill Pascrell, a New Jersey Democrat. “The danger of right-wing extremism cannot be ignored and more attention must be paid to it before even worse violence occurs.” Politicians from both major parties have made condemning the harsh tone of politics part of their everyday stump speeches.  Republicans have criticized Democrats and liberal activists as a “mob,” decrying protesters crowding the U.S. Capitol to oppose Trump’s Supreme Court nominee Brett Kavanaugh, and confronting and chastising Republican lawmakers in restaurants and other settings. Scenes of small-scale violence also marked Trump’s 2017 inauguration. A recent Reuters/Ipsos poll found rising anger would be a factor driving voters on the Nov. 6 elections when Democrats are seeking to regain control of at least one of the two chambers of Congress. Trump sometimes invokes images of violence in remarks to his supporters. Last week, he reiterated his support for a Montana congressman who body-slammed a reporter in 2017. In August, Trump warned that if Democrats gained control of Congress, they would “quickly and violently” overturn his agenda. Last year, he said there were bad people on both sides of a clash in Charlottesville, Virginia, between white supremacist groups and counter-protesters. Some of the people who received suspicious packages, including Obama, Clinton and former Attorney General Eric Holder, have been targeted by online groups such as QAnon that push vast conspiracy theories saying Democrats are behind international crime rings. Posts on online message boards dismissed the cluster of suspected bombs as a “false flag,” an allegation that a widely covered news event was a politically motivated hoax. Paul Achter, a professor of rhetoric at the University of Richmond, said Trump’s frequently violent tone increased the likelihood of violent actions.  “Verbal abuse has consequences,” Achter said. “Just because Trump did not send a bomb or beat up a reporter or shoot up a newsroom doesn’t excuse this kind of speech.” But Republican U.S. Representative Steve Scalise, who was wounded last year by a gunman who opened fire on Republican lawmakers during a baseball practice, said it was a mistake for Democrats to criticize Trump for the suspected bombs. “I think it was important that the President did come out with a statement the way he did - strongly,” Scalise said in a statement. “I heard silence a lot of times, when Republicans were under attack, from Democrat leaders. We all should be calling this out, whether a Republican or Democrat is under attack.” For all Reuters election coverage, click: here Reporting by Ginger Gibson in Milwaukee and Jeff Mason in Mosinee, Wis.; Editing by Scott Malone and Peter CooneyAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}