{"id": "Thomas scores two tries as France beat Argentina 28-13", "paragraph": "3 Min ReadLILLE, France (Reuters) - Winger Teddy Thomas scored a try in each half and skipper Guilhem Guirado grabbed a third as France inflicted a convincing 28-13 defeat over Argentina to snap a five-game losing streak. The visitors got off to the best possible start with a try to Ramiro Moyano just seconds after kick-off. But Thomas crossed after 25 minutes and again eight minutes into the second half after superb work from centre Gael Fickou. Hooker Guirado sealed victory with a try nine minutes from time after he capitalised on a handling error just metres from the line. Nicolas Sanchez scored two penalties and a conversion for the Pumas and Baptiste Serin kicked 13 points for ‘les Bleus’ in a scrappy match. “The team responded very well after taking the first score,” French coach Jacques Brunel said in comments published by L’Equipe. “We are satisfied on the one hand because we won and on the other hand because of the way we won.” Both sides were desperate for a win after disappointing results last week, with the French losing in stoppage time to South Africa and Argentina struggling to a 28-17 defeat by Ireland. The Pumas started well but were overpowered by a French team who were simply too strong and too fast. The win in Lille was France’s first since March, when they beat England in the Six Nations. It also extended Argentina’s losing run to four matches. The South Americans now travel to Murrayfield to play Scotland next Saturday, while France take on Fiji in Paris the same day. “We failed in areas where we weren’t failing before,” said Argentina number eight Javier Ortega. “We didn’t do well arming the maul and we also had problems in the scrum.” “This week we have to take a look at ourselves, without beating ourselves up, and focus on the work that each one of us can do to get back to to our best for the game next week against Scotland.” The match was an early preview of what is to come in the 2019 World Cup, with both sides drawn together in a pool with England, the United States and Tonga. Reporting by Andrew Downie; editing by Tony LawrenceAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}