{"id": "AMD revenue forecast disappoints as crypto demand subsides, shares plummet", "paragraph": "3 Min Read(Reuters) - Advanced Micro Devices Inc (AMD.O) on Wednesday forecast fourth-quarter revenue below estimates as the chipmaker faces dwindling demand from cryptocurrency miners for its high-margin graphic processors and excess inventory, sending its shares down 22 percent. AMD shares, which have more than doubled this year, were trading at $17.84 after the bell. AMD and Nvidia, its main rival in the gaming chip market, were the biggest beneficiaries of a cryptocurrency boom last year as miners invested in new networks to keep up with demand. However, with cryptocurrency prices in free fall, mainly due to regulatory worries, demand for the chips have declined. Graphic Processing Units like AMD’s Radeon provide the high computing abilities required for cryptocurrency mining. Nvidia shares were down 2.5 percent at $194.98. AMD said it now expects revenue of about $1.45 billion, plus or minus $50 million, below analysts’ estimates of $1.6 billion, according to Refinitiv data. The company said revenue from its graphics and computing business, which sells Ryzen desktop processors and Radeon graphics cards, rose 12 percent to $938 million in the third quarter. AMD said strong sales of Ryzen chips were partially offset by lower revenue from its graphics business, where blockchain-related GPU sales were negligible. “In graphics, the year-over-year revenue decrease was primarily driven by significantly lower channel GPU sales, partially offset by improved OEM and data center GPU sales,” Chief Executive Officer Lisa Su said on a post-earnings call. Channel GPU sales came in lower than expected based on excess channel inventory levels, caused by the decline in blockchain-related demand that was so strong earlier in the year, she added. Su said the graphics and computing segment underperformed expectations by $100 million in the quarter and added that inventory levels for its graphics products remain high and may take a couple quarters to return to normal levels. “The miss was due to GPU. AMD had too high an exposure to the crypto-currency market. Additionally, they do not have a competitive line-up in the PC Gaming market,” Summit Insights Group analyst Kinngai Chan said. Sales in its enterprise, embedded and semi-custom unit, which makes EPYC server processors, fell 5 percent to $715 million. AMD said net income climbed to $102 million, or 9 cents per share, in the third quarter ended Sept. 29 from $61 million, or 6 cents per share, a year earlier. Excluding items, AMD earned 13 cents per share, narrowly beating estimates. Revenue rose to $1.65 billion, but missed estimates of $1.7 billion. Reporting by Arjun Panchadar in Bengaluru; Editing by Sai Sachin RavikumarAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}