{"id": "Son of All Blacks great Jones earns sevens contract", "paragraph": "3 Min ReadWELLINGTON (Reuters) - The son of former All Blacks great Michael Jones has earned his first professional rugby contract with his naming in the country’s squad for the Sevens World Series. The 18-year-old Niko Jones captained St Peter’s College to the national secondary schools title earlier this year, where he showcased the same blistering speed and athleticism exhibited by his father during his 55-test career. The performances of the number eight has made him highly sought after by New Zealand’s professional rugby sides. Fairfax Media reported earlier this month that he was leaning towards heading to Christchurch to link with the Canterbury Crusaders system. “He’s a prestigious young talent, and he’s definitely on our watch-list,” Crusaders coach Scott Robertson said at the time. “But because he’s still at school he’s not contactable in regards to the collective agreement with NZ Rugby.”  Jones has signed a contract for just the current Sevens World Series, which starts later this month in Dubai and ends in Paris next June. He was one of five players to have signed new contracts with the sevens programme, which has now centralised in Tauranga in New Zealand’s North Island. Akuila Rokolisoa, Ngarohi McGarvey-Black and Scott Gregory all signed contracts for the upcoming season, while veteran Kurt Baker has signed through until the 2020 Tokyo Olympics.  “This season is important for us because its an Olympic qualification year,”  coach Clark Laidlaw said in a statement. “We need to be performing at every tournament we go to, so it is crucial to have a strong squad.” The All Blacks sevens failed to win a medal at the Rio Games in 2016 after they were surprisingly defeated by Japan in the group stage before they lost to Fiji in the quarter-finals. The team, however, rebounded earlier this year by clinching Commonwealth Games gold on the Gold Coast and then winning the World Cup in San Francisco. They have not won the World Series since 2014 and finished third this year, with their focus mostly on the Commonwealth Games and World Cup. Reporting by Greg Stutchbury; Editing by Ian RansomAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}