{"id": "U.N. chief taps Norwegian diplomat as new Syria envoy: letter", "paragraph": "3 Min ReadUNITED NATIONS (Reuters) - Norwegian diplomat Geir Pedersen will be the new United Nations Syria envoy, U.N. Secretary-General Antonio Guterres told the U.N. Security Council in a letter seen by Reuters on Tuesday. Diplomats speaking on condition of anonymity said Pedersen, now Norway’s ambassador to China, had the informal approval of the council’s permanent five members - Russia, China, the United States, France and Britain. “In taking this decision, I have consulted broadly, including with the Government of the Syrian Arab Republic,” Guterres wrote. “Mr. Pedersen will support the Syrian parties by facilitating an inclusive and credible political solution that meets the democratic aspirations of the Syrian people.” Pedersen will replace Staffan de Mistura when he steps down for family reasons at the end of November, quitting as the Syrian government - backed by Iran and Russia - has retaken most of the country and a political deal remains elusive. The Norwegian diplomat faces obstacles in negotiating a political deal, which the West has said is needed to unlock its reconstruction support and to encourage the bulk of the millions of refugees in Europe and the Middle East to return. United Nations efforts are currently focused on trying to convene a committee to rewrite Syria’s constitution.  De Mistura told the Security Council on Friday that Syria  wants the United Nations to simply facilitate efforts to rewrite the constitution and not choose a third of the committee that will do it, presenting a “serious challenge.” De Mistura is the longest serving of three U.N. mediators during the more than seven-year-old Syrian conflict after more than four years in the job. His predecessors - former U.N. Secretary-General Kofi Annan and Algerian diplomat Lakhdar Brahimi - both quit in frustration. Pedersen has also served as Norway’s ambassador to the United Nations. In 2005, he replaced de Mistura as then-U.N. chief Annan’s personal representative in southern Lebanon. He has also worked on the Middle East peace process for both the United Nations and Norway.      According to a U.N. biography: “In 1993, he was a member of the Norwegian team to the secret Oslo negotiations that led to the signing of the Declaration of Principles and the mutual recognition between the Palestine Liberation Organization and Israel.” Reporting by Michelle Nichols; Editing by James Dalgleish and Grant McCoolAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}