{"id": "Brazil’s Bolsonaro does not rule out retaining central bank chief Goldfajn", "paragraph": "3 Min ReadSAO PAULO (Reuters) - Brazil’s presidential front-runner Jair Bolsonaro said on Saturday he does not rule out keeping acclaimed central bank chief Ilan Goldfajn in the job, on a day that thousands took to the streets of major cities to protest against the far-right candidate. “I am not sure if he will be kept but what is working should be kept,” Bolsonaro told journalists in Rio when asked about Goldfajn’s future. At the helm of the central bank since June 2016, Goldfajn has kept a tight lid on inflation and was considered the best central banker by The Banker magazine for taming inflation in Latin America’s largest economy.  Goldfajn is preparing to step down by the end of the year, Bloomberg reported on Thursday. As the Brazilian central bank does not have full institutional independence, incoming presidents typically replace its top official, creating political risk for monetary policy. President Michel Temer will leave office on Jan. 1. Bolsonaro also said on Saturday that he intends to tap astronaut Marcos Pontes as science and technology minister in his eventual government. The candidate had already announced part of his potential cabinet, including banker Paulo Guedes as economy minister, retired Army general Augusto Heleno Pereira as defence minister and Congressman Onyx Lorenzoni as his chief of staff. WOMEN-LED PROTESTS Bolsonaro, a polarizing candidate who has been charged with hate speech for his comments regarding gays, blacks and women, faced a second wave of women-led protests in a month on Saturday. A Facebook group called Women United Against Bolsonaro invited protesters to gather in 26 Brazilian cities, including Rio de Janeiro and Sao Paulo. Other movements also organised protests against Bolsonaro. In the most polarizing election in a generation, Bolsonaro’s opponent in the Oct. 28 runoff is leftist candidate and former Sao Paulo Mayor Fernando Haddad. According to a recent survey by pollster Datafolha, Bolsonaro was expected to win 59 percent of votes, compared to Haddad’s 41 percent. Bolsonaro has successfully pitched himself as the anti-establishment candidate, gaining voters fed up with political graft and violent crime. The far-right candidate nearly died from a stab wound at a rally in early September and skipped debates and most campaign events after spending weeks in the hospital. Reporting by Rodrigo Viga Gaier in Rio de Janeiro; Writing by Carolina Mandl; Editing by Alistair Bell and Bill TrottAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}