{"id": "Ireland topple New Zealand to lay down World Cup marker", "paragraph": "4 Min ReadDUBLIN (Reuters) - Ireland laid down a massive marker ahead of next year’s World Cup by beating holders New Zealand for just the second time with a compelling 16-9 victory in a clash of the world’s top two teams on Saturday. Just two years after claiming an All Black scalp for the first time in a famous day in Chicago, the champions of the northern hemisphere dominated the best the south has to offer with the 12th and most important try of winger Jacob Stockdale’s young, 14-test career proving decisive. The win, Ireland’s 17th in their last 18 tests, was also their first over the All Blacks at home and set expectations to feverish levels at an electric Aviva Stadium for a team that has never before gone beyond a World Cup quarter final. “They’re the best team in world and we had to play the best game of this squad’s tenure. The boys showed up everywhere, tackles that shouldn’t have been made, plays that shouldn’t have been made,” man-of-the-match Peter O’Mahony said in a pitchside interview.  “It’s a big piece of history for us and one we wanted to tick off in Ireland.” The game began with the same ferocious physicality as the sides’ last meeting two years ago when the world champions gained revenge for Chicago with a bruising win in Dublin. The hosts came out on top from the off, first stubbornly keeping their opponents out at their own end led by a near-possessed O’Mahony before going through the phases at the other to hand Johnny Sexton an easy opening penalty. It was telling that Beauden Barrett opted successfully for the posts rather than the corner with his first opportunity in range, an option Sexton turned down almost immediately after the visitors gave away their sixth penalty in just over 20 minutes.  It almost paid off with number 8 CJ Stander first held up over the line and when Ireland bulldozed through the resulting scrum, fullback Rob Kearney should have touched down but instead knocked on Sexton’s opportunistic chip over the top. Barrett quickly levelled the scoring again, this time with an effortless drop goal from distance, but Ireland continued to put the pressure on with 22-year-old lock James Ryan once more hugely impressive all over the park. Rattled, New Zealand’s penalty count inched towards double figures as another Sexton penalty gave Ireland a 9-6 halftime lead, a poor return for their dominance.  They were nearly made to pay early in the second period when Kieran Read charged down a risky Stockdale chip-kick but failed to gather with the try line at his mercy. That was as close as New Zealand would come and Stockdale quickly made up for his error as a brilliant lineout move - a Joe Schmidt special - switched play back onto the blindside to put the Ulster winger into space to chip through and collect. The game inevitably opened up and New Zealand’s backline  became more of a feature but Ireland, saved again by O’Mahony before he limped off to a hero’s ovation on the hour, survived the onslaught. Barrett closed the gap to seven points with his third penalty but Ireland saw the game out, keeping the world’s best pinned back in their own half and claiming a second famous victory in two years. Ireland and New Zealand have met 31 times since their first match in 1905, with the All Blacks recording 28 wins to Ireland’s brace of victories. The other match was drawn. Additional reporting by Graham Fahy, editing by Tony LawrenceAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}