{"id": "South Korea third-quarter GDP growth misses forecasts, construction spending plunges", "paragraph": "3 Min ReadSEOUL (Reuters) - South Korea’s economy grew slightly slower than expectations in the third quarter, and in line with the previous three-month period, as a plunge in domestic investment offset the positive effects from government stimulus and resilient exports. Gross domestic product grew a seasonally adjusted 0.6 percent in July-September from the previous quarter, the Bank of Korea estimated on Thursday, just missing the median forecast of a 0.7 percent gain in a Reuters poll. Construction investment shrank 6.4 percent in the quarter, marking the biggest decline since the 1997-1998 Asian financial crisis, as government measures to curb rising housing prices discouraged home-building. Private consumption, which accounts for almost half of the country’s annual GDP, however, improved slightly, expanding 0.6 percent in the quarter and accelerating from 0.3 percent in the June quarter, supporting overall growth. Analysts said turbulent global financial markets, uncertain trade prospects and doubts about the government’s push to regulate the housing market and sharply increase minimum wages clouded the outlook. “The negative factors that affected the third quarter remain pretty much the same and make the prospects uncertain for the current quarter as well,” said Park Sang-hyun, economist at Leading Investment and Securities. South Korean businesses have been reluctant to boost investment on concerns about global demand. In the property sector, builders have cut spending due to government curbs in the housing market while weak employment prospects have prompted consumers to cut spending. From a year earlier, the economy expanded 2.0 percent, far slower than the second quarter’s 2.8 percent and missing the poll estimate of 2.2 percent mainly due to the above-trend expansion seen in the comparable period last year. The data on Thursday showed Asia’s fourth largest economy is expected to keep its growth on track to meet the central bank’s full-year projections at 2.7 percent, which was revised down from 2.9 percent. In a major setback for President Moon Jae-in, who rose to power on a pledge to be South Korea’s “Jobs President”, annual employment growth has slowed every quarter since his election in May last year. In the last quarter, it posted its weakest growth in almost nine years. The government has blamed demographic changes and challenges in a handful of sectors, but analysts attributed the poor tally to a series of pro-labor policies, including a 16 percent rise in minimum wages this year and a shorter work week. This comes as the deepening U.S.-China trade dispute dampens the prospects for exports, the main engine of growth for the country, whose companies include manufacturing giants such as Samsung Electronics (005930.KS) and Hyundai Motor (005380.KS). Editing by Sam HolmesAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}