{"id": "Brazil's Vale reports third-quarter miss on forex, base metals", "paragraph": "4 Min ReadRIO DE JANEIRO (Reuters) - Brazil’s Vale SA (VALE3.SA) on Wednesday posted weaker-than-expected net income, as a weaker currency coupled with lower base metals production and prices weighed on the world’s largest iron ore producer. The miner, also the world’s largest nickel producer, reported $1.408 billion in third-quarter net income, 27 percent below analysts’ estimate of $1.926 billion. The figure was also well below the $2.23 billion reached in the year-ago period. Vale suffered a $1.263 billion net financial loss in the quarter, hammered by a 3.8 percent depreciation in Brazil’s currency, the real.  Fears that leftist Fernando Haddad might win upcoming presidential elections drove the currency lower in September, ahead of the vote due on Sunday Oct. 28.  Underlying earnings, which strip out the effect of exchange rate movements, inched down to $2.056 billion from $2.090 billion over the same period last year.   Earnings before interest, tax, depreciation and amortization, a gauge of operational profit known as EBITDA, rose to $4.374 billion from $4.192 billion in the same period last year and compared to forecasts for $4.296 billion.  But its base metal component slumped to $528 million in the period, down $250 million from the prior quarter, due to lower nickel, copper and cobalt prices and lower volumes due to a scheduled maintenance shutdown at Sudbury operations in Canada.    Free cash flow reached a robust $3.113 billion, helping Vale cut its debt to $10.704 billion, its lowest since 2009, from $11.519 billion in the second quarter. However, it failed to reach its net debt goal of $10 billion which Chief Executive Officer Fabio Schvartsman forecast in January for the middle of the year.  In a client note, BTG Pactual said the results were solid, noting that cash generation was “impressive, surpassing our expectations by a fair margin.” However, it described the base metal division as “disappointing” and called Vale’s iron ore division its “one and only value driver.”   Heavy spending on Vale’s flagship S11D mine, which churns out rich grades of ore, drove up Vale’s debt in recent years, coinciding with a sharp slide in iron ore prices. Helped by a ramp-up at that mine, Vale reported record iron ore production in the quarter, underpinning the results. China’s campaign to clean its skies by clamping down on polluting steel mills has fueled a need for high-grade iron ore to boost productivity and limit emissions, opening the door wider for suppliers of better quality ore like Vale to the world’s biggest buyer. Vale also said it approved the $1.1 billion expansion of its Salobo copper mining, which Reuters previously reported was slated for approval at an Oct. 24 board meeting.  The miner said it would receive a bonus of some $600 million to $700 million from Wheaton Precious Metals after reaching certain output targets, as part of an existing gold stream deal.  Vale trimmed its capital expenditures to $692 million in the quarter from $863 million in the same period last year.  Net operating revenue rose to $9.543 billion, above the $9.050 billion in the third quarter of 2017. Analysts had expected revenue of $9.456 billion.  Reporting by Alexandra Alper and Marta Nogueira; Editing by Chris Reese and Diane CraftAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}