{"id": "After tragedies and big losses, Hyundai looks to reverse North Korea fortunes", "paragraph": "9 Min ReadSEOUL (Reuters) - For Hyundai, the South Korean conglomerate, North Korea has been a story of lost opportunities – and tragedy. In 2003, months before Hyundai was set to open an industrial complex in North Korea, the executive behind the project committed suicide amid accusations his company had made a secret $500 million payment to the North.  Five years later, a Hyundai-run resort in the North was closed after a North Korean soldier shot a South Korean tourist. Both projects have long been shuttered, symbolizing the difficulties South Korean companies have had doing business across the border. But, emboldened by a thawing of relations on the Korean peninsula and attracted by its promise of cheap labor and untapped growth, Hyundai is again preparing to return to North Korea. Hyundai executives and investors are encouraged by a pledge by Seoul and Pyongyang to re-open the Kaesong industrial park  and the Mt. Kumgang resort as part of a warming in ties between the neighbors. International sanctions over the North’s nuclear weapons program make it unclear how quickly investments can resume. But executives and investors are betting Hyundai stands to benefit the most from any peace dividend on the Korean peninsula. “We have invested a lot for a long time, and have a solid and wide network and business rights there,” said Baek Cheon-ho, a senior executive at Hyundai Asan, the subsidiary that managed the Kaesong and Mt. Kumgang projects. “Combining all that, Hyundai will eventually be better off in North Korea.”  For Korea Inc, struggling with high labor costs and slowing growth, North Korea’s cheap labor, vast resources and huge growth potential represent an unmissable opportunity, Baek and several business executives told Reuters. For Hyundai and its ruling family, North Korea also has symbolic importance. Founder Chung Ju-yung was born to a peasant family in Asan, North Korea and named the subsidiary to handle the group’s enterprises after his birthplace. “We’re doing this not only for Hyundai, but for the greater good of all South Korean companies,” Baek said. “If we restart our North Korea businesses, there will be many new jobs for us, but also for a number of other firms working with us.”  Hyundai’s ebb and flow in North Korea also illustrate how it could again become one of the biggest casualties from any setback in international efforts to get Pyongyang to abandon its nuclear program.  Other South Korean conglomerates such as Samsung and Lotte have made smaller bets on North Korea and will need to start from scratch if economic ties resume. Both have set up taskforces in recent months to explore opportunities. Shares of unlisted Hyundai Asan have nearly quadrupled to a record high in over-the-counter trading this year.  Other companies such as train maker Hyundai Rotem (064350.KS), builder Hyundai Engineering & Construction (000720.KS) and Hyundai Elevator (017800.KS), have also surged as the two Koreas work toward officially ending their 1950-53 conflict. “Stocks like Hyundai Elevator are now going up and down driven by anticipation and headline news, rather than fundamentals,” said Lee Gun-min, a fund manager BNK Asset Management. “But we think there is a better chance and visibility about economic cooperation than in the past since the two Koreas are now talking about ending the war.”  Lee manages a “Unification Fund” for his investment firm, targeting stocks with potential exposure to North Korea, mostly Hyundai companies such as Hyundai Elevator but also banks and logistics firms.  South Korean President Moon Jae-in, who has pushed for rapprochement with the North since his election last year, calls the Kaesong industrial park a “lifeline” for South Korea. Asia’s fourth-biggest economy is being squeezed globally between high-end, innovative manufacturers and low-cost producers in China and elsewhere. Before the 2016 closure of Kaesong, some 120 South Korean companies employed 55,000 North Korean workers there, making everything from clothes and kitchen utensils to electronic components. The North Korean workers were well qualified, hard working and cost just a fraction of what workers in the South were paid, factory owners said. Almost all small and medium enterprises which used to operate in Kaesong said they would like to go back, according to an April survey.  Seven out of 10 South Korean companies would prefer to use North Korean workers instead of foreign migrants due to language barriers and high costs associated with hiring foreign labor, a separate survey by the Korea Federation of SMEs found. Hyundai Asan has the most riding on the prospect of a peaceful peninsula.  It paid $1.2 billion to buy exclusive rights for Kaesong and Mt. Kumgang, and has interests in railroads and infrastructure projects including reconnecting inter-Korean railways.   Hyundai Asan’s rights to land the size of Manhattan in Kaesong last for 50 years, and it has a plan to build an even bigger factory town if the complex reopens, accommodating 2,000 companies and 350,000 North Korean workers.  Less than 5 percent of the total property in Kaesong has been developed currently, Hyundai told Reuters.  Officials say Hyundai has also agreed with the North to run tours in the coastal city of Wonsan, which North Korean leader Kim Jong Un is trying to build into a hotspot for tourism and foreign investment, as well as Mt. Paektu, the mythical homeland of both Koreas. Hyundai’s Baek said the company is also in talks with Seoul and state-run corporations about projects to reconnect railroads between the North and South. “The government respects Hyundai’s business rights it signed with the North,” said a spokeswoman at South Korea’s Unification Ministry, who did not respond to a question about its discussions with Hyundai.    South Korean government officials and business executives say the biggest hurdle is opposition from Washington, which wants to maintain sanctions until Pyongyang completely denuclearizes. In July, Mark Lambert, director for Korean affairs at the U.S. State Department, called about 10 South Korean businessmen for a meeting at the U.S. embassy in Seoul to deliver a stern message: No resumption of any businesses until denuclearization. “The mood in the room was bleak,” said SJTech Chairman Yoo Chang-geun, who used to operate a factory at Kaesong and attended the meeting.     Baek, who was also present, unsuccessfully argued Kaesong and Mt. Kumgang should be waived from sanctions “to show our goodwill to North Korea”. A spokeswoman for the U.S. State Department declined to comment on details of “private diplomatic conversations”. Hyundai’s relationship with North Korea goes back a long way.       Hyundai founder Chung drove 500 head of cattle across the border to the North in 1998 to aid reconciliation on the divided peninsula.  Kim Jong Il, the late father of Kim Jong Un, was quoted as saying: “Our first love is Hyundai when it comes to North-South relations, a way earlier than with (South Korean) authorities,” according to a North Korean book titled “Patriots Who Left Their Names On Path To Unification”. But the suspension of its North Korea projects left Hyundai Asan with combined losses of $367 million in the past decade. Hyundai admitted it paid North Korean authorities $500 million in 2000 to secure business rights there.  Two days after being questioned by prosecutors over the scandal, Chung Ju-yung’s son and successor, Chung Mong-hun fell to his death from Hyundai headquarters. Indictments against him were dropped after his death.  The Supreme Court gave Hyundai Asan’s then chief executive a suspended jail term for violating foreign money transfer rules, but he was later pardoned. The widow of the younger Chung now heads Hyundai Asan’s parent group and visited Pyongyang in September as part of a South Korean delegation for a summit between Moon and Kim.  “There are many hurdles to be overcome, but I feel there is hope ahead of us,” Hyun Jeong-eun said.  Reporting by Ju-min Park and Heekyong Yang, additional reporting by Hyunjoo Jin; Editing by Soyoung Kim and Lincoln Feast.All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2018 Reuters. All Rights Reserved."}