{"id": "You can't blame Shaun and Mitch Marsh for bogging down Australian cricket", "paragraph": "\n      Updated \n    \n      October 25, 2018 12:35:11\n    \nIt's hard to defend a top order batsman who didn't reach double figures in four innings in a Test series.But it's important to look a bit deeper before blaming Shaun Marsh, and his brother Mitch, for Australian cricket's predicament at the end of a woeful series against Pakistan.Neither Shaun nor Mitch Marsh played to their potential in the recent series in the UAE, and both are aware of the mounting criticism surrounding their places in the Test team. \"Obviously, there is a bit of noise out there,\" Shaun said on his return to Perth this week.\"I have tried to sort of stay away from it and not read too much. For me it is just about scoring runs and I have not done that in the last couple of weeks, which has been disappointing.\"But I am looking forward to getting back out there and having a bit of fun again.\"It would have taken a brave selector to not pick Shaun Marsh ahead of the Test series with Pakistan. He was Australia's form batsman in June's one-day series against England. Batting at number three he scored two centuries, outplaying the likes of Glenn Maxwell and Aaron Finch.And despite a modest return during the disastrous tour of South Africa, he was instrumental in regaining the Ashes last summer.Mitch Marsh's form was equally compelling.Coming off a serious shoulder injury, he scored two first-class centuries in September — one in India and one in the UAE.He too had a modest tour of South Africa — aside from a 96 in the first Test in Durban — but was outstanding during the Ashes, playing the final three Tests and posting scores of 181 and 101. They deserved their chance to play in the UAE, but when Aussie cricket fans see two players with as much ability as the Marsh brothers not performing when the country desperately needs them to, frustrations understandably surface.However, while they may be brothers, they are two very different players, and lobbing both in the same basket when analysing the performance of the Australian cricket team makes no sense. Shaun is 35 and nearer to the end of his career. Mitch is 27, a vice-captain, can bowl and has his best cricket ahead of him.\"We know he is talented. We know he is a brilliant bloke, there is no more popular person in the team,\" Australian coach Justin Langer told SEN.\"We are very hopeful he finds his focus and he starts performing like he would like to, and we would like him to.\"The bigger issue for Australian cricket is the same problem it has had for the past decade — a shortage of batsmen scoring runs consistently at Sheffield Shield level. The suspensions of Steve Smith, David Warner and Cameron Bancroft for ball tampering only exacerbates the situation.Shaun Marsh and Usman Khawaja were the only members of the team against Pakistan with a career first-class average above 40.In contrast, Langer played in an era where the best Australian batsmen averaged in the mid-50s in the longer form of the game.Until the general standard of batting in Australia improves — and it starts in the junior levels and the nation's talent pathways — these performances will likely continue.\nTopics:\nsport,\n\n\n\t\n\tcricket,\n\n\n\t\n\taustralia,\n\n\n\t\n\tunited-arab-emirates\n\n    First posted \n    \n      October 25, 2018 08:27:55\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}