{"id": "Mother charged with child stealing after allegedly going on the run with daughters", "paragraph": "\n        Posted \n    \n      November 05, 2018 06:53:05\n    \nA Townsville mother who allegedly went on the run with her young daughters is the latest to be charged by Australian Federal Police (AFP) officers investigating a syndicate that has allegedly smuggled women and children around the country.Seven people with connections to the alleged group have now been charged, with police claiming the network helped mothers commit child abductions in breach of court-ordered custody arrangements.The alleged head of the syndicate, anti-paedophile campaigner Russell Pridgeon, has claimed the group was helping mothers and children escape fathers who were sexual abusers.Three women charged late last week had \"active roles\" in the abduction of three children, the AFP said.\"Police will allege these people provided assistance to the group's organisers in providing transport, accommodation and other support to allow two mothers to evade law enforcement detection,\" the AFP said in a statement. The 46-year-old north Queensland mother, who cannot be named for legal reasons, is facing Commonwealth charges of child stealing and conspiracy to defeat justice.Newcastle woman Joyce Faldzeen, 68, has been charged with the same offences, while 75-year-old Ariel Johnson from Taree in NSW has been charged with conspiracy to defeat justice.The child-stealing offence carries a maximum penalty of seven years' prison, while the conspiracy charge has a 10-year maximum penalty.The children at the centre of the investigation have been found safe, but the AFP said it was continuing to investigate the loosely connected syndicate.The Townsville mother is already facing child-stealing charges laid by Queensland police in May, with prosecutors alleging she used false identities, secret bank accounts and a \"well organised network\" to hide with her daughters for four years.Last month, federal police accused the woman's 83-year-old father of helping her avoid detection, and charged him with dealing in the proceeds of crime.AFP Assistant Commissioner Debbie Platz said parental abductions had \"the potential to significantly endanger the safety and wellbeing\" of children. \"The actions of these people in deliberately ignoring court orders and helping hide children from their extended families, the courts and law enforcement cannot be justified,\" she said.\"[Children] can suffer the loss of contact with their family and friends, miss their educational stability and are often hidden away from people around them.\"They are removed from almost everything familiar to them including their toys, daily routine, and sometimes even their name.\"In October, the AFP made several arrests in NSW, Queensland and Western Australia after a long-running investigation, Operation Noetic.The AFP claimed the network had been operating for about 10 years, and had hidden at least five children.The alleged financier of the network, Dr Pridgeon, was working as a GP in the NSW town of Grafton when he was arrested last month.\"It doesn't matter if I go to jail. What matters is there are children in desperate need of rescue,\" Dr Pridgeon said after he was released on bail.The 46-year-old mother is due to face the Townsville Magistrates Court on December 20.Ms Faldzeen and Ms Johnson will face the Brisbane Magistrates Court on December 7.\nTopics:\ncrime,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tfamily-law,\n\n\n\t\n\tqld,\n\n\n\t\n\taustralia,\n\n\n\t\n\ttownsville-4810,\n\n\n\t\n\tbrisbane-4000\n\n\nContact Kristian Silva\n\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}