{"id": "Healy injured as Australia suffer first Women's T20 World Cup defeat, losing by 48 runs to India", "paragraph": "\n      Updated \n    \n      November 18, 2018 11:31:34\n    \nAlyssa Healy will require further assessment before being cleared for the women's World Twenty20 semi-finals after a collision left her concussed and ended her game early in Australia's 48-run loss to India.The head knock to one of the most damaging players in the tournament capped off a bad day for the Australians in Guyana, who were barely in the hunt against a dominant India.With both teams already progressing, Healy was taken from the field after her head hit teammate Megan Schutt's shoulder as the pair only had eyes for the ball while trying to take a catch late in the first innings.The wicketkeeper fell straight to the ground but was able to walk from the field before later being diagnosed with a mild concussion, and not returning with gloves or bat as India piled on 8-167. She'll be assessed again when Australia land in their finals base of Antigua on Monday (AEDT), with the usual return-to-play checks to be completed before Friday's semi-final.\"We'll treat that carefully and monitor that over the next few days. But hopefully she's all right for us come semi-finals time,\" captain Meg Lanning said.\"She was down on the bench there towards the ends of the batting innings. She wanted to bat but we were just playing that smart. Hopefully she's good to go.\"Heading into the semi-final against the winner of England and West Indies, Healy is Australia's leading run-scorer with 157 at a tournament-high average of 78.5 and strike rate of 160.2.Her absence at the top of the order came as a major blow against India as Australia attempted to pull off their biggest ever successful run chase, but were instead routed by the spinners to be all out for 119. Only Ellyse Perry produced a lone hand for Australia in her 100th T20 international, hitting an unbeaten 39 from 28 to go with her 3-16 with the ball.Indian opener Smriti Mandhana had earlier smashed 83 from 55 balls and Harmanpreet Kaur hit 43 off 27 with dominant stroke play down the ground.Mandhana had three sixes in her knock to go with her nine boundaries, while Kaur also whacked three maximums with one over spinner Sophie Molineux's head the biggest.Kaur's knock ended when she skied Delissa Kimmince (2-42) to point in the 14th over, before Mandhana had an LBW call against her overturned in the following over from Molineux (0-45) to survive on 62.The opener eventually holed out to long on off the bowling of Schutt shortly after Tayla Vlaeminck pulled off the catch of the tournament to remove Veda Krishnamurthy, but India were still able to end Australia's 12-match T20 winning streak despite the late collapse. AAP\nTopics:\ncricket,\n\n\n\t\n\tsport,\n\n\n\t\n\tguyana,\n\n\n\t\n\taustralia,\n\n\n\t\n\tindia\n\n    First posted \n    \n      November 18, 2018 10:41:09\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}