{"id": "Harts Range Garnet Mine reopening angers outback business ownersFeatured StoriesAdditional stories", "paragraph": "ShareNT Country Hour\nBy\n Katrina Beavan\nShareThe Harts Range mine, about 200km from Alice Springs, is set to reopen. Supplied: Australian Abrasive MineralsBusiness owners who wrote off hundreds of thousands — in some cases millions — when a Central Australian mine went into administration a year ago are furious that it will now reopen.Australian Abrasive Minerals [AAM] confirmed this month it is reopening its Harts Range Garnet Mine, after attracting new Australian investors and greater certainty going forward. Although creditors are expected to be offered work with the company again, a number of local business owners are fuming, saying they remain out of pocket.Matt Morton from Morton Brothers Contracting said he lost more than $200,000 when the company went into administration.\"We had a large involvement with the mine when it first got up and running and operating,\" Mr Morton said.\"The equipment that we used, everything that I purchased and bought, in hope that I was going to get paid for, I had to just pay out of my own pocket.\" Mr Morton said the loss, which amounted to about $230,000, almost sent his business under.\"I had a lot of work [to do] to get that money back and to keep functioning as a company,\" he said.\"Liquidation wasn't an option for us so we had to dig our way back out of a hole.\"It's taken about 12 months to get out of that hole now, and we're sort of just in the clear now.\"The ABC spoke to a number of businesses who are in the same boat, and Mr Morton said the feeling among the small community is one of anger. \"It just leaves a bitter taste in everyone's mouth, it's just not fair what they can do,\" he said.\"Coming in from interstate, using our resources and our labour and then sort of wiping that free and starting again, it's just not fair.\"ShareKordaMentha Restructuring, the company that handled the administration process, said a deal was made with creditors to allow AAM to keep operating and avoid liquidation. Supplied: Australian Abrasive Minerals Rahul Goyal from KordaMentha Restructuring, the company that handled the administration process, said a deal was made with creditors to allow AAM to keep operating and avoid liquidation. \"The deal was offering them five cents in the dollar, I know that doesn't sound like much, but it was better than the alternative,\" said Mr Goyal.He said the alternative was the company went into liquidation and creditors got nothing back. The deal also gave creditors the option of coming back to work for AAM again, to get the mine up and running.Due to this arrangement, Mr Goyal said AAM is able to operate once more, with the same ABN and directors, however, he said the business had changed in other ways. \"That's not the same company as it was when I took control as administrator, there was a whole flood of new money coming in to get this mine up and running again, and it saved a few jobs as well,\" he said.AAM said in a statement that the company understands the disappointment and sympathises with any Alice Springs entity of which this outcome has been difficult. It said the resolution that AAM enter a Deed of Company Arrangement [DoCA] passed unanimously at a creditors meeting in April. \"Since the DoCA was effectuated, AAM has satisfactorily commenced trading with more than 70 per cent of Alice Springs entities that had previously provided it with goods and services,\" it said.ShareAs one of only five major garnet mines in the word, Harts Range had the world's largest alluvial deposit of garnet. Supplied: Australian Abrasive Minerals According to Mr Goyal, it is quite common for businesses to go into administration, and then continue operating after restructuring. \"It does have some commercial scar tissue by doing that, because the last thing you want to do is to go into administration,\" he said.\"But sometimes the only way to get some breathing space is for someone independent to come in, work out what's happened [and] work out what they can afford to pay back to creditors.\"The administration process is used to cut out what you don't need and come back stronger, and try to give creditors something back, rather than just shutting it down and losing jobs.\"However, Mr Morton said with a number of mining projects due to come online in Central Australia in the near future, he would like to see government safeguards put in place to ensure something similar does not happen again. He said he wrote to NT Minister for Primary Industry and Resources Ken Vowles about his situation, but was told as the issue relates to a commercial arrangement there was nothing the NT Government could do.\"Mining companies in and around Alice should be supporting the local networks and businesses, [but] I feel like there was no support there for us at all, we were left on our own,\" Mr Morton said. \"There needs to be a government step in between to safeguard local businesses for this potential hazard.\"Who is to say it's not going to happen again, there's no guarantees [and] mining is a high-risk business.\" Mr Vowles issued a statement to the ABC which said no government can guarantee a business will not go into administration, in any sector, mining or otherwise.\"I would strongly encourage any business or individual who believes they are owed money to seek independent legal advice as to their rights and their individual circumstances\" the statement read.\"Mining Management Plans govern each operational site in the Northern Territory and include a requirement for every operator to pay a security to Government.\"This ensures money will always be available to fund rectification or rehabilitation works in the circumstances where a mine site is affected by insolvency.\"Australian country towns riding the highs and lows of the mining industry. delivered to your inbox\nSubscribeMore informationNewsletter Podcasts RSSAustralian woolgrowers have gone against their research body's recommendation, ushering in a 1.5 per cent levy in what was the closest vote in the poll's history.The Australian Government pursues India over export subsidies that have led to a plunge in global sugar prices.Commercial fishers say a Queensland Government plan for 'real time' tracking devices is a case of 'Big Brother gone too far'.A proposed onshore abalone farm on Victoria's south-west coast has residents concerned about the size and location of the development. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.AEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)"}