{"id": "Suicide bomber kills 15 at polling booth during deadly Afghanistan election", "paragraph": "\n        Posted \n    \n      October 21, 2018 07:59:55\n    \nA suicide bomber has killed at least 15 people in the Afghan capital Kabul as voting concluded in parliamentary elections overshadowed by the threat of violence from the Taliban. There was no immediate claim of responsibility for the bombing, which appeared to have been the most serious of a day marked by a series of smaller-scale attacks. There were 28 fatalities across the country, according to Afghan officials.Voting should have been concluded by the time the suicide bomber struck a polling station in the north of Kabul, killing 10 civilians and five police, but polling stations were kept open longer than normal to cope with large numbers of people who had been unable to cast ballots. In the days leading to the vote, Taliban militants issued a series of statements telling people not to take part in what they considered a foreign-imposed process and warning election centres may be attacked.Security officials said there were more than 120 hand grenade or improvised explosives attacks. They said many did not target voting centres but were aimed nearby, apparently with the aim of frightening voters away rather than causing casualties.In Baghlan province in northern Afghanistan, men and women created human chains around six polling stations to prevent the entry of suicide bombers. Afghanistan's political scene is still tainted by the aftermath of a disputed presidential vote in 2014 that forced the two main rival groupings to form an unstable partnership. Both sides were accused of massive electoral cheating.But high turnout, at least in the major cities, reflected strong support for the process in the face of threats from militant attacks and widespread disillusion with a corrupt political class.\"I want candidates to serve the country and hear the voices of the disabled and the poor,\" said Abdullah, a voter from Herat who uses a wheelchair.\"People ask what difference one person's vote will make but I say, if a million disabled people come out to vote, don't you think that will make a difference?\"Turnout was higher than expected, with long lines forming outside polling centres in the main cities, but many voters were forced to endure extended waits because of technical and organisational problems.\"People's enthusiasm and participation despite threats, intimidation and attacks by militants must be lauded today,\" said one senior international security official.\"The electioneering process will require close scrutiny as it is clear that there were multiple failures.\" Untested biometric voter-registration equipment, rushed in at the last minute to counter voter fraud, caused particular problems. The Transparent Election Foundation of Afghanistan, a civil action group, said the devices suffered malfunctions in more than 40 per cent of polling centres.\"The biggest problem is with the biometric machines, there are some sites where they're not working and a lot of voters have been discouraged and have gone home,\" said Nasibullah Sayedi, a voter in the western city of Herat.Numerous allegations of voter fraud have presented a challenge to the legitimacy of the process, seen by Afghanistan's international partners as a vital step ahead of more important presidential elections next year.Due to the difficulty of collecting and collating results across Afghanistan, the overall results will not be known for at least two weeks.Some 8.8 million voters have been registered but an unknown number, by some estimates as many as 50 per cent or more, are believed to be fraudulently or incorrectly registered.Under the constitution, parliament reviews and ratifies laws but has little real power.Voting was postponed for a week in Kandahar province after the assassination of the powerful local police chief General Abdul Razeq. The ballot was also delayed in Ghazni province by arguments about the representation of different ethnic groups. Reuters/ABC\nTopics:\nelections,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tcorruption,\n\n\n\t\n\tworld-politics,\n\n\n\t\n\tunrest-conflict-and-war,\n\n\n\t\n\tterrorism,\n\n\n\t\n\tafghanistan\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}