{"id": "FFA Cup final: Adelaide United beats Sydney FC 2-1 thanks to Craig Goodwin's stunning goals", "paragraph": "\n        Posted \n    \n      October 31, 2018 07:44:56\n    \nAdelaide United hero Craig Goodwin says he has lived a dream with a stunning brace that delivered the Reds the FFA Cup with a 2-1 victory against Sydney FC at Hindmarsh Stadium. Goodwin produced a top-shelf double in last night's final in Adelaide as United became the first club to win the cup twice.Goodwin spectacularly continued his rich run of form — he scored five goals in the tournament and also netted in the A-League last Friday night.\"I'm really happy for the team and for myself,\" Goodwin said.\"Obviously to score two goals at home in the cup final is the kind of thing that you dream about.\"But for the team, it's a credit to our hard work … massive credit to the team.\" The 26-year-old rejected Sydney FC overtures in favour of returning to his birth city after spending the past two seasons in Holland.\"That is why we tried to sign him,\" Sydney coach Steve Corica said.\"In the end, that is what it came down to — two cracking goals from Goodwin.\"The Adelaide winger slotted a screaming free kick in the 25th minute to wow the parochial 14,448-strong Adelaide crowd.And after Sydney's Adam le Fondre equalised with a penalty three minutes later, Goodwin sealed the win with a crunching first-time volley in the 74th minute — which he rated the better goal, as it came from his non-preferred foot. Goodwin's feats, and feet, helped Adelaide turn the tables on Sydney from last year when the Sky Blues beat the Reds 2-1 in the decider.His initial goal came from the sweetest of free kicks from 24 metres out: struck with perfect timing and placement, the ball curled into the top right corner. But Adelaide's joy was short-lived — two minutes, to be precise.In the 27th minute, a blunder from Reds defender Jordan Elsey gifted Sydney an equaliser — he feebly played a back pass intended for keeper Paul Izzo but the dribbling effort played in Sydney captain Alex Brosque.Brosque took a touch away from the charging Izzo, who felled the striker with le Fondre converting from the spot — his third goal in as many games for the Sky Blues.In the 53rd minute, Goodwin almost repeated his first goal: aiming from close to 30m out, he thumped a left-footed blast which narrowly missed the target.But just 21 minutes later, Goodwin secured his status as Adelaide's hero with the cup-winner.After being set-up by teammate Ben Halloran, Goodwin smacked a right-footed volley into the side netting from about a dozen metres for the Reds to follow their 2014 cup triumph. AAP\nTopics:\na-league,\n\n\n\t\n\tsoccer,\n\n\n\t\n\tsport,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tsa,\n\n\n\t\n\tsydney-2000,\n\n\n\t\n\tnsw,\n\n\n\t\n\taustralia\n\n\n\n  More\n stories from South Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}