{"id": "Michelle Obama 'stopped even trying to smile' at Donald Trump inauguration", "paragraph": "\n      Updated \n    \n      November 13, 2018 12:28:48\n    \nFormer US first lady Michelle Obama says she was so disappointed by the election of Donald Trump that she \"stopped even trying to smile\" at his presidential inauguration ceremony. Ms Obama, whose husband Barack served two terms as president from 2009 to 2017, makes the revelation in her new book, Becoming, which comes out on Tuesday in the US.In it she reveals her disappointment at Mr Trump's victory over Democratic candidate Hillary Clinton in the 2016 presidential race.\"The vibrant diversity of the two previous administrations was gone,\" Ms Obama says in audio of the book released by the American ABC network.\"Someone from Barack's administration might have said that the optics there were bad, that what the public saw didn't reflect the President's reality or ideals, but in this case, maybe it did.\"Realising it, I made my own optic adjustment. I stopped even trying to smile.\" Ms Obama also said she would \"never forgive\" Mr Trump for casting doubt over her husband's citizenship.Mr Trump had been an outspoken promoter of the \"birther\" conspiracy that Mr Obama was born outside the US and therefore ineligible to be president.Ms Obama said Mr Trump's comments had put her family in danger.\"What if someone with an unstable mind loaded a gun and drove to Washington?\" she says in audio of the book.\"What if that person went looking for our girls?\"Donald Trump, with his loud and reckless innuendos, was putting my family's safety at risk. And for this, I'd never forgive him.\"Mr Trump responded to the criticism, accusing Ms Obama of trying to drive book sales with \"controversy\".\"She got paid a lot of money to write a book and they always insist that you come up with controversy,\" Mr Trump said.\"I'll give you a little controversy back, I'll never forgive [Mr Obama] for what he did to our US military. It was depleted … and I had to fix it.\"\nTopics:\nworld-politics,\n\n\n\t\n\tunited-states\n\n    First posted \n    \n      November 13, 2018 08:45:39\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}