{"id": "Westpac's $35m responsible lending law settlement with ASIC rejected by judge", "paragraph": "\n      Updated \n    \n      November 13, 2018 14:21:29\n    \nIn an extraordinary move, the Federal Court has refused to approve a $35 million penalty for Westpac, despite the bank admitting it broke responsible lending laws. The penalty was a negotiated settlement between Westpac and the Australian Securities and Investments Commission (ASIC).However, in a highly critical judgment, Justice Nye Perram said \"admirable ingenuity had been applied\" by ASIC and Westpac's lawyers to \"gloss over the the very real differences which exist between them\" on the interpretation of this part of the National Consumer Credit Protection Act.\"Because the parties do not actually agree on what section 128 [of the Act] requires, they are unable to agree on how many of the respondent's loans were made in contravention of it,\" he noted.\"This also makes it very difficult to judge the appropriateness of the proposed penalty of $35 million.\"Westpac admitted its automated loan approval system used the Household Expenditure Measure (HEM) — a relatively low estimate of basic living expenses — to calculate potential borrowers' living costs.The bank used the HEM instead of actually evaluating the customers' declared living expenses, and admitted this practice breached the National Consumer Credit Protection Act in certain circumstances. However, there is a seemingly irreconcilable difference of opinion between ASIC and Westpac over when use of the HEM breaches the law.Out of 261,987 loans that were approved using the HEM benchmark, 211,937 involved customers declaring expenses that were lower than the HEM — that is below the typical household's spending on basic goods and services, and in the bottom 25 per cent of household spending on less essential items.In these cases, use of the HEM actually reduced the amount of money the customer could borrow compared to what they declared.In the roughly 50,000 cases where declared living expenses were higher than the HEM, use of the benchmark increased the loan amount the customer could receive.However, in about 45,000 of these cases, both ASIC and Westpac agreed the use of the customers' actual expenses rather than the HEM would have had no impact on whether they were deemed suitable for the loan.That left 5,041 loans approved using the HEM that may not have been if actual declared expenses were used — they would have been referred to manual credit assessment instead.This meant some of those customers might be approved for home loans they potentially could not afford to repay without financial hardship.However, Justice Perram said neither party could explain what would have happened after that manual loan assessment process, whether any of these 5,041 loans were actually unsuitable and whether any significant harm has been done to any or all of those customers. \"How can the court be expected to assess the reasonableness of the proposed penalty if it is left in the dark about what the actual problem is?\" he asked.Even though ASIC and Westpac agreed the approval of the 5,041 loans was unlawful, Justice Perram said that was not enough to approve the settlement.\"The declaration does not provide any information about when the use of the HEM benchmark instead of the customers' declared living expenses is permitted and when it is not,\" he observed.\"As the parties plainly intended, this is precisely the question the declaration does not answer.\"It is unworkable to assess the reasonableness of the penalty if it is not known what is to be penalised.\"ASIC launched the case in March last year, using seven case studies to demonstrate the bank's use of the lower HEM benchmark rather than a customer's higher declared living expenses.The ASIC action also alleged that Westpac did not properly assess whether interest-only borrowers could continue to afford their mortgage without financial hardship when the interest-only period ended and principal and interest payments had to be made.The switch-over to principal and interest can add as much as 40 per cent to the monthly repayments on a mortgage.Westpac admitted using incorrect interest-only loan repayment calculations on a further 50,000 loans.The court's decision to reject a settlement — reached by the consent of both parties — is a \"rare\" occurrence, corporate law expert Professor Ian Ramsay said.He also said it greatly reduces ASIC's bargaining power, and might embolden Westpac to negotiate a lower penalty.\"That of course would be understandable given what the court said today, which is 'I have not been given evidence of where there were clear contraventions of the law'.\"But Professor Ramsay believes the most likely outcome will be the regulator and bank striking a new deal which identifies more clearly how Westpac broke the law.\"I suspect both parties have an interest in settling this to avoid a high profile and no doubt expensive court hearing,\" he said.ASIC's spokesperson said the regulator is \"reviewing the judgment and will make no further comment at this stage\".The court has adjourned the matter for a directions hearing on November 27.\nTopics:\nbanking,\n\n\n\t\n\thousing-industry,\n\n\n\t\n\tfraud-and-corporate-crime,\n\n\n\t\n\troyal-commissions,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      November 13, 2018 09:52:23\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}