{"id": "Invictus Games Sydney 2018Prince Harry and Meghan's wedding gospel to perform at Invictus Games closing ceremony ", "paragraph": "\n      Updated \n    \n      October 27, 2018 23:40:19\n    \nThe Gospel choir who made international headlines after singing \"Stand By Me\" at Prince Harry and Meghan's wedding are preparing to perform in front of the Royal couple again.The Kingdom Choir are on the bill for Saturday night's Invictus Games closing ceremony, which will be held at Sydney Olympic Park.Their rendition of Ben E King's 1961 soul classic at the Royal wedding in St George's Chapel at Windsor Castle was a highlight of the nuptials. Choir director Karen Gibson said she was excited about performing in Sydney.\"We are all still pinching ourselves and asking ourselves what's really happening here, is this real?\" Ms Gibson said.\"It means so much to be able to perform before them men and women who've been through so much.\"I really commend them for the tenacity and bravery and courage.\"Ms Gibson said she \"loved what the Invictus Games\" stood for.\"It will mean an awful lot to be able to gift them with a song,\" she said. The Kingdom Choir formed in 1995, rehearsing every other Monday in Ms Gibson's front room.Many of the original members have left, but Ms Gibson said the new singers had preserved the group's \"heart and spirit\".Performing for the Duke and Duchess of Sussex at their May wedding was a life-changing opportunity for Ms Gibson. The choir director workshopped the performance of \"Stand By Me\" with the Royal couple.\"They were very hands-on with the arrangement and how they wanted it to be sung which was great,\" she said. \"But being Gospel practitioners, we wanted to give it the full Gospel treatment, but they had other ideas.\"They wanted it more stripped back and a bit more reflective which actually in the end worked out to be completely right for the wedding, for the tone of the day, you know, they had it spot on.\"The Kingdom Choir will return to Australia in August to perform at the Sydney Opera House.\nTopics:\nroyal-and-imperial-matters,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\tmusic,\n\n\n\t\n\tarts-and-entertainment,\n\n\n\t\n\tsport,\n\n\n\t\n\tsports-organisations,\n\n\n\t\n\tdisabilities,\n\n\n\t\n\tsydney-2000\n\n    First posted \n    \n      October 25, 2018 10:43:12\n    \n\n\n\n  More\n stories from New South Wales\n\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}