{"id": "How mindfulness can help busy parents cope with information overload", "paragraph": "\n        Posted \n    \n      November 18, 2018 09:17:04\n    \nBeing a modern parent has plenty of demands and time constraints that can cause stress and tension build up. It may be sleep deprivation from children waking up in the middle of the night, or fatigue from spending hours driving between weekend sport.Meanwhile, there are lunchboxes to be packed, homework to be done, dishes to be washed.In the face of all this, some parents are turning to mindfulness and meditation to reduce stress, get a better night's sleep and be a better listener for their children. They say mindfulness has helped them encourage a happier and calmer home.\"I don't want to make it sound like I'm the Dalai Lama,\" jokes radio host and comedian Jo Stanley as she talks about her mindfulness routine. Between busy media engagements and taking care of her kids, she is never going to have the dedication of a Buddhist monk.But in an everyday context she uses mindfulness to bring a sense of calm to her domestic life and to better connect with her daughter, Willow.This is often something as simple as making sure her full attention is turned to Willow when they spend time together after school.But she says there are plenty of opportunities for mindfulness throughout the daily routine.\"[For example] I hate cooking dinner,\" Ms Stanley says.\"But then I'm like, 'OK, lets actually mindfully engage with the practice of it' and I listen to the sound of the knife on the chopping board as I'm cutting onions.\"I think there are really beautiful moments of mindfulness in your day to day activities that can really slow down and change the perspective.\"Parenting author and educator Maggie Dent believes one of the benefits of practising mindfulness in this way is that it becomes a form of \"role-modelling\" for children. Ms Dent says something as simple as pausing and taking three deep breaths as a calming exercise will ease the stress of the daily routine.Another suggestion is to use mindfulness to help to quiet the frenetic thoughts from a busy day and aim for a good night's sleep. She says doing small mindfulness activities throughout the day will encourage children to mimic this behaviour and make them happier and calmer.\"We are incredibly influential,\" she says.\"When we prioritise taking care of us, we are showing our children that we matter.\"This is something Ms Stanley has experienced first hand, with Willow occasionally offering her own mindfulness suggestions.\"She once told me off for swearing, and then she said 'Mummy, your monkey mind has taken control,'\" she says.\"Then she took me through the breathing exercise that they do at school to calm their monkey mind and take them from one side of the rainbow over to the good side of the rainbow.\"Ms Dent says learning how to be more grounded has become especially useful as the pace of modern life speeds up. The key for parents of young children, Ms Dent says, is to stop trying to do too much and to incorporate \"small pockets\" of mindfulness throughout family life.\"There's almost too much information, there's too much stimuli, too much pressure, and then all of those things together make us become ungrounded,\" she says. \"So mindfulness brings us back into this moment, into our body and into what is really happening.\"\"A house that is more mindful will be a more loving and fun place - and isn't that what we all want?\"For Jo Stanley, her practice emerged as a response to the stress of Willow being in intensive care as a newborn.She says the mindfulness techniques she used to stay calm during that difficult period have since transferred to the home and her relationship with her daughter. \"It is just a calmer space, we have a language that is calm and gentle,\" she says.\"The stillness is really beautiful between us. \"It just informs everything else you do. And it probably makes mummy a nicer person.\"The ABC has teamed up with Smiling Mind and former Sydney Swans captain Brett Kirk to look at how mindfulness can help parents and children in the home.Here are a few simple exercises you can try each day:Focus on your breathing: Take three long breaths more often and create a sense of calm in your mind and in your home with this meditation.Pay attention to the small moments: Listening can be hard, especially when we're busy and distracted, so this meditation will help you learn how to focus your attention and really listen.Aim for more sleep: Get ready for a good night's sleep by closing all your open brain tabs with this meditation.Learn more about how to include mindfulness in your day with the new ABC podcast Mindfully. Subscribe on the ABC Listen app or wherever you find your favourite podcasts.\nTopics:\nparenting,\n\n\n\t\n\thouse-and-home,\n\n\n\t\n\tmeditation-and-prayer,\n\n\n\t\n\tsydney-2000\n\n\n\n  More\n stories from New South Wales\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}