{"id": "Cactus blooms forecast rain for central Queensland properties", "paragraph": "\n        Posted \n    \n      October 21, 2018 08:52:58\n    \nEmerald resident Bill Lane believes his cactus lets him know when and how much rain is coming.His parents, Bill and Mary Lane, had a rain-predicting cactus on their property in Springsure for approximately 20 years. \"Theirs was growing for many years and they claimed when it budded and flowered, rain was on its way,\" Mr Lane said.\"Mum always called it the rain cactus — it was her forecaster.\"Four years ago, when Mr Lane's mother passed away and his father moved into town, they had to cut down the five-metre cactus as it was in the way of powerlines.Mr Lane took a clipping from what was left of his parents' cactus and planted it on his property in Emerald.A recent example of this phenomena was during a spring thunderstorm that rolled around Emerald in mid-October. \"About three weeks ago we only had a little rain and we only got one bud on it. Next time we got 75mm and there were four or five buds on it,\" Mr Lane said.He posted the flowering cactus on the Facebook page Who Got the Rain? and commenters agreed the more buds, the more rain.\"The bigger the bloom, the bigger the rain event,\" Owen Lowien from Kilcoy commented. Mr Lane believed the cactus was especially responsive to the weather because it was living like a true cactus in regional Queensland. \"It sits out there and gets no maintenance whatsoever, only gets something when it rains,\" he said.The trusty cactus has been a great addition to Mr Lane's property, however he has never stopped to ask what kind of cactus it is.  Horticulturist Tom Wyatt said Mr Lane's plant looked like a cereus cactus.\"This is a true cactus. It doesn't grow a leaf anywhere, just those big beautiful flowers that the native honey bees love,\" Mr Wyatt said.While Mr Wyatt was sceptical that this cactus would be able to accurately predict when rain was coming and how much, he did conclude that cacti in dry regions were more responsive to weather events because they relied on these circumstances to germinate.\"It's probably not uncommon when drought breaks that the plant comes into bloom,\" Mr Wyatt said.\"It makes the most of catching all the soil moisture with the new fresh seeds.\"The cereus cactus throws its flowers to germinate and spreads its seed by attracting bees, ants and night-crawling bugs like the hawk moth. \"That cereus cactus will only open at night, so there's the chance to pollenate at night with the hawk moths, ants or beetles,\" he said.Mr Wyatt said buds developed from damaged areas on the cactus base.\"If that was to get injured by an insect and it forms a dormant bud, all of those [cactus flowers] are injuries from the base of that plant,\" he said.Bill Lane was hopeful this wet season will deliver good falls of rain and the presence of wildlife in his backyard was keeping that hope alive.\"We've got the snakes, cacti and dollar birds so, despite the El Nino, it seems like we'll get a bit of a season.\" \nTopics:\nrainfall,\n\n\n\t\n\tsucculent-cactus,\n\n\n\t\n\trural,\n\n\n\t\n\tweather,\n\n\n\t\n\temerald-4720,\n\n\n\t\n\tspringsure-4722\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}