{"id": "Intense fighting erupts on Israel-Gaza border after botched raid", "paragraph": "\n      Updated \n    \n      November 13, 2018 18:49:05\n    \nPalestinian militants have bombarded southern Israel with dozens of rockets, killing a man and critically injuring a woman after their apartment building was hit in what appears to be the most intense fighting since the 2014 war. Israeli medical services reported that the two were trapped in an apartment in Ashkelon that was struck by a rocket from Gaza early on Tuesday.  It followed the deaths of at least three people, including two Palestinian militants who were killed by Israeli fire. Another nine people were wounded in the attack.In Israel, the national rescue service said at least seven people were wounded, including a 19-year-old man who was in a critical condition.The renewed hostilities have cast a new cloud over efforts by Egypt, Qatar and the United Nations to broker a long-term ceasefire between Israel and Hamas, the dominant armed group in Gaza.The two enemies have fought three wars in the past decade. On Sunday, Israeli Prime Minister Benjamin Netanyahu said he hoped to reach an \"arrangement\" that would avoid another conflict and ease Israeli-blockaded Gaza's economic hardships. In southern Israel, interceptor missiles streaked through the sky and sirens sounded during what the military said were more than 370 rocket salvoes from Gaza since Monday afternoon.The frontier had been quiet earlier in the day after a botched Israeli undercover operation in the Gaza Strip led to fighting that killed a Hamas commander, six other Palestinian militants and an Israeli colonel.\"In response to yesterday's crime, the joint command of Palestinian factions announce the beginning of bombardment of the enemy's settlements with scores of rockets,\" Hamas's armed wing said in a statement after funerals were held for the militants.Late on Sunday, Palestinians fired 17 rockets into southern Israel in response to the Israeli incursion and air strikes, which Hamas said were intended to cover the retreat of a car used by the Israeli troops. There were no reports of injuries or damage in Israel in the incidents on Sunday, but the military said a lieutenant-colonel, identified only as \"M\", had been killed in the raid and another officer wounded.Violence has flared regularly along the Israel-Gaza border since Palestinians began protests on March 30 to demand rights to land lost to Israel in the 1948 war of its creation. Israeli gunfire has killed more than 220 Palestinians since the start of the demonstrations, which have included breaches of Israel's border fence.Hamas said that during Sunday's fighting, assailants in a passing vehicle opened fire on a group of its armed men, killing one of its local commanders, Nour Baraka.A pursuit ensued and witnesses said Israeli aircraft fired more than 40 missiles into the area. Palestinian officials said that in addition to Baraka, five other Hamas men and a member of the Popular Resistance Committees were killed.In an apparent attempt to defuse tensions, Israel's chief military spokesman said the special forces had not been dispatched to assassinate Hamas commanders, a tactic that led to wider conflict in the past and which has largely been abandoned.Israeli media reports suggested the raid was mounted to gather intelligence.Reuters/AP\nTopics:\nunrest-conflict-and-war,\n\n\n\t\n\tworld-politics,\n\n\n\t\n\tpalestinian-territory-occupied,\n\n\n\t\n\tisrael\n\n    First posted \n    \n      November 13, 2018 07:16:47\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}