{"id": "Hidden by sea, Darwin's shipwrecks represent one of the largest heritage sites in Australia", "paragraph": "\n      Updated \n    \n      October 22, 2018 15:08:52\n    \nRick Trippe spends so much time under the sea, he barely flinches when a six to seven-foot shark swims within metres of him.The free diver was about eight metres below the surface when he saw the shark, near the site of a shipwreck that attracts schools of fish and their predators.Normally associated with danger, Darwin's ocean waters also contain historically significant shipwrecks, for those game enough to explore them when conditions are right.\"Another great day in paradise,\" Mr Trippe said as he left his home, speargun in hand, earlier that day.   The waves were choppy as he and a group of divers navigated north of Darwin to a shipwreck called the Bottlewasher, which now rests in two large, rusted pieces on the ocean floor.A build-up storm was brewing and the boat was rocking as the anchor was lowered into the wreck.\"There are some culverts, some fishing anchors and some other things that help fish hide, and bigger fish can come and eat them,\" Mr Trippe, also an experienced spearfisher, said. Other wrecks can be home to webs of abandoned fishing line or broken anchor ropes.\"That's why I usually carry two knives; one on my belt and one on my arm,\" he said.Finding the wreck involves guesswork: for minutes, four snorkels sat like reeds above the surface before the group found the site.  \"I usually go and follow the anchor down to the wreck, because quite often visibility here is not the best,\" Mr Trippe said.\"Three metres [of visibility] is not a bad day. Four metres is a good day, and last neaps we had eight metres which is like heaven.\" Each fortnight Mr Trippe explores wrecks during neap tides, where gentler tidal movements mean the murky water clears. \"You're in another planet down there, which is stunning,\" he said.  Two mechanical issues bring his latest expedition to an early end, but Mr Trippe is not the only person exploring mysterious objects on the sea floor.Maritime archaeologist David Steinberg describes the various wrecks as sunken museums.Scattered across the sea floor are remnants of a Japanese pearling ship, a telegraph cable that once ran to Java, and many large ships that sunk during the first bombing of Darwin.\"It actually constitutes the largest maritime archaeological site in Australia; one of the largest heritage sites in Australia,\" he said. \"We lost a lot of large ships that were in our harbour, and today divers dive those and it's really quite a remarkable resource.\"The Arafura Sea is relatively shallow compared to the steep drop-offs of some parts of the east coast, meaning wrecks at 20 metres or less are illuminated with dappled, natural light.Many were also partly salvaged by a Japanese company that, in many cases, removed the superstructures while leaving the ship floors and any cargo they contained behind.\"They were sticking out of the sea, above the water's surface — they were landmarks that people could see from the shore,\" Mr Steinberg said.\"But they were shipping hazards and people wanted them gone; it was like the scars of the war effort.\"  Diving these wrecks with groups of divers, Mr Steinberg sees them as important heritage items.\"It's a real opportunity to touch, to tangibly have an interaction with our past,\" he said.\"You see all these WWII motorbikes, gas masks, gun carriers and trucks; they were all destined for our Allied soldiers in Timor and in the war effort against the Japanese. \"They never made it there because they were sunk in the bombing. \"It's very poignant; it's quite a deep, strong connection with the past.\"\nTopics:\nhistory,\n\n\n\t\n\tworld-war-2,\n\n\n\t\n\tmaritime,\n\n\n\t\n\tpeople,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\toceans-and-reefs,\n\n\n\t\n\tdarwin-0800\n\n    First posted \n    \n      October 21, 2018 09:30:00\n    \n\n\nContact Jesse Thompson\n\n\n\n\n  More\n stories from Northern Territory\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}