{"id": "Iron Pot, a vital guide for sailors on the River Derwent, once took island life to the extreme", "paragraph": "\n        Posted \n    \n      November 13, 2018 07:30:40\n    \nThe Iron Pot — the lighthouse that shares its name with the island on which it sits — has guided sailors into the mouth of the River Derwent for almost 190 years.Built in 1832 on less than a half-hectare of sandstone, it was Tasmania's first lighthouse and only the second built in Australia.Famous nowadays as one of the final markers for competitors in the Sydney to Hobart yacht race, the Iron Pot warns of treacherous rocks below that wrecked several vessels in the early 1800s.Access to the small, craggy island is difficult. It makes it all the more extraordinary that it was once home to 15 people tasked with keeping the light burning to ensure ships safe passage. Historian Suzanne Smythe has written a book about the Iron Pot, and said life on the island was well documented due to keepers having to write to the marine board at least once a fortnight.\"We've got all their comments, whether it's on auroras or earthquakes,\" she said.Keepers lived on the island from when the lighthouse was built until it became automated in 1921.A two-storey house was built in 1885 to house Irishman James Parkinson and his large family; it was the third house on the island.Parkinson, who lived there for about 15 years and had seven children, wrote home to his family in Ireland about his Tasmanian life, and the letters have survived.The bottom floor of the lighthouse was used as a school, but as they grew older they had to row across to South Arm, where the family established a garden and grew vegetables to be self sufficient. Ms Smythe said records showed that Parkinson often made jam as a cheaper alternative to butter.\"He even won a prize in the exhibition in Melbourne in the 1880s for his jam,\" she said.Ships would deliver supplies to the various keepers, sometimes having to throw them from the boat.If the weather was bad, the island's inhabitants would be stranded; a storm in 1890 brought waves as high as the house.\"It was so bad that the water actually went through the foundations of the assistant keeper's house and the whole bottom floor of the bigger house was flooded,\" Ms Smythe said.During the storm the men stayed in the top of the lighthouse and kept the light burning, and the wives and children stayed on the top floor of the main house.\"The next morning they had to take the kelp down from the railing around the top of the light,\" Ms Smythe said.\"It must have been so scary.\"A happier time was when, in 1895, a baby was born on the island to the head keeper's wife. Ms Smythe said explorer Matthew Flinders noted in the late 1700s that the rocks in Storm Bay created magnetic variations that affected compasses.\"It's anything up to 20 degrees off if you're following a compass, so there were several boats wrecked,\" she said.It is not known why the island and lighthouse was named the Iron Pot.There have been several theories, such as the pot-like holes formed in the sandstone on the island.The lighthouse walls are 1.5 metres thick, and made from sandstone from the island. One theory is there was a whaling station there but Ms Smythe said that was unlikely.\"There was no wood, and you need wood for tri-stations to melt down the oil.\"Ms Smythe said the most likely reason for its name was that a whaler's pot filled with oil was burnt as a beacon.\"It was called Iron Pot island by the time James Kelly went past in 1816,\" she said.Its name was officially changed to the Derwent Light but it never really caught on.The Iron Pot is the oldest existing lighthouse tower in Australia and was the first to use kerosene as an illuminant and also the first to convert to solar power. The Iron Pot was something of a tourist attraction, with frequent boat visits running out to the island from 1848.Ms Smythe said the gothic-style weatherboard house was a drawcard.\"Parkinson says quite often on a Sunday people would visit,\" she said.\"Local ferries brought out about 400 people to have a sticky beak at it.\"When the lighthouse was automated the keepers were no longer needed, so authorities advertised the property for rent but there were no takers.The house was demolished and the materials were sold off. The derrick crane once used to get supplies on and off the island can still be seen.In 1977 the lighthouse was given back to the state government but was left in a state of disrepair for decades.Ms Smythe lobbied for maintenance work and in 2015 it was restored and painted.You can suggest something for us to investigate by filling out the information below. Go on, be Curious! \nTopics:\nhistory,\n\n\n\t\n\tmaritime,\n\n\n\t\n\toceans-and-reefs,\n\n\n\t\n\tpeople,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\thobart-7000\n\n\n\n  More\n stories from Tasmania\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}