{"id": "Rubbish upcycling program teaches young jobseekers life and worksite skills", "paragraph": "\n        Posted \n    \n      October 25, 2018 07:44:04\n    \nCale Lauritsen is 16 years old and already knows a lot about regional Queensland's high youth unemployment rate.The Townsville teenager dropped out of school earlier this year and said he spent several futile months looking for work. \"It's a real kick in the guts being told you can't get a job because of a trade or qualification that you don't have,\" Cale said.\"I was looking for construction and labouring jobs and it was just no help, you needed certificates, you need to get your QCE and everything.\" Cale was referred to Queensland Youth Service's Recycle Your Dreams initiative, a pilot program that offers young people at risk of long-term unemployment the chance to learn work skills while upcycling industrial waste into furniture.\"The ultimate aim is to find employment for young people … to help them overcome barriers to employment,\" Amanda Skinner, the social enterprise manager of Recycle Your Dreams, said.\"So a lot of our guys face issues such as homelessness, or substance misuse, family breakdown, and those sorts of things.\"Local businesses supply the workshop with industrial waste such as wooden pallets and motor oil drums that are upcycled into tables, chairs, and garden furniture by the students as they learn trade skills including carpentry and metalwork.They also offer the students work experience placements, which can become ongoing employment.\"We wanted a way for young people to engage with the community … particularly looking at sustainability and those sort of long-term goals,\" Ms Skinner said. Recycle Your Dreams is a two-year pilot program set up under a Department of Jobs and Small Business grant.Since it started in May 2017 the program has had five intakes of students; Ms Skinner said there was clearly a need for the program.\"We are getting referrals for 50 to 60 young people each intake and we can only take 15,\" Ms Skinner said.Sixteen-year-old Ky'eisha Murray started the Recycle Your Dreams program after she left school part way through Year 11.She said attending school became difficult due to bullying.\"I just didn't really want to go to school and then bullying led to fighting and there was just a lot going on,\" Ky'eisha said.Many of Recycle Your Dreams' students come to the program with substance addiction or mental health issues.Ms Skinner said, unlike most training programs, Recycle Your Dreams also connected students with counsellors and social services.\"Once they have started working through their issues they are really keen to get all of that stuff out of the way so they can keep moving forward,\" Ms Skinner said. Townsville's official youth unemployment rate sits at 17.7 per cent, above the Queensland average of 12.9 per cent (source ABS September 2018).Ms Skinner said the real figure was likely to be higher as many school leavers who were still living in the family home did not bother to register with Centrelink.\"So they are not classed as officially unemployed,\" Ms Skinner said.The city's youth crime problem was well documented and Cale Lauritsen saw a direct correlation between the tight job market and crime.\"There is no employment in Townsville at the moment and I think that is the reason that most of the kids are doing all the crime and whatnot — because there is no employment,\" he said. Recycle Your Dreams sells the upcycled furniture through a social media page: Chameleon Upcycled Products.The furniture is proving so popular they can barely keep up with demand.Ky'eisha Murray said it was a great affirmation to see the furniture being sold.\"It makes me feel proud of all the work that I have been doing with the rest of the students here,\" she said.\"We should be proud because they just bought something that we have created.\"\nTopics:\ntraining,\n\n\n\t\n\tunemployment,\n\n\n\t\n\tyouth,\n\n\n\t\n\ttownsville-4810,\n\n\n\t\n\tcurrajong-4812\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}