{"id": "I defended my daughter's right to get a haircut. This is what happened next", "paragraph": "\n        Posted \n    \n      November 13, 2018 10:24:50\n    \nShutting up is not something that comes naturally for me. Never has. After being on the receiving end of a very public \"slap down\", I have learnt how important it is to support people when they speak up.Yes, I'm \"that woman\" who took a barber shop in Sydney to court because he refused to run clippers through my 9-year-old daughter's undercut last year.For the record, he was kindly asked to not touch her bob cut and instead just tidy up a \"number two\" that was growing out. I brought a sex-discrimination claim to the Federal Circuit Court because his refusal was because she was a girl and he wanted his barbershop to remain a male-only space. I didn't ask for a style cut, nor did I sue him for damages. With swagger, attitude and a barber shop full of blokes laughing at us girls for not \"getting the message\", he insisted she could not have her hair clippered because she was a girl. Rather than speaking out to the press, I thought it was better the court process make a ruling. Some said it was trivial. But, as a mum, my job description has never been clearer. My awareness that I need to set an example, teach, challenge and protect my kids is acute. If as a parent I would jump in front of a moving train for my children, why the hell wouldn't I take this shameless discrimination further?Ultimately, the court-ordered mediation resulted in the barber publishing a statement welcoming my daughter back at any time to \"provide the same service to her as [he does] for other customers, regardless of gender\". Glad we cleared that up.But this is not about the clippers. Without warning, his story hit the media, naming me and my law firm. I very quickly felt the claws and beaks of bullies and trolls pecking and scraping at me, like vultures on a carcass.Channel 9 News reported my name and, within moments, my contact details were circulated through their Facebook pages, calling for a \"witch hunt\".These details were republished dozens of times, prompting thousands of comments about me, inciting hatred, several hundred emails of abuse, rape threats and death threats. By the end of the second day, I had asked three times for Channel 9 to stop publishing my contact details. My requests fell on deaf ears. Well into the second day of abuse and after two menacing voicemails, it took a call from the police to prompt Channel 9 into action and pull their Facebook stories down. But it was too late, my details were out there and were repeatedly shared.Now, I have a thick skin. In my other day job as a lawyer, I've had my fair share of people giving me a hard time. Pulling beers in a pub while at law school also taught me a thing or two about sticking up for myself. But this experience was different. I was shocked at how violent people were in \"slapping me down\" and wanting to put me in my place. I couldn't believe the deep and angry offence people felt that an educated, capable, independent woman, could take such a step to see our discrimination laws put to work. Laws which protect all of us and should be respected.Most surprising of all was how effective this public slap down was in trying to silence me. For a moment there, I went to ground, focused on the safety of my family, wouldn't talk to friends or socialise. I lost my mojo. I felt punched up. But in among the tsunami of vitriol, I received incredible support from friends, clients and people I've never met. One email from a stranger was so valuable: \"We don't seem to have had this discussion in the community for such a long time and I think people will learn so much about the law as a result — I do wonder if people have forgotten the steps that many women have taken over the years to bring about greater equality. I admire you that you have chosen to stand up for what you know is right.\"Then to hear about fellow mums from school I barely knew (now close friends), defending me on websites, while knowing better than to pick a fight with a troll. This support became so important.The hard work by so many before us to improve gender equality sits on a precipice.We are still nowhere near being able to tell our daughters that they can grow up confident in enjoying everything their male counterparts have with absolute equality, and safely for that matter. Violence against women, harassment, slut-shaming, pay disparity, the under-representation of women in politics, professional sport and management are just the tip of the iceberg.What I have learnt is that we need to throw our support behind those who speak out and find themselves at the back end of a social media dump truck.We have a very long way to go before we enjoy a world without discrimination on a daily basis. That path is not one to tread quietly.\nTopics:\nwomen,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tdiscrimination,\n\n\n\t\n\taustralia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}