{"id": "Lion Air crash prompts inspection of all Boeing 737 Max 8 planes in Indonesia", "paragraph": "\n        Posted \n    \n      October 31, 2018 08:50:14\n    \nIndonesia's Transport Ministry has ordered an inspection of all Boeing 737 MAX 8 planes in the country after a Lion Air plane plunged into the sea off Jakarta this week. Experts from Boeing are expected to arrive in Jakarta today to help determine why the plane crashed about 15 kilometres off the coast on Monday, killing all 189 people on board, Indonesia's National Transportation Safety Committee said.Relatives numbed by grief have provided samples for DNA tests to help identify victims, as accounts emerged of problems on the jet's previous flight including rapid descents that left travellers vomiting \"like in a roller coaster\".  Hundreds of rescue personnel searched seas where the plane crashed, sending more than three dozen body bags to identification experts, while the airline flew dozens of grieving relatives to the country's capital, Jakarta.The two-month-old jet plunged into the Java Sea just 13 minutes after taking off from an island off Sumatra. Its pilot requested clearance to return to the airport 2-3 minutes after take-off, indicating a problem, though the cause remains uncertain.Aircraft debris and personal belongings including ID cards, clothing and bags found scattered in the sea were spread out on tarps at a port in north Jakarta and sorted into evidence bags. The chief of the police's medical unit, Arthur Tampi, said it has received dozens of body parts for identification and is awaiting results of DNA tests, which were expected to take up to eight days.The disaster has reignited concerns about safety in Indonesia's fast-growing aviation industry, which was recently removed from European Union and US blacklists.Two passengers on the plane's previous flight from Bali to Jakarta on Sunday described issues that caused annoyance and alarm. Alon Soetanto told TVOne the plane dropped suddenly several times in the first few minutes of the flight.\"About three to eight minutes after it took off, I felt like the plane was losing power and unable to rise. That happened several times during the flight,\" he said. \"We felt like in a roller coaster. Some passengers began to panic and vomit.\"His account is consistent with data from flight-tracking sites that show erratic speed, altitude and direction in the minutes after the jet took off. A similar pattern is also seen in data pinged from Monday's fatal flight. Safety experts cautioned, however, that the data must be checked for accuracy against the plane's black boxes.Lion Air president Edward Sirait said there were reports of technical problems with the flight from Bali but they had been resolved in accordance with the plane manufacturer's procedures. The airline did not respond to requests to verify a document purporting to be a Lion Air maintenance report, dated Sunday, that described inaccurate airspeed and altitude readings after take-off. In a detailed post online, Indonesian TV presenter Conchita Caroline, who was on Sunday's flight, said boarding was delayed by more than an hour and when the plane was being towed, a technical problem forced it to return to its parking space.She said passengers sat in the cabin without air conditioning for at least 30 minutes listening to an \"unusual\" engine roar, while some children vomited from the overbearing heat, until staff faced with rising anger let them disembark.After the passengers waited on the tarmac for about 30 minutes, they were told to board again while an engine was checked.Caroline said she queried a staff member and received a defensive response.\"He just showed me the flight permit that he had signed and he said the problem had been settled,\" she said. \"He treated me like a passenger full of disturbing dramas even though what I was asking represented friends and confused tourists who didn't understand Indonesian.\" On Tuesday, distraught family members struggled to comprehend the sudden loss of loved ones in the crash of a new plane with experienced pilots in fine weather.Many went to a police hospital where authorities asked they provide medical and dental records and samples for DNA testing to help with identification of victims.Risko, who uses a single name, wept outside the building as he waited with relatives.\"My father was onboard but we still don't know. We're still hoping for the best because there hasn't been an official statement from Lion Air. So we're still hoping for the best,\" he said. AP\nTopics:\nair-transport,\n\n\n\t\n\tair-and-space,\n\n\n\t\n\taccidents,\n\n\n\t\n\tdisasters-and-accidents,\n\n\n\t\n\tindonesia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}