{"id": "Environment of trust helps Indigenous teens re-engage with education system", "paragraph": "\n        Posted \n    \n      October 25, 2018 07:22:59\n    \nA small Aboriginal community hall on the NSW south coast is home to a groundbreaking cultural mentorship program turning around the lives of disengaged Indigenous students.The program — Ngaramura, or \"see the way\" in the Dharawal language — is aiming to tackle head-on the statistics that show Aboriginal school students are suspended in numbers disproportionate to enrolment numbers.The Ngaramura program takes students who have been suspended from local high schools and places them in the care of elders at the Coomaditchie United Aboriginal Corporation in Port Kembla, ultimately encouraging them to re-engage with education.Funded by the Office of Prime Minister and Cabinet, the Ngaramura program is being carefully monitored by the University of Wollongong.Running over three years, if the Ngaramura program at Coomaditchie is measured to be a success, it could potentially be rolled out to more communities, for the benefit of Indigenous students around the country.Kicking off in May last year, 17 students have passed through the program so far, with 14 already returning to school and a couple moving into apprenticeships.Illawarra locals Kanisha and Zali are two of the participating students.\"In our previous suspensions both Kanisha and I would have stayed at home and done nothing,\" Zali said.\"In the Ngaramura program here at Coomaditchie, we've had the opportunity to learn about our culture, and understand who we are and where we've come from.\" Project coordinator Alyssa Kellam has established a strong and supportive relationship with five local high schools, working closely with principals to identify and accept Indigenous students who could benefit from the program.\"Often when the students arrive at Coomaditchie, it's difficult to see why they were suspended in the first place, as their attitude is already so much better,\" Ms Kellam said.\"We immediately engage the students with a daily routine, ensuring they're fed breakfast so that they can concentrate, receive one-on-one academic mentoring in the morning, and then perhaps most importantly introduced to cultural activities in the afternoon.\"At Coomaditchie two elders, Jerrinjah women Aunty Lorraine Brown and Aunty Narelle Thomas, are key to the success of the program. Every afternoon the two Aunts engage one-on-one with the students to impart cultural knowledge, including painting, cultivating bush tucker, and Indigenous heritage.\"We aim to build an environment of trust and support at Coomaditchie, while maintaining an ongoing relationship with the schools,\" Ms Kellam said.\"We share an agenda of change, hoping to return the students to the school environment with newfound confidence.\"University of Wollongong Australian Health Services Research Institute professor Kathleen Clapham is tracking the program with great interest.\"We're observing how the project is being rolled out, collecting stories from the kids, their parents, and the schools, so that other communities can learn from the experience,\" she said.Jamira Pemberton, one of the 17 students who have passed through the program, said as soon as she saw Coomaditchie she wanted to move in.\"You get one-on-one attention here and it's more like a family environment. Everyone knows each other and has got each other's back,\" she said.\"The most important thing I've been learning here is about my culture, and from Aunty Lorraine I've learnt about painting, including painting Dharawal creation stories. \"I've learnt about the land and the different environments, and also about the history of the missions.\"It's made me look at life completely differently, and that you have to stay focused and work for what you want.\"I've actually finished school, and now I'm doing a course at the South Coast Beauty Academy.\"Jamira's mother Kathy Pemberton has been amazed at the change she has seen in her daughter.\"I was worried when Jamira was at school. It looked like she was heading down the wrong road, and I was really concerned for her, but then when she came out here she turned into a completely different person,\" Ms Pemberton said.\"Jamira absolutely adores Aunty Lorraine and Aunty Narelle, loves listening to them talk about the area, about the heritage.\"The main thing is that now Jamira is very proud of her Aboriginal heritage, is a lot happier in herself, knowing where she belongs and where she came from.\"\nTopics:\nindigenous-aboriginal-and-torres-strait-islander,\n\n\n\t\n\teducation,\n\n\n\t\n\tindigenous-culture,\n\n\n\t\n\tkemblawarra-2505,\n\n\n\t\n\tuniversity-of-wollongong-2522,\n\n\n\t\n\tport-kembla-2505\n\n\n\n  More\n stories from New South Wales\nin your inbox each week\nSubscribeMore informationIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}