{"id": "Aboriginal death in custody inquest hears man died waiting for bail paperwork to be signed", "paragraph": "\n        Posted \n    \n      October 31, 2018 10:00:19\n    \nAn Aboriginal man who died after four hours in custody was not identified as being at risk of suicide despite self-harming, a coronial inquest in WA's Kimberley has heard.Mr Jackamarra, whose full name is withheld for cultural reasons, died at the Broome Regional Prison in December 2015 after appearing in court earlier that day.WARNING: Aboriginal and Torres Strait Islander readers are advised that the following article contains images of a person who has died.The 36-year-old had pleaded guilty to a number of charges and was granted bail but was placed in custody because his surety was not there to sign the necessary paperwork.The surety, his uncle, was working in a community several hours' drive away and by the time he got back to Broome to sign the papers, Mr Jackamarra was dead.On the first day of the inquest into Mr Jackamarra's death, the court heard from seven witnesses over eight hours.Former Serco custodial services officer Steven Jones told the inquest Mr Jackamarra had been in good spirits on the morning of the day he died, but his mood changed when he realised he would be placed in custody.\"He dropped like a bag of potatoes, emotionally speaking,\" Mr Jones said.\"Prior to that he was quite jovial.\"Mr Jones said he made several unsuccessful attempts to contact Mr Jackamarra's surety, but when that failed he took him to the court's holding cell.He later found Mr Jackamarra \"bashing his head against the wall\" of his cell before requesting to be transferred across the road to Broome Regional Prison.Mr Jones noted the behaviour in an internal online reporting system, along with concerns that Mr Jackamarra did not have medication with him for a mental illness.\"At that point every possible action was taken to get him over the road as soon as possible,\" Mr Jones said.Mr Jackamarra was taken to Broome Regional Prison within minutes, but staff at the prison were not told that he had been hitting his head against the wall.Shanna Wellstead, who was Serco client services manager on the day of Mr Jackamarra's death, told the inquest a report about the incoming prisoner was not emailed to the prison as was standard practice.Asked whether concerns about his self-harming behaviour and the lack of medication should have been raised directly with the prison via telephone, Ms Wellstead agreed.Mr Jackamarra was not identified as being at risk of suicide or self-harm by prison staff.He arrived at Broome Regional Prison at 11.40am and was found dead in a shower block at 2.15pm. Mr Jackamarra's aunty Rosina Wade said the family had waited three years for answers about her nephew's death.\"He was making baby steps, getting his licence and trying to get his own accommodation,\" she said.\"There is a lot of questions. \"We know for a fact that he had been in and out of prison and he knew he was only going to be in there for one night pending his bail conditions and his surety coming in the next morning.\"People need to be held accountable.\" Mr Jackamarra's brother Shaquille said the family knew little about the circumstances of his brother's death.\"We have waited three years and no answers have been told to us,\" he said.\"We don't know anything. We just know that he passed in the custody of Broome Prison after attending court that morning.\"We were shocked. Still today we are finding it hard to accept.\"Not-for-profit human rights law firm The National Justice Project is representing Mr Jackamarra's family at the inquest.Senior solicitor Emma Hearne said she hoped the inquest would help prevent more deaths in custody.\"It was a tragic loss of life, Mr Jackamarra had only been in custody for less than three hours [at the prison] when he passed away and he was due to be released on bail the next morning,\" she said.\"Even though three years have passed, the lack of answers for the family will mean that [the inquest] will be quite a difficult few days.\"\nTopics:\nindigenous-aboriginal-and-torres-strait-islander,\n\n\n\t\n\taboriginal,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tblack-deaths-in-custody,\n\n\n\t\n\tdeath,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tcourts-and-trials,\n\n\n\t\n\tindigenous-protocols,\n\n\n\t\n\tindigenous-policy,\n\n\n\t\n\tindigenous-culture,\n\n\n\t\n\tcrime-prevention,\n\n\n\t\n\tcrime,\n\n\n\t\n\tsuicide,\n\n\n\t\n\tmens-health,\n\n\n\t\n\tmental-health,\n\n\n\t\n\tbroome-6725,\n\n\n\t\n\tperth-6000,\n\n\n\t\n\tkarratha-6714,\n\n\n\t\n\tkununurra-6743,\n\n\n\t\n\tsydney-2000,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\tcanberra-2600,\n\n\n\t\n\tdarwin-0800,\n\n\n\t\n\talice-springs-0870\n\n\nContact Rhiannon Shine\n\n\n\n\n  More\n stories from Western Australia\nWhat have you always wondered about Canberra that you'd like an ABC reporter to investigate?If you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}