{"id": "Graziers in far-west NSW digging deeper into debt, and dams, to get out of droughtFeatured StoriesAdditional stories", "paragraph": "ShareABC Broken Hill\nBy\n Sara Tomevska\nShareGraziers are using the drought as an opportunity to improve their water storage facilities.ABC Broken Hill: Sara TomevskaGraziers in far-west New South Wales are using government loans to prepare their properties for the arrival of rain.It may seem counterintuitive to focus on water storage in the middle of a drought, but that is exactly what Richard Wilson, from Yalda Downs station, is doing. As he quite sensibly explains, \"the only time you can clean a dam is when there's no water in it\".The Wilsons have taken advantage of the State Government's low-interest Farm Innovation Fund loan to improve their property's water efficiency so when it does rain, their land will stay greener for longer.Having completely destocked, they have decided to forfeit short-term profits from selling wool and mutton to make a long-term investment.\"To de-silt a dam like this has taken eight days and cost roughly $25,000. It's a big investment, but long-term it's a very sound investment,\" Mr Wilson said.ShareMr Wilson says it took eight days and cost $25,000 to clean out 5 metres of silt from this dam.ABC Broken Hill: Sara TomevskaHe is calling on the Federal and State Governments to add water-specific projects like his to the collection of drought assistance loans.\"This dam won't need de-silting for another 50 years, so that's a capital cost of $500 per year,\" he said.\"When the next drought comes we'll have water for longer because we've made this move, and that'll have long-term benefits for the economy. This is a very sound investment for the government.\"Michelle and Jim O'Connor, who live on Milpa Station near Packsaddle, have also taken advantage of the fixed interest-rate Farm Innovation Fund to improve their property's water storage capacity and reticulation.Subscribe for the national headlines of the day.The O'Connors said the infrastructure projects they had undertaken had used the loans up in their entirety.\"We put in a pipeline between two bores, and that's exactly how much it cost,\" Ms O'Connor said.\"The bore we sunk the other day cost $88,000 … so by the time you do five of those, and you equip them with a pump and solar panels, it uses the loan up pretty quick.\"ShareIt may not look like much, but this bore extends 250 metres into the ground and cost $88,000.ABC Broken Hill: Sara TomevskaThe O'Connors said while there did not necessarily need to be more drought assistance loans, there should be better promotion of what graziers could achieve with existing funds.\"I don't think there's enough promotion of the Farm Innovation Fund, for example, which you can access anytime, not just in drought,\" Ms O'Connor said.\"By the time people realise what they can do with the money, it's often too late to help with the current drought … but I suppose it'll help with the next one.\" ShareThe O'Connors have sold about 70 per cent of their livestock due to the drought.ABC Broken Hill: Sara TomevskaA common thread for both grazing families is a desire not to borrow more money than they can conceivably repay once the drought breaks. \"Because we sold off stock, we've got money for the rest of this year,\" Ms O'Connor said.\"We also have money in farm management deposits, which I'm trying not to spend because come next year we won't make much money in wool and mutton.\"She estimates the decision to reduce livestock numbers will cost the family millions.\"With our numbers down, the wool clip will be down, we won't sell as many lambs, plus with the feed we'll have to buy … all of that would be at least a couple of million dollars,\" she said.Like the Wilsons, the O'Connors view the short-term sacrifice as an investment for the future.\"Our sons will continue on the land, so we'll do anything to make life a bit better for them in the future,\" Mr O'Connor said.The O'Connors have improved water infrastructure on their property by putting down five bores this year, installing a 22km pipeline to improve water distribution, and installing a desalination plant to process salty bore water. \"In my mind, these types of infrastructure projects are the only thing that can actually help in the long term,\" Mr O'Connor said.ShareJim and Michelle O'Connor are preparing their property for the next generation.ABC Broken Hill: Sara TomevskaMr Wilson said his family was in the minority of grazing families who had decided to use government assistance loans to improve their property rather than keep their stock alive.\n\n\n\n\n  \n\n\nMany farmers are struggling to find or buy feed to keep their stock alive. \n(Supplied: Edwina Robertson)\n\n\n\n\n\nWCMS.pluginCache.add('#lightbox-30', 'lightbox' , {\n\"id\": \"lightbox-30\"\n});\n\n\nMany farmers are struggling to find or buy feed to keep their stock alive.Billions of dollars has gone to farmers during the drought this year. But has the money been well spent? ABC Rural investigates.\"It can be a lot harder for other people who have been breeding stock for generations,\" he said.\"We made this decision last April when it looked like it wasn't going to rain, so this is a calculated risk for us.\"Mr Wilson said the investment in water storage and reticulation would safeguard Yalda Downs from the next drought. \"Once you get to the bottom of a dam like this and realise you've doubled your water storage capacity … I tell you what, it makes you want to crack open a bottle of champagne,\" he said.ShareMr Wilson excavated 5 metres of silt from this dam, doubling its water storage capacity.ABC Broken Hill: Sara TomevskaWith droughts forecast to be more frequent and severe in the future, water-optimising projects such as these could be the key to keeping graziers afloat and government loans at bay for longer.While the Wilsons and O'Connors are hoping rain comes soon, they are content with the knowledge they will be better prepared for when drought next strikes.delivered to your inbox\nSubscribeMore informationNewsletter Podcasts RSSAustralian woolgrowers have gone against their research body's recommendation, ushering in a 1.5 per cent levy in what was the closest vote in the poll's history.The Australian Government pursues India over export subsidies that have led to a plunge in global sugar prices.Commercial fishers say a Queensland Government plan for 'real time' tracking devices is a case of 'Big Brother gone too far'.A proposed onshore abalone farm on Victoria's south-west coast has residents concerned about the size and location of the development. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.AEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)"}