{"id": "Briton dies of rabies after being bitten by cat during trip to Morocco", "paragraph": "\n      Updated \n    \n      November 13, 2018 11:35:36\n    \nA UK resident who was bitten by a cat during a trip to Morocco has died of rabies, according to British health authorities. Public Health England (PHE) did not release further details, but warned people not to make contact with animals while travelling to countries where rabies is present.PHE said health workers and the victim's friends and family were being monitored and had been offered vaccinations.It said there was no risk to the wider community.The rabies virus, which is closely related to Australian bat lyssavirus, is particularly prevalent in bats, but also occurs in dogs, cats and monkeys overseas, according to Australia's Department of Health.It said symptoms could appear within several days of exposure to an infected animal, but could take years to emerge.The early symptoms are flu-like, including headache, fever and fatigue.The illness progresses rapidly to paralysis, delirium, convulsions and death, usually within a week or two of the onset of illness.Vaccination shortly after exposure can prevent the illness developing.PHE head of immunisations Mary Ramsay said the fatality in Morocco was an important reminder of the precautions people should take when travelling to countries where rabies is present. \"If you are bitten, scratched or licked by an animal you must wash the wound or site of exposure with plenty of soap and water and seek medical advice without delay,\" she said.\"There is no risk to the wider public in relation to this case but, as a precautionary measure, health workers and close contacts are being assessed and offered vaccination when necessary.\"Last year, more than 140 people who were bitten by bats in New South Wales were treated with a preventative course of vaccines to try to stop them contracting the Australian bat lyssavirus.\nTopics:\nhealth,\n\n\n\t\n\ttravel-health-and-safety,\n\n\n\t\n\tmorocco,\n\n\n\t\n\tunited-kingdom\n\n    First posted \n    \n      November 13, 2018 10:42:35\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}