{"id": "Donald Trump tours town destroyed by Californian wildfire, says disaster hasn't changed his opinion on climate change", "paragraph": "\n      Updated \n    \n      November 18, 2018 10:50:58\n    \nUS President Donald Trump says the devastation caused by California's deadliest bushfire has not changed his mind about climate change. The President was speaking as he visited the charred wreckage of the town of Paradise, which was destroyed by the Camp Fire blaze.Forensic recovery teams are searching for more victims in the devastated community in the Sierra foothills, 280 kilometres north of San Francisco.The number of people listed as missing in the fire is now more than 1,000, and authorities say at least 71 people are known to have died.Paradise was home to nearly 27,000 residents before it was largely incinerated by the blaze on the night of November 8.While touring the state, Mr Trump was asked whether the damage caused by the fire had changed his opinion about climate change. The President has long voiced scepticism about man's impact on the climate and has been reluctant to blame climate change for the increase in the frequency and intensity of natural disasters.\"No, no, I have a strong opinion. I want a great climate,\" Mr Trump told reporters during a briefing at a command centre in Chico, California.\"We're going to have that, and we're going to have forests that are very safe, because we can't go through this every year.\"We're going to have safe forests, and that's happening as we speak.\"Mr Trump pledged that improved forest management practices would diminish future risks. The declaration evoked his initial tweeted reaction to the fire, in which he seemed to blame local forestry officials and threatened to take away federal funding. \"We're going to have to work quickly. … Hopefully this is going to be the last of these because this was a really, really bad one,\" he said.\"I think everybody's seen the light and I don't think we'll have this again to this extent.\"The disaster already ranks among the deadliest US bushfires since the turn of the last century. Eighty-seven people perished in the Big Burn firestorm that swept the Northern Rockies in August 1910. Minnesota's Cloquet Fire in October 1918 killed 450 people.Authorities attribute the high death toll from the current fire to the speed with which flames raced through the town with little warning, driven by howling winds and fuelled by drought-affected scrub and trees. Besides the toll on human life, property losses from the blaze make it the most destructive in California history, posing the additional challenge of providing long-term shelter for many thousands of displaced residents.With more than 9,700 homes up in smoke, many refugees have taken up temporary residence with friends and family, while others have pitched tents or are camping out of their vehicles.At least 1,100 evacuees are being housed in 14 emergency shelters set up in churches, schools and community centres around the region, with a total of more than 47,000 people remaining under evacuation orders. AP/ABC\nTopics:\nbushfire,\n\n\n\t\n\tfires,\n\n\n\t\n\tdisasters-and-accidents,\n\n\n\t\n\tunited-states\n\n    First posted \n    \n      November 18, 2018 10:24:21\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}