{"id": "Royal Hobart Show to keep adapting to reach its 200th birthday and beyond", "paragraph": "\n      Updated \n    \n      October 21, 2018 08:24:49\n    \nOrganisers of the Royal Hobart Show plan to dramatically transform the site to ensure it can continue, including building a hotel and housing for hundreds of people. The Royal Hobart Show has been a feature of Tasmania's event calendar since 1822.Its 200th birthday is within sight but without a deal made in 2015 to lease some land to hardware chain Bunnings, reaching that milestone would have been out of the question.In fact, Royal Agricultural Show Society of Tasmania chief executive Scott Gadd said without the deal — worth several hundred thousand dollars annually — this year's 196th show would not be going ahead.\"We wouldn't be here,\" he said. \"We've been hit with some big costs in the last year — power costs, insurance costs and others — and if we hadn't done that Bunnings deal we would have had no capacity to meet them.\"The show will go on in 2018, but the duration has been reduced from four days to three. The Wednesday, which was traditionally the main day for school groups, has been dropped.It has been a tough year for shows in Tasmania. The Launceston Show was cancelled in December, then revived in a reduced format of just one day instead of three. The century-old Devonport Show was cancelled and a replacement Farm Festival also fell over. Mr Gadd said he was determined to prevent that happening in Hobart. \"We're going to have to get smarter about other income-generating activities,\" he said.\"So we're looking at tourism, we're looking at housing and we're looking at a much higher-utilised event precinct.\"The shed that houses Bunnings already overshadows the showground's now smaller central arena and there are plans in place to dramatically change the site further. A new exhibition pavilion will be built next to the Brooker Highway and the Tasmanian Planning Commission is considering a proposal for three more large retail spaces to be built next to Bunnings.Mr Gadd said longer-term plans included a three-and-a-half star hotel with river and mountain views and housing for hundreds in the area where homeless people were camping out earlier this year.\"We're very keen on a pathway-to-purchase model for housing, which means you're not just subsidising rent, you're actually assisting people into home ownership,\" he said. \"I'd like to see them all engaged in the stuff we do every weekend, like dog shows, cat shows.\"It would be a great little precinct.\" With those plans comes promises of preserving the 196-year-old show but shifting it away over the next decade from commercial elements like showbags, sideshows and rides. Mr Gadd said the commercial presence had already begun to dwindle, with a major show bag provider and a major ride operator deciding not to make the expensive journey from interstate for this year's show. \"The show, if we get our way, there'll be more emphasis on agriculture, more emphasis on food and fibre, entertainment, family fun,\" he said. \"And less of that commercial element that we've seen come in over the last four or five decades.\"The idea of reducing the commercial side is worrying for the Tasmanian Showmen's Guild, whose members deliver rides, sideshow games, food and showbags around the state. They rely on the Hobart Show as a major part of Tasmania's show circuit. The guild's president, Debbie Welch, said she hoped the Society would continue to see the value in commercial activities. \"You have to weigh up whether they would be viable once they lose the commercial side of it,\" she said.\"That's really up to them.\" Tasmanian Agricultural Shows, the umbrella body for the state's 22 shows, was more supportive of the idea of reducing the commercial element. President Simone Salter said traditional cake baking, boot throwing and big pumpkin competitions remained highlights of smaller rural shows like Huon and Bream Creek.\"That's where shows came from and that's where they were started, to get people together and to focus on agriculture and the improvements that could be made through technology and things like that,\" she said.\"Most of the smaller regional shows are doing really well and are really well supported by their communities — they seem to be thriving.\"I think taking it back to those basics is a really good idea.\"The Royal Hobart Show runs from Thursday to Saturday. \nTopics:\nevents,\n\n\n\t\n\tarts-and-entertainment,\n\n\n\t\n\thobart-7000,\n\n\n\t\n\ttas\n\n    First posted \n    \n      October 21, 2018 08:12:59\n    \n\n\n\n  More\n stories from Tasmania\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}