{"id": "Bitcoin turns 10, and we haven't seen the last of it", "paragraph": "\n        Posted \n    \n      November 05, 2018 10:23:37\n    \nA mysterious, anonymous entity known as \"Satoshi Nakamoto\" posted a white paper on October 31, 2008, entitled \"Bitcoin: A Peer-to-Peer Electronic Cash System\". It was the first time that the concept of Bitcoin entered the world.But outside of the cypherpunk mailing lists — those promoting the use of privacy-enhancing technology — this event was hardly noticed. Ten years on, who hasn't at least heard of the cryptocurrency?On just nine pages, the white paper explained how the Bitcoin system would work. Many attempts at electronic cash had already been made going right back to computer scientist David Chaum's \"Digicash\", developed in the 1980s. Using an intricate dance of cryptography, Digicash enabled people to pay each other online anonymously, yet prevented users from sending the same money to two different people at the same time (the so-called \"double-spending problem\").For a while, Digicash caught on. Even the likes of Deutsche Bank adopted it, and a growing list of merchants started accepting it. Compared to the credit-based systems of Visa, Mastercard and later Paypal, at least some people could see the benefits of a currency that allowed micropayments with extremely low transactions fees. Anyone with libertarian tendencies loved the idea of using a currency outside the control of any authority.But Visa and Mastercard upped their game and won the battle for payment dominance. It seemed the struggle was over, but some cypherpunks refused to give up. Adam Back created \"Hashcash\" in 1997, which together with Wei Dai's \"b-money\" (both cited in Nakamoto's white paper) and Nick Szabo's \"Bitgold\" were the last significant efforts to create an online cash system before Bitcoin. The idea fizzled out following the dotcom bust of 2000-02. It was only brought back to life by Nakamoto in 2008. Previous attempts came close to creating secure digital cash, but there was always one major problem they encountered: the need for a trusted third party like a bank to maintain the system in some way.Nakamoto's white paper solved this problem by distributing the process of maintaining a totally transparent public ledger (known as the blockchain) among a network of competing \"miners\". As long as one miner does not control more than half of the whole network of computing power, the system is secure. Cryptography, computer science, and now crucially an elaborate system of economic incentives all came together into a mind-blowing overall piece of ingenuity. The cypherpunk vision to enhance privacy, limit government power and increase its transparency had finally been realised.Or had it? If there was any lesson to be learnt from the failure of Digicash, it was that you could invent a brilliant system, but you had to convince people to use it, despite them never being able to come close to understanding how it actually works. With Bitcoin, we have seen extraordinary hype, with astronomical price booms and busts, and thousands of spin-off cryptocurrencies and private blockchains that are all just variations of the original.Ethereum is arguably one of the most significant spin-offs. It shows how blockchain technology can be combined with smart contracts, potentially providing a costless, decentralised way of replacing the colossal global army of trust-based service industries that conventional money relies on.There is, however, only one existing blockchain that is consistent with Nakamoto's vision: Bitcoin Cash, a so-called \"hard-fork\" of Bitcoin that generally shares the same history and protocol, except for two crucial details. The blocks on its chain are a massive 32-times larger than the original Bitcoin, and growing.More transactions per block means lower fees per transaction, paving the way for global adoption. Plus, built-in codes that were switched off in the original Bitcoin, have been reignited, potentially allowing all the smart contract capabilities of Ethereum. The white paper itself is not explicit about goals, but the main implicit aim is clear: to create a secure form of online cash that does not depend on a trusted third party. This has already been demonstrated as a concept. The only question that remains is, to what extent will it be adopted?A recent clue to that question may lie right in the heart of London's financial centre, Canary Wharf. Here, the Brewdog company recently launched a promotional event accepting Bitcoin Cash as payment. It is cheaper for them to process payments compared to credit cards, even allowing for the cost of them having to convert Bitcoin Cash back to pounds sterling.Recently, computer companies Newegg and Microsoft have also started accepting Bitcoin Cash as payment.Further afield, more and more developing countries like South Africa are experimenting enthusiastically with new apps that store Bitcoin Cash like Centbee, which may help people who can't open bank accounts. A new app developed in Spain called HandCashapp and an even bolder concept called The Money Button hint at a whole new paradigm of automatic click-based micropayments that could also spell the end of pop-up adds appearing on popular content online.Nakamoto's vision, in some sense, may have already been achieved, but will Bitcoin Cash permanently replace all fiat currencies and become one global money?The world wide web arrived in 1990, and you could argue it took a dramatic collapse and 20 years before its true commercial potential could be realised. In 2028, maybe it's not unfeasible that the technology underlying Bitcoin will do the same for global money and all trust-based financial, legal and other services.Jack Rogers is a senior lecturer in Economics at the University of Exeter. This article was first published at The Conversation.\nTopics:\ncomputers-and-technology,\n\n\n\t\n\tscience-and-technology,\n\n\n\t\n\taustralia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}