{"id": "Melbourne Cup punters are betting with bitcoin, and there's nothing anyone can do about it", "paragraph": "\n        Posted \n    \n      November 05, 2018 06:32:48\n    \nRacing season is about to hit its peak and, from Moree to Morphettville to Menangle to Moonee Valley, Australian races are attracting interest from international punters. And, of course, they are betting on the Melbourne Cup too.That doesn't seem unusual until you see the website they are using.It's called 1xBit, and its primary currency is bitcoin.Gambling with bitcoins is not allowed on Australian sites, but that doesn't mean Australian sports aren't attracting interest on the international cryptocurrency betting market.AFL, NRL, Super Netball, NBA, greyhounds and even suburban soccer matches can be found on bitcoin betting sites with links to countries like Estonia, Montenegro, Curacao and Cyprus. One site even uses a web address from the British Indian Ocean Territory — a collection of barely populated atolls midway between Sumatra and Madagascar.And it's this type of betting that is worrying those charged with keeping sport free of match-fixing.\"As the use of bitcoins and other cryptocurrencies in sports betting becomes more prevalent, then the risk of match-fixing is heightened,\" said sports lawyer and academic Catherine Ordway.Suspicious bets placed on unregulated offshore betting sites are already difficult for Australian authorities to monitor. When those bets are placed by bitcoin, they are virtually untraceable, because the online payment option provides near anonymity for its users. \"For those who don't want integrity officers to see their betting, bitcoin adds another cloak of secrecy to it,\" said Ray Murrihy, the retired chief steward of Racing NSW who is now on the board of Responsible Wagering Australia.\"With bitcoin, there's no access to the identities of the parties involved.\"It's very unlikely that the casual or weekend punter is going to be involved in this.\"It's usually people that seek to hide their identity for one reason or another … perhaps people who have access to inside information.\" But one punter who makes a living from betting on the bitcoin markets disagrees that only those with nefarious intentions gamble this way.The Australian man, based in south-east Asia, does however believe bitcoin and betting sites are a match made in heaven for fixers.\"It's definitely not an imagined threat,\" says the man, who blogs about bitcoin betting under the pseudonym Bitedge.\"Professional athletes are mostly tech and gambling savvy young men in a career that will stop paying within 10 years.\"The first time we find out about crypto match-fixing will not be the first or last time that it happens.\"One of the Australian competitions frequently featured on bitcoin betting sites is the AFL.During the season, you could bet on not only who would win but who would score the next goal as the game unfolded.Even using Australian dollars, that kind of betting is outlawed on local sites. But the league said it was powerless to take action.\"The AFL does not have the ability to restrict or stop their operations,\" league spokesman Patrick Keane said.\"The AFL has agreements with Australian-based wagering providers to enable us to track betting options around our sport, but we do not have those relationships beyond Australia.\" Racing Victoria said it was yet to approve any wagering operator to offer bitcoin betting.\"Any wagering activity must operate under an approved framework, and support product fees back to the industry,\" a spokesperson said.Earlier this year, the racing commission of the Northern Territory — where most of the country's online betting sites are registered — poured cold water on the plans of online bookmaker Neds to start a bitcoin gambling service. The commission told the ABC it did not approve sports bookmakers \"to receive and pay bets in cryptocurrency such as bitcoin, on the basis of legal advice that suggested that it would not be lawful to do so in the NT\".There are also questions over how effective match-fixing legislation will be against such activity being carried out via the bitcoin betting market.Ms Ordway said current Australian laws were not set up to deal with match-fixing specifically involving cryptocurrency sites.\"Australian laws don't specifically refer to bets placed on Australian sporting events using cryptocurrencies, from here or elsewhere, and it makes sense to review the laws to determine whether they should specifically refer to this new technology,\" she said.\"But an argument could certainly be made that any form of corruption of an Australian sporting event, or element of an event, that impacts on a gambling outcome is covered by the national policy [on match-fixing], and relevant state or territory laws.\"Mr Murrihy said it may take an incident of match-fixing on the bitcoin betting market to awaken sports and authorities to the threat.\"I think sometimes it takes a headline or an exposé to put people on the alert,\" he said.\"It's a difficult one. There's no real easy solutions, other than that sports need to be on tap with the intelligence agencies … and try to be alert to where this danger is.\"\nTopics:\ngambling,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tsport,\n\n\n\t\n\thorse-racing,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tcrime,\n\n\n\t\n\tfraud-and-corporate-crime,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\tvic,\n\n\n\t\n\tbritish-indian-ocean-territory\n\n\n\n  More\n stories from Victoria\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}