{"id": "Universal Medicine follower's daughter hopes jury verdict stops 'dangerous cult' recruitment", "paragraph": "\n      Updated \n    \n      November 05, 2018 12:53:42\n    \nA neuroscientist who tried in vain to claw back part of her mother's dying gift of $1.4 million to an unproven spiritual healer says she has been vindicated by a jury verdict that the breast cancer victim was exploited by a \"socially dangerous cult\". While Sarah McIntyre hopes the damning findings stop Universal Medicine (UM) founder Serge Benhayon from recruiting new followers, his group continues to charge breast cancer patients to attend \"healing retreats\" in a venue built with her mother's money.A leading Australian medical school also retains links to UM despite a Supreme Court jury in Sydney last month finding its leader is a \"charlatan who makes fraudulent medical claims\" and \"swindles cancer patients\". The University of Queensland medical faculty includes two associate lecturers and a health researcher who have endorsed UM, with the researcher — Christoph Schnelle — embroiled in an academic misconduct investigation that has run for more than six months. Mr Schnelle was Judith McIntyre's financial planner and one of a number of UM followers involved with her before she died in 2014.Others included her nurse, the witness to her will, the lawyer who drafted it and its executor.There is no suggestion that Mr Schnelle persuaded Mrs McIntyre to give money to Mr Benhayon.Sarah McIntyre and her brother Seth in 2015 unsuccessfully challenged the will, which left $600,000 — most of their mother's estate — to Mr Benhayon, in addition to $800,000 he received from Judith McIntyre a month before she died. Mr Benhayon is a former bankrupt tennis coach who claims to be the reincarnation of Leonardo da Vinci and turned UM into a $2-million-a-year business.His defamation lawsuit against a blogger backfired last month when a jury found 38 imputations to be true, including that he exercised \"undue influence\" on Judith McIntyre to inherit the bulk of her $1.1 million estate.Sarah McIntyre told the ABC from Sweden, where she researches neuroscience, that the verdict was \"vindicating because we felt we weren't able to make that argument ourselves\".\"We sought advice from two different law firms and both of them said they would not be willing to take the case if we tried to argue it was undue influence,\" she said.\"Basically the reason that they gave us is that it is extremely hard to prove.\"Instead their lawyers argued the $250,000 they each received did not adequately provide for them. The judge, who viewed a video interview with Judith McIntyre made by another UM follower before her death, disagreed.\"I don't want to seem ungrateful, I realise a lot of people have a lot less,\" Sarah McIntyre said. \"[But] Serge Benhayon has a lot of money already and he's just used this to enrich his cult.\"Even if he actually used the money for what my mother wanted, I don't think that was a good way for the money to be spent in the world. \"I don't think Universal Medicine is a good organisation.\"Mr Benhayon used $800,000 to build the \"Hall of Ageless Wisdom\" on one of his multimillion-dollar properties, where a $60-per-person \"breast cancer care retreat\" was held on Sunday. An organiser did not respond for comment.Distinguished medical professor John Dwyer, who gave expert testimony in the defamation case, said Judith McIntyre's donation was \"in good faith\" but had \"enabled Universal Medicine to spread its dangerous nonsense even further\".\"Here we have people whose view about cancer and breast cancer in particular is that it's caused by a lack of self-love, often compounded by sins in a previous life,\" he said. \"To think that that money's been used to promote such ideas and to call women together who may have had breast cancer, or who have a relative who's had breast cancer, and put forward these nonsense ideas is very unfortunate.\"Professor Dwyer said the court findings about UM should have been a \"catalyst in stirring [UQ] up and making them realise they were dealing with a serious situation\" in its medical faculty.\"Six months on and they're still investigating it? I've been in academic medicine all my life. It should've taken no more than a few weeks,\" he said.\"All of those associates of Universal Medicine who are trying to gather academic credibility for the program should be stopped from publishing in peer reviewed papers and spreading the message of Universal Medicine, which has been so obviously revealed to be a sham.\"If a university is any way supporting the spread of this pseudo-science, that's reprehensible.\"UQ pro-vice-chancellor of research Mark Blows said the investigation was \"nearing completion\". Health researcher Christoph Schnelle declined to comment. In September, the Supreme Court in Sydney heard Mr Benhayon taught followers their \"kidney energy\" could be harmed in their next life if their children misspent their inheritance, or if they set conditions on donations to Universal Medicine.Mr Benhayon said \"no comment\" and hung up when contacted by the ABC.Sarah McIntyre said she and her brother had \"moved on with our lives and we're not going to get that money and we've made our peace with that\".But she said she hoped \"more people know about it and that makes [Mr Benhayon's] life more difficult\".She sympathised with her mother's search for spirituality but found it \"incredibly frustrating\" as a scientist to see her fall under the sway of \"teachings that are not just false but nonsensical\".Her mother, who had studied and loved literature, dumped her entire book collection because it clashed with Mr Benhayon's teachings, and filled her house with his books, she said. She would switch off Sarah's music in the car and insisted her brother, a musician, spend her cash birthday gift on groceries instead of new drums because Mr Benhayon taught that non-UM music had negative energy, Ms McIntyre said.\"It's so easy to get drawn into these sorts of groups. \"They kind of hide the more weird and crazy aspects of the group when you're new to it and they present themselves as very reasonable,\" she said. \"But if you believe the teachings, you end up following a very strict set of rules, a very strict lifestyle, if you take that on. So my mother — the way she slept and what she ate and who she spent time with. \"It was really tough to see her changing so much as part of that group.\"\nTopics:\nlaw-crime-and-justice,\n\n\n\t\n\tcults,\n\n\n\t\n\treligion-and-beliefs,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tcourts-and-trials,\n\n\n\t\n\tpeople,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\tbrisbane-4000,\n\n\n\t\n\tqld,\n\n\n\t\n\taustralia,\n\n\n\t\n\tlismore-2480\n\n    First posted \n    \n      November 05, 2018 06:35:39\n    \n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}