{"id": "Couple found dead after Yosemite cliff plunge were taking a selfie, man's brother says", "paragraph": "\n      Updated \n    \n      October 31, 2018 20:23:38\n    \nA husband and wife who fell to their deaths from a popular lookout at Yosemite National Park in the United States were taking a selfie, the man's brother says. Park rangers recovered the bodies of Vishnu Viswanath, 29, and Meenakshi Moorthy, 30, last week, about 245 metres below Taft Point, where visitors can walk to the edge of a vertigo-inducing granite ledge that does not have a railing.Mr Viswanath, who Cisco India said was a software engineer at the company's San Jose headquarters, and Ms Moorthy, had set up their tripod near the ledge one evening, said Mr Viswanath's brother, Jishnu Viswanath.Park visitors the next morning saw the camera and alerted rangers, who \"used high-powered binoculars to find them and used helicopters to airlift the bodies,\" he said.In an eerie coincidence, a man who had hiked to the same spot with his girlfriend captured pictures of Ms Moorthy prior to her fall, saying she accidentally appears in the background of two of their selfie photos. Sean Matteson said Ms Moorthy stood out from the crowd enjoying the sunset atop Taft Point last week because her hair was dyed bright pink and that she made him a little nervous because he felt she was standing too close to the edge.\"She was very close to the edge, but it looked like she was enjoying herself,\" Mr Matteson said.\"She gave me the willies. There aren't any railings. I was not about to get that close to the edge. But she seemed comfortable. She didn't seem like she was in distress or anything.\" Mr Matteson said Ms Moorthy's pink-haired visage appears in the background of two photos he snapped of himself and his girlfriend Drea Rose Laguillo.He said Ms Laguillo noticed that Ms Moorthy had been captured in their images after pictures of the two victims were published.Mr Matteson said he did not recall noticing Mr Viswanath when he and his girlfriend were at the lookout with less than a dozen other tourists.The couple left the lookout as darkness was approaching, Mr Matteson said.The couple's funeral will take place in the US because the bodies were not in a condition to be flown back to India, Mr Viswanath's brother said. The couple was \"travel obsessed,\" Mr Moorthy wrote on a blog called Holidays and Happily Ever Afters, which is filled with photos of them in front of snowy peaks, the Eiffel Tower and tulip fields.Ms Moorthy had wanted to work full-time as a travel blogger, Mr Viswanath said.\"A lot of us including yours truly is a fan of daredevilry attempts of standing at the edge of cliffs and skyscrapers, but did you know that wind gusts can be FATAL?\" Ms Moorthy wrote on an Instagram post with a photo of her sitting on the edge of the Grand Canyon. \"Is our life just worth one photo?\"The couple graduated in 2010 from the College of Engineering, Chengannur, in Alapuzha district of Kerala state, one of their professors, Dr Nisha Kuruvilla, said.She said Ms Moorthy and Mr Viswanath were both good students who were fond of travelling and had married at a Hindu temple in Kerala in southern India four years ago. Yosemite spokeswoman Jamie Richards said in a statement that park officials were investigating the deaths and that the investigation could take several days.In India, after a rash of selfie-related deaths, the Tourism Ministry in April asked state government officials to safeguard tourists by installing signs in areas where accidents had occurred declaring them \"no-selfie zones\".AP\nTopics:\ndisasters-and-accidents,\n\n\n\t\n\tphotography,\n\n\n\t\n\tinternet-culture,\n\n\n\t\n\tsocial-media,\n\n\n\t\n\tunited-states,\n\n\n\t\n\tindia\n\n    First posted \n    \n      October 31, 2018 09:20:47\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}