{"id": "Stan Lee: World remembers Marvel Comics writer, co-creator of the Avengers and Spider-Man", "paragraph": "\n      Updated \n    \n      November 13, 2018 14:03:19\n    \nStan Lee has been remembered as a pioneering force in the superhero universe and the inspiration for generations of artists, writers, actors and fans.Lee's influence extended from the readers of his first comic books to the audiences of the Marvel films in which he made cameo appearances.DC Entertainment chief creative officer and former Marvel writer, Jim Lee wrote, as a shy, awkward kid growing up in a strange, new world Stan Lee gave him the greatest gift of all.\"He gave me a place to escape into — an endless, imaginative playground filled with the most amazing, fantastic and uncanny heroes ever,\" Jim Lee said.\"He taught me the true measure of a person was not defined by their powers but by the strength of their virtues and their commitment to truth, justice and tolerance.\"                                   \nTopics:\ndeath,\n\n\n\t\n\tarts-and-entertainment,\n\n\n\t\n\tfilm-movies,\n\n\n\t\n\tbooks-literature,\n\n\n\t\n\tunited-states\n\n    First posted \n    \n      November 13, 2018 07:25:50\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}