{"id": "Trump's AmericaPresident Donald Trump says US will pull out of nuclear arms treaty with Russia", "paragraph": "\n      Updated \n    \n      October 21, 2018 09:09:24\n    \nPresident Donald Trump says he will pull the United States from the Intermediate-Range Nuclear Forces Treaty with Russia. The 1987 pact, which helps protect the security of the US and its allies in Europe and the Far East, prohibits the US and Russia from possessing, producing or test-flying a ground-launched cruise missile with a range of about 480 to 5,470 kilometres.\"Russia has violated the agreement. They have been violating it for many years,\" Mr Trump said after a rally in Elko, Nevada. \"And we're not going to let them violate a nuclear agreement and go out and do weapons and we're not allowed to.\"The agreement has constrained the US from developing new weapons, but the US will begin developing them unless Russia and China agree not to possess or develop the weapons, Mr Trump said. China is not currently party to the pact.\"We'll have to develop those weapons, unless Russia comes to us and China comes to us and they all come to us and say let's really get smart and let's none of us develop those weapons, but if Russia's doing it and if China's doing it, and we're adhering to the agreement, that's unacceptable,\" he said.National Security Adviser John Bolton is heading to Russia, Azerbaijan, Armenia and Georgia. His first stop is Moscow to meet with senior Russian officials at a time when Moscow-Washington relations remain frosty over the Ukraine crisis, the war in Syria and allegations of Russian meddling in the 2016 presidential race and upcoming US mid-term elections.US officials have previously alleged Russia violated the treaty by deliberately deploying a land-based cruise missile in order to pose a threat to NATO. Russia has claimed US missile defences violate the pact.In the past, the Obama administration worked to convince Moscow to respect the INF treaty, but made little progress.\"If they get smart and if others get smart and they say let's not develop these horrible nuclear weapons, I would be extremely happy with that, but as long as somebody's violating the agreement, we're not going to be the only ones to adhere to it,\" Mr Trump said.AP\nTopics:\nunrest-conflict-and-war,\n\n\n\t\n\ttreaties-and-alliances,\n\n\n\t\n\tdefence-and-national-security,\n\n\n\t\n\tdonald-trump,\n\n\n\t\n\tworld-politics,\n\n\n\t\n\tunited-states,\n\n\n\t\n\trussian-federation\n\n    First posted \n    \n      October 21, 2018 08:22:17\n    \n\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}