{"id": "Korean banks tell traditional owners they won't back Adani's Queensland mega-mine", "paragraph": "\n        Posted \n    \n      November 05, 2018 07:06:19\n    \nMajor Korean lenders have ruled out any role in funding Adani's contentious Australian coal project, just months after the miner was reportedly in talks to win backing from lenders in Seoul. Traditional owners fighting the mine have secured pledges from a trio of lenders including the Export-Import Bank of Korea, a critical conduit for Korean lenders, which said it believed there was no longer any interest in the mega-mine.Anti-Adani representatives of the Wangan and Jagalingou (W&J) traditional owners will today fly to Korea to continue lobbying lenders, including Mirae Asset Daewoo, which refinanced Adani's Queensland coal port in July.Adani is vying to clinch funding for a new scaled-down launch of a project first touted to cost $16.5 billion, now earmarked to get underway with an initial $2 billion.The W&J are split on the mine, and opponents who tried in vain to overturn an Indigenous land use agreement (ILUA) with Adani are appealing before the full bench of the Federal Court.The ILUA is critical to the funding of the project, as major global lenders require Indigenous consent for resources projects.The Export-Import Bank of Korea met with Department of Foreign Affairs and Trade officials in 2016, at Adani's request, to discuss \"engagement\" with the project.But the bank wrote to the W&J Family Council last Thursday, all but ruling out the prospect of any lender interest in Adani from Korea. \"We would like to inform you that, the Export-Import Bank of Korea (Korea Eximbank) does not have any intent to provide financial support to the Carmichael project, since, as far as we know, there are not any Korean interests any more in the project,\" it wrote.The Korea Development Bank wrote on October 31: \"We wish to express that we have no intent to provide finance for the project.\"\"Please kindly be informed that, without any commitment, we reviewed the project upon a Korean client's request in 2014,\" it said.\"However, we are no longer reviewing it.\" KDB Infrastructure Investments Asset Management Co (KIAMCO) also wrote to the W&J Family Council on Friday to \"hereby confirm that we have no intention to participate by all means, financial or other support or services, in the development of the Carmichael mine\".\"We deeply conform [to] the responsibility of financial investors and have well understood the importance and concerns for the development of the Carmichael mine on the W&J's ancestral lands,\" it said.The W&J Adani opponents said they would seek meetings and hold \"media events\" at the offices of other institutions including Mirae Asset Daewoo, Korea's National Pension Service and NH-Amundi.A similar lobbying roadshow by W&J representatives in the US and Europe in 2015 saw major lenders, including Britain's largest investment bank Standard Chartered, back away from Adani.The ABC understands financial industry sources recently confirmed with Australia's big four banks that none would have a role in the Carmichael project.A media report in September suggested Adani was seeking to partly fund the Carmichael project by selling a stake in its Abbot Point coal port to Korean interests.The Queensland government has said Adani must reach \"financial close\" before it will permanently wipe out native title claims to the mine site to hand over tenure to the miner.But it has also asked Adani to put up security for a royalties deal that would allow the miner to defer hundreds of millions of dollars of state payments — which Adani is yet to sign after 18 months.The W&J mine opponents are battling to retain their native title rights and have formally complained to the United Nations.\"Whoever assists Adani financially at this crucial time will become complicit in a grave breach of our rights, and the destruction of our lands and waters and sacred places,\" W&J elder Adrian Burragubba said.\"They are also exposing themselves to financial risk because success in our Federal Court appeal due next year would deliver great uncertainty to investors.\"Another W&J anti-Adani representative travelling to Korea, Murrawah Johnson, said 33 major institutions had now ruled out funding Adani.\"The interest in Adani from Korean banks or potential equity financiers needs to be made clear after reports that Adani has held talks with Korean finance companies,\" she said.\"We are seeking to close the door on this financing avenue.\"An Adani spokeswoman said the company had been \"working with the traditional owners of the Carmichael project area, the Wangan and Jagalingou, Juru, Birriah and Jangga, since 2010\".\"Indigenous Land Use Agreements are in place with all four claim groups and are registered by the National Native Title Tribunal,\" the spokesperson said. \nTopics:\nmining-industry,\n\n\n\t\n\tenvironment,\n\n\n\t\n\tenvironmental-impact,\n\n\n\t\n\tindigenous-aboriginal-and-torres-strait-islander,\n\n\n\t\n\tbusiness-economics-and-finance,\n\n\n\t\n\tbanking,\n\n\n\t\n\tindustry,\n\n\n\t\n\tfederal---state-issues,\n\n\n\t\n\tactivism-and-lobbying,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tcoal,\n\n\n\t\n\tmining-environmental-issues,\n\n\n\t\n\taustralia,\n\n\n\t\n\tqld,\n\n\n\t\n\trockhampton-4700,\n\n\n\t\n\tmackay-4740,\n\n\n\t\n\tkorea-republic-of,\n\n\n\t\n\ttownsville-4810,\n\n\n\t\n\tbrisbane-4000,\n\n\n\t\n\tbowen-4805\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}