{"id": "Asylum seeker families flown to Adelaide as part of 'quiet' removal of children from Nauru", "paragraph": "\n        Posted \n    \n      October 31, 2018 10:44:18\n    \nAsylum seekers from Nauru are receiving treatment at Adelaide's Women's and Children's Hospital, as children continue to be moved from the Pacific nation to Australia. The Federal Government has been under renewed pressure in recent months to evacuate asylum seeker children from the island, with the issue a key talking point during the Wentworth by-election.Prime Minister Scott Morrison, who has faced unrest from within his own party over the issue, yesterday said the number of asylum seeker children on Nauru had \"halved\" in the past nine weeks.Founder of Welcome to Australia advocacy group pastor Brad Chilcott told ABC Radio Adelaide that several families had arrived in Adelaide in recent weeks.\"In the last month, at least four — maybe seven — families have arrived here. The Government is finally responding to the humanitarian and medical crisis that's going on for people on Nauru, and children in particular,\" Mr Chilcott said.\"They come from a range of countries. There have been Rohingya people, Iranians and others here in Adelaide.\"It's likely that [authorities] get them to hospital as quick as they can and put their families in nearby accommodation while they receive urgent medical care.\" South Australian Health Minister Stephen Wade confirmed some of the children were being treated as inpatients at the Women's and Children's Hospital and the State Government was \"pleased to be able to provide help\".\"Just as we send Australian clinicians to provide care overseas it's great that we're able to provide support,\" Mr Wade told ABC Radio Adelaide.\"I suspect we're talking about 10. My understanding is they're all receiving inpatient care at the Women's and Children's Hospital.\"They stay under the care of the Commonwealth Government the whole time and my understanding is that often community detention would be the next step after hospital care.\"Mr Wade said the Women's and Children's Hospital was one of several throughout the country \"working together to provide children the care that they need\".Mr Chilcott said about 40 children remained in detention on Nauru as of yesterday, but warned that number could have changed because the Government was moving them off \"much more quickly\".He said despite the evacuation of children, \"hundreds of men\" would remain on Nauru and Manus Island. He said asylum seeker families from Nauru who had been in community detention in Adelaide \"for longer than a year\" still faced significant mental health issues, because of uncertainty over their situation.\"They are continually fearful of being placed back in those conditions and even though they've received medical care here they may go back into the place that has caused the significant harm they have already experienced,\" he said.\"They are not given hope that this is a long-term arrangement.\"Yesterday, Prime Minister Scott Morrison said the Government was working quickly and \"quietly\" to take asylum seeker children off the island.\"In the last nine weeks, the number of children on Nauru has halved. So we've been getting about this quietly. We haven't been showboating about it,\" he said.\"It was our Government that closed 17 detention centres and got all the children out of detention in Australia.\"Mr Morrison said it was important to remember that asylum seeker children were living on the island, not within the walls of the detention centre.\"There are no children in Nauru living in detention, they live in the community like Nauruan children do. Nauruan children live on Nauru, children live on Nauru,\" he said.\"That is the home of Nauruans, their children live there, their families live there. They go to school there, they run businesses there, they work there.\"We should be tempered in our discussion about the nation of Nauru and I think we should treat them with respect.\"Doctors have expressed concern about the mental and physical health of about 80 children who have been on the Pacific island for up to five years.Last week, two prominent psychiatrists accused the Government of ignoring a mental health crisis among children in detention on the island.Former prime minister Tony Abbott recently described Nauru as a \"very pleasant\" place that was being unfairly depicted as a \"hell-hole\".A spokesperson for Home Affairs Minister Peter Dutton said his office was \"not going to provide a running commentary through the media on where individuals may or may not be transferred to\".\nTopics:\ngovernment-and-politics,\n\n\n\t\n\trefugees,\n\n\n\t\n\timmigration,\n\n\n\t\n\tmental-health,\n\n\n\t\n\tforeign-affairs,\n\n\n\t\n\taustralia,\n\n\n\t\n\tnauru,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tsa\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}