{"id": "Dental tourism: Things to consider before going that extra mile for your smile", "paragraph": "\n        Posted \n    \n      October 25, 2018 09:36:48\n    \nAustralians spend up to $300 million each year on healthcare costs abroad. As part of this phenomenon, each year around 15,000 of us are travelling overseas for cosmetic surgery tourism, including dental procedures.We don't have firm numbers on exactly how much Australians spend on dental procedures. But we know for sure dental implants, crowns and bridges (prosthetic devices implanted to cover a damaged tooth or missing teeth), endodontics (such as root canal treatments) and other cosmetic dental procedures are becoming highly desirable.There has never been more pressure to have a straight, bright and white set of teeth.Healthcare tourism refers to people travelling overseas to undergo a medical or dental procedure. People travel for a range of dental procedures including having implants, crowns and bridges fitted, or for dentures, root canal treatment, fillings, veneers and teeth whitening. In Australia, three in 10 people have avoided visiting a dentist due to cost, while one in five were unable to afford treatment recommended by a dentist. Dental care in Australia is not subsidised for the majority of Australians, and about half don't have any private dental insurance, which makes the allure of dental tourism clear.Some companies offer all-inclusive packages for sun, sea and smiles, meaning you can receive dental care as part of your holiday.Dental treatment abroad, including flights and luxury hotel accommodation, is often still cheaper than some dental treatments at home. For Australians, the most popular destinations are countries in South-East Asia such as Thailand, Indonesia, Malaysia and the Philippines.Patients who travel tend to be ordinary people with modest incomes. And, like medical tourism, a substantial part of overseas dental travel involves diaspora patients returning to their home country for more familiar (and cheaper) care. Dentistry, whether provided at home or abroad, is never risk free. You might pay top dollar to see the best provider and still have something go wrong. The Australian Dental Association advocates for patients to reconsider mixing holidays abroad with their oral health care. The association says the standards of dentistry overseas aren't as good as in Australia and there could be issues with cleanliness and infection risk.While there are no strong population-based studies that prove overseas dental treatment leads to poor outcomes, case studies do exist. These have shown lack of accountability and regulation are the main issues with dental tourism, particularly when complications arise.Education, training and practice philosophies of overseas-trained dentists might be different to those of Australian-trained dentists. Dental education systems in a few major tourist destinations in South-East Asia and the Indian subcontinent are facing several challenges in terms of rapid privatisation, quality and regulation.On the other side of the coin, Australia has also had reported cases of poor infection control practices.Whether you choose to have dental treatment overseas or in Australia, here are some things to consider:Have you had enough time to think about your treatment? If you have a plane to catch and a tight schedule, you need to be wary about being pressured into committing to treatments before you feel ready. Holidays come and go but the effects of dental treatment stick around for a lot longer.Have you been able to ask questions? Most dentists are really good at telling patients about treatments and different options. If you don't feel you can ask questions, or that you are getting answers that satisfy your needs, you should be able to have a second opinion. Don't be afraid to ask for one.What happens if things don't work out? Dentistry is as much of an art as it is a science. No matter how skilled your dentist, sometimes things don't go to plan or are more complex than first thought. It usually isn't too much of a problem to put things right, but if you need to see a dentist again, is this going to be difficult?In this era of globalisation, overseas travel for dental care seems unavoidable. On a positive note, increased international flows of patients are likely to stimulate debate and develop solutions to enable more effective and cheaper access to dental care in Australia. Host countries that benefit from dental tourism and have modified their clinical facilities for an international clientele may be encouraged to offer similar levels of quality care to local patients.Professional and patient regulation and other mechanisms (such as insurance) that are preserved for national interests will need to widen to include the concerns of overseas healthcare travellers.Regional cooperation across countries where dental tourism occurs will need to be actively pursued. This includes streamlined support for understanding dental tourism such as the inflows and outflows of patients, types of treatments, care providers and after-care. Better data on dental tourism is vital for tracing and explaining this phenomenon.Madhan Balasubramanian is NHMRC Sidney Sax Research Fellow at the University of Sydney; Alexander Holden is a lecturer in dental ethics, law and professionalism at the University of Sydney.This article first appeared on The Conversation.\nTopics:\nmedical-sciences,\n\n\n\t\n\thealth,\n\n\n\t\n\tdoctors-and-medical-professionals,\n\n\n\t\n\taustralia,\n\n\n\t\n\tasia,\n\n\n\t\n\tindia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}