{"id": "World-famous Larrimah outback pub sold, along with its crocodiles", "paragraph": "\n      Updated \n    \n      October 21, 2018 22:16:46\n    \nIt's not your usual bit of real estate — unless you like your property with a side of saltwater crocodile, that is.The Larrimah Wayside Inn, also known as the Pink Panther pub, is located 500 kilometres south of Darwin on the edge of the Stuart Highway, the main artery connecting the Top End with Adelaide.The pub, which sold over the weekend, is one of 10 designated unique outback pubs of Australia, said auctioneer David Loveridge.It was sold on a \"what you see is what you get\" basis, and included three crocodiles, a couple of emus, and loads of kitsch Australiana: old beer posters, t-shirts, and Akubras hang over doorways, accompanied by rusted bits of farming machinery and vintage paintings of rodeos, farm life, and native animals.\"Bullshit corner\", announces a sticker on the wall outside.\"If we are what we eat, I'm fast, cheap, and easy!\" screams a bumper sticker behind the bar.Out the front, a giant pink panther sculpture kicks back in a chair, enjoying a beer, while overhead, another one flies a gyrocopter.Inside, three stuffed pink panthers ride a tandem bicycle. The walls are all painted, naturally, bright pink.This pub is also the last place Irish-born local man Paddy Moriarty, 70, and his kelpie Kellie were seen before they disappeared — feared dead — in suspicious circumstances in December last year, in a mysterious case that continues to baffle the Northern Territory. A smattering of houses, a World War II museum and a disused railway line make up the bulk of Larrimah, population: 11.It's swelteringly hot inside the Pink Panther, where overhead fans strain creakingly to stir up a scorching breeze.The day before the auction, the head has fallen off the statue of a pink panther flying a gyrocopter, and a couple of locals back a front loader up to it to glue it back on in time for auction day.Out the back, publican Barry Sharpe walks through what remains of a once sizeable menagerie, featuring crocodiles, snakes, emus, sugar gliders, and about 600 birds. \"I've always had an interest in animals,\" he said.\"I don't know if it really added anything to the pub. It was open to the public to view but it was something I wanted to do, so I did it.\"Saltwater crocodile Sneeky Sam was bought as a hand-sized youngster from a pet shop, and now sprawls 3.5 metres along the length of his fetid green pool.Mr Sharpe slings some raw chicken on a stick and the crocodile leaps for it, moving alarmingly fast.\"He's grown now, he's a monster. He's huge,\" Mr Sharpe said.Another croc, a freshie, Mr Sharpe got from a woman who'd been working at a crocodile farm when she realised the crocodile couldn't see. \"She was travelling around with him in a broccoli box,\" he said.The croc is called Ray Ray \"after Ray Charles because he had the same problem\".The third and final croc is another salty, called Aggro. Larrimah's long been known for its quirkiness, its isolation providing fodder for strange and protracted feuds amongst its few inhabitants.  There are stories of sabotage, pet peacocks fed to a crocodile, roadkill dumped on properties in retribution, and a rivalry over the sale of meat pies.At the heart of it all is the pub, which Mr Sharpe ran for 15 of the 28 years he's lived in the town.It also acts as the Greyhound Bus stop, and as a central post office for those living on the surrounding stations, saving them an 80-kilometre drive north to Mataranka.\"When I first came here I was driving north looking for a bit of hot weather; pulled up outside the pub and stayed here for 28 years,\" Mr Sharpe said.Unfortunately, due to a diagnosis of prostate cancer it came time for him to sell up.\"It looks like it's going to be terminal, and there's too much work here, I can't do it,\" he said.\"So that's the reason, I'm sorry. Not because I want to sell it, but I've got no choice.\"Locals and visitors gathered anxiously at the Pink Panther for the auction on Saturday morning.\"It would be a disaster if it closed down … we'd die of thirst,\" said local Len Hodson.\"The pub is very important for any town,\" said resident Karen Rayner.\"It has the atmosphere, it definitely does.\"It's just a general place for all of us to meet here.\"If it closed up, we're concerned that Larrimah will close up with it.\" The shadow looming over the pub is that of Paddy Moriarty, a moustachioed Irish-born longtime resident who vanished from his home in December.The Northern Territory Coroner is yet to hand down his findings following an inquest held in June, in which residents levelled accusations at each other over who might have killed him. All residents deny any involvement in his disappearance, and the police investigation is continuing.One of several feuds in town was one between Mr Moriarty and his neighbour Fran Hodgetts, the owner of Fran's Devonshire Tea House.She claimed he dumped a dead kangaroo under her bedroom window days before he disappeared, told potential customers not to eat her meat pies, and tried to steer visitors away from her business and towards the pub, which also took up selling meat pies.His absence has been felt at the Pink Panther, where he used to drink eight tinnies of beer per day.\"It's a different mood; we still talk about what the hell happened to Paddy,\" Mr Sharpe said.\"We would like to see more done. I know detectives are not magicians … I'd like them to at least give us a little bit of information, a little bit of hope that something's going to be done.\"He said the pair developed a strong friendship over the years.\"We were good mates, very good mates,\" he said.\"If ever I wanted a hand with anything, Paddy was always there … never faltered. A good man. A very good man.\"Mr Hodgson also said Mr Moriarty was missed.\"Miss his little antics, like riding his pushbike home and riding through a barbed wire fence. Him and his old dog Rover,\" he said.Mark Rayner said Mr Moriarty's disappearance had \"absolutely\" changed the vibe of the pub; and, indeed, the town.\"It hasn't been the same since that fateful day,\" Mr Rayner said.\"He was part of the hotel, he was the greeter, the concierge. 'How are ya folks?' he'd say, and 'where are you from?' And he'd tell one or two of his little stories from his days when he was down at Brunette Downs.\" Although the pub was passed in at the weekend auction, it was sold during private negotiations to a prominent Territory family.It is unclear still who it sold to and at what price.However, Mr Sharpe had hoped for offers over $500,000 and refused a telephone bid of $200,000 during the auction. Auctioneer David Loveridge said it was the first time he'd auctioned a property along with its resident crocodiles.\"[Sneeky Sam is] one of the most beautifully kept crocodiles and whilst it won't really attribute a lot of value to the property, it's part of the uniqueness of the property,\" he said.As for Mr Sharpe, he hoped the spirit of the place could be maintained.\"I don't know whether it's been a love story or not. I've put a lot of work into this place … but I've enjoyed doing it,\" he said.\"I'd just like to see somebody buy it and carry on with it the way it is.\"There's still a lot to be done with this place. I want somebody to take that interest in it and look after it.\"  _ \nTopics:\nmissing-person,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tbusiness-economics-and-finance,\n\n\n\t\n\tsmall-business,\n\n\n\t\n\trural,\n\n\n\t\n\tlarrimah-0852\n\n    First posted \n    \n      October 21, 2018 09:26:05\n    \n\n\nContact Neda Vanovac\n\n\n\n\n  More\n stories from Northern Territory\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}