{"id": "Closing SHINE SA sexual health clinics amidst syphilis outbreak 'could drive up STI rates'", "paragraph": "\n        Posted \n    \n      November 18, 2018 08:50:03\n    \nRates of sexually transmitted infection could rise in some of Adelaide's most disadvantaged communities in the long term because of a decision to close community sexual health clinics, a public health organisation has warned. SHINE SA currently runs four clinics across Adelaide which provide sexual health services, offering key advice about contraception and support to people with unplanned pregnancies and sexually transmitted infections (STIs).It is blaming a decision to close two suburban clinics in the city's north and south, as well as a HIV counselling service in Adelaide's CBD, on SA Government funding cuts flagged in September's state budget.\"It is with regret that we give you this early warning of pending SHINE SA clinic closures at Davoren Park and Noarlunga, planned to occur in February 2019,\" the organisation said in a statement.\"The sexual health sector has been one of the hardest impacted sectors.\"SHINE — which stands for Sexual Health Information Networking and Education — went into more detail in a letter, telling its staff and collaborators it had lost $547,000 per year in funding and that \"we now unfortunately find ourselves forced to close\" the two clinics.\"We fully appreciate that this significant loss of service will create difficulties for our partners, colleagues and collaborators who have been … working with us to deliver seamless services to people in the north and the south over many years,\" it said.The funding cut coincides with a syphilis outbreak being declared in Adelaide last week, which has prompted SA Health to issue an alert to medical practitioners.Figures showed 49 people had been diagnosed with syphilis in the state's far north and west, and Eyre Peninsula, since the outbreak was declared in those areas in November 2016.A further 15 cases have been diagnosed in metropolitan Adelaide, with an increase in carriers in the past six months. The Government has expressed surprise at SHINE SA's decision to close clinics, conceding it had cut funding but calling on the organisation to reconsider.\"Similar services interstate are operating more efficiently. We think there are more opportunities for SHINE to access Medicare revenue,\" Health Minister Stephen Wade said.\"They need to think again about how they can more cost-effectively deliver services. It's a 9 per cent reduction in the grant but they're talking about a 50 per cent reduction in their clinics.\"I really question their decision to close the northern clinic and the southern clinic — two areas where there is a particularly high socioeconomic need.\"The president of the national Public Health Association's SA branch, Kate Kameniar, said the syphilis outbreak demonstrated why there was such a strong need for SHINE SA's clinics to remain open.\"The risk is that we will see a resurfacing of some of the conditions and concerns we've had previously,\" she said.\"In north Queensland, there was recently an outbreak of syphilis which has been a terrible outbreak that has spread down to South Australia and other states.\"Tragically, six babies died in that outbreak.\" The Government recently cut funding to Centacare's Cheltenham Place refuge centre for HIV patients, saying the need for the service had reduced as the focus shifted from acute to chronic patients.Opposition health spokesman Chris Picton said the combined closures \"could not be happening at a worse time\" and would lead to an increase in rates of infection.He blamed the Government for SHINE SA's decision.\"We think this is a cruel and heartless cut. The closure of these three centres is going to impact people in some of South Australia's most vulnerable communities,\" he said.\"These are exactly the areas in which you want these services to be located. We've had 9,000 appointments at these two services over the past year.\"To cut community health centres in our southern and northern suburbs, where clearly there's more disadvantage, is going to lead more disease in our community. It's going to lead to more pressure on our hospital system.\"Mr Picton said there would also be job losses associated with the closures.\"A number of councillors and nurses who work at SHINE SA have been told yesterday that their jobs will be lost,\" he said.Mr Wade said the SA Government was working with the Federal Government and Aboriginal health agencies to address the syphilis outbreak.He said \"as far as I know\" that SHINE SA was not involved in combating syphilis in the remote north-west of the state, where Aboriginal health groups delivered those services.\nTopics:\naids-and-hiv,\n\n\n\t\n\tsexually-transmitted-diseases,\n\n\n\t\n\tdiseases-and-disorders,\n\n\n\t\n\thealth,\n\n\n\t\n\tsexual-health,\n\n\n\t\n\tbudget,\n\n\n\t\n\tstates-and-territories,\n\n\n\t\n\thealth-policy,\n\n\n\t\n\tsa,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tdavoren-park-5113,\n\n\n\t\n\tnoarlunga-centre-5168,\n\n\n\t\n\tnoarlunga-downs-5168,\n\n\n\t\n\tchristies-beach-5165,\n\n\n\t\n\tport-noarlunga-5167,\n\n\n\t\n\telizabeth-5112,\n\n\n\t\n\tsalisbury-5108,\n\n\n\t\n\tsmithfield-5114\n\n\n\n  More\n stories from South Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}