{"id": "Australian share market sheds $52b following Wall St slump overnight", "paragraph": "\n      Updated \n    \n      October 26, 2018 00:24:10\n    \nThe Australian share market wiped out all its gains from the past 12 months and entered a technical \"correction\" on Thursday following a massive sell-off on Wall Street overnight.The broad All Ordinaries index dropped 2.8 per cent to 5,759 points — which is about $52 billion in market value.The benchmark ASX 200 has retreated by a similar amount to 5,664. It has fallen by more than 10 per cent since its peak in late-August and is down 7 per cent since the start of the year.\"It's not outlandish now to call it a correction,\" IG market analyst Kyle Rodda said.\"Whether it starts manifesting in what we consider to be a bear market, which is where we start to see the selling outweigh the buying or the markets falling rather than rising as a trend, it remains to be seen.\"The major drivers of a market — the banks, healthcare stocks … as well as the materials space — they're all struggling at this point in time and not showing great signs of potentially turning around.\"Although the local bourse fell heavily, it was still faring better than some of its Asian counterparts on Thursday — Tokyo's Nikkei (-3.5pc) and Seoul's Kospi (-2.3pc).The Shanghai Composite index began its day significantly lower (-2.6pc), but quickly reduced its losses to 1.6 per cent.The Australian dollar had risen slightly to 70.74 US cents by 4:30pm (AEDT).AMP was the weakest performer on the benchmark index, plunging 24 per cent to $2.50 — a record low.The beleaguered financial services company announced on Thursday it would sell its life insurance business for $3.3 billion.Bellamy's (-6pc) and Super Retail Group (-10pc) were also among the list of worst performers. Only 12 out of the largest 200 companies have posted gains, mainly gold and copper miners, including Resolute Mining (+3pc), St Barbara (+2pc) and Lynas Corporation (+7pc).The major banks — Commonwealth Bank, Westpac, ANZ and NAB — have lost more than 2 per cent each.Some other major companies weighing heavily on the market include BHP (-4pc), Rio Tinto (-4.5pc), Fortescue Metals (-5.7pc) and Qantas (-4.6pc).Every sector is in the red, with resources (-3.5pc), consumer discretionary (-3.2pc), energy (-2.8pc) and health care (-3.4pc) being the worst performers.The local market's substantial decline comes after the Dow Jones index fell more than 600 points, wiping out all its gains since January. New York's benchmark S&P 500 index plunged 3 per cent, while the tech-heavy Nasdaq was down almost 4.5 per cent.Market analysts have pointed to several reasons for the market volatility — rising US interest rates, the US-China trade war slowing global economic growth, disappointing quarterly earnings from some major American companies, geopolitical tensions with oil producer Saudi Arabia for the killing of journalist Jamal Khashoggi, and Italy's conflict with the European Union regarding budget spending.\nTopics:\nstockmarket,\n\n\n\t\n\tmarkets,\n\n\n\t\n\tcurrency,\n\n\n\t\n\tbusiness-economics-and-finance,\n\n\n\t\n\tcompany-news,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      October 25, 2018 10:10:38\n    \n\n\nContact David Chau\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}