{"id": "Two people have died in remote parts of WA in one week —  but experts say most Outback deaths are preventable", "paragraph": "\n        Posted \n    \n      November 05, 2018 08:12:07\n    \nForward planning and carrying adequate water supplies are vital for travellers in Australia's Outback regions, survival experts have warned. Their comments come in the wake of the deaths of two men in the space of a week in separate incidents in remote parts of Western Australia, both believed to be heat-related.In the first incident, a 27-year-old man died of heat exposure while hiking at a popular tourist spot in Kalbarri National Park.On Saturday, the body of experienced motorcyclist Daniel Price, who was on a solo expedition from Darwin to Karratha, was found on an isolated dirt track near the Gibb River Road in the Kimberley. Outback survival expert Bob Cooper, who has more 30 years' experience in training people to survive Australia's extreme conditions, urged people to plan ahead and drink enough water to survive.He said most Outback deaths were preventable if people took sensible precautions.These included increasing water intake and drinking at least 250 millilitres at a time, instead of taking small sips.\"You must take enough water,\" he said.\"Take what is recommend it by Parks and Wildlife and don't sip it. Don't try and make it last till you get back — you need it.'If you keep sipping it will just keep going downhill to the point where you are suffering from dehydration dementia.\"People die from lack of water, rarely lack of food.\"I have seen notes from people who have unfortunately perished and the Es are back to front, the Ds are back to front — they are suffering from dehydration dementia.\"He also recommended that hikers should schedule enough rest breaks and not rush their journey. \"Sit and wait until it's cool or walk back at night-time,\" Mr Cooper said.\"We're the only animal who's moving in the heat of the day. Let the animals be your teachers; nothing else is moving.\"  A WA Police spokeswoman said people should stay with their vehicles if they become lost or incapacitated for some reason.\"Police and State Emergency Services utilise varying types of search resources, including aircraft and vehicles,\" she said.\"In remote areas, it is much easier for searchers to spot a vehicle from the air, than it is a person.\"We advise them to try not to panic, and stay with their vehicle at all times.\" Mr Cooper said while most people safely enjoyed the Outback, it was important to respect the land.\"It's all planning — if you know what you should do and what you should take it's not scary,\" he said.\"It's nature [but] we unfortunately can turn it from a mishap to a tragedy.\" \nTopics:\ndisasters-and-accidents,\n\n\n\t\n\temergency-incidents,\n\n\n\t\n\tregional,\n\n\n\t\n\twa,\n\n\n\t\n\tkarratha-6714,\n\n\n\t\n\tbroome-6725,\n\n\n\t\n\tkalbarri-6536\n\n\nContact Sarah Collard\n\n\n\n\n  More\n stories from Western Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}