{"id": "Arctic Monkeys announce 2019 Australian Tour ", "paragraph": "\nBy\n Al Newstead\nArctic Monkeys in 2018 (L-R: Matt Helders, Alex Turner, Nick O'Malley, Jamie Cook)Zackery MichaelArctic Monkeys are returning to Australia and they’re bringing their sci-fi lounge comeback album Tranquility Base & Hotel Casino with them.How many cities are they playing? 'Four Out Of Five'. They'll tour through arenas between February and March with support from friends and collaborators Mini Mansions, the LA band featuring members of The Last Shadow Puppets and Queens of the Stone Age.Update: Due to overwhelming demand, second and final shows have been added for fans in Melbourne and Sydney.Tickets are on sale 3.30pm AEDT today (Wednesday 7 November). View the dates below and more info at Frontier Touring.with special guest Mini MansionsChief Arctic Monkey Alex Turner spoke to triple j Breakfast this morning, saying fans can expect \"something off every album and maybe half the new record\" on this tour. Stream the chat below.\"I still like playing some of them old tunes. It doesn’t feel as comfortable perhaps as playing the more recent stuff sometimes,\" he said. \"It almost feels like some of the older ones aren’t ours anymore but it doesn’t mean that we don’t play them. Doesn’t mean that I don’t enjoy playing them either, it just feels like a long time ago.\"Audio Player failed to load.\nTry to\n\nDownload directly\n(4.65 MB)\n\nSpace to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume.via YouTubeReleased in April, Tranquility Base Hotel & Casino is Arctic Monkeys’ first album in five years. In case you missed it, check out Warp Speed Chic, a short film about the making of the record.The band are also releasing the title track as a 7'' vinyl single, bundled with the previously unreleased B-side 'Anyways'. It’s out 30 November. More info below.FireFox NVDA users - To access the following content, press 'M' to enter the iFrame. "}