{"id": "Dow Jones wipes out all of its 2018 gains after dropping 608 points overnight", "paragraph": "\n      Updated \n    \n      October 25, 2018 09:12:42\n    \nWall Street was caught in another wave of aggressive selling overnight, as volatility surged and investors continued to dump technology stocks. The industrial-skewed Dow Jones index has wiped out all its gains for this year after it dropped 608 points, or 2.4 per cent, to 24,583.  The benchmark S&P 500 lost 3.1 per cent, marking its sixth straight day of losses.The S&P technology sector (-3pc) was hit the hardest, after the share prices of Apple (-3.4pc), Facebook (-5.4pc), Google (-5.2pc) and Netflix (-9.4pc) fell sharply.This caused the tech-heavy Nasdaq index to plummet by 4.4 per cent.Several factors dampened investor sentiment overnight — causing the volatility index (VIX) to surge 21.8 per cent to 25.2 points.The Federal Reserve released its latest report on the US economy, the Beige Book, which said factories have lifted their prices due to the Trump administration's tariffs.Furthermore, the latest figures from the US Commerce Department revealed that new home sales fell to a two-year low — the latest sign that rising mortgage rates and higher property prices were hurting demand.There have also been disappointing quarterly earnings from several big-name companies, international condemnation of Saudi Arabia — a major oil producer — over the killing of journalist Jamal Khashoggi, and concerns that the US-China trade war is causing the global economy to slow down.Australian shares are also headed for a substantial drop this morning, following the collapse in US investor sentiment.The Australian dollar has fallen further to 70.6 US cents.But it has risen to 54.8 British pence and 62 Euro cents, after some weaker-than-expected European economic figures.\nTopics:\nbusiness-economics-and-finance,\n\n\n\t\n\tmarkets,\n\n\n\t\n\tstockmarket,\n\n\n\t\n\tcurrency,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      October 25, 2018 07:50:53\n    \n\n\nContact David Chau\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}