{"id": "Curious DarwinWhat happened to the exotic African animals that once roamed an outback cattle station?", "paragraph": "\n      Updated \n    \n      November 13, 2018 12:27:26\n    \nIt has been nearly a decade since the bones were exhumed, but the stench of rotting meat still faintly lingers.\"You will notice a smell,\" says Jared Archibald as he walks through a door labelled \"Taxidermy\" at the rear of the Museum and Art Gallery of the Northern Territory.Mr Archibald, the curator of Territory History, shows shattered bones which have been meticulously re-assembled into the top half of a skull — work that's taken hours. It is part of a disarticulated pygmy hippopotamus skeleton, and its journey to this box surely holds one of the most bizarre Top End stories ever told. Curious Darwin is our story series where you ask us the questions, vote for your favourite, and we investigate. You can submit your questions on any topic at all, or vote on our next investigation.This week's questioner was interested in the legacy of what was once Australia's most expensive collection of privately owned animals: the Tipperary Station wildlife sanctuary.  Many locals believe they have glimpsed a menagerie of animals wandering freely through the Top End's Douglas Daly district since a pygmy hippo, somehow freed from the station, was shot in the wilderness in 2009.\"I didn't even know the station existed up until that point, so finding out there was a zoo out there was pretty crazy,\" questioner Hamish Harty said.\"It seems like something out of a movie.\"More than that, the story of Tipperary Station wildlife sanctuary is a parable of exorbitant wealth, failed dreams, and that infamous pygmy hippo who met an early demise.In its early days, the wildlife sanctuary called to mind a lost city in the Top End outback.Owned by millionaire property developer Warren Anderson, it became home to his growing personal collection of endangered, rare and exotic animals. The remote station was the site of scenes out of Africa. \"The idea was to have grazing species on the grass there at Tipperary, so antelope, deer, banteng, buffaloes — animals that would be reasonably easy to maintain on grass,\" said longtime veterinarian Ross Ainsworth, who worked at the station for about five years from 1987.\"It certainly was a unique place — and pretty weird, to be honest.\"You'd be driving around a paddock with cows in it and then you'd drive past some zebras and a hippo and some rhinos, and then next thing you'd be back seeing some cows and a cattle station.\"Curious Darwin took to the NT's archives, and found records of a station with 110 employees, more than 50 students in schooling, and a labour force replete with electricians, mechanics, a nurse, a vet, two pilots, and an aircraft engineer.\"Workers here are allowed six cans of beer each day,\" reported the NT News in 1989.\"They may hoard their beers for a binge, if they want to do so.\" By the turn of the decade, there were enough exotic animal species in the Top End to fill a naturalist's handbook: fallow deer, ostriches, chitals, blackbucks, rusa and sambar deer, zebras, nilgais, emus and \"the most fascinating collection of parrots\" one journalist had ever laid eyes on.According to a Sunday Territorian story from September 1991, the transfer of 170 exotic animals from Broome's Pearl Coast Zoo at a cost of $1.5 million placed Mr Anderson in possession of the largest privately owned mammal collection outside of Australia's major cities. Now there were also greater kudu antelope, addax, scimitar-horned oryx, nyala, congo buffalo, cheetahs, and South American tapir. \"Tipperary is a showpiece, if only we had another dozen Tipperarys in the Top End,\" was the effusive conclusion of the journalist in 1989.But after the death of two hippos during and shortly after the 4,000-kilometre journey from a zoo in Dubbo trouble was brewing.And other locals were less impressed, exemplified by this letter to the editor:\"One thing is certain: if the Northern Territory had another dozen stations like Tipperary, you might as well be in Africa.\"Rumours have long circulated about the fate of Mr Anderson's sanctuary. Two events are likely to have fuelled many of them. Both dabble in the bizarre, and both attracted far more media attention than anything else in the post-sanctuary years..First, Mr Anderson travelled back to Darwin in 2003 after financial difficulties reportedly prompted the NT government to step in and feed the animals after food supplies ran out.The ABC reported that 2,200 animals had been on death row since Mr Anderson abandoned them when he sold the station earlier that year.He made his way through the airport lounge with a rifle in tow.\"He was confronted not only by a phalanx of camera crews and journalists; a process server was in waiting to hand him a claim for nearly $15,000 [for feed],\" ABC News reported at the time.As he swatted away questions from persistent reporters, the Supreme Court was in the process of granting an injunction to prevent Mr Anderson from shooting the animals at Tipperary. But that was not the end of the stoush between Mr Anderson and the NT government.Secondly, in 2009, a pig hunter was trudging through the dead of night in the Douglas Daly when he glimpsed movement and raised a barrel.The trophy that fell before him was that of a pygmy hippo — an endangered species whose native home was thousands of kilometres away, in West Africa.People began to believe that more animals had, like the hippo, been set free to roam the Top End. Newspapers dispatched feature writers to wax lyrical about the tragic decline of a self-made outback empire. David Warriner, who managed the Tipperary group of stations for eight years, said the animals were long gone by the time he arrived as general manager in 2007.But the bones of the sanctuary — high fences, sanctuary enclosures, and a 2.1-kilometre sealed runway that is put to agricultural use — still contribute to a dreamlike memory of a bygone empire.Locals have compared it to Jurassic Park.And hopeful tourists still work the phones, asking if they'll be able to see exotic animals roaming the station and beyond.\"Sometimes you have people calling, asking about if there's any animals out there … but there are none, they were given away,\" David Connolly, the station's current manager, said.\"The fella that owned the animals loved his animals — after all he was breeding those animals, he was trying to breed endangered animals and was successful at it. \"So he loved the animals, but he gave them away to other sanctuaries. \"All other cases are just rumours.\"However, the widely held belief that the animals were sold to a wildlife park in Queensland is not quite that straightforward. In the early 2000s, Tim Husband was operating a consultancy that helped relocate animals for zoos that were closing, or raise the standards of those at risk of closing. He was called in to salvage what was then known as the Mareeba Wild Animal Park in Cairns, whose animals had been abandoned after their owner, David Gill, fled the country owing millions.Mr Gill he had purchased some of the Tipperary animals before doing so. \"In that time, we were told that there were a number of animals up in Tipperary that he had purchased and just abandoned,\" Dr Husband said over the phone from Dubai, where he now directs the Dubai Safari.Tasked to retrieve the animals, Mr Husband travelled to Tipperary and found there a robust collection of them in generally excellent health. \"There were quite a few there that were of value, not only to the region, to Australia, but generally to the whole gene pool of these species around the world,\" he said.Three common hippos, four pygmy hippos, two rhinoceroses, and a number of rusa deer were transferred to Cairns during a cross-country journey that required the animals be kept cool and wet in sprinkler-equipped crates. \"We also left one pygmy hippo there because Mr Gill had only paid for four pygmy hippos,\" Dr Husband said.The animals would later be convoyed again when Sydney-based lawyer Elaine Harrison was selling the park she had come to own, by then known as Shambala Animal Kingdom. According to Dr Husband, zoos in Australia had been waiting for Ms Harrison to offer the animals for free.But Dr Husband had recently been working with three wildlife parks in Indonesia, and organised for the export of the Tipperary animals alongside those that had initially come from the UK — more than 20 lions, tigers, and bears — to our north.One pygmy hippo was gifted to Taronga Zoo, where it has since bred. \"It was one of the largest, or the largest, exports of exotic animals out of Australia that's ever been done, and it was a mammoth job to move it,\" he said.\"It was like a flying ark when we got it up in the air.\"According to people still working in those parks, the animals have thrived. Both the rhinos and pygmy hippos now have offspring.Not all the animals earmarked for transport made it over the Queensland border.Two ageing tapirs were judged to be too old to be worth the stress of transporting, and lived comfortable lives on Tipperary Station before dying of natural causes in the following years. It's possible more of the original collection, likely including the giraffes, died of natural causes by the time Dr Husband was brought in. But in 2009, an anonymous source reportedly told AAP that the non-endangered species were destroyed.Other large herds ended up being shipped in a different direction. \"Unfortunately Mr Gill had left a trail of debtors,\" Dr Husband said.\"The reason they didn't make it is that the man that was shipping these animals that was doing all the freight, Mr Gill hadn't paid.\" Instead, Kevin Gleeson, then the owner of the Mary River station near Pine Creek, organised for a number of animals to travel to his station.According to the reports at the time, Mr Gleeson purchased about 300 animals from Mr Gill, likely to be herd animals such as African scimitar horned oryx, addax and varieties of deer.In 2009, Mr Gleeson told media the herd had doubled in size since its arrival on his property. The current owners of Mary River Station confirmed deer and oryx still roam the station, but did not return Curious Darwin's call. After it was shot, the pygmy hippopotamus rotted in a cool room at a research facility in the Douglas Daly area before being buried in dirt.But a rare specimen within easy reach of Darwin posed too rare an opportunity for some researchers to pass up. Three months after the hippo was buried, Mr Archibald excavated the rotting carcass.\"We were basically finding each bone and slurping off all the muck — because it hadn't disappeared that quickly even after three months — and then bagging each one of those,\" Mr Archibald said.Mr Archibald said the artefact may be exotic, but still held research potential for his team.\"We actually have, in the Territory, two very large and very rich fossil sites that have marsupial quadrupeds called diprotodontids in them, remains of,\" he said.\"Having something like a hippo skeleton allows us to look at the bones of something that lives now and look at the bones of something that lived 15 million years ago or 7 million years ago, and go, 'these are similar here, they're different there'. \"It's just a comparative thing.\" But just how the pygmy hippo ended up surviving deep in the bush years after its peers travelled interstate continues to be a mystery.Mr Ainsworth, who was familiar with the large enclosure the creature inhabited, hazarded an educated guess: \"It was a terrific enclosure for the animals, but it did allow the smaller animals to be able to hide out,\" he said.\"I don't know the exact situation but reading between the lines, I suspect that there was a calf that was missed that was either not known about or that they were unable to locate and assumed was dead. \"After all the animals were moved and the enclosure was turned back into a cattle enclosure, the animal then left and made its way down to the river.\"Rosemary Sullivan, who arrived to teach on the station as animals were being crated up in 2004, confirmed that a newborn pygmy hippo was nowhere to be found.\"Months and months later, someone who was keeping their pet dogs in the caged area there suddenly saw a hippo erupt from the water,\" she said.\"Over time, a gate was left open or the fence deteriorated and it got out.\"Helicopter pilots would tell you that they would see it out in the wet areas and that kind of stuff, just roaming around, living a pygmy hippo life.\"He would be there today if he hadn't decided to go straying onto a neighbouring property and encountered a pig hunter.\"Not unlike the sanctuary it hailed from, the pygmy hippo was a continent away from where it belonged, veiled in rumour and mystery, and upheld as a bizarre, fantastic artefact by those it left behind. Hamish Harty is a life-long Territorian who has lived in Darwin and Jabiru.He's an ABC employee who recently relocated to Alice Springs.Growing up in Darwin, he would hear rumours about a privately owned wildlife sanctuary whose animals were set free to roam harsh Top End bushland.\"The first time I heard about it was when the hippo got shot, and I just couldn't believe there could be more animals out there,\" he said.His fascination with the Tipperary Station wildlife sanctuary has continued since.  \nTopics:\nanimals,\n\n\n\t\n\tanimal-welfare,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tdarwin-0800\n\n    First posted \n    \n      November 13, 2018 07:36:14\n    \n\n\nContact Jesse Thompson\n\n\n\n\n  More\n stories from Northern Territory\nWhat have you always wondered about Darwin that you'd like an ABC reporter to investigate?\n        By Jesse Thompson\n        By Rani Hayman\n        By Neda Vanovac\n        By Emily Smith and Liz Trevaskis\n        By Dijana DamjanovicIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}