{"id": "Yellowstone geyser Ear Spring spews up decades-old garbage in rare eruption", "paragraph": "\n      Updated \n    \n      November 05, 2018 17:27:46\n    \nWhen watching a geyser erupt, you expect a thrilling burst of water from the ground and some warm spray in the air — not to see garbage rain down from the sky. But when Ear Spring geyser in Yellowstone National Park in northern United States erupted, it fired rocks, water and trash metres into the air.\"On September 15, 2018, Ear Spring erupted and ejected lots of decades-old trash,\" Yellowstone said on its Facebook page.In a live video on Facebook, park staff detailed the trash they had found from the eruption, which included a cinderblock, cigarette butts, a 1930s baby dummy, a grizzly bear warning sign, and nearly 100 coins. Some of the items — which somehow survived inside the boiling-hot spring — were historic and may end up in Yellowstone's archives.\"Stuff like this that can tell us a story, and the history of how people were unfortunately using the spring while they were visiting it, will definitely be added to the collections,\" Yellowstone museum curator Colleen Curry said. Despite the detritus-laden time capsule giving park authorities a glimpse of artefacts from decades ago, they were adamant that visitors not throw their refuse into the springs.\"When the vent becomes completely plugged, as it has in several springs in the park, then the spring can actually plug up to the point where it's not a hot spring anymore and it'll go dormant or it'll die,\" park ranger Rebecca Roland said.Yellowstone spokeswoman Linda Veress said the combination of increased tourism and tourists continuing to throw garbage into the geysers has affected springs like Handkerchief Pool. \"[Handkerchief Pool] stopped functioning some time in the 1920s or '30s. It stopped because people threw coins, broken bottles, rocks, hairpins, and a small horseshoe into it about 100 years ago,\" she said.Other springs like the Morning Glory pool have over time transformed from a deep blue colour to yellow and green due to the chemical composition in the spring changing, thanks to garbage clogging it up.Ear Spring erupts very rarely, and is a more docile neighbour of the famous Old Faithful geyser.The US Geological Survey says Ear Spring has only erupted four times in the past 60 years, with the last significant burst of activity coming in 1957.\"The next time Ear Spring erupts we hope it's nothing but natural rocks and water,\" Yellowstone National Park wrote on Facebook.\"You can help by never throwing anything into Yellowstone's thermal features.\"  \nTopics:\nland-pollution,\n\n\n\t\n\tenvironmental-impact,\n\n\n\t\n\tenvironment,\n\n\n\t\n\tunited-states\n\n    First posted \n    \n      November 05, 2018 08:24:29\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}