{"id": "ANZ produces a messy $6.4b full-year profit", "paragraph": "\n      Updated \n    \n      October 31, 2018 10:50:05\n    \nANZ's 2018 full-year profit was always going to be a messy affair, with one-off items moving the profit dial between growth and contraction. Proceeds from the sale of a number of offshore assets and significant reduction in the bad debts carried by them balanced the loss of income from those assets and the banks' mounting legal bills.All up, the bank's net profit came in at $6.4 billion, roughly the same as last year.However, the full-year cash profit including discontinued, or sold, operations — usually the bank's preferred measure, which strips out the one-off gains and losses — gives a clearer picture of the impact of ANZ's turbulent year. It was down 16 per cent to $5.8 billion.\"The actions taken in recent years to simplify our business have allowed us to reduce cost, rebalance capital and better remediate issues,\" ANZ chief executive officer Shayne Elliott said.\"This places ANZ in a stronger position to meet the challenges facing the industry.\"Given the messiness of the result, the bank trotted out a third metric, cash profit on an continuing basis, to give clearer picture of opperations of the new slimmed-down bank. The ongoing business saw its underlying cash profit fall 5 per cent to $6.5 billion.The overall profit was propped up by significant $1 billion drop in bad debts, much of which had been carried in its recently disposed Asian assets.New impaired assets fell by a third from $3.2 billion last year to $2.1 billion.\"The lowest credit losses in a generation have been driven by our decision to change the composition of our loan book, the sale of our retail business in Asia, together with the run-down of our mid-market commercial business in Asia and a relatively benign credit environment,\" Mr Elliott said. The bank's profit was also buffeted by a slowing housing market and tighter lending rules being imposed by regulators to take the risk out of the big banks' mortgage books.Mr Elliott said the bank would maintain a disciplined approach to home lending.\"Retail banking in Australia faced strong headwinds with housing growth slowing and borrowing capacity reducing. \"While this meant we sacrificed short-term revenue growth and higher margins in Australia, particularly in the investor and interest-only segments, it was the right thing to do for shareholders.\"The impact of the royal commission and years of misconduct appeared in the results, with one-off regulatory and legal costs outweighing belt-tightening elsewhere in the bank.ANZ has already refunded almost $400 million it charged its customers for either bad or, in some cases, no advice. Legal bills arising from the commission have so far hit $55 million, but more are on their way.\"Expenses were up slightly for the year due primarily to increased customer compensation and remediation costs in Australia,\" Mr Elliott said. \"Excluding large notable items, expenses were down 1.5 per cent for the year, positioning us to better manage the headwinds impacting the sector.\"We are engaging constructively with the royal commission and taking action to fast-track changes. We will make the investments required to earn the trust and respect of our customers and the community.\"This was a factor in the decision to reduce variable remuneration paid to staff this year across the bank by $124 million. We are also undertaking the urgent work required to fix the failures that have been highlighted by the commission and further increased our focus on conduct issues.\"The reduced cost base came largely from job cuts, with around 5,000 employees, or 11 per cent of the workforce leaving over the year.The big asset sale program boosted ANZ's capital buffer well above APRA's \"unquestionably strong\" benchmark, two years ahead of the deadline.The full-year dividend remained at $1.60, the same level paid out in the previous two years.The initial reaction from the market was favourable, with shares jumping 1.6 per cent to $26.06 on opening (at 10:05am AEDT). \nTopics:\nbanking,\n\n\n\t\n\tcompany-news,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      October 31, 2018 08:21:07\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}