{"id": "Man charged over woman's alleged murder at Colonnades shopping centre in Adelaide", "paragraph": "\n      Updated \n    \n      October 25, 2018 14:03:17\n    \nA man has been charged over the alleged murder of a woman at one of Adelaide's largest shopping centres. Police and ambulance crews were called following reports of a woman with serious head injuries outside the BankSA branch at the Colonnades Shopping Centre in Noarlunga Centre shortly after midnight.The 36-year-old Ethelton mother of two died at the scene despite paramedics and police providing first aid.Police arrested a 20-year-old man of no fixed address at the location.He was charged with murder late this morning and is expected to face the Adelaide Magistrates Court today. Detective Chief Inspector Scott Fitzgerald said police did not believe robbery was a motive for the attack and no weapon was used.\"Police believe this man was hanging around the Noarlunga Centre area from about seven o'clock last night,\" he said.\"I can tell you that he was wearing a dark hoodie and shorts — if anyone has seen that person hanging around the Noarlunga Centre if they could contact Crime Stoppers.\"He said there was no known link between the suspect and the victim.\"We're in the process of conducting interviews with him and ascertaining his version of events as to what's occurred,\" he said.\"At the moment, it's very early in the investigation and we're just trying to piece together exactly what's occurred.\" Senior Constable Rebecca Stokes said there would be a heavy police presence in the area throughout the day, including crime scene and forensics officers.\"We'll be scouring the area for CCTV and wanting to speak to anyone who comes forward who may have more information,\" Senior Constable Stokes told ABC Radio Adelaide.Colonnades is one of Adelaide's largest shopping centres, with several department stores and supermarkets.Sarah Huxtable laid flowers at the scene after hearing about the alleged murder.\"Regardless of what time it is that she was out here, you should be able to be safe walking around anywhere,\" Ms Huxtable said.\"It gobsmacks me that people can't be safe near their own home or a place that has security.\"Another local woman, Louise, said the news was devastating.\"This is horrible, this is absolutely horrible,\" she said.\"Why can't we as women be able to walk around and do what we need to do without the fear of assault or murder, taken away from our children? Why is it this way? \"It's not being taken seriously.\" Women's Safety Services SA director of services Ginny Cisneros said the organisation was \"outraged and saddened\" by the woman's death.\"Men's violence against women in Australia is a national crisis that we, as a community, urgently need to address,\" Ms Cisneros said.\"With at least one woman a week on average being murdered, we need to address the behaviours and attitudes that condone violence against women.\"We need change and action across the board in Australia — from our political and legal settings, to our schools and communities, from the streets to our homes.\"We all have a right to safety and a role to play to ensure that women and children are safe.\"Violence against women is preventable if we work together to end the harmful behaviours and attitudes that lead to it.\"\nTopics:\nmurder-and-manslaughter,\n\n\n\t\n\tcrime,\n\n\n\t\n\tnoarlunga-centre-5168,\n\n\n\t\n\tsa\n\n    First posted \n    \n      October 25, 2018 07:24:03\n    \n\n\n\n  More\n stories from South Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}