{"id": "Storms kill two families in Sicily as wild weather pummels Italy, taking death toll to 29", "paragraph": "\n      Updated \n    \n      November 05, 2018 10:06:10\n    \nTwo families have been killed in the same house in Sicily when the torrential rains and high winds lashing Italy caused a river to burst its banks, drowning the nine people inside and bringing the total death toll to at least 29. Rushing water filled the villa in Casteldaccia in the province of Palermo in moments, killing the families who were spending Saturday night there.A father and his daughter escaped harm because they had left the house to do some shopping while a third person climbed a tree to survive.Italian news reports said the dead included a 1-year-old, a 3-year-old and a teenager.The tragedy brings the number of people killed in Sicily this weekend to at least 12 after three other people died in their cars when hit by torrents of water. Italian Prime Minister Giuseppe Conte spoke of \"an immense tragedy\" during a visit on Sunday to affected areas in Sicily.He said a cabinet meeting would be convened this week to declare a state of emergency and come up with the first package of aid for areas affected.Heavy rains and gale-force winds have battered Italy for several days, uprooting millions of trees and cutting off villages and roads. Italy's Civil Protection Agency said deaths caused by the wave of bad weather stood at 17, excluding the fatalities in Sicily.Some of the worst damage was recorded in the country's northern regions of Trentino and Veneto.Drone footage emerged on Sunday revealing the extent of destruction to roads, buildings and boats around the northern port town of Rapallo. On Saturday the governor of Veneto, Luca Zaia, said storm damage in the region amounted to at least a billion euros.During a visit on Sunday to badly-hit areas in the north, Italy's Interior Minister Matteo Salvini said 250 million euros ($395 million) had already been earmarked for relief.He said the government would be asking to use special EU funds.Mr Salvini, who is also Deputy Prime Minister, said a rough estimate of how much it would cost to safeguard Italy against such events was 40 billion euros ($63.45 billion). Reuters/AP\nTopics:\nstorm-disaster,\n\n\n\t\n\tfloods,\n\n\n\t\n\titaly\n\n    First posted \n    \n      November 05, 2018 07:17:43\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}