{"id": "Commonwealth Bank sells Colonial First State Global Asset Management for $4.1b", "paragraph": "\n      Updated \n    \n      October 31, 2018 14:39:02\n    \nThe Commonwealth Bank has announced a multi-billion-dollar shake-up of its wealth management and mortgage broking businesses, selling one and splitting off the others.CBA will sell Colonial First State Global Asset Management (CFSGAM) to Japanese giant Mitsubishi UFJ Trust and Banking Corporation (MUTB) for $4.13 billion.Known as First State Investments outside of Australia, the company currently manages about $213 billion worth of assets on behalf of financial institutions, pension funds, financial advisers and their clients, and has offices in Europe, the US and Asia-Pacific.CBA had announced in June its intention to demerge its wealth management and mortgage broking businesses and, after that announcement, was approached by MUTB about buying the international arm.The transaction is due to be completed in the middle of next year, subject to various regulatory approvals in a number of countries, including Australia, Japan, Hong Kong, Singapore, the UK and US.If it goes ahead, CBA said it will net about $1.5 billion from the transaction, after tax.\"Today's announcement represents another important milestone in CBA's strategy to focus on its core banking businesses and to create a simpler, better bank,\" the bank's chief executive Matt Comyn said in a statement.\"The sale of CFSGAM to MUTB represents significant value for CBA shareholders and is a positive outcome for CFSGAM clients and employees.\"The deal is expected to add almost $3 billion of tier one capital to the Commonwealth Bank, helping it meet the banking regulator APRA's requirement that Australia's major banks are \"unquestionably strong\" and rank in the top quarter of banks globally for safety.With the international business sold, CBA is pressing on with the demerger of its domestic wealth management and mortgage broking businesses into a seperate company, for now dubbed NewCo.The demerged business will include Colonial First State, Financial Wisdom, Aussie Home Loans, and CBA's minority holdings in CountPlus and Mortgage Choice. It will be run by former SocietyOne chief executive Jason Yetton, with CBA's current chief financial officer for the wealth management division, Andrew Morgan, continuing in the role at the demerged company.\"The appointments bring an important mix of external and internal experience, as well as a deep understanding of wealth management and financial services, to lead the new entity,\" Mr Comyn said.The demerger of NewCo still requires shareholder and regulatory approvals. Subject to these, it is expected to happen late next year.The moves are part of an industry-wide trend for the major banks to ditch so-called \"non-core\" assets, such as wealth management and insurance, to focus on their \"core\" retail and business banking operations.Commonwealth Bank investors were happy with the news, pushing its share price up 0.7 per cent to $68.63 by 2:40pm (AEDT), while the broader market was a little weaker.\nTopics:\ncompany-news,\n\n\n\t\n\tbanking,\n\n\n\t\n\ttakeovers,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      October 31, 2018 09:33:33\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}