{"id": "Melbourne Cup spotlight shines on 'full character' portraits of Winx and Black Caviar", "paragraph": "\n        Posted \n    \n      November 05, 2018 09:21:50\n    \nIt might be Victoria's big day, but sharing a little Melbourne Cup glamour will be Adelaide artist Dana Richards and her spectacular portraits of two darlings of the Australian turf.For the second year in a row, Ms Richards is displaying portraits of famous racehorses in a pre-function room for the prestigious Call of the Card event on the eve of the big race.The two oil paintings of champions Winx and Black Caviar are 1.5m x 1.7m in size and a little different to traditional equine portraits, she said.\"Historically, the equine portrait is [painted as] a total horse, often its profile, with a jockey or silks attached,\" she told ABC Radio Adelaide's Drew Radford.\"In that regards, these are very different because it's just the face and the full character of the face.\" A portrait of Winx she displayed last year impressed Tony Santic, the owner of three-time Melbourne Cup heroine Makybe Diva, so much that he bought it.\"I'm taking Winx again because she's currently a bit of a rock star and there's lots of noise around her and her massive achievement with a fourth Cox Plate,\" Ms Richards said.\"I'm also taking Black Caviar as I thought I'd expose the rivalry that's' pretty legendary between the two of them in regards of who might be the best.\"Black Caviar was retired after 25 races undefeated, while Winx has just claimed a record fourth Cox Plate and 29th victory in a row. Ms Richards said she started her work with a \"very basic\" sketch using a graphite pencil before applying oil paints.\"Drawing anatomy is a strength of mine.\"I've just applied that to horses, which came through a commission that occurred about four years ago.\"It was for a glossy fashion magazine that was doing a fashion editorial around the spring carnival and needed a couple of large horses for backdrops.\"It just rolled on from there.\" The Black Caviar and Winx paintings took about three months to complete, although with family commitments and children, Ms Richards said she didn't paint 24 hours a day, seven days a week. \"The racing fraternity love their horses and quite often that goes hand in hand with portraits, photographs and memorabilia,\" she said.\"There are lots of facets to how they display their passion in what they do, and portraits are one of them.\"I seem to be placed in a pretty good demographic.\"\nTopics:\npainting,\n\n\n\t\n\thorse-racing,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tsport,\n\n\n\t\n\tvisual-art,\n\n\n\t\n\tarts-and-entertainment,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tmelbourne-3000\n\n\n\n  More\n stories from South Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}