{"id": "Small town shops are struggling, but some regional Australian cities are fighting back", "paragraph": "\n        Posted \n    \n      November 18, 2018 08:37:35\n    \nThe main drag was once the heart and soul of many regional Australian cities, but if you walk through a town's central business district these days, you will often see for lease signs and shuttered up shops.Some of the shops and office buildings on Rockhampton's main strip, East Street, have been empty for years.  They are a daily eyesore for Peter Genders, who has run an art store in the Queensland city's CBD for more than a decade.\"It's very disappointing, very disheartening,\" Mr Genders said.\"You get tourists coming through who ask why there's so many empty shops — they ask if there's a downturn.\"It casts a negative aspect to the city and the region.\" Right across Australia, bricks and mortar retailers are struggling as big international brands move in and online shopping reigns.Even high streets in major capital cities are battling high vacancy rates.In regional cities like Rockhampton — with a population of just 100,000 people — the issue is acutely noticeable.The head of retail at real estate company Colliers International, Michael Bate, says the worst hit cities are regional ones like Rockhampton, where shopping centres have been built in suburban areas outside the CBD.\"The attractiveness of these new centres and particularly some of the new global brands that are being introduced into these [centres] is dragging away the traditional CBD shopper,\" Mr Bate said.\"The only land available [for shopping centres] has been outside the main core and therefore that has split the retail offer.\"Unfortunately, it's been to the detriment of the traditional main street of these towns which are hundreds of years old.\"On the balance, there are some great reverse trends where some of the regional councils have insisted that development only happens within the main core of the CBD.\"[In] Wagga Wagga, Albury, and even Cairns where this has happened, the CBDs are in fact flourishing.\"There is a significant trend starting to emerge in most of the regional centres, particularly on the eastern seaboard.\"Mackay is another regional Queensland city with shopping centres on the outskirts of town and empty shops in the CBD.Its local Council has been teaming up with landlords and real estate agents to give small pop-up shops two weeks of free rent in the vacant stores. The situation is a win-win — landlords get a store that looks invigorated to potential long-term paying tenants, and start-ups get a chance to try out retail.Wendy Steindl, who sells environmentally friendly products, currently has a pop-up store under the scheme.\"As a small business, obviously it's not quite viable for me yet to rent a space on a permanent basis,\" she said. \"But having these little pop-up stores brings us into the street, brings us into the CBD, and helps the small business at the same time.\"In Toowoomba, retailers are also trying to move with the times.This regional Queensland city is one of the lucky ones that Mr Bate said is better off, due to having shopping centres closer to its CBD. But men's clothing store owner Bernie Baz said times have still been tough in the CBD.\"We've noticed over the last five or six years that there's less and less demand for retail strip shopping, unless it's really specialised,\" Mr Baz said.\"A lot of that's got to do with the move to online shopping.\"So we built a little webstore to cater for those customers.\"We get between 10 and 20 of our regular customers shopping online every day and want to get it delivered, and won't come into town because of parking issues.\"Mr Baz also just opened a second store in Townsville after a landlord offered up drastically reduced rent.\"What was a $160,000 rent offer two years ago is now an $80,000 rent offer because they can't get people who want to open retail stores,\" he said.\"We were certainly looked after by our landlord in Townsville.\"But we've been looking for sites in Rockhampton and we haven't found a landlord there who is prepared to meet the market.\"Mr Genders also wants landlords to do more.\"There a lot of buildings here that are almost going into the too-far-gone column,\" he said. The Rockhampton Regional Council has been covering up some exteriors of the empty shops with decals to at least make them look nicer. \"It's a lovely lovely experience to walk past something that's bright and fresh, but it's hiding the problem,\" Mr Genders said.He called on the Council to \"strongarm\" landlords by raising their rates until they dropped rents and leased out stores.Yet in a statement, the Council's manager of regional development and promotions, Chris Ireland, said that was not possible.\"Our legal advice is that we are not able to do this,\" Mr Ireland said. He said the Council had been giving businesses rates concessions and running workshops to try and stimulate the CBD.It has also just completed a major re-development of a parallel waterfront strip to entice people back in the city — a move praised by Mr Bate. Mr Bate said there was also a case for rezoning empty retail hubs in regional Australian cities so that other types of business might come back into town.Toowoomba's Council has just revamped its CBD incentives scheme to encourage residential development, with only one application having been approved since 2015.\nTopics:\nretail,\n\n\n\t\n\tregional,\n\n\n\t\n\trockhampton-4700,\n\n\n\t\n\ttoowoomba-4350,\n\n\n\t\n\tmackay-4740,\n\n\n\t\n\ttownsville-4810,\n\n\n\t\n\taustralia,\n\n\n\t\n\tqld,\n\n\n\t\n\tcairns-4870,\n\n\n\t\n\talbury-2640,\n\n\n\t\n\twagga-wagga-2650\n\n\nContact Emilia Terzon\n\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}