{"id": "Live export review finds regulations failed, calls for strengthened oversightFeatured StoriesAdditional stories", "paragraph": "ShareABC Rural\nBy\n Clint Jasper,\n Kath Sullivan\nShareAn independent review of Australia's live export indstury calls for a regulatory overhaul.ABC NewsAn independent review has found there has been a catastrophic failure to regulate the live animal export industry.A culture of fear within the Department of Agriculture meant staff were not reporting their concerns about animal welfare within the industry, the Moss Review found.Agriculture Minister David Littleproud, who initiated the review earlier this year following revelations of thousands of sheep deaths aboard the Awassi Express, will establish an independent Inspector-General of Live Animal Exports.The review was conducted by Phillip Moss AM, a public sector integrity expert who was appointed in April this year.\"I specifically asked Mr Moss to consider an inspector-general in his review, and I said at the time I don't care who thought of the idea,\" Mr Littleproud said in a statement. \"Mr Moss recommends it so I'm doing it, I don't give a stuff who claims the credit.\"The principal regulatory officer will be key in driving cultural change within the department as well as improving compliance and investigations.\"Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume.Subscribe for the national headlines of the day.It is among 31 recommendations contained in the report, all of which Mr Littleproud said on Wednesday morning the Government had accepted.The report found the removal of the Department of Agriculture's Animal Welfare Branch in 2013 led to many of the regulatory failures identified in the report.The decision to remove that branch was a decision made by the former agriculture minister Barnaby Joyce.Mr Littleproud said this morning he would instruct the Department of Agriculture to reinstate that branch.Australian Livestock Exporters' Council (ALEC) chairman Simon Crean said the Minister's response to the Moss Review was part of suite of measures to improve animal welfare practices across the live export trade.\"The Inspector-General of Live Animal Exports [role] is very important, we called for this back in April,\" Mr Crean said in Adelaide today.\"We accept the fact we have to ensure we don't have another incident like the Awassi, we have to ensure that we are leading in the way in which animal welfare is ensured.\"We're proud of the way in which we have approached the problem.\"We have to deal with circumstances of a particular incident and the perception of the trade that came from that, but we are genuinely committed to ensuring no fear, no pain on behalf of the animal and developing very measure possible to ensure that outcome.\"The RSPCA, which has been calling for an end to all live exports, said the Moss Review showed the \"massive failings of the regulatory framework\".\"It shows the fundamental conflict within the Department of Agriculture in terms of being a facilitator and promoter of the live sheep and cattle trades, while at the same time having to regulate animal welfare standards,\" RSPCA spokesman Jed Goodfellow said.\"This is the third damning review of the live export trade we've seen in fifteen years, and the same problems keep reappearing — a callous disregard for animal welfare, inherent conflicts of interest and an impotent regulator.\"Opposition agriculture spokesman Joel Fitzgibbon said the Moss Review was a \"damning critique of Barnaby Joyce's time as minister\".\"It reminds us that he completely undermined the role and the effectiveness of the regulator of the live export trade,\" Mr Fitzgibbon said. He welcomed the decision to appoint an Inspector-General of Live Animal Exports and said he would consider the report's recommendations. Labor has promised to phase out the live export of sheep if elected at next year's federal election.In April this year, the ALEC said it would support the establishment of an inspector-general for the welfare of exported animals.\"The role of inspector-general would help oversee independence and cultural change in our industry and work constructively with exporters to improve animal welfare outcomes,\" Mr Crean said at the time.delivered to your inbox\nSubscribeMore informationNewsletter Podcasts RSSAustralian woolgrowers have gone against their research body's recommendation, ushering in a 1.5 per cent levy in what was the closest vote in the poll's history.The Australian Government pursues India over export subsidies that have led to a plunge in global sugar prices.Commercial fishers say a Queensland Government plan for 'real time' tracking devices is a case of 'Big Brother gone too far'.A proposed onshore abalone farm on Victoria's south-west coast has residents concerned about the size and location of the development. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.AEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)"}