{"id": "PoliticsRegional migration approvals stalling ahead of new five-year bush visa", "paragraph": "\n        Posted \n    \n      November 13, 2018 10:53:24\n    \nRegional visa approvals have fallen to their lowest levels in a decade as the Federal Government prepares to introduce a scheme requiring new arrivals to work outside the major cities for five years. State-specific and regional visa approvals fell to 36,250 places in 2017-18, according to new figures published by the Government.John Hourigan, the president of the Migration Institute of Australia, said recent restrictions have effectively phased out key parts of the existing regional scheme.Visas approved for the regional sponsored migration scheme have fallen from 20,510 five years ago to 6,221 last year.There are also industry expectations that worker supply will fall even further with new rules introduced earlier this year requiring three years of work experience.The change comes despite a need for more migrant workers in states such as South Australia.There are still more than 20,000 applications to be assessed under the old rules, but the processing of these has slowed to a trickle.The long processing delay — now around two years — is affecting the prospects of these applications, according to Mr Hourigan.\"The processing times are now so long that nominations involving offshore applicants are being refused on 'genuineness' grounds, \" he said.\"Because how can an employer say they've found a suitably qualified overseas worker to fill a critical vacancy today knowing that the vacancy's got to be there in two years' time once the department has commenced assessing the nomination?\"The larger state-nominated scheme, which accounted for just over 27,000 places during the last financial year, has also undergone changes.Mr Hourigan, who spent two decades in the Immigration Department, said adjustments to the points system used to approve visas had been a \"game changer\" for migration levels.\"That now means that basically everyone has to have proficient English — there are not many ways former overseas students can get to 65 points otherwise,\" he said.A Home Affairs Department spokesperson said the changes had resulted in fewer, but higher quality, visa applications.\"The Department of Home Affairs has recently introduced significant reforms to strengthen the quality of skilled visa applications, including the regional sponsored migration scheme,\" the spokesperson said.\"These include enhanced legislation on labour market testing, lowering of the qualifying age, enhanced qualifications and experience.\"Prime Minister Scott Morrison yesterday confirmed the Government was planning a new temporary visa for regional workers, which would require them to spend five years outside the major cities.He said the current process, which involves the states making submissions as part of the Federal Government's immigration planning, was \"not working as it should be\".Under the proposal, states would be required to demonstrate they have the required infrastructure and services to support more migrants.\"Just taking a top-down approach to migration levels, I don't think has served us well,\" he said.\"So what I'm saying is, we'll set what the cap is, we'll let it be demand driven, but it has to based on what the carrying capacity is at state and territory levels.\"Mr Hourigan said the Government's plan might include either more extensive agreements for specific regions, similar to the Designated Area Migration Agreement with the Northern Territory Government, or an extension of the duration of the temporary 489 visa from two years to five years before permanent residency is available.\nTopics:\ngovernment-and-politics,\n\n\n\t\n\tregional-development,\n\n\n\t\n\tregional,\n\n\n\t\n\timmigration,\n\n\n\t\n\taustralia\n\n\nContact Jackson Gothe-Snape\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}