{"id": "Pastured eggs the new 'free range' for consumers worried about animal welfareFeatured StoriesAdditional stories", "paragraph": "ShareABC Rural\nBy\n Jennifer Nichols\nShareDemand for pastured eggs drove the direction of Alexi Cox and Mark Dragan's business.ABC Rural: Jennifer NicholsConcern over animal welfare is driving demand for 'pastured' eggs as an alternative to caged and free range production.Farmers such as Alexi Cox and Mark Dragan are riding a boom, created by a backlash against new free range stocking density rates in Australia.On the outskirts of the Sunshine Coast's trendy Peregian Beach village, Ms Cox, a former film industry assistant, didn't set out to be full-time pastured egg producer.But when she and her husband opened Dragan Farms two years ago, their customers made that decision for her.ShareDragan Farms moves its chicken tractors forward every few days.ABC Rural: Jennifer Nichols\"We started with 20 chickens and we kept selling out [of eggs]. Then we got another 30 [chickens] and then we went for 300. Now we've got 1,200,\" Ms Cox said.Their chickens chase insects and roam in open paddocks, laying and sleeping in a series of mobile sheds that need to be moved every two days to fresh pasture.\"We find that when people are coming to the farm gate they want the best for their family and they're willing to pay for the quality.\"Ninety per cent of Ms Cox's pastured eggs, chemical-free fruit, vegetables and honey are sold directly from the farm, allowing them to keep egg prices to between $6 and $8 a dozen.ShareDragan Farms keeps the cost of its eggs down by selling directly from the farm.ABC Rural: Jennifer NicholsLee McCosker runs a licensing and accreditation company called PROOF — Pasture Raised On Open Fields.It is an independent certification program for producers of pork, chicken, beef, lamb, and pastured eggs, which can retail for up to $11 a dozen.\"We focus on the actual way that the eggs are produced. They have to be outside, they have to be farmed in a mobile system where there is paddock rotation, and the soils and the pasture are also managed,\" Ms McCosker said.\"This is what the consumer actually wants. They don't like the idea of the birds being kept in cages or not being able to access sunshine or pick at a worm or have a dust bath outside.\"It's much more labour intensive so therefore the eggs are more expensive than those produced under really intensive commercial systems.\"ShareLee McCosker founded PROOF: an accreditation and certification business that stands for Pasture Raised on Open Fields.ABC Rural: Kim HonanMs McCosker said pastured eggs offered an alternative to intensive production.She described Australia's new national definition of free range, introduced in April this year, as \"flawed\".\"Stocking density can be 10,000 birds per hectare and that's a massive change from the code of practice, which initially said 1,500 birds per hectare for free range.\"Australian Eggs managing director Rowan McMonnies said consumers concerned about stocking rates would find them displayed on free range egg cartons.Sunny Queen Eggs sets a free range maximum of 1,500 birds per hectare and provides logs, perches, dust baths and trees for its birds. It also live streams a video from a farm.ShareEgg prices vary according to the cost of production.Supplied: Australian EggsAustralia's appetite for all types of eggs has increased by 54 per cent over the past decade, setting a new production record of close to 6.2 billion eggs last financial year.Scrambled, poached, fried and baked, 16.9 million eggs were eaten every day, an equivalent of 245 eggs, per person, per year.The figures released by Australian Eggs reveal that for the first time last financial year, more free range eggs were sold than caged eggs.Free range eggs accounted for 45 per cent of sales compared to 44 per cent for caged eggs.\"It really is a continuation of a long term trend over 10 or 15 years,\" Mr McMonnies said.ShareAustralian Eggs managing director Rowan McMonnies says if consumers are concerned about the stocking rates for free range eggs, they can check the egg cartons for the information.Supplied: Australian EggsAnimal welfare proved a key concern for more than 12,500 people who took part in a CSIRO survey commissioned by Australian Eggs, an industry marketing and research and development group.It revealed that consumers value the eggs as a household staple but that the industry faces challenges in developing deeper levels of trust with consumers.Mr McMonnies said caged egg farmers provided an affordable product and stood by their animal welfare practices.ShareCaged eggs were outstripped by free range egg sales for the first time last financial year, according to Australian Eggs.ABC: Danielle Bonica\"There are consumers out there that only ever buy caged eggs, for whom affordability is a really key driver, and they're large in number.\"I don't know if there will be a time when they'll [caged eggs] disappear from a demand perspective … I can't see it at this stage.\" Like dollar-a-litre milk, some eggs are heavily discounted by supermarkets.Prices are under pressure from increased grain prices due to drought.Mr McMonnies said a dozen caged eggs generally sold for about $3 a dozen, barn laid for $4 to $4.50 and free range for about $6 to $7.SharePastured egg operations are often small and sell directly to customers.Supplied: Piggy in the MiddleThen there's pastured eggs.\"It seems the sky's the limit if you've got a local story and a farm that people that can go to and believe in. There are significant premiums to be obtained,\" he said.But quantifying the rise in the popularity of pastured eggs is hard to do.\"It very regularly is under the radar,\" Mr McMonnies said.\"It is local sometimes in its nature and it's not possible to observe the value or the volume of eggs that are going through those markets, often selling at farm gate sometimes to local cafes and restaurants.\"There are not many very large players that are supplying on a pastured basis to isolate it through a supermarket segment.\"SharePiggy in the Middle's Dean Mayne sells out of pastured eggs every weekend.Supplied: Piggy in the MiddleDean Mayne from Piggy in the Middle at Kilkivan near Gympie in south-east Queensland made a conscious decision to advertise his family's eggs as pastured rather than free range.\"I feel that free range doesn't have much of a meaning anymore. It doesn't have to be on grass or pasture, so yeah I think that's a thing of the past,\" he said.\"We're PROOF accredited and we feel that that's probably the best for our situation and has probably got the most values.\"The Maynes have increased their flock from 200 to 900 birds but they have no plans for further expansion because of the work involved in producing pastured eggs.\"They're very popular, we probably can't produce enough. We sell out at every weekend market, it's really good,\" Mr Mayne said.\"The yolks are nice and orange and the white is so firm when you crack 'em. It just doesn't compare.\"delivered to your inbox\nSubscribeMore informationNewsletter Podcasts RSSAustralian woolgrowers have gone against their research body's recommendation, ushering in a 1.5 per cent levy in what was the closest vote in the poll's history.The Australian Government pursues India over export subsidies that have led to a plunge in global sugar prices.Commercial fishers say a Queensland Government plan for 'real time' tracking devices is a case of 'Big Brother gone too far'.A proposed onshore abalone farm on Victoria's south-west coast has residents concerned about the size and location of the development. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.AEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)"}