{"id": "Friends actor David Schwimmer's doppelganger turns out to be a wanted thief in England", "paragraph": "\n      Updated \n    \n      October 25, 2018 10:54:06\n    \nIs Ross Geller a beer thief? Apparently not, and nor is Friends actor David Schwimmer.The alarm was raised on Tuesday when Blackpool Police put a call out looking for a man — who just so happened to look like a certain fictional New York palaeontologist — suspected of carrying out a theft in a restaurant.The Facebook post had soon attracted more than 150,000 comments, mostly from fans of the Emmy-winning sitcom, and forced Schwimmer into producing an alibi. Case closed, then. But that didn't stop the people having their fun.The comments on the Blackpool Police's post soon resembled a greatest hits of Ross Geller quotes — be warned, if you're not a fan of Friends, the following will not make much sense to you.I don't think it's been this guy's day, his week, his month or even his year …I was going to read the report for this but it was 18 pages … FRONT AND BACK! It rambled on for so long that I fell aslEEPThe One Where Ross Became a ThiefIt's not ross … It's russ, he's trying to frame ross to win back RachelCome on guys its a serious robbery, It's not that common, it doesn't happen to every guy and it is a big deal.For those that don't know what the crime was, he's accused of buying beer while on shift. The side people haven't yet heard and one I'm unsure on where I stand is, HE WAS ON A BREAK!I bet he shouted 'PIVOT' as he lifted the beers …And to anyone who still thinks he is guilty, Ross has one message for you: \nTopics:\npolice,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tinternet-culture,\n\n\n\t\n\tinformation-and-communication,\n\n\n\t\n\ttelevision,\n\n\n\t\n\tarts-and-entertainment,\n\n\n\t\n\tengland,\n\n\n\t\n\tunited-kingdom\n\n    First posted \n    \n      October 25, 2018 08:53:51\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}