{"id": "Missing offender arrested following electronic monitoring failure in South Australia", "paragraph": "\n      Updated \n    \n      November 05, 2018 13:19:12\n    \nPolice have arrested a man who has been missing for three days following an \"unacceptable\" failure of South Australia's electronic bracelet monitoring system. Yesterday it was announced that hundreds of offenders had been left unmonitored for more than 24 hours in the state following the electronic failure and that one man was still missing.The Department for Correctional Services in South Australia on Sunday confirmed the fault had left it unable to track 774 individuals who are monitored by electronic tracking devices.The communication system went down early on Friday morning and was back online at lunchtime on Saturday with the blame put on a nationwide Telstra outage.Robert Carl Stehr, 43, was granted home detention bail in Mt Gambier last Thursday and, as part of his conditions, travelled to Adelaide by bus and arrived in the city on Friday, November 2.Numerous enquiries were undertaken by police to track down Mr Stehr, who police believe may have been breaching his bail.Mr Stehr was found by police just before 9:00am today in Murray Street in Gawler, just north of Adelaide.Police said he was arrested and charged with breach of bail and was expected to appear in the Elizabeth Magistrates Court later today.Premier Steven Marshall yesterday said a thorough investigation would be undertaken into why the outage occurred and how to prevent it happening in the future. He said he was made aware of the outage on Friday and it was \"unacceptable\" from Telstra.He said the State Government would be communicating with Telstra regarding the fault and the safety of South Australian people was extraordinarily important.\"This is a very serious breach, a very serious outage and there will be a full and thorough investigation,\" he said.\"Clearly this is an unacceptable situation and clearly this is a situation that we cannot afford to occur in South Australia again.\"The Public Service Association (PSA) said corrections staff had responded in the best way they could during the weekend's nationwide Telstra outage. Nev Kitchin from the PSA said it was an alarming event for staff, with many called in at the last minute to help address the problem.\"The department's all pulled together, called people in off of their leave and put them on double shifts to make sure all the offenders in question were either being phoned or other attempts were being made to locate them,\" he said.He said while staff responded in the best way they could, a plan should be developed for future outages.\"On the one hand we're trying to save money from having these offenders on home detention which then supposedly frees up beds in prison to save us money in the long run, but if we can't rely on this technology then it's simply not worthwhile.\" Telstra confirmed the \"complex issue\" via a statement on Sunday and said the company had been in ongoing contact with the State Government.But Opposition spokesman Lee Odenwalder yesterday took aim at the current Government, highlighting another incident which occurred under its watch earlier this year.\"This comes shortly after an incident in May where the system went down for two hours … it shows that there's a minister that's in charge of the system here who is more interested doing other things … than in really looking after the safety of our people,\" he said.\nTopics:\nlaw-crime-and-justice,\n\n\n\t\n\twireless-communication,\n\n\n\t\n\tinformation-and-communication,\n\n\n\t\n\twireless-networking,\n\n\n\t\n\tcomputers-and-technology,\n\n\n\t\n\tpolice,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tsa,\n\n\n\t\n\tmount-gambier-5290\n\n    First posted \n    \n      November 05, 2018 08:09:46\n    \n\n\n\n  More\n stories from South Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}