{"id": "Fire ant plague getting worse and eradication scheme not working, Queensland farmer warns", "paragraph": "\n      Updated \n    \n      November 18, 2018 09:09:52\n    \nThe rapid spread of fire ant nests west of Brisbane is raising concerns about the effectiveness of Biosecurity Queensland's eradication program, with one Ipswich farmer saying he has lost confidence in the scheme. The National Red Imported Fire Ant Eradication Program, managed by Biosecurity Queensland, began in 2001 after the invasive pest, which has painful and potentially deadly stings, was first found at the Port of Brisbane.Fire ants have since spread across south-east Queensland into the Lockyer Valley and the Gold Coast, with infected areas treated with a bait that leaves the queens infertile.Jon Carmichael said his property at Willowbank in Ipswich is a breeding ground for the species, with thousands of nests on his land that continued to grow.His concerns come after a former Biosecurity Queensland regulatory officer told the ABC last year the eradication program was mismanaged.Mr Carmichael said he was worried that without proper treatment fire ants would continue to spread and reinfest surrounding areas.\"I treat insects all the time and I know time is of the essence — and I know how diligent you have to be if you want to get on top of things,\" he said.\"I'm just looking at what's happening on this farm and the fire ants are just spreading, they're not getting held back at all.\"There's a swamp on my land that is a huge breeding area that is reinfesting other areas, so this needs to be sorted out if they have any chance of controlling them elsewhere.\" Mr Carmichael said after alerting Biosecurity Queensland earlier this year, his property was treated with one round of aerial baiting by helicopter and had an officer treat one nest by hand. \"When you have as many as we do, hand-baiting individual nests is a waste of time, so we were led to believe we needed three consecutive treatments of aerial baiting but we haven't had another one since May,\" he said. \"Things like that don't instil you with confidence that whoever is organising the show has got things under control and it's being managed in an efficient and effective manner.\" Last year, federal and state agriculture ministers committed more than $411.4 million over 10 years towards the eradication program.But sources close to or formerly involved with the eradication effort have questioned technology solutions and the type of bait used.  Dr Pam Swepson worked as a community engagement manager for the then Department of Primary Industries, and was a report writer for the Fire Ant Control Centre when she raised doubts about the program's effectiveness 15 years ago.\"The successes were being overstated and serious problems were affecting the program back then, like the fact nests were being treated and were staying infested,\" Dr Swepson said.\"There were fire ants being found beyond the range of the program and there wasn't enough work done to help industries and businesses mitigate the risk of spreading the ants.\"The then Crime and Misconduct Commission investigated the claims and found no official misconduct, but Dr Swepson still believes the program is flawed. \"The original program in 2001 was for four applications of bait per season for three years for a total of 12 applications in areas, so spreading them out — one this year, one next year — is just throwing good bait after bad,\" she said.In a statement, Biosecurity Queensland said there was large-scale infestation on properties in Willowbank and Purga, and that a second and third round of aerial treatment would take place from next month into January and again in April and May next year. A spokesman said more intensive eradication treatment in Willowbank and surrounding areas would take place in the 2019-20 financial year.Eradication program general manager John Jordan said the nests could not be treated over winter, so aerial baiting was staged across the rest of the year.  \"For treatment we follow the ant's biology and that's a seasonal effort, so around June and July, depending on the ground temperature, the ants start to go to ground and aren't active so the bait won't be collected,\" Mr Jordan said.Queensland Agriculture Minister Mark Furner described the program as world-class and said its progress has been monitored by an independently chaired steering committee. \"There is an expert panel that assess the program on a regular basis, so we're constantly looking at the effectiveness of the program to ensure the eradication of fire ants in these areas,\" Mr Furner said.\"Just please be patient, be aware and I'm sure working together we'll address this particular pest.\"Invasive Species Council CEO Andrew Cox urged Biosecurity Queensland to further engage with landholders and the public so the program could be better understood. \"For such a big program over a population of an order of a million people, there's bound to be some people who think the program is not as good as it could be,\" he said.\"But certainly I think Biosecurity Queensland could focus more on reaching out to the community and be really clear on what they're doing so people don't have unrealistic expectations.\"\nTopics:\npest-management,\n\n\n\t\n\tpests,\n\n\n\t\n\tpest-control,\n\n\n\t\n\tstate-parliament,\n\n\n\t\n\tipswich-4305,\n\n\n\t\n\tbrisbane-4000,\n\n\n\t\n\tqld\n\n    First posted \n    \n      November 18, 2018 09:07:13\n    \n\n\nContact Rachel Riga\n\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}