{"id": "Gifted and talented school children helped to reach their full potential through MAC program", "paragraph": "\n      Updated \n    \n      October 21, 2018 13:56:41\n    \nThere was a time, not long ago, when school was a struggle for Samuel Santosh. He was \"bored out of his mind\" and tired of pestering his teachers for more challenging work, only to be given repetitive and mind-numbing worksheets and activities while the other students caught up.But nowadays the 12-year-old feels completely different.As a full-time student of Wattle Grove Primary School's program for academically gifted students, called MAC (Multi-age Academic Class), every day is different and there are endless things for Samuel to learn.\"I feel like I'm at home,\" he said.\"Now we're in the MAC class, we're always challenged with new projects and new things to learn … we do high school algebra and mathematics as well.\" Wattle Grove Primary is one of two public primary schools in Western Australia — the other is Caladenia Primary — that run a full-time program for academically gifted and talented students.The school introduced MAC in 2015, selecting the brightest minds in Years 4, 5 and 6, and putting them into the one class full-time, with a specialist teacher to constantly challenge and inspire them, and set the bar high.In between solving Year 10-level algebra and writing complex coding, the MAC students also learn circus skills such as juggling and riding unicycles, to help build resilience through failure — something many gifted children rarely experience. The program has been so successful that the school is trialling a \"mini-MAC\" this year.It is the same concept but for students in Years 1, 2 and 3, giving juniors the opportunity to learn at a higher level, avoid repetition of material they already know and mix with like-minded peers.Principal Julie Roberts said since the program's inception, a number of families had moved into Wattle Grove with the aim of getting their gifted and talented children into the MAC program.But she said being in the catchment zone and having clever children was no guarantee of entry.Ms Roberts has even fielded calls from people living overseas and she said the fact that parents were willing to move countries showed their strong appetite to meet the needs of their high-achieving children. It is widely accepted that gifted and talented children make up 10 per cent of students.\"I really can't bear to see children sitting complacently, and sometimes compliantly, and their true potential not being sought or reached,\" Ms Roberts said.\"I did believe we could do better for catering for high-achieving students.\"Really the answer to me was to provide the opportunity for them to be challenged all day, every day with like-minded, high-achieving students, despite the fact they may be of a different age.\"Children — if they're not engaged and they are high achievers — are sometimes left learning things which they already know and they become disengaged, and there can be behavioural problems.\" Wattle Grove's MAC program currently caters for 30 students, while its mini-MAC program has 24 students.The school's total student population is 755.Ms Roberts said competition for entry was \"intense\" and the school looked at results achieved across all learning areas.\"We also have a look at their attitude, behaviour, work habits, personal and social and emotional capacity, resilience — we look at a range of different aspects before acceptance,\" she said.Other than attending their MAC class full time, the students are like any others at Wattle Grove — joining in for assemblies, excursions, sport carnivals and playing with mainstream students at recess and lunch.A major factor in the program's success is that both MAC teachers are among the best in the state. Carl Sanderson, who teaches the senior class, won the WA Primary Teacher of the Year award in 2017, while Kirsty Campbell won Beginning Teacher of the Year in 2015.\"You have to be very careful and gentle,\" Mr Sanderson said. \"You make sure you're treating these kids as kids because that's what they are, they're not little robots, and the Year 4s are still small children.\"These kids want to come to school every day, they love getting out of bed.\"It's the way we structure everything. They're challenged and they're always moving forward. \"This program we're running here could work in any school, there's virtually no real cost.\"I was a teacher here anyway. You just need people who are willing to have a go at it.\"  Circus skills are an integral part of Mr Sanderson's teaching, and especially useful for high-achieving children who are used to getting things right the first time. \"We say all the time that character is everything, and so persistence is part of that character,\" he said\"Very few kids can do it so when you say to a child, 'Well if you stick at it … you'll be able to do something that less than 1 per cent of people on the planet can do'.\"That's really powerful to a child, so they want to go, 'Oh wow I really want to do it.'\"Ms Campbell said at first she was worried about the workload involved in teaching three year levels at once, but it had ended up being no different to a mainstream class where abilities can also vary greatly. \"I always thought that I would prefer to work in a school that had low socio-economic people to cater for,\" Ms Campbell said. \"But when you really think about the children in here, they are just as much at educational risk, just at the other end.\"I think that if we can get those children in earlier, identify them earlier, cater for them earlier, you'll have less of the disengagement later on in school life.\"Eileen Slater from Edith Cowan University, who has undertaken research in the field, said she hoped Wattle Grove's \"fantastic\" program would inspire other schools to do more for their gifted and talented students.She has warned schools the risks were \"vast and many\" if they did not adequately challenge their best and brightest students — some of whom she estimated spend 50 per cent of their classroom time waiting for other students to catch up. \"Every child under the United Nations charter has a right to learn,\" Dr Slater said.\"We're wasting incredible intellectual capital because if you do not do something in the early years, you will lose them by the time they are six or seven years old.\"They will just disengage.\"Dr Slater is also urging a rethink of the PEAC (Primary Extension and Challenge Program) model, which has been around since the 1980s.PEAC is a part-time program for high-achieving students in Years 5 and 6, who are identified through assessments undertaken in Year 4.Dr Slater said while PEAC teachers were very good, they simply did not have enough contact hours with the children.\"One reason that PEAC has been maintained is that it offers gifted children the opportunity to spend time with like-minded peers,\" Dr Slater said.\"This is very important for the social and emotional development of gifted children, however PEAC only operates for 2–3 hours per week.\"Opportunity classrooms like the one at Wattle Grove, cluster grouping and acceleration have students working with like-minded peers on a regular basis at their own school, where they can develop a strong sense of belonging and connection.\" She said accessing PEAC was also problematic because fees were charged and parents needed to drop off and pick up their children in the middle of the day to the courses.The Education Department said the PEAC model would continue but it would consider possible improvements next year.\"Learning options for the most academically-able primary students — which may include more targeted in-class support, enhanced Primary Extension and Challenge Classes, and full-time classes for identified children — will be developed during 2019 and considered for roll-out in 2020 and beyond,\" the department's acting director general, Jen McGrath, said.\nTopics:\neducation,\n\n\n\t\n\taccess-to-education,\n\n\n\t\n\tprimary-schools,\n\n\n\t\n\tpublic-schools,\n\n\n\t\n\twa,\n\n\n\t\n\twattle-grove-6107\n\n    First posted \n    \n      October 21, 2018 09:08:03\n    \n\n\n\n  More\n stories from Western Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}