{"id": "NT's fracking emissions could cost more than $4b a year to offset by 2030, report finds", "paragraph": "\n      Updated \n    \n      October 31, 2018 13:54:59\n    \nOffsetting emissions generated by fracking could cost up to $4.3 billion per year when the shale gas industry is at full production in the Northern Territory in 2030, according to new research by the Australia Institute. The huge sum is a warning sign of the mammoth task at hand for those responsible for developing a yet-to-be-implemented emissions offset framework in the Territory. The Australian Petroleum Production and Exploration Association has rejected the findings, labelling them a \"deliberate attempt\" to overstate potential emissions.Chief Minister Michael Gunner is bound by his word after he accepted in-full the fracking inquiry's recommendation that the NT and Australian governments seek to ensure there is no net increase in greenhouse gas emissions from onshore gas produced in the NT.\"The Government made a very clear undertaking publicly that it would require all emissions to be offset, it's absolutely essential that it goes ahead,\" Australia Institute principal adviser Mark Ogge said. Mr Gunner indicated that he is waiting on the Federal Government to take the lead on emissions policy. \"There's been a change of Prime Minister since those conversations [about national emissions policy] have started and the current Australian Government's policy is not entirely clear,\" he said.\"We are hoping for greater clarity on what they intend to do, we know we can do our bit in the Northern Territory.\" After years of what NT Labor described as \"careless\" environmental management under the previous CLP Government, on Tuesday the Territory Government announced a new environmental protection bill. The new act mentions an emissions framework, but many of the provisions in the legislation appear to be voluntary. For example, the act states \"the Minister may establish an environmental offsets framework for the use of environmental offset measures under this act or an act prescribed by regulation\". But it also states the CEO of the NT Government \"must establish an environmental offset register,\" meaning he or she would need to set up a place where companies who are offsetting their emissions would need to log their work.When it was announced on Tuesday, the environmental protection bill was criticised by the Environmental Defender's Office as \"weak\" and kowtowing to industry. \"We are shocked at the NTG announcement that it will narrow/remove repeal rights from the new Environmental Protection Bill before consultation has closed, citing industry concerns,\" it said on Twitter.\"This completely undermines trust in commitment to genuine consultation and reform.\"The Arid Lands Environment Centre also raised \"serious concerns the Northern Territory Government was being unduly influenced by industry\" during the current regulatory reforms.The research by the Australia Institute looked at Australian Government projections of the price of greenhouse gas emissions in line with the Paris Agreement over the next 50 years.The institute said the emissions price is expected to rise as time goes on when lower cost abatement measures are exhausted.\"Because fracking emissions are going to be so huge, the cost of offsetting will be huge as well, \" Mr Ogge said.It also raised concerns about the Territory's emissions offset policy into the future.\"The gas industry will almost certainly be putting pressure on the Government to water down its commitment to offsetting shale gas emissions,\" Mr Ogge said. The group representing the gas industry said the Australia Institute report findings were \"overstated\" and failed to recognise that if Northern Territory gas replaced coal into the future, this would lower Australia's emissions profile. The Australian Petroleum Production and Exploration Association also said the Australia Institute's calculations for the carbon price were \"ridiculously high\" at $110, when local and international prices were far lower.Australian Carbon Credit Units purchased through the Emissions Reduction Fund are around $13 per unit, while in Europe it is around $29 per unit.\"NT gas replacing another gas source will have a negligible impact on Australia's overall emissions profile,\" said APPEA director for SA and NT Matt Doman. Mr Doman said that upstream emissions, which are emissions for which the industry is directly responsible, are only 22 per cent of the lifecycle emissions in the Australia Institute report.\"The report is a deliberate attempt to overstate the potential emissions associated with developing the NT's onshore gas resources.\"Origin Energy declined to comment on the Australia Institute report because they believed it was an industry-wide matter.  _ \nTopics:\noil-and-gas,\n\n\n\t\n\tindustry,\n\n\n\t\n\tbusiness-economics-and-finance,\n\n\n\t\n\tenvironment,\n\n\n\t\n\tenvironmental-policy,\n\n\n\t\n\tmining-environmental-issues,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tnt\n\n    First posted \n    \n      October 31, 2018 07:31:44\n    \n\n\nContact Dijana Damjanovic\n\n\n\n\n  More\n stories from Northern Territory\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}