{"id": "AMP shares nosedive 25pc to record low on life insurance sale and funds outflow", "paragraph": "\n      Updated \n    \n      October 25, 2018 17:11:24\n    \nEmbattled financial services firm AMP has seen its share-price crash almost 25 per cent to the lowest point since it was demutualised two decades ago. In an extraordinary sell-off, AMP's already beaten down share price tumbled another 81 cents to $2.50 after it released a disappointing quarterly update, as well as a plan to sell its life insurance business.It plunged below the previous record low of $2.78 recorded in August 2003 and is down almost 90 per cent from its peak price achieved shortly after being listed in early 1998.AMP's share price has now halved this year as numerous scandals emerged out of the banking royal commission, taking a toll on the confidence of customers and investors, as well as the jobs of many senior leaders of the business, which can trace its foundations back to 1848.With the broader market already tumbling, AMP chose an extremely bad day to release more bad news.The selling accelerated after AMP management briefed investors mid-morning about its exit from life insurance, selling the business to global giant Resolution Life for $3.3 billion and its New Zealand wealth advice business through a share market float.AMP interim chief executive Mike Wilkins said the deal was \"a major step towards shaping AMP as a simpler, more focused group\" that was better positioned to compete in core markets.\"For customers, there will be no change to their existing insurance policy terms or conditions.\"For shareholders, the agreement … delivers important strategic benefits. It substantially simplifies our portfolio, delivers certainty and frees up capital.\" However the market viewed it rather differently.\"The transaction came with a large earnings reduction without a capital release [to investors],\" Shaw Partners analyst Brett Le Mesurier said.In effect, the sale of the life insurance business will punch a $340 million hole in AMP's earnings.\"Net flows of funds were as poor as I've seen,\" Mr Le Mesurier said.The Australian wealth management saw a $1.5 billion net outflow of funds over the quarter, reflecting weakness in both new funds coming in and elevated outflows.\"It was a testing quarter, particularly in Australian wealth management and Australian wealth protection, although AMP Capital and AMP Bank again demonstrated ongoing resilience,\" Mr Wilkins said.Senior analyst at the Marcus Today newsletter Henry Jennings said the flood of money out of AMP's funds illustrates the impact of the royal commission and the damage done to the company's brand.\"We're now seeing physical evidence with money walking out the door,\" he said.Mr Jennings said things could get worse.\"Clearly there are some unions pushing to take their money away and put it into other superannuation products,\" he said.\"I would have though the sale [of the life insurance business] was a step in the right direction in simplifying the business, but it does limit what the new CEO can do when he gets there.\"A lot of people have now given up up hope on it, and the new CEO looks like he'll be boxed in.\"The portfolio review was commissioned by in February this year before the Royal Commission revelations emerged by then-chief executive Craig Meller in a bid to simplify the business.In today's briefing with journalists chairman Mike Wilkins maintained that the review was not related to the Royal Commission and that the $3.3 billion sale of AMP's life business was not accelerated by Kenneth Hayne's observations in his interim report released three weeks ago.Evidence and admissions about fees for no service and misleading the Australian Securities and Investment Commission led to the sacking of Craig Meller and the resignation of chairman Catherine Brenner earlier this year.Other casualties include legal counsel Brian Salter and three directors of the AMP board. Mr Wilkins has described recent months as \"testing\", though not surprising given the reputation damage from the royal commission.Senior counsel assisting Rowena Orr QC has suggested that AMP's alleged misconduct could constitute criminal breaches of the Corporations Act.In the royal commission's interim report released three weeks ago, commissioner Kenneth Hayne observed \"a culture of greed\" where banks and insurers put the interests of shareholders ahead of customers.Incoming chief executive Francesco De Ferrari is set to replace Mike Wilkins later this year ahead of the royal commission's final report, which is due in February.\nTopics:\ncompany-news,\n\n\n\t\n\tinsurance,\n\n\n\t\n\tstockmarket,\n\n\n\t\n\ttakeovers,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      October 25, 2018 10:36:17\n    \n\n\nContact Peter Ryan\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}