{"id": "Pittsburgh shooting: Donald Trump visits Tree of Life synagogue as protesters march", "paragraph": "\n      Updated \n    \n      October 31, 2018 14:47:56\n    \nUnited States President Donald Trump, shrugging off objections from some that he was unwelcome, has offered condolences at the Pittsburgh synagogue where 11 Jewish worshippers were shot dead. Mr Trump, who opponents say has stoked a toxic political climate conducive to acts of violence, paid a brief visit to the Tree of Life temple, the scene of Saturday's attack, accompanied by first lady Melania Trump.His visit came as thousands of mourners attended the first funerals for victims of the massacre.Mr Trump and the first lady were greeted by Rabbi Jeffrey Myers, who led them inside the temple.Visiting a memorial outside the temple around 20 minutes later, the first lady placed a flower and the President placed a small stone on a marker for each of the shooting victims.Mr Trump also planned to visit hospitalised police officers and other people wounded in Saturday's gun violence.About 2,000 people, many of them members of Pittsburgh's tight-knit Jewish community, held a protest march against Mr Trump as his visit began, chanting, \"Words have meaning\", and carrying signs with such slogans as \"We build bridges not walls\".Also joining Mr Trump on his trip to Pennsylvania's second-largest city were Ivanka Trump and Jared Kushner, his daughter and son-in-law, who are Jewish and serve as White House advisers. Mr Trump's visit came just seven days before elections that will determine whether his Republican Party will maintain its control in both houses of Congress or whether the Democrats will seize a majority in one chamber or both.Pittsburgh Mayor Bill Peduto, a Democrat, told reporters before the visit was announced that the White House ought to consult with the families of the victims about their preferences and asked that the President not come during a funeral.Neither he nor Democrat Governor Tom Wolf appeared with Mr Trump.Beth Melena, campaign spokeswoman for Mr Wolf, said the Governor based his decision to stay away on input from the victims' families, who told him they did not want the President to be there on the day their loved ones were being buried.As Mr Trump's motorcade wound through downtown Pittsburgh, some onlookers saluted the President with upraised middle fingers and others with downturned thumbs.The White House had invited the top four congressional leaders to join Mr Trump in Pennsylvania, but none accompanied him. The first funerals for the victims of the attack also were held on Tuesday.More than 1,800 people, some from across the United States, came to pay respects to relatives of David Rosenthal, 54, and Cecil Rosenthal, 59, at Rodef Shalom, another synagogue in the Squirrel Hill district that forms the heart of the city's Jewish community.Police officers were posted outside the temple. The two brothers, who lived at a home for people with disabilities, were among the 11 mostly elderly congregants killed when a gunman stormed into the Tree of Life synagogue and opened fire on worshippers, yelling, \"All Jews must die\".Services were also held for Jerry Rabinowitz, a 66-year-old family physician, and retiree Daniel Stein, 71.The crowd of about 2,000 at Rabinowitz's funeral included nurses dressed in their surgical scrubs.The accused gunman, Robert Bowers, 46, was arrested after he was wounded in a shootout with police.He has been charged with 29 federal felony counts, including hate crimes, and could face the death penalty if convicted.The attack — which the Anti-Defamation League (ADL) has described as the deadliest targeting Jews in US history — has heightened a national debate over Mr Trump's rhetoric, which critics say has contributed to a surge in white nationalist and neo-Nazi activity.The Trump administration has rejected the notion that he has encouraged far-right extremists who have embraced him.Asked on Monday if Mr Trump had done enough to condemn white nationalism, White House press secretary Sarah Huckabee Sanders said the President \"has denounced racism, hatred and bigotry in all forms on a number of occasions\".Reuters/AP\nTopics:\ncrime,\n\n\n\t\n\tjudaism,\n\n\n\t\n\tdiscrimination,\n\n\n\t\n\tworld-politics,\n\n\n\t\n\tdonald-trump,\n\n\n\t\n\tunited-states\n\n    First posted \n    \n      October 31, 2018 10:29:33\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}