{"id": "PoliticsWhen your home poisons you: Investigating mould-related illnesses ", "paragraph": "\n      Updated \n    \n      October 25, 2018 11:19:39\n    \nTim Kirby was just out of university and living in a share house with his mates when he first fell sick.He and his friends knew the home in Melbourne had problems with mould. But they took what they could get.\"It was quite obvious,\" Mr Kirby said.\"But being young fellas, we thought we were pretty much indestructible.\"And I happened to be the one who was destructible, so to speak.\"He developed insomnia pretty much as soon as he moved in. Then came headaches and fatigue.He dropped from 70 kilograms down to just 47, had to leave his job, and gave up on plans to backpack around Europe.After visiting more than 20 doctors, he was diagnosed with chronic inflammatory response syndrome (CIRS). The condition is thought to be caused by mould or moisture damage.\"We knew that I had health problems as soon as I went into that house, but we didn't know the full effect of what mould could do,\" he said.\"My sensitivity to mould, I joke that it's a bit like my kryptonite.\"CIRS has been the subject of a recent parliamentary inquiry. On the committee investigating was Liberal MP, Lucy Wicks, who has also been diagnosed with the syndrome. \"I am recovering and I am largely well now,\" Ms Wicks said.\"But the stories I have heard from around the nation are not stories that I will ever forget.\"They include a person who said they had had little social interaction since 2012, resulting in \"extreme loneliness\", and a woman who told the committee \"I never take our children anywhere by myself anymore\".But the problem is there has not been much research done into CIRS or how many people in Australia have been treated for it.\"We just don't know,\" Ms Wicks said.\"We don't have clinical guidelines, a number of GPs aren't aware of it, a number of people aren't aware of it.\" The parliamentary committee has called for more research, including into the potential health effects of exposure to mould, how to test for mould in buildings, and whether current building standards are up to scratch.Its report also recommended the Commonwealth work with the states and territories to ensure tenants in private rentals and public housing are given advance warning about any previous mould or water damage in a home.\"We get pest control inspections and we get all these sorts of things when we have a look at buildings,\" Ms Wicks said.\"Mould is more of an afterthought at the moment.\"But the committee also heard from many who were sceptical about the condition, including the Department of Health.Graeme Edwards from the Royal Australian College of Physicians said doctors did believe people were suffering, but there was too much uncertainty to diagnose CIRS.\"There will be some people out there who do have a chronic inflammatory response,\" Dr Edwards said.\"Is it a syndrome that can be readily identified? The evidence is not there yet.\"He said the evidence also showed not everyone affected had an \"inflammatory response\".And the symptoms were often similar to those associated with Lyme disease, chronic fatigue or other conditions. \"There's a range of disorders, including some of the widespread pain disorders, that overlap in the clinical presentation,\" Dr Edwards said.He said that led people to go doctor shopping or to turn online to try to diagnose themselves. So the college of physicians has called for a set of clinical guidelines that would help doctors approach the issue.Caleb Rudd runs a CIRS Facebook group and website, and said many of its members had struggled to find a GP they could trust.\"By the time they've come to the group, they've been through the mill already,\" he said.\"They are thankful for the group and they feel validated.\" Mr Rudd said the parliamentary report on its own was an encouragement for sufferers.\"It offers validation and it offers hope that there'll be improvement in the education of doctors,\" he said.The Federal Government is now weighing up the committee's recommendations.Back in Melbourne, Mr Kirby said he hoped the report would help others avoid what he has been through.\"I think I've been lucky in the fact that I took the bull by the horns and went to see psychologists and went to get mental health support,\" he said.\"A lot of people will talk about families getting broken up, whether it's because of the stigma or someone not being believed. There's a real human cost here that needs to drive change.\" \nTopics:\ngovernment-and-politics,\n\n\n\t\n\thealth,\n\n\n\t\n\tdiseases-and-disorders,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      October 25, 2018 08:18:41\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}