{"id": "Central Australia perfect for federal prison for terrorists, business group tells government", "paragraph": "\n      Updated \n    \n      October 31, 2018 08:53:01\n    \nCentral Australia could be the location for an \"Australian Alcatraz\" that houses high-level terrorists, if an Alice Springs business group proposal goes ahead. The Alice Springs Major Business Group (ASMBG) is currently lobbying for a privately run detention centre to be built in the middle of the Red Centre, with the facility purposely designed to detain criminals who have broken federal terrorism laws.It hopes the project will woo private investment and create a new industry in the NT.The ambitious proposal has made its way to the desks of the Northern Territory Chief Minister as well as the federal Home Affairs Minister Peter Dutton.In a letter sent to the Chief Minister, the business group chaired by Alice Springs airport manager David Batic, said the correctional facility would serve a critical need for a \"centralised USA-style federal penitentiary\".\"The ASMBG recognises the critical issues associated with management of incarcerated terrorists within the current Australian correctional system and are proposing a dedicated terrorist correctional facility to be built in Central Australia,\" Mr Batic wrote.He added that he believes the New South Wales and Victorian governments have differing approaches to the imprisonment of terrorists and the facility could be an apt solution. \"Despite the magnitude of the consequences there is no agreed approach to managing Australia's terror prisoners,\" he stated.The ASMBG also states that the cost of the prison could be between $450-600 million and may be eligible for the Federal Government's loan scheme, the Northern Australia Infrastructure Fund.The Federal Government would be required to sign off on it, given it would be for people who had broken Commonwealth laws.During Question Time in Northern Territory Parliament on Tuesday, Chief Minister Michael Gunner said a prison for terrorists was not in the Government plans for developing Alice Springs, but said it would not stand in the way of private sector projects.\"A correctional facility for the Australian Government to house a certain class of prisoner doesn't fit the strategic direction we have for the Northern Territory or Alice Springs,\" he said.\"But having said that I never want to get in the way of the private sector and private sector projects. \"It's not a government project, it's not on government land, it doesn't involve the Territory Government at all — it's a private sector on private sector land that involves the Australian Government.\"Opposition Leader Gary Higgins dubbed the project \"Australian Alcatraz\" and has compared the proposal to the notorious facilities the United States military uses to detain terror suspects.\"How can the Government even consider building the equivalent to Guantanamo Bay just down the road from some of the country's most important cultural and tourism locations?\" he said.Mr Higgins also queried whether the proposal meant the Northern Territory Government was open to privatising its prison system.\"The Chief Minister refusing to rule out an Alcatraz-style facility for Alice Springs is very telling,\" he said.\"The Opposition supports initiatives to grow the Territory economy, but does not support prison pursuits that seek to attract terrorists, not tourists, to Central Australia. \"The Chief Minister must assure Territorians that the facility will not be built in their community.\"The Home Affairs Minister has been contacted for comment.\nTopics:\ngovernment-and-politics,\n\n\n\t\n\tprisons-and-punishment,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tindustry,\n\n\n\t\n\talice-springs-0870,\n\n\n\t\n\tnt\n\n    First posted \n    \n      October 31, 2018 08:17:31\n    \n\n\n\n  More\n stories from Northern Territory\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}