{"id": "Byron Bay tourists could be hit with $200 fine for smoking on the beach, to reduce cigarette butt litter", "paragraph": "\n        Posted \n    \n      October 31, 2018 10:32:41\n    \nVisitors to Byron Bay could be fined up to $200 for lighting up on the beach in a bid to cut down on cigarette butt litter.The Byron Shire Council, in northern New South Wales, conducted an audit of litter across the region in 2017 and discovered more than 80 per cent of discarded items were cigarette butts.In response, the council voted to ban smoking on local beaches and will use its rangers to issue fines of up to $200 to anyone caught lighting up.The council also launched a campaign called 'Butt Free Byron Shire' using a grant from the NSW Environment Protection Authority. Council's waste education and compliance officer Kate Akkerman said there had been a 28 per cent reduction in cigarette litter since the campaign began in April.\"Seven billion cigarette butts are thrown away annually in Australia — it's a massive problem,\" she said.\"The decline has been completely consistent and we're hoping smoking-related litter in the Byron Shire will continue to decline but over summer is when we'll need to bump up enforcement and education.\"Ms Akkerman said the shire's 2 million annual visitors, including a large percentage of international tourists, would put the campaign to the test.\"Our aim is to get a 40 per cent reduction by next year, but it's the visitors who come through who make it a bit tricky,\" she said.\"The reduction has occurred during the quiet period, but the message can get lost when people are only here for a day or a month.\"We're trying to let people, who are only here for a short time, know that they can't drop their butts.\"Ms Akkerman said the campaign also included the installation of more than 100 'enviropoles' across the shire for cigarette disposal. The poles are commonly attached to bins and include a liquid medium inside that helps to extinguish cigarettes.When the poles are full, the contents are collected and parts sent to the US for recycling.\"The fact they can be recycled is the coolest part,\" Ms Akkerman said.\"The old tobacco and paper is composted, but there is plastic in the cigarette butt, so they remove the plastic and it is transformed into things like furniture and other plastic products.\"She said the council's long-term goal was to recycle the butts locally.\"Enviropole is a Victorian company that services them, they collect them from the Byron tip and take them to America to be recycled,\" she said.\"Recycling them in Australia is going to take a bit of time, but it would be wonderful if we could do it here in the Byron Shire.\"\nTopics:\nsmoking,\n\n\n\t\n\tenvironment,\n\n\n\t\n\tenvironmental-impact,\n\n\n\t\n\toceans-and-reefs,\n\n\n\t\n\tlocal-government,\n\n\n\t\n\ttourism,\n\n\n\t\n\tlifestyle-and-leisure,\n\n\n\t\n\ttravel-and-tourism,\n\n\n\t\n\tbyron-bay-2481,\n\n\n\t\n\tocean-shores-2483,\n\n\n\t\n\tbrunswick-heads-2483,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\tmullumbimby-2482\n\n\n\n  More\n stories from New South Wales\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}