{"id": "JM Kelly construction company collapse leaves workers 'numb' and subcontractors unpaid", "paragraph": "\n        Posted \n    \n      October 25, 2018 09:34:39\n    \nRick Evans' work as a concrete driller in Rockhampton is gruelling work — but it is not nearly as stressful as being left stranded with unpaid bills.\"You lose sleep of a night time wondering what you're going to do about the next bill,\" he said. \"You expect these big fellas to pay you and it just doesn't happen.\"The small business owner is one of many subcontractors that have been left in the lurch after the collapse of a major construction company in the central Queensland city.JM Kelly went into administration last week, with eight of its companies now in liquidation. The collapse has left 230 locals out of work, and projects like a supermarket, hockey field and a hospital wing half built.Mr Evans said the company had been behind on its payments for a long time. The situation was so bad that, in September, Mr Evans vowed to never do work for the company again — a big statement in a small market dominated by big companies like JM Kelly.With the company in administration, Mr Evans said he did not expect to be paid back the $4,000 he claimed to be owed for helping JM Kelly build a playground for the local council.\"We probably won't see that money,\" he said.\"But that's nothing compared to some of the people in town and what they've lost.\"Another subcontractor the ABC spoke to claimed the company's collapse had left them owed $20,000.The Queensland Construction and Building Commission (QBCC) had seen a spike in complaints about unpaid bills by the company from subcontractors in the last few months.Its commissioner, Brett Bassett, said they had managed to claw back some money for subcontractors — including Mr Evans — before the company went into administration.He said they had told the company that they were considering suspending their licence just weeks before it announced it was going into administration. He added that, since then, the QBCC had been in \"very promising\" conversations with the company's administrator, PwC, about getting payments for subcontractors still owed.\"Quite frankly, any amount of money that people are owed, is simply too much and it would have a devastating impact,\" he said.More than 200 locals have also lost direct jobs at the company.This week at a crisis employment forum held for them in Rockhampton, some redundant workers were still coming to terms with the situation. Judy Dash from the Salvation Army, which was on hand at the forum to offer help, said many had been left jobless just months before Christmas.\"A lot of people are confused and numb,\" she said.Doug Clark had been with the company for 25 years before he was called into a meeting last week and told about the liquidation.\"You're upset and angry. It takes a while to get over the shock of it,\" he said.JM Kelly is the second building company to collapse in the city since June, leaving many people in the market looking for work.Mr Clark said he may have to leave his hometown and family to keep money coming in.\"I've applied for jobs down in Brisbane. If I have to move, I have to move,\" Mr Clark said.\"It's part of the industry I suppose. There was a downturn the last few years.\"Les Williams from the lobby group, Subcontractors Alliance, said the construction industry had been hit by collapse after collapse in the last five years.\"Since 2013, this one will now be the 37th construction company that's gone into liquidation in Queensland,\" Mr Williams said.\"And the number of subcontractors affected has been over 5,000 and the amount of money around $450 million.\"In a statement last week, the company's director John Murphy said the company's woes were due to a legal dispute with the QBCC. He said that stopped the company from bidding for lucrative Queensland Government contracts. The ABC confirmed the company had been precluded from bidding for about $37.5 million of local work with The Department of Housing and Public Works since March this year.  Just three weeks before it entered administration, JM Kelly was awarded a $3.4 million contract with Rockhampton Regional Council to build a hockey field.Aldi managing director Bronwyn Post said the supermarket chain paid the company $772,000 to build its first Rockhampton supermarket one week before it went into administration. \"We will work as closely as possible with [JM Kelly's administrators] to do what we can to ensure subcontractors are dealt with in a timely manner,\" she said.JM Kelly declined to comment.\nTopics:\nbuilding-and-construction,\n\n\n\t\n\twork,\n\n\n\t\n\tsmall-business,\n\n\n\t\n\trockhampton-4700,\n\n\n\t\n\tmackay-4740\n\n\nContact Emilia Terzon\n\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}