{"id": "Arnhem Land's Wuyagiba Study Hub celebrates first cohort of bridging course graduates", "paragraph": "\n      Updated \n    \n      October 26, 2018 18:58:17\n    \nIn a seaside pop-up classroom, nearly 1,000 kilometres from Darwin, a group of young people from Ngukurr were recently faced with their first ever university-style assignment — a 500-word essay on who they are. \"Essay\" itself was a daunting word for some in the group, many of who did not finish high school.Ernest Junior Daniels, a 20-year-old mentor, also pointed out that academic English was far different to the Kriol — an English-based language — spoken in this south-east corner of Arnhem Land. \"It's kind of hard for us to write in English,\" he said.\"The little words like 'the' and 'a' in Kriol, as we speak, we don't use [them] most of the time, whereas in English you use them a lot, to make things more specific.\"But the students are used to challenges, and the essay's theme — personal identity — was carefully chosen for the class at the newly created Wuyagiba Study Hub.It captured the twin aims of the bridging course project: to ground students in cultural knowledge while developing their western academic skills.The hope is to get some of Ngukurr's young people into and through university for the first time in decades. The course's lecture on identity was delivered by Kevin Guyurryurru Rogers, who was among a handful of now elders from Ngukurr who studied teaching in the 1980s — since then no one else from the community has graduated from university.Mr Rogers was one of the driving forces behind the study hub project, which was launched last month as a trial on his family's remote Wuyagiba outstation near the Gulf of Carpentaria. \"[Before], there was nothing after finishing Year 12 to help them adapt and get their academic skills [at a] level to go through to university,\" he said.\"[At Wuyagiba] they not only upgrade their academic skills but learn about cultural ways.\"Over the four-week course, students brushed up on English grammar and written Kriol as well as learning computer skills, essay writing and citation, while also revising cultural lore and practices with elders.The project was funded through crowd-sourced and philanthropic donations scraped together by Macquarie Universitys Emilie Ens, an environmental scientist-turned-community organiser, who has been working in Ngukurr for the past decade.The bulk of funding and resources for the project came from the university, coordinated by its Aboriginal engagement unit, where the graduating students will travel next week to find out more about study options. The students' goals range from environmental science and engineering to policing and admin work.The oldest student, Regina Rogers, said that most of all, she wanted to see her people better-equipped to run services and businesses in Ngukurr, where, like in many remote Aboriginal communities, the higher-paid professional jobs are largely filled by non-Aboriginal outsiders.\"We want to control our country, you know, and our workplace position,\" she said.\"We don't want white people to come and take control, because we can do it, we can achieve — Indigenous people running our own community.\" The hard part for the students is ahead of them and the study hub's future is also uncertain.It has no ongoing funding and the program has not been evaluated.But Kevin Rogers said he believed in the drive and abilities of this first group of graduates.\"I feel very proud that we have found a way to help our young people,\" he said.\"I'm very pleased for them, and I'll support them in any way I can.\"  _ \nTopics:\naccess-to-education,\n\n\n\t\n\teducation,\n\n\n\t\n\teducation-associations,\n\n\n\t\n\teducation-collaborative-projects,\n\n\n\t\n\tuniversity-and-further-education,\n\n\n\t\n\tindigenous-aboriginal-and-torres-strait-islander,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tngukurr-0852\n\n    First posted \n    \n      October 21, 2018 09:27:06\n    \n\n\nContact Jacqueline Breen\n\n\n\n\n  More\n stories from Northern Territory\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}