{"id": "Myanmar's Aung San Suu Kyi stripped of Amnesty International's top human rights award", "paragraph": "\n      Updated \n    \n      November 13, 2018 09:10:01\n    \nAmnesty International has withdrawn its most prestigious human rights prize from Aung San Suu Kyi, accusing the Myanmar leader of perpetuating human rights abuses by not speaking out about violence against the Rohingya Muslim minority.Once hailed as a champion in the fight for democracy, Ms Suu Kyi has been stripped of a series of international honours over a Rohingya exodus that began in August 2017.More than 700,000 members of the mostly stateless group fled across Myanmar's western border into Bangladesh after the Myanmar military launched a crackdown in response to Rohingya insurgent attacks on the security forces.UN-mandated investigators have accused the military of unleashing a campaign of killings, rape and arson with \"genocidal intent\". Ms Suu Kyi's administration rejected the findings as one-sided, and said the military was engaged in a legitimate counterinsurgency operation.The international human rights group named Ms Suu Kyi as its 2009 Ambassador of Conscience Award recipient when she was still under house arrest for her opposition to Myanmar's oppressive military junta.In the eight years since she was released, Ms Suu Kyi led her party to election victory in 2015 and set up a government the following year, but she has to share power with generals and has no oversight over the security forces.Amnesty International said in a statement on Tuesday she had failed to speak out and had \"shielded the security forces from accountability\" for the violence against the Rohingya, calling it a \"shameful betrayal of the values she once stood for\".The global advocacy organisation's secretary-general, Kumi Naidoo, wrote to Ms Suu Kyi on Sunday saying the group was withdrawing the award because it was, \"profoundly dismayed that you no longer represent a symbol of hope, courage, and the undying defence of human rights\".In March, the US Holocaust Memorial Museum rescinded its top award from Ms Suu Kyi and she has had other honours withdrawn, including the freedom of the cities of Dublin and Oxford, England, over the Rohingya crisis.In September, Canada's Parliament voted to strip Ms Suu Kyi of her honorary citizenship.Reuters\nTopics:\nawards-and-prizes,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\tworld-politics,\n\n\n\t\n\trights,\n\n\n\t\n\thuman-rights,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tunrest-conflict-and-war,\n\n\n\t\n\tburma,\n\n\n\t\n\tasia\n\n    First posted \n    \n      November 13, 2018 08:04:37\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}