{"id": "Apple sheds $US50b in value, Wall St drop sparks losses across Australian and Asian markets", "paragraph": "\n      Updated \n    \n      November 15, 2018 10:48:05\n    \nThe Australian share market has closed lower after a session in the red, following a heavy sell-off on Wall Street sparked by falls for Apple and technology stocks.The ASX 200 ended down by 1.8 per cent after a day of broad-based losses, led by steep falls in the technology sector, which followed its US counterpart.Among the local tech stocks feeling the pain were buy now, pay later firm Afterpay (-6 per cent) and software company Wisetech (-3.7 per cent).Apple was a major drag on Wall Street overnight, with its share price slumping 5 per cent to $US194.17, wiping out its gains from the past three months.In dollar terms, the United States' largest technology company lost $US50 billion — taking its market value down to $US921 billion.The recent wave of selling gripping tech stocks has led to Apple losing its status as a trillion-dollar company.Apple warned earlier this month that holiday sales would miss Wall Street expectations, blaming the fall on weakness in emerging markets and foreign exchange costs.The first catalyst was Lumentum Holdings — the main company which supplies the iPhone's facial recognition technology — cutting its revenue forecast by $US70 million.Lumentum blamed the cut on a client that was \"one of our largest … for laser diodes for 3D sensing\", which analysts said could only be Apple.\"Many suppliers have lowered numbers because of their unnamed 'largest customer', which is Apple,\" Elazar Capital analyst Chaim Siegel said.\"Apple got cautious in their guidance and it's hitting their suppliers.\"There were also other iPhone suppliers which provided weak forecasts.Screen maker Japan Display also cited lower smartphone demand in cutting its own outlook, while British chipmaker IQE said lower orders from a major customer would reduce its results for this year.Shares in Lumentum plunged 33 per cent, dragging down shares of other suppliers and chipmakers.The tech-heavy Nasdaq index was hit hardest in the US, tumbling by 2.8 per cent, while benchmark S&P 500 lost 2 per cent to 2,726.The Dow Jones dropped 602 points, or 2.3 per cent, to 25,387 — with investment bank Goldman Sachs being the biggest drag on the industrial-skewed index.Goldman Sachs fell 7.5 per cent after Malaysia's Finance Minister, Lim Guan Eng, said the country was seeking a full refund ($US600 million) from the bank, Bloomberg reported.Malaysia paid the Wall Street bank to arrange billions of dollars worth of deals for troubled state fund 1MDB, which is at the centre of a corruption scandal that brought down the country's former Prime Minister Najib Razak.The Australian share market was under pressure from the start of trade, with no sector spared from the sell-off.The big four bank stocks were a major weight on the ASX, led by a steep 5.4 per cent fall for Westpac as it traded ex-dividend. The losses also extended to Asian markets but Tokyo's Nikkei is off its earlier lows and the Shanghai Composite is now in positive territory at 4:45pm (AEDT).\nTopics:\nbusiness-economics-and-finance,\n\n\n\t\n\tmarkets,\n\n\n\t\n\tstockmarket,\n\n\n\t\n\tcurrency,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      November 13, 2018 07:44:19\n    \n\n\nContact David Chau\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}