{"id": "Denmark calls for fresh EU sanctions on Iran after alleged assassination plot foiled", "paragraph": "\n        Posted \n    \n      October 31, 2018 09:10:38\n    \nDenmark says the Iranian government intelligence service had tried to carry out a plot to assassinate an Iranian Arab opposition figure on its soil. The alleged plot, which Denmark's Foreign Minister Anders Samuelsen said he believed the Iranian government was behind, prompted the Nordic country to call for fresh European Union-wide sanctions against the Islamic Republic.\"We are dealing with an Iranian intelligence agency planning an attack on Danish soil. Obviously, we can't and won't accept that,\" Mr Samuelsen said.Denmark's ambassador in Tehran had been recalled for consultations, Mr Samuelsen added.A Norwegian citizen of Iranian background was arrested in Sweden on October 21 in connection with the plot and extradited to neighbouring Denmark, Swedish security police said.The suspect has denied the charges and the Iranian government also denied any connection with the alleged plot.\"This is a continuation of enemies' plots to damage Iranian relations with Europe at this critical time,\" Iranian foreign ministry spokesman Bahram Qasemi told Tasnim news agency. The attack was meant to target the leader of the Danish branch of the Arab Struggle Movement for the Liberation of Ahvaz (ASMLA), Danish intelligence chief Finn Borch Andersen said.ASMLA seeks a separate state for ethnic Arabs in Iran's oil-producing south-western province of Khuzestan. Arabs are a minority in Iran, and some see themselves as under Persian occupation and want independence or autonomy. The EU is trying to save 2015's Joint Comprehensive Plan of Action (JCPOA) deal with Iran that curbed its nuclear activity in exchange for the lifting of international sanctions. Signed initially with the UN Security Council's permanent members and Germany, the deal suffered a major blow after the United States withdrew from the pact and reimposed far-flung financial penalties on Tehran in May.Danish Prime Minister Lars Lokke Rasmussen called the planned attack \"totally unacceptable\" and British Prime Minister Theresa May had voiced her support for Denmark during a meeting in Oslo.US Secretary of State Mike Pompeo congratulated Denmark and called for its \"allies and partners to confront the full range of Iran's threats to peace and security\".In a series of events akin to Danish drama thrillers, Danish police shut two major bridges to traffic and halted ferry services from Denmark to Sweden and Germany in a nationwide police operation to prevent a possible attack in late September.A few days earlier, the Norwegian suspect had been observed photographing and watching the Danish home of the ASMLA leader, police said.In November 2017, Ahmad Mola Nissi, an Iranian exile who established ASMLA, was shot dead in the Netherlands.The Danish security service then bolstered police protection of the ASMLA leader in Denmark and two associates.In September, Iran summoned the envoys of the Netherlands, Denmark and Britain over a shooting attack on a military parade in Khuzestan in which 25 people were killed. Iran accused the three countries of harbouring Iranian opposition groups.Another Arab opposition group, the Ahwaz National Resistance, and the Islamic State militant group both claimed responsibility for the parade attack, though neither has provided conclusive evidence to back up their claim.Last week, diplomatic and security sources said France had expelled an Iranian diplomat over a failed plot to carry out a bomb attack on a rally in the Paris area by an exiled Iranian opposition group.Reuters\nTopics:\ncrime,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tworld-politics,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tdenmark,\n\n\n\t\n\tiran-islamic-republic-of\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}