{"id": "Sydney's Anglican schools fight for exemptions which allow discrimination against gay teachers", "paragraph": "\n      Updated \n    \n      October 31, 2018 11:30:12\n    \nThe heads of 34 Anglican Schools in NSW have written to federal MPs urging them to protect exemptions in the Sex Discrimination Act that allow them to sack gay teachers. The letter was signed by principals from some of Sydney's most prestigious private colleges, including Abbotsleigh, Shore and The Kings School.It was also sent to Prime Minister Scott Morrison and Opposition Leader Bill Shorten.It follows the Government's decision to introduce a new Religious Discrimination Act to protect gay students.The decision, during campaigning for the Wentworth by-election, was sparked by a leaked review into religious protections in Australia by former Liberal MP Philip Ruddock.It recommended the legislative provisions allowing religious schools to discriminate on the basis of sexual orientation, gender identity or relationship status should be made consistent around the country.However, the letter dated October 25 said there was little evidence that gay students or staff had been dismissed by religious schools.\"By and large across faith-based schools, the issue at hand is the right to employ staff who support the ethos of the school,\" the letter read.The letter also detailed how teachers were not just educators but also \"powerful mentors\" for young people.\"It is not appropriate, for example, for a teacher to undermine or denigrate the beliefs and teachings of an employing school,\" the letter read.\"This is a reasonable expectation not only for the employing school but also of many parents and families who have chosen the school for their children's education.\"The principals' letter requests that religious exemptions stay in place until religious freedoms are legally protected.\"The current exemptions, however clumsy, in the Sex Discrimination Act 1984 are really the only significant legal protections available to schools to maintain their ethos and values with regards to core issues of faith,\" the letter said.\"A more general positive right would be far better, but until such time as religious freedom is codified in legislation, the exemptions should remain.\"The principal of Sydney's Shore Church of England Grammar School Tim Wright questioned the need for a new act this morning on ABC Radio Sydney.\"There hasn't been any gay student expelled from an Anglican school in my memory, and there hasn't been a gay staff member sacked from an Anglican School in my memory,\" he said.\"At interview the question we ask is 'are you able to support the Christian ethos of the school?'\"Many of our staff live with their boyfriend or girlfriend … and we accept that.\"The Government wanted to draft laws to stop discrimination against gay students in the last sitting period as a matter of urgency, but Labor and the Coalition were unable to reach a deal and the matter was deferred until the next sitting of Parliament.The Government is still considering whether to end the exemptions for teachers, saying that ending discrimination against students is its first priority.Federal Education Minister Dan Tehan said there was a balance to be struck when considering the protection of religious freedoms.\"At the same time we've got to get the balance right when it comes to discrimination based on gender, based on sexual preference,\" he said.\"... the Attorney-General is looking at this incredibly closely and he wants to make sure what he's recommended to the Cabinet ... gets that balance right.\"\nTopics:\nreligion-and-beliefs,\n\n\n\t\n\treligious-leaders,\n\n\n\t\n\tanglicans,\n\n\n\t\n\tgays-and-lesbians,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tsydney-2000,\n\n\n\t\n\tnsw\n\n    First posted \n    \n      October 31, 2018 09:22:10\n    \n\n\n\n  More\n stories from New South Wales\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}