{"id": "The bears have the bulls on the run all over the world. All eyes are on what happens next", "paragraph": "\n        Posted \n    \n      November 18, 2018 09:47:55\n    \nThings are looking jittery again. The big broker Bank of America Merrill Lynch warned its clients over the weekend that risk of another \"flash crash\" in markets is rising.Its strategy team said rising volatility across a range of asset classes and the rapid winding up of speculative positions and debt in places like the oil market was a sign a bear market could have further to go.There's a heady list of issues troubling the Wall Street investment bank, but its primary worry is the big institutional investors it deals with have yet to reach peak pessimism. In other words BoAML's famous \"Bull and Bear Indicator\" is not flashing red yet and markets haven't hit rock bottom.\"Ingredients of flash crash rising ... bond, foreign exchange, equity volatility all trending up, vicious deleveraging events, dislocation risk via abnormal spreads ...  triggers could be violent US dollar move and/or shock macro data forcing abrupt GDP and earnings downgrades,\" BoAML's dot points noted.Its survey of big fund managers found optimism at its lowest point since 2008.But it's not total capitulation, only 11 per cent of those surveyed thought the world would be dragged into recession next year. So after charging for the best part of a decade, are the global bull markets about to bite the dust?Since early 2009, at the depth of the financial crisis, global equities have almost trebled in value, but now the bears are out and about and have taken some sizeable chunks out of most markets.China's CSI300 — comprising the top 300 stocks on the Shanghai and Shenzhen markets — the MSCI emerging markets index, Hong Kong's Hang Seng and South Korea's KOSPI are in bear territory, down more than 20 per cent from the peak in the past 12 months. Germany's DAX is the next most vulnerable, down more than 16 per cent and falling.Australia's ASX200 is back flirting with a correction, just shy of a 10 per cent retreat.A decade of near invincibility has driven many markets and listed companies way beyond sane valuations.Toss in rising interest rates, global trade tensions and slowing growth and bulls have got the staggers. Significantly, two economic superpowers, Germany and Japan, are looking a bit crook, coughing up negative third-quarter GDP numbers last week.Around half the biggest listed corporates in both countries are in bear territory. In Australia the figure is around 40 per cent, in China it's closer to 90 per cent. AMP's Shane Oliver says in simple terms there are three types of significant share market falls.Examples of \"gummy bear\" markets would be 1998, 2011's stumble and the loss of momentum from 2015 through to 2016.For the full \"grizzly\" look no further than 2009's GFC or the tech-wreck of the early 2000s.\"A grizzly bear market is unlikely because, short of some unforeseeable external shock, a US, global or Australian recession is not imminent as the excesses that normally proceed recession are not present on a significant enough scale,\" Dr Oliver said.However a \"gummy bear\" outcome in Australia is a distinct possibility.\"A lot of technical damage was done by the October fall that has left investors nervous, the rebound from late October was not particularly convincing and many of the drivers of the October fall are yet to be resolved,\" Dr Oliver said.Last week certainly had a gummy bear feel about it with markets rediscovering their distaste for risk last week.Fund manager spat out shares, happy enough to pocket some profits in uncertain times.The US fell 2.5 per cent over the week. Australia was down more than 3 per cent, Japan, the UK and Europe fared a bit better. China bucked the trend and gained around 3 per cent, erasing some of the year's losses.Futures trading on the ASX points to a modest rise on opening. It's a tough time to be an aging bull, but there may be a chance of dodging the abattoir a bit longer.The Federal Reserve is certainly on track to raise rates again in December, but the feeling is the trajectory of hikes may be lower given the damage it could do to a slowing US and global economy.The vacillating trade tensions between the US and China ended the week on a positive note and civil talks about resolving differences are again a possibility.It may not be enough to give the bulls a second wind, but it probably should keep the bears at bay for a while longer.Oil remains a significant wildcard.On face value, the tumbling oil price — most definitely in bear territory having fallen close to 30 per cent since the start of October — is terrific news for motorists.It also caps inflation, and by extension should take some heat out of rising interest rates.The downside is a falling oil price is often a precursor to the global economy hitting the brakes. A slow down doesn't need to burn nearly as much fuel. Being oil, it is not as simple as that. The Saudis, Russians and all the big exporters are in a tough spot.Having scaled up production in anticipation of tough US sanctions against Iran, they were blindsided by exemptions given to eight of Iran's biggest customers, including China.So is oil heading \"gummy\" or \"grizzly\" bear market? Forecasting oil prices, even for the professionals, seems to have transitioned from tricky to futile.Nonetheless, analysts are a game bunch and don't have a lot else to do but forecast prices.The consensus guess is a meeting of OPEC leaders next month will attempt to tighten the taps again.That would put something of a floor under prices and avoid the 75 per cent, very grizzly fall that occurred between 2014 and 2016. RBC's head of commodities strategy, Helima Croft says the recent oil market carnage has swung sentiment rapidly and challenged the conviction of even the most confident market participants. However, Ms Croft told clients in a research note over the weekend the fundamental landscape has not changed that much.\"While there is an argument to be made that long-term macro sentiment has deteriorated and thus may have affected the longer-term demand side of some commodity balances, such an explanation is unable to account for the recent carnage,\" Ms Croft said.'Fundamentally, we believe the bottom is near, particularly as OPEC appears ready and willing to act.\"Of course, there are upsides to cheaper oil. It's one less headwind a stalling economy has to deal with, and the recent 30 cent a litre fall at the pump puts an extra $10 a week in the average household's wallet.Australian house prices are not in bear territory. Sure a correction is thereabouts, but the bears are aren't about to come kicking in the front door anytime soon.That said, Saturday saw another insipid effort from buyers.Final auction clearance rates in Sydney and Melbourne will barely be above 40 per cent, suggesting prices will fall further from the current respective year-on-year declines of 9 per cent and 5 per cent respectively. However, there may be subtle change in sentiment going on.Westpac's consumer survey uncovered some interesting trends.Buyer sentiment via the 'time to buy a dwelling' index improved sharply but price expectations fell to new lows.Deutsche Bank strategist Tim Baker is not a housing bear, saying house prices will keep falling, but should stop short of a 15 per cent correction from the peak. \"The risk of a negative wealth effect lingers, but we think it will prove quite mild,\" he said. \"Unlike in the 2000s, households seem to have been prudent through this house price cycle — there's actually been home equity injection [not withdrawal] in aggregate.\"That's consistent with sentiment surveys, with households deciding three years ago that paying off a mortgage was wiser than investing in housing.\"Mr Baker is not overly worried that glum householders will stop spending and put further pressure on the broader economy.\"House prices meant little for spending while they were rising, and may mean little on the way down also.\"This week's undoubted highlight will be the resumption of the banking royal commission.Round seven is back in Sydney and runs through this week and next. The guests of honour (if that's the correct phrase) will be the big bank CEOs.While they batted away MPs in Canberra. Commissioner Kenneth Hayne and his counsels-assisting are an entirely different kettle of fish. Think sharks as opposed to mullets.Data-wise it is a pretty quiet week locally and overseas.There's a bit of RBA action with governor Philip Lowe speaking on \"Trust and Prosperity\" at a CEDA function in Melbourne on Tuesday evening. Minutes from the board's November meeting are also out on Tuesday.AGM season rolls on with Fairfax (Monday) and Woolworths ( Wednesday) among the more interesting.The US is pretty quiet too, although a number of housing sector figures are coming out.Given housing there is also starting to cool  — nothing alarming yet — the batch of stats will garner interest.The Brexit discombobulation will continue to provide grim fascination for the markets.PM Theresa May needs unambiguous support for her middle ground Brexit package for its, and her political, survival. Pretty long odds on that at this stage.The polar extremes of either a no-deal \"hard\" Brexit or a second referendum, seem more likely.Bank of England governor Mark Carney may like to air his thoughts on the matter at his parliamentary testimony (Tuesday), or he might just stick to the script and talk about inflation.A crashing British pound is certainly one way to fire up inflation. You simply import it.There's an EU summit at the end of the week (Sunday) which was intended to finalise the Brexit terms. Yup, good luck with that.Monday19/11/2018Tuesday20/11/2018Wednesday21/11/2018Thursday22/11/2018Monday19/11/2018Tuesday20/11/2018Wednesday21/11/2018Thursday22/11/2018Friday23/11/2018\nTopics:\nbusiness-economics-and-finance,\n\n\n\t\n\tindustry,\n\n\n\t\n\thousing-industry,\n\n\n\t\n\tmarkets,\n\n\n\t\n\tstockmarket,\n\n\n\t\n\tmoney-and-monetary-policy,\n\n\n\t\n\taustralia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}