{"id": "Boy and girl suffer serious burns in explosion at Queenscliff caravan park", "paragraph": "\n      Updated \n    \n      November 13, 2018 11:53:12\n    \nTwo high-school aged children have suffered serious burns after a portable camp stove exploded on a school camp at a caravan park in Queenscliff, south-west of Melbourne.Paramedics were called to the park off the Bellarine Highway about 8:00pm when the stove, which runs on methylated spirits, exploded.The Education Department said the students were from the Ballarat Specialist School.\"We take this matter very seriously and a full investigation will take place to understand how this occurred,\" a department spokesperson said.School principal Karen Biggelar said she was \"shocked\" by the news.\"Our thoughts are with the students and their families during this difficult time,\" she said.\"The school will do everything we can to support the family, friends and the community.\"In a statement, a spokesperson for the Big4 Beacon Resort caravan park said it was assisting with the investigation into the cause of the incident.\"We can't comment on the cause of the incident other than to say that there appears to have been an explosion whilst the students were using their own portable methylated fuel cooking equipment,\" the statement said.\"Our thoughts and prayers remain with the injured students.\"We are providing every assistance to the investigators during their enquiries, so we can understand what has occurred as quickly as possible.\" Paramedics assessed four people at the scene, an Ambulance Victoria spokesperson said.Two of the children — a boy and a girl — were flown to the Alfred Hospital with serious burns.The girl was initially in a serious condition with burns to her face, legs and arms, while the boy suffered serious burns to his chest and legs.This morning, both were reported to be in stable conditions.Another boy and girl were released from Geelong University Hospital after being treated for superficial burns to their hand and leg burns.\nTopics:\ndisasters-and-accidents,\n\n\n\t\n\tqueenscliff-3225,\n\n\n\t\n\tgeelong-3220,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\tvic,\n\n\n\t\n\tballarat-3350\n\n    First posted \n    \n      November 13, 2018 07:59:07\n    \n\n\n\n  More\n stories from Victoria\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}