{"id": "Africa's 'Rambo' Alfred Yekatom handed to International Criminal Court over alleged war crimes", "paragraph": "\n        Posted \n    \n      November 18, 2018 07:40:48\n    \nA war crimes suspect wanted for alleged atrocities against Muslims in the Central African Republic (CAR) has been detained and handed over to a tribunal in the Netherlands. Christian militias under Alfred Yekatom, a sitting member of parliament once nicknamed \"Rambo\", were found by a United Nations commission of inquiry to have carried out war crimes and crimes against humanity by targeting the CAR's Muslim population.He was wanted for alleged murder, deportation and torture, as well as enforced disappearance, mutilation and the recruitment of child soldiers.The International Criminal Court (ICC) had issued an arrest warrant for Yekatom on November 11 \"for his alleged criminal responsibility for war crimes and crimes against humanity\", the court said in a statement.\"Yekatom was surrendered to the court by the authorities of the Central African Republic,\" it said. \"There are reasonable grounds to believe that, from at least September 2013 until at least December 2014, a widespread and systematic attack was carried out by the Anti-Balaka against the Muslim civilian population and anyone perceived to support the Seleka.\"Court judges say Mr Yekatom is suspected of commanding around 3,000 members of an armed group operating within the Christian Anti-Balaka movement that was carrying out the attack on Muslims.A pre-trial chamber found reasonable grounds to believe that Yekatom committed or was responsible for the crimes because he was a military commander.UN humanitarian coordinator in Central African Republic Najat Rochdi welcomed the development.\"It's a tangible result of the fight against impunity and the support provided to the Government,\" she told the ABC.The violence between the armed religious groups has allegedly led to the death of thousands of people and left hundreds of thousands displaced, with an estimated one fifth of CAR's population of 4.5 million fleeing their homes.In a recent attack, more than 40 people were killed and dozens wounded after a Catholic mission sheltering 20,000 refugees in Alindao was set ablaze, a regional politician said.Thousands of people were forced to flee when the mission was set on fire, the UN said.\"We have counted 42 bodies so far, but we are still searching for others,\" Alindao politician Etienne Godenaha told Reuters.\"The camp has been burnt to the ground and people fled into the bush and to other IDP [internally displaced person] camps in the city.\" A humanitarian source confirmed that more than 40 people were killed.UN humanitarian coordinator in Central African Republic Najat Rochdi condemned the attack in a statement.\"This vicious cycle of repeated attacks against civilians is unacceptable,\" she said. Such attacks lead to additional displacement and vulnerability, she told the ABC. \"When torching IDP sites, thousands of people are left with nothing and children and women are dying,\" she said. She said armed groups were pretending to commit to peace dialogues while at the same time killing civilians and peacemakers. The latest incident follows a similar attack two weeks ago in Batangafo.  Another attack in the west of the country saw a Tanzanian peacekeeper die from his injuries after a sustained exchange of fire. The UN peacekeeping operation in CAR condemned the attack as \"cowardly\" and warned targeting blue helmets could constitute a war crime. Reuters/ABC\nTopics:\nunrest-conflict-and-war,\n\n\n\t\n\trefugees,\n\n\n\t\n\thuman-rights,\n\n\n\t\n\tforeign-aid,\n\n\n\t\n\tcentral-african-republic\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}