{"id": "Voters met with 'eerie' silence at flyer-free polling booth in Gladstone Regional Council by-election", "paragraph": "\n        Posted \n    \n      November 18, 2018 09:54:47\n    \nHate being bombarded with political flyers on your way to the polling booth? A local council in Queensland has decided to do something about it.In what is believed to be an Australian first, the Gladstone Regional Council provided a flyer-free polling booth for voters during its by-election on the weekend.Gladstone resident Lani Overend said the experience was slightly eerie. \"It was sort of a bit creepy actually,\" she said.\"I usually know who I'm going to vote for but I take [the flyers] out of politeness anyway.\"Other voters were more than happy to cast their ballots without having to deal with campaigners.\"It's the reason I came here,\" Renae Richards said.\"I think it's a lot of paper wastage, and I think most people make their decision before they come to the polling booth anyway.\"John Ibell agreed.\"[Flyers] have never influenced me at all,\" he said. Local council candidate Colin Burke said it was a unanimous decision among the six contestants to provide a flyer-free polling booth and said he hoped one day all booths would do the same.\"Voters have got to run a gauntlet of people poking leaflets under their nose and it's not nice,\" he said.\"Next election for council there will be 20 to 30 candidates and that's a run of 20 to 30 leaflets they've got to get through, it's horrible.\"He said apart from the financial and environmental cost, it was also draining for residents.\"I think people are much more relaxed when they come in to vote,\" he said.Australian National University politics lecturer Dr Jill Shepherd said flyers at polling booths had increasingly less power.\"We know for instance at federal elections that the number of people who say that they accept flyers and follow the directions on how to preference your ballot has dropped down to one third of all voters,\" she said.\"Increasingly we're just tuning out and we're trying to make our own decision, and so I think the candidates in this election will find that voters respond really positively to it.\"Dr Shepherd said she had not heard of any other booths going flyer-free at any other election in the country.The Queensland Electoral Commission also believed it was an Australian first. Dr Shepherd said the decision followed a growing trend seen in Australia where people are putting more thought into their vote.\"We know that a lot of people haven't made up their mind until they're actually waiting in line to vote,\" she said.\"But we don't know whether the flyers that they've been handed help them out.\"What they tend to do for most voters is help them allocate their preferences in a way that suits their preferred party.\"I don't think anyone's mind is changed by that last-minute handing over of a pamphlet or a flyer.\"I don't think that any of the candidates contesting this election will find that they are disadvantaged by not having flyers at this booth, but it's going to be a really fascinating experiment.\"She said she did not think it would be adopted by state or federal politicians at future elections.\"We would very rarely see the political parties in Australia try to experiment — they're not very keen on innovation, so it's great to see individual candidates getting together and making this decision,\" she said.\"It will be fascinating to see how [having a flyer-free booth] plays out and whether the major parties and political candidates in other states can learn something from this.\"\nTopics:\nlocal-government,\n\n\n\t\n\telections,\n\n\n\t\n\tgladstone-4680,\n\n\n\t\n\tbrisbane-4000,\n\n\n\t\n\ttownsville-4810,\n\n\n\t\n\tmackay-4740,\n\n\n\t\n\tcairns-4870,\n\n\n\t\n\ttoowoomba-4350\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}