{"id": "Curious KimberleyWorld's largest humpback whale population booming thanks to Australia's Kimberley region", "paragraph": "\n      Updated \n    \n      November 13, 2018 19:05:34\n    \nHumpback whales, once hunted around the world to the point that they became so rare that the industry built on their blubber went belly-up, is booming.The world's largest population passes through Australia's Kimberley, a region that provides ideal and undeveloped calving grounds, researchers say.Since the whaling stations were closed, humpbacks that visit Western Australia have become the good news story that defies the trend of environmental doom and gloom.Many travel all the way up Australia's west coast to the remote, northern Kimberley — a region twice the area of the United Kingdom with just 50,000 residents.So why do whales visit the Kimberley and what threats do they face? That was a question audience member Ric Kornaus put for the ABC to investigate for our Curious Kimberley series.Mr Kornaus first visited the Kimberley in the 1980s and enjoyed camping on the remote coast north of the small town of Broome.Since that time, Broome has become a popular tourist destination and mining and gas projects have been developed along the coast, prompting Mr Kornaus to ask what impact this has had on the whales that visit the Kimberley.\"What is the affect on them, whether their numbers are dropping or static, or what?\" he asked.Curt Jenner and his wife Micheline started studying humpback whales on the west coast of Australia almost 30 years ago in an effort to find out if they could recover from near annihilation.\"We were trying to understand if the Western Australian population, which is historically the largest population on the planet … was actually recovering,\" he said. Humpback whales had been hunted at an increasing rate in the early 20th century as technology such as faster ships and exploding harpoons were developed, until populations crashed.\"Back in the early '60s this population was declared uneconomic to whale because the population had been decimated to the point that there was probably only about 500 animals left,\" Mr Jenner said.But as the first scientists to investigate humpback whale recovery in Western Australia back in 1990, Mr Jenner and his wife found the population recovery was difficult to comprehend, and it has continued growing at an astonishing rate.\"These are the most successful humpback whales, population-wise, of any humpback whale population on the entire planet,\" Mr Jenner said.Dr Kelly Waples is a research scientist with the WA Department of Biodiversity Conservation and Attractions, and she says Western Australia's humpback whales lead the world in terms of population recovery.\"It's one of the best recovery stories for these large whales,\" Dr Waples said.\"It's been estimated that they've been increasing at about 10 per cent per year, which is the maximum rate that a population can recover at.\"In the subsequent decades of study, the Jenners have started to piece together why these WA whales have done so well, once again becoming the world's largest population.\"It could be anywhere from 35,000 to perhaps 45,000 on the west coast,\" Mr Jenner said.Like most humpback whales around the world, the WA population leads a feast and famine existence.They spend summer in Antarctic waters, fattening on krill and small fish, and then migrate to the tropics.It is one of nature's great feats of endurance for the pregnant female humpbacks, travelling north up Australia's west coast to give birth and providing their calves with the milk that is their sole source of sustenance, all without feeding until returning to Antarctica.The success of WA's humpback whales appears to be a combination of good feeding grounds in Antarctica, coupled with calving grounds in the Kimberley that ease the demands the migration places on mother and calf.\"I think it's been fundamentally important in the early recovery of these whales that the Kimberley has been a wilderness and there's been very little to impact them,\" Mr Jenner said.The pygmy blue whale is another species that migrates between Antarctica and the tropics, and Mr Jenner says its comparatively slow recovery highlights the importance of the Kimberley to the humpback's success.\"The pygmy blue whales that we've been studying off the Western Australian coast give birth up in Indonesian waters,\" Mr Jenner said.\"There's a lot of plastic, there's a lot of ocean pollution, and there's also an enormous amount of shipping traffic which could either be disruptive or potentially quite dangerous for them.\" The Kimberley's lack of the natural predators of whales may also be the secret to the success of WA's humpbacks.As numbers boomed after human hunting ceased, the numbers of natural predators also increased.\"Both great white sharks and killer whales are predators of humpback whales, in particular the calves,\" Dr Waples said.\"As we've seen the recovery of humpback whales, we've also seen more killer whales around.\"Killer whales have increasingly been seen attacking humpback calves along the WA coast as far north as Exmouth Gulf.\"They actually tear the tongues out of the calves, eat nothing more, nothing less, just the tongues,\" Mr Jenner said. But further north in the Kimberley, humpback calves can be born and grow for their first few weeks unmolested by killer whales.\"By the time a humpback calf is one month old they have almost doubled in weight,\" Mr Jenner said.\"It goes from an animal that is extremely vulnerable to one that can hold its breath as long as its mum.\"This allows humpback whale calves to increase their chances of not falling prey to killer whales as they make their way back south to the Antarctic feeding grounds.Most experts agree that WA's humpback whales are probably close to reaching their natural population levels before human impacts.But without knowing what the historic population was, and it being nearly 10 years since the last population count was made, there is quite a bit of guesswork involved.\"We think they're getting up close to around carrying capacity, we don't quite know, but it's certainly getting up to reasonable numbers again,\" Dr Waples said.What is certain is that so far there is no sign of humpback population growth slowing down.Cameron Birch has been taking tourists out on the water to look at WA's humpbacks for almost 20 years, first at Coral Bay and now off Broome.\"The population of humpbacks has just increased exponentially,\" Mr Birch said.\"We'll have whales swimming to the boat, rolling upside down, popping their heads out, spy-hopping, having a look at people on the boat.\" At a time when it can seem that human interaction with the natural environment can only mean bad news, Mr Jenner said the humpback whales of WA are sending us an important message.\"We need to take advantage of this opportunity and understand what these whales are for us,\" Mr Jenner said.\"They are beacons of good hope and also beacons of good health for the entire ocean.\"Who asked the question? Ric Kornaus worked for Australia Post in the Pilbara in the 1980s and would go camping on the Kimberley coast north of Broome. His experience of the region before Broome became more tourist oriented and industrial developments were proposed for the Kimberley, got Ric wondering about how the changes might be affecting the humpback whales that visit the area._ \nTopics:\nmammals---whales,\n\n\n\t\n\twhaling,\n\n\n\t\n\toceans-and-reefs,\n\n\n\t\n\tanimal-behaviour,\n\n\n\t\n\tendangered-and-protected-species,\n\n\n\t\n\tconservation,\n\n\n\t\n\tenvironment,\n\n\n\t\n\tbroome-6725,\n\n\n\t\n\tcoral-bay-6701,\n\n\n\t\n\tmurdoch-university-6150,\n\n\n\t\n\twa,\n\n\n\t\n\tantarctica\n\n    First posted \n    \n      November 13, 2018 07:00:31\n    \n\n\nContact Ben Collins\n\n\n\n\n  More\n stories from Western Australia\nWhat have you always wondered about the Kimberley that you'd like an ABC reporter to investigate?\n        By\n\n\n     \n     \n     \n        \n\n\n\n\n\n\n\n\n\n\n\n\n  \n    \n    \nBen Collins\n\n\n        By\n\n\n     \n     \n     \n        \n\n\n\n\n\n\n\n\n\n\n\n\n  \n    \n    \nBen Collins\n\n\n        By\n\n\n     \n     \n     \n        \n\n\n\n\n\n\n\n\n\n\n\n\n  \n    \n    \nEmily Jane Smith\n\n\n        By\n\n\n     \n     \n     \n        \n\n\n\n\n\n\n\n\n\n\n\n\n  \n    \n    \nBen Collins\n\n\n        By\n\n\n     \n     \n     \n        \n\n\n\n\n\n\n\n\n\n\n\n\n  \n    \n    \nEmily Jane Smith\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}