{"id": "Sculpture by the Sea", "paragraph": "\n      Updated \n    \n      October 23, 2018 10:29:58\n    \nThe annual festival of art and kitsch features 100 works of art arranged along the spectacular coastal walk. Anne Levitch's set of seven astroturfed puzzle pieces is titled \"Turf Wars\". The work references the flux of communities where some people are buying their own patch of turf while others are being turfed out.  This large inflatable work by Cool Shit depicts artist Damien Hirst's search for the shark featured in his iconic shark-in-a-tank installation. \"Space from the One\" is the work of South Korean artist Yong-Hwan Jeon. He specialises in apple forms. \"Horizon\" by Beijing sculptor Mu Boyan is made of stainless steel and references the shifting perceptions of obesity in China. Wajarri Yamatji artist Nicole Monks' work begins with Aboriginal rock carvings on the Tamarama headland. \"Gawura Guruwin\" (Whale Shark) has been redrawn by Gadigal Elder Charles Madden and built with six tonnes of native timber on Tamarama Beach.  As night falls, Gawura Guruwin is set on fire.  Britt Mikkelsen's \"Lair\" pays homage to the iconic funnel web spider. The installation is made of 60kms of biodegradable cotton string. Nearby, a sculpture evokes the pose of Botticelli's \"The Birth of Venus\". Israeli artist Itamar Freed used a mobile 3D scanner to capture himself. While scanning, the 3D model glitched and fractured because of an algorithm error, creating extra limbs. Sculpture by the Sea runs in Sydney until Nov 4 and in Perth from March 1-18, 2019. Credits \nTopics:\narts-and-entertainment,\n\n\n\t\n\tcontemporary-art,\n\n\n\t\n\tvisual-art,\n\n\n\t\n\tstreet-art,\n\n\n\t\n\tart-and-design,\n\n\n\t\n\ttamarama-2026\n\n    First posted \n    \n      October 21, 2018 10:10:21\n    \n\n\n\n  More\n stories from New South Wales\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}