{"id": "As Melbourne's recycling stockpiles keep growing, so does the fire risk posed by the waste", "paragraph": "\n        Posted \n    \n      October 21, 2018 08:02:00\n    \nDozens of Victorian recycling centres require \"urgent attention\" to prevent more fires in suburban communities, as China's ban on importing rubbish fuels the growth of hazardous waste stockpiles around Melbourne.But the taskforce put in charge of cleaning up the industry after last year's massive blaze at Coolaroo, in the city's north, is yet to visit hundreds of facilities on its list. With summer fast approaching and recycling waste piling up around the state, there are fears more waste-fuelled infernos could break out soon.\"We probably have a number of Coolaroos waiting to happen,\" Deakin University hazardous materials expert Trevor Thornton said.\"What we are seeing are larger fires that are a result of more stockpiling of material, more waste being generated, and it's more difficult to keep control of what's going into these facilities,\" Dr Thornton said.\"I think the community is probably a little bit worried.\"The July 2017 inferno at the SKM Recycling facility in Coolaroo burnt for weeks, resulting in warnings for locals to evacuate and complaints of illnesses.It also led to the Government setting up the Resource Recovery Facilities Audit Taskforce to ensure such a fire never happened again.The taskforce has identified over 800 recycling facilities around the state, and said the industry as a whole was poorly prepared to deal with the fire risk it creates.Five of those sites pose an \"extreme\" fire danger and around 200 are \"high-risk\", according to taskforce figures published by the Department of Environment, Land, Water and Planning (DELWP).Despite this, Victoria's Environment Protection Authority (EPA) — one of the lead agencies on the taskforce — said only 128 sites had so far been visited by inspectors. The EPA said plans were in place to visit all high-risk sites by mid-2019, but Dr Thornton said it needed to happen sooner.\"Two years is probably too long,\" he said.\"We've only got to have a look at the number of fires or incidents that have occurred in the last year.\"We are moving into the hotter part of the year, so the potential for fires to occur is even greater.\"They have identified a large number of sites that require more urgent attention and they're the ones that really should be inspected now.\"EPA CEO Cathy Wilkinson said the inspections were carried out daily, and almost 100 remedial notices and fines — some worth around $8,000 — had been handed out.She also said the body was working with councils and industry to improve the situation.\"Any fire is of concern to the community and the EPA, which is why the taskforce is working hard and has completed an extraordinary amount of work to reduce fire frequency and severity,\" she said.Figures from DELWP reveal that more than 100 recycling facility fires have happened in the past decade, with the vast majority occurring from 2012 onwards. Last weekend, a fire broke out at a Geelong recycling facility run by the operators of the Coolaroo depot.The weekend before, firefighters were called to a site in Knox, which had been visited by the taskforce seven times. It was the second fire at the eastern suburbs site this year.\"The taskforce has been highly ineffective,\" Victorian Greens waste spokeswoman Huong Truong said.\"If site checks, remedial notices and sanctions have not been enough to prevent fires, we have to consider that this is the result of serious failure of regulation.\" One reason behind the recent spate of fires is China's decision to stop the importation of waste for processing. Some of its south-east Asian neighbours have followed suit.That has meant local waste agents are having trouble exporting materials such as plastics. So while consumers keep creating waste, and the local agents remain contracted to collect it, there can be little option but to pile it up.On top of this, a report by DELWP says \"tighter regulatory controls in other states [is] driving interstate movement of CRWM [combustible recyclable and waste material] to Victorian facilities\".Even without visiting all the state's sites, the EPA says about 350 have stockpiles — and stockpiles are a major fire risk, especially on sites where the piles are too large and too close together.\"Stockpiling is a legitimate management practice,\" the Waste Management Association of Australia's CEO, Gayle Sloan, said.\"It's also appropriate, though, that they follow the appropriate fire guidelines and site management to mitigate the risk.\" Ms Sloan also said the majority of the state's recycling sites are for construction and demolition waste and, as the City of Geelong has discovered, these can be dangerous too.The city has been trying to have a construction recycling depot in Lara cleaned up. It is estimated to have 320,000 cubic metres of waste on site.\"This site has been identified as a site that posed extreme fire risk,\" the council's city development manager, Joanne Van Slageren, said.\"And it continues to be a site of major concern.\"Ms Van Slageren said the site was littered with 15-metre stockpiles containing timber and other combustible waste, which sit dangerously close to each other. While the City of Geelong is trying to keep the site safe, and continues to take legal action against the site's former tenant, cleaning it up will be a multi-million-dollar job.It is another demonstration of the difficulties authorities have when trying to force businesses to reduce the fire risks of their sites.The tenants of a site in Somerton, in Melbourne's outer north, received a number of warnings before their waste eventually caught fire in 2015. It was a blaze that would take close to a week to extinguish, and while the EPA issued fines worth tens of thousands of dollars, DELWP puts the estimated cost of the fire at well over $6 million.When asked if the taskforce had done enough to mitigate the fire risk at the Lara site, Ms Van Slageren said it had, and also noted the EPA had been given stronger powers to monitor sites in the time since the depot was created.In February, the state's planning tribunal, VCAT, heard serious concerns about chemical hotspots smouldering underneath the surface of a \"grossly overfilled\" dump at Brooklyn, in the western suburbs of Melbourne.The future of an illegal tyre dump at Numurkah, in the state's north, is unknown, despite it being deemed an \"extreme fire risk\" and its owner being jailed.And questions are also being asked about how so many unregistered chemicals could have been stored in the West Footscray warehouse where an inferno broke out in August.However, the safety of those types of facilities is not up for review by the taskforce, which is strictly focused on recycling facilities. \"If I was living near a site, I'd be wanting to have some response plan in place similar to what we're asked to do in bushfire season,\" Dr Thornton said.\"If the taskforce has identified that a number of sites do need some urgent attention, then the Government should be going out there and resourcing the taskforce to enable them to get out there and make sure that minimum standards are being met, that they do have the firefighting equipment in place, they do have emergency response plans.\"Dr Wilkinson said the State Government had invested more than $100 million in waste and resource recovery, in addition to establishing a Waste Management Policy and making a 30-year Waste and Resource Recovery Infrastructure Plan.That's not enough for the Greens, with Ms Truong calling for the taskforce to release its findings. \"We deserve to know how much waste is being stockpiled,\" she said, \"and what risks we are being exposed to.\"The Minister for Energy and Environment, Lily D'Ambrosio, has been contacted for comment.\nTopics:\ndisasters-and-accidents,\n\n\n\t\n\tfires,\n\n\n\t\n\tindustrial-fires,\n\n\n\t\n\tenvironment,\n\n\n\t\n\tenvironmental-impact,\n\n\n\t\n\tenvironmental-management,\n\n\n\t\n\tenvironmental-policy,\n\n\n\t\n\tenvironmental-health,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\tgeelong-3220,\n\n\n\t\n\tvic\n\n\n\n  More\n stories from Victoria\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}