{"id": "Stan Lee: These are the characters that made him a Marvel super-writer", "paragraph": "\n      Updated \n    \n      November 13, 2018 12:25:02\n    \nSpider-Man. Iron Man. Captain America. Hulk.The list of superheroes created by Stan Lee is staggering. Let's take a look back at some of his creations as we remember the iconic writer who died aged 95. Spider-Man made his debut in the final issue of Amazing Fantasy in 1962. The Amazing Spider-Man series began the next year and helped turn Marvel into the comics giant it is today. The first big budget Spider-Man in 2002 earned an estimated $US821 million. We've since seen two more reboots, the most recent of which introduced Spider-Man to the ubiquitous Marvel Cinematic Universe. The original series of the Incredible Hulk was cancelled after just six issues in 1963. But appearances in Fantastic Four and Avengers (as a founding member of that superhero team) soon followed and the self-loathing character went on to become a Marvel icon.Eric Bana (2003) and Edward Norton (2008) both had goes at portraying the green giant, but it was Mark Ruffalo who made the role his own in the Avengers films.  1963 was a good year for Stan Lee and Marvel. That's also when Iron Man made his debut in Tales of Suspense as a way of dealing with the global battle between capitalism and communism. There's been plenty of breakout stars of the Marvel Cinematic Universe, but an argument could be made for putting Robert Downey Jr's Iron Man at the top of the list. Stan Lee took the god of Norse mythology and reinvented him as a Viking-esque, super-strength superhero for the age of comic books. His first appearance was in Journey Into Mystery (1962). Australia's Chris Hemsworth rose to global stardom as Thor. He's starred in three films of the same name as well as the Avengers series. The mind-bending mystical magician first starred in Strange Tales in 1963. The series was renamed after him in 1968 and he's been a Marvel regular ever since, including as a member of The New Avengers. Even the lesser known of Lee's creations can dominate at the box office. 2016's Doctor Strange starring Benedict Cumberbatch took in $US678 million globally. Black Panther, the first major African superhero, made his debut in an edition of Fantastic Four in 1966 and joined the Avengers in 1968. Not to be outdone by Doctor Strange, this lesser-known property made $US1.35 billion worldwide (the best of the solo Marvel films) and was also critically acclaimed with a 97 per cent rating on Rotten Tomatoes. The name Black Widow for a superhero was first used in Mystic Comics in 1940, but Stan Lee reinvented the character as a Russian spy and enemy of Iron Man in 1964. She went on to join SHIELD and the Avengers. Scarlett Johansson has portrayed the character in multiple Marvel films starting with Iron Man 2. According to IMDb, a solo Black Widow film is in pre-production. Ant-Man's first appearance was in Tales to Astonish in 1962. Multiple Marvel characters have used that name including Hank Pym, Scott Lang and Eric O'Grady. Paul Rudd has starred as Scott Lang in two solo Ant-Man films, bring a bit of comic relief to the Marvel Cinematic Universe.\nTopics:\narts-and-entertainment,\n\n\n\t\n\tunited-states\n\n    First posted \n    \n      November 13, 2018 10:23:41\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}