{"id": "Victorian MP Russell Northe to recontest Morwell after battle with depression and problem gambling ", "paragraph": "\n        Posted \n    \n      November 05, 2018 07:15:11\n    \nVictorian Independent MP Russell Northe will recontest the marginal seat of Morwell at this month's state election, more than a year after the ABC revealed his resignation from the National Party.The Member for Morwell, in the Latrobe Valley, quit the Victorian Nationals in August 2017 after racking up hundreds of thousands of dollars in debt to former colleagues, friends and business associates, due in part to problem gambling.Mr Northe took a leave of absence in June 2017 to focus on his mental health and said he was confident he was well enough to handle the demands of life in politics.\"I know it's been a question asked by a lot of people in recent times but I've decided today to announce my candidacy and contest the election,\" Mr Northe said.\"The decision that I've made to run is an acknowledgement that I have the capacity and desire and capabilities to do this job if I'm elected by the voters.\"He previously cited the Black Saturday bushfires, the 2014 Morwell mine fire and the closures of the Hazelwood power station and Carter Holt Harvey timber mill as having a \"significant emotional impact\".\"Unfortunately I was suffering from depression from a range of issues I was trying to deal with at the time,\" he said.\"I'm absolutely much, much better. I'm still seeking professional help. I've got a great network and support of friends who have helped me along this journey.\"Mr Northe said he left his decision late — less than three weeks before the November 24th poll — because he needed to gain the support of friends and family.\"It was key, because you simply can't do this job unless you are committed and unless you are well,\" Mr Northe said.\"I feel like I'm in a good space at the moment to do that.\"Mr Northe would not be drawn on how much he still owed in unpaid loans but said his decision to recontest the seat was not influenced by his financial situation.\"I'm certainly in a much better position emotionally, financially and otherwise than I was 15 months ago,\" he said.If Mr Northe lost the election, he will be entitled to a parliamentary payout.\"You don't put yourself through this job in public office or run for an election unless you're there to win,\" he said.\"I love my job and any suggestion otherwise that I'd be standing for other purposes are just completely and factually incorrect, wrong and disgusting.\"There's a lot of unfinished business in my role and I believe we can make our community better.\"I'm keen to not only be elected again but to also work with whichever government is elected on November 24th.\" Mr Northe holds the seat of Morwell by 1.8 per cent in what looms as a key battleground in the election.He is a life member of the Gippsland Football League and the Traralgon Football Netball Club, where as a player he built a strong support base.He was elected to parliament in November 2006. His decision to contest this month's poll threatened the election chances of the other eight candidates to nominate so far, including former senator Ricky Muir for the Shooters, Fishers and Farmers Party. \"It will be a very hot contest but hopefully I've been able to demonstrate over the past 12 years that I have been a good local representative,\" Mr Northe said.He said the election's outcome was likely to be decided by preferences.\"There is no way known that anybody will win on primary votes, that's for sure, so preferences will be key,\" he said.Mr Northe said he had not yet entered any negotiations with other candidates around preference deals but acknowledged it was likely he would be approached.\"Being an independent, I could run an open ticket but I have put out some policy proposals that I think would benefit our community and any candidate or political party that is supportive of those might make some linkage in where preferences would go,\" he said.  Mr Northe was re-elected in 2010 with a 14.1 per cent boost to his margin, the largest swing against Labor in Victoria.In 2014, he defeated ALP candidate Jadon Mintern who polled 48.2 per cent of the vote after preferences.In October, Premier Daniel Andrews promised a $217 million upgrade of the Latrobe Regional Hospital at Traralgon and last week announced support for an electric car factory to be built in Morwell to create 500 jobs.The Coalition's big-ticket item for Gippsland is its $19 billion plan to speed up Victoria's regional trains. All sides of politics agree, the election result in Morwell will be impossible to predict.\nTopics:\ngovernment-and-politics,\n\n\n\t\n\tpolitics-and-government,\n\n\n\t\n\tstate-elections,\n\n\n\t\n\telections,\n\n\n\t\n\thealth,\n\n\n\t\n\tmental-health,\n\n\n\t\n\tgambling,\n\n\n\t\n\tmorwell-3840\n\n\n\n  More\n stories from Victoria\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}