{"id": "Victoria election 2018: Frustrated doctors urge voters to make safe seat swing", "paragraph": "\n        Posted \n    \n      November 18, 2018 10:34:24\n    \nMore than 40 doctors have accused the Victorian Government of ignoring and under-resourcing an electorate in the state's north-east because it is a safe Liberal seat.In an open letter to a local newspaper, the group has called on residents to not throw their vote away on November 24 and instead use it strategically to make Benambra a marginal seat.All 44 doctors believed more funding would flow into the region's hospitals, if a significant swing could be achieved.The lower house seat has always been conservative and Liberal MP Bill Tilley holds it on a margin of almost 10 per cent.Border medical oncologist Dr Craig Underhill said he penned the letter out of frustration from seeing health facilities continually miss out on funding for services and infrastructure.\"When the money was given to build the [cancer centre] by the Commonwealth Government there was an expectation that the State Government would then run the building and maintain it,\" Dr Underhill said.\"There has been no funding allocated, zero dollars, for the maintenance of the building.\"In a statement, an ALP spokesperson said \"patients in the north-east deserve the very best healthcare — that's why we've delivered record funding for Albury Wodonga Health and that's why we'll keep working with the community on improving local health\".\"Given that Bill Tilley and [Nationals Ovens Valley MP] Tim McCurdy are all about cuts, closures and neglect for local health, it's no surprise that the community are angry at their refusal to stand-up for the north-east.\"In the past four years, Daniel Andrews' Labor Government has invested $1.1 billion in a new hospital for Bendigo, nearly $500 million in health funding for Ballarat and $169 million for health services in Shepparton. This weekend it pledged $100 million to build a women and children's hospital at the site of the shut-down Geelong Private Hospital.Meanwhile, Albury Wodonga Health received just $1.5 million to draw a plan, which Dr Underhill said simply did not make the cut.\"We're looking for two extra zeros on that figure to bring us up to where we should be for the amount of work we do,\" Dr Underhill said.\"We have more babies born, more presentations to [the emergency department], more operations, more cancer patients than Bendigo or Ballarat.\"The budget that we get each year for Albury Wodonga Health is about half of Ballarat, even though we're bigger, and it's only about a third of Bendigo.\"When you look at it like that it's really quite shocking.\" Mr Tilley questioned the timing of the letter calling it a \"political manoeuvre\" days out from the election.\"These people haven't sat down, haven't approached me about any of the issues they highlighted in that correspondence,\" Mr Tilley said.\"I've worked tirelessly to deliver for Albury Wodonga Health.\"Mr Tilley said the argument that safe seats did not deliver funding was false.\"The most funding that went into Albury Wodonga Health was during a time when the Benambra district [margin] was at 16 per cent and there was nearly $20 million invested in that period.\" Retired obstetrician Dr Pieter Mourik, who is an active campaigner for independent candidate Jenny O'Connor, said he signed the letter because neither major party had done anything positive for the region since he moved to Wodonga nearly 40 years ago.\"We've been fighting for funds ever since I've been here,\" Mr Mourik said.\"The reason for that is that we're a safe Liberal seat on both sides of the border,\" he said.Wangaratta general practitioner and Australian Country Party Candidate for Ovens Valley, Dr Julian Fidge, whose local referral centre for cancer patients is the Albury Wodonga Cancer Centre, applauded calls from border medical specialists to make the seat marginal.\"I would like to commend my colleagues for their bravery and their foresight in realising that this is a political matter,\" Dr Fidge said.\"It needs ongoing funding, you can't just build it then forget about it.\" Several independents running in next week's state election are looking to replicate the success of federal independent Cathy McGowan, who won the historically conservative seat of Indi in 2013 on the strength of a grassroots campaign.Independent candidate for Benambra Jenny O'Connor said it was extraordinary that more than 40 senior doctors had made the statement.\"We miss out budget after budget and this time I think the voters have an opportunity to stand up and say, 'We're not going to take this anymore, we shouldn't be taken for granted in Benambra',\" Ms O'Connor said.\"Other regional areas get the funding they need for their services and for their communities and we deserve the same here.\"When a safe seat is won by an independent, both sides of politics suddenly take notice and start putting money into the electorate in a bid to win the seat at the next election.\"Since Suzanna [Sheed] was elected [in Shepparton], she has had over $600 million in four years going into that seat. We never see anything like that here.\"We get crumbs.\"In a statement, fellow independent candidate for Benambra Jacqui Hawkins joined the calls to make Benambra marginal and said it was time to \"put the heat on the two major political parties\". Dr Underhill said it was a \"very sad indictment on the system that people needed to become political\", but he believed Benambra would continue to miss out if it remained a safe Liberal seat.\"My understanding is that Benambra and perhaps Gippsland are the only seats that Daniel Andrews hasn't visited in this election campaign,\" Dr Underhill said.\"We all pay taxes, we just want our fair share.\"It's a game, we all need to be clever in how we vote and play the game.\"\nTopics:\nhealth-policy,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tdoctors-and-medical-professionals,\n\n\n\t\n\tstate-elections,\n\n\n\t\n\twodonga-3690,\n\n\n\t\n\tbendigo-3550,\n\n\n\t\n\tgeelong-3220,\n\n\n\t\n\tballarat-3350,\n\n\n\t\n\talbury-2640\n\n\nContact Eliza Beck\n\n\n\n\n  More\n stories from Victoria\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}