{"id": "Push to save Perth's historic WWII era Grand Prix racing track from development", "paragraph": "\n        Posted \n    \n      November 18, 2018 09:00:00\n    \nHousing development is threatening an historic WWII airfield and Australian Grand Prix racing track, but there is a push under way to save it.The disused and deteriorating circuit track in Caversham, east of Perth, was originally built as a landing strip for American Liberator bombers in the later stages of World War II.The airfield was never required, and it was converted to a racing track which hosted the 1957 and 1962 Australian Grand Prix. WA Vintage Sports Car Club president Rob Ozanne said the Caversham track has immense historical value. \"I don't think the people of Perth realise they have this kind of history on their doorstep,\" he said.\"We had luminaries like Sir Jack Brabham, Lex Davidson, Bruce McLaren — they all came over and raced on this circuit.\"At the time, they were like gods — they were like the popstars of that era.\"The club wants to take over control of the circuit track, but part of it is earmarked for residential development. Mr Ozanne hopes it can be salvaged.\"It's a beautiful piece of bush out there — people will be able to walk through on walk trails,\" he said.\"The veteran car club are very interested in bringing out their cars that are no longer allowed to run on ordinary roads becasue of the speeds they do and the braking they've got. \"The WA Cycling Federation have also expressed an interest in being able to used the track for cycling events.\" The first motorsport event held at the track was a celebration for the end of the war called the Victory Grand Prix, which at the time was one of the biggest events WA had ever hosted.\"People just came here in droves,\" Mr Ozanne said. \"We estimate the crowd numbers were half the population of Perth at that time.\"That event paved the way for the two national Grand Prix events to be held there.\"We had all sorts of cars out here that were highly modified,\" Mr Ozanne said. \"They went a lot faster than the makers ever intended them to go.\"As a kid, I can remember coming out here with my father and watching car racing and watching these stars — these guys were my heroes.\" Mr Ozanne said one of his most striking memories of race day was the weather.\"It was always stinking hot up there or freezing cold and wet,\" he said.\"I was in awe of the drivers and the cars.\"The safety procedures were nothing like they were today.He said there was no barrier fencing, only painted tyres to show the drivers where the track was. \"Kangaroos used to jump out on the track,\" he said.\"It was just good old fashioned fun.\" In 1969, all WA circuit racing moved to the newly opened Wanneroo Park Raceway and the Federal Government developed the facility into a radio communications hub.But, with the introduction of satellite technology, the facility was soon obsolete.The land sat untouched for decades until the State Government gained control of it in 2007 and leased part of it to the Vintage Country Car Club.\"When we came into the airfield, we were amazed, it was like stepping into a time capsule,\" Mr Ozanne said.\"It was badly deteriorated and overgrown but it certainly could be used.\" WA Lands Minister Rita Saffioti said she supports the club's proposal to restore and re-open the track.She said any funding would depend on the viability of the plan pitched to the government.\"We've spoken to the car club since we've been in government and we've been waiting for a proposal to come forward to see how we can work with them and the City of Swan about maintaining for the future,\" she said.\"It could really double up as a great asset for the local community and for the wider community too with cycling facilities, walking tracks and also an ability to show off and maintain our vintage car club history.\"Mr Ozanne thinks there would be appetite for the track to the re-opened to the public.\"The people of Perth certainly have a soft spot for this place,\" he said. \"I think a lot of people would like to come in and just have a look at the old circuit, to reminisce about the days their parents brought them up here to watch car racing.\" \nTopics:\nurban-development-and-planning,\n\n\n\t\n\tconservation,\n\n\n\t\n\thistory,\n\n\n\t\n\tracing,\n\n\n\t\n\tcaversham-6055,\n\n\n\t\n\tperth-6000\n\n\n\n  More\n stories from Western Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}