{"id": "Headless chicken monster of the deep caught on camera in Southern Ocean", "paragraph": "\n      Updated \n    \n      October 21, 2018 13:36:50\n    \nThe Australian Antarctic Division (AAD) has filmed a highly unusual sea cucumber, marking the first time it has been spotted in the depths of the Southern Ocean. The deep-sea sea cucumber Enypniastes eximia — aka the 'headless chicken monster' — was sighted using new AAD underwater cameras deployed by fishing boats operating in Antarctica.AAD research scientist Dirk Welsford said the discovery of the organism, found floating 3 kilometres below the surface, off Heard Island, was a real surprise.\"We'd never seen this thing before … at the time, none of us actually knew what it was, so we did what a lot of scientists do and googled it,\" Dr Welsford said. While most sea cucumbers are unable to swim, the headless chicken monster moves through the ocean depths and lowers itself to the sea floor to feed.\"It's one of the most spectacular specimens I've ever seen,\" he said. \"It's quite charismatic the way it flies past the camera … and quite unusual that it can swim.\" The bright purple, plankton-eating organism, which has bat-like wings and is as large as a basketball, has only ever been filmed once before, in the Gulf of Mexico last year.Dr Welsford said the organism's quirky nickname was nothing more than the product of marine scientists having a laugh.\"It does look a little bit chicken shaped … and it's a cool name,\" he said.\"It's also a reflection of how little we know about the deep sea and the strange things we see while doing studies down there.\"While little is known about what lies in the depths of the world's oceans, the Southern Ocean's extreme weather conditions and remoteness mean much of its inhabitants remain a mystery. \"There's almost certainly many, many more things that we don't know down there, waiting to be discovered,\" Dr Welford said.The animal is also known as the Spanish dancer, as its graceful stroke swaying in the current resembles that of a flamenco dress. Dr Welsford said small, cheap camera technology was helping the AAD's quest to explore the Southern Ocean's depths.The underwater cameras deployed are of a similar quality to smartphone cameras, only they are housed in secure casing to withstand the high water pressure and sub-zero temperatures.The AAD can now film deeper than ever from a fishing boat.\"Because [the technology] is now so portable and so cheap, we're hoping to put cameras on nearly every fishing boat that goes down south, so we can rapidly get a lot of data on what's going on down there, in a way we've never been able to before,\" Dr Welsford said. \"Developing equipment that can survive the conditions has been really difficult until now.\"This is the deepest a camera has ever been deployed off a fishing vessel.\"The Southern Ocean is the only ocean that flows completely around the Earth, unimpeded by any significant landmass and is home to the most number of marine animals in the world.\"There are still many, many mysteries in the deep ocean that we're only just starting to scratch the surface of,\" Dr Welsford said. Dr Welford hoped the use of underwater cameras would help paint a clearer picture of the diversity, number and location of organisms in the deepest reaches of the ocean.The data generated from underwater cameras will be presented at the annual Commission for the Conservation of Antarctic Marine Living Resources meeting in Hobart on Monday.\nTopics:\nmarine-biology,\n\n\n\t\n\tscience-and-technology,\n\n\n\t\n\tanimal-science,\n\n\n\t\n\tbiology,\n\n\n\t\n\tenvironment,\n\n\n\t\n\thobart-7000,\n\n\n\t\n\ttas\n\n    First posted \n    \n      October 21, 2018 10:38:42\n    \n\n\nContact Phoebe Hosier\n\n\n\n\n  More\n stories from Tasmania\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}