{"id": "Joint US-Australian naval base on Manus Island a 'significant pushback' against China's Pacific ambitions", "paragraph": "\n      Updated \n    \n      November 18, 2018 11:46:43\n    \nPrime Minister Scott Morrison says the US involvement in the redevelopment of a naval base at Manus Island has been at Papua New Guinea's request. Tensions between the US and China overflowed during speeches at the APEC Summit in PNG on Saturday, with US Vice-President Mike Pence accusing Beijing of debt-trap diplomacy and Chinese President Xi Jinping warning the US against protectionism.Mr Pence then announced that the US would partner with Australia and PNG to redevelop the Lombrum naval base on Manus Island.The move comes as the US, China and Australia all vie for influence in PNG and the Pacific, and one analyst said the Manus base would push American forces further south into the Pacific than they had been in decades.\"It brings the US a lot closer to the South China Sea but I think it's also a significant pushback for China's strategic ambitions in the Pacific region,\" said Jonathan Pryke from the Lowy Institute. Mr Morrison said the base was on PNG territory, adding: \"That's why we're working together under their leadership\".\"It's their initiative and we're pleased to be part of it,\" he said. \"We will be working with Pacific Island nations at their invitation wherever we have that opportunity, consistent with the programs that we're running.\" However, there is scant detail about the extent to which America will be involved.Mr Pence has not said how much money the Trump administration will contribute to the project, or whether US vessels will be permanently based at Lombrum.Defence Minister Christopher Pyne has already said that Australian vessels will probably be based permanently at Lombrum under the deal.\"All of the details we'll be working through in the time ahead, and the investments that we'll be making,\" Mr Morrison said. \"But the key thing here is the PNG Government has invited us to participate at Manus Island in the Lombrum initiative and they've invited the United States to do the same thing, so we're pleased to be working together.\"PNG Prime Minister Peter O'Neill and Mr Pence had a bilateral meeting on the night of the speeches.Mr O'Neill opened by thanking the US for its support of PNG. Mr Pence then spoke about the \"strong partnership\" between the two countries.Mr Pence said the naval base redevelopment would contribute to \"greater prosperity and greater security\" in the region and praised Mr O'Neill's \"vision and leadership\" as well as the \"great and enduring friendship between the people of the United States and Papua New Guinea\". \"Seven thousand Americans fell in combat here in Papua New Guinea,\" Mr Pence said, referring to the battles of World War II.In an apparent response to China talking about its investment in PNG, Mr Pence said the US was a leading investor in the country and that \"American investment in Papua New Guinea is unmatched\".\"President Trump's vision … of a free and open Indo-Pacific begins with economic growth, but it's all facilitated by security,\" he said.\"Let me also say how grateful we are for the ongoing collaboration and partnership on security.\"After media were asked to leave the room Mr Pence then met with and was photographed with other Pacific leaders.Pacific island leaders have been in high demand at APEC in the last few days as countries vie for influence in the region.The Chinese President held a working dinner with some of the leaders on Friday and Mr Morrison will host a barbecue for them today.  Before the APEC dummit Mr O'Neill said he \"wasn't interested\" in geopolitics, and wanted to work with everyone. However, the Manus naval base decision appears to put PNG right in the middle of the geopolitical manoeuvring. Mr Pryke said it would have significant implications for PNG.\"It sends a strong alignment signal from a country that's done a decent job of straddling both Australia and China,\" he said.\"China has clear ambitions for establishing a military presence in the Pacific, and this has undermined that ambition in PNG.\"The announcement came just one day after Mr Xi's first state visit to PNG, where the two countries signed a memorandum of understanding which included a new 10-year loan.\"After the pomp and ceremony [China has] displayed here over the last few days, despite no major funding announcement, they must be disappointed and frustrated,\" Mr Pryke said.\nTopics:\nworld-politics,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tforeign-affairs,\n\n\n\t\n\tapec-economic-leaders-meeting,\n\n\n\t\n\tnavy,\n\n\n\t\n\tdefence-forces,\n\n\n\t\n\tdefence-and-national-security,\n\n\n\t\n\tpapua-new-guinea,\n\n\n\t\n\taustralia,\n\n\n\t\n\tunited-states\n\n    First posted \n    \n      November 18, 2018 10:18:25\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}