{"id": "Service SA centres earmarked for closure in budget among the busiest in the state", "paragraph": "\n        Posted \n    \n      October 21, 2018 09:04:02\n    \nTwo Service SA centres earmarked for closure by the State Government are among the busiest in the state, according to data released under Freedom of Information laws. Treasurer Rob Lucas announced plans to close centres at Modbury, Prospect and Mitcham in his September budget, citing the need for savings across all government departments.But data released to the Opposition shows the Prospect and Modbury Service SA centres have recorded some of the highest customer visit numbers in the state over the past two years.The customer service centres are routinely used for tasks such as applying for driver's licences and proof of age cards, renewing vehicle registration and paying bills.Shadow Treasurer Stephen Mullighan said the data was evidence the Government had not \"thought through\" the decision to close the centres.\"What we have here is a saving … which hurts South Australians who are just trying to find an easy way to pay money to the Government,\" he said.\"These are essential service centres for people who don't have access to the internet, for the elderly, for people who might need some help understanding forms … and for people who might not have English as a first language.\"It is farcical that they are closing these Service SA centres, without realising the impacts on the local communities who rely on them.\" The move is set to save the State Government $18.8 million across the forward estimates, with the possibility of further closures already foreshadowed.A date is yet to be set for the closure of the Prospect, Modbury and Mitcham centres. Transport and Infrastructure Minister Stephan Knoll said the budget had been full of \"tough decisions\", and the three centres had been selected based on \"geographical\" considerations.\"For the people at Prospect, it's being able to go to Regency Park or the CBD … for the people at Modbury, it's the Elizabeth or Tranmere centres … and for people at Mitcham, [it's] either getting to Tranmere, Marion or the CBD,\" he said.\"So, it's more about where they [customers] are in proximity to other centres, rather than the sheer numbers at a centre.\" Mr Knoll said customers who were unable to use online services, or did not \"feel comfortable\" doing so, would still be able to access services through other Service SA centres, post offices, or over the telephone.\"We made some tough decisions in the budget and we stand by those decisions,\" Mr Knoll said.\"At the moment, the cost of someone going into a Service SA centre is about $17 and to provide that service online costs about 40 cents.\"That's 40 times the cost to taxpayers to provide a Service SA centre … so [this] means we can spend money on other worthwhile projects.\" Last week, it was revealed Member for Adelaide and Cabinet minister Rachel Sanderson — whose electorate includes the Prospect centre — wrote to Mr Knoll after the budget, to pass on the concerns of her constituents about the closure.Mr Mullighan said the State Government should immediately reverse the decision.\"They've got this wrong … [and they] obviously had no idea how busy and how popular those centres are, and how many people are going to be affected by closing them,\" he said.\"The Government had six months to develop this budget [and] it just shows that they didn't use that six months to think things through.\"\nTopics:\ngovernment-and-politics,\n\n\n\t\n\tpublic-sector,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\twelfare,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tsa,\n\n\n\t\n\tmitcham-5062,\n\n\n\t\n\tmodbury-5092,\n\n\n\t\n\tprospect-5082\n\n\n\n  More\n stories from South Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}