{"id": "NRL player Angus Crichton wants to make learning about Indigenous Australia more accessible", "paragraph": "\n      Updated \n    \n      October 21, 2018 10:14:33\n    \nIt's a world away from the lights, crowds and fever of a State of Origin match.But each year since 2015, New South Wales Blues player Angus Crichton has boarded a tiny plane and flown 540 kilometres from Darwin to his second home, Arnhem Land's Lake Evella, to continue a friendship with two community members, Leon and Dewlyn Wunungmurra, that dates back to high school.It's an experience that has now inspired him use his footballing platform to educate Australians about a shared Indigenous history.\"These two boys are Yolngu boys from Lake Evella and obviously English is their second language,\" Crichton said.\"They came down to the boarding school that I was at in Sydney and we were both boarders.\"They didn't know about general hygiene, brushing their teeth, washing their clothes — that sort of thing. I saw them struggling and naturally helped out.\"Ever since then, we've become family.\"He said his two friends have graduated now — one's a Police liaison officer in the community and the other one's a \"proud traditional cultural man\".Mr Crichton, who signed with the Sydney Roosters last month, partnered up with NRL Northern Territory to use his family trip to run some basic skills clinics with the community and begin work on his new venture, a charity named the \"First People Project\".He hopes to use his connections to improve relations between Indigenous and non-Indigenous peoples.\"Coming up here into remote Arnhem Land is like a whole other world,\" he said,\"I've been exposed to this just through chance, and I've got a profile and network where I can help teach and educate other Australian's about what is essentially Australian history.\" The First People Project's sole purpose will be to raise money to help to educate Australians about a shared Indigenous history, starting in remote Arnhem Land.\"I want to tell the story of Arnhem Land and the communities inside Arnhem Land, and what really makes it tick … and then I want to go and do places like Tiwi Islands, the Torres Strait Islands, go and learn about Central Australia,\" Crichton said.\"I've found myself in a pretty unique position where I've got a network where I have a voice, and also I have friends who have a bigger network than me, that also have a voice.\"I've got this sort of access to communities where they will welcome me in, and they are happy to share and they can understand where I'm coming from.\"I think I'm pretty lucky to find myself where I am and I think if I didn't share what I've learnt, then I'd be doing myself and our culture and Australia a disservice.\"Crichton is passionate about the upcoming project and wants education to be accessible.He believes part of the problem is a lack of exposure to Indigenous culture.\"One out of ten people I'd ask would even know where Arnhem Land is, and that's just because there's no exposure to it. Maybe in Darwin, but not down south,\" he said.\"They were here 60,000 years before us and it's one of the most beautiful, richest cultures in the world and it's in our backyard — but the majority of us don't even know about it. \"I don't know it all, and I don't think anyone knows it all, so the only way to do it is to go and immerse yourself in it, and to learn firsthand. Ask communities the way to share their culture.\"I think through doing that, it's not only educating white or any other ethnicity of Australian's, but it's also making our Indigenous Australian's feel heard and to feel like they've got a voice.\"Yet he also remains focussed on his NRL career.Last year, Crichton upset a borough of die-hard South Sydney supporters, and made the decision to sign with the reigning NRL Premiers, the Sydney Roosters, a move he's yet to come to terms with.\"I loved my time at Souths and I wouldn't change a thing … I did have the opportunity to leave at the start of this season and go to the Roosters but I said to the big figures at souths 'No, I don't want to leave now, I want to stay and honour my contract because I do believe that we genuinely have a chance this year',\" he said.\"I think I did it all in the right way and it's weird, I haven't really spoken about going to the Roosters yet and it hasn't really hit me yet. \"It'll be strange, but I guess I'll enjoy it for what it is and I look forward to ripping in next year.\"After a stellar performance with the NSW Blues side, representative footy is being kept at the back of Crichton's mind.But for now, he is focussed on recovering from a shoulder surgery with a four month wait before reaching his full playing capability, with plans to take the 2019 season head on — this time, as a Bondi boy.  _ \nTopics:\ncommunity-and-society,\n\n\n\t\n\tindigenous-aboriginal-and-torres-strait-islander,\n\n\n\t\n\tindigenous-culture,\n\n\n\t\n\tnrl,\n\n\n\t\n\tnt\n\n    First posted \n    \n      October 21, 2018 09:28:16\n    \n\n\nContact Shahni Wellington\n\n\n\n\n  More\n stories from Northern Territory\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}