{"id": "Meet the couple trying to solve the rural doctor shortage in Queensland", "paragraph": "\n      Updated \n    \n      October 22, 2018 07:41:44\n    \nIn 2017, there were almost 20,000 medical practitioners employed in Queensland. Of those, almost three quarters were in metro areas such as Brisbane and the Gold Coast.But in the small town of Jandowae on Queensland's Western Downs, two healthcare professionals are trying to change those statistics.GP Luke Dwyer and his nurse wife Kimberly are building a new medical centre that will have the capacity to host more visiting specialist services and allied health professionals in the rural town.They will also have room to train more doctors in rural and remote healthcare.With the help of a $300,000 rural general practice grant from the Federal Government, the build is already well underway. Dr Dwyer, who is the practice principal of Wambo Medical Practice in Jandowae, said rural healthcare had always been important to him.\"The doctors-in-training is a very important thing because the more exposure to rural medical training a junior doctor has, the more likely they are to stay rural,\" he said. \"Rural and remote areas of Australia don't have the medical workforce or the nursing workforce that the rest of Australia enjoys.\"The more doctors and nursing and allied health staff that we have in rural areas, the better the health outcomes are for those people.\"  Dr Dwyer said rural healthcare was more than just a professional interest for him — with a young daughter and another baby on the way, the Dwyers have their own family's healthcare to keep in mind.\"I want my family and myself to have access to those preventative and primary healthcare measures that should be available relatively close to home,\" he said.\"We intend to live in Jandowae for the rest of our lives, so I also need there to be a doctor there to look after me.\"Ms Dwyer said they hoped to train young doctors so the doctors could learn to love the rural lifestyle, and she was not fussy about which part of rural Queensland they chose. \"Whether they come rural and come back to us one day, or whether they go to another rural town, it really doesn't matter, because we're just like hundreds of other little places across the state that are crying out for doctors and crying out for services,\" she said. For patient Jeffrey Taylor, who has been visiting Wambo Medical Practice for about 70 years, the new practice will provide real benefits close to home. Mr Taylor's heart condition, atrial fibrillation, means he has to travel to Toowoomba almost two hours away whenever he needs to see a cardiac specialist. But with the extra rooms at the Jandowae practice, it means a specialist could come to him. \"I've seen many doctors come and go, but Kimberly and Luke have given a modern approach to medicine with the way they're operating the practice,\" he said. \"It will benefit everybody, not just with travel, but just to have those services in the local community will be an enormous benefit. \"Luke and Kimberly are two outgoing, friendly and just wonderful people. They just want to do the best for this community.\"The new centre is expected to open in March.\nTopics:\nhealthcare-facilities,\n\n\n\t\n\tdoctors-and-medical-professionals,\n\n\n\t\n\tjandowae-4410\n\n    First posted \n    \n      October 21, 2018 10:06:57\n    \n\n\nContact Sophie Volker\n\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}