{"id": "Argentina lacks 'modern technology' needed to recover submarine, defence minister says", "paragraph": "\n      Updated \n    \n      November 18, 2018 10:19:38\n    \nThe Argentinian Government says it is unable to recover the recently discovered submarine lost deep in the Atlantic a year ago with 44 crew members aboard, angering missing sailors' relatives who demand the vessel be raised. Defence Minister Oscar Aguad said at a press conference that the country lacks \"modern technology\" capable of \"verifying the seabed\" to extract the ARA San Juan, which was found 907 metres  deep in waters off the Valdes Peninsula in Argentinian Patagonia.Earlier the navy said a \"positive identification\" had been made by a remote-operated submersible from the American company Ocean Infinity. The company, commissioned by the Argentinian Government, began searching for the missing vessel on September 7. It remained unclear what the next steps could be. Navy commander Jose Luis Villan urged \"prudence\", saying that a federal judge was overseeing the investigation and would be the one to decide whether it was possible to recover a part or the entirety of the ship.Relatives of crew members were determined to fight for the submarine to be quickly surfaced.Isabel Polo, sister of crewman Daniel Alejandro Polo, said the discovery was just the beginning. She said families needed to recover the remains of their loved ones to know what happened and help prevent similar tragedies.\"We do know they can get it out because Ocean Infinity told us they can, that they have equipment,\" said Luis Antonio Niz, father of crew member Luis Niz. \"If they sent him off, I want them to bring him back to me.\"The sub's discovery was announced just two days after families of the missing sailors held a one-year commemoration of its November 15, 2017 disappearance. The San Juan was returning to its base in the coastal city of Mar del Plata when contact was lost. On the anniversary President Mauricio Macri said the families of the submariners should not feel alone and delivered an \"absolute and non-negotiable commitment\" to find \"the truth\".Mr Aguad said the vessel was found to be in an area that investigators had deemed \"most likely\".He said the vessel was found in an underwater canyon with its tail partially \"imploded\".Officials showed images of the submarine, which was located on a seabed with its hull totally deformed. Parts of its propellers were buried and debris was scattered up to 70 metres away. The German-built diesel-electric TR-1700 class submarine was commissioned in the mid-1980s and was most recently refitted between 2008 and 2014. During the $12 million retrofitting, the vessel was cut in half and had its engines and batteries replaced. Experts said refits can be difficult because they involve integrating systems produced by different manufacturers, and even the tiniest mistake during the cutting phase could put the safety of the ship and crew at risk. The navy said previously the captain reported on November 15, 2017, that water entered the snorkel and caused one of the sub's batteries to short-circuit. The captain later communicated that it had been contained.Some hours later, an explosion was detected near the time and place where the San Juan was last detected. The navy said the blast could have been caused by a \"concentration of hydrogen\" triggered by the battery problem reported by the captain.Mr Macri promised a full investigation after the submarine was lost. Federal police raided naval bases and other buildings last January as part of the probe, soon after the Government dismissed the head of the navy.Argentina gave up hope of finding survivors after an intense search aided by 18 countries, but a few navy units have continued providing logistical support to Ocean Infinity.On Saturday, Ocean Infinity CEO Oliver Plunkett tweeted: \"Our thoughts are with the many families affected by this terrible tragedy. We sincerely hope that locating the resting place of the ARA San Juan will be of some comfort to them at what must be a profoundly difficult time.\"He also said: \"This was an extremely challenging project and today's successful outcome, following the earlier search operations, firmly endorses our technology.\"The company unsuccessfully searched for the Malaysia Airlines plane that disappeared in 2014 over the Indian Ocean. AP/Reuters\nTopics:\naccidents,\n\n\n\t\n\tdisasters-and-accidents,\n\n\n\t\n\tnavy,\n\n\n\t\n\tdefence-forces,\n\n\n\t\n\tdefence-and-national-security,\n\n\n\t\n\targentina\n\n    First posted \n    \n      November 18, 2018 07:54:07\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}