{"id": "Australia suffer comprehensive defeat against Pakistan in first T20", "paragraph": "\n      Updated \n    \n      October 25, 2018 14:12:26\n    \nAustralia have been humiliated by Pakistan in the T20 series-opener, slumping to a 66-run defeat after being skittled for just 89.Set a target of 156 after Aaron Finch elected to field in Abu Dhabi, Australia were bowled out in 16.5 overs for their equal third-lowest total in a T20 international.Only a rearguard action from tailenders Nathan Coulter-Nile (34) and Ashton Agar (19) saved Australia from what had threatened to be a record T20 loss.Each of Australia's top four batsmen were bowled and Chris Lynn (14) was the only member of the top six to reach double digits as the tourists lost six wickets in the powerplay to underscore their shocking start to the three-match series. \"That powerplay was horrific. It was just carnage,\" Finch said.\"It was like a car crash in slow motion.\"It's just obviously not doing the basics. I think when that many guys get bowled it's obviously alarming, particularly on a flat surface that didn't swing a hell of a lot.\"Left-arm spinner Imad Wasim snared 3-20 and emulated Cristiano Ronaldo's famous goal celebration for each wicket, in what was his first national outing in almost a year.The tourists got off to a nightmare start when Finch was clean bowled by Imad for a third-ball duck while leaning back into an attempted cut shot.Opening partner D'Arcy Short played onto his stumps three balls later and Glenn Maxwell lasted just seven balls before being dismissed in dismal fashion, slashing at a delivery from paceman Faheem Ashraf which knocked over his middle stump.Second-gamer Ben McDermott's nervous pursuit of a quick single ended in a run out to leave Australia 4-16, while Imad soon had his third wicket luring Alex Carey into an edge with a delivery which deviated slightly and stayed low. Lynn's dismissal brought Coulter-Nile to the crease, and he and Agar steadied the ship until Agar nicked to Hasan Ali.Everything was going right for Pakistan, including Hasan's spectacular outstretched catch on the boundary to see off Adam Zampa.Australia's innings ended unceremoniously with Coulter-Nile bowled by Shadab Khan after inadvertently throwing his bat in an attempted slog.Australia's bowlers earlier held up their end of the bargain to restrict the world's number one-ranked T20 side to 8-155 from 20 overs.Pace duo Billy Stanlake (3-21) and Andrew Tye (3-24) did the bulk of the damage, with Stanlake using his pace and height to devastating effect.White-ball superstar Babar Azam finished unbeaten on 68, while Mohammad Hafeez crunched two sixes on the way to 39.Australia named an unchanged XI from Monday's seven-wicket victory over the UAE, again omitting Test squad members Mitch Marsh, Nathan Lyon, Peter Siddle and Mitchell Starc.Finch said changes would be strongly considered for Friday's second T20 in Dubai, which will also host the third and final game on Sunday. AAP\nTopics:\nsport,\n\n\n\t\n\tcricket,\n\n\n\t\n\tunited-arab-emirates\n\n    First posted \n    \n      October 25, 2018 08:09:50\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}