{"id": "Gas explosion in Canberra kitchen leaves four in hospital", "paragraph": "\n      Updated \n    \n      October 25, 2018 16:23:13\n    \nFour people have been left in hospital, some with burns to 40 per cent of their body, after a gas explosion at a commercial kitchen in Canberra overnight.Work safety commissioner Greg Jones said his investigators were examining the scene, and it appeared the four had either been changing a gas bottle or had just finished changing bottles when the explosion happened about 11:00pm.The group had hired the kitchen, on Dairy Road in Fyshwick, and were preparing Sri Lankan food for an event today.Mr Jones said he would be investigating whether the equipment in the kitchen was up to standard, and whether training was offered before the cooks hiring the kitchen began work.\"We've got some expert gas advisers coming along today to give us some advice on the state of the equipment, and that will assist with our investigation,\" he said.\"Part of our investigation will be the state of the equipment, the training that occurs, and the supervision in terms of the use of that gas equipment.\"It appears that they may have been changing gas bottles at about the time, or just before the explosion.\" All four were taken to Canberra Hospital, two in a serious condition and the others in a stable condition.ACT Ambulance commander Chris Barry said by lunchtime the conditions of all the injured people were stable.\"These are serious injuries to sustain … the worst being airway involvement,\" he said.\"[The injuries] would be up to the bottom of the legs, up to the chest and in some cases the face.\"Forty per cent would be an estimation of burns that some of the more serious patients received.\" Georgina Prasad, the owner of kitchen manager Homegrown Me, said people looking to hire the kitchen needed to be trained in using it safely.\"No-one can use this kitchen without going through the basics of how to use the equipment safely, where the fire extinguishers are, the blankets, making sure they understand that there are risks in using the kitchen,\" she said.\"I do talk to people and make sure that people are responsible for the people that come in.\" Ms Prasad said her primary concern was for the wellbeing of the four people in hospital.\"They have used the kitchen previously, they are a young emerging small business, they are very keen to share their culture and their food,\" she said.\"I'm just concerned about the people really and making sure that they are OK.\"By Thursday morning emergency services had left the scene, but police tape cordoned off the entrance to the kitchen. Singed items of clothing were strewn about outside the shipping container, including a burned shirt.Smashed glass and other debris also littered the ground.A non-disturbance notice has been placed on the site while WorkSafe investigators examine the scene.\nTopics:\nfires,\n\n\n\t\n\tdisasters-and-accidents,\n\n\n\t\n\tfyshwick-2609,\n\n\n\t\n\tcanberra-2600,\n\n\n\t\n\tact,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      October 25, 2018 07:17:46\n    \n\n\n\n  More\n stories from Australian Capital Territory\nWhat have you always wondered about Canberra that you'd like an ABC reporter to investigate?If you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}