{"id": "'It'll haunt you forever': Traditional owners warn climbers of perils entering FNQ's 'Bermuda Triangle'", "paragraph": "\n        Posted \n    \n      October 21, 2018 08:38:08\n    \nTo Indigenous traditional owners, Kalkajaka is a sacred battlefield of both spirits and warring clan groups.To tourists, Kalkajaka is Black Mountain — an eerie and striking landform along the Trevathan Range that many feel compelled to stop at on their drive from Mareeba to Cooktown.The mass of massive, granite boulders towers over the landscape: a black and barren sight in stark contrast to the scrubby green savannah below.Black Mountain is a place of mystery and legend to Indigenous and non-Indigenous people alike.It has been dubbed the 'Bermuda Triangle' of far north Queensland due to stories dating back to the late 1800s of people, horses and whole mobs of cattle disappearing. Harold Ludwick descends from two clans with traditional ownership claims to the site, the Western Yalinji and Gugu Yimmithir.He said Kalkajaka, which means 'spear', was a sacred battlefield and the scene of the last spear fight between the black and white cockatoo.These are the totems representing the inland and coastal clans whose warriors were clashing over hunting grounds.\"They came to blows and many people died and their bones also remained in those mountains, they were put in there,\" Mr Ludwick said.\"It's as significant as the beaches of Gallipoli for us, this place.\"An oral history he's been taught is that another war was waged at Kalkajaka between spirits in ancient times.The fight was between two brothers who were giants and in love with the same woman.\"They made piles out of stones, those granite boulders that are there today,\" Mr Ludwick said.\"And when they each threw a rock they killed each other but their pile of stones remains there.\" Like Uluru, climbing Kalkajaka is hurtful to the various traditional owner groups: the Kuku Yalanji, Kuku Nyungkal and Guugu Yimithirr.Mr Ludwick believes in Black Mountain's dark forces, which is why he warns people not to enter the site: a mistake his friend from Sydney made during a visit.\"I told him, 'Don't go in there', because I know there's a bora ground, but he was headstrong and wanted to go,\" Mr Ludwick recalled.\"After being in that place, he got home and was tormented by what he said was devils and spirits.\"After he got better, three or four months later, he came back and said to me, 'I know I've done something wrong on Cape York'.\"I said, 'Bloody oath you did, and I told you!'\" Aunty Marie Shipton is a Kuku Nyungkal woman. Kalkajaka is her great-grandmother's country. As a small child, she was taught to respect the site and gets angry when tourists enter without permission or guidance.\"It's hard to tell them. They want to discover the country but they don't know what's really there,\" Aunty Shipton said.\"A lot of people don't respect our culture. We see a lot of non-Indigenous people, they think they know about sacred sites … but they should show respect to Indigenous people by not walking on their country.\"For me, it's a sacred site and no-one is allowed to go to that area. If they do, they will get very, very sick.\"I feel bad about it … they're heading straight into bad vibes there.\"Mr Ludwick echoed Aunty Shipton's warnings.\"It touches your soul. To respect it, that's the most important thing. To disrespect it is something that will haunt you forever.\"They're being tormented by the spirits of our ancestors. This is something that you don't mess around with,\" Mr Ludwick said.\"They tell you not to muck around with a ouija board, well this is the same. You muck around with spirits and something's going to happen.\"In our boras, spirits appear to us. It's not just a fairytale, it's real. You see these things come to you.\"Gavin Dear is a world-renowned geologist. Kalkajaka is his noisy next-door neighbour. \"It can make random explosive noises when the onion skin weathering of the granite boulders occurs. You hear these big cracks and tumbles,\" Mr Dear said.\"At night, you can hear the wind going through the boulders and it sounds like howling souls trapped inside.\"Mr Dear is well-versed in the mountain's mythology but has debunked many of the wilder theories around mystery energy fields.\"I've tested it myself with compasses, that's rubbish. I've talked to helicopter pilots who fly over it, they're fine,\" Mr Dear said. \"One theory is it was a [man-made] pyramid ... it's on one of those meridian points of the planet. That's a big one you'll find on YouTube. We've had numerous people want to come up and camp near it to gather its energy.\"The avid adventurer said the legendary disappearances were more to do with mishap than mystery.\"If you try and climb to the top you've got about 200 calculated leaps you have to make between boulders,\" Mr Dear said. \"If you have a knee fail or slip, you can tumble down there and you just will not come out.\" But even this man of science admits to believing Black Mountain has a supernatural presence.\"No matter how rational I am, I'm always doing my best not to piss off the mountain.\"For me, I grew up Catholic and I've got that superstitious background too,\" Mr Dear said.The Queensland Parks and Wildlife Service (QPWS) advises tourists and hikers to be properly prepared when entering its parks but has no specific advice about cultural protocols.Jabalbina Yalanji Aboriginal Corporation chairperson Desmond Tayley said tourists should look for signage and take Aboriginal-guided tours when visiting country.\"Communities like Mossman and Wujal Wujal offer guided tours where you get to walk the country with a traditional owner who can tell you the stories of what make our sites so significant.\"By taking a tour you are not only learning about country but creating jobs which helps build an economy in our communities.\" There are different protocols for researchers and film crews who need to apply for a permit to visit Aboriginal lands including national parks. \nTopics:\nindigenous-aboriginal-and-torres-strait-islander,\n\n\n\t\n\tindigenous-culture,\n\n\n\t\n\tregional,\n\n\n\t\n\ttravel-and-tourism,\n\n\n\t\n\tgeology,\n\n\n\t\n\tcooktown-4895,\n\n\n\t\n\tmareeba-4880,\n\n\n\t\n\tmossman-4873,\n\n\n\t\n\tsydney-2000,\n\n\n\t\n\tqld\n\n\nContact Brendan  Mounter\n\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}