{"id": "Canberra mental health nurses warn their lives are at risk from patient assaults", "paragraph": "\n        Posted \n    \n      October 21, 2018 08:15:47\n    \nA nurse at Canberra's forensic mental health unit has warned \"somebody is going to die\" in her workplace unless staff conditions improve. It comes after a series of assaults on staff by one patient in July which left some nurses seeking treatment at the emergency department.Despite fear of repercussions, two nurses at the Dhulwa Mental Health Unit have revealed to the ABC that staff are scared to go to work and feel management is ignoring their concerns.One nurse, who the ABC will call Jane to protect her identity, said the unit could be frightening to work in.\"I've seen hot drinks thrown at nurses, I've heard of where nurses … were kicked in the head,\" she said.\"I don't feel safe at all going there. If things keep going the way they're going, somebody is going to die.\"During the July assaults, Jane said it took more than a minute for security to arrive, which \"can feel like an eternity\".\"One wrong kick to both of those nurse's heads [and] it could have been their death,\" she said.Another nurse, William (not his real name), likened violence in the unit to drunken late-night fighting in a major city.\"There were people physically bashed and kicked — quite badly — and hurt,\" he said.\"And not only the physical [pain], then of course the psychological [pain happens] later.\" Jane said it is not the assaults themselves but the way management responds that inflicts the most damage.\"It's minimising the assaults; coming in and saying 'let's forget about that, let's move on',\" she said.\"You feel like you're out on your own. If you get assaulted, so what? That's what it feels like for the nurses. They [management] don't want to hear it, they want it to go away.\"Both nurses said management could be unwilling to support the nurses' treatment decisions.\"Senior nurses can be at times paralysed to make decisions because they're unsure, will they be backed up?\" William said.Jane said she was \"always afraid of putting a foot wrong because the first person they will criticise is the nurses\".In response to the July assaults, the Government put on two extra security guards at Dhulwa as an interim measure, but William wants it to be permanent.\"I don't just view them as security — they watch things, they calm things down, they're very good at distracting people when they're distressed,\" he said.The director of the ACT's public mental health service, Tina Bracher, said all assault reports were taken seriously.\"I feel sick in the stomach when I hear that staff have been assaulted as part of their work,\" she said.\"No staff member should feel unsafe in their workplace or be injured.\" Ms Bracher said she was disappointed to hear staff felt management downplayed the impact of assaults.\"That is really not how I like to lead and it's certainly not my expectation in the service,\" she said.The ACT Government is preparing a \"nurse safety strategy\", including plans to recruit a dedicated safety nurse at both Dhulwa and The Canberra Hospital's Adult Mental Health Unit.\"They'll be a very skilled mental health nurse, so [they'll be] teaching and training the new staff, doing assessments of the patients … being able to debrief,\" she said.\"We are travelling a journey. We have got a high-risk environment, we have got new staff and we are working with those new staff to upskill them and our management team in order to provide a safe and effective clinical environment.\"But Opposition health spokeswoman Vicki Dunne said action was overdue.\"We can't sit on our hands and wait for the Government to come up with a nurse safety strategy while people are being beaten and bitten and threatened on a daily basis,\" she said.Government figures show there were 129 assaults on staff working across Canberra's mental health, justice health and drug and alcohol sectors between January 2017 and July 2018 — a far higher figure than in any other healthcare area. The ABC revealed in August that nurses had been punched in the face and kicked in the head during multiple assaults by a patient at the Dhulwa Mental Health Unit.Less than two months later, nurses expressed concern for their safety inside a seperate mental health unit at The Canberra Hospital, after graphic photos of another alleged assault on a nurse were posted on social media.The nurses who spoke to the ABC acknowledged the risk of working in mental health, some of which they were willing to bear.\"I love my work, I find it very rewarding when I can just see a little bit of recovery and that can be in any form, just recognising me or trusting me,\" Jane said.But she remained pessimistic about the likelihood of change.\"You keep hearing 'we're doing this, you're very important to us, your safety is paramount to us', yet I see nothing being done,\" she said.\"To me they're just words.\"Jane said she simply wanted to know that she could go to work and return unharmed.\"I would like to know that they value us and that we're safe when we come to work,\" she said.\"We just want to be safe. We want our patients to be safe.\"\nTopics:\nmental-health,\n\n\n\t\n\tassault,\n\n\n\t\n\tcrime,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\taccidents,\n\n\n\t\n\tworkplace,\n\n\n\t\n\tcanberra-2600,\n\n\n\t\n\tact,\n\n\n\t\n\taustralia\n\n\n\n  More\n stories from Australian Capital Territory\nWhat have you always wondered about Canberra that you'd like an ABC reporter to investigate?If you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}