{"id": "Scott Morrison backflips on Foodbank funding cuts amid community backlash", "paragraph": "\n      Updated \n    \n      November 13, 2018 11:18:17\n    \nPrime Minister Scott Morrison has reversed a funding cut to one of Australia's largest hunger-relief organisations.The National Farmers' Federation, the community sector and Labor yesterday slammed the Government's plans to slash Foodbank's funding in half from January. \"I have listened and decided to increase the food relief budget by $1.5 million over the next 4.5 years and have asked the Minister to place more focus on relief in drought-affected areas,\" Mr Morrison posted on Twitter.Foodbank is Australia's largest hunger-relief organisation, providing 67 million meals each year.Foodbank chief executive Brianna Casey said the backdown was a \"massive relief\" after its services had been put at risk. \"As a sector, we are trying to feed more than 4 million Australians, who at some point are struggling with food insecurity,\" she said.But Ms Casey said the Government must reconsider its approach to funding the sector.About 40 per cent of the food and groceries it provides go to regional areas, many of which were feeling the full effect of drought.The Government had planned to cut Foodbank's funding, redistributing the money among three charities instead of two, including SecondBite and OzHarvest.It was part of a competitive tender that Ms Casey said was the wrong approach.\"This is not the right sort of response for a whole-of-government challenge,\" Ms Casey said.\"Having a competitive tender process when we're talking about something as important as feeding hungry children and ensuring families can put a meal on the table — that's not a sensible outcome.\"Mr Morrison said the reversal meant Foodbank's funding would be maintained at $750,000 a year.\"[It's] important that food relief in drought areas is delivered in a way that does not undercut local businesses,\" Mr Morrison tweeted.Opposition to the proposed cuts also came from within the Government's ranks.South Australian Liberal MP Nicolle Flint yesterday spoke out against the plan and said she had raised her concerns with the Prime Minister.Opposition Leader Bill Shorten on Twitter said the reversal was a \"great outcome for people power and common sense\".He praised the community, farm lobby and Foodbank for convincing the Government to \"reverse their mean and foolish cut\" within 24 hours.\nTopics:\ngovernment-and-politics,\n\n\n\t\n\tsocial-policy,\n\n\n\t\n\twelfare,\n\n\n\t\n\tpoverty,\n\n\n\t\n\tcharities,\n\n\n\t\n\tregional,\n\n\n\t\n\taustralia,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tsale-3850,\n\n\n\t\n\tact,\n\n\n\t\n\tqld,\n\n\n\t\n\tnsw,\n\n\n\t\n\tnt,\n\n\n\t\n\tsa,\n\n\n\t\n\ttas,\n\n\n\t\n\tvic,\n\n\n\t\n\twa,\n\n\n\t\n\taustralia,\n\n\n\t\n\tbrisbane-4000,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\tsydney-2000,\n\n\n\t\n\tperth-6000,\n\n\n\t\n\thobart-7000,\n\n\n\t\n\tdarwin-0800,\n\n\n\t\n\talice-springs-0870,\n\n\n\t\n\trockhampton-4700,\n\n\n\t\n\tbundaberg-4670,\n\n\n\t\n\ttownsville-4810,\n\n\n\t\n\tcairns-4870,\n\n\n\t\n\tmackay-4740,\n\n\n\t\n\ttoowoomba-4350,\n\n\n\t\n\tlongreach-4730,\n\n\n\t\n\tmount-isa-4825,\n\n\n\t\n\tmooloolaba-4557,\n\n\n\t\n\tmaroochydore-4558,\n\n\n\t\n\tport-pirie-5540,\n\n\n\t\n\tbroken-hill-2880,\n\n\n\t\n\tgosford-2250,\n\n\n\t\n\torange-2800,\n\n\n\t\n\tcoffs-harbour-2450,\n\n\n\t\n\tport-macquarie-2444,\n\n\n\t\n\tnewcastle-2300,\n\n\n\t\n\tdubbo-2830,\n\n\n\t\n\twollongong-2500,\n\n\n\t\n\twagga-wagga-2650,\n\n\n\t\n\tlismore-2480,\n\n\n\t\n\tbega-2550,\n\n\n\t\n\ttamworth-2340,\n\n\n\t\n\tkatherine-0850,\n\n\n\t\n\tlaunceston-7250,\n\n\n\t\n\tballarat-3350,\n\n\n\t\n\tbendigo-3550,\n\n\n\t\n\tshepparton-3630,\n\n\n\t\n\tmildura-3500,\n\n\n\t\n\tgoulburn-2580,\n\n\n\t\n\tesperance-6450,\n\n\n\t\n\talbany-6330,\n\n\n\t\n\tkarratha-6714,\n\n\n\t\n\tbroome-6725,\n\n\n\t\n\tgeraldton-6530,\n\n\n\t\n\tkalgoorlie-6430,\n\n\n\t\n\tbunbury-6230,\n\n\n\t\n\tport-lincoln-5606,\n\n\n\t\n\trenmark-5341,\n\n\n\t\n\tmuswellbrook-2333,\n\n\n\t\n\talbury-2640,\n\n\n\t\n\twodonga-3690,\n\n\n\t\n\tswan-hill-3585,\n\n\n\t\n\thorsham-3400,\n\n\n\t\n\twarrnambool-3280\n\n    First posted \n    \n      November 13, 2018 07:55:17\n    \n\n\nContact Brett Worthington\n\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}