{"id": "Banking royal commission shows how financial regulators have smaller fish to fry", "paragraph": "\n        Posted \n    \n      October 25, 2018 10:27:48\n    \n\"Stories don't get bigger than this, Brian!\" argues fictional current affairs host Mike Moore in the mid-90s ABC TV show Frontline.The bumbling character, played by Rob Sitch, had been given chapter and verse on a big investment bank involved in very bad behaviour.He was trying to persuade his executive producer, Brian Thompson (played by Bruno Lawrence) of the merits of a huge story.\"Yes, but you've got to make it work for telly,\" responded Brian, unconvinced.\"Fraud doesn't give you vision … It's very complex,\" he continues.\"You've only got three minutes to do a story; five if it involves nudity.\"The meaty bank exposé was placed on the backburner. Instead, ace reporter Martin di Stasio (Tiriel Mara) was despatched to do a hatchet job on the local drycleaner, where staff were helping themselves to the small amounts of money they sometimes found in the pockets of clothes brought in for cleaning.That episode of Frontline was called Smaller Fish to Fry. It's a title, it could be argued, that fits the corporate regulator, the Australian Securities and Investments Commission (ASIC).Because, as the royal commission into misconduct in the financial services industry has once again highlighted, there's been little evidence that ASIC has seriously taken on misconduct at the big end of town.And that's despite, on the surface, some reasonably impressive statistics.In the last seven years, more than 800 people have been banned from providing financial services or credit, and around 400 people have been banned from being company directors. But, given all the things we now know about the big four banks and AMP — the financial planning scandals, the insurance scams, money laundering breaches, fees for no service, charging dead people, and so on and so on; behaviour which ruined thousands of people's lives — it's reasonable to ask: \"How many people in those companies have been prosecuted by ASIC?\"Not many.Nearly all of ASIC's prosecutions are at the bottom end, against people who don't have the resources to fight back (and that's no commentary on their guilt, or otherwise).ASIC appeared quick to move against Dover Financial when it was revealed at the royal commission that a \"client protection\" insurance policy provided more protection to Dover than its clients, particularly in the event of clients receiving poor financial advice.Dover Financial boss Terry McMaster made headlines when he fainted in the witness box, and was very publicly wheeled out of the hearing on a stretcher.Mr McMaster told the ABC \"no client suffered any loss at all\" from the \"client protection\" policy.If his claim is correct, that would be unlike the victims of the big banks and AMP, where ASIC says the compensation bill from \"fees for no service\" alone could run to $850 million.The regulator didn't buy Terry McMaster's story though, stripping Dover Financial of its licence to operate. The royal commission has on many occasions made its feelings known about the conduct of the big players, including raising the prospect that AMP and NAB may face criminal charges.Which begs the question, why has ASIC not moved on any of their licences?From the outside looking in, it appears there's one rule for the big guys and another for the little players.The head of CommInsure gave weight to that theory at the royal commission when she conceded that a \"penalty\" agreed with ASIC for misleading advertising could not be described as \"enforcement action\".Commissioner Kenneth Hayne alluded to the issue in his interim report, when reflecting on the charging of fees for no service:\"No-one has been subjected to any formal public process of investigation, finding and punishment for this conduct,\" he observed.\"Only at the last minute before the royal commission hearings began did enforceable undertakings yield public (and then very limited) formal acknowledgment from entities that ASIC had 'concerns' about their conduct and that those concerns were 'reasonably held'.\"Obviously closing down a big four bank, or even AMP, raises issues for the whole financial system, which is why any regulator would be reluctant to do it.Notwithstanding that, the challenge for ASIC is to show that it's serious about punishing bad behaviour at all levels.You can be certain it will be getting plenty of advice on how to do that in Justice Kenneth Hayne's final royal commission report in February.\nTopics:\nregulation,\n\n\n\t\n\tconsumer-protection,\n\n\n\t\n\troyal-commissions,\n\n\n\t\n\tfraud-and-corporate-crime,\n\n\n\t\n\taustralia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}