{"id": "Virgin Australia to rethink priority boarding for veterans after policy criticised as 'tokenistic'", "paragraph": "\n      Updated \n    \n      November 05, 2018 17:16:28\n    \nVirgin Australia will rethink a pledge to give veterans priority boarding, after the plan was described as \"embarrassing\" and \"tokenistic\". The airline had pledged to let war veterans board ahead of regular passengers and acknowledge them for their service during in-flight announcements.The policy, reminiscent of US airlines, came on the heels of the Government's announcements last week of a discount card and lapel pins for returned servicemen and women and a half-a-billion-dollar upgrade for the Australian War Memorial in Canberra.But it attracted criticism from some veterans and the Australian Defence Association.In a series of tweets on Monday afternoon, Virgin Australia announced plans to review the policy. \"We will consult with community groups and our own team members who have served in defence to determine the best way forward,\" the tweet read. \"If this process determines that public acknowledgement of their service through optional priority boarding or any announcement is not appropriate, then we will certainly be respectful of that.\"The move had received a lukewarm response from some veterans and politicians, while rival airline Qantas declared it would not be following suit.Neil James, the head of the Australian Defence Association, called the move \"tokenistic\" and described it as a manifestation of American culture that was unlikely to translate well in Australia.\"The first problem is that there's other forms of service to the community … like policemen and ambos, and so would you actually start a queue of such announcements? That's a real worry,\" he told ABC Radio Melbourne.One Nation senator Pauline Hanson said she thought the veterans she worked with would find the acknowledgement \"terribly embarrassing\".\"You've now got young veterans in their early 20s,\" she told the Seven Network.\"We look after the aged and those people who are feeble by putting them on the planes first. I think this is a marketing ploy by Virgin. But I think the veterans that I know, I think they'd be proud and say 'no'.\"Qantas said it carried \"exceptional people every day\", and singling a group out as part of the boarding process would be hard to do.\"We have utmost respect for current and former Defence Force personnel, and we honour their service in a few ways during the year, including special announcements on Anzac Day and Remembrance Day, and through our partnership with the Australian War Memorial,\" a spokesman said.\"We're conscious that we carry a lot of exceptional people every day, including veterans, police, paramedics, nurses, firefighters and others, and so we find it difficult to single out a particular group as part of the boarding process.\" President of the RSL ACT branch and interim national chair John King said it would be up to individual veterans if they wanted to take advantage of such an offer, but said airlines could provide discounted fares.\"I think if a business wants to honour a veteran [with priority boarding], as they do with senior citizens and people travelling with children, if the veteran stands up and takes advantage of that, good on them,\" he said.\"Everyone who puts their lives at risk for the benefit of the community needs to be recognised, and I guess this is one way to do it.\"[But] if [airlines] really want to get on board, they could provide a discount for people who work in this area.\"RSL Tasmania spokesperson Terry Roe said priority boarding would benefit older veterans.\"There are over 300,000 veterans and most would be elderly, in their 70s and 80s,\" he said.\"So this initiative probably would be a benefit to some of those, particularly those who are not as mobile.\"Earlier, Virgin Australia chief executive officer John Borghetti told News Corp papers that: \"We acknowledge the important contribution veterans have made to keeping our country safe and the role they play in our community.\"\"Once the veterans have their cards and lapel pins, they will simply need to present them during the boarding process to be given priority boarding and be recognised on board,\" he said.Minister for Defence Industry Steve Ciobo told Sky News it \"would be terrific\" if Qantas followed Virgin's example.\"I think it's tremendous that they come on board and that they honour and salute the service of those men and women who have served our nation in uniform putting themselves in harm's way,\" he said. But Veterans Affairs Minister Darren Chester sounded a note of caution, saying the Government would consult with veterans groups and airlines, and acknowledging comments that veterans would rather have discounted airfares.\"Australians, by nature, tend to keep their light under a bushel, so I think some of the veterans would be happy to get on a plane without anyone knowing that they're there,\" he told the ABC's Insiders. The sentiment was one echoed by some veterans, with Catherine McGregor, formerly Australia's highest-ranking transgender military officer, dismissing Virgin's move as \"faux-American bollocks\".\"I would not dream of walking on to an aircraft ahead of the other passengers as a veteran,\" she tweeted.\"Can't imagine too many people I served with doing this either. Spend more on suicide prevention and health support.\"Research fellow at the Lowy Institute and former Army officer Rodger Shanahan earlier said he was worried Australia was in danger of reaching \"peak veteran\".\"What about police and emergency services who have to attend car crashes, or fish bodies out of rivers? Or paramedics who attend countless overdoses, suicide attempts and related traumatic events? Or staff in emergency departments in hospitals who have to make life-saving decisions every day?\" he wrote in an opinion piece for the ABC last week.\"Add in aged care and disability workers, or special-needs teachers who have to plug away anonymously every day, and the idea of a community thanking military or ex-military people for their service leaves me very uneasy.\"Retired Army Major-General and Liberal senator Jim Molan described the reaction to Virgin's move as \"a bit of a storm in a tea cup\".\"Let [Mr Chester] get out there are talk to veterans, see what veterans think, and then we might take advantage, or thank Virgin and say 'no, not appropriate at this time',\" he said.\"Let the consultation occur.\"\nTopics:\ndefence-and-national-security,\n\n\n\t\n\tveterans,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      November 05, 2018 09:17:08\n    \n\n\nContact Dan Smith\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}