{"id": "Armless beauty vlogger a social media hit in Thailand", "paragraph": "\n      Updated \n    \n      October 21, 2018 13:08:55\n    \nOnce her parents set up the studio lights in their simple one-room Bangkok home, 18-year-old \"Fai\" bursts into action.She's loud and sassy, dancing and laughing as she welcomes her fans to a live broadcast of another make-up tutorial, sponsored by a local brand. \"Hello everyone! Welcome back, it's me Fai doing make-up with my feet — check out my dress, isn't it beautiful?\"Fai gets herself up on her shortened leg, balancing with her full-sized leg, and shimmies her body to the loud R&B music.She has no arms and shows off her bare rounded shoulders by wearing just a crop top.Over the next hour, Fai demonstrates how she uses the sponsor's products — doing everything with her toes.She puts on green contact lenses, attaches fake eyelashes, brushes on foundation, and carefully applies lipstick and eyeliner. \"Today I got 4,000 [viewers], which is very good,\" said Fai, who usually goes by her nickname (meaning \"cotton\") rather than her Thai name Bunthida Chinnawong.\"The most difficult thing is to pick up the small things, like the eyelashes I did during the live [stream],\" Fai said.\"I think every woman has their own beauty, they just need to be confident — show a confident face and beauty will come.\"Fai was born with no arms, a shortened right leg, a curved spine and only one lung.\"The doctor told me to be prepared, that she would not live longer than nine months,\" Fai's mother, Pin Saleepote, said.\"After nine months, he said it might be one year, then it was nine years, ten years.\" As the young girl grew older, the inevitable question arose. \"She asked me why didn't she have arms like others and when she was young I lied to her and said that they will grow,\" Fai's mother said.\"But I told her the truth when she was older, I told her 'You don't have arms, it's okay my child, you can be great, you can show your ability'.\" Fai's love of cosmetics started early, when she would steal it from her older sister and mother. But make-up was not allowed at her special school for disabled children.Fai describes the school as a safe and convenient place, which her \"mafia gang\" of naughty friends did their best to turn upside down.\"We raced each other in our wheelchairs on the ramps from the third floor to the first floor,\" she said.\"We would get punished by the teacher every week but we kept doing it — I used to be very stubborn.\"She used that stubbornness to convince her parents to send her to a \"normal\" school. \"When I started, my mum came with me for half the day, and then after a few days Jane and the gang told her to go home — they walked up to my mum [and said] they would take care of me.\" \"Jane\" is 17-year-old Nipaporn Kongsungnoen, one of Fai's close friends.\"She was fun to be with, she would make people smile and laugh,\" Jane said. \"When friends felt like giving up and needed support to cheer them up, they would consult with Fai to get her advice and she would encourage them to fight on, she told them to see her as example of how to keep fighting.\"When Fai saw her new friends putting on make-up, it was as if a new world opened up and she started to work out how to do it with her nimble toes. \"It came naturally, but also took practice,\" Fai said.She had to overcome the idea in Thai culture that the feet are the lowest part of the body. \"Many people think feet are low parts but I don't think so, my feet bought me this far so it's ok for me,\" she said. Fai scrolls and taps a smartphone with all the ease of someone using their hands, and she started using Facebook to broadcast her make-up tutorials. She battled against the traditional views of beauty in her culture.\"Many people think white skin is beautiful, smooth skin is beautiful or having a nose pointing to Mars is beautiful.\"And yet, she recently had plastic surgery on her nose and a classic teenager's problem.\"I am not beautiful now, I still have pimples,\" Fai said, laughing.The beauty blogger has no time for haters.\"Can they criticise? Yes, they can. But ask me if I care — no I don't care!\"Fai has more than 170,000 followers on Facebook, and her regular live broadcasts are bringing in money and fame.\"I didn't expect she would be this famous, I'm so happy for her that she became so well-known,\" Suchada Kamnaen, another of Fai's school friends, said.Fair decided to share her story more openly when she learned about people committing suicide.\"It made me think, 'Their lives are better than mine … but they chose to end their lives by killing themselves',\" she said.\"I want to give inspiration to those people.\" Each day is precious for Fai.She lives with the constant risk that her curved spine will push into her one lung and damage it.When she was around nine years old, a doctor suggested surgery to try to straighten her spine but only gave her a 15 per cent chance of surviving the operation.\"I told him I prefer to live like this,\" Fai said.Despite her precarious health, Fai is dreaming big.\"My dream is to develop my make-up skills, graduate from university and travel to Australia and France.\" \"I heard there are beautiful cities in Australia, so I want to go around and take pictures; I want to try their food to see if it is more delicious than Thai food,\" she said.She also wants to model on the catwalk — \"I can model in a wheelchair, it's fine, right?\" — and become a television host. \"I want to show people the ability I have, I want to be world famous like other vloggers,\" Fai said.And the 18-year-old has a message for the doctor who said she'd never see her first birthday.\"Hey doctor — I would like to tell you, I am beautiful and I'm still alive, until now! I'm not 'serious' about anything. I take care of myself, in a 'chic-chic', 'cool-cool' way.\"\nTopics:\nfashion,\n\n\n\t\n\tdisabilities,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\tthailand\n\n    First posted \n    \n      October 21, 2018 08:24:49\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}