{"id": "Monster crocodile is largest caught in Northern Territory this year", "paragraph": "\n      Updated \n    \n      October 31, 2018 10:39:54\n    \nWhat's the length of the average family car and powerful enough to devour those inside? The largest saltwater crocodile caught in the Northern Territory this year. At 4.72 metres, the snappy saltie took the title by just 1 centimetre after being caught in a trap at Borroloola.The new record comes after an elusive monster crocodile, thought to be one of the biggest on record, was captured near Katherine in July after a decade-long game of hide and seek.Measuring 4.71 metres and weighing in at up to 600 kilograms, the cranky croc's title has now been narrowly surpassed.\"By all accounts, it's 1 centimetre longer than the one caught in Katherine,\" senior district ranger for the Gulf Region Andrew Peckham said.\"Because he was in such poor condition … rather than relocate to a croc farm, the decision was made for the animal's welfare not to relocate and he was euthanised.\"Mr Peckham said locals were seen swimming just 50 metres away from the trap where it was caught, upstream of the Macarthur River crossing.\"Despite all the signs and all the Crocwise campaigns we have throughout communities, people still don't seem to heed warning signs,\" he said.\"What happened with this one, when it was removed it was taken up to the school to reinforce that these animals, they are real, you know.\"You're living in crocodile country.\" Though you probably wouldn't want to come face-to-face with its toothy grin, the monster is dwarfed by previous records.According to the Northern Territory Government, the largest saltwater crocodile ever caught in Australia was captured in a net on the Mary River in 1974, clocking in at 6.4 metres.The largest saltwater crocodile ever caught in a trap measured just over 5 metres, while in recent months, authorities have captured a number of crocodiles in excess of 4 metres.A 4.27-metre crocodile was hauled out of a creek in Darwin Harbour by wildlife rangers in June, while two salties — dubbed Gobbo and Croco — were dragged from a dam on Annaburroo Station in February.  _ \nTopics:\nanimal-attacks,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\tanimals,\n\n\n\t\n\tnt,\n\n\n\t\n\tdarwin-0800,\n\n\n\t\n\tkatherine-0850\n\n    First posted \n    \n      October 31, 2018 10:03:35\n    \n\n\nContact Bridget Judd\n\n\n\n\n  More\n stories from Northern Territory\nListen to the news in Warlpiri, Yolngu Matha and KriolIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}