{"id": "Stews, stir-fries and scones: Community-led cookbook promotes home cooking in remote Queensland", "paragraph": "\n        Posted \n    \n      October 21, 2018 09:11:06\n    \nA remote Indigenous community in Queensland's lower Gulf of Carpentaria has completed a project specifically aimed at promoting the value of home cooking.Local school children and service providers in Doomadgee, 100 kilometres north-west of Burketown have created a cookbook with the assistance of a South Australian-based hospitality and cookery lecturer. Cooking in our community: Recipes from the Doomadgee kitchen features more than 35 different recipes contributed by students, local service providers, businesses, and police.The book cover displays the artwork of local painter Kelly Barclay, and recipes include everything from one-pot chicken stew, to lemon yoghurt cake, pumpkin curry, avocado dip, and pizza wraps.The project was lead by TAFE SA's Nigel Plaskett who was first invited to the lower Gulf community in 2016 by Doomadgee State School principal Paula McGuire.\"She asked me originally if I would be interested in coming up and doing some cooking classes … and from there it became a community project,\" Mr Plaskett said.\"Then the Department of Prime Minister and Cabinet came on board and funding was allocated for me to work with different services providers, the school, My Pathways, and Save the Children.\" Mr Plaskett said he had previously worked alongside Ms McGuire in 2014 in South Australia creating a community cookbook in the Anangu Pitjantjatjara Yankunytjatjara (APY) Lands.\"One of the things we wanted to make sure though was that no recipes in the [Doomadgee] cookbook were the same as what was in the SA cookbook, so it wasn't like we were copying,\" he said.\"[Also] making sure any of the food that we did cook with could be purchased here in Doomadgee.\"There's no point including a recipe if the ingredients can't be purchased at the local store.\"Senior dietician Courtney Heal from the North West Hospital and Health Service, which takes in Doomadgee, welcomed the project.\"Access to healthful meals is crucial in all ages to prevent malnutrition, failure to thrive, and chronic disease — particularly common in pregnant women and young children, who make up a large proportion of Doomadgee's community,\" she said.\"Through the smart provision of locally sourced foods, Doomadgee families can feed their whole family on the cheap and improve [their] health.\"All of the students and service providers that contributed to the 96-page cookbook were involved in cooking the recipes so they could be photographed for the book.\"It was about engaging everybody and them having ownership,\" Mr Plaskett said.\"We get to see the product, we get to go through all the stages of cooking, and at the end they sat down and ate the finished product.\" Many of the students said they enjoyed the practical element of the project.\"I worked with Nigel and some other students to make the mini quiches. They tasted delicious and I want to make them at home sometime.\" — Katrice Hookey, Year 8\"I helped my sister to make the Anzac biscuits recipe. It was a good recipe and the biscuits taste so delicious.\" — Winsome Hookey, Year 8\"At home I had a go at making the nuts and bolts recipe. It was easy to make and tasted nice.\" — Timesha Sandy, Year 9\"I helped make Nanna's scones. They are easy to make and taste delicious. I had jam and cream on them.\" — Alexis Gregory, Year 9While a number of the recipes included in the cookbook were not strictly healthy, Mr Plaskett said the project was more so about equipping people with skills and motivation to begin cooking at home in the first place.\"It's about getting away from those commercially produced products that we know aren't necessarily always good for us,\" he said.\"Since we started this project a lot of the people involved have told me that they've gone home and tried some of the recipes themselves.\"I think [because of this project] more and more families will get involved in wanting to try the recipes at home, especially the students showing their parents and family members.\"Ms McGuire said, while the cookbook was currently unavailable for purchase, depending on demand they would consider a second print run.\"With our first print run we made enough copies to put one in every house in Doomadgee and also to give to all the people who contributed,\" she said.\"In the future if we have a big enough demand we will consider doing another print run and work out how we could sell books to people who are interested.\"To register your interest in the book, contact the school via their Facebook page.\nTopics:\nnon-fiction,\n\n\n\t\n\thealthy-recipes,\n\n\n\t\n\trural-youth,\n\n\n\t\n\thuman-interest,\n\n\n\t\n\tpeople,\n\n\n\t\n\taboriginal,\n\n\n\t\n\tfood-and-cooking,\n\n\n\t\n\tdoomadgee-4830,\n\n\n\t\n\tmount-isa-4825,\n\n\n\t\n\tqld,\n\n\n\t\n\taustralia,\n\n\n\t\n\tburketown-4830,\n\n\n\t\n\tnormanton-4890,\n\n\n\t\n\tslade-point-4740,\n\n\n\t\n\tadelaide-5000\n\n\nContact Zara Margolis\n\n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}