{"id": "Sick of foam packaging for your vegies? A national solution is still years away", "paragraph": "\n        Posted \n    \n      October 25, 2018 07:26:52\n    \nA council from regional NSW is blaming excess packaging as the reason why it cannot reach its zero waste-to-landfill target.The Coffs Harbour director of sustainable infrastructure, Mick Raby, said that goal was currently impossible.\"There are two things [we need] to reach this target,\" he said. \"One is slightly better use of our three-bin system. At the moment people are pretty good at putting the right thing in the right bin, but when they put the wrong thing in the wrong bin, it's very hard for us.\"The primary change has to be a system of national legislation that forces people not to make stuff that can't be recycled.\"\"Really simple example, I went to my local supermarket on the weekend to buy a zucchini. I couldn't buy one zucchini, I could only buy five.\" \"[They] were sitting in a non-recyclable plastic tray that was covered with cling-on, which is also not recyclable.\"The day there's a set of national laws that stop people presenting goods and products in that sort of fashion is the day we get to 100 per cent.\" Right now, Australia is facing a recycling crisis, after China effectively stopped accepting foreign recycled waste. But Mr Raby said the Coffs Harbour, Bellingen and Nambucca Councils were in a fortunate situation. \"We don't have that problem, nearly 20 years ago, the three councils had quite a visionary idea and followed that through with some significant investment,\" he said.\"Globally, we are very early adopters of good technology systems, and we looked at ways to divert waste from landfill.\"A lot of the rubbish from the three councils is sorted by hand — something Mr Raby said helped to reduce the amount of \"contaminated\" waste. \"Unlike many others who are recent adopters of recycling technology, we've got some pretty good machinery, some pretty good mechanical sorting, but we have a heavy input, a far heavier input than most, of physical labour,\" he said. \"So we have people who are actually separating stuff by hand in greater numbers than most systems would have, which gives us a cleaner product that we can then on-sell. \"There are local users, domestic users in Australia that re-use paper and cardboard and recyclable plastics and that sort of thing.\"  The NSW Environmental Protection Agency (EPA) said it was committed to working with councils, regional waste groups, and industry to improve recycling systems in NSW. \"The NSW Government established an inter-governmental taskforce to urgently progress a longer-term strategic response, in partnership with industry and local councils earlier this year,\" a spokesperson said. \"One of the objectives of the taskforce is to develop a circular economy policy for NSW, and support the development of national circular economy principles.\"Simply put, a circular economy means re-using and recycling locally, as much as possible. The Commonwealth, State and Territory Governments agreed to bring forward an update to the 2009 National Waste Policy by the end of this year. \"We also agreed to the ambitious target that 100 per cent of Australian packaging be recyclable, compostable or reusable by 2025 or earlier,\" Federal Environment Minister Melissa Price said. \"A discussion paper has been released for public comment that will help to inform the update to the 2009 policy. \"The paper proposes a roadmap for collective action to 2030 by businesses, governments, communities, and individuals.\"This includes ambitious targets based on circular economy principles for reducing waste, improving recycling, and developing new markets for recycled products. \"One of the targets for consultation is to phase out problematic and unnecessary plastics by 2030.\"Local Government NSW is the peak organisation representing councils across the state.It has just launched the Save Our Recycling campaign that urges the State Government to re-invest the entire $727 million it collects from the waste levy each year back into waste management and recycling.President Linda Scott said it was critical that NSW develop its on-shore processing capacity for recycled materials, rather than shipping waste to countries such as China.\"A new statewide approach to recycling must be funded by the $727 million the State Government currently collects through the waste levy, around $300 million of which comes from local government,\" she said. But the EPA said money collected from the waste levy provides funding for the NSW Government's Waste Less, Recycle More initiative.\"This is the largest waste and recycling funding program in Australia,\" a spokesperson said. \"$802 million is being invested over nine years from 2012–2021 through Waste Less, Recycle More to drive waste avoidance, recycling, organics collections, market development, management of problem wastes, new waste infrastructure, and programs to tackle illegal dumping and litter.\"Up to July 2018 the Waste Less, Recycle More program has awarded $407 million to more than 1,160 projects to process 2.39 million tonnes of waste each year, creating 845 jobs.\"\nTopics:\nenvironment,\n\n\n\t\n\trecycling-and-waste-management,\n\n\n\t\n\tport-macquarie-2444,\n\n\n\t\n\tcoffs-harbour-2450,\n\n\n\t\n\tnambucca-heads-2448,\n\n\n\t\n\tbellingen-2454\n\n\n\n  More\n stories from New South Wales\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}