{"id": "Canada has legalised cannabis. This is why Australia should follow suit", "paragraph": "\n        Posted \n    \n      October 21, 2018 08:00:00\n    \nCanada has legalised cannabis. And I'm not interested in celebrating. I'm interested in preparing — preparing for cannabis legalisation by ensuring we have the best health and safety measures in place before it hits our shores. Whether it's next year or a decade from now, the question concerning cannabis legalisation is no longer if, but when.History has taught me that our drug laws — good or bad — take time to untangle once we realise they don't work. And when it comes to drugs, our realisations come about a 100 years too late.These late realisations come with significant costs for our safety and wellbeing. Our community has suffered from undue poverty, criminality and negative health outcomes.We're late learners when it comes to drug laws.Therefore, the salient question for me is neither if nor when, but how. How will we manage the legalisation of cannabis?More European countries will, most likely, take this leap before Australia. The Dutch are, of course, famous for their early cannabis laws, but I can imagine countries like France and Germany jumping in before Australia. The problem in these countries is that their tobacco laws are far behind Australia's. Tobacco advertising is still smothered across bus shelters and many people continue to smoke in public places.While they have adopted graphic images on their packaging, anyone at any age can purchase tobacco on a street corner from a vending machine. There is little to no control over tobacco in those countries and they continue to pay the price for that lack of control.Conversely, Australia has led the charge with our tobacco reforms and the rest of the world is playing catch-up. For instance, the UK only adopted our plain packaging laws last year.The key concern for our leaders should be: How much control can we possibly have over cannabis?The answer is, quite a lot. And if we regulate it in a strategic manner, our kids will end up a lot healthier than kids in most other countries.The truth is, with a multibillion-dollar industry push behind it, legalising cannabis doesn't need the reformers like me saying it's time for change — change is headed for us with the wind in its sails.I am not for legalising cannabis without control. I am for more control and right now. When it comes to cannabis in Australia, we have very little.In fact, we are one of the highest cannabis users in the world.Therefore, allowing the legalisation of cannabis without decent safety and health restrictions in place would be worse than what we have now.But standing still is no longer an option.This is where Canada has taken a strategic step — they have banned advertising, enforced plain packaging, regulated how the ingredients are displayed and limited how many shops can sell it in the first year.  You need to be 19 to purchase it in all provinces except two, where you must be 18.Prime Minister Justin Trudeau tweeted: \"Profits out of the hands of criminals. Protection for our kids. Today #cannabis is legalized and regulated across Canada.\"Canada will certainly benefit from the profits moving from the underbelly into the pockets of their economy. And that is common sense regulation of a black market but let's be clear — we will never destroy a black market entirely.Today, Australia is home to a tobacco black market. However it's tiny. And a tiny tobacco black market is something far easier to police than an the impossible mission of shutting down every backyard ice lab.This is about being pragmatic and our kid's health and safety should remain paramount.Clearly cannabis doesn't come without some significant health and safety issues that need to be addressed. More research into \"who\" cannabis effects negatively and \"how\" needs to be done. This is an area that Australian leaders should be investing now.Cannabis use can cause anxiety and depression. So can alcohol.Is it addictive? Yes, but nicotine is far more addictive.Keeping cannabis prohibited for health reasons alone no longer makes sense. When we prohibit alcohol and smoking, the problems are greater — we lose control of the market but more importantly, it becomes far more difficult to treat people with health issues.And after all, a significant number of Australians use it regardless of it's illicit status.Against the odds, we've reduced the number of young Australians smoking despite it being legal — let's do the same for cannabis.Either way, making something illegal exacerbates the situation. While it will be prudent of us to monitor how Canada manages the health outcomes of legalising cannabis, our leaders should not hesitate in being proactive.Every state and territory should now be asking themselves how to deal with this inevitable tide.Australia leads the way with reducing harm from tobacco. We now need to take control of the cannabis market before the industry gets their money in first.Matt Noffs is chief executive of the Ted Noffs Foundation. Twitter: @mattnoffs \nTopics:\ndrugs-and-substance-abuse,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\taustralia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}