{"id": "The best way to access your money on holiday overseas", "paragraph": "By Emily StewartYou've saved up for months and now you're heading overseas on the trip of a lifetime.When you get there you'll obviously need to access the local currency, whether it be euro, rupiah or baht.  But what's the best value way to take and access your hard-earned overseas? Should you get a travel money card? Convert your currency before you take off? Or just stick with using your regular credit or debit card? And what are the pros and cons of each option?ABC Life has researched some of your options — cash, pre-paid, debit, credit and travel credit card offerings as well as wiring money services and old-school travellers' cheques — and read the fine print, so that you don't have to.The most sensible thing to do is to have a variety of ways to access money in case of emergencies, but when it comes to everyday spending we've got you covered.Buying foreign cash involves going to a money dealer, like a local bank, bureau de change or post office and using Australian dollars to buy a foreign currency. The dealer will charge a fee or commission for providing the service, which might mean charging you a worse rate than the wholesale currency market rate.While you can't haggle for a better exchange rate, you can shop around.Travel money cards are basically a pre-loaded debit card you can use overseas.Banks, the post office and even major airlines offer them (for a fee). You choose the amount of each foreign currency you want loaded onto the card and you can then use the card at ATMs to get cash out and to pay for things in shops.So, you've decided you want to see the whole world but you have none of the money?Look for the best exchange rate offered with the lowest fees. Try to choose an option that allows overseas ATM withdrawals for free.Your regular debit card can be used overseas to withdraw cash at ATMs or point of sale. Like when you're at home, it uses the money you have in your account.Two in five Aussies are still with the same bank from childhood because changing can seem like a hassle. But tackling the switch can get you a better deal — and it's not as hard as you might expect.Try to find an ATM network that has a partnership with your bank so you won't have to pay a withdrawal fee (you will probably still be charged a foreign transaction fee from your local bank).As with your debit card, you can also use your credit card overseas.Let your bank know before you travel, as they might put a hold on it if they see what they think is fraudulent transactions.Avoid using dynamic currency conversion (when an overseas sale is offered in Australian dollars). It usually offers an uncompetitive exchange rate.A travel credit card is like a regular credit card, but targets frequent travellers by offering no foreign transaction fees.Consider how often you travel and whether the card will suit your needs at home too.Travellers' cheques are physical cheques that are bought in Australia, with a fixed amount of money written on it. They can then be exchanged overseas for cash.These were used widely between the 1950s and 1990s. They still exist but are no longer widely accepted.Double check that travellers' cheques are still in use where you're going.Wiring money can refer to a money transfer service or a bank wire transfer. It's essentially about sending money electronically from Australia to an overseas financial services firm, where the traveller can access it as cash.It's often used by migrant workers to send money to family back home.From rediscovering themselves in a foreign country, to feeling alone while their mates are at work, readers share what it's like to take an adult gap year.Unnecessary for most holiday-makers and best to avoid the high fees.There's plenty about how to navigate money problems and the world of finance on ABC Life's Money page.All of the information in this article is available on the websites of organisations offering these products, so if you're interested in pursuing a specific option, we recommend reading through it yourself.Ultimately, the best way for you to take money overseas depends on your answers to the above questions but for most situations, a combination of converted cash and a (low fee) card of some type will leave you well prepared.This article contains general information only. It should not be relied on as advice in relation to your particular circumstances and issues, for which you should obtain specific, independent professional advice.ABC Life helps you navigate life's challenges and choices so you can stay on top of the things that matter to you."}