{"id": "Animals saved by firefighters, others killed in pet shop blaze north of Brisbane", "paragraph": "\n      Updated \n    \n      November 18, 2018 15:18:27\n    \nFirefighters have come to the rescue of puppies, kittens, ducks and chickens but several other animals were killed after fire broke out in a pet shop north of Brisbane early on Sunday morning.Six fire crews were called to the blaze at the large pet store at Kallangur around 3:00am, and arrived to see flames coming through the roof at the rear of the building.Inspector Leigh Campbell from Queensland Fire and Emergency Services said the animals were evacuated from the burning building while firefighters worked to bring the fire under control. \"Crews got into action and realised very quickly there were animals inside,\" Inspector Campbell said. \"Our main priority was to rescue as many animals as possible — there were no persons, but of course any life is important, and the pets became the priority.\"Getting the animals out was difficult because a lot of them are in cages.\"There are some large dogs, there are small dogs, there's cats, there's ducks, there's all sorts of animals in there — it's a bit like rounding up sheep.\"Firefighters at the scene told the ABC six cats, a budgerigar, several lorikeets and a guinea pig were killed in the blaze.Several police officers at the scene gave some of the rescued animals a cuddle to calm them down.Police have declared a crime scene and investigators will work to determine the cause of the fire.Inspector Campbell said the flames were contained to the pet shop, but a neighbouring building sustained smoke damage. \nTopics:\nemergency-incidents,\n\n\n\t\n\tfires,\n\n\n\t\n\tanimals,\n\n\n\t\n\tkallangur-4503,\n\n\n\t\n\tbrisbane-4000,\n\n\n\t\n\tqld\n\n    First posted \n    \n      November 18, 2018 10:29:25\n    \n\n\n\n  More\n stories from Queensland\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}