{"id": "Martu students fly 1,500km to boarding school for valuable vocational education", "paragraph": "\n      Updated \n    \n      November 18, 2018 10:03:25\n    \nA remote community in Western Australia is equipping students for the future through an independent teaching program at home, and by sending senior students to a boarding school 1,500 kilometres away for vocational training.Senior students from Parnngurr Community School are treated like rock stars when they travel south to boarding school near Esperance.The tiny remote Aboriginal community of Parnngurr lies 370km east of Newman in Western Australia, on the edge of the Great Sandy Desert.About 140 self-described \"bush people\" live there, mostly Martu Indigenous families, although the community swells in number during cultural events.When founded, the community decided its first priority was to build a school, which opened in 1992 while people were still living in humpies.Now, senior Martu students are being sent to boarding school for vocational training for the first time.Studying a stock and station course is helping students get certificates, drivers' licences and skills to support the region's community ranger program, a large employer of residents.The entire community turns out to see them off with a row of high-fives before they jump on the Abstudy-funded charter plane to Esperance via Broome then Perth. Students come back from the Wongutha Christian Parent-Directed School with a qualification that allows them to go into hospitality, the community ranger program, metalwork or other jobs.Parnngurr school board chairman Clifton Girgibar and his elders are proud of their students.\"As a parent, [I'm] really, really happy,\" he said.\"The old people are happy they're going to school, they're talking about it.\"Down at Wongutha, student Murph Williams does the Training for Life program and plays football with the Ports team, while Ezekial Nixon studies mechanics and plays with the Esperance Bulldogs. \"This is my third term now. I finish school in 2019,\" Ezekial said.Teacher aide and parent Darlene Richards said going to boarding school was a good opportunity for students to achieve goals and learn skills useful to the community.\"For the whole community, it makes them proud,\" she said. Meanwhile, at Parrngurr, knowing every child by name is a feature of teaching in the community.The school only has three classrooms, but a massive area of nearby Martu country is rich in significance and resources for cultural education.The key to engaging students is the two-way learning system that has been embedded into an independent teaching program.Students have Martu teacher aides and learn Martu culture in the bush alongside western science and English in the classroom.A bilingual program developed with the CSIRO is also delivering valuable ongoing teaching resources for the identification and management of local flora and fauna in the vast area of Martu country.The community is situated within the Karlamilyi National Park, on the edge of the Canning Stock Route.KJ's (Kanyirninpa Jukurrpa) ranger program in Parnngurr employs local residents who regularly visit Ruddall River National Park and Warntilly Claypan to manage on-country resources and teach younger generations traditional culture.Hunting sand goannas is a favourite activity of the elder women and children. \"In our class we're learning about emus and about how they lay eggs, how they grow, how they hatch in the season,\" teacher aide and parent Raylene Butt said.\"Sometimes we take them out bush to learn about the bush food, bush tucker and bush medicine, take them out to track down animals.\"We also get Martu people in the community to do some Martu language with the kids.\"Two-way learning is good for the kids because they're learning about white way and Martu way.\"Ms Butt said going to Wongutha was best for her son Murph, who could learn to socialise as well as pick up valuable skills for the community.\"He is enjoying it down there — loving his footy, loving playing guitar, learning about stock and station,\" she said. \nTopics:\neducation,\n\n\n\t\n\taccess-to-education,\n\n\n\t\n\tindigenous-aboriginal-and-torres-strait-islander,\n\n\n\t\n\tindigenous-culture,\n\n\n\t\n\tregional,\n\n\n\t\n\tnewman-6753,\n\n\n\t\n\tesperance-6450\n\n    First posted \n    \n      November 18, 2018 09:59:46\n    \n\n\nContact Susan Standen\n\n\n\n\n  More\n stories from Western Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}