{"id": "Banking regulator boss Wayne Byres reappointed as APRA gets $58 million in extra funding", "paragraph": "\n      Updated \n    \n      November 05, 2018 09:33:43\n    \nAustralia's banking regulator will receive an extra $58 million and have its chairman's tenure extended amid a period of sustained criticism for the organisation.Treasurer Josh Frydenberg has reappointed Wayne Byres, who became the Australian Prudential Regulation Authority (APRA) chairman in 2014, for another five-year term.The reappointment has been made early, with his current term not due to expire until July next year.It comes after the banking royal commission was highly critical of APRA for failing to prosecute misconduct.But Mr Frydenberg said Mr Byres deserved to stay in the top job.\"Wayne Byres is well-respected both domestically and internationally,\" he said.\"I think he's done a very good job. But no doubt with all our regulators, be it ASIC or APRA, there will be changes as a result of the Royal Commission's final report.\"APRA will receive the additional funding over four years to improve its supervision programs.\"What we are keen for is a review of APRA's enforcement strategy,\" Mr Frydenberg said.\"So that it uses its formal enforcement powers across the industry it supervises, including superannuation, in the most effective way.\"\nTopics:\ngovernment-and-politics,\n\n\n\t\n\tbanking,\n\n\n\t\n\taustralia\n\n    First posted \n    \n      November 05, 2018 09:08:52\n    \n\n\nContact Brett Worthington\n\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}