{"id": "Australia should not be 'too embarrassed' after batting collapse, says Dale Steyn", "paragraph": "\n      Updated \n    \n      November 05, 2018 09:41:49\n    \nVeteran South African paceman Dale Steyn says Australia should not feel embarrassed by their batting flop in Sunday's ODI clash in Perth.Australia crashed to 6-66 before being bowled out for 152 in the opening ODI match of the series.South Africa won by six wickets with 20.4 overs to spare in a fizzer of a match, but Steyn was forgiving when asked after Sunday's win to assess Australia's inept batting display.\"No, I don't think they need to be too embarrassed by it,\" Steyn said.\"The conditions were tough. Throw another 30, 40 runs on there and it becomes quite a tricky chase.\"I think we out-bowled them. I don't think they bowled as well as they potentially could have. That was the difference.\"I think our bowlers were relentless with their lines and lengths and made it extremely difficult to score.\" Australia have lost 17 of their past 19 ODIs — a worrying trend with less than seven months until the 2019 World Cup in England.Batting collapses have become Australia's primary concern, with skipper Aaron Finch admitting his players are feeling some self-doubt after the disappointing run of results.\"You'd say that guys are probably at times doubting themselves,\" Finch said.\"And when you're 3-8, you probably have to go and play a different style of one-day cricket than what you map out in your head about how you think the game will unfold.\"When guys are not performing as well as they can do, there's always going to be a bit of doubt.\"But you're only one good shot away from feeling on top of the world again. I think it's about understanding it's not all doom and gloom.\" Despite Finch's admission, 35-year-old Steyn still rates Australia's batting line-up highly, despite Sunday's collapse.The home side were 3-8 in the sixth over, with Alex Carey (33) and Nathan Coulter-Nile (34) the only Australian players to make it past 16.\"I think they bat deep,\" Steyn said.\"They bat all the way down to Nathan Coulter-Nile. He can really bat.\"Our strength is our bowling right now. It's hot.\"Lungi [Ngidi] has been going hot since the IPL [Indian Premier League]. KG [Kagiso Rabada] has been a fantastic competitor for the last couple of years.\"And Imran Tahir is arguably the best white-ball spinner in the world.\"Australia will be aiming to rebound in Friday's clash with South Africa at Adelaide Oval, with Finch confident that wins are just around the corner.\"It will turn. The way that we're training, believe me, the wheel will turn. And it will happen quickly,\" Finch said.AAP/ABC\nTopics:\nsport,\n\n\n\t\n\tcricket,\n\n\n\t\n\taustralia,\n\n\n\t\n\twa,\n\n\n\t\n\tperth-6000\n\n    First posted \n    \n      November 05, 2018 09:37:15\n    \nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}