{"id": "Tasmanian shoppers to face more bag checks under proposed anti-shoplifting laws", "paragraph": "\n      Updated \n    \n      November 18, 2018 15:24:30\n    \nTasmanians may have to undergo mandatory bag checks in retail stores across the state under newly proposed legislation aimed at curbing theft.The legislation, which was announced today, would allow employers at any store to physically inspect customers' bags as they exit a store.Under current legislation, only employed security guards stationed at the front of stores have the authority to check bags.Tasmania's retail sector, which is worth more than $6.1 billion, is estimated to lose in excess of $216 million to shoplifters each year.In a statement, Tasmania's Building Minister Sarah Courtney said the legislation was a win for both retailers and customers.\"These amendments will not only protect the livelihood of Tasmanian retailers by helping to prevent shoplifting, but will also protect consumers by ensuring that bag checks are carried out in an appropriate and regulated way.\" Ms Courtney said the legislation was in keeping with the Tasmanian Government's commitment to crackdown on shoplifting rates across the state. \"This is in addition to the other initiatives ... designed to reduce shoplifting, including increasing police presence in shopping precincts, and providing a no-interest loan scheme to small businesses that want to install good quality, high-definition digital recording cameras for CCTV.\"Executive director of the Australian Retail Association, Russell Zimmerman welcomed the proposal and said he hopes to see it implemented in every jurisdiction across the country. \"[This will] protect the livelihood of Tasmanian retailers and provide stability to the longevity of the retail industry,\" he said. \"The passing of this legislation will deliver certainty to consumers, assist in reducing retail theft and will also protect consumers by ensuring bags checks are conducted in an appropriate and regulated manner.\"The laws copy those in New South Wales which Mr Zimmerman said had been effective.\"[With technological advancements] people are more likely to get caught stealing now than ever before,\" he said.\"But when the economy gets tighter, we see theft go up,\" he said.He said luxury \"feel good\" items such as cosmetics are the most commonly stolen product, while small, easily concealed items such as baby food, razor blades and batteries are also frequently lifted. He said the rate of items being flogged from shelves is likely to pick up significantly over the Christmas season — the peak trading period for retailers.The Australian retail sector is estimated to lose in excess of $9 billion of its total $310 billion to theft. Cinema owner and president of the North Hobart Traders Association, John Kelly, described the legislation as \"a big step forward\" and said \"the sooner it is implemented the better\".He described theft as being rife on the North Hobart strip, but a particularly \"big issue\" at his State Cinema bookshop.\"Retail margins are getting tighter all the time and theft can absolutely crucify retailers, especially small traders, which makes up the whole strip in North Hobart,\" he said.\"It's demoralising for businesses and it makes it awkward for staff.\"He estimated between 5 and 7 per cent of the bookshop's revenue was lost to thievery.\"Even with security cameras it's always tough … we've caught them on video but by the time you do all this they're out the door and then it becomes a clunky system and police have to deal with it all after the event,\" he said.Mr Kelly said the current situation where retailers are \"powerless to take immediate action\" on thieves was \"unworkable\" and that legislation needed to be updated urgently.\nTopics:\nlaw-crime-and-justice,\n\n\n\t\n\tlaws,\n\n\n\t\n\tretail,\n\n\n\t\n\ttas\n\n    First posted \n    \n      November 18, 2018 09:07:13\n    \n\n\nContact Phoebe Hosier\n\n\n\n\n  More\n stories from Tasmania\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}