{"id": "Bourke Street attack: What we get wrong when we talk about terrorism", "paragraph": "\n        Posted \n    \n      November 13, 2018 10:02:08\n    \nThe violence in Melbourne's Bourke Street last Friday is still being investigated as a terrorist incident and, as with all terrorist incidents, the media and public are rightly eager for information.While the authorities have been as open as they can be, this early in the process there will always be unanswered questions — with debates around mental health, religious motivation and the like always at the forefront of the discussion.While the specifics of this incident will be determined by the investigation, some aspects of the radical Islamist terrorism phenomenon bear closer examination. Those which usually form the basis of reporting, conjecture and general discussion.Even if an attacker had mental health issues, that does not mean it wasn't an act of terrorism. The key element that determines whether someone conducts a terrorist attack is intent. Did the person know what they were doing, and was the intent to advance a political, religious, or ideological cause?I was an expert witness in the coronial inquest into the 2014 Lindt cafe siege. I was of the opinion that it was not a terrorist act because gunman Man Haron Monis' intent was to pursue individual grievances, rather than any cause. The public is aware of the dangers posed by individuals that undergo violent psychotic episodes. Yet from what we know of the Bourke Street attack, it had a degree of (albeit unsophisticated) planning. The perpetrator chose a Friday afternoon and his target was perhaps the busiest point in the Melbourne CBD when there would have been a heavy concentration of individuals. He used a vehicle laden with gas bottles, an ignition device, and a knife. Obtaining these would have gone under the radar.So his actions in choosing a time, place, and method of attack indicate he was sufficiently aware of the planning considerations necessary to undertake a mass casualty attack (or that someone guided him to do this), even if he did a poor job carrying it out. The reality is that in many instances the family knows the individual was radicalised but don't want to admit it. This reluctance might be because of the shame it will bring on the family, because they are in denial, or because they are actually broadly sympathetic to the individual's worldview. Leaders of mosques are hardly likely to accept that one of their members was a radical jihadi but that they failed to spot it or to alert authorities.The best way of measuring intent is to see what the individual has been up to when they think people aren't watching or listening to them. Their physical and electronic footprints provide a wealth of information regarding their real ideological makeup. And this will take quite some time for authorities to properly understand — so the picture will only emerge over the coming weeks, and possibly months.Indeed, inspiration is the aim of the modern radical Islamist group. In an increasingly interconnected and globalised world, access to a computer can connect a person the global jihad. The online English-language magazine produced by Al Qaeda in the Arabian Peninsula was called Inspire for this very reason.In the Australian experience, jihadis have variously been in direct contact with overseas partners, received support from abroad, or had no contact whatsoever. In the latter case, local clusters provide an echo-chamber for their expression of violent, radical views, and the internet allows them to download a wide range of ideological and operational support material. All at the click of a button.Given the perpetrator had his passport cancelled in 2015 for trying to travel to Syria, it would be safe to say the attacker has had an interest in violent jihad for a number of years.It may not have taken much to inspire him to conduct this attack. If someone wants to commit a terrorist act and is happy to die in the process, it is very hard to stop them.If they act individually and not as part of a network or cluster, it is even more difficult. And with more individuals of interest than there are resources to monitor them 24 hours a day, seven days a week — for years if necessary — then prioritisation and risk management is a fact of life.In a liberal, democratic society, there is no way to legislate guaranteed security from a terrorist attack. That's the reality.But a reality often lost on commentators is that our counter-terrorism legislation is pretty robust. Australia's gun laws are also robust. And security agencies and police forces are highly professional, and, unfortunately, quite experienced in this regard. This is probably the reason why someone who drove into the middle of the Melbourne CBD late on a busy Friday afternoon likely with the intent to kill as many people as possible only succeeded in killing one person. And as tragic as the loss of any life is, without robust domestic laws and a very rapid police response, the outcome could have been much worse. This is the elephant in the room that governments find difficult to deal with. The public wants to know why a small section of its Muslim community want to attack it. So the government needs to explain it, by talking about a religion with no central governing authority and that is interpretive by nature.Most of the general public have little idea of Islam (or desire to get to know it), and the media seeks to variously demonise the religion or absolve it. Meanwhile, Muslim communities themselves struggle to find a unifying voice, given the disparate groups that claim to be representative of elements and vie for profile. It is a minefield for politicians to enter.Which is why the best source of understanding the motivation for plots is the courts. Judges sit for weeks listening to reams of evidence, and, after a jury of peers has convicted the terrorists, judges must then make sense of what he or she has had before them. So it is worth just looking at a small sample of what the courts have had to say:A minor convicted in 2018:On any view, the offender clearly contemplated an attack which was ideologically and religiously driven.Tamim Khaja convicted in 2018:The offender believes that the militant instructions of Allah in these verses are valid and binding upon him even in the present day, to the point that he is willing to implement those commands by an attack such as the one he planned.Hamdi al-Qudsi convicted in 2016:The offender's reason for offending was, at least in part, because he understood it to be his religious duty to help send men to Syria to fight.Abdul-Nacer Benbrika and others convicted in 2009:(intercepted conversations) … conclusively demonstrated that the prisoners all considered themselves as active, involved, and committed Muslims. They saw their commitment to violent jihad in the context of this religious commitment.So, before the public and media debate about the nature of religion and mental health with respect to terrorism, or to rely on interviews with family and religious leaders to provide informed commentary, it is worth realising terrorism incidents and investigations are a bit like icebergs. The incident and/or arrest is simply the tip, with the detail of the issues largely hidden from view. By the time the bulk of the information is available on which informed opinions can be made (normally at trial), the media has lost interest.All this means discussions about the nature of the terrorist threat tends to go around in circles, as the same issues are raised, commented upon, and then forgotten.The Bourke Street violence, if it is confirmed as a terrorist attack after the investigation is complete, appears to be heading down the same path.Dr Rodger Shanahan is a research fellow at the Lowy Institute. This piece first appeared on the Lowy Institute's The Interpreter blog.\nTopics:\nterrorism,\n\n\n\t\n\tunrest-conflict-and-war,\n\n\n\t\n\tlaw-crime-and-justice,\n\n\n\t\n\tcrime,\n\n\n\t\n\tmental-health,\n\n\n\t\n\tcommunity-and-society,\n\n\n\t\n\tislam,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\taustralia\n\n\n\n  More\n stories from Victoria\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}