{"id": "Eve van Grafhorst was diagnosed with HIV and hounded out of Australia, but her legacy endures", "paragraph": "\n        Posted \n    \n      November 18, 2018 08:51:16\n    \nEve van Grafhorst was almost three when she was diagnosed with HIV in 1985, early in the AIDS crisis. She was one of the first children in Australia to contract the virus, through contaminated blood transfusions. The disease would end up killing her, but Eve's battle was not only a medical one — it was also against public panic, hysteria and humiliation.The three-year-old and her family were shunned, and even forced into hiding, before eventually being hounded from the country.But Eve was not only a victim — she was also a fighter who became one of the most recognisable faces of the AIDS crisis, as well as an inspiration to others.This coming Tuesday is the 25th anniversary of Eve's death. Her sister Dana Lee, who spoke to the ABC from New Zealand, can still vividly recall the controversy that surrounded her little sibling's short life.\"When we went back to our home, the neighbours had built a six-foot fence to keep us out, or to keep the AIDS out, I guess,\" she said. During the AIDS epidemic, public understanding of the disease and how it was transmitted was limited, but the fear and stigma surrounding it were high.\"I was basically told that Eve had HIV. Mum explained what that was, and what that meant, and that she had a possibility of dying by the time she was five,\" Ms Lee said.\"Mum at the time said to me, 'That's not going to happen because Eve has a spirit, and we are a fighting family'.\"Eve contracted HIV through a series of lifesaving blood transfusions given to her when she was born prematurely in 1982 — no-one realised blood stocks had been contaminated with HIV.Her diagnosis became public knowledge after she bit another child at her childcare centre, in Kincumber on the New South Wales Central Coast. Local authorities banned Eve, claiming she posed a risk to other children. Eventually they relented, but insisted the little girl had to wear a plastic face mask.It was only a foretaste of the controversy to come. True to the family's fighting ethos, Ms Lee said they decided to do a story with the 60 Minutes program.\"The program producers actually put us in hiding for a week after it aired to keep us safe,\" Ms Lee recalled.\"On my school bus going to high school, kids wouldn't sit next to me and they told the bus driver he should not pick me up.\"They used to pull my hair and do all sorts of mean things, people would cross the road and not walk on the same side of the road as me. \"Some people were just horrid. I lost lots of friends. It was pretty heart-wrenching.\"Some neighbours put their houses on the market. Other parents at the daycare threatened to withdraw their children if Eve stayed.Ms Lee said because her sister was so young at the time, much of the cruelty and controversy went over her head. But Dana was 12.\"It affected Eve and I differently, I would say. I was a bit more aware of the hurtful things that people were doing and saying. It wasn't really understood by her at the time,\" she said. Unwilling, and perhaps unable, to keep living with the backlash, Eve and her family moved home to New Zealand in 1986.The contrast with Australia was stark: in New Zealand, Eve attended her local school without controversy.As she grew, Eve became an educator in her own right — travelling around New Zealand, raising awareness about HIV.\"When I was at university Eve would often write me letters, I've kept all of them,\" Ms Lee said.\"She was wise beyond her years.\" Ms Lee said when her sister was first diagnosed, the doctors told the family they did not think she would live past her fifth birthday. She defied that prognosis, living until she was 11.None of her former neighbours in Australia ever made contact to express their condolences — or their regrets.Ms Lee prefers to focus on the people who stuck with her during those times.A friend named Melissa walked Dana to the school bus stop each morning. When the bus arrived, the driver refused to listen to the demands to leave her behind.\"He was fantastic, he always saved the seat behind him to keep me safe, which was great, so there were people who were open and supportive,\" Ms Lee said. The public hounding of Eve van Grafhorst was felt most acutely by her family, but it also rippled across the country.In Adelaide, Kath Leane was working in childcare during the mid-1980s, but she quit the job she loved because she too had been diagnosed with HIV.\"I remember thinking, 'That is just horrific the way Australia is treating her [Eve] and the absolute fear that surrounded it',\" Ms Leane said.\"And I thought, 'What if the parents of the kids I'm looking after find out that I am HIV positive? They are going to react very badly', and so it really had a big influence.\"I was reluctant to go back, because of that fear of what people would say.\" But the hopes and dreams held by Eve remained, despite her illness. One of her happiest days came in 1992. She had dreamed of becoming a flight attendant, so Air New Zealand organised a special uniform and a flight for her.The little girl did not live long enough to have a career of her own, but she nonetheless left a considerable legacy.Ms Lee said she believed her sister's situation helped hasten the introduction into Australia of the HIV screening for blood products — a life-saving move.Then there was Dana's choice of career.\"I guess it did influence what I do, where I support children who have additional and special needs. In my work I make sure that people accept individuals for who they are,\" she said.\"Eve stood for compassion and love and awareness and accepting people for who they are.\"She was one of the most kindest people I've ever known in my entire life, so I think she should be remembered for those things.\"\nTopics:\naids-and-hiv,\n\n\n\t\n\tdiseases-and-disorders,\n\n\n\t\n\thealth,\n\n\n\t\n\tchildren,\n\n\n\t\n\tmedical-history,\n\n\n\t\n\thistory,\n\n\n\t\n\tadelaide-5000,\n\n\n\t\n\tsa,\n\n\n\t\n\taustralia,\n\n\n\t\n\tnew-zealand,\n\n\n\t\n\tnsw,\n\n\n\t\n\tkincumber-2251\n\n\n\n  More\n stories from South Australia\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}