{"id": "Greens hope to join Labor to form 'most progressive government' ever seen in Victoria", "paragraph": "\n      Updated \n    \n      November 18, 2018 12:41:59\n    \nThe Greens are eyeing off a ministry in a Labor minority government if it can secure the balance of power at next week's Victorian election, despite Premier Daniel Andrews ruling out making a deal with the party.Victorian Greens leader Samantha Ratnam told the ABC in a wide-ranging interview that \"all options\" are on the table in the event of a hung parliament.\"We want to form progressive government and we are happy to sit down at the table with Labor and try and form the most progressive government this state has seen,\" Ms Ratnam said.Mr Andrews has frequently ruled out any deal with the Greens, but that has not stopped the Coalition from running political attacks about a future Greens-Labor alliance.\"For eight years I have been very clear,\" Mr Andrews said when asked again on Sunday.\"No deal with be offered, no deal will be done.\"In comments that are likely to fuel Coalition rhetoric, Ms Ratnam said there were different ways a government could be formed, including granting confidence and supply agreements or having positions in government. \"All options are on the table, we would enter the negotiations with all those options on the table and we would see what would deliver us the best policy for the state,\" Ms Ratnam said.\"It's very hard to imagine us working with the radical right wing, working with the Liberal Party whose policies seem to be moving more towards the right wing every single day, they are fanning the flames of division hatred and fear.\"Labor currently hold 46 out of 88 seats, the Coalition 37, with the Greens holding three and two independents. A tight election is predicted and the Greens are threatening Labor in Richmond and Brunswick.But in this week the party has been hit by scandal with Footscray candidate Angus McAlpine coming under fire for releasing a rap music years ago featuring misogynistic lyrics that included date rape.The party has stood by him saying the songs were in his past — yet videos from as recent as 2017 show him talking about an ideal trip involving \"topless chicks\" serving him coconuts.Despite pressure, the party is holding firm.\"If we are going to cast people aside when they do something wrong in their past what hope is there for the future, if we don't believe in the capacity for people to change what are we doing here in Parliament?\" Ms Ratnam said.The Labor Party has accused the Greens of having \"fake values\" over their failure to stand down Mr McAlpine. The party has some major policies including ending native timber logging, 100 per cent renewable energy by 2030, more cash for public transport and phasing out poker machines. Every year more than a $1 billion flows into state coffers from pokies taxes, but Ms Ratnam said ending the state's addiction to the machines would be a saving in the long run as government would not need to pay for services to help broken communities.The Greens' energy plans cost about $9 billion, Ms Ratnam said, which would be funded through current streams plus a new bank levy and rezoning windfall tax, which is designed to stop property developers making huge gains from changes to planning. She said the Greens were aiming to increase the number of seats, but would not comment on a change in style or leadership if the party failed to win extra seats.\nTopics:\nstate-elections,\n\n\n\t\n\tgreens,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tpolitical-parties,\n\n\n\t\n\talp,\n\n\n\t\n\tmelbourne-3000,\n\n\n\t\n\tvic,\n\n\n\t\n\tbrunswick-3056,\n\n\n\t\n\tfootscray-3011\n\n    First posted \n    \n      November 18, 2018 08:39:06\n    \n\n\n\n  More\n stories from Victoria\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}