{"id": "NSW Nationals threatened after revealing plan to expel white supremacists from party", "paragraph": "\n      Updated \n    \n      October 31, 2018 13:20:46\n    \nA man has been charged with making a threatening phone call to the NSW Nationals office on the day the party moved to expel white supremacist elements from its ranks. The National Party called police after a man phoned its Sydney head office on Pitt Street and allegedly threatened staff on Monday morning.At the time, the party officials were meeting to discuss sending letters to 20 members asking them to justify why they should not be expelled from the party for alleged links to neo-Nazi materials.Police arrested a 55-year-old man at a home in Chippendale yesterday and charged him with using a carriage service to threaten, harass and intimidate.He was granted strict conditional bail and will appear at Downing Centre local court next month.Senior Nationals Minister Melinda Pavey said the alleged threat would not deter her party from investigating those with suspected links to white supremacy.\"We've just got to do what we've got to do, you can't not do something because you're afraid — that's not us, that's not the Nationals,\" she said.\"We don't have truck with any of that type of behaviour,\" she said.\"I've not seen that type of behaviour before and I'm pleased that our party has called it out and has the investigation ongoing.\" The ABC understands the party will meet again later this week.The party has investigated at least 35 members since the ABC's Background Briefing revealed a plot by members of the alt-right movement to infiltrate and influence Australian political parties from within.The party's state director Ross Cadell admitted it was impossible to track down and get rid of all members with extremist views.\"We would hope to write to them and have them justify why they should remain members of the National Party,\" Mr Cadell said.He said he expected \"almost certainly some will be facing expulsion,\" but not all of those who will be sent letters were implicated to the same level.\"Some of them have partaken in hate speech and some of them haven't,\" he said.\"But they are linked closely enough that we want to get some understanding of where they are and that's what we hope to do.\"He said it was important to send a strong message that anyone known to have links to white supremacist movements would not be tolerated within the party.\nTopics:\nlaw-crime-and-justice,\n\n\n\t\n\trace-relations,\n\n\n\t\n\tgovernment-and-politics,\n\n\n\t\n\tsydney-2000\n\n    First posted \n    \n      October 31, 2018 07:42:48\n    \n\n\n\n  More\n stories from New South Wales\nIf you have inside knowledge of a topic in the news, contact the ABC.ABC teams share the story behind the story and insights into the making of digital, TV and radio content.Read about our editorial guiding principles and the enforceable standard our journalists follow.\n        By Mary LloydIn light of the murder of Saudi dissident Jamal Khashoggi and poison attack on Russian double-agent Sergei Skripal, what do countries gain from assassination attempts?\n        By James BennettIn the secluded town of Paradise, James Bennett finds carnage and destruction reminiscent of Victoria's Black Saturday fires — and a community with the same grit to start over.Not every video sees the light of day the first time round. Time, material and leadership spills can often get in the way. It’s time to look back through the Political Scraps for the year that was 2018The trend towards chauffeuring children is that these facts are seemingly becoming accepted as unavoidable outcomes of modern society. They are largely ignored in transport planning.\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEDT = Australian Eastern Daylight Savings Time which is 11 hours ahead of GMT (Greenwich Mean Time)\n"}