{"id": "\nCampaigners demand explanation after West Ham coach reinstated following far-right march investigation \n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nAnti-racism campaigners demanded a full explanation from West Ham United on Monday night after the club confirmed under-18s coach Mark Phillips will escape dismissal for social media posts about a Democratic Football Lads Alliance march.Phillips was suspended last month after describing on social media how he was present at a London demonstration where organisers reportedly pledged to protest over \"returning jihadists\", \"thousands of Awol migrants\", \"rape gangs and groomers\" and \"veterans treated like traitors\".Telegraph Sport subsequently revealed the former cab driver had historic links with a notorious Inter-City Firm hooligan outfit, having been a childhood friend of well-known former member Cass Pennant.The inquiry into Phillips concluded there was insufficient grounds for dismissal following legal advice from employment specialists, it is understood. Phillips, who did not offer to resign, has been given a final warning.“West Ham United can confirm that following suspension and subsequent investigation, academy coach Mark Phillips has been reinstated to his role in accordance with employment law, and has been reminded of his responsibilities,” read a club statement.  In response, Kick It Out, the anti-discrimination charity, told Telegraph Sport: \"In the interests of transparency, we hope a clear explanation of their decision will be made public. As ever, we are ready and available to offer support to the club around any investigation into potential discrimination – as well as advise on the best way forward when a club representative attends an event which is potentially divisive for the local community.”In March this year, West Ham's board were criticised for holding a meeting where ICF member Andrew Swallow was present. Fourteen other fan organisations also attended the meeting of the Real West Ham Fans Action Group (now named Real West Ham Fans).Phillips was brought to the club by former director of youth development Tony Carr, who left West Ham in 2014 after 43 years service. He previously worked for Arsenal after getting his coaching qualifications while still a taxi driver.Responding to a witness who said he was at the march, Phillips reportedly posted: “I was too. The football fans were sticking to the agreed route and Antifa chose to confront the march. They had their face covered up. We didn’t. Ask yourself honestly who instigated the trouble??”Earlier this year West Ham sacked director of football, Tony Henry, after he claimed the club did not want to sign African footballers.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}