{"id": "\nEngland in the dark over importance of South Africa victory but support echoes Lord's day of glory\n", "paragraph": "Had England faltered against South Africa on Friday, it would have virtually guaranteed that they would have been flying home at the end of the group stage – not that all of everyone involved realised this fact when taking the field, including the player of the match.“Yeah, that was news to me after the game,” said Nat Sciver in the aftermath of her brilliant figures of three for four, which she agrees is the best she has bowled for England. “It is a massive relief,” she continued. “A lot of the team didn’t know that we needed to win – I didn’t!”After easily chasing down the paltry 86 they required for victory, England can rest easy in the knowledge that they will feature in the semi-finals in Antigua next week, going through from Pool A with the West Indies, who they play on Sunday to complete the group stage.The performance of England’s bowlers was dubbed as “close to perfect” by Anya Shrubsole, who claimed a hat-trick to finish off the Proteas.For Sciver’s part, she is thrilled to have been given the chance to take a leading role with the ball, even if it is at the expense of the injured Katherine Brunt, a long-term symbolic leader of the side.At the previous major tournament – when England won the World Cup – it was Sciver’s coming of age as a dominant international batter, belting two centuries before compiling a critical half-century in the Lord’s decider.“It was brilliant to put in that kind of performance and to bowl the first over,” she said of her now equally-important second discipline.Sciver drew a comparison with that famous day at headquarters in terms of the support the team are receiving from their vocal friends and family section at Darren Sammy Stadium.“They have got some good moves,” she said of the dancing that has been a constant feature of the in-ground broadcast. “Walking off the pitch last night at the halfway stage after Anya had taken a hat-trick was probably the best atmosphere we’ve had since Lord’s so they are doing a great job for us and hopefully they can put on a show for us on Sunday as well.”The equation is simple for England: if they beat the West Indies and top the pool they will play Australia next Thursday in the semi-final. If they lose, they will instead come up against India, who have passed through their group stage fixtures undefeated. “We had a tri-series against both of them in India earlier this year so we have played each other quite a lot,” a relaxed Sciver said. “So we know what we are going to come up against.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}