{"id": "\nKanye West announces he is abandoning politics: 'I've been used'\n", "paragraph": "Donald Trump appears to have lost the backing of his most high-profile supporter, as Kanye West announces that his burgeoning political activism is over and adds: \"I've been used\".The 41-year-old rapper had ignored the entreaties of his fellow musicians and decided to openly endorse Mr Trump, visiting him in Trump Tower before his inauguration and in the White House on October 11.West held forth, in a surreal, televised, Oval Office encounter, on prison reform, slavery and poverty reduction in his hometown of Chicago.On Tuesday evening, in a series of Twitter posts, West said he had had enough, implying that his views had been misconstrued.He singled out Mr Trump's proposal this week to end accepting asylum requests at the southern border.  \"I support creating jobs and opportunities for people who need them the most, I support prison reform, I support common-sense gun laws that will make our world safer,\" he said.\"I support those who risk their lives to serve and protect us and I support holding people who misuse their power accountable. I believe in love and compassion for people seeking asylum and parents who are fighting to protect their children from violence and war.\"I would like to thank my family, loved ones, and community for supporting my ACTUAL beliefs and my vision for a better world.\"Last week he became embroiled in a strange \"Blexit\" movement, started by Candace Owens, a Trump-supporting conservative commentator. She said she was beginning the movement to encourage black people to abandon the Democrats, and said the logo for her movement was designed by West.West on Tuesday evening denounced the movement.\"I introduced Candace to the person who made the logo and they didn’t want their name on it so she used mine. I never wanted any association with Blexit. I have nothing to do with it,\" he said.\"My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!\"© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}