{"id": "\nChelsea insist letting Mason Mount and Fikayo Tomori play for Derby against them is not for Frank Lampard's benefit\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nGianfranco Zola has insisted that Chelsea have not allowed Mason Mount and Fikayo Tomori to play for Derby County against their parent club as a favour to Frank Lampard.Chelsea have taken the unusual step of giving midfielder Mount and defender Tomori special dispensation to appear for the Rams at Stamford Bridge in the fourth round of the Carabao Cup on Wednesday night.Mount and Tomori are both on a season-long loan at Derby, where they are playing under Chelsea legend Lampard, and have been star performers for the Championship club. They helped the Rams beat Manchester United on penalties at Old Trafford in the last round of the Carabao Cup.Loanees are not allowed to play against their parent clubs in Premier League matches since a change in the rules after Lomana LuaLua scored a late equaliser for Portsmouth against Newcastle United in 2004.There is no such restriction in the Champions League and Chelsea failed in a bid to have goalkeeper Thibaut Courtois stopped from playing against them for Atlético Madrid in the semi-finals in 2014.Carabao Cup rules allow parent clubs to decide whether or not loanees can play against them, but assistant-manager Zola claimed the influence of Lampard, the leading goalscorer in Chelsea’s history, had not been decisive.Asked if 19-year-old Mount and 20-year-old Tomori can play because of the strength of feeling towards Lampard, Zola said: “No, it's not only that. I can tell you it's not that.“It is because we believe that, by playing against us, there is an opportunity for Mason and Tomori to grow up quicker.“The more they play against Premier League teams the more experience they get and we can make better evaluations on them. It was a great opportunity to see them play in front of us and we took the opportunity.“There will be a lot at stake. It will be a game on a higher level to the ones they play in their own league, but there will also be a psychological component. They will have to play in front of a big crowd, the crowd of the team they belong to. It will give them a good test.”While Lampard has claimed he will not go wild if Derby manage to pull off another shock, Mount and Tomori have been given permission to celebrate a goal or victory.“It’s down to them,” said Zola. “But why not? Hopefully they won't celebrate too much!”Zola, though, warned there is no guarantee that Chelsea’s other loanees will be allowed to play against their parent club, saying: “It's important to see the two players playing to give good indications for us. But in the future it does not mean we will keep doing that.”Meanwhile, Chelsea coach Marco Ianni has been fined £6,000 after admitting his improper conduct charge from the Football Association.Ianni was handed the punishment for his furious bust-up with Manchester United manager Jose Mourinho at Stamford Bridge earlier this month.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}