{"id": "\nChelsea's match-winner Alvaro Morata can still improve, insists Maurizio Sarri\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nMaurizio Sarri has backed “fragile” Álvaro Morata to keep improving after the striker scored two goals in Chelsea’s 3-1 victory over Crystal Palace.Morata has now scored five goals in his last six games, but should have finished the game with the matchball after squandering a late chance to secure his hat-trick.Chelsea’s £57 million record signing has struggled to justify his price tag since joining from Real Madrid last summer and head coach Sarri believes confidence has been an issue.“He's a little bit fragile,” said Sarri. “From the mental point of view. But he's very young. I think he can improve, improve very fast.”Asked if his recent run would improve Morata’s belief, Sarri replied: “I think so. Álvaro improved during the last month. Improved for the confidence, improved for the personality, improved also from the technical point of view. Now he's able to play more with the team, I think. But I think, also, that Álvaro has a very great physical and technical potential, so I think he can improve more.”Morata only trails Tottenham Hotspur striker Harry Kane by a single goal in the Premier League and is level with last season’s top scorer Mohamed Salah.On the subject of whether the 26-year-old can keep up with the Premier League’s most lethal strikers, Sarri said: “I don't know. But for Álvaro, the goal has to be a consequence. He has to play for the team, with his mates, without thinking about goals. Goals are usually consequence of teamwork.“Álvaro is very fast. Not in the first two or three steps, but if he has to run for 40m he's very fast. He has great potential.”Pedro was also on the scoresheet against Palace and the result meant that Sarri equalled Frank Clark’s Premier League record of not losing any of his first 11 games in charge.“I am really very proud, but I am very proud to be the coach of this team,” said Sarri. “The record is not one of the coach, but of the team. I was lucky. I have very good players and my players, in the last two months, were able to win also without a great level of organisation from the tactical point of view. I was lucky, I think.”Palace have not won in six Premier League matches, but manager Roy Hodgson said: “It doesn't really matter where you are at Christmas. We were rarely outside the relegation zone last season, but ended up 11th. We've missed chances, yes, and been a bit unlucky, yes. We don't have as many points as we should have, yes. But let's see where we are after 38 games. It's important to keep going irrespective of what happens in the next few games.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}