{"id": "\nJos Buttler to bat No 3 in second Sri Lanka Test with Ben Foakes retained as wicketkeeper\n", "paragraph": "Joe Root will step up the evolution of his England team against Sri Lanka when Ben Foakes is handed the chance to establish himself as the first-choice wicketkeeper and Jos Buttler is promoted to No 3 in the batting order.Root confirmed Foakes will keep wicket for the second Test in Kandy, leaving Jonny Bairstow contemplating a future as a specialist batsman after three years as England’s first choice behind the stumps.Root is poised to promote his vice-captain Buttler to No 3 replacing Moeen Ali, who will drop back down the order after two unconvincing innings in Galle.It frees Moeen to concentrate on bowling and playing his natural attacking game with the bat without the responsibility at No 3 to set the pace and tone of the innings.For Buttler it continues his extraordinary rise in the team since his recall in May. Buttler has never batted higher than six in Test cricket (apart from one appearance opening the batting in a fourth-innings run chase) but is a different player these days from the aggressive, innovative shotmaker who could only bat at one speed.When he was first recalled to the side by Ed Smith he was deemed a luxury player at seven given the licence to attack. But through his own performances he has shown he can also play long, patient innings when necessary with his maiden Test hundred against India in August a breakthrough moment. He combined with Foakes to help repair the loss of five wickets in the first session in Galle and would have appeared at three had England bowled first and Moeen got through a heavy workload with the ball.When asked if he saw Buttler as a viable No 3 Root was clear. “Absolutely. He’s got a fine game. He’s very adaptable. He can play a number of different styles and he can read the game very quickly and very well, which I think is a great asset to have at No 3.”England have a number of choices for three and contemplated moving Ben Stokes up the order. He is considered to have the best technique - apart from Root - but his forceful bowling in Galle was more effective in the second innings than expected and it would be a gamble to pile more work on his body.The pitch in Kandy is a “little bit drier” than Root expected despite the recent monsoon suggesting England will need three spinners so it is likely they will stick with the team that went 1-0 up last week with the only change a reworking of the batting order.It would mean no Stuart Broad for the second Test match running and with Alastair Cook retired, a new young keeper in Foakes and trusted deputy Buttler at three, Root is moulding the team his way.“We’ve come to Sri Lanka to win this tour. And in these conditions, I think Ben is the best option behind the stumps,” said Root. “Jonny is a fine keeper and what he’s done over the last couple of years has been exceptional. He’s pretty much been faultless, not really stood out at all which is probably a good thing for a wicketkeeper and long term I see him as a focal part of the Test team. It’s a great opportunity for Ben to show is ability and I think you’ve got to reward a performance like last week.”Bairstow returned to training on Monday but Root thinks he is still a week away from being “100 per cent” fit and watched on as the top six in Galle batted first in the nets.Until Bairstow injured his ankle ligaments in training in Kandy three weeks ago, Foakes had been planning to take the winter off but his debut hundred and wicketkeeping performance has changed everything. Even Buttler, the wicketkeeper in white-ball cricket who deputised for Bairstow in the Test side when he missed a game last summer, admitted Foakes’s performance has set a new benchmark.“I’ve been enjoying the role I’ve had in the Test match side since I’ve come back into it, playing as a batsman,” said Buttler. “I wasn’t expecting to keep wicket. I think it’s good reminder for myself that, looking at someone like Ben Foakes, who’s been the reserve wicketkeeper on the last winter tours, and is a fantastic gloveman, it’s a good reminder and a little wake-up call that he’s the level you need to get to. Just looking personally, he’s a great example to someone like myself as to where I need to get to.”If England win in Kandy it will bring a rare series victory in Asia. “It would be a huge achievement,” said Root.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}