{"id": "\nFarmers forced to fortify their land to defend against fly-tipping dumped by organised crime gangs\n", "paragraph": "Farmers are being forced to fortify their land with moats and anti-terror-style concrete blocks to combat organised crime gangs fly-tipping on an industrial scale.Guy Smith, deputy president of the National Farmers’ Union, said Britain’s countryside risked being turned into a “Mad Max” landscape as farmers had to deploy barbed wire on gates and fences, flood lights, CCTV and concrete-reinforced gates to combat criminals leaving lorry loads of waste.Defra figures last week revealed fly-tipping incidents where multiple loads of waste were dumped rose by 43 per cent in a year to more than 14,000.Two of the worst saw 100 tons of commercial waste dumped on a Shropshire farm and 18 lorry loads deposited in the dead of night on another in Essex which cost the farmers £38,000 to clear.The Environment Agency says waste is the new “narcotics” because of the profits crime gangs make from undercutting legitimate operators through illegal dumping and evading landfill taxes of up to £90 a ton.Waste criminals were this month targeted for the first time in the government’s Serious and Organised Crime Strategy.Mr Smith, a crop farmer, said: “It depresses me farmers are having to fortify their farms. They are digging ditches like defence moats, putting barbed wire around gateways and installing huge metal gates to combat this.“It doesn’t make the countryside look nice. We really should not be turning it into something from Mad Max.”He identified four types of fly-tippers: the casual litter lout throwing rubbish from cars, lazy householders leaving domestic waste often neatly sorted for recycling, dumper trucks with waste from gardens or new driveways and criminals with 25-ton lorries of commercial waste.The biggest illegal waste dump on his Clacton-on-Sea farm was six tons but farms around the M25 had been hit harder by criminals from the East End, said Mr Smith who has dug ditches to, blocked gates with straw bales and tightened security.Andrew Nicholls, a farmer in Bridgnorth, Shropshire, has installed floodlights and reinforced concrete gates after 100 tons of waste was dumped on his farm by at least three articulated lorries.It cost him £18,000 to clear, wiping out his subsidy as he was only able to claim £5,000 through his insurance: “It was devastating. If it happens again, it would finish us.”He said was alarmed by the criminality. In one recent incident gangsters caught in the act of dumping waste emerged from their lorries in balaclavas and with baseball bats.In another case, they had been caught cloning milk float number plates to try to outwit police if the numbers were spotted and reported during early morning raids.Tom Fisher, 80, whose son Harry runs their farm in Rainham, Essex, said the scale of fly-tipping was was worse than at any time in his 58 years as a farmer, forcing them to put anti-terror style concrete blocks at gateways overnight to stop waste gangs breaking into fields.“My son came home at 9pm, then at 6am the next morning there were 18 lorry loads of waste in a field after they cut the chains and took down a gate.\"It was very well organised, they stacked them beautifully in 18 loads. That cost us £38,000,” said Mr Fisher.His local Havering council has proposed road closures and CCTV because of the scale of fly-tipping.“In France, where we have a place near Dijon, you can walk round the village with a bag and find nothing to put in it. All the gates are wide open. It’s a different culture in Britain,” said Mr Fisher.Sam Corp, head of regulation at the Environmental Services Association, said their research showed waste crime cost at least £1bn a year in lost revenue and clean-up costs.It attracted organised gangs because of the “big returns and low risk of being caught.”“It’s very easy to enter the waste sector without going through too many regulatory hoops. You can become a licensed waste carrier for £150 with the Environment Agency’s logo to give legitimacy,” he said.“Then the rewards are very high with landfill tax running at £90 a tonne. People who pay for them to take away the waste assume you are paying the £90, but if you can undercut that, then profits can ramp up pretty quickly.“Unlike the illegal drug industry where the penalties are high if you get caught, that is not always the case for waste related offences. People don’t realise the extent to which criminals are involved.”Defra last week proposed fines for producers of illegally-dumped waste and electronic tracking of waste as a possible way to combat waste criminals.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}