{"id": "\nAdventurer becomes first man to swim around the British isles as he reveals singing got him through the challenge\n", "paragraph": "The first man to swim around the entire coast of the British Isles yesterday put his success down to a simple rule - if he could still sing, he could still swim.Adventurer Ross Edgley finally staggered onto dry land after spending 157 days at sea alongisde 400 swimmers from the Outdoor Swimming Society for the final approach.His 1,792-mile trip back into Margate in Kent, where he set off from on June 1st, saw him finally step foot on the shore when he emerged from the sea shortly before 9am yesterday morning. It was an impressive journey. During his 23 weeks, he swam the equivalent of 15 times around the M25 or the distance from London to Moscow. Burning an estimated 500,000 calories, the 33-year-old ate over 600 bananas and had to contend with jellyfish stings and a frozen wetsuit off the shores of Aberdeen. At times, he swam alongside dolphins and basking sharks.However, at the bleakest moments, it was one song in particular - and thoughts of his mum's cheesecake - that he would turn to. \"I can't sing, I'm an awful singer - but under the water, I sound amazing,\" he told the Telegraph yesterday.\"Sometimes I'd just end up singing to myself underwater and the very fact I was doing that proved that I was anaerobic and that was a good pace. \"I was just swimming and singing to myself and that was to show myself I was keeping a good pace and to keep myself entertained.\"That song was 'Escape (The Pina Colada Song)' by Rupert Holmes - which has found fame again with a modern audience after being featured in the 2014 film Guardians of the Galaxy.   \"If you're singing that when you're swimming across the Moray Firth it's quite hard to swim in a bad mood,\" he said. He added that peace of mind was crucial - and he had read the Stoics and 'lots of Shackleton'.   \"People would often say 'oh wow, you must be reading Marcus Auerlius's Meditations or stoic philosophy and I was reading a lot of those books but sometimes I would just think 'what's for dinner tonight?' or 'should I have BBQ sauce or tomato sauce?'\"Another question I got from people a lot was 'with this self-imposed solitary confinement, did you have any grand epiphanies?' Really the answer was: 'No, you just keep yourself entertained and do what you can to avoid thinking of jellyfish stings, sea ulcers or chafing'. \"It really could be as trivial as 'mum's homemade cheesecake - that's going to be brilliant', rather than Socrates and Marcus Aurelius.\"Mr Edgeley spent anything up to 10 hours at a time in the water, depending on tide patterns, and often had to complete night swims to keep up to schedule. He was accompanied by a support boat on which he would sleep and eat - starting the day with a breakfast of two pizzas and consuming anything up 15,000 calories a day. He entered the Guinness Book of World Records on August 14, 74 days into the challenge, for the longest staged sea swim, according to the World Open Water Swimming Association.A fitness expert and waterpolo player for Great Britain - who holds a degree from the School of Sport and Exercise at Loughborough University - Mr Edgley has previously attempted to swim 40km from Martinique to St Lucia dragging a 100lb log behind him and in 2016 completed a marathon while pulling a car.Mr Edgely comes from an athletic family. His father is a tennis coach and his mother a sprinter. One of his grandfathers was a marathon runner while the other was in the military. Now he is back on dry land, he is unsure what his next challenge will be - however he has said he will likely embark on another aquatic adventure as he is swimfit. He also has a more pressing concern. Having grown his beard long to protect against jellyfish stings, his facial hair has now become a bone of contention between him and his girlfriend. \"I want to keep it, but the girlfriend is starting a campaign to shave me - she's now threatening to shave me when I sleep!\"© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}