{"id": "\nGranit Xhaka’s transformation under Unai Emery a game-changer for improving Arsenal\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nIt was a measure of how much Arsenal have changed in just a few months under Unai Emery that the head coach’s reaction to a sliding tackle was almost as wild as when Alexandre Lacazette scored their late equaliser in the 1-1 draw with Liverpool.The suspicion is that it was not just the nature of the crunching challenge, on an accelerating Mohamed Salah, that so invigorated a fist-pumping Emery, but also the identity of the tackler. There was Granit Xhaka, hurtling out of nowhere to whip the ball away from Salah at the last possible moment.Well, it looked like Xhaka, and that was the name on the back of the shirt. But by almost every other measure this was a totally different player to the midfielder who so regularly disappointed in the biggest games under Arsène Wenger.Liberated by the phenomenal Lucas Torreira alongside him, Xhaka was as dynamic and destructive as he has been in an Arsenal shirt. He made more passes than anyone else on the pitch, more recoveries than anyone else on the pitch and more tackles than anyone else on the pitch. It was a performance of spirit and intensity, both individually from Xhaka and collectively from the team, and it was a clear demonstration of how Emery has injected a new purpose into this club.“I enjoy the small details,” Emery said when asked about his reaction to the Xhaka challenge. “Individual actions, defensively and offensively.”Emery does not just enjoy those “details”, of course. He obsesses over them. In training, he will physically move players into the correct position, focusing their bodies and minds on the intricate demands of their roles in his system. “Each game we know what we do,” said Xhaka. “We know well the opposition, where they are good and where they are not. He [Emery] is important. He helps us, not only me but all the players, with the small things. The tactical things. You can see that on the pitch.”Xhaka is the most obvious beneficiary of this more hands-on approach and proved it against a Liverpool side who had grown used to having it their own way against Arsenal. “A lot of small things have changed,” said Xhaka, who was instrumental in Arsenal’s stirring recovery from James Milner’s opening goal. “We have great character. We knew we would not lose this game because we were so good and showed that character again.”Emery admitted that the efforts of his players had left them exhausted at the final whistle, but that is what he wants from games like these. He would also like the crowd as whipped up as they were on Saturday, inspired by the unusual amount of grit on display. “I think we are getting the balance in intensity,” Emery said. “[Against Liverpool] we need to push a lot and I think when the supporters are enjoying with the players, I think also the players give their all in their performance and their desire.”The impact of Torreira cannot be overstated. The Uruguayan already looks a steal at £25 million, not just for his own actions but for what he brings to the others around him. “Every game is better and better,” Xhaka said. “He [Torreira] is so important. He knows when to go and when to stay. He brings good balance between offence and defence.”Emery agrees. “It’s very important for our balance that we have two midfielders like Xhaka and Torreira, because the balance in midfield is also important for the balance in defence and our balance offensively,” the head coach said.Having lost to Manchester City and Chelsea, this was a result that proved Arsenal are capable of going toe to toe – and, indeed, elbow to elbow – with the finest teams in the league. This was where they so often fell short under Wenger, and it is in these matches that their hopes of finishing in the top four will be truly tested. “If you see this game, you can see we are ready for the top four,” Xhaka said.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}