{"id": "\nMicrosoft profits jump despite cloud growth slowdown\n", "paragraph": "Microsoft's profits have risen by more than a third despite growth in its crucial cloud computing business slowing down.The software company, which has been reinvigorated under its chief executive Satya Nadella in recent years, posted a profit of $8.8bn (£6.8bn) for the three months to the end of September. This was up 34pc on the previous year.The company's shares rose in after-hours trading, having tumbled by 5.4pc on Wednesday, amid a wider Wall Street sell-off.Traders had feared the Seattle giant would unveil a disappointing set of financial results but the company beat expectations, saying revenue had climbed by 19pc to $29.1bn.Growth was led by demand for its Office software suite, which includes Word, Excel and Outlook, and Azure, its cloud service.Microsoft has a strong second place behind Amazon in cloud computing, which rents out its data processing and internet hosting services to other companies.The division has been a priority under Mr Nadella, who took charge in 2014 and has shifted attention away from the Windows operating system that had been Microsoft’s signature product for decades.Azure revenues grew by 76pc year-on-year, making it the company’s fastest-growing area. However, this was slower than in previous quarters. Three months earlier, growth had been 89pc, and it had been 93pc in the previous quarter.Microsoft said businesses such as its Xbox gaming unit, its Surface computer hardware and its search engine Bing also grew strongly.LinkedIn, the professional social network that it paid $26bn for two years ago, grew revenues by 33pc.Shares rose by 2.7pc in closed market trading.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}