{"id": "\nFrank Lampard will not celebrate if Derby upset Chelsea at his Stamford Bridge 'home'\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nFrank Lampard swerved questions of returning to manage Chelsea one day but still calls Stamford Bridge “home” and such is his respect for them, he wants to become the first coach not to celebrate a victory.The 40-year-old returns to his beloved Bridge for the first time in the visiting dugout in the Carabao Cup tomorrow night with new club Derby County. Discussed as a future ­Chelsea manager, Lampard ­believes the prospect should not be entertained until he has achieved the success to merit it.“No, because I am pragmatic about those things,” he said when asked if he dreams of managing the club one day. “In football your next game is all-important. I don’t see anything beyond playing Chelsea, and then I will concentrate on ­Birmingham at the weekend.“So to dream is one thing, but in reality, what happens next will rely on what I do here. Hopefully I can bring success to this club.”Lampard is still held in huge ­affection by the club’s supporters after playing such an influential role in them winning 13 trophies in as many years until he left in 2014, just before his 36th birthday, after 211 goals in 648 games.As a result, should Derby follow up their shock victory at Jose Mourinho’s Manchester United in the last round, he will refrain from celebrating – just as he did after scoring for Manchester City against Chelsea in September 2014.“It will be easy [to show restraint] because I respect the club,” he said. “When I scored against them, I didn’t celebrate. I wouldn’t have done in a million years. Although I was doing my job, I love Chelsea and had a strong bond with the fans that will hopefully never go.“As a manager, I will be respectful because I have to appreciate what the club did for me. I will feel proud and honoured going back to a place I called home for 13 years and still feels like home.“This is my working home now and I have got a great affiliation with this club already, but I can’t forget 13 years of my career. So it will be a very special night.” They still chant Lampard’s name at the Bridge. “To get that support when you’re working for an opposing team will feel nice.”But he is determined to forge a managerial career to match his playing one. And one of the things he has taken from his time at Chelsea is the desire for his players to truly identify with the club.“I was part of a very good era at Chelsea. They sing about Dennis Wise, John Terry and Didier Drogba and rightly so,” he said. “One thing we did do, and it’s something we’re trying to do here, is we really ‘felt’ the club. It’s important you recognise history, and the recent history at Chelsea has been strong.”Another example of the “Lampard way” is video analysis of players in training, which led Derby midfielder Tom Huddlestone to say players are “dug out” if they perform below the expected standards. “I wish I’d had people showing me back more things because individual analysis didn’t happen for big parts of my career,” said Lampard.“You have to be not fragile and think ‘maybe I could have improved in that situation’.“It’s not about ‘digging someone out’, it’s about looking for improvement, and we will keep doing it.“For example, after West Brom, I didn’t show the four goals we scored, I showed them how much we won the ball back, because everyone, collectively, sprinted everywhere.“I get more enjoyment out of that than for Harry Wilson’s free-kick against Manchester United.”At the moment, Lampard has another challenge – sleepless nights, caused by baby daughter Patricia and by wrestling with tactics and formations.“One night last week in the middle of the night I was on bottle duty, making up the bottles for [wife] Christine then to feed her,” he recalled. “I was doing that, and considering formations and players. My wife is having some sleepless nights, too, but we’re certainly enjoying it.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}