{"id": "\nTheresa May will lead the Conservative Party into the next election, predicts former Daily Mail editor\n", "paragraph": "Paul Dacre, the former editor of The Daily Mail, has predicted that Theresa May will lead the Conservative Party into the next election as part of an excoriating attack on “the metropolitan echo chamber”.Mr Dacre said that a false consensus in Westminster had decided that “Brexit is doomed and that the terminally incompetent Theresa May is toast”.He added: “She is, of course, still here and will, I predict, take the Tories into the next election.”“The problem with the echo chamber is that its inhabitants increasingly haven’t a clue what real people in Britain, outside the M25, are thinking.”Mr Dacre, who stepped down as editor of Britain’s biggest mid-market newspaper in August after 26 years, was speaking in Manchester at the Society of Editors conference. His successor, Geordie Greig, has taken a softer line on Brexit, urging Conservative MPs to back Mrs May’s Chequers proposals.Mr Dacre defended his coverage of Brexit, including a front-page attack on High Court judges in 2016 that branded the “enemies of the people” for a ruling that the Government would need parliamentary approval to trigger Article 50.He said: “The Mail should have the freedom to write a headline about judges being the enemy of the people.“The title of an Ibsen play, it was meant to be a distillation of the views of Brexit MPs angry that the High Court was becoming involved in the political process. In retrospect, The Telegraph’s banner ‘the judges versus the people’ was, to coin a phrase, a tad more judicious. But what the hell. The point needed to be made.“And I just hope that their Lordships’ bruised feelings are soothed by the £60,000 pay rise they are in line to collect.”He highlighted the injunction recent granted to Sir Philip Green against The Telegraph as an example of the rich and powerful \"still being aided and abetted by a judiciary that, sadly, doesn’t seem to understand the pure silliness of granting gagging injunctions in a digital age”.Mr Dacre, 69, also predicted that the BBC will diminish in power as US streaming providers undermine the licence fee, and that one day Britain will host a “right-of-centre TV network”. He backed calls for Silicon Valley giants Google and Facebook to be regulated and said that the \"ultimate solution - as with the oil barons in the last century - is to break them up”.“Their monopolistic power is too great and that fundamental human characteristic - the need for privacy against the the industrial-scale theft of our data - will reassert itself,” Mr Dacre said.Newspapers will have a longer future than many predict, he added, and ‘authentic, regulated, curated journalism, both online and print” will prevail over material served up by algorithms.Mr Dacre, who was awarded the Society of Editors’ first lifetime achievement award, also renewed a long-running feud with Alan Rusbridger, the former editor of The Guardian.He attacked what he said was “cloying self-glorification” and “moral superiority” in Mr Rusbridger’s recent book on journalism, and accused his rival of a “somewhat chilling lack of self-awareness”. Mr Dacre criticised the “madness” of Mr Rusbridger’s expansion into America with “no plausible business of journalistic model” and praised efforts by his successor Katharine Viner to bring spending under control. He concluded: “So there. I’ve stuck my neck out and indeed, with The Guardian, put it on the block. Well, frankly, my dears, I don’t give a damn.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}