{"id": "\nDele Alli has high hopes for England: 'Our aim is to be recognised as the No 1 team in the world'\n", "paragraph": "Even if England beat Croatia at Wembley on Sunday and reach next year’s Nations League finals, it will not be enough for Dele Alli.The Tottenham midfielder is aiming far higher and has given a revealing insight into the new mentality around the England camp under Gareth Southgate.“Our aim is to be recognised as the No 1 team in the world. It is going to be a difficult challenge, but we believe in ourselves, and we believe in the talent and the manager we’ve got here,” he says. “I don’t think we really want to put a time limit on it, but as a national team, that is our end goal.“We genuinely believe we can achieve it, and I think that’s the main thing. We had a good World Cup, reaching the semi-finals, but didn’t win it. There were a lot of positives to take, and we knew it was a massive step for us as a nation as well. But there’s a lot to improve on, and we know it.”This refreshing, mature approach epitomises the new England under Southgate, and the feel-good factor generated from the World Cup has carried over into this season for Alli.He has endured a frustrating campaign at club level, picking up a few irritating injuries, but recently signed a new five-year deal and proved against the United States that he remains a key player at international level.It is easy to forget that he is only 22 and has already experienced many highs and lows since making his debut under Roy Hodgson in October 2015.That infamous, nightmarish defeat against Iceland at Euro 2016 remains vivid in the mind, with Southgate sitting his squad down to watch it unfold before flying out for the World Cup. Many of those players involved were probably hiding behind the sofa.“It was the first time I’d seen it because I had just wanted to pretend I wasn’t even there,” says Alli.“For some of us, it was our first tournament for England. You have such high hopes, you go there with all that self-belief – and then something like that happens which you don’t expect. You just want the floor to open and eat you up. You just want to hide forever.“It was difficult [watching it] and everyone was very quiet when it was on – nobody was talking. But it definitely improved us, and I think it helped everyone. “We don’t really talk about it, but we don’t look back on it with such anger now.”Is Alli confident England would now be better equipped to deal with an Iceland situation? “I’d definitely say so,” he insists. “The big thing about that game was the mental side. When they took the lead, we all sort of froze. It was almost as if we didn’t have another plan. We didn’t expect it. It was like, ‘What do we do now?’, and nobody had an answer. So, we’ve done a lot of work [on mentality]. I’d say now that the work we’ve been doing has been preparing for situations like that, so that we don’t panic.”England’s resolve will undoubtedly be tested on Sunday against Croatia, in another revenge mission against the team which ended their World Cup dream.A second victory in four days would take England to next June’s finals and guarantee a place at Euro 2020.The last visit of Croatia to Wembley ended in misery and defeat, a night defined by torrential rain and Steve McClaren’s brolly, but there is a confidence in this emerging England squad that makes you believe anything is possible.Alli believes new boy Jadon Sancho, the Borussia Dortmund winger, is further proof of the young talent Southgate has at his disposal.“He has got a big future ahead of him,” says Alli. “He’s a real talent, and I think it’s all down to him. He’s got to keep his head and keep working hard. From what I’ve seen of him so far, he seems to be doing that. I’ve seen his clips in the Bundesliga, and working with him here, you can see his talent. It’s exciting for England.”Indeed, Sancho’s raw ability and street-footballer reputation probably reminds Alli of his teenage years in Milton Keynes before his big move to Tottenham three years ago. Those formative days are never far from his thoughts.“I’m not allowed to go and play in the park any more, but I still have a kickabout with my mates every now and then, more in the off-season. I don’t want to get injured playing there,” he says with a smile.“I don’t really get to go back too much because of the fixtures we have. I don’t want to be driving too far, but I’ve definitely got the same spirit.“I feel like I haven’t changed. I want to stay true to who I am. Milton Keynes is a big part of that.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}