{"id": "\nBrendan Rodgers removes the fear factor from Celtic ahead of Europa League meeting with RB Leipzig\n", "paragraph": "Brendan Rodgers has urged Celtic not to be frightened to make mistakes against RB Leipzig on Thursday night.The manager will have to dig into his squad for the Europa League Group B game in the Red Bull Arena after midfielder Tom Rogic joined the list of absentees which include the suspended James Forrest, injured captain Scott Brown and striker Leigh Griffiths, while defender Filip Benkovic is a doubt.Rodgers, whose side have three points from their first two fixtures, challenged those fringe players who will come in to make their mark, and in the first of a double-header against the German side he is looking for a better performance after their 3-1 defeat by Salzburg in their last European outing.Speaking at RB Leipzig’s stadium, the Northern Irishman said: “We have a few injuries. Scott will probably be out for two to three weeks, which of course is disappointing. It’s a low-grade calf strain.“We have a few other players. Leigh hasn’t returned to training and Tom Rogic hasn’t travelled – he has an issue with his knee. We’re managing Filip Benkovic so we’ll see how he is over the next 24 hours.“We have one or two issues but it’s OK, we have a number of young players who have been training very hard and working hard to have the opportunity to play. So we look forward to seeing them.“Naturally, over the couple of games it’s important to get results. After the last time in Salzburg – OK we lost, but I want to see a better performance.“It’s key coming into these games that we think about performing well. When we play to that quality and players play with confidence then we have a much greater chance of getting a result.“It’s about going and performing and taking that confidence of going to play and not being frightened to make mistakes.“We’re playing against one of the top teams in Germany, but we still have to show our way of playing and when we do that we know we can cause problems. That’s what we’re looking to do, perform well and then look at getting a result from that.”Rodgers believes that irrespective of the result against RB Leipzig, his side, who have scored 10 goals in their past two Premiership matches, will still go into Sunday’s Betfred Cup semi-final against Hearts at Murrayfield with optimism.He said: “No matter the result tomorrow we’ll go into the game at the weekend with confidence and looking to reach another final.“We’ve had tough midweek games in Europe over the last couple of years and no matter the result we’ve come out of that and played well.“It’s unfortunate, the fluency and efficiency in the team is getting back to the level we want it to be at.“I think we can still gain in the performance tomorrow. This is what these players have been waiting for, the opportunity to play and really experience what it’s like to be a Celtic player.”Rodgers admitted Marvin Compper, signed from RB Leipzig at the start of the year, is likely to remain on the fringes at the Parkhead club.The 33-year-old defender has played only once for Celtic – in a Scottish Cup tie against Morton in March – and is not even in the European squad.The former Liverpool manager said: “Unfortunately, he had been injured for a lot of the six months of first arriving.“In the summer I said to him that his game-time was very limited and if he wanted to play regular football in his remaining years he would probably have to move. He decided to stay and I respect that decision.“I was open and clear with him that in that time a lot of players had come in and have jumped ahead of him in the queue at centre-half, so his game-time has been and probably will be very limited.” © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}