{"id": "\nCrushed wreckage of Argentine submarine located one year after vanishing\n", "paragraph": "The crushed wreckage of an Argentine submarine has been located a year after it vanished into the depths of the Atlantic Ocean with 44 crew members, in the country's worst naval disaster in decades.The Seabed Constructor, a ship owned by US search firm Ocean Infinity, made the discovery Friday, one day after the first anniversary of the disappearance of the San Juan.The ship had set out in September on the latest attempt to find the San Juan, whose disappearance cost the navy's top officer his job.There has been \"positive identification of the ARA San Juan,\" at a depth of 800 meters (2,600 feet), the navy said on Twitter, confirming the vessel had imploded.The navy lost contact with the submarine on November 15, 2017, about 450 kilometers (280 miles) from the Argentine coast while it was traveling northward from the country's southern tip.Admiral Jose Villan, the navy's new head, said that the rough terrain on the ocean floor made it difficult for search vessels, which had already trawled the site, to find the sub.Pieces of the submarine that were 11, 13 and 30 meters long were spotted in \"an irregular, moon-like zone with craters and canyons\" naval Captain Enrique Balbi said at a conference, adding that the hull had been \"crushed inwards.\"\"I still had hopes that they could be alive,\" Luis Niz, the father of a missing sailor, told reporters, even though President Mauricio Macri's government had already declared there were no survivors.\"We are with the other relatives. They are going to show us the photos. They say that our youngsters are inside,\" said Yolanda Mendiola, the mother of crewman Leandro Cisneros, 28. \"We are all destroyed here.\"Relatives are now asking for authorities to extract the submarine, though whether such an operation will be undertaken remains unclear.\"Raising the submarine to the surface is not impossible, but it is a very complex operation, and therefore very expensive,\" a naval officer told AFP, requesting anonymity.The discovery came the day after a somber ceremony, which Macri attended, at the San Juan's Mar del Plata base on the first anniversary of its disappearance.It also came just before the Seabed Constructor was to leave for maintenance in South Africa. Before setting off, the searchers decided to check an area which bad weather had previously prevented them from examining. © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}