{"id": "\nBallymurphy Massacre: deaths were 'illegitimate use of force by British Army,' court hears \n", "paragraph": "The deaths of 10 people during three days of shootings in west Belfast were the result of \"illegitimate, unjustified and indiscriminate use of force by the (British) Army\", a court has heard.Nine men and a woman were killed in the shootings, that came to be known as the \"Ballymurphy Massacre,\" over three days in August 1971.The killings happened during a British Army operation known as Operation Demetrius, in which paramilitary suspects were detained without trial.In 2011, Northern Ireland's Attorney General John Larkin directed that new inquests be heard after a long campaign by family members who claimed the original probes were inadequate.Soldiers have long been held responsible for killing all ten people but the accepted narrative became clouded earlier this year when former members of the paramilitary Ulster Volunteer Force came forward to claim their organisation was also involved.As inquests opened in Belfast on Monday, Sean Doran QC, counsel for the Coroner's Service, said each individual incident and death will require \"careful scrutiny\".In what he described as a \"very broad observation\" on the core issues, he said: \"The narrative of the military is legitimate use of force was used at a time of heightened tension and response to specific threats.\"He said this was contrary to the belief of Ballymurphy families that the deaths were the result of \"illegitimate, unjustified and indiscriminate use of force by the Army on civilians\".Mr Doran said the original investigations into the deaths were \"very limited\", revealing that there were multiple failures to get witness accounts and missed forensic opportunities.He said that examination of scenes would not necessarily have been routine given the \"legitimate security concerns at the time\".\"It's important not to lose sight that these were turbulent times,\" he added.At the time of the deaths, officials from the Royal Military Police interviewed soldiers after mass shootings.Referring to the original inquest, Mr Doran said it did not carry out a rigorous examination of military statements.\"The open verdict did not allow for any finding as to whether use of force was justified,\" he added. \"This inquest will not be so limited in nature or in scope.\"The inquests are expected to run until March.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}