{"id": "\nWorkers 'should be forced to have pay docked to pay for care in old age' \n", "paragraph": "Workers should be forced to have their pay docked, and equity from pensioners’ homes taken to cover the cost of care in later life, the former head of the country's health watchdog has said.Sir David Behan, who recently stood down from the Care Quality Commission (CQC), urged ministers to be brave in their forthcoming green paper on social care.The issue almost cost Theresa May the last election, with proposals to tackle the issue dropped after being dubbed a \"dementia tax\".  In an interview with The  Telegraph, Sir David pressed ministers to introduce measures to use  the “wealth” of baby boomers - whether in the form of their homes, savings or pensions, to pay towards their care.And he said such changes should be accompanied by a compulsory system of social insurance for those of working age, in order to build up funds for the future.Such charges would be taken from pay packets on top of national insurance, contributing to a national care fund to pay towards care in old age.A proposal for mandatory insurance in understood to be one of six options currently under consideration for the Government's social care green paper, which is due to be published next month.Failure to introduce such measures  would result in “a long steady decline” of the care system, with growing numbers denied any help, the former watchdog chief said.“Government in my view has not been brave enough in making the decision to reform the system,” he said, urging ministers to look to other countries which have taken such steps.“If you look at Japan and Germany they’ve reformed their system,” he said. “Other Governments are responding to this issue.”Over the last two decades, both countries have introduced mandatory insurance for workers.Sir David urged ministers to introduce similar measures, warning that voluntary schemes were unlikely to work.The Health Secretary recently floated the idea of an “auto-enrolment” scheme for care, with pay docked to fund future care unless a person opts out. Other ideas under consideration include a  “care Isa” where unspent funds would be exempt from inheritance tax.But Sir David suggested that optional schemes might leave too many people deciding to “take their chances” in the hope they never needed care.“The most effective way to plan for this is by having a big risk pool.  If you make a political choice that its voluntary then the size of your risk pool is lower,” he said. “In my personal view, there should be compulsory insurance.”Sir David 63, left CQC in July after 40 years working in social services and health, and has just taken up a role as a non-executive director for HC-One, Britain’s largest care home operator.In the first interview since he stepped down, the former official said attempts to provide care for a rapidly ageing population should also make more use of the “wealth” tied up in pensioners’ homes, instead of expecting them to be passed on to future generations.  “I think the older generation need to be able to make a contribution towards their care costs. You have to have things like equity release,” he said.  “Those of us that have wealth, whether that is through pension or equity should make a contribution to the cost of care,” Sir David said, urging politicians and the public to be “more open-minded”.Funding needed to come from current workers, and those past retirement age, in the interests of “intergenerational fairness” he said.Measures to dock workers’ pay should allow the younger generation some time to “accumulate their assets and get on the housing ladder” the former official said, highlighting the system in in Japan, where premiums begin to be taken from the age of 40.Without radical action and substantial funding, the situation facing Britain’s elderly could become intolerable, he suggested, with think tanks suggesting that more than £4bn a year extra is required.“Over the next 20 years the number of people aged over 85 is set to double. Quite frankly, the supply of care is not keeping pace with demand,” he said, with research suggesting that one in seven pensioners who need help to wash, dress or get out of bed do not receive it.“We risk a long steady decline,” he warned. “The demand for care is going to increase, you will have more people not getting the support they require, more pressure on the NHS, more families under pressure; this is not a tolerable system for a civilized society.”Sir David said warring between the major parties meant serious proposals were too often “dismissed out of hand” - describing attacks on Theresa May’s dementia tax as “retaliation” for previous Tory criticism of Labour’s social care plans.And he raised fears that ministers would end up fudging decisions, if they were not prepared to show leadership.“In 1948, with the creation of the NHS, Bevan did that in the face of opposition from both consultants and GPs. It was controversial, and it was a brave decision by the government of the day.“We need a similarly brave decision to reform the system of social care today; if we keep waiting for a consensus, we will not see the changes we need,” he said.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}