{"id": "\nDemocrat concedes Florida governor's race to ally of Donald Trump\n", "paragraph": "Andrew Gillum, the Democrat who was running to become Florida's first black governor, conceded the race on Saturday to Ron DeSantis, a close ally of President Donald Trump, saying he was satisfied with a recount that showed him trailing by more than 30,000 votes.The race was one of the most closely watched in the country. The candidates come from the far poles of each party and their performances were scrutinised for hints they might offer for the 2020 presidential election.Mr Gillum, the liberal mayor of Tallahassee, had initially conceded the race to Mr DeSantis, a conservative former congressman. But he later withdrew that concession when the results were close enough for an automatic recount. On Saturday, he said that process was drawing to a close.\"This has been the journey of our lives. We've been so honored by the support that we've received,\" Mr Gillum said in a video statement. \"Stay tuned, there will be more to come. This fight for Florida continues.\"Mr DeSantis responded on Twitter, saying: “This was a hard-fought campaign. Now it’s time to bring Florida together.”After Mr Gillum initially conceded the contest on election night, his subsequent calls for every vote to be counted echoed similar appeals from fellow Democrat US Senator Bill Nelson.A recount is continuing in the race between Mr Nelson and his challenger for the Senate seat, outgoing Republican Governor Rick Scott.That recount has become the subject of an intense political battle with Republicans including Mr Trump claiming without evidence that the process was marred by fraud.Both parties and their supporters filed multiple lawsuits challenging the process, with Republicans urging a strict standard on which votes were counted while Democrats contested rules that they saw as disenfranchising voters.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}