{"id": "\nIranians chant 'death to America' on eve of biting sanctions \n", "paragraph": "Thousands of Iranians chanted \"death to America\" at a rally in Tehran on Sunday as the country's leaders remained defiant in the last hours before fresh US sanctions came into force.Students at the government-organised march in the capital burned pictures of Donald Trump, the US President, and the US flag to mark the seizure of the US Embassy during the 1979 Islamic Revolution.Anti-US rhetoric from the Iranian government is familiar from the Iranian government, but relations between the two countries are at a particular low over the Trump administration's hard line on Tehran's nuclear and military ambitions.After unilaterally pulling out of the deal intended to curb Iran's nuclear capabilities earlier this year, the White House said it would reapply sanctions on the country’s energy, financial and shipping sectors.Iranian leaders have remained defiant over the move, and have appeared confident in their ability to absorb the impact of a reduction in oil sales. After initially promising to drive the country to zero exports of oil, the US has offered a waiver to eight buyers of Iranian crude, a move that Secretary of State Mike Pompeo defended on Sunday. Ayatollah Ali Khamenei took to Twitter on Saturday to say US President Donald Trump has “disgraced the remnant of America’s prestige and that of liberal democracy.”Qassem Soleimani, the head of the Iranian Revolutionary Guard, used Instagram to respond to Mr Trump's Game of Thrones inspired meme with his own, reading: “I will stand against you.”The post had been removed by Sunday morning.The rhetoric was in stark contrast to concerns voiced by Iranians, fearful over the impact of further sanctions on an already pressured economy.\"All the prices are going higher every day ... I cannot imagine what will happen after 13 Aban (Nov. 4). I am scared. I am worried. I am desperate,\" elementary school teacher Pejman Sarafnejad, 43, a father of three in Tehran told Reuters. \"I cannot even buy rice to feed my children or pay my rent.\"Of Iran’s 81 million citizens, it will likely be the poor and middle class whose lives are made most uncomfortable.Young Iranians face a markedly different future to the one they had hoped for when sanctions were rolled back as part of the 2015 nuclear deal.\"I'm worried about the future,\" said Erfan Yusufi, the 30-year-old owner of a Tehran coffee shop that is struggling to stay afloat amidst rising prices and falling incomes.\"Our generation starts each day not knowing what will become of us.\"© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}