{"id": "\nFiona Mozley wins the 2018 Polari prize for debut LGBT writing\n", "paragraph": "Fiona Mozley has been awarded the Polari First Book Prize for her debut novel, Elmet.Now in its eighth year, the prize is awarded annually to a writer whose first book explores the LGBT experience, in poetry, prose, fiction or non-fiction.Mozley's win was announced at a ceremony at London's Southbank Centre as part of the London Literature Festival after submission for the prize quadrupled, including a significant increase in entries from major publishers.Elmet, which is a study of family as well as a meditation on landscape in South Yorkshire, beat titles including Trans Mission by Alex Bertie, Mussolini's Island by Sarah Day, Pansy Boy by Paul Harfleet, Carnivore by Jonathan Lyon, and Little Gold by Allie Rogers.The novel was shortlisted for the Man Booker Prize in 2017, which was won by Lincoln In The Bardo by George Saunders.Paul Burston, chairman of the judging panel, said: \"Strange, extraordinary and unique, Fiona Mozley's story has a lyrical, ethereal quality and the feel of an old folk tale.\"Sometimes brutal but often beautiful, the novel expertly weaves together themes of ownership, greed and masculinity, pitching the gentle narrator Daniel against the brutality of his father.\"It's a remarkable achievement and the judges were united in their admiration for it.\"First launched in 2011, previous winners of the prize include Paul McVeigh, Kirsty Logan, Diriye Osman, James Maker, Mari Hannah, Saleem Haddad and John McCullough.The Polari First Book Prize accepted books published in English in the 12 months to February 1 2018 and penned by a writer born or resident in the UK and Ireland.Mr Burston also announced an extended Polari Prize Tour starting in November and running until October next year.The 20-date tour, funded by Arts Council England, will showcase the best emerging and established LGBT+ authors, poets and spoken word performers.New locations for 2019 include Belfast, Milton Keynes, Manchester, Welwyn Garden City, Morecambe and Majorca, as well as previous destinations Birmingham, Bradford, Brighton, Edinburgh, Hastings, Huddersfield, Newcastle and London, with a centrepiece event at gay club Heaven. © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}