{"id": "\nFormer Spurs Ladies star Eartha Pond on helping Grenfell survivors: 'I live in the area, know people from the tower'\n", "paragraph": "Eartha Pond was 11 years old when she was scouted for Arsenal, practicing with a school friend at the Harrow Youth Club in the shadow of a tower block. 23 years later, on June 14, 2017, two weeks after Pond had won promotion to the Women’s Super League with Tottenham, flames leapt at the same tower. The conflagration at Grenfell killed, official figures say, 72 people. The friend who had played alongside Pond two decades earlier was that night frantically trying to contact her uncle and sister, both residents in the tower. Only one survived.The following day, as Grenfell’s blackened husk smouldered against the sky, Pond opened a Crowdfunding page, raising over £85,000. “I didn’t actually think there were people who’d stayed in the tower, because it was such a blaze,” she recalls. “I thought people had got out and would need stuff. As it unfolded that people were in there... it was just heartbreaking. I live in the area so I see and know people from the tower. I’m still connected.”Pond grew up in Queen’s Park, “literally opposite the borough of Kensington and Chelsea. On the right-hand side of the road is Westminster, and then adjacent is Brent. Our communities intertwine.” In the days after the fire, she combined her role as Spurs’ centre-half with her duties as the vice-chair of Queens Park Community Council. “I’m trying to plug gaps where I can,” she says, “waiting for their guidance on what people need, rather than assuming.”She mobilised the local sports centre. “We put some flyers together: if you need a shower, to drop your kids off, we’re open around the clock. Then I headed straight down to Grenfell. I was sorting boxes, sorting clothes. I’d emptied out my house, was going to the supermarket. Everyone was pulling together. The different boroughs were all down at Grenfell, saying, ‘This is what’s needed - put this there’. Whilst all this madness was going on, I think people were waiting for an authority body to come down and say, ‘This is what we need to do’. And that just never came.”The myriad failings surrounding the fire are now being analysed as part of the Grenfell public inquiry. Last month, the survivors began to give their testimonies. It has been traumatic in the extreme for a community still learning to grieve. Three days after Pond and I speak, a video of a burning effigy of Grenfell goes viral.For many, the healing process has barely begun. “We’re just on autopilot, still, over a year on,” Pond explains. “I don’t think people are going to deal with it until maybe three, four, even 10 years down the line. It depends on the individual and what triggers the start of that process. It could be fireworks. It could be a loud noise, a scream, a shout they hear later on in life. As a government and a community, we’ve got to make sure we’re prepared for that. I’m not too sure we are.”The PM has responded to calls for a more diverse panel of experts to contribute to the enquiry, in the hope survivors will trust the review. “[But] I don’t think they do, to be honest,” says Pond. “The venue, for instance, is not suitable. You’re looking at traumatised people being put in a room that’s not big enough to facilitate all the people that have lost loved ones or survived the fire. They want to be able to go through this process as comfortably as possible. Those small steps go a long, long way to rebuilding community trust.”Pond considers the combustible cladding that encased Grenfell, and, 17 months on, still coats scores of buildings across the country. “It’s just knowing: is that something the government care about? Is it something significant enough for them to make changes? This is where there are maybe barriers regarding where you live, or your upbringing, or who shouts loudest. Those are the people who are heard. [But] no matter what class you’re from, or creed, or religion, or political background, wrong is wrong. Just being heard is crucial.“Until they [the elite] are affected, I don’t think we really see change. But it’s a humanitarian issue. How do we get people who have an impact on policy to listen? Until we have people around those tables, having those conversations, I don’t think there will be much change.”She is worried, too, about the potential medical consequences. “People across the UK flooded Grenfell to help after the fire and took in the smoke. Have they been tracking the toxins, the illnesses in the community? These are things that people have been saying since week one. You’d think, for such a major, major event, someone would be leading on the welfare of the community.“The survivors are making some really poignant points about how they feel and what they see. There were small hazards that could have impacted what happened at Grenfell that weren’t listened to. They built up like a dripping effect, then they’ve had that fire.”Pond does not even pause as she delivers her final verdict. “These are the sort of things where the community says, ‘How can you not have someone tracking this? Are we not important?’”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}