{"id": "\nUS driverless cars unsafe as they can’t spot iconic British vehicles like the Routemaster bus and Hackney cab, experts warn\n", "paragraph": "US driverless cars pose a safety risk on the UK's streets as they can't spot iconic British vehicles, such as London’s red buses and black cabs, as their artificial intelligence has not been taught to notice them on the roads, experts claim.Engineers have noticed that the autonomous cars made in Silicon Valley are currently using cameras and software that have only been trained on pictures and videos of US vehicles, meaning they won’t detect unique vehicles with more district styles, such as the Routemaster bus and Hackney taxi. This has led UK scientists and politicians to raise questions over companies like Google and Uber, who have been developing their own autonomous technology, being able to test driverless cars in Britain. Michael Pound, a professor of AI and neural networks at The University of Nottingham, said: “This is a definite safety concern, in another setting a failure of AI not noticing unseen data might hardly be life threatening, but what about when the network is controlling a 3 tonne vehicle travelling at 60mph?”MPs have said it is the “Silicon Valley approach” of its products having little regard for the culture and customs of other countries, and only catering for the US.Julian Knight MP, who sits on the Commons’ Digital, Culture, Media and Sport select committee, said: “This is an example here of how these new social media companies and big tech companies are so US focused. It means the rest of the world, which makes up 97 per cent of the population, are not tailored to and ignored.“It is similar to their attitude on fake news, they only seemed to care whether the US news they were showing Americans was correct, and followed their rules. However, I am afraid they are going to have to change that approach.”Some MPs have called for the issue to be addressed before any US cars get anywhere close to roads in the UK, because in March this year a women in the Arizona was killed by an autonomous Uber car that did not see her.Adam Holloway MP said: “These machines will eventually make our lives and environment better, but in the meantime no one else must be killed or injured.” Engineers have said the only way to solve the issue is to make sure that US driverless cars know what British vehicles look like in every type of environmental condition. Chris Posch, who is the director of automotive engineering at FLIR, told The Sunday Telegraph: “You would have to show it thousands of images of London red buses, not just in good weather in the day, but images of them at night, in the rain and in fog.”“This cannot be considered a mature technology if it cannot recognise a red bus but it can spot a Chevrolet,” said Tom Brake MP. Uber and Google have been contacted for comment.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}