{"id": "\nAmazon begins hiring for top secret new device\n", "paragraph": "Amazon has embarked on a major hiring push for a secretive new device, in a move that will increase speculation the company plans to release a robot for the home.Job adverts show the company is looking for experts in mechanical engineering and robotics as well as software developers to work on a “completely new best in class consumer product”.The new project is being strictly kept under wraps, with interviewees not even told what they will be working on until their first day on the job, a person familiar with the process told the Sunday Telegraph.However, the job adverts describe the new product as “lovable” and “essential”, appearing to support reports earlier this year that a small group of employees at Amazon were developing a robot for the home. The company’s job website now displays more than 100 openings in Seattle and California for the project, suggesting that it is expanding its efforts in the space.The secretive hiring process is similar to the way that Amazon hired staff to develop Alexa, the company’s voice assistant, four years ago. Alexa has since become one of Amazon’s most successful products, found across its range of smart speakers, tablets and own-brand microwave. The job adverts show Amazon searching for developers experienced in creating applications that respond to voice or gestures, build companion apps for smartphones and design games that will “create the most engaging play experience for our customers”. It is also looking for mechanical and robotics experts who have experience working with international factories for mass production, using metal, plastic and cameras. Other desirable skills include experts in computer vision, which allows cameras to see and understand their environment, and psychology academics to influence its design. Last week Amazon announced two new headquarters in Virginia and New York City. It initially began a search for a single, second headquarter to rival its Seattle base in size and has been courting cities around the US, many of which offered tax cuts and benefits to try and convince founder Jeff Bezos to pick them. Bloomberg reported in April that Amazon was already working on home robots and that it would begin testing them in homes “later this year”. Amazon did not comment. © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}