{"id": "\nMauricio Pochettino admits Tottenham's Champions League hopes 'nearly over' after damaging PSV draw\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nMauricio Pochettino admitted Tottenham Hotspur are facing the end of their Champions League journey.Pochettino could not conceal his frustration after a hugely-damaging draw with PSV at the Philips Stadion which leaves Spurs facing a massive battle to reach the knockout stage.Spurs are five points behind second-placed Inter Milan in Group B and probably need to win all their remaining games – including a date with Barcelona at the Nou Camp to progress.“It is nearly over. We only have one point after three games so it will be very difficult,” said Pochettino.“The feeling is not so good because I think we deserved to win. When you are in a good situation to kill the game and you don’t kill it, you have to blame yourself. We completely dominated, we need to be more aggressive and score more than two goals because we had the chances.“If you don’t win, you don’t deserve to be in the Champions League. You draw and we put in a dangerous situation our chances of qualification.“We need to win the three games we have to play and some results that help us achieve one place for qualification will be so, so difficult.”Pochettino declined to criticise Spurs goalkeeper Hugo Lloris or Slovenian referee Slavko Vincic, who was erratic for much of the evening, for the game’s pivotal moment.Lloris was given a straight red card 10 minutes from time for a reckless tackle on PSV’s Hirving Lozano as he rushed out of his penalty area.“I’m not going to blame any player. I blame myself. I am responsible. We didn’t win. If you want to blame somebody blame me,” said the Spurs manager.“In my opinion it wasn’t a red card but we can’t blame the referee. Why should Hugo apologise? One day when I was young I made a big mistake and my manager said to me you don’t need to apologise.“Only those on the pitch can make a mistake. It wasn’t a mistake, it was an action and a sending off - it can happen a lot in football.”Spurs return to action in the Premier League on Monday night with a game against leaders Manchester City at Wembley.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}