{"id": "\nSchools should not attempt to diagnose children with mental health disorders,  Government adviser says\n", "paragraph": "Schools should not attempt to diagnose stressed children with mental health disorders, a Government adviser has said.Tom Bennett, who guides ministers on behaviour issues in schools, warned that teachers must not give out “amateur diagnoses” to pupils, adding that there is a danger of “medicalising” normal childhood emotions.  His comments come as the Department for Education (DfE) publish new guidance on mental health and behaviour in schools, in which teachers are encouraged to refer children on to external specialists if they display symptoms of mental health issues.“Schools need to be careful not to overreach their expertise and try to do the job of trained experts in the mental health arena,” said Mr Bennett, who was commissioned by the DfE to carry review behaviour policies in schools. He said that teachers who tell their students that they are suffering from a mental health condition run the risk of exacerbating problems rather than solving them.  “If teachers try to be amateur diagnosticians, they can lead children to believe that their symptoms are something more serious. You can exacerbate stress by making people worry about it,” Mr Bennett told The Daily Telegraph. “Teachers are not trained clinicians and schools need to be careful not to be amateur diagnoses. There is a danger of medicalising normal responses.  If a child is stressed because of an exam or if a child is going through a bereavement that is not a mental health problem.”Mr Bennett told how growing awareness about mental health issues has given rise to confusion about what constitutes a symptom.“Schools are by their nature institutions that are at the front line of public service, and are frequently a first port of call for issues,” he said. “Its perhaps understandable that schools and teachers are exposed to these issues. But there is a lack of understanding about what mental health issues are.”New DfE guidance published on Monday says that schools must actively promote mental wellbeing of pupils and ensure they are resilient. Last month, the Treasury announced that every state school will be given a dedicated mental health professional to help children deal with the impact of social media.Philip Hammond said that mental health funding will be increased from nearly £12billion to more than £14billion within five years. The announcement was the first stage of the NHS long-term plan to help achieve “parity of esteem” between mental and physical health services.The new mental health teams will be overseen by NHS professionals and help children with “mild and moderate mental health problems” including the effects of cyber bullying. Schools will also be encouraged to appoint a “designated mental health lead”, who would be a teacher.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}