{"id": "\nBBC's Dan Roan reprimanded after claiming Leicester City boss 'died with his mistress'\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nThe BBC’s sports editor has been reprimanded by bosses after he was caught on camera claiming that Leicester City’s owner had a mistress who died alongside him.Dan Roan is facing calls to resign over the unguarded comments made at a memorial for Vichai Srivaddhanaprabha and the four other victims of Saturday’s fatal helicopter crash.Sources at the BBC said Roan’s gaffe came despite him being told to “strike the right tone” when covering the story. He is known for his forthright interviewing style, and bosses are said to have reminded him that he needed to take a sensitive approach when reporting a tragedy.One of those killed was Mr Srivaddhanaprabha’s personal assistant, Nusara Suknamai. Roan was apparently referring to her when he was unwittingly recorded in the background of a Sky News feed, unaware that the cameras were still rolling and the footage was being streamed live online.Roan appeared to laugh as he alleged that the club owner had a “mistress who died in the crash, otherwise known as a member of staff, ie. the mistress,” adding wryly that the business tycoon was a “family man”.He went on: “But that’s what you do if you’re a billionaire - that’s expected, so we shouldn’t judge.”Miss Suknamai was a former beauty queen and actress who had worked for Mr Srivaddhanaprabha for several years. Another employee, Kaveporn Punpare, pilot Eric Swaffer and passenger Izabela Roza Lechowicz also died in the crash.The footage, taken at the King Power stadium shortly after Mr Srivaddhanaprabha’s widow laid a wreath, was watched by thousands of Leicester City fans and was soon circulated on social media.Roan issued a short apology, tweeting: “Just want to say sorry for some comments made in private, off-air conversation earlier with a colleague. Absolutely no offence intended.”Many fans replied calling for him to resign and accusing him of disrespecting Mr Srivaddhaprabha’s memory with his “disgraceful” and “offensive” comments.Roan believing himself to be off-air was no defence, they said, pointing out that Andy Gray and Richard Keys lost their jobs as Sky Sports pundits in 2011 after they were overheard making derogatory comments about a woman.The corporation refused to confirm that Roan would face disciplinary action, saying: “We deal with staff matters privately.”A BBC spokesperson said: “This was an ill-judged comment made in a private off-air conversation for which Dan has apologised.”But a source said: “The BBC have taken a dim view of this. They told him at the outset that the main thing he needed to do was to strike the right tone, and then this happens.”A Cambridge graduate, Roan joined the BBC trainee scheme and worked for a spell at Sky and Setanta before returning to the corporation. He was made sports editor in 2014 and admitted that his appointment raised eyebrows.“When I was made editor, the people who I’d worked with before could not believe this was possible,” he told Varsity magazine.Roan was banned from the Etihad stadium in 2012 over his “leading and aggressive” questioning of Patrick Vieira. He also clashed with Sir Alex Ferguson, saying the former Manchester United manager was “not used to journalists standing up to him [but] it’s what makes the job fun”. © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}