{"id": "\n'I should be fed up, but I love football. What else would I do?' With grass-roots game in crisis, why little clubs must be saved\n", "paragraph": "It is five minutes until kick-off and final pre-match routines are taking place all over the Wide Lane Sports Ground in Eastleigh. Two players are crouched down having a last cigarette, three others are relieving themselves behind the nearby trees and one is pushing a pram into position alongside a small handful of spectators. The volunteer linesman from the University team has evidently also sensed a last opportunity to work on his sun tan and so opts to strip down to his shorts and brave the 16C (61F) temperature. Within a few minutes of the match starting, his opposite number from the Chamberlayne club has already combined running the line with a loud penalty appeal. The groundsman has just pulled up and is mildly irritated to see that the teams have taken one look at their allotted pitch and agreed instead to play on the one next door.This is the Southampton Senior Cup and, with three other matches being played simultaneously on neighbouring pitches, a snapshot of the national game’s real grass roots. The passion, effort and simple love for football is what is most striking. The matches are serious, of a decent standard and, for all the sometimes industrial language, played in a positive atmosphere. And yet, speak further with the players, referees and volunteers, and a familiar message is repeated. The grass roots face serious underlying problems, most starkly in adult 11-a-side football, and faith is eroding in either local government or the national football authorities to do anything significant about it.Rod Sutherland has been secretary of the Southampton Saturday League for more than a quarter of its 120-year existence and, from a high 15 years ago of 182 teams spread over 13 leagues, there are now 64 teams. It is a pattern repeated throughout the country and, while the growth of small-sided evening leagues is one explanation, the costs, administration, lack of experienced referees and wildly fluctuating facilities are also regularly cited. “From November through to February, some teams barely played and then we were cramming games in at the end,” says Sutherland.The league has consciously moved away from pitches owned by the city council in favour either of university-maintained facilities, such as the site at Wide Lane, or parks and parish land where clubs might help to look after their own pitch. The thirst for investment is huge.Chamberlayne, for example, have grown into a thriving community club in what is not the most affluent part of Southampton. They have numerous teams across different age groups but are hitting a glass ceiling. “The toughest thing has been trying to secure our own land to progress,” says captain Adam Smith, shortly before delivering his team-talk. “We want a hub; somewhere we can call home.”Chamberlayne are currently at ‘Level 8’ of the pyramid, but their chances of significantly progressing depend upon having a facility with floodlights.Pitch costs are another mounting issue for all clubs. Saturday’s games cost £72 for the pitch, plus £30 for their referee, on top of the various county FA affiliations and insurance requirements, and nothing much polite is said about the council-owned options. Grass facilities are deemed poor and any 3G or 4G pitches generally cost upwards of £100 an hour. The arrival of travellers has rendered one inner-city site unusable already this season for several weeks.John May, who runs the Royale Marine team, says the FA is presiding over the “slow death” of adult 11-a-side football. “I am surprised someone hasn’t caught the bubonic plague in some of the dressing rooms,” he said. “There is no money in maintaining football pitches. Schools football is also largely gone. The future of the 11-a-side game is at stake.”Refereeing remains another thorny topic. These four matches are played in a good spirit and there are generally enough officials locally for the Saturday league, even if 80 per cent of the games are now covered by referees over the age of 50. Sundays are a different proposition and many games will be taking place in Southampton this weekend without one. “I often end up doing it,” says May. “I enjoyed it until about two years ago. Now you get people saying, ‘Why have we got ----ing idiots like you reffing?’ It’s probably because you have given a mouthful to all the other referees on a Sunday morning.”The general attitude to the collapse of the proposed Wembley sale is instructive. Grass roots is what the £600million deal was supposedly about, but no one at Wide Lane seems to think they would have noticed any difference. Their experience is that any trickle-down ends far higher up the amateur game. “We were sceptical and didn’t think it was a good idea to sell the crown jewels,” says Sutherland.Whilst we have been chatting, the action out on the pitch has been fairly dramatic. University had taken the lead. Chamberlayne’s goalkeeper had also collapsed to the floor with an apparent thigh injury shortly before half-time, while their striker had missed two excellent headed chances. Morale was being tested, especially when one team-mate pointed out that “he just needed to stand still and let it hit him on the head”, but they rallied admirably in the second half to win 2-1.There was a similar comeback in the adjoining pitch, where Prior Rovers were beaten 3-2 by Montefiore Halls after leading 2-0. AFC Hiltingbury, meanwhile, edged Fawley 6-4 in a 10-goal thriller. As the players headed in the direction of the bar, you sensed that this had been one of those afternoons that makes the time, money and effort worthwhile.“It’s a brilliant league – social and competitive – and we’d still be here if it went down to two teams,” said Priory manager Joe Jarvie. May, who almost walked away from Sunday league football last year, understands that sentiment. “I should be fed up with it,” he says. “But it’s my hobby. I love football. And what else would I do on a Sunday morning?”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}