{"id": "\nBusinessman died after falling out of bed when agency night carer failed to turn up\n", "paragraph": "A retired businessman died after falling out of bed when an agency night carer failed to turn up for their shift, an investigation has found.Robert Adamson, 82, had Alzheimer’s disease and needed round-the-clock help with his personal care but was otherwise happy and healthy.But he was found dead on the floor by his daughter the morning after a nursing agency responsible for his overnight care failed to send a carer to look after him as promised.An investigation by the Parliamentary and Health Service Ombudsman reveals that “poor communication and administrative errors” by nursing agency Jane Lewis meant Mr Adamson - a former director of Rolls Royce and Jaguar dealership Henlys - was left alone without care on the night he died.His daughter Rachel Adamson, 52, said: “As far as I’m concerned, my father might have lived if a carer had been there that night. “The way the agency acted was hideous. After I took it to the Ombudsman, they assured me something like this would never happen again - but that doesn’t bring him back.”Mr Adamson, described as “a perfect gentleman”, was a motoring enthusiast and successful businessman who worked for Henlys for 30 years.He later took over a boat business in Chester, where he lived with his wife of 60 years, Judith, now 83.Although he lost the use of his legs when he developed Alzheimer’s, he was able to enjoy time with his wife, their three children and four grandchildren, including holidays to Africa and Majorca in the two years before he died.His family helped look after him when he became ill and also took on a live-in carer to help with his personal care during the day. At night, a relief agency carer took over from 10pm to 7am.The overnight care, funded by the NHS, was provided by Chester-based agency Jane Lewis for around nine months before his death.On August 8, 2016, Mr Adamson’s live-in carer was on holiday so his family looked after him during the day.When the night-time carer failed to arrive at 10pm, Mrs Adamson called the Jane Lewis agency who assured her someone was coming.After the family made several further calls, they were eventually reassured that a carer was on their way and would let themselves in as usual to attend to Mr Adamson in his downstairs bedroom.An exhausted Mrs Adamson, then 81, finally went to bed around midnight, convinced a carer was minutes from arriving.But in the morning, when Miss Adamson made an early visit to her parents’ home, she found her father lying dead on the stone floor of his bedroom.She said: “I saw his bed was empty and my first thought was: ‘Where’s Daddy?’. Then I saw him.“He had rolled out of bed and hit his face against the stone floor. I kicked the bed out of the way and grabbed hold of him.“I knew as soon as I held him he was dead. I couldn’t believe it. I was screaming for Mum and thinking: ‘Where is everybody?’. I couldn’t understand where his carer was.”The agency finally called an hour later to inform the family they had not been unable to find an overnight carer after all.“If we had been told no one was coming then one of us would have stayed with him but they kept insisting they were sending somebody,” Miss Adamson added.The family took their complaint about Jane Lewis to the Ombudsman as they were unhappy with the response from the agency.An investigation found the agency’s errors and communication failures meant Mr Adamson had been left alone on the night he died. It also found the agency did not appear to appreciate the level of distress caused and had instead disagreed with the family about what had happened.The Ombudsman recommended the agency apologise, pay £1,000 in compensation and take steps to ensure the errors would not be repeated.Parliamentary and Health Service Ombudsman Rob Behrens, said: “This case illustrates the significant impact on families when failings occur.“While we recognise health care staff are under significant pressure and applaud the fantastic job they do, communication and reliability are key elements of their work and, when things go wrong, it is vital that this is recognised and steps are made to improve services.”A spokesman for Jane Lewis said: “We sincerely regret the tragic loss of Mr Adamson and have profoundly apologised to his family for the service failings on the night of 8th August, 2016.\"While this was an isolated incident, our business has learnt from it, fully implementing the recommendations of the Ombudsman to ensure such an incident cannot happen again.\"© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}