{"id": "\nRangers manager Steven Gerrard urges fans to ‘ignite’ Ibrox again ahead of Spartak Moscow visit in Europa League\n", "paragraph": "Rangers’ Europa League collision with Spartak Moscow at Ibrox ­on Thursday night is the second instalment of engagements on three fronts, in a week that will offer some indication of the team’s progress under Steven Gerrard. Last weekend he supervised the first away win of his management in the domestic title campaign and on Sunday Gerrard can bid for his first cup final north of the border when Rangers meet Aberdeen in the Betfred Scottish League Cup semi-final at Hampden Park.Qualification for the knockout stages of the Europa League cannot be secured this evening, but Rangers will be in control of their own destiny if they prevail against Spartak in the first match of a double-header against the Russian club, who have endured a turbulent passage, culminating this week in the sacking of their manager. Massimo Carrera was sent on his way after defeat by Arsenal Tula left Spartak in seventh place in the Russian Premier League and his place has been taken by Raul Riancho, the fitness coach.This is therefore the second ­European tie in succession to see Rangers face opponents under new management. Earlier this month, Rapid Vienna replaced Goran Djuricin with Dietmar Kuhbauer ahead of their trip to Ibrox, but the change did not prevent Rangers achieving a 3-1 victory that left them on top of their group.“It’s slightly different to the situation with Rapid as Spartak have made a promotion from within,” Gerrard said. “Last time it was an entirely new manager, so we were expecting a different philosophy and an entirely different way of playing.“When you promote from within you normally wouldn’t make such drastic changes. It’s very difficult to predict how they will approach it and indeed the outcome of the match.“At the end of the day it’s nothing we can control, we have to look at ourselves as we always do. They are sitting seventh in their league but I think it’s a false position.“That said, if that’s where you are in the league, because of the size and stature of a club like Spartak, then you know you are going to be under pressure.“A club like Spartak, with so much Champions League experience, expect to be competing at the top of the league. In terms of us, it doesn’t change anything. We are at home, we have a game plan, and whether they have changed the manager or not, it doesn’t impact on what we want to do.”Although the implications of a Rangers victory are obvious – the odds would favour their qualification for the next stage of the tournament and make Spartak favourites to be eliminated – the evolution of the group has not offered a sure guide to form. Rangers have drawn away to Villarreal and beaten Rapid, who in turn have beaten Spartak, while Villarreal left Moscow with a 3-3 draw.“Rapid beat them in the opening match, so it’s a very difficult one to judge,” Gerrard said. “For my money, they are around the same level as Villarreal but I don’t think there’s much between all the teams, to be honest.“I was happy with every aspect of our last performance against Rapid. We managed to get in front and we scored late on. We did so much work in the first half, matching their aggression and grinding them down. We got our rewards late on. The atmosphere was excellent.“All the talk afterwards was it was like the atmosphere of old. It drives the team on. I felt it as a player myself. We have to ignite it all, though, with our performance.”Gerrard will not be able to call on Scott Arfield, who is injured, but Ryan Jack is again ready for action and Kyle Lafferty is also in contention. The manager, meanwhile, offered an unadorned vision of the beautiful game in an era of stats, sports science and algorithms.“Football doesn’t change. I’m telling these players now what I got told in 1999 by Gérard Houllier and Rafa Benítez. Winning teams have the same principles, the same tempo, desire, commitment.“Some coaches try to overcomplicate things. They’ve got the gift of the gab and the silver tongue, but I haven’t. I tell my team how it is and what’s expected at this club. I’m not going to stand here and try to change the game of football. It’s been going on long before I was created.“I have listened to certain people throughout my career and they just talked b------s. They did. The game is littered with a lot of them. I don’t complicate it. I just say the same things Walter Smith said or Graeme Souness did. I bet, if you compared the three team talks, there wouldn’t be many differences.”Rangers (4-3-3):McGregor; Tavernier, Goldson, Worrall, Flanagan; Coulibaly, Jack; Candeias, Morelos, Kent. Spartak Moscow (4-2-3-1): Maksimenko; Rasskazov, Dzhikiya, Bocchetti, Kombarov; Fernando, Zobnin; Hanni, Eremenko, Lomovitskiy; Ze Luis. Referee: Kevin Blom (Holland). Kick-off: 8pm. TV BT Sport 3.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}