{"id": "\nSteven Fletcher and Jordan Rhodes in line for Scotland recall to ease striker crisis\n", "paragraph": "Alex McLeish will have to play his discards right if Scotland are to have a chance of prevailing in their crucial Nations League double header against Albania in Tirana and Israel at Hampden Park next month. Scottish hopes were struck a blow with the news that the Hearts striker, Steven Naismith, has been ruled out for up to two months with a knee injury sustained in Sunday’s Betfred Scottish League Cup semi-final defeat by Celtic at Murrayfield.Celtic’s Leigh Griffiths, meanwhile, will not be match fit, even if he overcomes calf injuries and other issues by the time the Scots are in action again, according to his club manager. McLeish has included Oli McBurney of Swansea and Johnny Russell of Sporting Kansas City in recent squads, but neither has yet found the mark at international level, while West Brom’s Matt Phillips has one goal to his credit from a dozen appearances.In these circumstances, McLeish will consider recalls for Steven Fletcher and Jordan Rhodes. Fletcher was last seen as a substitute in a 2-2 draw with Slovenia in a World Cup qualifier on August 10, 2017. The Sheffield Wednesday forward has scored nine goals from 31 Scotland appearances and three from 16 club outings this season.Rhodes, with 14 caps, has scored three times for his country and seven from 17 Norwich City appearances in the current campaign, including a double against Aston Villa on October 23. His most recent appearance for Scotland was in a friendly against Canada at Easter Road on Mar 22, 2017 when, as fate would have it, he replaced Naismith after 62 minutes.Naismith is top scorer at Tynecastle with 11 goals this season and his return to form worked to Scotland’s benefit when he scored one goal and had an attempt deflected for the other in 2-0 Nations League win against Albania at Hampden Park. He also got the Scots’ consolation goal in a 3-1 friendly defeat at home to Portugal.He will join defenders Christophe Berra and John Soutter and fellow attacker Uche Ikpeazu on the Hearts treatment roster and his absence is likely to be felt keenly in Wednesday night's Edinburgh derby at Tynecastle.  “We’ve had a number of blows in the last three or four weeks, so we have to cope with this as well as we've done with the other ones,” said Craig Levein, the Hearts manager. “It does leave us a little bit thin up top with Uche being out as well, but we'll get by.”Hearts’ strong start to the season, which sees them lead the Scottish Premiership table by five points from Kilmarnock, was dented by Sunday’s 3-0 loss to Celtic, an experience shared by Hibernian, whose most recent outing was a 4-2 defeat by the champions at Parkhead. Hibs had no weekend action because of the disruption to the league schedule caused by the Betfred semi-finals and Neil Lennon was unhappy about the gaps in the Easter Road club’s timetable.“It sounds a bit rich coming from the manager complaining about a lack of football, but this is only our second game since Oct 5, so the only thing that worries me is rigor mortis setting into the squad,” Lennon said.“In December, it's all concentrated into eight games in four weeks. It’s just absolutely criminal. This is a block of five games where it’s our fourth one away in five games. I've never come across that one before, so it's difficult, but we’ll adapt.”That said, the Scots dictum that ‘there’s aye somebody worse off than yourself’ can be applied to Dundee, who are at home to Celtic this evening. Dundee replaced Neil McCann with Jim McIntyre two weeks ago and the new manager’s first games in charge ended in a 4-0 defeat at Livingston and 3-0 loss at home to Hearts.Celtic, by contrast, trundled through a passage of seven games with six goals in total, until they scored as many in one fixture against St Johnstone and then racked up four against Hibs and three against Hearts. Griffiths played for an hour of the rout of St Johnstone before being replaced by Scott Sinclair and the striker has not been seen since, with an unidentified illness playing its part in his absence. Asked if there was any chance that Griffiths might fill the gap left by Naismith when the Scots return to their Nations League qualifiers, Brendan Rodgers said: “He’s getting better and his calf injury is coming towards its end.“However, if he is fit for that period he certainly won’t be match fit. I spoke to Alex McLeish at a function last week and I’m sure he’ll have spoken to Leigh, but we have 10 players out injured at the moment and they’re all working hard to get back as quickly as possible.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}