{"id": "\nFrank Lampard's rampant Derby blow away sloppy West Brom\n", "paragraph": "West Bromwich Albion missed a chance to regain top place in the Championship as they fell to a second defeat in as many matches as Derby established the right to be seen as promotion contenders. An attacking Derby line-up hit two goals in the opening 15 minutes and never relinquished control, adding two more in the second half to quash any possibility of a comeback by the home side. Albion’s cause was not helped by an injury to top scorer Dwight Gayle, who took his place on the field for the second half after taking a knock late in the first period but withdrew before the referee had re-started. Gayle thought he should have had a penalty just before half-time when Derby’s Scott Malone appeared to clip his heel but replays were inconclusive. Derby manager Frank Lampard set up with five attacking players, but the opening goal was a gift. Jack Marriott intercepted a limp backpass by Jay Rodriguez after 10 minutes to score easily. Derby pressed for a quick second goal and were rewarded five minutes later as Craig Dawson allowed Tom Lawrence to cut inside him on the left and send a shot wide of Sam Johnstone and in at the far post. Albion were not without chances but could not match Derby’s finishing and when Harry Wilson, on loan from Liverpool, added a third six minutes into the second half with a crisp left-foot strike from 20 yards the game was over, even before Malone cashed in on more sloppy defending by Dawson to fire in a fourth 19 minutes from the end. Rodriguez combined with Harvey Barnes with seven minutes left to deny the visitors a clean sheet. West Bromwich Albion (4-3-1-2): Johnstone; Dawson, Adarabioyo, Bartley, Gibbs (Mears 45); Phillips (Morrison 62), Field, Brunt; Barnes; Gayle (Robson-Kanu), Rodriguez. Substitutes: Myhill (g), Sako, Edwards, Hoolahan. Booked: Dawson.Derby County (4-1-4-1): Carson; Bogle, Keogh, Tomori, Malone (Forsyth 80); Huddlestone; Waghorn (Nugent 73), Wilson, Mount, Lawrence; Marriott (Bennett 67). Substitutes: Roos(g), Johnson, Holmes, Davies. Booked: Huddlestone, Malone. Referee: Robert Jones (Merseyside). © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}