{"id": "\nTottenham players fear Mauricio Pochettino could leave in summer\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nTottenham Hotspur players are concerned that Mauricio Pochettino could be tempted away from the club at the end of the season.Those fears about the manager’s future will only grow if gloomy predictions, made to Telegraph Sport, that Spurs will not be able to move into their new stadium before February prove correct.Sources close to Pochettino insist there is no chance of him leaving mid-season and that the Argentine remains committed to leading the club into the new stadium.But there is a feeling among some players that Tottenham will face a battle to convince Pochettino to stay if Manchester United or Real Madrid come calling in the summer.Madrid have put Santiago Solari in interim charge after sacking  Julen Lopetegui and would most likely have to keep the full-time post available until next summer to get Pochettino.The 46-year-old has emerged as the favourite to succeed Jose Mourinho at United if the Portuguese leaves Old Trafford at the end of his third season in charge.Pochettino ignored interest from Chelsea to sign a new five-year Tottenham contract in the summer and Dele Alli has become the latest player to sign a new deal, worth in excess of £100,000-a-week, which runs to 2024.But Pochettino has made no secret of his frustrations in recent weeks. Ahead of Monday night’s  defeat by Manchester City, he  admitted to reaching his lowest point at Tottenham following delays over the stadium and a failure to sign any players during the summer transfer window.Having failed to finish the stadium in time for the initial opening date of Sept 15, Tottenham had been tentatively working towards completing it in time for the Burnley game on Dec 15.But chairman Daniel Levy last week confirmed the stadium will not be ready for that date and that Spurs will finish the year playing at Wembley, where 56,854 fans – below the 90,000 capacity – watched the defeat by City on a pitch ruined by the NFL match between Jacksonville Jaguars and Philadelphia Eagles the previous day.That has led to suggestions that the Manchester United game on  Jan 13 could be a new target, but construction experts have told  Telegraph Sport that February is a more realistic move-in date.Tottenham have a number of electrical issues to resolve and the sheer scale of the work still left, along with the Christmas and new-year break, make it difficult to complete in time for the visit of United.Pochettino’s team have two home league fixtures in February, against Newcastle United, on Feb 2, and Leicester City seven days later.Pochettino has made it clear that he expects to be given big money to spend when Tottenham eventually move into their new stadium, but the club last week revealed their net debt is now worth up to £637 million. An extra £237 million has been borrowed to help cover the spiralling bills of the stadium, which is likely to cost over £1 billion when finished, and Spurs are ready to finance their debt through a bond issue.Gary Neville believes Pochettino has started to plot his exit strategy, telling Sky Sports’ Monday Night Football: “He is a brilliant coach, but at some point he was always going to want to manage one of the super-clubs in Europe.“There are a couple at the moment that you can imagine will be changing manager in the next 12 months and looking at him, and he will know they are looking at him.“It feels to me that he has laid the first foundations for a move away from the club and started to prepare the ground.”Having already lost to City, this could be a defining week for  Tottenham’s season with a Carabao Cup tie against West Ham United tonight, a trip to Wolverhampton Wanderers on Saturday and the vital Champions League visit of PSV Eindhoven next Tuesday night.With Pochettino considering changing his entire team for the trip to West Ham, the midfielder Harry Winks has described Spurs’ schedule “ridiculous”. Christian Eriksen and Alli could both start at the London Stadium after coming off the bench against City.Pochettino said: “It is so difficult, it is not easy. We are going to assess all the players and it is less than 48 hours to compete again, having had the circumstance of playing on a pitch that is so difficult to play in a tough and a very competitive game.“We’ll see which players can repeat, some can be on the bench and some they need to rest. My feeling today is that it is going to be difficult to repeat some players, maybe [Eric] Dier who played 65 minutes, but I don’t believe too many players will be ready and fresh to play.”Winks added: “We have got three games in five days which is ridiculous really, in terms of the schedule. So it is going to be tough for us.“We have got to dig in, we have got a big squad, got players that can play two games in two days because we are a fit squad and a fit bunch of players.”Despite fears over Pochettino’s future and the immediate fixture schedule, Alli is optimistic about his and Tottenham’s fortunes after signing his new contract. “I’ve loved my time at Spurs so far,” he said. “I’m very excited to see what the future holds.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}