{"id": "\nFacebook and Google seek assurances from UK about impact of Brexit deal\n", "paragraph": "Three of the world’s largest technology companies have met with government ministers in London to seek assurances about the impact of a no-deal Brexit on jobs and investment in the industry, the Telegraph has learned.UK chiefs of Microsoft, Facebook and Google used the meeting on Wednesday morning to express mounting concern over the potential impact on staff visas, rules on data sharing and UK research and education.Sources with knowledge of the meeting said that it was attended by Jeremy Wright, Secretary of State for Digital, Culture, Media and Sport, Digital Minister Margot James, and Baroness Fairhead from the Department for International Trade.The closed door talks came just days before the Chancellor is due to deliver the Budget, amid growing speculation over the possibility of a new digital tax on the technology giants.Google’s UK head Ronan Harris is understood to have asked ministers about the potential impact of Brexit on laws around the transfer of data. Google’s advertising business relies heavily upon retaining user data, and Brexit will see the government have to form a new data-sharing agreement with the European Union.In 2016, the EU formed a new “Privacy Shield” agreement with the US to govern the transfer of data between the two continents. Technology executives raised this agreement in the meeting and asked ministers about the progress of the UK’s own data negotiations with the US.Also in attendance at the meeting was Facebook’s European head Nicola Mendelsohn and Cindy Rose, the chief executive of Microsoft UK.Last year, a Microsoft executive warned that the business could move its data centres overseas if the UK introduces import tariffs as part of the Brexit process.\"That might change our investment decisions and perhaps we build out our data centres across other European countries,\" he said. Microsoft later walked back his comments and said that they \"were not reflective of the company’s view.\"Immigration was a key topic raised by the tech giants as they sought assurances that they will still be able to recruit staff from the EU after Brexit.Facebook and Google have both announced increased investment in the UK through new offices for thousands of staff in King's Cross.The meeting was held as part of the government’s Digital Economy Council, which also includes representatives of Apple and Amazon, although they were not in attendance on Wednesday.Google, Facebook and Microsoft declined to comment.Executives asked the government about the risk of leaving the European Union without a Brexit agreement. Ministers are understood not to have ruled out the possibility, but said that it was unlikely. © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}