{"id": "\nEngland embrace new high-stakes horizons and cultivating 'good habits' of winning\n", "paragraph": "It may be getting a little ahead of themselves but the question is if England do defeat Croatia at Wembley on Sunday and go on to win their top tier of the Nations League come June then does that constitute a legitimate trophy that ends the fabled 52 years of hurt?At the end of a momentous 2018, the 17th game of a year that has seen England reach a World Cup semi-final, defeat Spain on their home turf and bid farewell to the country’s greatest ever goalscorer it is one worth asking.The Nations League began as something of a running joke, the new competition format that required a five-minute explanation if indeed you could find someone who understood it, but as a concept it is growing in popularity.It has served up a strange menu of games for England, including a 2-1 defeat by Luis Enrique’s Spain when they came to these shores, the behind-closed-door goalless draw against Croatia in Rijeka and then that exhilarating 3-2 victory in Seville. Suddenly there is a game that has caught the imagination at Wembley where a full-house will see a high-stakes shoot-out between two teams playing one another for the third time in 130 days. Even a score draw will see England finish bottom of the group and relegated to the B-tier of the Nations League.Southgate considered the value of the Nations League – less than a World Cup, obviously, but potentially double a Tournoi – and pointed out that the European Championship, launched in 1960, took some time to establish itself.“It’s not a European Championship or a World Cup but it’s good habits to get into,” he said. “We want to win big matches where there is a bit more pressure and more emphasis in front of a full house.“These are really good experiences for the team and wherever it sits we won’t know. When they started to have a European Championship many years ago a lot of teams didn’t enter and these things evolve.“The idea of a competition where all the best teams are playing against each other was an exciting concept, I thought. We won’t know until time passes where it sits.”The notion of England finishing top of a group including two top-tier football nations felt a long way off this time last year but the progress has been rapid. Even so, what about changing the perception that England fail to beat top teams in competitive games? “It’s not perception,” Southgate said, “it’s the truth. We haven’t beaten top teams historically. When I have looked back it just has not happened.“Would that change it for good? No, because every time you go into a round of matches you have to prove yourselves again.“What has been exciting is that we have looked at the summer and what we achieved but, OK, what do we do to progress that forward?”There will be a wholesale change of the team from the one that beat the United States 3-0 on Thursday with only Jordan Pickford from the XI that begun that game likely to start against Croatia. At the end of a World Cup year Southgate has changed formation from 3-5-2 to 4-3-3 and Ross Barkley is now preferred in midfield to Dele Alli. With the potential exception of Harry Maguire and Kieran Trippier this could be Southgate’s strongest XI that faces Croatia and you could make the argument that both of those may not be picked ahead of Joe Gomez and Kyle Walker.The match also brings together two sides with a new rivalry, exemplified this week by the comments from Croatia full-back Tin Jedvaj who said that his side should be favourites and that England were beaten in the summer “without any problems”. Nothing will make up for the defeat suffered in Moscow to Croatia but it sounded like Southgate had paid attention to the mood coming out of the opposition camp.In the summer he used the words of Hakan Mild the former Sweden midfielder who said that England were “spoiled children” before the World Cup quarter-final between the two nations. “Whenever people speak, you give the opposition the opportunity to use those words as they see fit,” Southgate said. “There were some comments from Sweden in the summer that we definitely used to our advantage. And you can steer that in any way, because half the players thought it was a current Sweden player and it wasn’t, so I wasn’t going to argue with them!”Beating Croatia would make it the best England year since 1996, and send Southgate into his four-month break renewed for the challenge ahead. He chose not to comment on the current dispute at the Professional Footballers’ Association between chairman Ben Purkiss and chief executive Gordon Taylor because he said he had barely had time to pay it any attention.“There’s a lot going on in the world this week and my wife often says to me ‘You do know there is a bloody world going on, it is not all about your bloody football team.’ Especially when we’re in the intensity of a camp and you’re working from seven in the morning to 11.30pm at night just getting the team and the tactics right. There’s little time for the real world. But I’ll look forward to catching up on it all.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}