{"id": "\nFlu jab protected just one in 10 pensioners last year, amid concerns new vaccines will run out\n", "paragraph": "Last year's flu jab protected just one in 10 pensioners, new figures show, amid concerns new boosted vaccinations could run out.An evaluation by Public Health England (PHE) reveals that the vaccines given to millions of patients last winter had little effect.The worst protection was among over 65s - the age group most vulnerable to flu - with effectiveness of 10.1 per cent and none at all against some key strains.Figures among younger adults were little better at 12.2 per cent, with rates of 26.9 per cent among children, the provisional end-of-season estimates show.  The failings contributed to the worst flu season for seven years, with 15,000 deaths from the virus, around twice the average figure, and the worst NHS performance on record.Health officials hope to avert such a crisis this winter, with new types of jabs on offer for all adults.But documents seen by The Telegraph reveal fears that officials have acted too slowly, endangering public health.GPs are being told that some eligible patients may not be able to receive vaccines until the end of December, well after the flu season normally begins.This year adults below the age of 65 eligible for jabs - those with common health problems such as asthma and diabetes - will be offered a vaccine which protects against four key strains of flu, instead of the previous version which protected against three. And pensioners will be offered a boosted jab, found to better protect the elderly.However, NHS England did not issue the instructions until February, causing a scramble to get hold of the right stocks.While those eligible for jabs are now being urged to have them, ahead of the flu season, around 40 per cent of stocks of the boosted jab will not get to GP practices until November.  GPs have now been told to prioritise those aged 75 and over, and “ideally” to complete immunisation of all other eligible patients by the end of December, PHE documents show. A submission to MPs raises fears the delays could cost lives.In evidence to the Commons science and technology committee, senior figures from the British Medical Association (BMA) said: “This clearly presents a very worrying risk to patient safety and could put NHS services under further pressure should there be an early influenza outbreak.”GPs have been told to ration stocks, targeting the oldest and most vulnerable patients first, in order to manage availability of the boosted vaccine.And NHS England has told practices and pharmacies to “shift around” flu vaccine stocks in order to ensure that there are enough to go around, with the UK’s medicines watchdog lifting rules which bar sharing of supplies.But GPs said this was unlikely to work, given that practices and pharmacists’s earnings depend on provision of jabs.Dr Dean Eggitt, from the BMA’s GP committee said:“The disorganisation that we have seen in this year's flu campaign is nothing short of an avoidable national scandal.”Health officials said that patients who are told to come back for jabs should be reassured that the flu season usually starts in December, although it can be earlier.But GPs said they are already seeing cases of flu. In order to manage stocks of the boosted jab, practices have been told to prioritise patients aged 75 and over and those in care homes, followed by pensioners aged 65 and over suffering health conditions, leaving other pensioners to wait for later supplies.Meanwhile, all TV advertising for this year’s NHS flu vaccination campaign has been limited to persuading parents to ensure that toddlers are vaccinated.Last month the main supplier of the vaccine for adults below the age of 65 was hit by delays, with manufacturers Sanofi warning that “a few thousand” deliveries had been set back two weeks.In addition, PHE has admitted that the vaccinations for the elderly will not protect against one of the key strains last winter.  While those for younger adults will protect against a strain called B-Yamagata - known as “Japanese flu” - which became the dominant strain in hospital admissions last January, the jab for the elderly does not protect against this strain.Officials said the version offered to those under the age of 65 was not considered useful for pensioner as it lacks the “adjuvanted” booster needed to prompt an immune response in older people.Health officials are determined to improve uptake of vaccination among NHS staff and care workers, hoping this is one of the best ways to prevent the virus spreading.Doctors, nurses and other staff have been told they could be barred from front-line duties if they fail to be vaccinated.Dr Mary Ramsay, Head of Immunisation at PHE said: “Flu can be extremely serious which is why we’re offering a more effective vaccine to the over 65s this year. We’re working hard to get the message out that all eligible people should get the vaccine. It’s the best defence available.\"An NHS England spokesman said: “GPs and pharmacists were given more than two months to order the vaccine, there is more than enough to meet expected demand and what’s more, older people will be better protected this year than ever before as they will be offered the most effective jab available anywhere in the world, and we expect pharmacists and GPs to get everyone vaccinated before the end of the year when flu usually hits.”  © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}