{"id": "\nJurgen Klopp lauds 'genius' Xherdan Shaqiri after Swiss masterclass inspires Liverpool rout of Red Star Belgrade\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nJurgen Klopp hailed the touch of ‘genius’ by Xherdan Shaqiri as Liverpool rediscovered their attacking mojo in the Champions League.Mohamed Salah took his club total to 50 in 65 games as Liverpool eased past Red Star Belgrade, but his first of the night owed much to Shaqiri’s technical excellence.While Klopp acknowledged Salah’s achievement, the lavish praise was reserved for the Swiss international.“I think he would say thanks to his teammates, its quite difficult to score goals without these wonderful passes, crosses. The first goal he scored was a genius little link-up play by Shaq,” said Klopp.“If you work hard, are in the right spaces, if your teammates see you and you make the right runs, you will score. It’s an exceptional number, hopefully he can continue. What’s the next record he can reach?”Although Belgrade fans were banned from Anfield, a few hundred did make it into the stadium and jeered Shaqiri.Shaqiri was born in the former Yugoslav city of Gjilan, now part of Kosovo, and also has Albanian roots. Although Kosovo declared independence in 2008, Serbia will not recognise it as a state.Red Star officials say they will protect Shaqiri from ‘unwanted situations’ when Liverpool travel to the country on November 6. When Shaqiri scored against Serbia in the World Cup, he celebrated with an ‘Albanian eagle’ gesture.Klopp says he has not given any thought to omitting him from the return game in a fortnight to avoid tensions.“So far, I didn’t think about it, to be honest. It makes sense that I first think before I speak,” said Klopp.With PSG and Napoli playing out a 2-2 draw, Liverpool returned to the top of their group but it remains tight.“We are not through yet,” said Klopp. “This group obviously stays exciting until the end, that was pretty clear I thought immediately after the draw. But we cannot do more than winning our own games, and then the situation can change in your favour. That happened tonight, but it doesn’t say too much about the group to be honest.“The Champions League is very difficult, you have to be 100 per cent focused. They all strike back, they all come back, so I expect a very difficult game in Belgrade to be honest. With the supporters there and all that stuff, it will be really difficult. Napoli have already experienced that.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}