{"id": "\nHusband of freed Pakistani Christian woman Asia Bibi appeals to Theresa May for refuge as protests grow\n", "paragraph": "The husband of a Pakistani Christian woman at the centre of a divisive blasphemy case has pleaded for Theresa May and other international leaders to help the family leave the country, saying he feared for their safety.The request by Asia Bibi's husband Ashiq Masih came a day after he criticised a government deal with hardline Islamists that left her in legal limbo, and called on authorities to protect her.The ultra-right Tehreek-e-Labaik (TLP) party blocked major roads in Pakistan's biggest cities for three days, calling for the murder of the Supreme Court judges who acquitted Asia Bibi on Wednesday, and terming Prime Minister Imran Khan and the country's army chief enemies of Islam.The government reached a deal Friday to end the protests by agreeing to a travel ban preventing Bibi from leaving the country, and saying it would not object to hardline movements appealing the verdict.An appeal has now been filed with the court against Bibi's release.Masih criticised the government deal, saying it was \"wrong\".\"I request President Donald Trump to help us to leave (the country), and I request the prime minister of the UK to do their level best to help us, to grant us freedom,\" said Masih, in a video message, seen by AFP, also requesting help from the Canadian prime minister.Wilson Chowdhry, of the British Pakistani Christian Association, told AFP that the family was resting its hopes on the US, Britain or Canada to grant them asylum and help them reach a place of safety.\"These nations have the largest Pakistani Christian communities,\" Chowdhry said, added that Masih also wants asylum for some members of the extended family and those who have helped with his wife's case, one of whom could speak English.\"If Asia Bibi leaves the country, every family member, every person associated to her, will be killed,\" he said. Mr Khan's ex-wife, Jemima Khan, joined criticism of the prime minister over the weekend.\"Not the Naya Pakistan we'd hoped for\", she tweeted, in reference to the platform for change on which Mr Khan campaigned.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}