{"id": "\nTrainer Uriah St Lewis and bargain buy Discreet Lover - tale of two long shots for the Breeders Cup Classic\n", "paragraph": "Uriah St Lewis and Sir Michael Stoute have a couple of things in common; they were both born in the West Indies and love cricket, but even though they are both racehorse trainers that is about where the similarities end.If Stoute is a multiple Group One-winning trainer in a career spanning 45 years with a soft spot for the Breeders’ Cup, where he has won seven races, St Lewis and his family work seven days a week a lot closer to racing’s bargain basement end.He trains 20 of his own horses, usually bought as yearlings for under $20,000 (£15,750) and often a broodmare’s first foal, at Parx, in Pennsylvania, and until Tuesday had never been to Churchill Downs let alone the Breeders’ Cup.“Wow, I thought when I arrived at 5am yesterday morning,” he said. “That’s when it hit me. Every trainer should experience this. The lights were on and there were already 5,000 people there. At Parx we race in the dark and they don’t get 5,000 people there even when there’s racing on!”  On Saturday, though they are not in the same race, the paths of the two trainers will finally cross  when St Lewis, 60, saddles Discreet Lover in the most open $6 million (£4.7 million) Breeders’ Cup Classic in recent times and despite the five-year-old being 40-1 with Coral, he looks the best long-shot of the meeting this weekend.He gained his entry in the race by beating Godolphin’s Thunder Snow in the Jockey Club Stakes, at  Belmont last month, to provide  St Lewis with his first victory in a Grade One race. And, if the run of Mendelssohn in third that day reaffirmed Ballydoyle’s belief that their colt could win the Classic, then victory did no less for  St Lewis’s confidence in the horse that cost him just $10,000 (£7,870) as a yearling. “A lot of good horses fall through the crack,” explained St Lewis when we spoke at the track On Tuesday morning. “You just have to be patient with them. He was a bit on the small side, maybe, but sometimes horses are big and robust with no sense. He has a lot of sense.\"In the Jockey Club Stakes even the commentator called the horse the wrong name until, as St Lewis recalls, “the last jump” when he crossed the line. “We had our eye on the Breeders’ Cup for a long time but we wouldn’t have come if he hadn’t have won a win-and-you’re-in race,” explained. St Lewis. “I’m operating on my own. I’m not going to take $115,000 [£90,000, the cost of entry], which I have won, and put it back in.“Last year was his breakout year but we kept coming up against Gun Runner. He was beaten 14 lengths by him twice and though it sounds like a lot, Gun Runner was beating everything by seven and eight lengths. Take him out of the equation and we’re in business. “In his races, we take him back and come with one run, which was ideal at Belmont. They set off like a sprint and I thought ‘You gonna keep going faster?’ and they did. I’m expecting first, second or third in the Classic.”St Lewis was first taken to a racecourse in Trinidad aged five. “I saw a grey horse and fell in love,” he recalled. “I moved to America aged 15 and used to do track and field at school, which was two miles from Aqueduct. I’d run to the track, make a daily double, then run back. I would look in the paper the next day and if it had come up I’d run back there to collect.”When he started work it was fixing computers, but for the American Tote at the track and the lure of the sport proved irresistible. “I had my first runner in 1987 and have been up, down, up, down, up and down ever since.”On Saturday the ‘up’ could be off the scale but win, lose or draw  St Lewis is determined to enjoy it. “I know I’m unlikely to get another like this one,” he reflected.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}