{"id": "\nDuchess of Sussex receives Maori cloak for strength during pregnancy on final day in New Zealand\n", "paragraph": "The Duchess of Sussex has been presented with a Korowai, a woven Maori cloak, intended to protect her during pregnancy on her final day in New Zealand. The Duchess, visiting Ohinemutu in Rotorua with the Duke, was offered a cloak made from flax and feathers to honour her as a “great leader”.The colours are inspired by the Sussex coat of arms, using silks in blue, gold, white and red. “We see the Duchess as representing strong kaupapa (values) for women - she displays aroha (love), manaakitanga (nurturing and hospitality), mana (influence) and she is a great leader,” a spokesman from the Te Arawa people said.“The Korowai is like a protector, to wrap korowai around someone is to envelop them in strength, warmth and aroha (love).“In Maori history, Korowai were made to keep people warm as Maori came from Hawaiki. We adapted by using materials such as harakeke (flax) to keep warm.”And that's how they say hello in Ohinemutu.(*sound on*)Meghan is matching a Stella McCartney dress with a new gifted Korowai, a cloak honouring her as a \"great leader\" that will protect her in pregnancy, according to custom #RoyalVisitNZ pic.twitter.com/qUVOaOr4kdIn a morning spent visiting the community, which is based in the hot sulphur springs in the southern part of the North Island, the Duke and Duchess were introduced to the hospitality of the Maori community.Welcomed with songs from hundreds of school children, the Duke and Duchess took part in a formal powhiri - a welcome - and a tour of Te Papaiouru Marae, a traditional meeting place.The Duke and Duchess were also shown a painted bust of Queen Victoria, presented to the tribe, Ngāti Whakaue, in honour of Ōhinemutu’s first royal visitor, Prince Alfred, Queen Victoria’s second son, in 1870.The wooden bust, shipped to New Zealand in 1875, has a long history in the community, and finally delivered - via temporary confiscation by police - in 1884.Placed on a pedestal, it remained on display until 1995 when protests from the Maori community against its treatment by the New Zealand establishment reached the area and the bust, considered by some a symbol of colonialism, mysteriously disappeared. A year later, after being found in a nearby lake, it was reinstated by elders. Recently kept safe in storage, it has now been repainted and has returned to her sheltered pedestal in honour of the Duke and Duchess of Sussex’s visit.Sir Toby Curtis, spokesman for Te Arawa, said the royal visit was particularly significant to the tribe, in inspiring their youth.Describing the Duchess as a role model for Maori, he added: “She has shown you can succeed, make a difference and be your own person while also celebrating your heritage. This inspires us all.“The Duchess’ presence in the Royal Family makes us feel even closer to the monarchy, as she brings a fresh perspective and diversity.“She has been very proactive in her positive promotion of women and this is motivating for the indigenous women of Aotearoa.”After delivering a long greeting in Te Reo, the Maori language, the Duke said: \"Thank you for the beautiful cloak you have so kindly gifted to myself and The Duchess. \"We appreciate the skill of the weavers who made it, and the aroha that has gone into its creation. This cloak is a taonga that will be cherished in our family.\"One of the joys of our visit to New Zealand has been the opportunity to meet so many young New Zealanders who are devoting their talents and energy to making a difference. \"There are creative, gifted and caring Te Arawa Rangatahi young people here, who are using their talents to preserve and promote the Māori language, to support mental wellbeing, and to achieve in areas that will benefit their communities, and their country.\"The Duke of Sussex was handed a carved weapon during the visit to Rotorua - and warned he should not take it to Twickenham when England play New Zealand.Entered into the Tamatekapua Meeting House, he was given a Tewha Tewha, a Maori weapon with a point at one end and an axe at the other. Trevor Maxwell, of the local district council, said: \"I am sure you are going to Twickenham when the All Blacks play England on November 11 - make sure you don't take that.\"The ceremony was conducted in Maori – as Harry and Meghan were being treated like “one of their own” – with Monty Morrison only breaking into English once, when he looked at the Duchess and said “little bump” to laughter.Inside the Tamatekapua Meeting House, a building named after the chief and captain of the Te Arawa canoe and featuring carvings, the group sung folk songs, or waiata, about their history.Mr Maxwell joked in Maori that the Duchess was just like Pihanga – a mountain in the region famed for its beauty.The mood of the ceremony was light and relaxed, and Mr Maxwell stumbled slightly when introducing the Duke, accidentally referring to him as Prince A...” before adding: “It was in 2007 when we had Prince Andrew here!”The Duke spoke for around a minute in Maori, with gasps of awe and smiles when he used the word “whaiaipo”, or sweetheart.The Duke of Sussex is doing a \"really good job of looking after\" his wife during her pregnancy, the Duchess has said.   The Duchess told the artist who made her the Maori cloak that she was feeling well, and is managing to rest despite the demands of the tour.Norma Sturley said: 'I knew that the Duchess would be meeting a lot of people and I wanted to keep her warm, wrap her in strength. I had thought about what would be a good gift. \"I did also talk to her about her pregnancy. I asked if she was getting much rest and if she was looking after herself. She said she was - and that Prince Harry did a really good job of looking after her.\"As the Duke and Duchess entered the marae atea, the area leading up to the dining room and kitchen, the robes were removed because they are not traditionally worn around food. They were greeted - with a hongi - by Masterchef New Zealand 2014 winners Kasey and Karena Bird. The sisters grew up in the beachside community of Maketu and use local produce to create dishes with a New Zealand identity.The women had created the entire menu for the occasion, having been told about it two months ago. Kasey, 28, said:\"They had just requested traditional food. They were really clear they didn't want a separate menu they just wanted to eat what everyone else was eating.\"Karena, 29, said: \"We plated up their food and then went back in there - they had eaten nearly all of it so we were like oh my gosh!\"Kasey added: \"We tried not to be too nosy but it did look like they had eaten a lot - so either they really liked it or they were just really hungry!\"Kasey and Karena then gifted the Duke and Duchess one of their own cookbooks. The couple were shown the Whakaturia (marae kitchens) by Tekariki Mitchell, 50, and his mother, Rene Mitchell, 70. They were shown how their lunch would be cooked using an outside 'Steamed Hangi' box, where food is cooked in geothermal steam. The Duke and Duchess smiled and appeared impressed, as Mr Mitchell showed them the rising steam and a traditional golden steamed pudding that was cooking inside. Rene Mitchell then gave the couple a demonstration of how to make the local dessert, using a recipe learnt from years in the kitchen alongside her mother and aunties. Rene said afterwards: \"I welcomed them here, and was very happy when they greeted me with a 'hongi' as I wasn't sure if they would.\"They said our way of cooking food with the Hangi [geothermal oven] was so wonderful. I told them how I learnt through my mum, and that the recipe itself is very simple but over the years people have added their own variations, such as a handful of raisins.\"Rene's son then fetched a completed pudding for the couple to compare next to the raw ingredients and mixture.\"They couldn't believe how different it looked,' Rene said. The couple then left for a traditional lunch with a seafood platter to start, followed by a duo of pork and chicken with gravy, bread stuffing and seasonal vegetables. The traditional steamed pudding was served for dessert alongside rhubarb and velvet custard.  Meghan's Korowai was custom created for her visit by Ngati Whakaue elder Norma Sturley, 66. She learnt to weave as a child - picking up the skill from her mother and grandmother - and has had her work included in national exhibitions. Having worked on it for two months whenever she has had time, she was up all  of last night to complete the last minute touches.The robe was made from harakeke (flax) cut and stripped by her English husband, Terry. He also plucked and washed pheasant feathers to adorn it with. The colour scheme reflected the Coat of Arms for the Duke and Duchess. Sign up for our newsletter, Your Royal Appointment, and receive exclusive royal news and analysis straight to your inbox every week.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}