{"id": "\nPablo Hernandez inspires Leeds United as they dispatch Ipswich to go top of Championship\n", "paragraph": "If Leeds are sometimes accused of living in the past, they only had to turn the clock back to August to return to winning ways and the top of the table.Kemar Roofe was named the first player of the month in this season’s Championship but injuries meant he and Pablo Hernandez had not started together in an eight-week spell, when Leeds only won two of nine games.As they were belatedly reunited, the striker opened the scoring and the Spaniard earned two assists. Leeds, who kicked off in fifth, leapfrogged four promotion rivals. If it was fitting Roofe took Leeds to the summit, Ipswich remain rooted to the foot of the table.“It is always important to be the first,” said manager Marcelo Bielsa. “Our team was constantly offensive. We had 10 clear chances to score.”They could have got more than two in a dominant display, with Ezgjan Alioski whipping a spectacular shot against the post from an acute angle and Ipswich goalkeeper Bartosz Bialkowski making fine saves from both the Macedonian and Adam Forshaw.Roofe had broken the deadlock with an emphatic header from Hernandez’s cross before captain and centre-back Liam Cooper supplied a classy finish to the Spaniard’s cutback.“He was very important,” added Bielsa. “He played as if he was never injured and he was very intelligent in his game.”Ipswich were outclassed. Paul Hurst had made seven changes after the 2-0 defeat to QPR, but got an identical result. He has a solitary win to his name and his position is coming under increasing scrutiny.Owner Marcus Evans is yet to reassure Hurst he has backing and the manager admitted he cannot ignore reports about his future. “Are they healthy? Realistically, no,” he said. “All you can do is focus on your job and if it is deemed not good enough, then so be it.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}