{"id": "\nLee Westwood and long-time caddie Billy Foster split as girlfriend Helen Storey retains role in wake of Sun City success\n", "paragraph": "Lee Westwood is set to stick with a winning team and retain his girlfriend as caddie after splitting with long-time bagman Billy Foster.Helen Storey was at Westwood’s side in Sun City as the 45-year-old won his first title in more than three and a half years and he joked afterwards that he would have ‘”to work out the percentages”. But back in Yorkshire, Billy Foster knew the sums exactly. A professional caddie would normally be entitled to 10 per cent of the winnings and as the first prize at the Nedbank Challenge was nigh on £1m, that would have amounted to £100,000.However, Westwood and Foster parted ways at the Turkish Airlines Open the previous week after the golfer had said he wished to the change the way the popular duo operated on course.“Lee wanted to work differently to everything we had ever done, which basically meant me just carrying the bag,” Foster said. “I struggled to adapt to that situation as a caddie, and it created a bit of an uncomfortable atmosphere on the course.“Ultimately it was no good for Lee and not fair on me either. So unfortunately the partnership had run its course and we both knew that.  Times change. It has been a great 10 years of my life with Lee and we had many special times and successes together.“I can only wish him good luck moving forward - although I do feel he could have waited more than a week before winning a million dollars!”Foster - who has also caddied for Seve Ballesteros, Darren Clarke Sergio Garcia, Thomas Bjorn and, very briefly, for Tiger Woods - will not be short of offers and inevitably there will be speculation that Rory McIlroy could be on the phone. Yet another option could be as an on-course analyst for Sky Sports, aping the employment of Jim “Bones” Mackay, Phil Mickelson’s former caddie, for the Golf Channel.Westwood and Foster first began working together 10 years ago, enjoying 13 wins and reaching world No 1, as well as recording eight top threes in the majors. But Westwood has been increasingly relying on his own expertise.He no longer uses a coach and, as Foster, has intimated he has been doing his own yardages. This has allowed him to bring in not only Storey but also his 16-year-old son, Sam, for the occasional week.Indeed, Westwood finished fifth at Valderamma last month with Sam as caddie and it would be no surprise to see him and Storey sharing the duties going forward.Storey, a personal training instructor from Newcastle, will again be on the bag in Dubai this week where Westwood at the very least will be looking for enough world rankings points to life him from 64th to inside the top 50 to earn a spot in next year’s Masters.Having made the decision to wait to launch his Ryder Cup captaincy bid until 2022, Westwood is clearly at peace on the fairways and enjoying the game again and this tremendous ball-striker should not be discounted at the Earth Course, where he has prevailed before.“Lee’s had a few close ones recently and –a second and a fifth – and I’m so proud of him and how he’s continued to play so well,” Storey said. However, she is not sure she has started a trend with wives and girlfriends caddying. “A few might and certainly there are some that won’t,” Storey said. “It just works for us. It really does. We don’t really talk too much about golf actually. It’s more a case of keeping up and staying out of the way; that’s the difficult part.“Afterwards, we stood in the tunnel when he was going to pick up the trophy and I was like ‘oh my god, he’s done it!” and the tears started to flow. I wasn’t going to hold them back.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}