{"id": "\nMoores the merrier as Baron Alco gets off to flying start\n", "paragraph": "Ryan Moore may have had a quieter year on the Flat than he has been accustomed to in recent seasons, but his father, Gary, and brother, Jamie, got their jump season off to a flyer when Baron Alco made all the running to win the BetVictor Gold Cup, the first major prize of the winter, at Prestbury Park on Saturday.It was a smart training performance on behalf of Moore to bring the seven-year-old back from a suspensory injury sustained at this course when a game second at the Festival in March 2017.Having resisted running him at the back-end of last season, he brought him back after 577 days at Chepstow five weeks ago. A bold ride from Jamie, who had noticed frontrunners doing well at this meeting, did the rest.He would not have been aware of the drama taking place behind him. Nine of the 18 starters came back without jockeys, with two down at the first and two at the last. The top weight, Frodon, who had been handy most of the way, too, just lost a length or two from the third last and, though he rallied up the hill, Baron Alco kept him at bay to win by two lengths.Guitar Pete, winner of the December equivalent of this race last year, was third with Mister Whitaker, the 6-1 favourite, fourth, having never really been able to get into the race.“I nearly took him out because I thought the ground was quick enough for him,” said the trainer, who did withdraw his other runner Benatar afterwards. “But the owners persuaded me to run, and luckily they talked more sense than me. But it’s testament to the horse and everyone at home who has worked on getting him back. He and Jamie are made for each other.”John Stone, whose silks he carried, has owned horses for 30 years but never enjoyed a success quite on this scale. “I’m thrilled to bits,” he said. “It’s wonderful. I couldn’t believe it would happen. He jumped like a stag.”The jockey praised the horse’s attitude. “He’s very genuine,” he said.“It’s hard to make all the running here, but I’d seen a few do it this weekend. Dad’s a mustard trainer – flat horses, jump horses, it doesn’t matter. He can train anything. He’s had winners at Royal Ascot and he’ll have winners at Lingfield and Kempton all winter. He’s going to win the Grand National next with Traffic Fluide.”The National is very much the target for Rock The Kasbah after the eight-year-old beat Royal Vacation and the 2015 Gold Cup winner Coneygree in the BetVictor Handicap Chase a length and a quarter and five lengths.“He’s the right type for it,” said Hobbs, who has twice been a runner-up in the Aintree spectacular.The sight of top weight Coneygree leading to the third last was heartening after he had pulled up on both starts last season. “He got tired but he had every right to,” explained trainer Sara Bradstock.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}