{"id": "\nOxford students vote to ban Christian group from college as it would threaten their ‘physical and mental safety’\n", "paragraph": "Students at the University of Oxford have voted to ban a controversial Christian group from one of their colleges because it would threaten their “physical and mental safety”.The JCR at Lady Margaret Hall voted overwhelmingly in favour of banning Christian Concern from hosting a residential summer camp on the premises because their values do not align with those of the college.Christian Concern members have protested outside abortion clinics and its founder Andrea Williams believes in the criminalisation of homosexuality.She has also claimed that the earth is only 4,000 years old, rather than the 4.5 billion years accepted by the science community.The group wanted to host its residential camp for young people, which aims to “train and equip the invited students on what it means to proclaim Christ in public life,” but JCR members voted to reject the residency by a margin of 81 votes to eight, with two abstentions.According to the student newspaper OxStu, “members of the JCR who spoke in the debate recognised Christian Concern as a “real threat to the physical and mental safety of students”. One student made the point that “we’re inviting them into our home and we can’t invite people who stand against our values”.The debate was consultative, but the college’s governing body will make its final decision next week.The move is understood to be driven by LGBT students who say they wouldn’t feel so welcome at the college gave a platform to people who are openly homophobic.There is a perceived physical threat because of the organisation's alleged history of harassment in protesting outside abortion clinics.The camp is supposed to take place next summer, before term starts but no fixed date has been set. Although the vast majority of students will not be at the college, some will be on site doing research projects. There are also around 60 postgraduates who live permanently on site.In a statement to The OxStu, an Oxford student newspaper, a JCR spokesperson said: “The JCR met to discuss, and passed a motion that they opposed the group coming. However, until a decision is made, it would not be appropriate to comment further”.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}