{"id": "\nJurgen Klopp keen to avoid off-field drama in Belgrade and may leave Xherdan Shaqiri behind in Liverpool\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nLiverpool manager Jurgen Klopp is seriously considering omitting Xherdan Shaqiri from his Champions League squad in Belgrade.Klopp will confirm the travelling party on Monday and is yet to make a final decision, but he is leaning towards leaving the Swiss star on Merseyside.He is concerned Shaqiri’s inclusion may be a distraction given the hostile reaction he has received from Serbian fans. Leaving Shaqiri behind ensures the fixture does not become embroiled in a political debate.Shaqiri is sure to be targeted by Red Star fans if he appears on Tuesday. The bad blood goes back to the World Cup.The 26-year-old was born in Kosova, a state whose independence is not recognised by the Serb government. When Shaqiri made a point of celebrating his heritage – he wore the Kosova flag on his boot when playing for Switzerland – he was accused of provocation.Although Red Star fans were banned from Anfield when the teams met a fortnight ago, those who found their way in jeered whenever Shaqiri took possession. It was a preview for what would be in store on Tuesday.Klopp said he would investigate the background before making a decision, and he has been wrestling with the pros and cons of including the winger.His decision will not be based around security or safety fears, but more whether it will generate a circus around the game. Shaqiri said after the last Champions League game he had no concerns about travelling.“I just go there to play a football game,” said Shaqiri. “It is not about politics it is about football. I worry about nothing and go to play. “I had this already at the World Cup so I know I can handle this no problem.”Liverpool travel to Belgrade with Klopp upbeat despite falling two points behind City in the title race, the manager believing too much is being read into the outcome of every game at this stage of the campaign.“Your job is to make a final of each game so if we lose at Arsenal then the whole start was average or worse,” he said.“If we lose at Belgrade then it’s football, it can happen. We have to have to look at that a bit calmer. It’s very important on Tuesday. It will not be a children’s party, it will be really tough and we have to be ready for that. But it’s our life, it’s not a problem, we take it and analyse and go in the next game, find the line-up, the right line up and everything is good.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}