{"id": "\nWayne Rooney: Former England stars resent current side's success\n", "paragraph": "Wayne Rooney has revealed how retired England players from his generation have expressed bitterness over the recent success of Gareth Southgate’s side.The former captain, who picked up his final cap in a stage-managed Wembley send-off against the United States, said he had spoken to players who could not handle the team’s progress.“They can’t come to terms with England doing well,” he said. “It’s wrong. I am a fan and I want England to do well.”There will be no such future resentment from Rooney who flew back to the US last night and will watch Sunday’s match against Croatia from the comfort of his settee at his home near Washington DC. He insisted he would be equally proud to see England win a trophy as a supporter as he would have been as a player.Rooney cannot re-evaluate his own career with regret. “I can look back and say to myself that I gave everything. It didn’t always work or pay off, but I did give everything I could to make England successful,” he said. “I had my time. It didn’t work out as hoped in terms of trophies, but I’m happy with my international career and I’ll always look back on it as a proud achievement.”Rooney, now winding down his illustrious career at DC United, struggled to make much headway after being introduced in the 58th minute on Thursday, but the other members of the squad enjoyed having their record goalscorer back. He said he had given Jadon Sancho words of encouragement before kick-off. “He is a fantastic talent,” Rooney said. “I spoke to him before the game and he said he was nervous, which is normal.”Sancho’s man-of-the-match display reminded Rooney of his own teenage years that catapulted him to superstardom. The veteran striker said he had told the 18-year-old before kick-off: “Have an impact, have a few moments on the pitch when people remember that moment.” Rooney added: “He certainly did that.”The 33-year-old was in particularly candid mood in his final meeting with reporters at Wembley, describing how he had registered some of the negative reaction to the decision by the Football Association to hand him a 120th cap. Comparing the decision to pick him with people’s responses to the Uefa Nations League, he said: “It’s new and people have different opinions.”There was no sign-off goal No  54 for Rooney as he finally walked away into the Wembley night. “It was a nice send-off and it was a great way to say thank you to the fans, a proud moment for myself and my family, and it’s something I will remember for a long, long time,” Rooney said.“I am proud to have played for England so many times.” But he added: “I’ve had my time. I’m happy with what I’ve contributed to the national team and I look forward to the next few years and watching this young team impress.”The former Manchester United man said the potential in the team was “huge”. “In a strange way, the game against Spain will give them more confidence than the World Cup, because it’s a massive result to win away in Spain,” he added. “To be around them and see how they have developed and see how Gareth is coaching them is great.”Rooney said the side were a match for previous sides, which included the likes of him, Steven Gerrard, Frank Lampard, Paul Scholes and Rio Ferdinand. “This team’s got superstars. It’s got a leading goalscorer for years, in Harry Kane; [Raheem] Sterling; John Stones at centre-back – names in world football … I’m seeing first hand that they are getting coached right. The right ideas, but they are responding really well to it so, hopefully, these can be the ones to bring the next trophy home.”He added: “I’m excited for them all because I’m a fan of England. I’m excited for England. It’s a great opportunity for these players to go that next step. They’ve already done that in getting to a semi-final but they can’t sit there and say we were the team along with 1990 who got to the semi-final. They have the potential to go further and I know from the mentality of the players, even though they are young, the mentality is right. They will be pushing for more.”With 32 minutes left of the 3-0 win against the US, Rooney replaced goalscorer Jesse Lingard, who said: “Just to have his presence around the squad these past few days has been great. He’s brought his experience to the team. Everyone has looked up to him … He’s reiterated that he was very impressed with us in the summer. It put a spring in everyone’s step and got everyone excited.”The current captain Harry Kane made the surprise admission that he as a child he would cry every time England lost a game, something that has not been forgotten by his family who are keen to see whether he does the same when he marries his long term partner Katie Goodland.“It [the crying] does come up. I always wind my missus up that I’d cry if we won a trophy with England. And she said if you don’t cry when I walk down the aisle, she won’t go through with it. I’m not a crier, I’m not someone who cries a lot. My missus has probably never seen me cry. So we’ll have to see what comes first, that or an England trophy.”Kane will captain a much-changed side from the one that beat the United States 3-0 on Thursday night with Dele Alli likely to have to settle for a place in the bench and Ross Barkley starting in midfield. Only Jordan Pickford from the XI that began the game against the US is expected to start. Southgate said that Jadon Sancho’s performance, however, had given him reason to question his original plan.Kane has not scored in seven games for England going back to the World Cup second round game against Colombia. He said that he was hopeful that he could one day break Rooney’s 53-goal record for England over 120 caps – the former captain once went nine games without scoring in 2010.Kane said: “I always want to score in every game I play. I have showed my game is not just about scoring goals but there is nothing more I want to do than score and win the game. Hopefully, I can do that but if not, I will do everything I can to help the team, get an assist and bring other players into the game. It would be the perfect end to the year if we win and I grab myself a goal.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}