{"id": "\nCalifornia metal band played to audience of four after faking army of fans to secure UK headline tour\n", "paragraph": "With hundreds of ticket sales, legions of social media followers and adoring messages posted online from teenage fans, Californian metal band Threatin appeared more than ready to conquer the UK music scene.Venue managers liaised with an apparent booking agent and record label, gladly signing them up in the hope of sell-out crowds.The reality was a rather different story. This band was unknown, they had no fans and no management. They toured the country playing to completely empty gig venues and as they did so last week,  their story began to unravel.The band, and in particular the sole permanent member Jered Threatin, has been accused of creating a fake legion of fans in order to land the UK tour.Rob Moore, singer and guitarist in hardcore punk band Dogsflesh, which supported Threatin in Newcastle to an audience of four people, said: “The effort that he's gone to to portray himself as a big star is quite phenomenal.\"In all the years I've been involved in music I've never known anything like this.”It was a similar story in London, where Threatin had allegedly claimed to have made nearly 300  advanced ticket sales. In Bristol, the audience consisted solely of the support bands and staff, it is claimed, and Mr Threatin was forced to go to a cash point and withdraw hundreds of pounds to pay the venue hire costs.“It's a really extreme version of 'fake it til you make it,” venue manager Iwan Best said.The band Kamino, which supported Threatin in Bristol, said they began to do their own digging and allege that the entire tour was based on fabrications stemming from paid social media “likes” for each show.“Having delved deeper we realised the same practices were in place on his YouTube channel, his Facebook page, even on previous US tour dates listed on his website,” they wrote online.“And when looking more closely at his website - all the industry contacts listed don't exist. Essentially, the entire history of Threatin is a lie.”Mr Threatin - whose real name is not known - has not responded to requests for comment. He cancelled his last UK performance in Belfast on Sunday November 11, and all of the band’s social media accounts have been locked or disabled.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}