{"id": "\nPrimary school headteacher accuses parent of defamation after she posted daughter's homework on Facebook\n", "paragraph": "A primary school headteacher has accused a parent of defamation after she shared a photo of her daughter’s incoherent homework sheet on Facebook.Danielle Rowland, a parent at Moorgate Primary Academy in Tamworth posted the photo of a crossword strewn with grammatical and spelling errors which had been handed to her seven-year-old daughter with the caption “For literacy homework, the mistakes are shocking.\"Headmaster Jonathan Williams confronted Ms Rowland on the phone and told her the post was defamatory towards the school and that it breached data protection guidelines.The crossword instructions said: “Complete the crossword by interesting one of the words below into the sentences.”The crossword itself was hard to decipher as the only place where ‘on the contrary’ would fit was in a sentence that contained no contradictions.The word ‘although’ would seemingly not fit where it should have been, because the sentence would read: ‘Although they had are prone to earthquakes, they do not have tremor proof houses.’Speaking to the Telegraph, Rowland, who has three children at the school said: “I posted the picture on Facebook to see if any other parents were having difficulty with the homework. It got picked up by a few people and I spoke to the headmaster about it on the phone.“He asked me to take it down because it is defamatory towards the school and that he would have to speak to the data protection officer if she refused.“I was disappointed, because you’d think a teacher would have a sense of pride in what they are doing. Things like this actually damage a child’s education.”It was unclear who had set the crossword, but it is understood that they have been spoken to by senior staff at the school.Last night, Mr Williams told the Telegraph: “The academy accepts that the homework provided did include some errors.  “Whilst this is an unfortunate and regrettable incident, it has been appropriately addressed and the school shall continue to support learning at home.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}