{"id": "\nJames Forrest double helps Scotland beat 10-man Albania and edge closer to Nations League play-off place\n", "paragraph": "Scotland are within 90 minutes of a Nations League play-off spot after an emphatic win over 10-man Albania at the Loro Borici Stadium.Ryan Fraser’s first international goal after 14 minutes gave the visitors the lead before home captain Mergim Mavraj was sent off six minutes later by referee Vladislav Bezborodov for a headbutt on Ryan Christie.Steven Fletcher scored with a penalty just before the interval and James Forrest grabbed a double in the second half, his first two goals for the national team, as the Scots coasted to three valuable Group C1 points.They may have had a man advantage for the majority of the match but it was a morale-boosting win for Alex McLeish’s side, who moved on to six points with Israel. A win of any kind against Israel at Hampden on Tuesday night will secure a play-off place for the 2020 European Championships.McLeish said: “This win gives us a fantastic fillip ahead of a game against a decent team. We have a job on our hands but the players should take a lot of confidence from tonight.”Hamburg defender David Bates, a late call-up, was handed his debut in an attacking line-up. He partnered Scott McKenna, with Cardiff attacker Callum Paterson in at right-back. Sheffield Wednesday’s Fletcher was asked to lead the line, supported by Forrest and Fraser. The Bournemouth winger’s goal came when he took a pass from midfielder Christie, turned on to his right foot inside the box and curled the ball past keeper Etrit Berisha.However, when Mavraj was dismissed for putting his head on Christie, when play was stopped for the captain’s foul on Forrest – he was shown a yellow then a red – the game had turned Scotland’s way.Albania manager Christian Panucci replaced Ergys Kace with Ardian Ismajli in a reshuffle. But, seconds before the interval, after Christie had been fouled by Ismajli, Scotland doubled their lead. Stuart Armstrong’s free-kick was judged to have hit the hands of Rey Manaj – perhaps fortuitously for McLeish’s men – and Fletcher sent Berisha the wrong way with his spot-kick.Ten minutes into the second half, Forrest raced through the middle on to a Christie pass and beat Berisha with a right-footed drive.The next goal came after 67 minutes when Fraser set up Forrest to skip past defender Frederic Veseli and volley in from 12 yards.Albania (3-5-2) Berisha; Mavraj, Djimsiti (Dermaku 53), Veseli; Binaku, Memushaj, Xhaka, Kace (Ismajli 27), Uzuni; Grezda, Manaj (Balaj 62).  Booked Manaj, Mavraj, Grezda.  Sent off Mavraj (22). Scotland (4-4-2) A McGregor (Rangers); Paterson (Cardiff), McKenna (Aberdeen), Bates (Hamburg), Robertson (Liverpool); Armstrong (Southampton), C McGregor (Celtic), Christie (Celtic), Forrest (Celtic); Fletcher (Sheffield Wednesday), Fraser (Bournemouth). Subs McTominay (Manchester United) for Armstrong 61, Phillips (West Brom) for Fletcher 68, Russell (Sporting Kansas City) for Fraser 72.  Booked: Paterson, McKenna, Bates, Russell.Referee Vladislav Bezborodov (Russia).© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}