{"id": "\nAnjem Choudary shunned by imams who say he's not welcome at scores of mosques\n", "paragraph": "Anjem Choudary, the Islamist hate preacher, has been told he is not welcome at scores of mosques across London following his release from prison, the Telegraph can reveal.The 51-year-old, who was freed from jail, is only permitted to attend a single place of worship that has been approved by officials from the Ministry of Justice.Choudary was asked to submit a list of mosques he wished to visit, but when they were approached by the authorities asking if they objected to him attending, many of the imams said he would not be welcome.Other mosques in the capital also contacted officials ahead of his release to say they did not want him turning up at their premises.A source said it was clear the Muslim community held Choudary in as much contempt as everyone else.“As part of his strict licensing conditions, Choudary is only permitted to attend one mosque that has been given prior approval,” the source said. “He was asked to submit a list of his preferred options and then they were asked if they would be willing to accommodate him.\"However it was clear that many of the mosques he wanted to visit did not want him mixing with their worshippers.\"Eventually a suitable mosque was found and the controversial cleric was whisked from his north London probation hostel to the place of worship. He returned at 9pm.Disapproval for the preacher from fellow Muslims is reminiscent of a number of YouTube video posted before his incarceration in which the preacher was berated by other Muslims who claimed his brand of extremism was not welcome within their community.Outside his probation hostel in Camden, one fellow resident emerged explaining how Choudary had not made any friends within the unit.“A few of us are really shocked to see this guy living here,” he said. “They should put him somewhere else. He’s not made any friends yet. He’s keeping himself very much to himself.“It’s very strict, everyone has separate rooms. They do random room checks to see what we have. There’s certain stuff we’re not allowed to have - like drugs and things that contravene the hostel’s health and safety rules.”Choudary is understood to be staying in a room with a single bed and television within the six-storey hostel. He has access to a communal television room, shared kitchen and washing facilities.Another inmate said he had seen Choudary in the block. However, Choudary did not emerge from the building and was understood to be staying in his room.A handful of supporters of the Far Right activist Tommy Robinson had also gathered at the bail hostel before leaving around lunchtime.One man, who did not want to be named, said: “I’m just down here to see what scum we have in the neighbourhood now.”The father of five is understood to have applied for legal aid to try to fight the strict 25 rules that limit his movements and actions while serving the rest of his prison term on release from prison.They include what mosque he can visit, whom he can associate with and that he should not use the internet or speak to anyone aged under 18.It is believed that the human rights lawyers Birnberg Peirce, who are acting for him, has written to the Ministry of Justice claiming the restrictions breach his human rights.If he breaks the conditions he will be returned to prison to complete the remaining half of his five-and-a-half year sentence for pledging an oath of allegiance to Islamic State of Iraq and Levant (Isil).He was released from Belmarsh prison after serving half of his sentence. Despite being accused of radicalising numerous young Muslims, some of whom committed terrorist attacks here and abroad, Choudary was only convicted of one terrorism offence, that of inciting support for Isil.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}