{"id": "\nHow Bernard swapped bombings, revolution and a war zone for life at Everton\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nAfter he had to flee war-torn Eastern Europe, the Premier League feels like an oasis of calm to Everton midfielder Bernard.Bernard’s arrival at Shakhtar Donetsk coincided with bombings, revolution, war and relocation to a stadium 600 miles away to play “home” fixtures. Amid the years of chaos and terror in Ukraine, one date stands out. On July 17 2014, a surface-to-air missile killed 283 passengers and 15 crew aboard Malaysia Airlines Flight 17 travelling from Amsterdam to Kuala Lumpur.“The plane was shot down close to where I was living with my parents,” recalls Bernard. “It was when I was at the World Cup in Brazil in 2014 this all started. I heard rumours about the bombs and war.“The situation was hard and tense. I was very young when I moved to Shakhtar Donetsk and it was in the first season the war broke out. We had to change our city and move to the capital [Kiev] and lost the infrastructure we had – the training base – and had to fly to every game. It was a big learning experience over five years.”Bernard recalls the sense of fear and panic. “There is no doubt about it. There were blockades to enter and exit the cities. Cars were searched for bombs and weapons,” he said.“There were many players who lost their houses and flats. A lot of the South American players wanted to break from their contracts and went to the courts. A lot of the appeals were lost. I did not try to leave but a lot of people wanted to flee the city. Many did not have the money to leave. A lot of people died in the war.”Bernard appeared in Brazil’s 7-1 semi-final defeat by Germany at the 2014 World Cup. For context, the match took place nine days before the Malaysia Airlines plane was shot down. Ukraine was already at war. Bernard, 22 at the time, had more on his mind than football that summer. He has not been picked for his country since. That is something he hopes to rectify by excelling in England.“I am sure the majority – if not all players – want to be playing here. It is the best league in the world,” he said. “Ever since 2014, it’s been my dream to return [to the Brazil team] but in order to get back I have to be playing well here and adapting to the way Everton play. I just need to put in the effort and hard work here to help Everton. Hopefully, an opportunity will come up in the future.”After consistent links to the Premier League, Bernard finally left Donetsk to become one of Marco Silva’s first recruits, promising the attacking midfield guile Everton have been craving.There are tentative comparisons to David Silva, perhaps due to the diminutive stature (5ft 5in) as well as his position and skill. There was a time that was not the compliment it is today.“I have always faced prejudice for my height and physique,” he said. “At Atletico Mineiro [his first club in Brazil], I was released on two occasions. Obviously, this caused me some concern but I did get another opportunity and once I started playing, I improved. I just had to show my qualities every day in training and in all games, because I knew this would be a problem I would face on a daily basis.By @ToffeeAnalysis pic.twitter.com/o0FS18gDu3“I’ve always followed my dad’s advice to overcome the problems of height and physical-related issues I might come across. I can use my qualities to compensate for any of these physical issues, so it’s not a worry for me. On the pitch, if you are quick with your feet and your mind, these small margins can make a difference.”Bernard also benefited from a high-profile advocate of his ability during his formative years. “Playing alongside Ronaldinho was important for me because he was always an idol of mine and somebody that I’d followed,” he said. “He offered me advice and help that has served me well throughout my career to this day.“I’m really grateful for him and I’m thankful to God for being given the opportunity to play alongside him. We won an important competition together, the Copa Libertadores, so I started my career alongside him.“I’m grateful to have been a team-mates of his. Even though it was at the latter stage of his career, he was still very dedicated and it was important for us to have him in our team.”Since his move to Goodison Park, injuries have been the biggest concern to the 26-year-old. Now fit, he is reassured his only anxieties are related to sport rather than security. “The only thing I have to worry about here is playing football,” he said.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}