{"id": "\nDonald Trump says US to withdraw from nuclear weapons pact due to Russian violations\n", "paragraph": "Donald Trump on Saturday announced the US is to pull out of a landmark nuclear agreement with Russia, accusing the Kremlin of violating its terms.Mr Trump did not offer specific details on how Moscow had violated the 1987 Intermediate-Range Nuclear Forces Treaty, but during the past four years America has repeatedly argued that Russia has been in breach of the agreement with its aggressive actions against former Soviet states in Europe.\"Russia has violated the agreement. They have been violating it for many years,\" said Mr Trump after a campaign rally in Nevada. \"And we're not going to let them violate a nuclear agreement and go out and do weapons and we're not allowed to.\"Mr Trump hinted that the only way forward might be to include China in a new treaty.\"We'll have to develop those weapons, unless Russia comes to us and China comes to us and they all come to us and say let's really get smart and let's none of us develop those weapons. But if Russia's doing it and if China's doing it, and we're adhering to the agreement, that's unacceptable,\" he said.Mr Trump's announcement came as his national security adviser John Bolton was heading to Russia to meet officials.  The historic 1987 treaty was followed by a landmark meeting between President Ronald Reagan and Russian leader Mikhail Gorbachev.It was seen as a key step in ending the Cold War and some fear that withdrawing from the pact will fuel increased weapons development between China, Russia and the US.The agreement was designed to help protect the security of the US and its allies in Europe and the Far East.It prohibits the United States and Russia from possessing, producing or test-flying ground-launched cruise missiles with a range of 300 to 3,400 miles.However it also curbed America's ability to respond to Chinese activity in the Western Pacific, including its attempts to keep American naval forces at bay.As China was not a signatory to the treaty it has faced no limits on developing intermediate-range nuclear missiles, which have the potential to travel thousands of miles.Mr Trump's recent predecessor Barack Obama chose not to exit the nuclear agreement because of objections from European nations, in particular Germany, and due to fears of a renewed arms race. However Mr Trump's senior staff, including Jim Mattis, defence secretary, have repeatedly broached the subject in recent weeks, highlighting Russia's \"untenable\" violations of the agreement.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}