{"id": "\nRoger Federer given unfair benefits, complains former French Open doubles champion Julien Benneteau\n", "paragraph": "As Roger Federer prepared for a match that could potentially expel him from the Nitto ATP Finals, concerns were raised about the preferential treatment he received at the biggest tournaments this year.In an interview with the French radio station RMC, Julien Benneteau, the former French Open doubles champion, complained that Federer was so powerful that he carried undue influence within the game.In particular, Benneteau drew attention to the nexus formed by Team8 – Federer’s management company, which is fronted by his agent Tony Godsick – and two of the biggest national tennis associations. There are conflicts of interest, he suggested, in mixing sporting and commercial connections in this way.In 2017, Team8 launched the Laver Cup – a high-profile exhibition in September – with substantial investment from Tennis Australia. The event also has the backing of the United States Tennis Association, although the All England Club have been sceptical.“Roger is a legend of the game, an icon,” said Benneteau at the weekend. “Now, when he promotes the Laver Cup, there are a number of conflicts of interest that have become disturbing.“With regard to the new Davis Cup, he says nothing about the date in November. When the date of September was mentioned [which clashes with the Laver Cup], he woke up and opposed Gerard Pique [the frontman behind the new Davis Cup] which is where I find that the tennis authorities are incredibly weak. His thing, it’s an exhibition, there is no sporting criteria in the selection. It gives $750,000 to Nick Kyrgios. Yes, those are the rates.“Another thing: in the organisation of this event, there’s Craig Tiley, the boss of the Australian Open, who deals with marketing and TV rights. He is paid by Roger Federer’s agent and on the back of that, as luck would have it, Federer played 12 of his 14 matches at 7.30pm [when temperatures are cooler].“This year, the US Open was inaugurating the new Louis Armstrong Court, [and] it seems that Tony Godsick went to the umpire’s office to in effect say ‘No way are you scheduling him here!’ It is normal that he should have privileges but there has been a slight excess.”A spokesman for the US Open said: “Not sure if there needed to be a conversation on this as we had planned to put Roger in Ashe for all his matches. Serena Williams and Rafael Nadal as well.”Godsick was contacted for comment.Did this alleged preferential treatment extend to the final of January’s Australian Open? That match brought Federer his 20th major title, but also caused controversy when the roof of Rod Laver Arena was shut before play started, even though the temperature in the stadium had not reached the 40-degree mark stipulated by the tournament’s heat rule.The runner-up that evening was Marin Cilic, who was asked last night whether he felt that Federer had received special dispensation. “It is tough to say,” replied Cilic, soon after he had lost his opening match here to Alexander Zverev 7-6, 7-6. “Roger is very popular. Night matches are always something the tournament wants him to play.“I was just not happy at the end of the tournament in Australia because they changed the rules. That was the only part that didn’t go well by the referee’s side. I don’t think they were going one way or the other, for me or for Roger. I felt that in that part they need to be consistent.”Federer is due to face Dominic Thiem tonight, after his opening match on Sunday ended in an uncharacteristically error-prone defeat at the hands of Kei Nishikori. “There is a little bit of the yips coming in to play,” said commentator Annabel Croft yesterday on Sky Sports. “At the moment, you feel he [Federer] is stuttering and thinking about so much, even in the basic groundstrokes.”Meanwhile, the new world No. 1 Novak Djokovic was untroubled as he swept to a 6-4, 6-3 win over John Isner in just 1hr 13min.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}