{"id": "\nXherdan Shaqiri is again Jurgen Klopp's red star as Swiss pulls strings in Liverpool midfield\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nXherdan Shaqiri weighs passes with such accuracy he could be carrying scales in his boots.The idiosyncrasies of some modern data collection means Shaqiri will be credited with only one assist for his performance against Red Star Belgrade.He deserved two just for Roberto Firmino’s opening goal, his first contribution such ex-team mate Charlie Adam must surely have been left wincing.It was Adam who expressed such surprise when Shaqiri was signed by Liverpool last summer, hinting at poor attitude and lack of application when those Tuesday nights got darker and colder at Stoke City.A stretch of imagination is needed to believe Shaqiri has undergone such a personality transplant tracking back and stealing possession is a trait he only developed when driving through the Shankly Gates.Shaqiri's diligence was the catalyst to Liverpool’s opening the scoring, even if the subsequent pass he slotted through to Andy Robertson for a decisive cross to Firmino was more eye-catching.Better was to come. Shaqiri’s touch for Liverpool’s second – scored by Mohamed Salah just before half-time – was exquisite, a controlled nudge for the Egyptian to blast in with his right foot.Following his match-winning pass to Salah at Huddersfield last weekend, these were moments to demonstrate Shaqiri has truly arrived at Liverpool.The prolonged hug he received from Jurgen Klopp upon being subbed on 68 minutes underlined the German’s enthusiasm for the performance with and without possession.Maybe the stage is bringing more application from Shaqiri. The talent has always been there, but disappointing spells at Bayern Munich and Inter Milan hinted at a lack of maturity.Klopp spent pre-match discussing the prospects of another summer recruit, Fabinho, referencing how Alex Oxlade-Chamberlain needed time to adjust to the pace and responsibility required to wear a Liverpool shirt.In many respects, Shaqiri is a more valid point of comparison, the natural talent always visible but place within a team structure less so. Klopp does not yet fully trust Shaqiri in a three-man midfield. Fitting him into a 4-3-3, the deepest creative element, is the next step. Liverpool will carry greater resemblance to last season when that happens.Instead, Klopp is readjusting his formation to suit the Swiss international, on this occasion Shaqiri drifting from the right to assume playmaking responsibilities and give the kind of selfless, creative performance that bodes well for further contributions.One of the most curious games at Anfield this season was against Southampton, when despite being every supporters’ man-of-the-match thanks to another couple of assists, Shaqiri was substituted at half-time.Klopp’s explanation was the defensive midfielders were left overworked. He last longer here, not only to receive the applause from The Kop, but surely because he is guaranteed to start against Cardiff this weekend.Shaqiri will have spent most of his first few months at the club not just mastering his deadball skills, but adjusting to knowing when to press high and scurry to protect his midfield.Oxlade-Chamberlain’s transition last season makes for a reassuring template.Want the simple explanation why the link between Liverpool’s midfield and attack has not been functioning so vibrantly this season? It is Oxlade-Chamberlain’s residency in rehabilitation.By the time he seriously injured his knee in the Champions League semi-final last April, Oxlade-Chamberlain was starting to evoke images of Steven Gerrard with complete midfield performances, assisting, scoring and tracking back.So good was he a few months after moving from Arsenal, no-one was mentioning the void left by Phillipe Coutinho’s sale to Barcelona. The transition was seamless. In fact, Liverpool looked more balanced.Despite their excellent start to the season, Klopp has been searching for the same equilibrium between attack and defence since. Results suggest he has it already, but Liverpool went into Wednesday night’s game in the midst of a somewhat contrived debate about whether they are winning by enough rather than winning enough.On this evidence, Shaqiri is the solution. At the very least, he does not look like he will be merely a bit-part player in Liverpool’s twin assault in the Premier League and Europe.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}