{"id": "\nGovernment under pressure to use Salisbury sanctions against Saudi officials after Khashoggi killing\n", "paragraph": "Saudi officials found to have been involved in the killing of a prominent journalist in Turkey should be targeted by new sanctions introduced by Theresa May in the wake of the Salisbury attack, MPs and campaigners said on Saturday.Andrew Mitchell, the former international development secretary, led calls for the Magnitsky law, which mirrors similar legislation in the US and Canada, to be used against any individuals complicit in the death of Jamal Khashoggi. The intervention came as the government said it was \"considering ... our next steps\" after the kingdom admitted on Friday night that Khashoggi, a columnist for the Washington Post, was killed in its consulate in Istanbul.Donald Trump said sanctions were a possibility and that questions remained about the Saudi handling of Khashoggi's death.\"No, I am not satisfied until we find the answer,\" he said after a campaign speech in Nevada. \"But it was a big first step, it was a good first step. But I want to get to the answer.\"However, he warned against scrapping an arms deal with the kingdom that would jeopardise thousands of American jobs.Saudi Arabia said that 15 members of an intelligence squad who flew to Istanbul to kidnap Mr Khashoggi had been arrested, along with three Saudi consulate staff.General Ahmed al-Assiri, the deputy intelligence chief, and Saud al-Qahtani, a close aide to Mohammed bin Salman, the crown prince, were both sacked for their role in the operation.Saudi officials insisted Crown Prince Mohammed was not involved.The kingdom said Mr Khashoggi, a prominent Saudi critic, died in a \"fist fight\" but Turkey said it would keep investigating and would not a allow a cover up.The Magnitsky law, which was passed as part of the Sanctions Act in May, allows the government to target human rights abusers with asset freezes and visa bans.Mr Mitchell, the former international development secretary, who lobbied Mrs May to introduce the measure after Russia's chemical weapons attack on a former spy in Salisbury, said: \"The Magnitsky law is designed to stop human rights violators coming to and using Britain and it doesn't matter where they come from, the law should be applied without fear or favour.\"It's very important that Britain acts in concert with its friends and allies around the world.\"Bill Browder, whose campaigning led to the adoption of equivalent legislation in the US, Canada, and several EU countries, told The Sunday Telegraph: “The extrajudicial killing of Jamal Khashoggi and the official cover-up is exactly the kind of situation that Magnitsky sanctions were designed to address.“The British government should use the Magnitsky Act against members of the Saudi regime who played any role in this murder.\"Saudi Arabia's official explanation of a brawl was greeted with scepticism around the world.Germany, France and the European Union all urged an in-depth investigation to find out what happened to the Washington Post columnist after he entered the consulate on October 2 for documents for his marriage.Angela Merkel, the German chancellor, in a joint statement with her foreign minister, said the Saudi explanation was not enough.\"We expect transparency from Saudi Arabia about the circumstances of his death ... The information available about events in the Istanbul consulate is inadequate,\" the Germans said© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}