{"id": "\nSchool which taught that only Muslims were saved on Noah's Ark is first to be fined for opening illegally\n", "paragraph": "An Islamic school which taught that only Muslims and animals were saved on Noah’s ark has become the first to be successfully prosecuted for operating illegally.The Al-Istiqamah Learning Centre in west London marketed itself as a study centre where home-educated children had part-time tuition, but Ofsted inspectors found that almost 60 children of compulsory school age were regularly attending the centre during school hours.The case was referred to the Crown Prosecution Service after the centre failed to respond to Ofsted’s warning notice in November 2017.Director Nacerdine Talbi and Headteacher Beatrix Kinga Bernhardt have now become the first people convicted of running an unregistered independent school and were each given a three-month curfew and ordered to pay a total of £970 towards costs. The school has also been fined £100.HM Chief Inspector Amanda Spielman welcomed the verdict and said that it sent an important message to other unregistered schools, some of which she said deny children a proper education and leave them at risk of harm and, in some instances, radicalisation.While Ofsted said the centre did not solely teach religious education, photographs on the school’s website appear to reveal a focus on Islam.One photograph of a child’s homework showed a question sheet about Noah and the ark.Noah is identified as a prophet of Allah, who built an ark and saved only Muslims and animals. A question which asked why Allah punished the people was answered: ‘they disbelieved’.Other examples of Islamic-focused tuition include poems thanking Allah for providing grapes and a letter written by a student to a teacher in which he draws a mosque and writes: “Thank you for helping me. May Allah reward you!”Mr Talbi told the court the teaching of children never exceeded 18 hours at the centre's doors which were open between 9am and 2pm.He said he felt 'intimidated' by the Ofsted visits, adding: “They didn't give me a chance to explain how the centre is run.“I believe that by the DfE advice, guidelines that I don’t need to register. I follow the advice,” he said.At Westminster Magistrates court, Chief Magistrate Emma Arbuthnot said: “I have no doubt from the documents exhibited that the academic year at the centre is a ten month year. The fees being charged were £230 per month for primary school age pupils and £250 for secondary school age and envisaged a ten month year.”As such the centre was \"being operated as an unregistered independent educational institution providing full-time education\".These are the first convictions under section 96 of the Education and Skills Act which came into force in 2008.Speaking after the judgement, Amanda Spielman said: “I am glad the courts have recognised our serious concerns about unregistered schools. These schools deny children a proper education and leave them at risk of harm and, in some instances, radicalisation. “We hope that the judgement sends out a message to all those running such schools that they will face justice. We will continue to investigate and expose illegal, unregistered schools and where we find them, play our part in making sure they are closed or become properly registered.“Further action is needed now to protect the children who attend these settings. As I have said before, Ofsted need proper powers so that we can make sure all children receive a decent education that prepares them for life in modern Britain, and keeps them safe from harm.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}