{"id": "\nAntibiotics may cause obesity in young children, new study finds\n", "paragraph": "Young children prescribed antibiotics or drugs to curb excess stomach acid are more likely to become obese, a new study warnsResearchers say that the drugs, particularly if taken for lengthy periods, may alter gut microbes associated with weight gain.They found that youngsters taking antibiotics and, to a lesser extent, drugs to curb excess stomach acid, may be at heightened risk of becoming unhealthily overweight.The composition of gut bacteria - known as the microbiome - has been linked to various aspects of human health, including obesity.And certain drugs, such as antibiotics and acid suppressants - histamine 2 receptor antagonists (H2RA) and proton pump inhibitors (PPIs) - can alter the type and volume of bacteria in the gut.To find out if exposure to such drugs in early childhood might increase the risk of obesity, the researchers looked at the medicines prescribed to 333,353 youngsters, whose medical records had been input into the US Military Health System database between 2006 and 2013, in the first two years of their lives.In all, 72.5 per cent had been prescribed an antibiotic; just under 12 per cent an H2RA; and just over three per cent a PPI during that period. a total of 5,868 children were prescribed all three types of drug.Just over 14 per cent of the children became obese, of whom 11 per cent had not been prescribed any antibiotics or acid suppressants.A prescription for antibiotics was associated with a 26 per cent heightened risk of obesity, according to the findings published online by the journal Gut.Study author Dr Christopher Stark, of William Beaumont Army Medical Centre in Texas, said: \"There is an important therapeutic role for microbiota-altering medications.\"The long term risks to health must be weighed against the short-term benefits.\"But the researchers also pointed out that over prescription of both antibiotics and acid suppressants, including in young children, is \"a significant problem.\"© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}