{"id": "\nThe Duke of Sussex pips the Queen to take 'Most Popular Royal' crown, according to survey\n", "paragraph": "Prince Harry is the most popular royal, according to a new You Gov survey.The Duke of Sussex beats the Queen to first place, with 77 per cent of the public having a positive opinion about the father-to-be, ahead of 74 per cent for the monarch. Prince William is in third place with 73 per cent.The Duchess of Cambridge is the second most popular woman in the Royal Family, with 64 per cent, while the Duchess of Sussex came sixth with an approval rating of 55 per cent - a percentage point less than 97-year-old Prince Philip, in fifth.Kate proved more popular with both men and woman than Meghan, with 72 per cent of women and 55 per cent of men approving compared to 61 per cent and 50 per cent for the former American actress. Baby boomers prefer Princess Anne to both of the younger Duchesses, with 68 per cent of over 55s approving compared to 64 per cent for Kate and 51 per cent for Meghan.While William’s wife may be more popular than Harry’s, the brothers’ own popularity is not based on their rank in the royal pecking order with the Duke of Sussex proving more popular than his older brother.Eighty six per cent of women and 69 per cent of men approved of Harry, with just seven per cent of respondents having a negative opinion of either Harry or William, compared to nine per cent who disapproved of the Queen and Kate, and 10 per cent who didn’t like Meghan. While Harry was the most popular royal among women, the Queen was the most popular among men, with 71 per cent approving.Both princes were much more popular than their father, Prince Charles, who marks his 70th birthday on Wednesday.Almost half of the nation (48 per cent) said they had a positive opinion of the heir to the throne, putting him in seventh place overall. A further 20 per cent have a negative view of him, while 30 per cent have a neutral view.Charles’s wife Camilla is far less popular than he is. Only 29 per cent of Brits have a favourable view of the Duchess of Cornwall, putting her 10th on the list of 15. The 36 per cent of people who say they dislike her is the joint-highest of any member of the royal family - putting her popularity on a par with her brother in law, Prince Andrew.Princess Anne came eighth on 47 per cent, followed by her daughter Zara Phillips on  43 per cent. The Countess of Wessex came 11th in the popularity poll on 28 per cent followed by her husband Prince Edward on 27 per cent. Sophie Wessex proved to be the least famous royal with only 74 per cent of the public having heard of her compared to 99 per cent who recognised Prince William - regarded as the \"most famous\" royal of all.Princess Beatrice proved slightly more popular than her younger sister Princess Eugenie on 25 per cent and 24 per cent respectively while the Duke of York came bottom of the league in 15th place with an approval rating of 22 per cent.YouGov interviewed more than 3600 people between May 15 and October 31, 2018 for the survey.Sign up for Your Royal Appointment – our weekly newsletter with everything you need to know about the Royal family.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}