{"id": "\nJews in Pittsburgh tell Donald Trump to stay away as first victims' funerals take place\n", "paragraph": "Thousands of protesters took to the streets of Pittsburgh on Tuesday to voice their anger at Donald Trump's visit after the killing of 11 people at a synagogue in the city.They waved banners with slogans such as \"President Trump, denounce white nationalism”, and “We do bridges not walls”, a reference to Mr Trump's hard-line immigration stance.It came after Jewish leaders, politicians and at least one of the victims' families criticised Mr Trump for his divisive rhetoric in the aftermath of Saturday's shooting, the deadliest attack on Jews in America's history.Protesters shouted \"leave Pittsburgh, leave Pennsylvania\" outside the Tree of Life Synagogue, the site of the massacre, where the president and First Lady Melania Trump were paying their respects.At a makeshift memorial outside the synagogue, the Trumps placed white roses and a stone from the White House for each of the dead.They were joined by Mr Trump's daughter Ivanka and her husband, Jared Kushner, as well as Tree of Life Rabbi Jeffrey Myers and Ron Dermer, Israel's ambassador to the US.Mr Trump came face to face with protesters as he arrived at a hospital treating victims of the shooting, driving passed several hundred demonstrators on the street and a sign that said, \"It's your fault.\"The suspected shooter, Robert Bowers, frequently posted anti-Semitic material online and was reported to have shouted \"all Jews must die\" as he carried out his attack.The tragedy has heightened a national debate over Mr Trump's political rhetoric, which his critics say has contributed to a surge in right-wing extremism in the United States.Many Gang Members and some very bad people are mixed into the Caravan heading to our Southern Border. Please go back, you will not be admitted into the United States unless you go through the legal process. This is an invasion of our Country and our Military is waiting for you!The White House has rejected the notion that Mr Trump has encouraged white nationalists, calling the shooting an \"evil\" and \"cowardly\" attack.An open letter to Mr Trump from a group of local Jewish leaders, stating: \"You are not welcome in Pittsburgh until you fully denounce white nationalism\" received more than 43,000 signatures. Congressional leaders from both parties, as well as the Pittsburgh Mayor and Pennsylvania's Governor, declined invitations to join Mr Trump on his visit.Bill Peduto, the Democratic Mayor, called for Mr Trump to delay his visit until all the victims' funerals have been held, saying it would distract attention and put a strain on resources.The president's visit came hours after the first funerals were held in the city for brothers David, 54, and Cecil Rosenthal, 59 and 66-year-old Jerry Rabinowitz.The family of Daniel Stein, 71, who was also buried on Tuesday, said they refused an invitation to meet Mr Trump.Stephen Halle, Mr Stein's nephew, said it was because of the president's comments in the immediate aftermath of the attack. Mr Trump had suggested the synagogue should have had an armed guard.“Everybody feels that they were inappropriate,” Mr Halle told the Washington Post. “He was blaming the community.\"Meanwhile Mr Trump's Vice President, Mike Pence, has come under attack for hosting an election event with a so-called \"Christian rabbi.\"Mr Pence was campaigning for Lena Epstein, a Jewish Republican running for the House of Representatives, in Detroit, Michigan.At the rally Loren Jacobs, who uses the title \"rabbi\" but espouses Christianity, was invited to speak on behalf of the area's Jewish community.Jews expressed outrage over social media. Criticising Mr Jacob's involvement in the rally, Danya Ruttenberg, a prominent young rabbi, blasted Mr Pence as a \"Christian supremacist.\"\"Stop pretending and appropriating my people,\" she wrote online.The White House said Ms Epstein was responsible for inviting Mr Jacobs to the event, and that the vice president \"invited him back on stage to deliver a message of unity.\"\"My family's history as Jews and my commitment to my Jewish faith are beyond question,\" Ms Epstein said in a statement.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}