{"id": "\nRacing diary: Colin Tizzard's milk empire runs its course\n", "paragraph": "It is goodbye Daisy, Buttercup, Marigold and Henrietta. Well, not quite, as most modern dairy cows answer to a three-figure number stamped on their backsides, but 60 years of milk production at Venn Farm will come to an end on Tuesday and the headline “Dairy farmer wins Gold Cup” will not be applicable should Colin Tizzard’s Native River win the big race again in March.Avid readers of Farmers Weekly will be all over this but, from 3am tomorrow, the wagons will have been rolling into Venn Farm, Milborne Port, to ship 250 – mainly Friesian – dairy cows to Sedgemoor market near Bridgwater where they will come under the hammer at 11am.The last pint has been coaxed from the last milker and, from now on, should Colin need some for his porridge, he will have to get it from the shops. So, it is with mixed emotions that he will see the cows, the parlour, their cubicles and the bulk tank sold off.The dairy was started by his father in the 1950s and Colin has run it for nearly 30 years. “I’ve been a dairy farmer all my life,” he said, “and it has got us to where we are now, but it is a business decision. We’ve invested in the racing yard at Spurles Farm but haven’t done so much at Venn. To attract decent staff we’d need a new parlour, drains and you’d be looking at a £750,000 investment.”After Tizzard sent out just the five winners on Sunday, fellow trainers should be worried that now he can give his full attention to his horses. However, he did admit it was five years since he grappled with an udder, with son Joe in charge.He is not, however, getting out of cows altogether. He is switching to beef production. “Dairy is a bit like the horses,” he said, “it’s 24 hours a day, seven days a week. Beef is a part-time job.”One-eyed horses are relatively common – one-eared less so. But Lucinda Russell’s Ryalex, a winner at Carlisle on Monday, stands out from a crowd of bay geldings because he is missing his left lug.Apart from hearing, ears on horses are useful to help the bridle stay in place but Ryalex, who lost one when he got his head stuck in the cattle pen in which he was stabled in Ireland prior to his purchase, has perfect hearing and his bridle never looked like falling over his head on Monday.When Tristan Voorspuy was murdered trying to protect his property in Kenya in March 2017, it sent shock waves around the world as the political situation in that country deteriorated before last year’s elections. Voorspuy, whose brother Rufus was a trainer in Sussex, settled in Africa and set up Offbeat Safaris, which offered riding holidays in the Kenyan bush among the big game, about which he had an expert knowledge.If he did not give his guests a near-death experience every day, he did not consider he was doing his job properly.Consequently, he attracted a large number of racing folk among his clientele.One claim to fame was that he was about the only man to have ever put the wind up Lord Daresbury on horseback; crossing a flooded river with hippos to the left and crocodiles to the right, Daresbury and his then seven-year-old son, Jake, both ended up parting company with their horses and swimming for it.Haydock’s chairman described another day of the safari, on which two people, including Voorspuy, broke bones, like “a novice chase at Market Rasen”.Mementos of his famous rides include a broken neck for Jessica Harrington, whose mount put its foot down an aardvark hole, while Charles Barnett’s daughter, Louisa, broke her femur.The antidote to health and safety, all he had in his first-aid bag for Louisa was an Elastoplast and some Savlon.But, using his diaries and the testament of family and friends Voorpuy’s story: Life On The Edge (Quiller £20); has been beautifully written by Adrian Dangar, who will be signing copies at Cheltenham, where Voorspuy regularly donated safaris to the charity auction, on Friday.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}