{"id": "\nKevin De Bruyne expresses concern over state of Wembley pitch after NFL games\n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nKevin De Bruyne has expressed his concern over the state of the Wembley pitch ahead of Manchester City’s match against Tottenham Hotspur because it will have been damaged by hosting three NFL games in quick succession.De Bruyne made his first start of the season in City’s hugely impressive 3-0 win over Shakhtar Donetsk and insisted he has made a full recovery from the knee injury he suffered in the summer.However, he made no attempt to disguise City’s irritation at being forced to face Spurs just 24 hours after the playing surface has been churned up by the Philadelphia Eagles and Jacksonville Jaguars.City already resented being forced to face one of their strongest rivals in the Premier League on Monday night because of fixture congestion and if the pitch is in a poor state, manager Pep Guardiola could be forced to rest players who are at risk of injury.Whether De Bruyne is one of them remains to be seen, but having lasted an hour in Ukraine on Tuesday night, City will not want to take any risks with the 27-year-old so early in his comeback.“We have played on an NFL pitch before in pre-season and it’s not nice,” said De Bruyne. “It's going to be difficult.“I'm not sure how it's going to be. We hope it will be OK and we can play like we normally do.\"I prefer to play than be on the sidelines, that's for sure. I've worked hard to get back as quickly as possible and then you try to get back with the rhythm of the team.“It went well with the injury. There were not a lot of complications. I've worked hard to be back and I'm happy to be here.“The team have done well without me. Obviously, most were games that we should have won, but we've done really well. We’ve only lost to Lyon, so we've been fine. But, to be honest, I didn't expect anything less.“These games, though, are the most important ones. We have to go and show our intent to stay at the top. Tottenham will try to do the same because they are close [to us in the table]. It's a big one.”Guardiola described his team’s dismantling of Shakhtar as one of the best performances he has seen during his time in Manchester and there are worrying signs for the rest of the Premier League that City could be even better this season than they were when winning the title by a record 19 points.The performance on Tuesday night will also have caught the attention of the main Champions League contenders.“I think they were already wary of us,” De Bruyne added. “We have one player more than we had last season, but I don't know if we are better equipped to win the Champions League. There are about 10 teams who can win it.“Last year was so good, it's hard to say we are playing even better now, but the beginning to this season has been really good.”Sergio Aguero will return to the starting line up against Spurs after he was replaced by Gabriel Jesus against Shakhtar, although John Stones may have to continue at right-back as Kyle Walker is still easing his way back to fitness.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}