{"id": "\nSascha Zverev knocks Roger Federer out of ATP Finals... and the 17,500-strong O2 crowd are not happy \n", "paragraph": "Roger Federer’s run at the Nitto ATP Finals ended in bizarre fashion here as a section of the 17,500-strong crowd erupted in boos directed against his victorious opponent, Alexander Zverev.Rather like Naomi Osaka at the US Open, Zverev was forced to apologise for having eliminated a fan favourite. “I’m very sorry that this happened,” he said afterwards. “I didn’t mean to upset anybody. That’s all I can say, I’m sorry.”Zverev’s offence – as far as the hecklers were concerned – was not simply the fact that he had expelled the king of tennis by a 7-5, 7-6 scoreline. It was the result of an unusual incident on the eighth point of the second-set tie-break.Federer was leading by a 4-3 margin at the time, and appeared to have the next point under control as he looped a backhand drive up the line and deep into the corner. Zverev moved to play a defensive forehand, then held up his hand and cried “Wait!”The explanation was not immediately obvious to the crowd, or even to chair umpire Carlos Bernardes. But it turned out that a ball boy had lost control of a spare ball at the back of the court, letting it fall to the ground and roll a couple of metres towards the net just as Federer struck that majestic backhand.Zverev was thus completely within his rights to stop play. For one thing, the sight of an extra ball, right in his eyeline, would have been hugely distracting. For another, it could potentially have been dangerous to have a loose ball on the court. From an early age, every professional player is conditioned to call a halt whenever this happens.Had the incident affected Federer? “Of course it did,” he said later. “It got replayed. I got aced. So, yes, it did affect me“I don't know what the rules are,” Federer added. “I was trying to think: ‘What would I have done in his position?’  It's a bold move by Sascha to stop the rally because the umpire can just say: ‘Sorry, buddy, you're in the rally.’ While you're hitting, that might go through your head. So I would have probably said: ‘Whew, I'll probably keep on playing, unless the ball really rolls into the court quick.’“I always thought it was an umpire's decision, not a player's decision. But I'm not questioning Sascha's sportsmanship in any way. In practice we stop rallies all the time when balls come flying from the second court. [After the interruption] I just asked him [the ball boy]: ‘Did you drop the ball?’ He said: ‘Yes.’ From that standpoint, it's, ‘OK, no problem, that happens.’ “It's all good. I hope he doesn't have a sleepless night. It's not a big deal at the end of the day. It could have been if maybe I win the next point. But whatever happened, this is life, this is sports. I'm definitely not mad at him.”At the post-match interview, compere Annabel Croft went on the front foot and challenged the crowd’s reaction. “I don't know why you are all booing,” she said. “He's telling the truth. The ball boy dropped the ball and it disrupted play. You have to be more respectful.”Croft’s firmness was later commended by many fans, broadcasters and even tournament director Adam Hogg, who wrote on his Twitter page that the crowd’s response had been “astonishingly disappointing”.It was certainly a more satisfying handling of a tricky situation than Katrina Adams, chief executive of the United States Tennis Association, had managed after Osaka’s US Open win. Adams’s unwary on-stage comment – “This is not the outcome we hoped for” – came across like an admission that the organisers had wanted home favourite Serena Williams to win.If nothing else, Croft cowed some of the hecklers, and gave Zverev a chance to defend himself further. “I apologised to Roger at the net,” Zverev explained to the fans. “He told me, 'It's OK.’ It's obviously in the rules.”Tennis-wise, Federer had enjoyed the better of the early exchanges. He kept dragging his opponent to the net – where Zverev’s touch is heavy – with short slices. But he couldn’t convert his pressure into a substantial lead, and then suffered a dodgy 20-minute period in which he lost the first set and squandered an early break in the second. Zverev was the steadier of the two thereafter.Well said @Annabel_Croft https://t.co/hAyUcg8dT3“I was really upset afterwards in the locker-room,” Zverev told reporters, an hour or so after the match. “But I hope the crowd and the people who were booing maybe look at what actually happened, maybe just realise that I've not done anything wrong.”At least the schemozzle didn’t ruin the trophy ceremony this time, as it had in New York. Should Zverev repeat his success in Sunday’s final, he can expect a far warmer reception.Earlier, Jamie Murray and his partner Bruno Soares had been eliminated in the semi-finals of this event for the third successive year. Murray and Soares split sets with the American pairing of Mike Bryan and Jack Sock but were eventually defeated 6-3, 4-6, 10-4.“We played some good tennis here,” said Murray afterwards, “winning three matches against three of the top eight teams in the world. I think that will give us good momentum going into next year.”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}