{"id": "\nEngland defeat Bangladesh (and the rain) by seven wickets to get off the mark in the Women's World T20\n", "paragraph": "It was not pretty, but England are on the board in the Women’s World T20, accounting for Bangladesh by seven wickets in a contest most noteworthy for the fact that it happened in the first place following four days of crippling rain.The victory was set up by Heather Knight’s bowlers, led by debutant Kirstie Gordon, who picked up three for 16, with her left-arm finger spin, earning the player of the match gong. Linsey Smith, the other left-arm spinner making her bow, also picked up her first international wicket.After restricting Bangladesh to 76 for nine (later reduced to a target of 64 after a rain delay) England’s top order looked as rusty as their interrupted preparation would suggest; Danielle Wyatt trapped leg before from the first ball of the reply then Tammy Beaumont caught top-edging to point with the score on 13. Amy Jones first survived a stumping chance by no more than an inch then was dropped off a top edge. But the No 3 maintained her composure and was unbeaten on 28 when the win came.“I think the staff have done an amazing job to get us out there so we are delighted to play some cricket,” Knight said after the win that put them to the top of Pool A. “Conditions were slightly tricky but the main thing today was getting out there and getting those points.”The England captain elected to bowl first at the toss to give Anya Shrubsole the chance to take advantage of conditionst. The attack leader made the initial incision with a superb inswinger to bowl Shamima Sultana for a duck.England have never conceded so few runs in a T20 powerplay, giving up just 12, before the trio of spinners took over. First, they had to get rid of Ayasha Rahman, who made the 39 of the first 42 that Bangladesh put on the board. When Gordon was able to prompt a miscue to midwicket – her first wicket for England having played 22 times for Scotland – the Tigers’ innings lost any impetus.In the next over, Smith  picked up her wicket when Sanjida Islam was one of four batters to fall without scoring, caught at mid-on by the third left-arm orthodox tweaker in the side, Sophie Ecclestone. The dismissal was perfunctory but the reaction was not, the 23-year-old leaping joyously into the arms of the Lancastrian.Having missed their first game against Sri Lanka due to rain, England will need to win at least one – possibly both – of their remaining matches to guarantee progress to the semi-final on Nov 22. They play South Africa on Friday then hosts and defending champions the West Indies on Sunday.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}