{"id": "\nThe Reluctant Landlord, review: Romesh Ranganathan takes over his father's pub in this easy-to-watch sitcom\n", "paragraph": "When was the last time you went to a bad pub? The type where the menu is “ready salted or cheese and onion”, where there is a darts board but no-one to play with, where the seats are uncomfortable pews and somehow they don’t take card payments even though it’s 2018.Maybe you missed a train connection and the waiting room was locked, or you were in an unfamiliar town and nowhere else was open. Or perhaps you’re one of the old men who keeps these places open by drinking pints at the sticky bar from 10 o'clock in the morning.The Reluctant Landlord (Sky One) is a six-part comedy set in exactly one of those bad pubs. Romesh Ranganathan plays a fleshed-out version of his stand-up persona, in a story loosely based on his own experiences of running his father’s pub after he died.Ranganathan dominated the first episode, which often felt like little more than a vehicle for his reactionary kids-these-days humour. Though, where better would curmudgeonly dad jokes work than in an old-fashioned boozer? And what could be more inherently pubby than banter about whether Scottish currency is legal tender?However, this tutting attitude did start to grate. Ranganathan's whinging occasionally sank to the level of a melodramatic teenager, at one point even saying that eating vegetables made him want to kill himself. If I had a pub, I’d stop serving him.The other characters were left light. The first episode introduced the punters – a ragtag bunch who were each egregious in their own way. Chief among them was Dirty Harry (Phil Davis), a character moulded from all the worst stereotypes about old men who frequent bad pubs. He was a sort of mean Del Boy; at first flogging stolen pickled eggs, then turning out to be an appallingly racist bully.Female characters were thin on the ground, which in this case is not a criticism. Women are rarely sighted in pubs like this. Other than Ranganathan's wife Natasha (Car Share's Sian Gibson), there was a teacher at his children’s school and a gently flirtatious girl-next-door barmaid.The storyline was straightforward: Ranganathan was very much the reluctant landlord of the title, only taking over the pub due to a sense of obligation to his mother and his wife. Natasha, meanwhile, tried a juice diet and tried in vain to encourage the cynical Romesh to try it too. Basically, it was the sort of plot you could follow after a couple of pints at your local.Overall, the show is funny enough, in a slightly miserable way. It’s a swansong to old-fashioned pubs like Fawlty Towers is an ode to tourism before TripAdvisor. But would it be worth ditching a night at the pub to stay in and watch it? If it’s The Reluctant Landlord or a bad pub – I’d take the former. But a prize-winning ale at a comfy, welcoming pub with an appetising menu? Yes please.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}