{"id": "\nBoys arrested after toddler hurt in Leigh van chase\n", "paragraph": "Two teenagers have been arrested after a three-year-old boy was left fighting for his life following a hit-and-run collision.Leo Durrington, from Wigan, was hit by a stolen white Ford Transit Connect van which was being followed by officers in Leigh after failing to stop on Wigan Road shortly after 10.35am on Tuesday, Greater Manchester Police (GMP) said.A 16-year-old boy was arrested on Tuesday evening on suspicion of causing serious injury by dangerous driving, aggravated vehicle taking, failing to report a collision and failing to stop following a collision.A 15-year-old boy was arrested on suspicion of allowing himself to be carried in a stolen vehicle.A force spokesman said Leo had suffered life-threatening injuries and remained in a critical condition in hospital.After hitting Leo, the van was driven towards Twist Lane and was later recovered by police on St Johns Street in Abram.Sergeant Lee Westhead, of GMP's Serious Collision Investigation Unit, said: \"Thanks to the quick work of our officers, and information received from the public, we have managed to make two arrests following this horrendous incident earlier today.\"I would like to thank everyone who has come forward to police with information so far but our investigation does not stop here, and I would ask anyone with information about what happened to please get in touch with police.\"Leo is still in a critical condition in hospital, and my thoughts are with him and his family at this incredibly difficult time.\"The incident was referred to the force's professional standard's branch \"in line with normal force policy\", a spokesman said.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}