{"id": "\nDog owners warned to keep pets away from conkers, because undersized crop poses poisoning risk\n", "paragraph": "Dog owners have been warned that this autumn’s crop of smaller conkers poses a higher risk to their pets than in previous years.Conkers are hazardous for dogs because they can block airways, leading to asphyxiation and they also contain a chemical called aesculin, which is toxic to dogs and can cause internal damage if ingested.With conkers much smaller in size this year due to the summer heatwave leaving the chestnuts shrivelled, the risk to canines is greater and vets have warned dog owners to be particularly alert.Zoe Edwards, Head of Animal Welfare at Mayhew, an animal welfare charity said: “Conkers pose a real risk to dogs as their round, hard shape can easily block airways and get stuck in dogs throats, leading to potentially fatal choking. “This Autumn in particular has brought an influx of smaller conkers, and so more dogs than ever face yet another conker related danger – being poisoned from swallowing their more digestible size. “Conkers are toxic to dogs, so please keep a close eye on your pet whilst out for a walk, and make sure to seek immediate advice from a vet if you suspect your dog has eaten or ingested a conker – however large or small.”Alison Thomas, senior vet at Blue Cross, treated a Staffordshire Bull Terrier that was rushed into the pet charity’s animal hospital in Victoria, London, with severe vomiting and diarrhoea by the dog’s owner.“The dog was clearly very unwell,” she said. “The vomit contained chewed up conkers. Knowing conkers can irritate the gastrointestinal tract we put the dog on a drip and provided him with pain relief and medication to ease the vomiting. We also found an obstruction in the intestines from an intact conker which required surgery to remove. Following this the dog made a good recovery.“Although cases seen here at Blue Cross of dogs eating conkers are rare, we would always advise all dog owners, whatever the season, to stop their dogs from eating things off the floor when out on walks”© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}