{"id": "\nChris Gunter to ask Gareth Bale for private jet help so family can see him break Wales cap record in Albania\n", "paragraph": "Chris Gunter will ask to borrow Gareth Bale's private jet in order to fly his family to Albania this week, when he is set to become the most capped player in Welsh history.The Reading defender equalled Neville Southall's record of 92 caps on Friday night during Wales’ 2-1 loss at home to Denmark in the Nations League.Ryan Giggs' side now travel to Albania for a friendly on Tuesday, and Gunter is hoping his family will be able to watch him claim the appearance record in the city of Elbasan.\"It will be a special night,\" said Gunter, who made his Wales debut as a teenager in 2007. \"I am going to ask Gaz if I can borrow his plane to get some people over. If it is free I am sure they will. I am trying to get some family over there. It is not the easiest place to get to but if the Welsh fans can then I am sure I can find a way to get some people over.\"There are people from my family who have watched every single game of mine, whether live or on TV. I know they will be watching wherever and it will be a special night and hopefully we can get a result so I can enjoy it with a win.\"Around 2,000 Wales fans are expected to travel to Albania and Gunter, 29, said it would be \"fitting\" to break the record in one of the more remote settings for an international match.\"The reaction of the fans - it is hard to put into words how they treat me, especially over the past couple of years,\" Gunter said. \"I have been taken aback by it if I am honest. You kind of feel it is something you don't deserve, because playing for Wales is my honour really so I don't need to be thanked or appreciated for doing it.\"That is why I find it sometimes difficult to express how I feel. It is so much appreciated. If I can do it on Tuesday I think it would be fitting in a way because it would be in front of people who have probably been to far and wide places where I have picked up a lot of my caps.\"If I could do it in front of those who spend their hard-earned money getting to all those places it would be a huge honour in terms of them being able to see in a place where no one thought it would ever happen.\"Gunter made his debut as a 17-year-old in a 2-2 draw with New Zealand in 2007. He played alongside Giggs, who was making his penultimate appearance for his country. \"I can remember it,\" Gunter said. \"At the time you are sort of amazed you have got the first one. The gaffer actually played in that one.\"The record is not something you think of. It is hard to put it into words because it is almost like you are just doing your job as a footballer to train as hard as you can and when you are selected to go about your job.\"© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}