{"id": "\nEnable the star of show with historic victory at Breeders’ Cup\n", "paragraph": "There will not have been too many times in the 35 editions of the Breeders’ Cup when the meeting’s finale, the $6 million (£4.6 million) Classic, has been put in the shade by the $4 million Turf.But even in a country where racing on dirt is king and grass is considered the poor relation, Enable’s hard-fought victory to become the first Prix de L’Arc de Triomphe winner to double up in what the Americans call racing’s “world championships” was being hailed over Accelerate’s victory 55 minutes later.You would not think it so hard to win an Arc in the autumn sunshine of Paris, have a nice break of a month and then ship across the Atlantic to beat a few inferior mile-and-a-half-ers around a tight oval track, but it was beginning to look like a tall order – eight, including Dancing Brave and Golden Horn, had failed.They will not be able to throw that statistic at John Gosden any more. But it was not just the fact that Enable did something no other horse has been able to do before. She was the big attraction at this meeting, as much as anything because Americans love a good filly.And the “princess” lived up to her billing. She turned heads in the mornings and delivered not only victory, but a wonderful race.Great races are as much due to the vanquished as the victor, and the sight of Enable going toe-to-toe up the straight with Magical in what winning jockey Frankie Dettori described as a “punch up” – with the rest of the field fading into the distance – was not one to forget in a hurry.“I went half a length up and saw Ryan [Moore] in difficulty,” said Dettori. “But he was like a wasp – not going away. Magical is like a duck on water in those conditions. The ground spoiled it for my filly – I know she likes soft, but she found it difficult.”It was Dettori’s 100th ride at the Breeders’ Cup, and following Expert Eye’s win in the Mile earlier on the card, his 14th winner. “Only 14 per cent?” he said, feigning disappointment after doing the maths.Earlier, when he left the Expert Eye press conference to get ready for Enable, he announced that he was leaving the stage, before adding in a quiet aside to himself: “And that doesn’t happen very often.”He is enjoying a wonderful autumn to his career, out-riding and out-thinking jockeys half his age. His brilliance on Enable was to extract her from the rail and the worst ground, to which she was pinned by her low draw, and get her on the better going, which he had discovered by going wide out of necessity on Expert Eye. Time spent in reconnaissance, and all that.A decision on her career – back to Gosden’s to win a third Arc or the breeding paddocks – will be taken by her owner-breeder Khalid  Abdullah in the next fortnight.With Charlie Appleby winning the Juvenile Turf with Line of Duty on Friday and Sir Michael Stoute on target with Expert Eye in the Mile it was a good meeting for British horses, less so for the other Europeans. Magical was the nearest Aidan O’Brien came to hitting the target with his 13 runners, and for once the French left empty-handed.The most impressive winner of the meeting was Newspaperofrecord in the Juvenile Fillies Turf – a triumph for her British breeders, Richard and Sally Aston’s Goldford Stud, near Malpas, who raised her for Lancashire-based owner-breeder Allan Belshaw.The Classic was won by Accelerate who is now six wins from seven starts this season and it gives him a shout for the Eclipse Horse of the Year Award with the Triple Crown winner Justify, whose unbeaten career lasted four months but never pitched him against an older horse.The Europeans fared less well in the race. Mendelssohn paid the price of going too hard in front. Roaring Lion had the good sense to become a conscientious objector to the dirt after a few hundred yards so it was left to Saeed in Suroor’s Thunder Snow to finish best of the trio in third.As long as turf races are still run at the Breeders’ Cup, there will be European winners like Enable.As for a Classic winner though, it is back to the drawing board for 2019, when the meeting returns to Santa Anita, in California.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}