{"id": "\nFacebook loses more users in Europe as its growth continues to cool\n", "paragraph": "Facebook has warned investors to expect slower revenue growth for the foreseeable future as it battles new privacy laws, lower user numbers and a worldwide shift towards private messaging.In an unusually candid conference call on Tuesday, following its latest financial results, chief executive Mark Zuckerberg described serious challenges ahead after a year of scandals, falling share prices and executive departures.Facebook's revenue in the three months ending in September was 33 per cent higher than at the same time last year, down from 42 per cent in the three months ending in June, and slightly below Wall Street's expectations.The company lost one million daily active users in Europe as the European Union's new General Data Protection Regulation continued to bite, and gained only a few hundred thousand in the USA and Canada. Mr Zuckerberg said Facebook's audience in North America was now \"pretty close to saturation\" and that future growth would come from developing countries, which now provide more of its users from ever before.Shares see-sawed in after-hours trading as the 34-year-old chief executive laid out a series of hurdles facing the social network. But they did not repeat the wipeout seen in July, when Facebook lost $123 billion in one day after missing revenue targets.He said Facebook was attempting a long-time shift away from the news feed, traditionally the centre of Facebook's product, and towards private messaging and \"ephemeral\" messages which disappear shortly after being sent.Facebook has heavily pushed such formats through its new Stories product and a similar feature on Instagram, the photo-sharing app that it bought for $1 billion in 2012. Both now have more daily users than Snapchat, a rival app which they essentially copied.\"I just think this is the future,\" Mr Zuckerberg said. \"People feel more comfortable being themselves when they know their content will be seen by a smaller group, and when they know it won't stick around forever.\" That will mean slower revenue growth while Facebook experiment with different ways to monetise Stories, which are not currently as lucrative as adverts on the news feed.Asked about Facebook's continuing investments in \"safety and security,\" such as building new AI systems to spot harmful content and hiring more human moderators, Mr Zuckerberg said the company had been \"quite behind where [it] needed to be\" in 2016, when it was blamed for flooding the US presidential election with toxic misinformation.\"We are up against sophisticated adversaries which will continue to evolve,\" he said. \"There's no silver bullet where you do the thing and then you're done.\"Debra Aho Williamson, an analyst for eMarketer, said: “Although revenue came in slightly lower than Wall Street expectations, it wasn’t a significant shortfall. Importantly, Facebook grew revenue at a nice pace in the important US and Canada markets. \"The 1 million quarter-on-quarter decline in Europe users was likely a continuation of the fallout of GDPR we saw last quarter. \"Overall, given all the challenges Facebook has faced this year, this is a decent earnings report.”A growing share of its revenue came from Instagram, the photo-sharing app that Facebook bought in 2012, and from the \"rest of the world\" outside the USA and Europe.  © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}