{"id": "\nOldham perform FA Cup smash and grab to break Hampton & Richmond hearts\n", "paragraph": "You cannot beat the FA Cup for romance, but sometimes the most heartwarming stories have the most heartbreaking end.Hampton & Richmond Borough, for so long in control of the biggest match of their existence, were just two minutes away from a historic victory before Oldham Athletic launched a late one-two that floored them at the close.It was testament to the home side’s quality here that most observers would have been unable to tell that Oldham, in League Two, are 48 places above Hampton, from the National League South. If anything, it was Hampton who had more quality in attack and more structure in defence.That was why they were so crestfallen at the end, when Oldham’s 94th minute winner snatched this game from their grasp.“We are disappointed and devastated,” said Gary McCann, the Hampton manager. “But I am proud as the team left everything out there. I’d like to think we have won some admirers.”There was much to admire for the 3,000 fans here and also for the watching viewers at home. This was the first ever match to be televised live at the Beveree Stadium, where Hampton provided plenty of those charming storylines that make these ties so alluring.The sixth tier side started with a taxi driver, a removals man and a DJ in their midfield, and it was a personal trainer, Chris Dickson, who gave them an early lead against an Oldham team that lacked inspiration. The game had been described by many in these parts as the biggest in Hampton’s history, and Dickson’s penalty, awarded after Tyrell Miller-Rodney had been felled by Oldham’s Callum Lang, added a welcome layer of hope to the occasion.The goal was the key moment of a breathless, frantic and totally captivating first half, in which Hampton were briefly reliant on the heroics on their goalkeeper, Tom Lovelock, in the face of an Oldham storm.The run to this stage of the competition had generated around £150,000 for Hampton, irrespective of the result, which is enough to keep things ticking over for a year at least.It could have been more, though, even if they had to ride their luck at times. The Oldham equaliser eventually came through Rob Hunt, slashing home after a fine Dan Gardner run, and then the winner was buried by Lang, spinning away in the box and firing past the diving Lovelock.Hampton & Richmond Borough (4-3-3): Lovelock; Miller-Rodney, Bray, Mambo, Mavila; Dundas, Corcoran, Maclaren (Wellard 63); Joseph, Dickson, (Murrell-Williamson, 85) Connors Subs: Burns (g), Uchechi, Hammond, Obi, Randall Booked: Maclaren, Connors, Dundas Goal: Dickson (pen) 15 Subs not used: Burns, Uchechi, Hammond, RandallOldham Athletic (4-2-3-1): Iversen; Hunt, Clarke, Edmundson, Taylor; Lyde (Maouche 79), Gardner; Dummigan, Baxter (Branger 56), Lang; Miller (O’Grady 73) Subs: McFarlane (g), Coke, Missilou, Hamer Booked: Baxter Goals: Hunt 88, Lang 90+4 Subs not used: Coke, Missilou, Hamer, McFarlaneReferee: Tom Nield Attendance: 2,720© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}