{"id": "\nTesla posts first profit in two years in triumph for Elon Musk\n", "paragraph": "Tesla has turned the largest profit in its history, and the first recorded by the company in two years. The electric car maker made more than $300m (£232m) in the third quarter of the year, a result that chief executive Elon Musk called \"truly historic\" in a letter to investors. Tesla's share price briefly rose by more than 10pc on the news. The results are a vindication for Mr Musk, who had assured investors that Tesla would be profitable in the quarter. In the previous three months, the company had made a loss of $717.5m and many analysts had predicted it would have to raise money to stay afloat.Tesla has suffered from controversy in recent months after Mr Musk and the company were each fined $20m by US regulator the Securities and Exchange Commission, following a tweet in which he said he planned to take it private at $420 a share, a deal which it later emerged had not been finalised. He is a frequent critic of short-sellers, who bet against the company's stock. They have been enriched by his controversial pronouncements on Twitter, which sent the company's stock price tumbling. In a call with analysts on Wednesday Mr Musk became emotional as he thanked Tesla staff and supporters. \"I've never heard of a case where a company's customers care about the future of a company so much that they volunteer their time to help the company succeed. That's amazing. You don't see that anywhere. It really chokes me up actually,\" he said.\"I'm so proud of the Tesla team, our customers, really appreciate the support of our long-term shareholders.\"Tesla's revenues more than doubled year-on-year, to $6.8bn, owing to the growth of the Model 3, the mass-market electric car that investors have pinned their hopes on. Tesla has cut jobs and spending in an effort to turn a profit, and has pushed to speed up deliveries of the Model 3 to customers. The report suggests its efforts have paid off, with more than 56,000 Model 3 cars delivered to customers in the third quarter, compared to 18,449 in the previous three months. It is manufacturing 4,300 of the cars per week on average, which is short of its June prediction of 5,000. The car now has a gross margin of more than 20pc, the company said. \"Sufficient Model 3 profitability was critical to make our business sustainable – something many argued would be impossible to achieve\", the letter added.  The company is now focusing on making the Model 3 more affordable, with the aim of bringing the price down to $35,000, from its current starting price of $46,000. To do this it will increase the amount of manufacturing done in China.On the call Mr Musk also said he expected customers would be able to get $35,000 versions of the car within six months, and added that the goal was to get a car from the factory to the owner within 10 days. He declined to answer a question about the company's new chairman, who is yet to be appointed, after Mr Musk was forced to leave the role as part of the SEC settlement. Tesla also ended the period with $3bn in cash, an increase from the $2.4bn reported in August, and predicted that profitability would continue in the final quarter of the year. It came after a broad sell-off on Wall Street that saw the Dow Jones and S&P 500 fall to its lowest point this year. The Dow dropped more than 600 points, or 2.4pc, continuing an October decline that has been prompted by higher interest rates and economic uncertainty.The technology-focused Nasdaq index dropped by 4.4pc, its worst fall since 2011, with many of Silicon Valley’s most prominent names including Apple, Amazon and Google owner Alphabet losing value.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}