{"id": "\nTommy Makinson's hat-trick helps  England to series win over New Zealand\n", "paragraph": "Hat-trick hero Tommy Makinson is the perfect poster boy for the England side who clinched their Test series against New Zealand with next week’s game still to play. From the assurance with which he played, it was easy to forget that the St Helens man, who was just as impressive defensively as he was in attack, was making just his third international appearance.With a number of high-profile players such as usual captain Sam Burgess absent, Makinson, who was named man of the match, perfectly represents the relatively inexperienced yet composed side who came through two tight games. Last week, it was England debutant centre Oliver Gildart who stole the headlines with his match-winning try.The way in which England have closed out both games has helped to cast off their reputation as a side of nearly men, and it would seem that this change has been brought about since veteran Australian Wayne Bennett took charge, leading his side to the World Cup final last year.After last week’s win, Bennett suggested that his England side were a team “the whole country could be proud of”. Makinson, who did not make the cut in Wigan’s underage ranks, batted back the praise. “I think it is the same for Wayne, I don’t think he gets the credit he deserves,” he said. “What he is doing with this group of lads is special, he fills us with so much confidence.“Bringing in a player with me who is 26 [now 27] and hasn’t had a shot in a while and putting a lot of confidence in me, it takes some doing, and he hasn’t just done that with me, he has done it with a lot of lads. I think there are 10 changes in the squad and some big names missing out.”The first half was edgy and ended 6-6 after a penalty from England centre Jake Connors, followed by a try from the Kiwis’ 23-year-old captain and full-back Dallin Watene-Zelezniak. Stand-off, Shaun Johnson converted and Makinson scored his first try at 35 minutes to give the hosts a psychological boost heading into the interval.The second half was at times ill-tempered and despite wing Ken Maumalo crossing early on, New Zealand started to lose field position due to ill-discipline. A Johnson penalty put the Kiwis 14-6 ahead.With Makinson securing his brace by the 56th minute, the score was back to 14-10 as Connor missed the conversion.However, the Hull FC man would atone by scoring the equalising try off the back of slick passing from hooker Josh Hodgson to second row Elliot Whitehead, with Connor going over to go level at 14-14.Makinson had his hat-trick on the back of a team try which Catalans Dragons-bound Sam Tomkins converted to give England a six-point lead with four minutes left.Bennett relished the tense nature of the fixture. “It was a typical Test match today, there was plenty of pushing and shoving. There was a bit of aggro, and no one wanting to give up anything,” he said.Bennett, who has long been an advocate for rugby league’s international expansion, voiced his hopes that when the international federation meets in York this week, there will be more opportunities for Test matches which will give the code increased exposure ahead of England hosting the 2021 men’s and women’s World Cups.“Get the politics out of the way, the players want to play,” he said. “I hope people stand up for the game and give us all what we want: international rugby played between the best teams and players.” © Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}