{"id": "\nBournemouth inch past Norwich in battle of the understudies \n", "paragraph": "\nFollow your club now for first access to all our news, views and analysis\nSometimes it is better to be lucky than good, as manager Eddie Howe acknowledged after watching his Bournemouth side stumble into the League Cup quarter-finals for only the third time in their history.Steve Cook’s goal 17 minutes from full-time was enough for the club sixth in the Premier League to overcome a Norwich team whose manager Daniel Farke felt they did enough to win, let alone force a penalty shoot-out. Magnanimous Howe said: “We were lucky to get through because they missed some good chances. There were not too many positives from us.“It is a good thing to be able to win and not play well. Last year and the years before we have only won when we have played really well.”Howe made eight changes to the team which swept aside Fulham 3-0 at Craven Cottage on Saturday to maintain their scintillating start to the league season.The home side did not show much of their quality, with Junior Stanislas’ excellent opening goal  six minutes before half-time the  notable exception. He demonstrated superb close control to bring down Jermain Defoe’s pass on his chest before producing a neat step-over and shooting unerringly into the roof of the net.Norwich striker Dennis Srbeny was unlucky not to equalise when his shot struck the inside of a post before the Championship side  conjured a deserved equaliser 20 minutes remaining.Onel Hernandez went unnoticed by the Bournemouth defence as  he crept in at the far post before placing his shot beyond Artur Boruc and into the net after Tom Trybull had scooped a majestic pass over the top.The visiting side’s joy lasted only three minutes, however, before centre-back Cook produced the type of finish any striker would have been proud of through a crowded penalty area after going up to meet a corner.Substitute Jordan Rhodes should have levelled for a second time in the dying seconds but could not make the most of a free header.Farke praised his players. “Our performance was outstanding and we deserved much more. We should have won,” he said.© Telegraph Media Group Limited 2018We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage."}