{"id": "Despite predictions and controversy, PewDiePie has yet to lose his spot as YouTube's 'biggest star'", "paragraph": " The pundits predicted that a new content creator would be crowned YouTube's biggest star come November, but the title still belongs to the Swedish vlogger PewDiePie.  PewDiePie became the first YouTuber to reach the 70-million subscriber mark, beating out the Indian music channel T-Series who  has been quickly gaining ground. Research firms  predicted that T-Series would overtake PewDiePie — who real name is Felix Kjellberg — by the end of October, but the content creator still led Monday by almost half a million subscribers.  Kjellberg has managed to keep his spot atop YouTube  despite a history of making offensive remarks in his videos. Most recently,  Kjellberg landed in hot water this summer over a (since deleted) Twitter post. Following Demi Lovato's hospitalization for an apparent drug overdose, Kjellberg tweeted out a comic that depicted Lovato asking her mom for money to buy a burger, then instead using it to buy heroin.  Although his subscriber base has remained loyal throughout his controversial past, YouTube itself  has punished the creator for his actions. News surfaced in February 2017 that nine videos published on PewDiePie's channel featured Kjellberg making anti-Semitic comments, and the video platform responded by cancelling the second season of Kjellberg's original series on YouTube Premium. Read more: PewDiePie criticizes YouTube's 'inept' leadership, accuses the company of giving Logan Paul a lighter punishment for offensive video This sordid history hasn't stopped other YouTube influencers from calling on their fans to support Kjellberg in securing his spot atop YouTube.  Tubefilter reports that fellow YouTube creator MrBeast campaigned heartily for Kjellberg through stints on local radio and purchases of advertisements on TV, websites, and billboards.  It's worth nothing that this title of \"YouTube's biggest star\" is based on the number of subscribers. Based on viewership, PewDiePie sits down at No. 7 on a leaderboard from research firm Social Blade. T-Series, however, leads all of YouTube in terms of viewership with more than 53 billion all-time video views.  As of Monday, Social Blade revised its estimates to predict that T-Series would overtake PewDiePie for the most subscribers on November 30.  Meanwhile, PewDiePie posted on Twitter that he's already eyeing 100 million subscribers. "}