{"id": "NFL betting guide — Our best bets for Week 7 of the Westgate SuperContest", "paragraph": " It was a valiant effort, but Week 6 was still a losing one for our best NFL bets.  Still, 2-3 is far from tragic, and Week 7 presents another opportunity for us to win big and make a run at $1 million in the Westgate SuperContest.  Take a look below for our best five bets against the spread for this Sunday, plus a few other wagers to consider making this weekend.  Home teams get the asterisk.  In an attempt to remove human error from our picks, we decided to back five of the six home underdogs that played last Sunday, trusting a trend that had been hitting at a 14-7 clip so far on the season. The six home dogs wound up going 3-3, but we left out the suddenly dominant Cowboys, leaving us with a losing week.  This week, we're trusting another home dog — the New York Jets.  The Jets are averaging 38 points per game over their past two outings, and while they might be a little overvalued in a sense that they've been playing hot of late, they're still getting points at home from the bookmakers in Las Vegas.  The Vikings come in with a slew of injury, including running back Dalvin Cook. If the Jets defense can show up at home, the New York rushing attack could test the Minnesota defense.  Analysis aside, just trust the home dogs. It's one of the laws of gambling on football.  Okay, so that thing I just said about backing home underdogs as one of the laws of gambling on football?  We're breaking the law! Woooo! It feels good to be bad.  The Dolphins did show up as home underdogs last weekend against the Bears, with Brock Osweiler doing enough to get Miami an overtime win. But between the weirdness coming out of head coach Adam Gase and the Lions coming off of a bye week, this feels like a great spot to back Detroit.  Is Brock Osweiler going to win consecutive games in the NFL? You remember how his past few extended stints as a starter have gone, right? He's always been able to show flashes of competence and even a moment of brilliance or two, but it's always been followed shortly after by a reminder as to why he's a nominal backup.  Last week was the brilliance — this week is the reminder.  We're doing it again!  And again, professional bettors would scoff at such a move. Is a home underdog getting almost double digits? Close your eyes and play the home dog! Heck, the Rams have been touchdown road favorites for two straight weeks and have failed to cover both times! Why am I getting off a trend just when the rules started working?  Normally I would agree, and be all over the 49ers in this spot. But we're backing the Rams to roll in this one strictly because of how San Francisco lost last week.  After playing brilliantly for 58 minutes on national television, a 49ers team that every football fan in the country had dismissed led the Green Bay Packers by a touchdown. They then watched as Aaron Rodgers brought their world crumbling down. And then they had to get on a cross-country flight back home and just, sit with that loss for hours.  The 49ers played as well as they were ever going to and still got kicked in the teeth. I just don't see how they can bounce back from that in five days.  Los Angeles is dealing with a few injuries that cause a bit of alarm when betting to cover a big number, but with Sean McVay's offense, it sometimes feels like the Rams could score in their sleep.  The Buccaneers are 3-point favorites at home against the Cleveland Browns.  Tampa Bay is far from the elite, but their passing game can beat teams in plenty of different ways, and running back Peyton Barber finally got going last week.  Even with the Browns looking somewhat rejuvenated, they still haven't won a game outside of Cleveland since 2015. To find a road game they lost by less than three points, you still have to go back to 2016.  Trust that trend until Hue Jackson gives you a reason to think otherwise.  Okay, talking myself off the ledge and getting away from that rule-breaking we did earlier, we'll add the Chicago Bears in as one more home underdog to back.  Simply put, this one feels too easy as a pick on the Patriots. According to the Action Network, 76% of the bets on this game have come in on New England so far.  When the world zigs, we zag. LAST WEEK: 2-3 OVERALL: 14-16Teams used: Saints, Rams, Vikings, Chargers, Panthers, Texans  The Bills are bad. They are starting Derek Anderson at quarterback. Derek Anderson has four NFL starts since 2011. He hasn't won an NFL game since 2014. The Bills literally signed him days ago.  The only thing scary about this pick is that it feels too obvious — depending on how many people are still alive in your Eliminator pool, you might want to take a flyer on another team and hope that the Bills wind up knocking out all of your competition.  But the chances of that happening feel slim, and if you're looking at a deep run through the season, you'll likely never get a better chance to take the Colts.  For the life of me, I can't figure out the New York Giants.  Eli Manning has looked awful, to the point where it feels like he might be playing for his job in the near future. Luckily for him, the Falcons are just the team to go up against if you're in need of an offensive boost. Atlanta has given up an average of 35 points per game since their sloppy season opener against the Philadelphia Eagles.  It feels like the Giants could finally show up for this one, and at almost two-to-one odds, there's some value to be had if you're looking for an underdog to back.  We got a little greedy with our tease last week, but don't worry — this week's pick is a winner.  Bring the Rams down to just over a field goal against the 49ers, the Chiefs down to a pick'em, and the Colts down to 1.5-point favorites. Easy, teasey money.  These Monday night games can't stop going over. Just keep riding the trend until it proves us wrong.  Let's make some money this weekend. "}