{"id": "Here are the 3 missing features that keep Apple's new iPad Pro from really replacing a laptop", "paragraph": " Apple's latest iPads still aren't a good substitute for a old-fashioned laptop, no matter how much the company  keeps promoting them as the next stage in computers.  Unveiled at the company's  press event in New York on Tuesday, the company's  newest iPad Pro tablets have super-fast new processors, large and beautiful displays, and its FaceID facial recognition system. They also support a much more functional version of Apple Pencil, the iPad's stylus, and a new and improved keyboard case.  But these new iPads — like all of their predecessors — lack three important features found on just about every laptop on the market for the last 20 years. Without them, they'll have a hard time truly replacing those devices.  Here's what Apple's iPad Pros are missing:  Apple's iOS operating system, which underlies both the iPad and the iPhone, has long supported external keyboards. It's never supported a traditional pointing device such as a mouse or trackpad. Instead, the company expects users to interact with its tablets using the device's touch-sensitive screens, either with their fingers or with the Pencil stylus.  That mode of interaction is ideal when you hold an iPad directly in your hands. But it's awkward to have to tap the screen to launch apps or move your cursor when you've got a keyboard attached and are using an iPad like a kind of laptop. It's just a lot more ergonomic — not to mention faster — to use a trackpad near the keyboard than to have to stretch your arm out to touch the screen.  Pretty much every computer you've likely used for the last 20 years — including Apple's Macs — has been able to support multiple user accounts. With their own logins, users can choose their own desktop images, have access to only their own sets of documents, save passwords to their accounts on particular websites or email accounts, and save and see their own photos.  You can't do any of that on an iPad, unless you have specially configured version sold only to educational institutions.  The lack of support for shared logins severely limits how an iPad can be used. It's hard to share an iPad among multiple users in an office or in a family if all users have access to the same information stored on it.  Apple has never supported multiple logins in the standard versions of iOS. But it may be getting close to adding the feature.  It already supports multiple logins for educational institutions. FaceID in the latest iPad Pros could easily be used to recognize and log in different users to the same device. And technologies Apple has added to iOS in recent years that allow users' apps and data to be stored on its iCloud service rather than on iPhones and iPads themselves could minimize storage space the devices would need to have to support multiple users.  Apple has long fetishized minimalism in the design of its devices, cutting out components to get to as simple and streamlined a gadget as possible. The latest iPads are the apotheosis of this ethic — they only have one external port. They don't even have the headphone jack found on all of Apple's Mac computers and on older iPad models.  The company has tried to get around this limitation in some creative ways. Unlike previous iPad models, the port on the new iPad Pros is USB-C, a rising standard across the entire industry. Additionally, the devices have built-in magnetic connectors that allow you not only to connect certain accessories like the Pencil and a new keyboard cover, but to charge them as well.  But you'll still likely need to carry around a pocket full of dongles or connectors if you want to use the iPad Pro like a regular computer. Without one, there's no way to do something as simple as charg the device and connect it to an external monitor at the same time.  That's something most traditional computers can do without a problem. "}