{"id": "Russia has allegedly been spreading far-right propaganda on Facebook to try and influence the US midterms — here it is", "paragraph": " The US Justice Department has charged a Russian woman with links to a close ally of President Vladimir Putin with conspiring to interfere in the upcoming US midterm elections.  The criminal complaint,  filed in September and publicly disclosed on Friday, alleges that Elena Khusyaynova was instrumental in a wide-ranging campaign to influence American politics via social media, evidence that Russian attempts to interfere in domestic American affairs did not end with the 2016 US election.  The efforts, apparently referred to as Project Lakhta,\" involved the creation of thousands of social media and email accounts, and had a budget of more than $35 million, the criminal complaint alleges.  As in 2016, the fake accounts posted highly politically charged content to social media platforms like Facebook and Twitter in apparent attempts to inflame the domestic political divisions that have split America.  The material shared was apparently both left- and right-wing in nature — but the examples the criminal complaint has publicized are typically on the right of the spectrum, and range from fiscally conservative memes to far-right, Islamophobic talking points.  They demonstrate how Russian trolls are leaping on — and fueling — right-wing narratives in the United States in attempts to sow political division. In one example, a Russian conspirator using the fake name \"Rachell Edison\" posted a meme that belittled concerns about police brutality and racism, accusing the mainstream media (or \"MSM\") of having \"warped judgement.                                             US Justice Department                                     In another, \"Bertha Malone\" praised Donald Trump for removing government regulations.                                             US Justice Department                                     Other examples provided in the criminal complaint are more extreme. One Islamophobic image, also shared by \"Bertha Malone,\" suggests Islam is a \"cult,\" and was captioned; \"Dam right! and we all know which cult we need to kick out of America...\"                                             US Justice Department                                     A fourth image spreads the conspiracy theory that Obama has \"ties to the Muslim Brotherhood,\" with the caption adding that \"media should investigate this traitor and his plane [sic] to Islamize this country.\"                                             US Justice Department                                    Do you work at Facebook? Got a tip? Contact this reporter via Signal or WhatsApp at +1 (650) 636-6268 using a non-work phone, email at rprice@businessinsider.com, WeChat at robaeprice, or Twitter DM at @robaeprice. (PR pitches by email only, please.) You can also  contact Business Insider securely via SecureDrop. A Facebook engineer who quit after attacking its 'intolerant' culture wrote a 1,000-word memo revealing some of the biggest challenges facing the business"}