{"id": "A powerful group of conservatives that sprung out of the Tea Party is one of the biggest losers of the midterm elections", "paragraph": " WASHINGTON — The conservative House Freedom Caucus is expected to lose a significant amount of leverage within the Republican Party when the new Congress forms in January, forcing members of the once-powerful faction to adjust to life in the Democratic-controlled House.  At its peak, the Freedom Caucus was able to force the hand of Republican leadership on key issues. By voting together, they could negotiate harder stances with House Speaker Paul Ryan. But with the GOP's losses in the midterm elections last Tuesday, the Freedom Caucus members will be a part of the minority party for the first time in the group's history. Read more:Paul Ryan's successor will have to deal with a lot of pent-up anger in the GOP conference The Freedom Caucus' chairman, North Carolina Rep. Mark Meadows, acknowledged in an October  interview with Roll Call that it would be \"our advantage to keep the majority.\"  \"Because then, what puts something across the top could be Democrat votes, not Republican votes,\" Meadows added. \"There would be no Republican-only scenario. However, if you have 40 or 50 Freedom Caucus members, a number of the other [Republican Study Committee] members will look to form coalitions with the Freedom Caucus to encourage the administration to look at more conservative policy.\"  And because of Democrats taking the majority, HFC members are now likely to be shut out of any leadership roles. Ohio Rep. Jim Jordan, a founding HFC member and former chairman, had initially announced a  bid to run for speaker of the House when Paul Ryan retired. Jordan pivoted to a minority leader run just after the election, but now his prospects are even more dim than his original long shot bid.  Instead, House Majority Leader Kevin McCarthy has emerged as the frontrunner to be the next minority leader, followed by Rep. Steve Scalise as minority whip. In addition, Rep. Liz Cheney of Wyoming is running for House GOP Conference chair unopposed, and North Carolina Rep. Mark Walker is doing the same for the vice chair position.  With the minority leader position being decided among the GOP conference and not on the House floor, Republican aides told INSIDER they are confident in McCarthy's ability to easily win the the top spot. What was once a hot race with multiple people vying for support and perhaps most importantly, the blessing of President Donald Trump, is now a fairly simple decision for Republicans.  Despite Republicans getting trounced in many races across the country, HFC recruits managed to pick up several seats in the midterm elections.                                                                                                                                              Incoming freshmen Republicans like Mark Harris in North Carolina expressed openness to joining the group, telling Spectrum News, \"I can't say that that final decision is there until I exactly understand what that means, but certainly I would be looking that direction.\"  \"I've had a great deal of respect from day one for their seriousness with which they approach fiscal responsibility,\" Harris added.  Several other new Republicans who benefitted from the House Freedom Fund — the HFC's PAC — won their races in primarily deep-red districts, which could further add to their numbers.  Despite being in the minority, the personal associations of many HFC members with President Trump could prove advantageous for the politically weakened group.  Unlike most past presidents, Trump has many unique relationships with Republicans in Congress. Trump talks with members  after they give fiery defenses of him on television and even maintains candid friendships with Republicans in the rank and file.                                                                                                                                              Having Trump's ear during budget talks and other negotiations on must-pass legislation comes with significant advantages, particularly for the more conservative members of the Republican caucus who  have been frustrated with rules and process under Ryan's tenure.  \"So you've got this frustration of members that they can't offer amendments, which is a problem for them personally, then you've got the committee chairmen that are disempowered, but then the way that you run this, the whole body is disempowered really,\" FreedomWorks President Adam Brandon told INSIDER in an August interview. "}