{"id": "The evolution of American voting rights in 242 years shows how far we've come — and how far we still have to go", "paragraph": " The 2018 midterm elections are here, and millions of Americans are expected to exercise their right to vote.  Voting is one of America's most cherished democratic liberties, and it has a long and storied history. While the founding fathers saw voting as a fundamental component of the democracy and perfect union they sought to create, the right to vote was denied for many populations for centuries of US history.  In the beginning of the republic, voting was mainly restricted to property-owning white men, which would later be extended to all men. While the right to vote was also eventually granted to women with the 19th Amendment in 1920, white women were the main beneficiaries.  Men and women of color would continue to fight to battle discriminatory voting practices for decades even after technically receiving the right to vote, culminating in the historic civil rights movement of the 1950s and 1960s, which led to landmark legislation that transformed American voting rights.  But even today, activists and civil rights groups are continuing to fight voting laws they see as discriminatory.  Here's a look at how voting rights in America have evolved over the centuries, and what issues remain today:  The earliest settlers of colonial America brought over many of the laws and customs of England with them to the United States. One of those laws stipulated that only \"free holding\" men, or those who owned property and paid taxes, could vote.  Those men were overwhelmingly white, Protestant, and over the age of 21, meaning only a small subset of the population could vote. Just 6% of those in new America were eligible to vote to elect the first president, George Washington, in 1789.  After the United States of America declared independence from Britain in 1776 and won the Revolutionary War in 1783, it was left up to the individual states as to how to determine who could vote.  Over time, individual colonies and states steadily began expanding the right to vote to all white men, not just property owners. Sources: Gilder Lehrman Institute of American History, Constitutional Rights Foundation In 1848, prominent abolitionist activists such as former slave and author Fredrick Douglass and women's suffrage advocates like Susan B. Anthony, Lucretia Mott, and Elizabeth Cady Stanton convened together for the first time in Seneca Falls, New York.  The convention, which is now considered the birth of the women's suffrage movement in the US, took place over two days.  The attendees all wrote and signed a Declaration of Sentiments modeled after the Declaration of Independence listing their grievances and demands, calling on women around the country to organize for greater property and economic rights — and the right to vote.  In a play on a famous line from the Declaration of Independence, they wrote: \"We hold these truths to be self-evident: that all men and women are created equal.\"  Just one of the attendees of the convention, Charlotte Woodward Pierce, who was 19 at the time, lived long enough to see all women receive the right to vote in 1920. Sources: Smithsonian Magazine, Encyclopedia Britannica In 1856, North Carolina became the last state to remove property ownership as a requirement for voting, meaning all white men could vote by this time. Source: Constitutional Rights Foundation After the Civil War and the end of slavery, Congress passed the 14th Amendment to extend citizenship to freed slaves. The amendment directs that \"no State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States.\"  This amendment gave freed African Americans citizenship, but they wouldn't get the right to vote for two more years. And even then, Southern states used a variety of tactics to suppress African-American turnout for nearly a century afterwards. Source: Library of Congress The 15th Amendment to the US constitution directs that the \"right of citizens of the United States to vote shall not be denied or abridged by the United States or by any state on account of race, color, or previous condition of servitude.\"  While this extended the right to vote to black men in the South, political leaders era of post-Civil War Reconstruction and Jim Crow enacted a slew of measures to keep African-Americans from the polls.  These included making black voters pass literacy tests, mandating voters to pay a tax to cast a ballot, requiring black voters to get a white person to \"vouch\" for them, white-only Democratic primaries in Southern states, and outright voter intimidation and violence against African-Americans at the polls. Sources: Library of Congress, Smithsonian National Museum of American History Women's suffrage activist Susan B. Anthony was famously arrested along with 15 other women and prosecuted for attempting to vote in the presidential election of 1872 in Rochester, New York.  In Detroit, former slave and fellow activist Sojourner Truth was similarly turned away when she demanded a ballot at her polling place.  The next several decades would see a surge in women's suffrage activism, including marches, lobbying, and more militant methods such as breaking windows of buildings during marches, and going on hunger strikes. Source: History Channel Thirty years before voting became a Constitutionally-protected right for women, Wyoming first ensured women's suffrage at the state level. While Wyoming enacted partial suffrage for women beginning in 1869, it didn't become a state until 1890.  After Wyoming granted suffrage to women, 18 other states, which were mostly Western and newly-admitted to the Union followed suit in granting women the right to vote and serve on a jury of their peers.  Historians argue that places like Wyoming and other Western states were more likely to grant women's suffrage not only because they were newer and more open to embracing equal rights for women, but because such states, which were often sparsely populated, wanted to attract more women to move there. Source: National Geographic The historic 19th Amendment to the US constitution prohibited states from denying citizens the right to vote based on sex, but many historians note that voting remained inaccessible for women of color for several decades to follow.  While African-American men got the right to vote in 1870 and African-American women in 1920, discriminatory Jim Crow-era voting policies and voter intimidation kept many black Americans from the polls in the American South.  Meanwhile, Native American and Asian-American women were often denied citizenship by the federal government, meaning they could not vote on account of them not being recognized as citizens. Source: Library of Congress The United States has a long, painful, and complicated history with its treatment of Native Americans, and voting rights is no exception.  In 1876, a federal court ruled that Native Americans could not vote because they were not properly citizens under the 14th Amendment.  Ten years later, Congress passed the Dawes Act, which allowed Native Americans to gain citizenship if they renounced their tribal citizenship, and created a process for Native Americans to apply for naturalization in 1890.  Native Americans and other racial minority groups who had served in World War I were also granted citizenship and the right to vote in the late 1910s.  While Congress granted citizenship to all Native Americans in 1924, many state-level discriminatory policies — such as banning people living on a reservation or enrolled in a tribe from voting, or instituting fees and \"competency tests\" — kept them from the polls for decades. Source: Native American Voting Rights Fund Beginning in the 19th century, immigrants from Asia began coming to the US for work. As with Native Americans, the US federal government systematically denied them citizenship and the right to vote for centuries.  Firstly, the Naturalization Act of 1790 only allowed \"free white citizens of good character\" to become naturalized citizens. The Chinese Exclusion Act of 1882 specifically prohibited Chinese immigrants from becoming citizens and voting.  The US federal government granted voting rights to Filipino men who served three years in World War I in 1925, and gradually began naturalizing more and more Asian immigrants.  The McCarran-Walter Act of 1952 finally lifted all restrictions on Asian immigrants becoming naturalized citizens, fully opening up Asian-Americans to become citizens and exercise their right to vote.  The Voting Rights Act of 1965 expanded Asian-American voting rights even further by adding protections and accommodations for voters with limited English, such as access to translators and ballots in multiple languages. Source: US State Department, Asian Americans Advancing Justice On many DC license plates you'll see the phrase \"taxation without representation\" — and it's because residents of the District of Columbia paid taxes, but couldn't vote in presidential elections until the early 1960s.  While DC is allotted three electoral votes in presidential election years, they have no representation in Congress. A 1978 amendment to give DC congressional representatives ultimately failed in Congress. Source: TIME After decades of hard-fought civil rights activism, Congress passed and President Lyndon B. Johnson signed the landmark Voting Rights Act into law, outlawing several racially discriminatory practices intended to keep people of color from voting.  While the 24th Amendment had already outlawed poll taxes in 1964, the VRA banned literacy tests, which election officials in the South used to keep African-Americans — who had disproportionately high rates of illiteracy from centuries of being denied education — from voting.  The VRA also directed the Department of Justice to oversee voter registration efforts in counties where less than half of the African-American population was registered, and required that places with a history of discrimination obtain pre-clearance from the DOJ before implementing any new voting policies.  But the 2013 Supreme Court decision in Shelby County v. Holder rolled back the preclearnace provision of Section 5 the VRA, which no longer required counties with histories of racial discrimination to be \"covered\" under the act. Sources: US Department of Justice, Brennan Center for Justice, Business Insider Congress voted to lower the federal age from 21 to 18 in 1971 by overwhelmingly passing the 26th Amendment to the Constitution.  The change came about largely at the hands of young men drafted to fight in the Vietnam War, who argued that if they were old enough to go to war for their country, they were old enough to have a say in their government.  Today, some argue that the voting age should be lowered even further to 16, given that teenagers not only have a stake in their government, but possess what researchers call the necessary \"cold cognition\" to logically process facts and make informed decisions. Source: National Constitution Center, The New York Times The NVRA streamlined the voter registration process by allowing people to register to vote while obtaining or renewing driver's licenses at Departments of Motor Vehicles or other public assistance centers instead of having to apply by mail. Source: US Department of Justice While the residents of several US territories such as Puerto Rico, Guam, and the US Virgin Islands pay federal taxes and serve in the military at disproportionately high rates compared to the US general population, they don't have the right to vote in federal elections.  Just months before the 2000 presidential election, a federal appeals court in Boston overruled a decision made in Puerto Rican Federal District Court ruling that Puerto Ricans had the right to vote in presidential elections by virtue of being American citizens.  Since Article II of the US Constitution requires that the president be elected from electors chosen by the states, territories will not be able to elect presidents without a Constitutional amendment allowing them to do so or by gaining statehood.  US territories elect delegates who they send to Congress to be their voice on Capitol Hill, but those delegates, like the delegates who represent Washington, DC, do not have voting power. Sources: NBC News,The New York Times, Washington Post While voting rights in America have come a long way toward ensuring equal ballot access for all, many scholars and activists argue that the overtly racist Jim Crow laws of the past have now given way to technically race-neutral but discriminatory policies, like voter ID laws.  Along with the predominately nonwhite citizens of American territories like Guam and American Samoa, almost 6 million taxpaying Americans with felony convictions are barred from voting due to state-level felon disenfranchisement laws.  This November, voters in Florida, a state with one of the nation's strictest disenfranchisement laws in which 1 in 10 citizens cannot vote, is voting on a ballot referendum to pass a constitutional amendment overturning the state's disenfranchisement law for good.  Other scholars and activists point to what they say are racially or otherwise discriminatory state-level voting policies states such as voter ID laws, cuts to early voting, polling place closures, and limits to pre-registration.  Texas' and North Carolina's strict voter ID laws and voting restrictions enacted in the wake of the Shelby County v. Holder were struck down in federal court, with a federal appeals court finding that North Carolina's law targeted \"African Americans with almost surgical precision.\"  Voting issues and controversies that have been in the news this election include Georgia Secretary of State and Republican gubernatorial candidate Brian Kemp being accused of putting 53,000 registration applications \"on hold\" for mismatched names and incorrectly purging 340,000 voters from the rolls.  And in North Dakota, where most Native Americans who reside on reservations only have a PO box and no residential address, the US Supreme Court upheld a state law requiring voters to bring an ID to the polls with a residential address, leaving Native communities scrambling to obtain proper IDs just weeks before the election.  Sources: Brennan Center for Justice, Business Insider, Brennan Center for Justice, Rolling Stone,  Associated Press"}