{"id": "The Republican and Democratic party chairs gave their closing arguments before the midterm elections in back-to-back Jake Tapper grillings", "paragraph": " The heads of the Republican and Democratic national committees offered their final messages to voters on CNN's \"State of the Union\" Sunday ahead of Tuesday's midterm elections in lively back-to-back appearances.  Ronna McDaniel, chairwoman of the Republican National Committee, hit back against host Jake Tapper's characterization that despite a booming economy, President Donald Trump's \"closing argument in the midterms is focused on fears of undocumented immigrants.\"  \"We have a record, we are saying we have delivered, your lives are better, the economy is booming,\" McDaniel said. \"Let's not go back.\"  Tapper pointed to an ad that blamed Democrats for a homicidal unauthorized immigrant that Trump released Wednesday as a \"factually inaccurate, racially incendiary\" bid to scare voters into backing his wishes for immigration policy.  McDaniel said the ad instead symbolized Trump's focus on the Democratic lawmakers failings in forming effective immigration policy.  \"Actually, quite literally, Democrats and Republicans came to the table to talk to President Trump about immigration reform, and they thought they had a deal,\" Tapper said, referring to Senate Minority Leader Chuck Schumer and House Minority Leader Nancy Pelosi's efforts in September 2017.  Despite saying that instances such as the undocumented immigrant in Trump's ad were due to a \"systemic failure,\" McDaniel said Democratic lawmakers should be more proactive in forming effective immigration policies.  \"You control the White House, the House, and the Senate,\" Tapper said.                                                                                                                                                          McDaniel then widened what she said was Trump's messaging focus ahead of the midterms to a plea for bipartisanship among lawmakers to confront a variety of issues.  \"The president's leading,\" McDaniel said. \"He's saying, 'Come to the table, we have major issues we need to face. By the way, our economy is humming, people are working, wages are up, I'll work with Democrats,' and they're sitting on their hands.\" Read more:9 races are shaping up to be nail biters — and they'll determine which party controls the Senate Democratic National Committee Chairman Tom Perez pushed back on the Republicans' focus on economic growth under Trump, saying \"reckless\" tax cuts have only \"delivered results for very wealthy people.\"  Tapper objected to Perez's characterization, saying he might be \"saying things that aren't true to try and put a grey cloud over the economic good news.\"                                                                                                                                                          The former Labor Secretary said other failures to adjust cost of living and healthcare costs rendered any economic gains useless, despite Republicans touting wage growth.  \"People need to feel that if they work a full-time job, they're actually able to feed their family and not tread water,\" Perez said. \"That's what's happening across this country. Too many people are working two or three jobs to make ends meet because their salaries aren't enough and the cost of living is going through the roof.\"  Perez continued, saying health care was \"under attack\" under the Trump administration and would be the \"number on issue\" on ballots Tuesday that would encourage voters to choose Democratic candidates.  \"So many people with preexisting conditions thought they would be able to retain their coverage [and] this administration doesn't want to do it,\" Perez said. \"Medicare, Medicaid, Social Security — they're on the ballot. That's why there's so much energy on the Democratic side.\"  A Gallup poll released earlier this month reported 80% of registered voters said healthcare is important or extremely important to their vote. The same poll found 78% of voters considered the economy important, which was the lowest of any recent midterm.                                                                                                                                                          In the uncertain midterms full of tight races, voter engagement has skyrocketed. Election Day is Tuesday, November 6. "}