{"id": "MoviePass competitor Sinemia is being sued by angry customers who say it ripped them off with new fees", "paragraph": " When MoviePass was forced to  drastically change its business model in the face of mounting losses in August, competitor Sinemia stepped into the spotlight.  The movie-ticket subscription startup was founded in Turkey in 2015 and had operated overseas, but in early 2018 it capitalized on the hype around MoviePass to launch in the US. Despite their similarities, Sinemia CEO Rifat Oguz positioned his company as the anti-MoviePass, focused on \"profit\" and \"sustainability\" where MoviePass was focused on hypergrowth.  But as MoviePass began to introduce unpopular new restrictions, Sinemia went for the jugular,  introducing a plan at the same price as MoviePass (around $10 per month), with the same number of movies (three per month), but with no restrictions on movies or showtimes — and with the ability to book tickets in advance.  For some movie fans, including myself, it seemed we had finally found a subscription service we could rely on. That feeling didn't last for many.  On Friday, the law firm Chimicles & Tikellis LLP filed a class action lawsuit in Delaware on behalf of two plaintiffs, alleging that Sinemia \"essentially became a bait-and-switch scheme.\"  \"It lures consumers in by convincing them to purchase a purportedly cheaper movie subscription, and then adds undisclosed fees that make such purchases no bargain at all,\" the lawsuit claims. \"Sinemia fleeces consumers with an undisclosed, unexpected, and not-bargained-for processing fee each time a plan subscriber goes to the movies using Sinemia's service.\"  I, too, encountered Sinemia's sneaky fees and  wrote about them in a piece published last week. In the piece, I urged the company to be more transparent with customers about its pricing structure. After the article published, I was contacted by over 40 Sinemia subscribers, many of whom expressed anger and frustration with its fees and lack of customer service.  On Sunday, less than a week after my story, Sinemia deactivated my personal account without explanation. A button to \"reactivate\" my subscription didn't function and my email to customer support hasn't been answered. Despite paying a $20 activation fee, my account was only active for two months before Sinemia shut it off.  I saw one movie, \"A Star Is Born,\" which I highly recommend.                                                                      How did it all go so wrong so quickly?  The crux of the class action lawsuit against Sinemia is a new $1.80 \"processing fee\" that the company began to roll out in mid-October.  To understand how the new fee changes the value proposition of the service, it's helpful to look at one of the lawsuit plaintiffs: Paul Early of California.  Early signed up for Sinemia in August and paid $191.88 for a year plan of two movies per month for two people, plus $9.99 for early activation, according to the suit. All in he paid over $200. The first five times Early used Sinemia, he incurred a $1.50 third-party \"convenience fee\" (from using ticketing sites like Fandango). Sinemia had disclosed before he'd bought the subscription that he'd have to pay that fee.  But then when Early went to use the app on October 22, he was charged a further $1.80 \"processing fee\" per ticket, according to the suit.                                                                      After getting hit with this new fee a few more times, Early contacted customer support asking to cancel his plan and get a refund for the remainder. He never heard anything, according to the suit.  \"The movie plan Early is now stuck with has lost significant value with the imposition of the processing fees,\" the suit argues.  Many Sinemia subscribers echoed these sentiments to Business Insider, saying they felt taken advantage of by the fees, especially when \"processing fees\" were added on top of \"convenience fees.\" Multiple subscribers said they had requested refunds for the remainder of their yearly subscriptions and been told Sinemia was a \"non-refundable service.\"  Others simply never heard from Sinemia's customer support despite multiple follow-ups (including myself).  Sinemia provided the following statement to Business Insider after publication:                                                                      \"From the beginning, the goal of Sinemia has been to make the moviegoing experience much more affordable and enjoyable for moviegoers by covering for the cost of the movie ticket. While nobody enjoys fees, there are certain costs related to booking and processing outside of the price of the movie ticket that are out of our control. A processing fee of up to $1.80 applies so that Sinemia can continue to provide access to all showtimes for all movies in all theaters without restrictions as well as to keep our subscription plans and services consistent, as they have been since the founding of the company. Also, Sinemia is developing a feature in the app which will allow users to order physical cards in December or earlier.\" If you have any information about Sinemia, or have a story about your experience with the service, contact the author at nmcalone@businessinsider.com."}