{"id": "New Yorkers are making lots of doomsday predictions about Amazon’s HQ2. Here are all the things that could make it a disaster.", "paragraph": " New York's governor  may be rejoicing at the news that Amazon will move half of its second headquarters to Long Island City, Queens, but the mood among residents is one of  outrage and despair.  A day after the announcement, New Yorkers gathered at a rally in Queens led by two local politicians who ardently  oppose the move: Senator Michael Gianaris and City Councilman Jimmy Van Bramer.  \"It may be cold outside, but I am steaming mad,\" Van Bramer  told the crowd on Wednesday. \"Just this morning, several residents contacted us to say there's no heat in Queensbridge. But somehow folks who consider themselves progressive Democrats have seen fit to throw $3 billion to the richest man in the world.\"  In the background, protestors  held angry signs with phrases like \"Scamazon\" and \"Rent hikes now with two-day shipping.\" Read more:  Everything we know about Amazon's HQ2 development in Long Island City, Queens Though it's impossible to predict the impact of HQ2, many urban experts are worried about what 25,000 new employees and a  multi-billion-dollar headquarters could do to the already-fragile Long Island City.  Ahead of Amazon's arrival, residents have complained of overcrowded schools,  bottle-necked subways, and  failing infrastructure. Commuters say the the 7 line, the most direct route from Long Island City to Midtown Manhattan, is  entirely congested during peak hours — and roads on the Queensboro Bridge aren't much better.  These issues could become worse as Amazon begins its  slow takeover along the Anable Basin, an artificial inlet in Long Island City that separates Queens from Brooklyn.  Here are all of the realistic, yet nightmarish scenarios that could occur in Long Island City after the tech giant moves in.  There's good news and bad news for riders of the MTA. On the one hand, Amazon employees commuting to Long Island City would be going against rush hour traffic. On the other, New York's subway system is already plagued by overcrowding and delays, making it ill-equipped to handle more passengers.  \"If there's no reliability because the signals don't work and the cars are too old, then it doesn't matter what the capacity is,\" Danny Pearlstein, the policy and communications director at Riders Alliance,  told Business Insider.   While Amazon has pledged to provide $600 million for  transit and infrastructure improvements in the next four decades, the  MTA estimates that New York would need $37 billion to fix its crumbling subway system.  Read more:  I've lived near Long Island City for more than a decade. Here's why an Amazon HQ2 in Queens may be a disaster. In just a few short years, Long Island City has become increasingly unaffordable for both renters and homeowners. In the  Hunters Point neighborhood, the area where many Amazon employees are  likely to locate, the median home value is around $1.2 million — more than five times the national average, according to data from Trulia.   A  recent analysis from home loan and mortgage company Mr. Cooper found that Amazon's HQ2 could  drive up home prices in its chosen city by nearly 30%.  The same effect could apply to rents as well. At around $2,700 per month, rents in Hunters Point are nearly double the national average. Throughout all of the city,  rents have increased by more than 5% from year to year.   If  rising rents in Seattle— the site of Amazon's current headquarters — are any indication of what's to come, many Long Island City residents could soon be priced out.  Data from real estate site RENTCafé shows that apartments in Long Island City have  exceeded 98% occupancy. With around 700 Amazon employees set to move into the city by 2019, that could make it difficult to find a place to live, and potentially drive up prices in the near future.   The good news is that Long Island City has around 15,400 apartment units under construction, though  not all of them will be affordable for current residents.   Amazon's new headquarters has been touted as a way to increase local economic activity. Among  many startups, the common understanding is that a rising tide lifts all boats: Amazon will introduce a new set of employees, who will then filter into existing businesses once they leave the company.  Data from the labor economists at ZipRecruiter  discovered the opposite. According to their analysis, workers at mega-firms like Amazon don't tend to stay in the same city when looking for a new job. The economists said this effect was particularly strong among more educated and experienced employees.  As part of the Amazon deal, New York gave the company up to  $1.7 billion in economic incentives. In reality, these incentives and tax breaks could be much higher, according to a  recent analysis from Good Jobs First, the leading tracker of corporate subsidies in the US.  In  an editorial for Fast Company, the director of Good Jobs First, Greg LeRoy, explained what happens when a company like Amazon doesn't pay their taxes.  \"There will be a huge burden shift,\" he wrote. \"Either everyone else's taxes will have to go up, or the quality of public services will have to go down, or some of both. There's no such thing as free growth.\"  As Amazon has expanded its presence in Seattle, local businesses have found it increasingly difficult to meet the demands of rising rents. In recent years, many beloved coffee shops, grocers, restaurants, and bars have been forced to shutter their doors.  After 25 years of business, an antique shop called Pike Place  announced its closure with a sign outside the store: \"The rent is too high,\" it read. \"It is time to say goodbye.\"  As Amazon prepares to move into the Anable Basin, the fate of local businesses hangs in the balance. The popular Anable Basin Sailing Bar & Grill, for instance, is located in the middle of Amazon's future headquarter site.  Long Island City has a relatively small population, but it already struggles to combat homelessness. This spring, residents of the city's  Blissville neighborhood opposed the conversion of a local hotel into a homeless shelter — one of many that have opened in the neighborhood this year.  In March, Councilman Van Bramer said his district was home to  four times as many homeless individuals as it produced. This situation is likely to worsen as Amazon employees move in and nab available housing stock.   Take what's happened in Seattle: As Amazon spurred local economic growth, the city saw a troubling  increase in homelessness, with the number of homeless residents rising by 9% each year since 2014.  Amazon may be powerless in the face of climate change, but it doesn't help that its second headquarters will be located directly along a flood zone. New research from Climate Central and the real estate site Zillow suggests that, under the most extreme projections of sea level rise, the Anable Basin  could be partially flooded by 2050.  By the time the new headquarters is complete, there's a 45% chance that flooding will already have arrived in Queens. Read more:  Amazon's HQ2 site in Long Island City, Queens could be flooded in the next 30 years. Here's what scientists predict for the headquarters."}