{"id": " I toured an exclusive NYC club where freelancers, fashion influencers and entrepreneurs pay up to $1,250 a month to network in a stylish Tribeca building — and I didn't feel nearly cool enough to be there ", "paragraph": " My first thought upon walking into Spring Place was that I didn't feel cool enough to be there.  Tucked away on a secluded side street in New York City's trendy Tribeca neighborhood, the hip members-only club opened in May 2016 and has since become a popular destination for fashion influencers, celebrities, and other creatives. Guests at its opening party included Leonardo DiCaprio and Victoria's Secret models, according to The Daily Beast.  Spring Place doesn't share how many members they have, but they did share with Business Insider that the largest percentage of those members — 18.6% — work in fashion. Another 17.8% work in media and communications, and 10.9% of members work in luxury and consumer goods. Other industries represented include tech, finance, film, art, music, philanthropy, and more.  Spring Place is set to open their second location in Beverly Hills at the end of October 2018.  A spokesperson for the club described it as \"a collaborative workspace and membership club connecting work, leisure, and entertainment for the community of global professionals and entrepreneurs in the business of shaping contemporary culture. Members are talented professionals looking for a flexible working environment with a unique service offering a strong network to expand their business.\"  I took a tour of Spring Place — here's what it's like. Source: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Bianca ValleSource: Bianca ValleSource: Bianca ValleSource: Bianca ValleSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Spring PlaceSource: Babba C. Rivera,Electrify MagSource: Babba C. RiveraSource: Babba C. RiveraSource: Babba C. RiveraSource: Soho HouseSource: Financial TimesSource: Babba C. RiveraSource: Babba C. RiveraSource: Spring Place"}