{"id": "Electronic Arts is getting in on the next big thing in video games with 'Project Atlas,' a cloud gaming service to take on Google and Microsoft", "paragraph": " Electronic Arts has announced a new cloud gaming platform, Project Atlas, that will be capable of streaming the company's latest video games to almost any mobile device or computer with a sufficient internet connection.  Chief Technology Officer  Ken Moss detailed Project Atlas in a blog post published to Medium on October 29th, just weeks after both Microsoft and Google revealed their own cloud gaming platforms.  Cloud gaming uses remote servers to stream video games directly to the player. In the simplest terms, the server runs the game and sends the player a video feed from the cloud, while the player's controller inputs are sent back to the server. This allows the user to play the game remotely on their choice of computer or mobile device. With the server doing the heavily lifting, players will no longer need expensive video game consoles to run the latest games. Of course, cloud-based services still require a strong, stable internet connection to stream games properly.  Google launched a private beta test of its cloud gaming service, ProjectStream, at the start of October, giving players access to the recently released \"Assassin's Creed Odyssey.\" The only requirements for ProjectStream are a computer Google's Chrome internet browser, and an internet connection with 25 mbps or higher download speed. While Google isn't known for video games, the ProjectStream experience was comparable to playing the game on PlayStation 4 or Xbox One, both of which start at $300. However, the ProjectStream beta doesn't work with mobile devices as of yet.  Microsoft followed Google with the announcement of Project xCloud, a gaming streaming service that will utilize the company's Azure Cloud computing service. Project xCloud will not enter beta tests until 2019, but Microsoft has already confirmed several popular Xbox games for the platform, including including \"Halo,\" \"Gears of War,\" \"Forza\" and \"Minecraft.\" According to Microsoft, thousands of developers will be able to release their new games simultaneously for Xbox and Project xCloud without additional steps. Rumors suggest that the next generation of Xbox devices will likely utilize some form of cloud gaming as well.  Now EA is the latest company to join the cloud gaming race. In describing Project Atlas, Moss explained that the service will streamline game development by providing a unified platform for developers. Currently, development teams need to spend additional time making sure their games play nice with whatever platform they're working with. This means ensuring that social features work on both PlayStation and Xbox, that stats are properly recorded and maintained on different networks, and that updates are consistent across separate platforms. With a cloud-based gaming service, developers would maintain full control of the game, effectively cutting out the middleman.  \"With the unified platform of Project Atlas, game makers will have the ability to seamlessly deploy security measures including SSL certificates, configuration, appropriate encryption of data, and zero-downtime patches for every feature from a single secure source,\" Moss wrote in the post. \"This means that they can focus on what game makers are best at — creating the best games.\"  As the largest video game developer in the world, EA's decision to pursue its own cloud gaming platform speaks to rapid change in the industry. Up until now, major game developers needed to choose which platforms their games could support, often leading to their audiences being fractured between different consoles.  By streaming games directly to players on a device of their choosing, EA can effectively cut out the middleman when it comes to content control and sales. With Project Atlas set to compete directly with Microsoft's Project xCloud and Google's ProjectStream, it will also be interesting to see if Electronic Arts is willing to share its new games on other streaming platforms.                                                                                                                                                          All three cloud gaming services are still very much in their testing phase, so it'll be some time before they're available to the public, and likely longer than that before they become mainstream. It remains to be seen what will come of traditional video game consoles if more developers start to prioritize streaming games from the cloud.  Get the latest Google stock price here. Get the latest Microsoft stock price here."}