{"id": "Rihanna appears to subtly show her disapproval after Victoria's Secret exec apologizes for making 'insensitive' comment about transgender models", "paragraph": " Victoria's Secret came under fire late last week after one of its executives was called out for making \"insensitive\" comments during an  interview with Vogue.  Ed Razek, chief marketing officer of Victoria's Secret parent company L Brands, said he didn't think the company's annual fashion show should feature \"transsexuals\" because \"the show is a fantasy.\"  \"It's a 42-minute entertainment special. That's what it is,\" he said. \"It is the only one of its kind in the world, and any other fashion brand in the world would take it in a minute, including the competitors that are carping at us.\"  He also said Victoria's Secret would not be adding larger sizes to its assortment and has no plans to feature plus-size models in its runway show.  \"We attempted to do a television special for plus-sizes [in 2000]. No one had any interest in it, still don't,\" he said.  These comments sparked an outcry online, which later led to Razek issuing a formal apology.  \"My remark regarding the inclusion of transgender models in the Victoria's Secret Fashion Show came across as insensitive. I apologize. To be clear, we absolutely would cast a transgender model for the show. We've had transgender models come to castings … And like many others, they didn't make it … But it was never about gender. I admire and respect their journey to embrace who they really are,\" he said.  Social-media users have been comparing Victoria's Secret's famous lingerie show to Rihanna's recent Savage X Fenty show, which ran during New York Fashion Week in  September. At the time, Rihanna's racy show, which included models of all shapes, sizes, and ethnic backgrounds, was praised for being inclusive. Read more: Rihanna zeroed in on Victoria's Secret's crown jewel with a raunchy new lingerie show While Rihanna has not commented on the recent Victoria's Secret news, she appeared to subtly express her opinion by liking an Instagram post that a fan had shared that criticized Victoria's Secret and praised Rihanna for the diversity in her campaigns. Both  Buzzfeed and  The Daily Mail spotted that she had apparently liked the post.  This Instagram post was a screenshot of a tweet put out by plus-size model Louise O'Reilly on Saturday. "}