{"id": "About 1,000 brooding octopuses found off California coast", "paragraph": " MONTEREY, Calif. (AP) — Scientists exploring the sea floor off the coast of central California for deep-water coral and sponges instead found an unprecedented sight: Hundreds of octopuses tucked between rocks with their tentacles inverted and covering groups of white eggs — a posture that is common among brooding females.  The cluster of more than 1,000 gray octopuses latching on to clean, dark rock was found last week in the Davidson Seamount, an underwater extinct volcano in the Monterey Bay National Marine Sanctuary, Chad King, a marine biologist at the sanctuary, said Tuesday.  A submersible's camera found the creatures on Oct. 23 nearly 2 miles (3 kilometers) below the surface during the first dive by the Nautilus, a vessel exploring the sanctuary and livestreaming its findings.  \"This is certainly the largest cluster of brooding deep-sea octopuses that has ever been spotted,\" added King, who is also the chief scientist aboard the Nautilus, a research vessel with a team from the National Oceanic and Atmospheric Administration and the nonprofit Ocean Exploration Trust.  It was the first time scientists have seen a cluster of Muusoctopus robustus octopuses off California's coast, King said.  This kind of aggregation of deep-sea octopuses has been reported only once before, when earlier this year a smaller group of about 100 were spotted brooding eggs in warm ocean water off the Central American nation of Costa Rica, the nonprofit said.  The octopuses lined up in the cracks of the clean rocks near shimmering fluid seeps that looked \"kind of like a heat wave off the pavement on a hot day,\" which suggests warm water, King said. But he added the submersible was not equipped to test the water for temperature or chemicals.  It's not clear why the creatures were gathered near fluid seeps that are associated with shrimp, anemones, snails and other animals.  \"It could be because the fluid seeping out of the rock is warm or maybe they like the clean, dark rock with no sediment,\" King said. \"There are so many questions that we have no answers for.\" "}