{"id": "An army vet and CEO says the advice his dad gave him at age 13 about 'résumé piles' helped him get into business school, start his own company, and decide who he'll hire", "paragraph": " Nick Black, the founder and CEO of GoodUnited, recently posted on LinkedIn about the best advice he ever got from his father: \"Life's about résumé piles.\"  You can  read the full post here, but the gist is that you want your résumé to sit in its own pile, apart from all the other candidates', because you have something that makes you stand out — and makes you irresistible.  We called Black to get more detail on how this advice has shaped his career as a captain in the army, a business-school student, and the head of GoodUnited, which helps nonprofits use Facebook Fundraisers.  When Black was 13 years old, his father gave him some tough love, telling him, \"In the Black family, we're not good-looking, we're not smart, we're not athletic. But we never quit.\" That persistence, Black's father said, differentiated them from everyone else.  Black took this message to heart. In high school, he was a football player, but his grades were mediocre. Still, he ended up getting into schools he \"had no business applying to,\" presumably because he'd expressed interest in joining the army. Black was admitted to Johns Hopkins, where he participated in the school's Army ROTC and served as president of his fraternity.  After college, Black served as a captain in the US Army, before deciding he wanted to apply to business school.  He had his heart set on the University of North Carolina's Kenan-Flagler Business School. And while his GMAT score was low, Black told the admissions officers, \"I'm going to make you look good\" with his military experience. (By this point, Black had also lived all over the world.) The school accepted him, and he went on to launch his own company.  Today, as the CEO of GoodUnited, Black looks at what makes candidates unconventional.  He's not just choosing people who went to the Wharton School of Business, he said. \"What else do you got?\" he wants to know. \"What else do you bring to the table?\" For example, Black recently hired someone who had started working for GoodUnited without compensation because the person was so committed to the mission.                                                                                 Read more: Starbucks' former HR exec says a job candidate's answer to a simple interview question predicts success better than their entire résumé Black's insights recall those of marketing and strategy consultant Dorie Clark. In her 2015 book \"Stand Out: How to Find Your Breakthrough Idea and Build a Following Around It,\" Clark wrote that you can  differentiate yourself professionally by applying your knowledge and talents in a new context.  Here's one of her favorite examples: If you're a lawyer who loves comic books, you might start a talent-management wing where you represent the legal interests of comic-book artists. \"Becoming recognized in your niche is a pitched battle when you're up against others who have the exact same credentials you do,\" Clark writes.  As for Black, he remembers his father telling him when he was younger, \"If you just apply for one thing, and you play by the rules, and you're cookie cutter, you're not gonna win.\" "}