{"id": "I bought a used Nintendo Switch console that was refurbished by Nintendo itself, and I'm happy I didn't buy it new", "paragraph": "                                            Nintendo                                     Up until recently, I was on the fence about the Nintendo Switch.  Apart from the great games, getting a nice little discount on a used unit that's been refurbished by Nintendo itself helped push me over the edge.  I found Nintendo's own refurbished standard Switch consoles on  eBay for $265, which makes for a $35 discount off the $300 price tag of a brand-new unit.  After taxes, I paid $281 for the refurbished Switch, versus the $317 I would have paid after taxes on  Amazon. That's a tidy little $36 discount. Those in the US know that taxes can vary, so my particular example might not apply to those outside of Connecticut where I bought the Switch.  It doesn't seem like much, but it's an extra $36 to spend on games or a microSD card to expand on the Switch's paltry 32GB of onboard storage. I could get this  $35 200GB microSD card for tons more games, for example.  All in all, I'm happy I didn't spend the extra $36 to buy a new Nintendo Switch, which would have felt like $36 wasted after knowing how good the refurbished units are — especially since you get Nintendo's factory one-year warranty with refurbished units, too.  And much like my experience with a  used MacBook Pro I bought refurbished from Apple itself, it felt like I got my used Nintendo Switch from Nintendo rather than the previous owner. Unfortunately, at the time of writing, Nintendo seems to have raised the price of a refurbished Switch from $265 to $275 on eBay. Still, I'd say it's worth the discount over buying a brand new model. It really doesn't seem necessary to buy a brand new model when refurbished units are so good.Check out the used Nintendo Switch I bought that was refurbished by Nintendo itself: Inside the box, everything was properly packaged and wrapped in plastic. It looks like the packaging of a brand-new device. On the box, it says the unit was cleaned, tested, and inspected.  It included everything that comes with a new Nintendo Switch, including the Switch console itself, the dock, two controllers, a controller adapter, an HDMI cable, a USB-C power brick, and the strap accessories for the remote.  There were no signs of scratches, blemishes, or that the console had been used at all. createPerformanceMark('first image displayed'); There was no indication that anyone had used these controllers before, at all. If they aren't new, they could easily pass as brand-new.  There were a few light scratches on the back of the dock, inside the recessed area. These don't bother me at all, as the only time I'd ever see them is when I plug in the cables into the dock.  Otherwise, the dock's front is completely blemish-free and also looks brand-new.  As for the cables, they appeared new rather than used. It's not clear if Nintendo replaced the cables with new ones in refurbished Switch units.  I've only been using the Nintendo Switch for the last week, and I haven't run into any problems at all.  There's always the chance that something could break or stop working properly on my Switch, but Nintendo's refurbished devices come with the factory one-year warranty should anything happen in that first year, just like a brand-new model. "}