{"id": "We’re altering the climate so severely that we’ll soon face apocalyptic repercussions. Sucking carbon dioxide out of the air could save us.", "paragraph": " Deadly hurricanes seem to be becoming more frequent, 12 of the 15  largest wildfires in California history have occurred in the last two decades, and cities like  Cape Town, South Africa are facing severe water shortages.  This isn't a coincidence.  These kinds of dangerous weather events are linked to carbon-dioxide emissions. In human history, the atmosphere has  never had as much CO2 in it as it does today. Burning fossil fuels for energy, clearing forests, and demolishing wetlands all contribute to the problem.  CO2 stops heat from leaving the planet, which is why Earth's average temperature is a degree Celsius higher than it used to be. Now we're on track to see  so much warming over the next several decades that apocalyptic repercussions could result.  A  recent report from the Intergovernmental Panel on Climate Change (IPCC) predicts that just another half-degree temperature rise — which is predicted to happen by the year 2040 — will lead to severe drought, even more intense hurricanes, and the death of most coral reefs. These changes could trigger huge migrations of people and mass extinctions of animals.  There are two ways to deal with this problem. The first is to make  big changes to the ways we power our lives and grow food in order to stop putting greenhouse gas into the atmosphere. The second is to suck carbon dioxide back out of the air then store it away or turn it into new products or fuels.  A comprehensive new report looks at that second approach.  The study, written by scientists from the National Academies of Sciences, Engineering, and Medicine (NAS), suggests a plan for developing so-called \"negative-emissions technologies\" (a term for ways to remove CO2 from the atmosphere) and highlights options that have essentially unlimited capacity for reducing carbon levels in the atmosphere, but aren't yet ready for prime time.  Researching and developing those technologies requires substantial investment from the US government — and the report's authors say that money needs to start flowing soon, or we could soon cross dangerous climate tipping points. People make their way through heavy smog on an extremely polluted day with red alert issued, in Shengfang, China.Damir Sagolj/Reuters According to the recent IPCC report and most other models of our climate future, cutting CO2 emissions over the next few decades won't be enough to fully stop climate change, since the effects are already being felt.                                                                                                          \"It's not a question of 'Maybe we'll need negative emissions technologies or maybe we can prevent more CO2 from going into the air'\" Erin Burns, a senior policy advisor at the think tank Third Way, told Business Insider. \"We are at a point where we need all of those things.\"  That's why the NAS took a thorough look at potential negative-emissions technologies.  \"Most climate mitigation efforts are intended to decrease the rate at which people add carbon from fossil fuel reservoirs to the atmosphere. We focused on the reverse - technologies that take carbon out of the air and put it back into ecosystems and the land,\" Stephen Pacala, a professor at Princeton University and chair of the committee behind the report, said in a statement.  The authors looked at a variety of strategies. As Kate Gordon, a fellow at Columbia University's Center on Global Energy Policy, described it, the approaches range \"from literally planting trees and agricultural practices that help keep carbon in the ground, all the way to engineered technological solutions that actually take carbon directly out of the atmosphere through machines.\"  On the simpler end of the spectrum are options like re-foresting areas that have been logged and using no-till farming practices that keep more carbon in soil. Then there are ways to burn biological material (which traps carbon as it grows) to create energy and catch the CO2 they emit before it gets into the air. Cattle graze in a deforested area of the Peten jungle in Guatemala, near the border with Belize, on November 23, 2007.                                            Reuters/Daniel LeClair                                     But according to the new report — funded by the US Department of Energy, EPA, NOAA, and the US Geological Survey, along with several foundations — those approaches require a lot more research to be scaled up, and there's no way those methods alone could ever capture enough carbon to keep Earth's temperature from rising another degree.                                                                                                          \"Uncertain research breakthroughs will be required before those NETs [negative emissions technologies] can provide even the minority share of the solution,\" the authors wrote.  A more promising option, they said, is to invest in technologies that essentially filter out CO2 molecules from the air around us. These technologies are still in early development stages, but usually involve materials that naturally attract and bind with carbon.  \"It's like draining a bathtub — like pulling the plug and letting a little bit of the water out. It's actually not that sophisticated or crazy,\" Gordon told Business Insider.  That carbon would then get concentrated and stored, perhaps by injecting it into pores in deep underground rock, which is essentially where it came from in the first place. There's not much limit to how much CO2 these potential technologies could capture and store.  We need this kind of intervention immediately, according to the authors.                                                                                                          \"We need to be committed to it today, because we know from all the modeling that's happening that this is not an if question, it's a when question,\" Gordon said.  To give these carbon-sucking technologies the boost they need to become a reality soon, the researchers said the US must start investing in research and development now.  Doing so would help improve the simpler carbon-capture solutions that already exist, and make progress on the more advanced ones that could eventually make the biggest impact.  The report even lists potential research projects and their estimated costs.  \"They are amounts of money that are less than we've spent on plenty of other really, really important technologies,\" Burns said.                                                                                                          There's a growing interest in these technologies in the private sector, too — a company called Climeworks is developing ways to suck CO2 out of the air, and the accelerator Y Combinator recently announced it is looking to support startups focusing on negative-emissions technologies. A facility made by Climeworks AG to capture CO2 from the air is seen on the roof of a waste incinerating plant in Hinwil, Switzerland.Arnd Wiegmann/Reuters But Burns said government support will be key, as it was for solar power (which started out as a NASA invention) and nuclear energy.  Beyond helping to stabilize the climate and prevent future disasters, the report says, investing in these technologies would help the US economically, since there will be even greater need for carbon capture in the future. The first countries and companies to develop scalable, cost-effective CO2-filtering technology will benefit as demand for that intellectual property rises.  \"This is where markets are going. This is the new set of technologies that people are starting to pay attention to, and we need to keep our competitive innovation position,\" Gordon said, citing American leadership in the clean-tech sector. \"Otherwise we'll be buying it from somebody else, because someone's going to do it.\" Smog in Beijing.                                            Kevin Frayer/Getty Images                                     Because of that, Burns said, she's seeing more congressional support for funding research and development of these technologies than there is for other climate-change solutions. There are other reasons for that bipartisan interest as well: carbon-capture technology could help fossil-fuel companies in the long run too, and funding research gives politicians a way to make progress on the climate issue without levying new taxes or asking people to immediately change the ways they live.                                                                                                          \"One of the nice things about carbon capture and removal and use is that even if you don't care about climate change, you can really like these technologies and see the opportunity in them,\" she said. "}