{"id": "Everything you need to know about the top teams in college basketball this season", "paragraph": " It's been seven months since the Villanova Wildcats brought home their second NCAA Championship trophy in three years, and we're finally ready to ring in the 2018-19 college basketball season.  After reaching last year's Final Four, the Kansas Jayhawks headline the AP Top 25 preseason poll with 37 first-place votes. But for the first time since the 2004-05 season,  seven different teams received first-place votes, including No. 2 Kentucky, No. 3 Gonzaga, No. 4 Duke, No. 5 Virginia, No. 6 Tennessee, and No. 9 Villanova.  On the other end of the spectrum, No. 12 Kansas State, No. 14 Oregon, No. 15 Virginia Tech, No. 16 Syracuse, No. 18 Mississippi State, No. 23 LSU, and No. 25 Washington all launched into this year's top 25 after failing to make the list at any point during the 2017-18 season.  With so much uncertainty at the top and a ton of new faces in the mix, this college basketball season is primed to be extremely unpredictable and incredibly exciting. Check out Business Insider's previews for the nation's top teams before the season tips off:  Head coach: Bill Self  Last season's record: 31-8, 13-5 in the Big 12  Players to know: F Dedric Lawson (19.2 PPG, 9.9 RPG, 2.1 BPG at Memphis), G Lagerald Vick (12.1 PPG, 4.8 RPG), C Udoka Azubuike (13.0 PPG, 7.0 RPG, 1.7 BPG)  Led by Consensus First Team All-American Devonte' Graham, last season's Jayhawks secured their 14th consecutive Big 12 title before advancing to the Final Four to take on eventual national champion Villanova. Even after losing their top three scorers in Graham, Svi Mykhailuik, and Malik Newman, Kansas is ranked first with 37 first-place votes in this year's AP Top 25 preseason poll. Three top-30 recruits will bring their talents to Lawrence to compliment senior guard Lagerald Vick and junior center Udoka Azubuike. Additionally, head coach Bill Self brings in a heralded transfer class in former Memphis standouts Dedric and KJ Lawson and Cal point guard Charlie Moore. There is little doubt that this is a ragtag group of players, but there is even less doubt that they have enough talent to do big things this season.  Head coach: John Calipari  Last season's record: 26-11, 10-8 in the SEC  Player's to know: F P.J. Washington (10.8 PPG, 5.7 RPG), F Reid Travis (19.5 PPG, 8.7 RPG at Stanford), F E.J. Montgomery (Five-star recruit, No. 14 in ESPN 100)  No one has embraced the one-and-done era quite like Kentucky head coach John Calipari, but this year's Wildcats roster is less stacked with NBA-caliber talent than usual. Still, four five-star recruits and Stanford graduate transfer Reid Travis join experienced sophomores P.J. Washington, Quade Green, and Nick Richards in Lexington in what promises to be a better season for Kentucky than 2017-18. Midway through last year's campaign, the Wildcats fell out of the AP rankings for the first time since 2014 and finished in a three-way tie for fourth in the SEC. As per usual, however, Kentucky came alive in March to win the SEC Tournament and make a run to the Sweet 16. The bar is even higher this season, with the Wildcats looking to return to the Final Four for the fifth time in nine years.  Head coach: Mark Few  Last season's record: 32-5, 17-1 in the WCC  Players to know: F Killian Tillie (12.9 PPG, 5.9 RPG), G Zach Norvell Jr. (12.7 PPG, 3.9 RPG), G Josh Perkins (12.3 PPG, 5.3 APG)  Over the past four years, head coach Mark Few has led the Bulldogs to two Sweet 16s, and Elite Eight, and a national championship game appearance. In his 20th year at the helm, Few will look to earn the program's first-ever national championship with yet another cast of talented veterans. Gonzaga lost its leading scorer and rebounder in Johnathan Williams but returns its next four top scorers. Guard Josh Perkins ranked fourth in the conference with 5.3 assists per game last season while forward Killian Tillie averaged 24 points on 13-of-14 shooting from beyond the arc during the WCC Tournament to earn MVP honors. Each of the Bulldogs' starters could very well make his case for WCC player of the year en route to yet another NCAA Tournament run.  Head coach: Mike Krzyzewski  Last season's record: 29-8, 13-5 in the ACC  Players to know: SF R.J. Barrett (Five-star recruit, No. 1 in ESPN 100), PF Zion Williamson (Five-star recruit, ), SF Cam Reddish (Five-star recruit, No. 3 in ESPN 100)  When the Blue Devils won their last national championship in 2015, head coach Mike Krzyzewski reeled in the nation's top recruiting class and featured four freshmen in his starting rotation. He's attracted the top recruiting class in each of the last three seasons with the hopes of replicating those results, and the Blue Devils were  one unlucky bounce away from returning to the Final Four last year. Now, the top-three recruits in a single class — including  dunking sensation Zion Williamson and AP preseason All-America selection R.J. Barrett — have chosen the same landing spot for the first time ever and Krzyzewski will welcome them to Durham with open arms. Add five-star point guard Tre Jones — who happens to be the younger brother of  Duke national champion Tyus Jones— and a couple of veteran role players into the mix, and Krzyzewski may just be en route to his sixth national championship.  Head coach: Tony Bennett  Last season's record: 31-3, 17-1 in the ACC  Players to know: G Kyle Guy (14.1 PPG, 1.5 APG), G Ty Jerome (10.6 PPG, 3.9 APG), G De'Andre Hunter (9.2 PPG, 3.5 RPG)  The Cavaliers made all kinds of history last season. They held on to the top spot in the AP Poll throughout the regular season and became the first team to win 17 games in the ACC. Virginia also suffered a historic upset at the hands of the UMBC Retrievers and notoriously became the first No. 1 seed to lose to a No. 16 seed in the history of the NCAA Tournament. Despite all of their recent regular-season success, the Cavaliers have yet to win a national championship and haven't appeared in the Final Four since 1984. AP preseason All-America selection Kyle Guy and a band of veteran players will look to help Virginia shake off its reputation as the resident NCAA Tournament choke artist.  Head coach: Rick Barnes  Last season's record: 26-9, 13-5 in the SEC  Players to know: F Grant Williams (15.2 PPG, 6.0 RPG), G Admiral Schofield (13.9 PPG, 6.4 RPG), Kyle Alexander (5.6 PPG, 5.6 RPG, 1.7 BPG)  Tennessee's successful 2017-18 season — complete with a share of the SEC regular-season crown and a trip to the second round of the NCAA Tournament — came as a surprise to many in the world of college basketball. The Volunteers return all five starters from last year's campaign for this season and, as a result, they earned the highest ranking in the preseason AP Top-25 Poll in program history. Expect junior forward Grant Williams to defend his 2018 SEC Player of the Year title by improving upon an already impressive stat sheet. With Admiral Schofield and Kyle Alexander to boot, Tennessee should vie for another SEC championship and make a run at its first-ever national championship.  Head coach: Eric Musselman  Last season's record: 29-8, 15-3 in the Mountain West  Players to know: F Caleb Martin (18.9 PPG, 5.4 RPG), F Cody Martin (14.0 PPG, 6.3 RPG, 4.7 APG), G Jordan Caroline (17.7 PPG, 8.6 RPG)  The Wolf Pack shocked the world by forging their way into the Sweet 16 of last year's NCAA Tournament. Now, all eyes are on Nevada and AP preseason All-America selection Caleb Martin. Head coach Eric Musselman bolsters one of the best trios in college basketball — Martin, his twin brother Cody, and guard senior Jordan Caroline — with McDonald's All-American Jordan Brown and Old Dominion graduate transfer Trey Porter. The Wolf Pack will almost certainly win the Mountain West regular season championship for the third straight year and make another deep run in the postseason.  Head coach: Roy Williams  Last season's record: 26-11, 11-7 in the ACC  Players to know: F Luke Maye (16.9 PPG, 10.1 RPG), G Cameron Johnson (12.4 PPG, 4.7 RPG), F Nassir Little (Five-star recruit, No. 6 in ESPN 100)  North Carolina finished in a four-way tie for fourth in the ACC before falling to Texas A&M in the second round of last season's Big Dance, but this year the Tar Heels may have all the pieces to make a deep run in the postseason. North Carolina lost top scorer Joel Berry II, but walk-on turned AP preseason All-America selection Luke Maye projects to be the Player of the Year in a stacked ACC. Factor in sharpshooting seniors Cameron Johnson and Kenny Williams, top-10 recruit Nassir Little, and Hall of Fame coach Roy Williams and the Tar Heels may just be poised to return to the NCAA title game for the third time in four years.  Head coach: Jay Wright  Last season's record: 36-4, 14-4 in the Big East  Players to know: F Eric Paschall (10.6 PPG, 5.3 RPG), G Phil Booth (10.0 PPG, 2.9 APG), PG Jahvon Quinerly (Five-star recruit, No. 26 in ESPN 100)  The reigning national champions received one first-place vote in the preseason AP Top 25 Poll, and now they're out to prove to everyone that they still have the chops to compete at the top level. Head coach Jay Wright lost his four leading scorers to the NBA this offseason but has three talented seniors vying for starting roles along with a McDonald's All-American point guard in freshman Jahvon Quinerly. Villanova figures to win the Big East for the third straight year, but whether or not the team will once again contend for a national title remains to be seen.  Head coach: Tom Izzo  Last season's record: 30-5, 16-2 in the Big Ten  Players to know: PG Cassius Winston (12.6 PPG, 6.9 APG), C Nick Ward (12.4 PPG, 7.1 RPG), G Joshua Langford (11.7 PPG, 3.0 RPG)  The Spartans dominated their competition during the regular season but struggled to make their mark during the postseason last year. Michigan State lost to the Michigan Wolverines in the semifinals of the Big Ten tournament before falling to the No. 11 Syracuse Orange in a massive upset in the second round of the NCAA Tournament. In the offseason, head coach Tom Izzo lost both Miles Bridges and Jaren Jackson to the NBA but welcomed three four-star recruits to help fill their void. The Spartans' key to success this season could very well be guard Joshua Langford, who came to East Lansing as five-star recruit two years ago but has yet to live up to his full potential.  Head coach: Bruce Pearl  Last season's record: 26-8, 13-5 in the SEC  Players to know: G Bryce Brown (15.9 PPG, 2.0 RPG), G Jared Harper (13.2 PPG, 5.4 APG), F Danjel Purifoy (11.5 PPG, 4.7 RPG, 1.4 SPG in the 2016-17 season)  Auburn's successful 2017-18 season came as a surprise to much of the basketball world. The Tigers tied Tennessee for the SEC regular-season championship before making their first NCAA Tournament appearance since 2003. Head coach Bruce Pearl returns three of last year's starters and two former ESPN 100 recruits who were held from competition last season due to involvement in the university's FBI investigation. Even though five of the AP Poll Top-25 teams are SEC schools, Auburn has a good shot at repeating as conference champions and making a name for themselves in the NCAA Tournament.  Head coach: Bruce Weber  Last season's record: 25-12, 10-8 in the Big 12  Players to know: F Dean Wade (16.2 PPG, 6.2 RPG), G Barry Brown Jr. (15.9 PPG, 3.2 APG), F Xavier Sneed (11.1 PPG, 5.1 RPG)  After struggling through the 2017-18 regular season with 12 losses and a 2-7 record against ranked opponents, the Wildcats put all the pieces together to take down Big 12 powerhouse Kansas in the NCAA Tournament to advance to their first Elite Eight appearance since 2010. With head coach Bruce Weber returns each of his five starters and three of his top four scorers off the bench, Kansas State may just prove to be the most formidable challenger to the Jayhawks' bid for their 15th-straight Big 12 title.  Head coach: Bob Huggins  Last season's record: 26-11, 11-7 in the Big 12  Players to know: F Sagaba Konate (10.8 PPG, 7.6 RPG, 3.2 BPG), F Esa Ahmad (10.2 PPG, 5.5 RPG), PG James Bolden (8.7 PPG, 1.1 APG)  Last season, West Virginia made a run to the Sweet 16 on the backs of seniors Jevon Carter and Daxter Miles Jr. Together, the duo accounted for 37.8 percent of the Mountaineers' scoring and 64.7 percent of their assists, so filling their shoes will not be an easy feat. However, with both low-block powerhouse Sagaba Konate and versatile small forward Esa Ahmad withdrawing from the NBA Draft to return to Morgantown, head coach Bob Huggins' roster boasts plenty of veteran talent. Add two four-star recruits into the mix and West Virginia may just have what it takes to rise to the top of the Big 12 and mount another strong bid in March.  Head coach: Dana Altman  Last season's record: 23-13, 10-8 in the Pac-12  Players to know: PG Payton Pritchard (14.5 PPG, 4.8 APG), C Bol Bol (Five-star recruit, No. 4 in ESPN 100), SF Louis King (Five-star recruit, No. 11 in ESPN 100)  The Ducks failed to make the NCAA Tournament last season but hope that a stacked roster — complete with five recruits in the ESPN 100 — will be enough to replicate their sensational Final Four appearance the year prior. Junior point guard Payton Pritchard was able to carry last year's team, but this year he'll have top-five recruit Bol Bol to feed in the paint and fellow five-star recruit Louis King waiting on the wing. Aside from overall inexperience, there is very little stopping Oregon from thriving this year.  Head coach: Buzz Williams  Last season's record: 21-12, 10-8 in the ACC  Players to know: PG Justin Robinson (14.0 PPG, 5.6 APG), F Kerry Blackshear Jr. (12.5 PPG, 5.9 RPG), Nickeil Alexander-Walker (10.7 PPG, 3.8 RPG)  Head coach Buzz Williams has had unprecedented success bringing Virginia Tech's basketball program into the limelight. The Hokies have made the NCAA Tournament in each of the past two seasons and have the pieces to string together another great season. Aside from second-leading scorer Justin Bibbs, Virginia Tech returns all of its key contributors. That being said, the program announced Wednesday that senior wing Chris Clarke — their top rebounder last season — had been suspended indefinitely.  Head coach: Jim Boeheim  Last season's record: 23-14, 8-10 in the ACC  Players to know: G Tyus Battle (19.2 PPG, 1.5 SPG), F Oshae Brissett (14.9 PPG, 8.8 RPG), G Frank Howard (14.4 PPG, 4.7 APG)  Last year, head coach Jim Boeheim led a wayward team of seven healthy scholarship players to the Sweet 16 for the sixth time in the last 10 years. This year, the Orange return all five starters — including superstar shooting guard and NBA prospect Tyus Battle — and part ways with just one significant contributor from last season. With its best roster in years and the third-best defense in the country according to Ken Pom, Syracuse is primed to sit at or near the top of an ultra-competitive ACC and make a deep run in the postseason.  Head coach: Leonard Hamilton  Last season's record: 23-12, 9-9 in the ACC  Players to know: F Phil Cofer (12.8 PPG, 5.1 RPG), G Terance Mann (12.6 PPG, 5.4 RPG, 2.6 APG), PG Trent Forrest (7.9 PPG, 4.9 RPG, 4.1 APG)  Florida State is coming off a fantastic 2017-18 regular season and a sensational postseason run to the Elite 8. Early on in the offseason, there were big questions about how this team would look going forward; sophomore point guard C.J. Walker announced his decision to transfer schools in late March while top scorer Phil Cofer's future in Tallahassee remained uncertain. He was granted a fifth year in May, and now head coach Leonard Hamilton looks primed to lead a strong returning core to its first Final Four appearance since the Seminoles won the national championship in 1972.  Head coach: Ben Howland  Last season's record: 22-11, 9-9 in the SEC  Players to know: G Quinndary Weatherspoon (14.4 PPG, 6.0 RPG, 1.4 SPG), F Aric Holman (10.9 PPG, 6.7 RPG), G Lamar Peters (9.4 PPG, 4.5 APG, 1.5 SPG)  The Bulldogs didn't make the NCAA Tournament last year, or the year before, or the seven years before that, but they return the vast majority of their players and 81.9 percent of their scoring from last season. Mississippi State made it to the NIT semifinals, but many thought the team deserved a spot in the NCAA Tournament. This summer, head coach Ben Howland welcomed the nation's 16th-best recruiting class — complete with three four-star recruits — to Starkville with the hopes of bolstering an experienced roster with some fresh talent.  Head coach: John Beilein  Last season's record: 33-8, 13-5 in the Big Ten  Players to know: G Charles Matthews (13.0 PPG, 5.5 RPG), G Jordan Poole (6.0 PPG, 1.4 RPG), C Jon Teske (3.4 PPG, 3.3 RPG)  Michigan basketball has been hot as of late. The Wolverines won back-to-back Big Ten tournament titles before making an appearance in the national championship game last season. Head coach John Beilein lost three of his four top scorers this offseason, but some younger players — like  buzzer-beating sensation Jordan Poole— made names for themselves during Michigan's latest NCAA Tournament run. Now, those same players will be tasked with sustaining the Wolverines' recent success into the 2018-19 season.  Head coach: Jamie Dixon  Last season's record: 21-12, 9-9 in the Big 12  Players to know: PG Alex Robinson (9.7 PPG, 6.1 APG), G Jaylen Fisher (12.3 PPG, 5.4 APG), G Desmond Bane (12.5 PPG, 4.1 RPG)  The Horned Frogs made the NCAA Tournament for the first time in 20 years, but they failed to come away with a win. This year, TCU will try to get the job done without Vladimir Brodzianski and Kenrich Williams, last year's best players who together accounted for 28.2 points per game and 40 percent of the team's rebounding. That being said, head coach Jamie Dixon has used his program's renewed prominence to his advantage, accumulating solid recruits year after year to form a solid, experienced team heading into this season.  Head coach: Steve Alford  Last season's record: 21-12, 11-7 in the Pac-12  Players to know: G Kris Wilkes (13.7 PPG, 4.9 RPG), G Jaylen Hands (9.9 PPG, 2.6 APG), C Moses Brown (Five-star recruit, No. 15 in ESPN 100)  The Bruins never really recovered from the drama-filled start to their season and were knocked out in the play-in round of the NCAA Tournament. Head coach Steve Alford brought in a whopping six recruits — four of whom rank in the ESPN 100 — to help fill the void last year's leading scorer Aaron Holliday left. With four players with significant starting experience and sophomore Kris Wilkes poised for a breakout year, this young squad may just have what it takes to return the program John Wooden built to the top of the Pac-12 at long last.  Head coach: Brad Brownell  Last season's record: 25-10, 11-7 in the ACC  Players to know: G Marcquise Reed (15.8 PPG, 4.7 RPG), G Shelton Mitchell (12.2 PPG, 3.6 APG), PF Elijah Thomas (10.7 PPG, 8.1 RPG, 2.3 BPG)  The Tigers won their first NCAA Tournament game in 21 years in 2018, and they'll strive for even bigger accomplishments this season. Clemson lost their second and third leading scorers in Gabe DeVoe and Donte Grantham, but head coach Brad Brownell returns every other significant contributor from last year's Sweet 15 run. With three redshirt seniors, a senior, and a sophomore in their projected starting lineup, the Tigers have the experience and the talent to excel in the always-competitive ACC.  Head coach: Will Wade  Last season's record: 18 - 15, 8-10 in the SEC  Players to know: PG Tremont Waters (15.9 PPG, 6.0 APG), G Skylar Mays (11.3 PPG, 1.6 SPG), PF Nazreon Reid (Five-star recruit, No. 12 in ESPN 100)  LSU boasts one of the top-five recruiting classes in the country and returns one of the top point guards in sophomore Tremont Waters, who was named to the 20-man Bob Cousy Award preseason watch list. After  junior forward Wayde Sims died in a shooting in September, the Tigers will look to mount a campaign to land near the top of the SEC and notch their first NCAA Tournament win of this decade in his honor.  Head coach: Matt Painter  Last season's record: 30-7, 15-3 in the Big Ten  Players to know: PG Carsen Edwards (18.5 PPG, 2.8 APG), PF Evan Boudreaux (17.5 PPG, 9.5 RPG at Dartmouth), C Emmanuel Dowuona (Four-star recruit, No. 91 in ESPN 100)  After Purdue won 30 games for the first time in program history last season, leading scorer Carsen Edwards considered taking his talents to the NBA. Instead, the 6-foot-1, 200-pound guard returned for his junior year with the Boilermakers, and he's already been awarded for the decision. He was the leading vote-getter on the AP preseason All-America team and hopes to lead a new-look Purdue squad — complete with four new starters — to its first Final Four appearance since 1980.  Head coach: Mike Hopkins  Last season's record: 21-13, 10-8 in the Pac-12  Players to know: PF Noah Dickerson (15.5 PPG, 8.4 RPG), SG Jaylen Nowell (16.0 PPG, 4.0 RPG), SF Matisse Thybulle (11.2 PPG, 2.6 APG)  The last time the Huskies were in the spotlight, their roster boasted future Philadelphia 76ers point guard Markelle Fultz, and they still went just 9-22 on the season. With an 11-win improvement last year under newly-minted head coach Mike Hopkins, Washington looks primed to secure its first NCAA Tournament berth since 2011. With their eight top scorers returning to Seattle and a top-40 recruiting class, the Huskies are primed to make a mark in a not-so-strong Pac-12. "}