{"id": "Trump reportedly wanted to shut down the entire US-Mexico border, but his aides talked him out of it", "paragraph": " President Trump is growing impatient with the flow of people fleeing deadly violence in Central America, and is said to have threatened to close off the southern border completely at one point.  He got so frustrated over the summer, that he asked his staff to \"close the whole thing\" during a meeting in the Oval Office, as The  Washington Post reported Saturday.  That action would have thrown trade relations between Mexico and the US into chaos, and ground to a halt one of the  busiest borders in the world. White House aides managed to talk him out of the idea, the Post reported, by pointing out the $600 billion-plus trade relationship the two countries share.  Mexico and the US  signed on to a new, sweeping trade deal in August, and Mexico is the US's third largest trading partner, and second biggest market for US exports. The US exported more than $276 billion worth of goods and services to Mexico in 2017, and imported nearly $340 billion, according to the office of the US trade representative.  On  Twitter Thursday, as thousands of people made their way towards Mexico from Central America seeking safety, Trump repeated his border closing cry, saying \"I must, in the strongest of terms, ask Mexico to stop this onslaught - and if unable to do so I will call up the U.S. Military and CLOSE OUR SOUTHERN BORDER!\"  That has been done before, but rarely.  President George W. Bush partially closed the borders and put all travel, trade, and immigration under strict inspection after the terror attacks on September 11, 2001, as  USA Today pointed out. Before that, the US-Mexico border was shut down entirely in 1985 after the killing of a Drug Enforcement Agency (DEA) agent in Mexico.  Later on Thursday, Trump thanked Mexico for shuttling riot police to the Guatemala border, saying in a tweet that \"we look forward to working with you!\"  Disputes over how to handle the looming crisis have rattled the White House in recent days, reportedly prompting  a profane cursing match between White House chief of staff John Kelly and National Security Adviser John Bolton outside Trump's Oval Office.                                                                                                                                                          Meanwhile, the Mexican government is dealing with a border crisis of its own on the southern edge of that country, as a caravan of more than 3,000 people fleeing deadly violence in the Central American countries of Honduras, El Salvador, and Guatemala rushed over the border into Mexico on Friday, seeking shelter from gang violence and hoping to stay alive.  Thousands of the hungry, desperate migrants intend to press on towards the US, where Department of Homeland Security officials say they're already \"catching 1,500 people a day,\" according to the Post. A child is carried over the border fence as thousands of Honduran migrants rush across the border towards Mexico, in Tecun Uman, Guatemala, Friday, Oct. 19, 2018. Migrants broke down the gates at the border crossing and began streaming toward a bridge into Mexico.                                            AP Photo/Oliver de Ros                                     \"I want to get to the States to contribute to that country,\" a migrant named Christian, who said he was fleeing gangsters demanding one-fifth of his monthly income, told the Associated Press, \"to do any kind of work, picking up garbage.\"  Human rights expert and historian Dana Frank told the Associated Press that the determination of the migrants underscores how bad the situation in Central America has become, highlighting \"how desperate the Honduran people are — that they'd begin walking toward refuge in the United States with only a day pack full of belongings.\"                                                                                                                                                          The number of illegal border crossings along the southwest border of the US ticked up this year, with the number of unaccompanied children streaming into the US soaring by 16,000, while the total number of apprehensions along the southwest border from October 1, 2017 to August 31 of this year was up to 355,106, according to the US Department of Homeland Security. "}