{"id": "12 startups that failed this year and took $1.4 billion in VC funding with them", "paragraph": " Just because everyone from  Ashton Kutcher to  Kevin Durant are getting into startups doesn't mean they're all success stories.  After all, nine out of 10 startups  will end up failing, and that means the money that venture capitalists put into funding these ideas can disappear too. From analyzing just 12 startups that failed this year,  PitchBook found that around $1.4 billion in VC funding wasn't enough to save these businesses.  Theranos, a blood-testing startup, is one of 2018's most notable failures. The company racked up close to $1 billion in funding before questions about the technology and  fraud charges against the CEO caused the  Theranos to dissolve. Here are 12 startups that failed in 2018:Year founded: 2003 Valuation: $9 billion Amount raised: $910 million Read more about Theranos on PitchBook.Year founded: 2008 Valuation: $291 million Amount raised: $150 million Read more about Rethink Robotics on PitchBook.Year founded: 2013 Valuation: $275 million Amount raised: $62 million Read more about Shyp on PitchBook.Year founded: 2007 Valuation: $90 million Amount raised: $56 million Read more about Apprenda on PitchBook.Year founded: 2011 Valuation: $59 million Amount raised: $104 million Read more about Airware on PitchBook.Year founded: 2010 Valuation: Unknown ($55 million in November 2016) Amount raised: $44 million Read more about Alta Motors on PitchBook.Year founded: 2013 Valuation: $52 million Amount raised: $89 million Read more about Primary Data on PitchBook.Year founded: 2011 Valuation: $46 million Amount raised: $26 million Read more about CareSync on PitchBook.Year founded: 2013 Valuation: $41 million Amount raised: $30 million Read more about Bluesmart on PitchBook.Year founded: 2012 Valuation: $37 million Amount raised: $22 million Read more about Lantern on PitchBook.Year founded: 2015 Valuation: $12 million Amount raised: $3.5 million Read more about Raden on PitchBook.Year founded: 2013 Valuation: $11 million Amount raised: $3 million Read more about Fieldbook on PitchBook."}