{"id": "Turkey says it won't allow a 'cover-up' about Jamal Khashoggi after Saudi Arabia's explanation of his death prompts derision", "paragraph": " Turkey's ruling party has promised the country \"will never allow a cover-up\" about the death of Saudi journalist and Washington Post columnist Jamal Khashoggi. According to the BBC and  other outlets citing the Anadolu news agency, Turkish officials have said they plan to reveal what details they have about Khashoggi's death after Saudi Arabia admitted to its role in it.  A spokesman for Turkish president Recep Erdogan's ruling party was quoted as saying the country would \"uncover what has happened\" to Khashoggi.  \"We don't blame anyone in advance, but we do not consent to this being covered up,\" spokesman Omar Celik said.  After a sustained period of global political pressure,  Saudi Arabia finally acknowledged its role in the death of Jamal Khashoggi. The Saudi journalist had been missing and feared dead since October 2, when he was last seen entering the Saudi consulate in Istanbul to obtain paperwork for his marriage.  Saudi Arabia initially denied any role in Khashoggi's disappearance, despite the fact he was viewed inside the kingdom as a dissident for his criticism of the royal family and the country's stance on foreign policy issues. But after weeks of denials, the kingdom said in a statement on Friday that Khashoggi had died inside the consulate after \"a quarrel and physical confrontation\" with people inside the building. Around 18 Saudi suspects have been detained and senior officials within the kingdom have been dismissed.  Saudi Arabia's claims of a \"fist fight\" are at odds with Turkey's version of events. According to Turkish media, officials have a recording of Khashoggi's final moments and  evidence that he was dismembered by an assassination squad with links to Saudi Arabia's Crown Prince Mohammed bin Salman. The Saudis have denied this.  US senators are also unconvinced by the Saudi version of events. Senator Lindsay Graham wrote on Twitter: \"To say that I am skeptical of the new Saudi narrative about Mr. Khashoggi is an understatement.\"  California Rep. Adam Schiff also expressed skepticism, saying: \"[If] Khashoggi was fighting inside the Saudi consulate in Istanbul, he was fighting for his life with people sent to capture or kill him.\"                                                                                              Khashoggi's editor at the Washington Post, Karen Attiah, simply wrote on Twitter of the story: \"Utter bullshit.\" "}