{"id": "The Air Force has picked bases to test its new advanced bomber — here's where the B-21 Raider is heading", "paragraph": " On Friday, the Air Force announced the first two bases that will host its new, highly advanced bomber for testing and maintenance.  The service said in a release that Tinker Air Force Base in Oklahoma would coordinate maintenance and sustainment for the B-21 Raider and that Edwards Air Force Base in California had been picked to lead testing and evaluation of the next generation long-range strike bomber. Read also:  The US Navy is pushing north, closer to Russia and into freezing conditions — and it plans on hanging around up there Robins Air Force Base in Georgia and Hill Air Force Base in Utah will support Tinker with maintaining and, when necessary, overhauling and upgrading the new bomber, the Air Force said.  Personnel at those bases will be equipped to rebuild the aircraft's parts, assemblies, or subassemblies as well as to test and reclaim equipment as necessary for depot activations.  The first B-21 is expected to be delivered in the mid-2020s. A B-2A stealth bomber at Tinker Air Force Base in Oklahoma during a visit on April 11, 2017.                                            US Air Force/Greg L. Davis                                     The release noted the \"deep and accomplished history\" of the Air Logistics Complex of the Air Force Sustainment Center at Tinker and said officials believe the base has the knowledge and expertise to support the new bomber.  \"With a talented workforce and decades of experience in aircraft maintenance, Tinker AFB is the right place for this critical mission,\" Air Force Secretary Heather A. Wilson said.                                                                                                          Edwards Air Force Base is also home to the Air Force Test Center, which leads the service's testing and evaluation efforts.  \"From flight testing the X-15 to the F-117, Edwards AFB in the Mohave Desert has been at the forefront of keeping our Air Force on the cutting edge,\" Air Force Chief of Staff Gen. David L. Goldfein said. \"Now testing the B-21 Raider will begin another historic chapter in the base's history.\"  Air Force Brig. Gen. Carl Schaefer, head of the 412th Test Wing at Edwards, said earlier this year that the B-21 would be tested at the base. Few details about the B-21's development have been released, and previous reports suggested it could be tested at the Air Force's secretive Area 51 facility. A B-1B Lancer bomber awaits maintenance at Tinker Air Force Base in Oklahoma, January 27, 2017                                            US Air Force/Greg L. Davis                                     The B-21 acquisition cycle is currently in the engineering and manufacturing-development phase, the Air Force said. The Raider's design and development headquarters is at Northrop Grumman's facility in Melbourne, Florida.                                                                                                          The Air Force expects to buy about 100 of the new bomber, with each cost over $600 million, according to Air Force Times.  The Air Force said in May that once the new bombers begin arriving they will head to three bases in the US — Dyess Air Force Base in Texas, Ellsworth Air Force Base in South Dakota, and Whiteman Air Force Base in Missouri. Now read:  These are the best and most dangerous parts of flying the US Army's transportation workhorse, according to a pilot who does it The service said those bases were \"reasonable alternatives\" for the new bomber, although it will likely not make a final basing decision until 2019.  The B-21 is to replace the B-1 Lancer and B-2 Spirit bombers at those bases, but the Air Force doesn't plan to retire the existing bombers until there are enough B-21s to replace them.                                                                                                          Using existing bomber bases would reduce operational impact, lower overhead, and minimize costs, the Air Force said in May. \"Our current bomber bases are best suited for the B-21,\" Wilson said at the time. "}