{"id": "Turkey reportedly has a second audio tape of a Saudi hit team discussing details of Jamal Khashoggi's murder, bolstering the CIA's claims", "paragraph": " Turkish officials reportedly have a second, 15-minute audio tape of a Saudi hit team discussing the details of a plan to murder the journalist Jamal Khashoggi.  The tape, first reported by a columnist at Turkey's  Hurriyet newspaper, allegedly shows evidence that Khashoggi was the victim of a premeditated murder and directly contradicts the conclusions drawn by Saudi investigators.  Khashoggi, 59, was a contributor to The Washington Post and a Saudi Arabian national who frequently wrote editorials critical of Crown Prince Mohammed bin Salman. The Central Intelligence Agency (CIA) concluded on Friday that t he crown prince ordered Khashoggi's assassination.  In the first tape, \"Khashoggi's desperate attempts to survive could be heard in a seven-minute audio recording. There is no hint of anyone trying to persuade him,\" Abdulkadir Selvi, the Hurriyet columnist,  wrote on Friday. Read more:  Here's everything we know about the troubling disappearance and death of Saudi journalist Jamal Khashoggi Khashoggi traveled to the Saudi embassy to obtain documents needed to marry his Turkish fiancee, Hatice Cengiz, 36. Saudi investigators said Khashoggi was killed only after consulate officials tried to persuade him to return to Saudi Arabia on his own volition.  In the second tape, which was recorded 15 minutes before Khashoggi arrived at the Saudi consulate in Istanbul, Turkey, the Saudi team \"discusses how to execute Khashoggi. They are reviewing their plan, which was previously prepared, and reminding themselves the duties of each member,\" reports Hurriyet.  \"There is also evidence from the period after the killing,\" the newspaper added. \"Turkey has the international phone calls made by the 15-member Saudi hit squad.\"  The Saudi government has repeatedly changed its story on Khashoggi's death. On Thursday, the Saudi public prosecutor Saud al-Mojeb released his findings. A spokesman for the prosecutor, Shaalan al-Shaalan, said 11 people had been indicted and five face the death penalty. Their names were not released.                                                                                              On Thursday, US officials also announced sanctions against 17 Saudi officials.  \"The Saudi officials we are sanctioning were involved in the abhorrent killing of Jamal Khashoggi,\" according to a statement from  Treasury Secretary Steven Mnuchin. \"These individuals who targeted and brutally killed a journalist who resided and worked in the United States must face consequences for their actions.\" "}