{"id": "Here's why virtual reality still hasn't taken off, despite being around for nearly 2 decades", "paragraph": " Following is a transcript of the video.Michelle Yan: Believe it or not, virtual reality has been around for nearly 20 years. And yet, it still feels like a random experiment instead of the next mainstream video game. You'd think after nearly two decades of calling it the future, it'd be better, but it's not.  So why does virtual reality still suck? First, the cost. Virtual reality is an expensive commitment. Kevin Webb: Right now the cost of entry for virtual reality is around $400 or $500 once you factor in all the different devices and games and whatnot. There are some new machines coming up, like the Oculus Quest that can make it a little bit easier, or the Samsung VR, that's a bit cheaper. But overall, you're probably gonna be in the range of $500. Michelle Yan: And that's just for entry-level models. If you're looking for something super powerful like the Vive Pro Starter Kit, you're looking at least $1,000, if not more.  And then there's the annoying setup. Most of these devices aren't something you can just plug into a power outlet and be on your way. Kevin Webb: You have the Vive that can take a full room with sensors all around you. You have the PlayStation VR which has extra cameras and sensor bars, and even specific controllers for it. And then even the Gear VR can burn up your phone's battery if you use it for too long. Setting up a virtual reality experience on your own can be kind of a hassle. It just takes a lot of time. And even once you've spent it, you might not know what you wanna do. Michelle Yan: And once you do finally figure out what games to play or how else to use it, this isn't like your PS4 or Xbox where you can binge for hours on end. Kevin Webb: The VR headsets that are available right now are a bit cumbersome and heavy. And spending too much time in virtual reality can be disorienting, so wearing the headset for more than half an hour can leave your head spinning when you take it off.  Right now Facebook is recommending that people take a 10 to 15 minute break for every 30 minutes that they play. That means, even if you wanna spend an hour in virtual reality, about 20 minutes of that will just be cooling off. Michelle Yan: Not to mention, virtual reality is very platform specific. Kevin Webb: If you purchase a game that requires the sensors and controllers of the HTC Vive, for example, you might not be able to carry it over to future technology. Most of the games that we see in VR right now are pretty basic compared to what you see on a video game console or even your smartphone.  Even the best games that have been in VR, like \"Resident Evil 7\" or \"Superhot VR\" are available on regular computers so there's not much of a reason just to go to VR to play. Michelle Yan: And games made for something like the PlayStation VR won't be playable on other headsets and vice versa. Right now almost any game you buy for one platform won't work on any other platforms. That makes it harder for virtual reality to be a shared experience, which is another problem. Kevin Webb: With a video game or a movie that you're really excited about it's easy to bring that and share it with friends. You're all seeing and experiencing the same thing. But when it comes to virtual reality, you can be sitting with someone in the same room who's in VR and it just feels like you're worlds apart.  Companies like Facebook are working on programs that will let you share virtual reality with friends, but it's hard to see why that might beat out something like FaceTime or just regular video calling. Michelle Yan: We've seen things like VR arcades, VR escape rooms, and even VR Ghostbusters that have been trying to make the experience more shared. But those require going somewhere and paying an admission cost for a small 10 to 15 minute experience.  So what can VR platforms do to become more successful? Kevin Webb: For VR to really catch on, it needs to offer something that feels totally exclusive to virtual reality. Whether it's immersive environments or different ways to interact with your friends. It needs to have a reason to make people put on that headset. "}