{"id": "2 stats show why the US government has struggled to fight the rise of white nationalism and domestic terrorism", "paragraph": " A report from  The New York Times published on Saturday describes how federal and local authorities have struggled to reckon with the threats posed by white nationalist and other far-right movements since the September 11, 2001, attacks.  Since then, defense and intelligence agencies have focused primarily on preventing attacks from Al Qaeda, ISIS, and other Islamic extremist groups, The Times says, while dedicating much less attention to potential violence from groups and individuals aligned with white supremacist and other far-right ideologies.  Two statistics cited in The Times' report illustrate the extent to which the US government has devoted its attention to Islamist extremism, arguably at the expense of white nationalist and other domestic movements responsible for violent attacks.  A former Department of Homeland Security (DHS) employee, Daryl Johnson, told The Times that he was the government agency's only analyst dedicated entirely to \"non-Islamic domestic threats\" in 2005, and that the team grew to \"a small team of analysts\" by 2007.  The DHS did not immediately respond to Business Insider's request for comment. Read more:Why we need to call the Pittsburgh synagogue shooting a right-wing, domestic terrorist attack And a recent report from researchers at the University of North Carolina, Chapel Hill, said fewer than 20% of the FBI's counterterrorism agents were dedicated to domestic terrorism in 2008 and 2009, according to The Times. (Those were reportedly the only years that data was made publicly available.)  How the US government characterizes and divides its attention between foreign and domestic threats — as well as those posed by Muslim versus right-wing extremist groups — has become a point of controversy.  According to a  report published by the non-partisan Stimson Center in May, Muslim extremists have killed 100 people in the US since September, 11, 2001.                                                                                  A January report from the Anti-Defamation League says domestic extremists killed 387 people in the US between 2008 and 2017. Of those killings, 71% were committed by right-wing extremists, the report says. "}