{"id": "Apple is selling refurbished iPhone 8 smartphones for $500, and it's an amazing deal", "paragraph": " Apple is selling  refurbished units of the iPhone 8 starting at$500 from its certified used device store — one of the best-kept secrets in tech. That price reflects a $100 discount over the normal $600 starting price tag for an iPhone 8.  At the time of writing, the refurbished iPhone 8 Plus is, unfortunately, not in stock. If you're interested in the iPhone 8 Plus, I'd keep checking Apple's refurbished storefront regularly.  If  my experience with buying a refurbished MacBook Pro is anything to go by, Apple's refurbishment process is top-notch, and it's well worth your consideration. It's so good, in fact, that you should consider getting the refurbished iPhone 8 even if you were planning on buying it new, just so you can save yourself $100.  My refurbished MacBook Pro came in flawless physical and working condition, and there was no trace that my MacBook Pro had been used before. It also came with Apple's standard one-year warranty. I can't guarantee that a refurbished iPhone will come in equally great condition, but I at least had a positive experience with the store.  With the iPhone 8, you're not sacrificing that much over newer models, like the iPhone XR or XS. The iPhone 8 still has a great camera, and it runs the same chip as the iPhone X, which hasn't shown any signs of slowing down ever since the new iPhones came out. The main thing you're not getting with an iPhone 8 is the iPhone X-style edge-to-edge screen design, and Face ID facial recognition for unlocking the phone.  The iPhone 8 is also one of your only options to get an iPhone with a smaller 4.7-inch display, as it looks like Apple's flagship iPhone X-style phones are sticking with a minimum 5.8-inch display for the foreseeable future.  And if you're looking for the Apple experience for an even smaller price tag, there are also plenty of refurbished iPhone 7 and iPhone 7 Plus units available, starting at $380 and $480, respectively. The iPhone 7 is still a fantastic phone with a great camera and a similar design as the iPhone 8, if you're not picky about having the latest and greatest. "}