{"id": "Before-and-after photos show the devastating destruction in Malibu as the California wildfires rage on", "paragraph": " California has been overtaken by a string of deadly wildfires, which continue to blaze in  Ventura and Los Angeles Counties in the southern part of the state and around the  town of Paradise, California in the north.  Since the fires began on November 8, the wealthy coastal enclave of Malibu has been engulfed by the  Woolsey Fire, which has spread across more than 96,000 acres of land outside of LA and is now 35% contained. At least  two people were declared dead in Malibu on Friday. Their burned bodies were found in a car near Mulholland Highway.  Nearby, the  Hill Fire destroyed more than 4,500 acres, but is now 90% contained on Monday.  In Northern California, the Camp Fire destroyed the entire town of Paradise in less than a day. It's killed at least 42 people and decimated over 6,500 structures. Those numbers make it the deadliest and most destructive wildfire in California history.  The Woolsey Fire has destroyed an estimated 435 structures so far, and more than 50,000 are threatened because of the blaze. Mandatory evacuations remain in place for people in Topanga, Malibu, portions of Calabasas, and a few other areas.  Take a look at how the luxury community has changed in the last few days. Read more:  The cofounder of the Hard Rock Cafe just sold his mansion on Billionaire's Beach in Malibu for a record-breaking $110 millionSource:  Los Angeles Times All Malibu schools will be closed until at least Friday, November 16. Read more:  Malibu is burning — Wildfires are spreading through southern California, and photos show a hellscape on the groundSource:  Malibu City Celebrities like Miley Cyrus, Neil Young, and Gerard Butler all lost their Malibu homes. Read more:  All of the celebrities who have evacuated or lost their homes as wildfires spread across CaliforniaSource:  Malibu City \"It's built off the shoulders of hard-working blue-collar families, and that's really going to show when we rebuild this place,\" he said. \"It's a real community; it isn't something people buy into.\" Source:  Los Angeles Times"}