{"id": "Europe is faltering", "paragraph": " Italy may be one crisis too many.  Last week, Italy recorded GDP growth of exactly 0.0%. The trend is down. If Italy doesn't turn things around, its economy may well go into a contraction.  That's a big \"if.\"  The new  Italian government is trying to run a deficit of 2.4%, well above the level previously agreed with the European Union — a policy that has led to clashes with European financial authorities. As a long as Italy persists in fighting its EU bosses in Brussels, then investors are going to pull out of Italian bonds. The rot began on October 25, when  Moody's began downgrading all sorts of Italian bond vehicles, starting with 125 tranches of various mortgage and consumer debt bonds.  Needless to say, the more investors pull out of Italian bonds, the more expensive Itay's debts become, and the more they drag on the economy. Italian manufacturing isn't what it used to be.                                            Markit IHS                                     On its own, Italy isn't a problem.  But the economies of Germany and the UK also looked more fragile last week.  UK manufacturing PMI — an index of sentiment among factory operators — fell to 51.1 in October, down from 53.6 in September. (A measure of 50 is neutral; above or below that implies growth or contraction.) British manufacturers are hurting because their European customers are withdrawing business in order to avoid the complication of exporting from partners who will be outside the EU's trading rules in March 2019, when Brexit happens.                                                                                 Read more: The 'zombie' problem: Low interest rates and 'leveraged loans' sustain a vast number of lousy companies which should have gone to the wall years ago. \"The new orders balance fell to just 49.7 in October—the first sub-50 reading since the panic immediately after the referendum—from 52.8 in September,' Pantheon analyst Samuel Tombs told his clients. \"Sharper falls in output, therefore, lie ahead. Fearing a protracted period of weakness, manufacturers also reduced headcounts, marginally, for the first time since the Brexit vote.\" UK manufacturing sentiment.                                            Markit IHS                                     In Germany, it was a similar picture. Manufacturing PMI there fell to a 29-month low of 52.2, according to Markit IHS.  Manufacturing isn't the most important part of the European economy. That would be services. But psychologically, Italy, Britain, and Germany all regard themselves as sturdy makers of things.                                                                                  So the news is discomfiting. Euro-area GDP is trending down.                                            Nordea                                     Eurozone GDP growth for Q3 was reported at just 0.2%, quarter-on-quarter, the lowest since Q2 2014. That prompted HSBC analyst Fabio Balboni to begin a note to clients with this simple headline: \"Oh dear…\"  \"Eurozone growth is faltering faster than we had expected. 0.2% quarterly growth is the weakest print in the QE era, perhaps a reminder of what a future without QE (QE is due to end in December) might look like,\" he said. Healthy annual GDP growth is roughly 3%, implying 0.75% sequential improvement. Thus, 0.2% is well below that.  Three of Europe's four keystone economies are now faltering. Germany, Britain and Italy are the 4th, 5th and 9th largest economies on the planet. Only France, the 7th largest (and the third biggest in Europe) looks healthy. Three legs of Europe's chair are weak. This will have consequences for the rest of the world.                                             Markit IHS                                     Europe has a tendency to muddle through. Growth here has bumped along since 2008, neither on fire nor outright recession. But analysts are clearly worried. One note last week, from Nordea analyst Jan von Gerich, captured the tone. It was headlined: \"Euro area: Flashing red.\"                                                                                  Until now, Europe looked as if it was coping well with adversity. War in Syria on the Southern border; Russian incursion into Ukraine in the East; Greece being Greece; Britain voting to leave the EU; and Turkey falling off its own fiscal/currency cliff — none of these catastrophes pulled the continent down.  Until now.  The Italian debt crisis — coupled with Trump's global war on trade — might be the final straw. "}