{"id": "I upgraded to the iPhone XS Max, and this $50 OtterBox case is the only one I trust to protect it", "paragraph": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase.                                            David Slotnick/Business Insider                                     After using an iPhone 6S for almost three years, I was well overdue for an upgrade — but even with a weak battery, an underperforming camera, and a lack of storage space, making the jump to a new iPhone was a big decision to make. Never mind the lack of a headphone jack and the fact that Face ID is secure for everyone but me since I have an identical twin brother; it was the over-$1,000 price tag that made me hold out for so long.  Still, I went ahead and bought the 256GB iPhone XS Max — a $1,250 device.  I'm far from being the type to line up every year for the latest phone or buy all the high-end accessories to go along with it, but one item I never cheap out on is a case. Spending that much money on a smartphone was (and still is) kind of ridiculous to me, so I needed to make sure my investment was protected as best as possible without paying for Apple Care.  I wanted a case that was exceptionally strong, that would show off the elegant look of the iPhone, and that would last for several years if I decided not to upgrade right away again — and I found it with the OtterBox Statement Series Case.  As the name suggests, the case allows the iPhone to make a visual statement without compromising protection. It features a rugged rubber screen bezel and interior bumper, a clear polycarbonate shell that shows the back of the iPhone, and a premium leather accent at the bottom.                                             OtterBox                                     I've owned the case for about three weeks, and after switching to a sleek leather option for a few days, the OtterBox quickly made its way back onto my iPhone XS Max. I love the slim design of the new iPhones, but I refuse to go case-less. After my iPhone 4S shattered from a three-foot drop onto the carpet with a case a few years ago, I gave up entirely on cases that only look and feel good. Granted, the glass used on today's smartphones is a lot more durable than years past, but at the end of the day the iPhone XS and XS Max are still made of glass and can break. In my opinion, going with an inferior case because it has a cool design is not worth the risk.  The OtterBox Statement Series Case serves as the perfect middle ground. I don't have to worry about my phone breaking with every little drop or bump and it's still slim enough to fit in my pocket, as the XS Max is already a pretty big phone.  In terms of daily use, I haven't had any complaints about the case. It's not slippery in-hand, the volume and lock buttons are still very tactile, the Lightning port is easy to access, the speakers are unobstructed, and it worked seamlessly with wireless charging.  As with any case, The OtterBox Statement Series will show signs of wear over time. The rubber bezel and leather bottom have held up extremely well, however, the clear back has gotten a bit scratched. I personally prefer a clear back that's susceptible to minor scratches over a case with an Apple logo cut-out where the actual phone is exposed. If tiny scratches on the back is a deal-breaker for you, a clear case from any brand probably isn't for you.  Priced at $39.95 for the iPhone XS and $49.95 for the XS Max, the OtterBox Statement Series Cases aren't the cheapest cases you can buy, but considering you just bought a phone for $1,000 or more, spending the extra cash is worth the peace of mind.  You can buy a bunch of cool cheap cases to swap out depending on your mood, or you can buy one that'll protect your iPhone for the life of the device and look good it. If you prefer the latter, the OtterBox Statement Series is the case you need.  Find the best holiday deals on our Black Friday Deals and Cyber Monday Deals page. Subscribe to our newsletter.. Disclosure: This post is brought to you by the Insider Picks team. We highlight products and services you might find interesting. If you buy them, we get a small share of the revenue from the sale from our commerce partners. We frequently receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising sales team. We welcome your feedback. Email us at insiderpicks@businessinsider.com. Find all the best offers at our Coupons page. "}