{"id": "CNN chief Jeff Zucker slams Trump for his attacks on the media after the network evacuates following mail bomb", "paragraph": " CNN President Jeff Zucker slammed President Donald Trump's attacks on the news media just hours after an explosive device was mailed to CNN's New York offices,  forcing the network to evacuate its employees.  \"There is a total and complete lack of understanding at the White House about the seriousness of their continued attacks on the media,\" Zucker said in a statement on Wednesday afternoon in which he attacked Trump and White House press secretary Sarah Huckabee Sanders's at times aggressive posture towards the media, which they often accuse of promoting \"fake news.\"  \"The president, and especially the White House press secretary, should understand their words matter. Thus far, they have shown no comprehension of that,\" Zucker said.  Zucker's statement echoed  past criticism he has made of Trump's stance towards the media, which he said earlier this year has \"created an atmosphere in this country that has resonated around the world in a very unhealthy way.\"  He said of the president in March, \"He doesn't even understand the danger he's causing to journalists and the danger he's doing to media organizations.\"  Several top Republican leaders, including Vice President Mike Pence, House Majority Leader Paul Ryan, and Trump's eldest daughter, Ivanka,  all issued prompt responses to Wednesday's news that mail bombs were sent to former President Barack Obama, former Secretary of State Hillary Clinton, and other top Democrats.  Until he delivered a brief statement before an event addressing the opioid epidemic on Wednesday afternoon, Trump simply retweeted Pence's condemnation of the attempted attacks, writing, \"I agree wholeheartedly!\"  Later in the day, the president elaborated on his public response, calling for political unity and the rejection of violence.  \"In these times, we have to unify,\" he said. \"We have to come together, and send one clear, strong unmistakable message that acts or threats of political violence of any kind have no place in the United States of America.\"  The president has waged a long-running war against CNN in particular, which he accuses of being a leader of the \"liberal fake news media,\" and encourages his supporters to ignore. And all of the political leaders who received packages with explosive devices are high-profile Trump critics whom the president has relentlessly attacked. "}