{"id": "Facebook is banning the far-right violent group Proud Boys after an attack in New York", "paragraph": " Facebook is banning accounts and pages associated with the Proud Boys, a far-right extremist group whose members assaulted protesters in New York City earlier in October.  On Tuesday, Twitter users began reporting that Facebook was taking down groups and accounts (both public-facing and personal) linked to members of the organization, which has been involved in instances of political violence in the US.  A Facebook representative confirmed to Business Insider that the company was banning the Proud Boys and its founder from both Facebook and Instagram, pointing to Facebook's rules against hate groups.  The takedowns come after Proud Boys members fought with protesters after an event in New York on October 12. Members of the group  reportedly shouted homophobic slurs as they beat and kicked protesters, and  at least five Proud Boys have since been arrested.  The move by Facebook will deprive the extremist organization of its primary channel for recruitment and publicity — but it comes months after other tech firms took action against the group.  The Proud Boys, which was founded by Gavin McInnes, better known as a cofounder of the media organization Vice, describes its members as \"Western Chauvinists.\" The Southern Poverty Law Center, a watchdog organization,  designates it as a hate group. One of the Proud Boys' initiation rites  involves physical violence against left-wing antifascists.  ThinkProgress previously reported that Jason Kessler, one of the organizers of the 2017 \"Unite the Right\" white-supremacist rally in Charlottesville, Virginia, that resulted in the death of a protester,  was once a member of the Proud Boys, citing video footage of his apparent initiation. Proud Boys lawyer Jason Van Dyke denied this, saying Kessler \"attempted to infiltrate the fraternity at one time but was not a member.\"  \"Our team continues to study trends in organized hate and hate speech and works with partners to better understand hate organizations as they evolve,\" a Facebook representative said in a statement. \"We ban these organizations and individuals from our platforms and also remove all praise and support when we become aware of it.  \"We will continue to review content, Pages, and people that violate our policies, take action against hate speech and hate organizations to help keep our community safe.\"                                                                      The Southern Poverty Law Center previously revealed how the organization used Facebook as a recruitment tool, setting up private groups for \"vetting\" prospective members. \"While Twitter has received significant criticism for verifying Proud Boys accounts, it's Facebook that appears to provide the recruitment machinery for the group,\" it wrote.  Some major Proud Boys groups were offline as of Tuesday evening, including one with 20,000 members, with Facebook showing users a \"This page isn't available message\" — while others, including the page of McInnes, were still available.  Facebook lagged behind its peers in removing the Proud Boys;  Twitter banned the organization and its founder back in August, BuzzFeed News reported at the time. Do you work at Facebook? Got a tip? Contact this reporter via Signal or WhatsApp at +1 (650) 636-6268 using a non-work phone, email at rprice@businessinsider.com, Telegram or WeChat at robaeprice, or Twitter DM at @robaeprice. (PR pitches by email only, please.) You can also  contact Business Insider securely via SecureDrop."}