{"id": "Trump says his administration is 'looking at' whether Amazon, Facebook and Google are violating antitrust laws", "paragraph": " President Donald Trump says his administration was \"looking at\" antitrust proceedings against tech giants Amazon, Facebook, and Google.  In an interview with Axios' Jonathan Swan and Jim VandeHei on the news site's premiere HBO show Sunday night, Trump said the European Union's $5 billion fine against Google made him consider pursuing regulation.  \"You look at the European Union, they fined I guess it was Google, billions of dollars, and frankly I don't like that they're doing that because that's an American company,\" Trump said. \"I don't think it's good that they're doing that. But if anybody does that, it should be us doing it.\"  Swan asked if Trump would direct the Justice Department to look into the company as a monopoly, and Trump responded it was \"certainly something we're looking at.\"  When asked if he would ever break the companies up, Trump said previous administrations had discussed it but the action never materialized.  \"But you're in charge now,\" Swan interjected.  \"I am definitely in charge, and we are certainly looking at it,\" Trump said, before clarifying he was talking about antitrust proceedings for all three companies.  Responsibility for such proceedings would fall to the Federal Trade Commission or the Department of Justice's Antitrust Division.  \"That doesn't mean we're doing it, but we're certainly looking at it,\" Trump said. \"I think most people surmised that.\"                                                                                                                                             Read more:It's become increasingly clear that Alphabet, Google's parent company, needs new leadership These comments are the latest in Trump's public aims at the three tech giants, which he previously said could represent a \"very antitrust situation.\"  Though he has called the companies \"rigged\" and warned Google specifically \"better be careful,\" Trump has in the psat stopped short of commenting on breaking the companies up.  Get the latest Google stock price here."}