{"id": "The new 2019 Hyundai Kona EV is a clever little electric crossover", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJonathan M. Gitlin\n    -  Oct 24, 2018 5:57 pm UTC\nLOS ANGELES—If you believe we'd be better off with more people driving electric vehicles, any increase in the variety of those EVs is a welcome event. The latest option for the would-be EV owner certainly hits most of the right notes to be a hit. The Hyundai Kona EV is a crossover, the body style so on-trend that it made Ford kill all its old-fashioned cars. The 64kWh battery gives it a range of 258 miles, and on the latest fast-chargers it will go from flat to 80 percent state-of-charge in 54 minutes. And it comes with all the latest advanced driver assists and a rather funky interior. The only thing we still don't know is the exact price. But since Hyundai told us it's meant to be competitive against the Chevrolet Bolt, Nissan Leaf, and that elusive standard-range Tesla Model 3, expect a pre-incentive price to start somewhere around $37,000.You can see the quest for aerodynamic efficiency elsewhere. The underbody airflow is managed by covers and air deflectors. The actual air intake (in the lower part of the front bumper) is active and closes when appropriate to further cut drag. And the alloy wheels are mostly flat, with few openings to minimize turbulence. The result is a drag coefficient (Cd) of 0.29. That's better than the regular Kona (0.34) and the Chevy Bolt (0.32) and on a par with Jaguar's I-Pace, but it's not as good as the Leaf (0.28), Audi e-tron (0.27), or Tesla Model 3 (0.24). (CdA, where the drag coefficient is multiplied by frontal area, is the figure that really matters, but OEMs never give out those numbers.)The Kona EV can DC fast-charge at up to 75kW and 200A (which will require plugging it into one of the newest fast chargers like the kind Electrify America is building). That will take a flat battery to an 80-percent state of charge in 54 minutes. This isn't Supercharger-fast, but it is sufficient to add another 125 miles of range in 30 minutes, Hyundai says. On an older 50kW fast charger, that same 80 percent will take 75 minutes. The Kona EV also features an onboard 7.2kW charger, and, plugged into a 240v outlet, will fully recharge in 9 hours 35 min. While we weren't able to test the entire 258-mile range claim, the car's range calculator seemed to be pretty accurate when compared to our drive route.Things actually get a bit more distinct compared to the gasoline Kona on the inside. This is probably a good thing, considering the fact that the cheapest Kona EV is likely to cost almost double the price of the cheapest internal combustion version. There's an all-new center console that stretches out like a bridge between the front seats, and if you opt for the Limited or Ultimate trims, all the seats are trimmed in leather. One thing that isn't really changed is the amount of available space on the inside. There's no getting around it: the Kona EV is a small car. Front seat occupants will have about as much room as in a Bolt, and rear-seat occupants will be slightly more squished than in a Leaf. With the rear seats in use, there's 19.2 cubic feet (544L) of cargo space, which grows to 45.8 cubic feet (1,297L) with the seats folded flat.Android Auto and Apple CarPlay are standard, and Hyundai's infotainment system is actually not bad. The graphics are clear, and I like the UI, which reminds me somewhat of a pre-OS X Macintosh. The Ultimate, which was on hand for our drive, also gets a bigger (eight-inch versus seven-inch) touchscreen. As its name suggests, it comes with all the bells and whistles—the base SEL Kona EV is also well-specced, even when it comes to driver assists.But you could have discovered all that just from looking at Hyundai's website. The reason I flew to California was to find out how the Kona EV drives, and I can report that my impressions were rather good. There are three different drive modes: Eco, Normal, and Sport. Eco has the least responsive accelerator and by default the most aggressive regeneration under coasting. In Normal, the accelerator is more responsive, and the car coasts more and regens less when you cruise, and Sport has the sharpest accelerator response and a coasting regen setting somewhere in between the other two. (In fact, there's actually a fourth mode, Eco+, which limits all other power draws from the battery to extend range as far as possible.)Hyundai has thought a lot about maximizing regen; after all, every kWh you can recover from deceleration is a kWh you don't need to suck out of a charger. Where you might find paddles to change gear in some cars, here you find paddles to alter the regen through four settings (0/1/2/3). Holding the left paddle (as opposed to just clicking it to cycle through levels) engages the most aggressive regen, braking the car at up to 0.25G. This will illuminate the brake lights and bring the car to a full stop.But the Kona EV has a clever party trick up its sleeve that means you'll use the regen paddle a lot less than the similar feature in Chevy's Bolt or Volt. (This is good, because there was a noticeable delay between using the paddle to increase the level of regen and the rate at which the car slows.) It's called the Smart Regenerative System, and the idea is to keep a consistent rate of deceleration when coasting. On an incline, it will regen less than coming down a hill, and since every Kona EV has a forward-facing adaptive cruise control radar sensor, it will even take into account any cars you're following. That last bit does wonders for cruising in traffic, particularly since the car was able to more finely judge the rate of deceleration than this unfamiliar driver.Hyundai hasn't released a curb weight, but we don't need that number to know the center of gravity is nice and low, and that means a stable ride and little body roll once on the move. The Kona EV feels zippy, but it never encourages you to hustle it down a twisty road the way a Bolt does. Much of our test route (from West Hollywood to Malibu) was spent in traffic anyway, where the combination of that smart deceleration feature and a very quiet interior did much to counter the psychological toll inflicted by Southern California stop-and-go traffic.The Kona EV won't be for everyone, but then no car really is. It's cheap and cheerful in the way that any sub-$40,000 EV has to be, because lithium-ion batteries are still very expensive, even when you're subsidizing the model with non-EV versions. Sales will start in California at the beginning of next year and will then spread to the Zero Emissions Vehicles states. A nationwide launch remains TBD; Hyundai North America told me that there's a lot of global demand for the car, and it has to compete with other regions. Expansion outside the ZEV states may happen with sufficient demand and dealer readiness.Listing image by HyundaiYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}