{"id": "Ars on your lunch break: Theaterwide biotoxic and chemical warfare", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nRob Reid\n        -  Oct 19, 2018 4:00 pm UTC\nToday we’re presenting the fourth and final installment of my conversation with the outspoken author, podcaster, philosopher, and recovering neuroscientist Sam Harris. Please check out parts one, two, and three if you missed them. Otherwise, you can press play on the embedded audio player or pull up the transcript, both of which are below.The final part of the podcast is a conversation between me and podcasting superstar Tom Merritt. In it, Merritt and I discuss my interview with Harris—as well as a chunk of my novel After On. This section exists because I originally thought my podcast would be a limited set of just eight episodes connected to that novel. But the podcast acquired a life of its own, and I’m about to publish episode #38 in the series of eight.You may, of course, want to skip that section. Or perhaps not because it’s actually a pretty fun conversation. In addition to the topics covered in my interview with Harris, Merritt and I touch on the ever-fascinating subject of tapeworms—plus my own extensive background in the Middle East, my mercifully brief experiences in foster care, and more.Finally, I’d like to briefly mention a series of four articles that I’m posting to Medium this month on the uplifting topic of existential risk. Which is to say the grim-yet-perversely-fascinating possibility that our technological creations might just annihilate us. I believe I present some arguments and analytic lenses that are new to this important topic—and some of these tie quite closely to the issues that Harris and I discuss in our conversation. The first piece in the series is right here. I should note that Medium is running this in their editorially curated, paid, members-only section. The goods news is that Medium gives everyone access to a few articles per month with essentially zero friction.This special edition of the Ars Technicast podcast can be accessed in the following places:iTunes:\nhttps://itunes.apple.com/us/podcast/the-ars-technicast/id522504024?mt=2 (Might take several hours after publication to appear.)RSS:\nhttp://arstechnica.libsyn.com/rssStitcher\nhttp://www.stitcher.com/podcast/ars-technicast/the-ars-technicastLibsyn:\nhttp://directory.libsyn.com/shows/view/id/arstechnicaYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}