{"id": "Adieu, home button—Apple’s new iPad Pros have nearly edge-to-edge screens, FaceID", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nValentina Palladino\n    -  Oct 30, 2018 2:45 pm UTC\nThe new iPads start at $799, with pre-orders beginning today. The devices will ship November 7.The new iPad Pros come in two sizes (11-, 12.9-inches) and storage options ranging from 64GB to 1TB. (The 10.5-inch model pictured in the gallery above is the last iteration of the iPad Pro, home button-included, still being offered by Apple.)The renders previously floating around the Internet accurately detailed the new iPad Pro design. The new models, coming in at 11\" and 12.9\", have slimmer bezels on all four sides of their displays. While the bezels aren't as small as those on the iPhone XS and XS Max, they're much thinner than we've seen on an iPad before. (In his event liveblog, Ars' Samuel Axon noted the new iPads are virtually the size of a standard 8.5\" × 11\" piece of paper, and they resemble the iPhone SE.)Those design changes leave no space for a Home button, which Apple has removed from the new iPad Pro. While this doesn't put the final nail in the coffin for TouchID, it does mean that none of Apple's current-generation iOS devices have a fingerprint reader. The company is betting big on FaceID, which makes its debut on Apple's tablets in these new devices.Notably, the new iPad Pro doesn't have the infamous notch found on new iPhones. Instead, the top bezel space on the iPad Pro appears to be large enough to accommodate Apple's True Depth camera system. This array, which includes a proximity sensor, ambient-light sensor, dot projector, front-facing camera, and other tech, powers Face ID, so users unlock their devices just by looking at them.The new iPad Pro runs on Apple's new A12X Bionic SoC, which delivers a 35 percent single-core and 90 percent multicore performance increase over last year's iPad Pro, according to the company.Apple also deviated drastically from the norm in these new iPad Pros—they charge via USB-C, not Apple's Lightning port. They are the first iOS devices to forgo Apple's signature port, and it's refreshing to see. Most OEMs are embracing USB-C, adding the port to their tablets, smartphones, laptops, and other devices. While Apple's MacBooks include Thunderbolt 3 ports, iPhones and iPad had remained tethered to the Lightning port until now.With the USB-C addition, the new iPad Pros can charge an iPhone directly from the tablet. Users can also connect the tablet to things like cameras or displays up to 5K.The new iPad Pros boast a number of other niceties: Gigabit LTE and eSIM support, Bluetooth 5 compatibility, and four-speaker audio (with paired woofers/tweeters), for instance. The included 12MP camera can shoot 4K and 60FPS. Apple claims the battery can last for 10 hours, and the device comes with an 18W power adapter.Alongside the tablet refresh, Apple introduced the first major update to the Apple Pencil since the stylus debuted in 2015 alongside the original iPad Pro. The new pencil has proximity pairing with the new iPads. Rather than physically connecting the Pencil to its accompanying iPad via the tablet's charging port, the new Apple Pencil will pair to the device you want when they're close to each other (similar to Apple's AirPods).To exemplify all Apple has packed into this new, smaller tablet, VP of hardware engineering John Ternus compared it to a familiar bit of hardware. \"The iPad Pro delivers Xbox One S-class graphics performance,\" he said, \"...in a product that's 94 percent smaller.\"Apple showcased a console-grade demo of NBA 2K coming to iOS. Though Greg Thomas, executive VP at 2K, didn't clarify how the game would control on a touchscreen (nor when it might launch), the game did look impressive. 2K is promising 60fps gameplay.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}