{"id": "Study: Tetris is a great distraction for easing an anxious mind", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Nov 2, 2018 3:55 pm UTC\nThere's nothing worse than waiting to hear potentially upsetting news, whether it's a bad medical diagnosis or learning if you got into your top college choice. These kinds of stressful periods can produce intense anxiety. Playing Tetris might be the perfect coping mechanism, according to a new study in the journal Emotion.That same year, a research group at Oxford University reported that playing Tetris could reduce the impact of viewing traumatic scenes, perhaps because the game disrupts retention of painful memories. That makes it a promising treatment for post-traumatic stress disorder. It is such an effective distraction that it can help reduce cravings in dieters and addicts seeking to kick the habit. After prolonged play, images of the Tetris combinations will linger in the brain (the so-called \"Tetris effect\"), although this will happen with any repeated images or scenarios (solitaire, jigsaw puzzles, and so forth). It even inspired a new Playstation game, The Tetris Effect.So Tetris seemed like an ideal tool when University of California, Riverside, psychologist Kate Sweeny wanted to investigate the role of distraction in dealing with the anxiety of waiting for important news: the results of a medical exam, for instance, or whether one passed a crucial test. \"People don't seem to cope very well with this kind of stress,\" says Sweeny. But most people find that distracting themselves can help ease that anxiety.The best distracting activities are those that can induce a sense of \"flow,\" colloquially known as being \"in the zone.\" Athletes, musicians, writers, artists, race car drivers, and so on have all reported achieving such a state. People in a state of flow lose their sense of space and time and are completely absorbed in the activity at hand. It was first defined in 1975 by psychologist Mihaly Csikszentmihalyi, who became fascinated by artists who got so wrapped up in their work they simply forgot to eat or sleep. He dubbed it \"flow\" because when he interviewed subjects, they invariably described feeling as though they were being carried along by a water current.\"It's something that fully captures your attention and engages you,\" says Sweeny. \"I often describe it as the kind of thing you can't start doing if you only have ten minutes, because you know you'll lose track of time.\" Video games are perfect for this, provided they hit that sweet spot of being easy enough to learn while still pushing the skill level of the player, without becoming so challenging that the player becomes frustrated.The preferred activity varies from person to person, of course, and need not have anything to do with gaming. Anything that sparks the brain and keeps attention engaged and motivation high can foster a state of flow. Sweeny admits she likes to play Candy Crush on her phone—another simple game that gets harder as your skill level improves, like Angry Birds—but she finds that analyzing data is most effective in bringing her to a state of flow.There are actually three separate studies described in this new paper. The first one involved law school graduates in California waiting to hear whether they had passed the bar exam—something that can take as long as four months. Because so few who take the test actually pass, it's a stressful waiting period. The second focused on PhD students undergoing the torturous process of searching for academic positions: applying for jobs and waiting months to hear back, assuming they received a reply at all. In both cases, the subjects reported feeling less anxiety and a stronger sense of emotional well-being when they managed to achieve a state of flow.For the third and final study, the subjects (290 undergraduates) filled out questionnaires and had their picture taken. They were told that students in another location would be asked to rate their physical attractiveness—essentially creating a state of social anxiety. \"You can't exactly create a situation like waiting for bar exam or biopsy results in the lab,\" says Sweeny, but undergraduates do seem to be susceptible to being rated by their peers. While the subjects were waiting to hear the judgements of their peers, they played ten minutes or so of Tetris, at varying levels.One group played the standard adaptive version of the game, where the difficulty level increased as their skill level did. A second group played a version that was too easy, with the blocks dropping so slowly as to induce boredom. The third group played the most challenging version of the game, with rapidly dropping blocks designed to create a sense of frustration. After playing, the subjects filled out a survey rating their emotional state.As Sweeny and her colleagues had hypothesized, the subjects in the first group were far more likely to achieve a state of flow and, therefore, experienced less anxiety and stress. \"That adaptive setting meets all the qualities you want for flow,\" says Sweeny. \"It increases the challenge as your skill goes up, it gives you feedback on how you're doing, and it sets little goals for you along the way.\" The next step is to repeat the Tetris experiment with law students taking the bar exam, led by Sweeny's graduate student, Kyla Rankin.\"Tetris is not a cure-all for any life problem, but it does have some useful qualities,\" says Sweeny, plus it's broadly accessible to just about anyone. For anyone who isn't sure how to get into a flow state to distract from a stressful waiting period, \"Maybe Tetris isn't a bad place to start.\"DOI: Emotion, 2018. 10.1037/emo0000479  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}