{"id": "Diablo Immortal on phones, WarCraft 3: Reforged top BlizzCon’s announcements", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSam Machkovech\n    -  Nov 2, 2018 8:11 pm UTC\nAnnouncements of a brand-new, smartphone-only Diablo and a remastered WarCraft 3 headlined a news-filled BlizzCon keynote presentation on Friday. The talk focused on games across Blizzard Entertainment's portfolio—along with a huge freebie from its corporate siblings at Bungie.Starting today, that developer’s Destiny 2 is now free to claim on Windows 10 PCs. Anyone who logs into Battle.net on or before November 18 can claim the game's vanilla version at this site and keep it for free. (Should you create an entirely new Battle.net account on or after November 2, you'll need to attach SMS authentication to your account to claim that copy—presumably to prevent a slew of spam accounts claiming free Destiny 2 accounts.) That version includes quite a bit of content that can be played with all other owners of the PC version, though at this point, it's effectively an elaborate demo for the game's more recent expansion packs.Blizzard's previous promises of \"multiple Diablo projects\" bore fruit during the keynote with the announcement of Diablo Immortal, a \"full-fledged action-RPG you can play everywhere with everyone.\" This game, set between the events of Diablo II and Diablo III, is credited to developer NetEase Games, a company that primarily handles online game management of Blizzard's classic series in China on top of also making its own titles. Reveal footage of the game confirmed a pretty busy interface of touchscreen buttons that mobile players will use to manage abilities and items. That interface, seen above, may look bonkers to Diablo's PC faithful, but it looks somewhat reserved compared to mega-popular mobile games like PUBG and Fortnite.Pre-registration links are already live at Google Play, and the game's listing confirms the game's inclusion of six familiar-sounding character classes (Barbarian, Crusader, Demon Hunter, Monk, Necromancer, and Wizard) who can join forces in online co-op dungeon-crawling. (An iOS version of the game was also announced, though no iOS listing for the game yet exists.) Blizzard did not announce information about the game's pricing structure or release window.More cards for Hearthstone and a new shotgun-slinging cowboy hero (with a giant robot pal as its Ultimate ability) for Overwatch rounded out the biggest BlizzCon announcements. Every single feature and game announced at BlizzCon will be playable at the event—\"digital ticket\" owners can also play a time-limited demo of World of WarCraft Classic on their home computers over the next few days. (WoW Classic finally received a \"summer 2019\" release window during BlizzCon.)You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}