{"id": "This business card-sized Japanese phone bucks the giant-phone trend", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSamuel Axon\n    -  Oct 19, 2018 11:30 am UTC\nWith Apple and most Android OEMs making increasingly larger phones while Apple discontinues the small iPhone SE, it's pretty clear where the smartphone market is going—at least for the near term. But that doesn't mean there aren't some companies bucking the trend by going smaller, not bigger. Earlier this week, we heard that Palm's brand is rebooting with a very small phone that's not meant to be your main portable computing device. But this phone from Kyocera is even smaller.The KY-O1L has a 2.8-inch ePaper display—the same technology found in a some e-readers. The handset measures at just 91mm×55mm×5.3mm and weighs 47g. The Palm phone measures at 96.6mm×50.6mm×7.4mm, and a credit card is typically only 0.76mm thick. For comparison, the iPhone XS and XS Max are 143.6mm×70.9mm×7.7mm and 157.5mm×77.4mm×7.7mm, respectively. Japanese carrier NTT Docomo, which will release the KY-O1L, claims it is the world's thinnest smartphone.\"Smartphone\" feels like a little bit of a stretch. The KY-O1L doesn't run iOS or Android, and it has no app store. It also has no camera. It has built-in apps, though, including a Web browser, a calculator, and a calendar—so sure, it's technically a smartphone. It has a 380mAh battery, which sounds abysmal, but the ePaper display should not use very much power, so we wouldn't be surprised if its battery life is just fine regardless.The KY-O1L will launch in Japan on NTT Docomo in late November for ¥32,000, or roughly $285 at current exchange rates. Frankly, that's a bit pricy for what's included; the Palm phone will have significantly more features for $350.But the design of the KY-O1L makes the case that sometimes a phone doesn't have to be a universal computing device intended to run every aspect of your life, from health to productivity to music to work. Sometimes, it can just be a phone with a couple of extras—as was the norm not so long ago. And there are some intriguing designs to explore if consumers are willing to consider the narrower value proposition.Listing image by KyoceraYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}