{"id": "Google to charge Android OEMs as much as $40 per phone in EU", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nRon Amadeo\n    -  Oct 19, 2018 4:04 pm UTC\nWe're still seeing the fallout from the European Commission's $5 billion antitrust fine against Google. Earlier this week, Google announced it would comply with the ruling by unbundling the Google Android app package, allowing OEMs to skip Chrome and Google Search in favor of alternatives. The catch is that, since ad revenue from these Google services was used to support Android development, Google will start charging device makers that license Google apps but choose the unbundled route.Now, thanks to a report from The Verge, we're getting an idea of just how much this more flexible app licensing scheme will cost OEMs. Citing \"confidential documents\" that were shown to the site, The Verge says Google will charge device makers as much as $40 per device if they don't use Google's preferred Android setup. The pricing is flexible based on the country and the pixel density of the device's screen. The EU is split into three tiers, with the UK, Sweden, Germany, Norway, and the Netherlands in the most expensive tier. Lower-end phones in bottom-tier countries can cost as little as $2.50 per device. Android tablets, if any of those still exist, get their own pricing tier that is even across all countries and caps out at $20. It all sounds very complicated, but if we imagine this pricing structure applied to the $720 Galaxy S9 sold in the UK, slapping on the top-end $40 fee works out to a 5.5 percent price increase and a $760 phone.These changes are all a result of the European Commission antitrust investigation into Android. That commission found that Google illegally used Android to dominate the search market. The ruling (which is still being appealed) required Google to change its Android licensing deals, and the commission slapped the company with the record-setting fine.A commercial Android device ships with a mix of licenses. The core Android OS is free and open source. Anyone can take it and do whatever they want without Google's involvement. If you want to make a viable commercial device, though, you'll most likely want the Google apps. The Google app package includes things like the Google Play Store and Google Play Services—which unlocks access to the entire Android app ecosystem—and killer Google apps like Gmail, Google Maps, YouTube, and the Google Assistant. Typically these Google apps didn't cost OEMs money, but they weren't open source and they weren't free. If you wanted to license the Google apps, you needed to sign a \"Mobile Application Distribution Agreement\" (MADA) contract with Google, which came with a whole host of requirements and restrictions that the EU took issue with.It sounds like this is still all about making sure Google gets what Google wants from these Android OEMs. Previously, Google did that with a restrictive contract. Now that the EU has taken that option away, Google is using every other trick it can think of to keep its Android package intact.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}