{"id": "2018 iPad Pro hands-on: Improving on the world’s best tablet", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSamuel Axon\n    -  Oct 30, 2018 10:48 pm UTC\nApple already had the best tablet on the market with the iPad Pro, but for the company's target audience of creative and tech-y professionals and hobbyists, that wasn't always enough. Even the iPad \"Pro\" had limitations that made it hard to see it as a true laptop replacement. So, Apple has introduced new iPad Pro models that address some of those limitations while bringing in many of the company's biggest ideas from the newer iPhones.I handled both of the new models at Apple's event in Brooklyn earlier today, and I was surprised how different they felt and looked compared to last year's models or even to this year's iPad. But what really matters is what's inside, and that's intriguing, too.The new tablets come in 11-inch and 12.9-inch screen sizes, but they are decidedly unbulky. The 12.9-inch model is especially surprising; it's so light you can easily pick it up and hold it with just one hand (though you'll obviously need the other to actually operate it) without experiencing discomfort. The difference in footprint between it and its predecessor is impossible to miss.Some articles out there have called the iPad Pro \"all screen,\" but that's not true. It has bezels—they're just very small. But they're thicker than what you see on an iPhone XS or even an iPhone XR; they're enough to house the TrueDepth sensor array without a notch, after all. And they're just enough to make gripping the device comfortable without creating concerns about accidentally touching the screen—at least if you have average-sized or smaller fingers.There's one annoying quirk, though: when holding the new iPad Pro in landscape mode, it's easy to accidentally cover up the TrueDepth sensor and front-facing camera with your finger.That matters, because the TrueDepth camera (and Face ID with it) now works in both portrait and landscape modes, unlike the iPhone XS. In fact, with the home button gone, the user doesn't get a really clear sense which orientation is intended as the default. The only hint is that the Apple logo on the back is oriented to be right-way-up in portrait mode.The front-facing camera and TrueDepth array are similar to what we see on the iPhone. You can even take pictures using Apple's portrait lighting feature, such as it is.As with the iPhone XR, Apple calls the display a \"Liquid Retina\" display; liquid is for LCD and retina is for the HiDPI resolution. It's kind of a strange name, given that it does nothing to distinguish the product from every other Apple offering except the iPhone X, XS, and XS Max. Apart from those newer phones, nearly all of Apple's products have LCD Retina displays now that the old MacBook Air has been replaced. But for some reason, only the iPad Pro and iPhone XR carry the \"Liquid Retina\" moniker.Still, the displays impress. They're not OLED (we probably won't see mass-market OLED panels in this size for quite a while), but they're among the best portable LCD displays on the market. And the 120Hz refresh rate makes a subtle but noticeable difference in perceived quality over the cheaper, non-Pro iPad. The resolutions are slightly higher than those of their predecessors but only to accommodate the increased screen real estate with the reduced bezels. Both new models have the same pixel density as before—264ppi.Apple has included a new SoC: the A12X. It shares many features with the A12 found in the iPhone XS, XS Max, and XR, but among other things, it has dramatically better video performance. Apple says it has a 7-core GPU and an 8-core CPU; the latter has four high-performance cores and four efficiency cores. The A12X also brings the Neural Engine, Apple's powerful machine-learning silicon, to the iPad for the first time.I didn't have a chance to do any benchmarking on the event's display floor, but on paper at least, the Pro is the most powerful tablet on the consumer market. That power showed when I tried playing a new Assassin's Creed game on the device. Images were sharp, featured lovely textures and shaders, and ran at what seemed to be 60-120 frames per second to my eyes.Apple said during its presentation that the iPad Pro is as powerful as an Xbox One S. Granted, that's the weakest current console on the market apart from the Nintendo Switch, but it's impressive given that this device is much, much smaller.The iPad Pro has moved from Apple's proprietary Lightning port to USB-C. Note that it's not Thunderbolt 3, as on new Macs; it's USB-C. I didn't get to test this at the event, but Apple says you can use USB-C to drive an external display, connect directly to a camera, or even to charge your iPhone from your iPad. Performance aside, this is the most consequential change for the power users Apple is trying to woo here. On the not-as-great side, there's no headphone jack.Apple has also improved the Apple Pencil and the smart keyboard folio. The Apple Pencil now attaches to the iPad Pro magnetically, and it charges wirelessly while connected. When I poked around at it, I found that the Pencil was secure enough to sit attached while I used the iPad normally, but it wasn't strong enough to keep it attached while bumping around in a shoulder bag.The Pencil also has some new features. You can double tap the side of it to switch between tools in Apple's Notes app, and third-party app developers have access to that functionality, too, should they choose to implement it.The keyboard is also a little different. It feels the same; it's definitely not as easy to use as a good laptop keyboard, but it's fine for light usage. But it attaches at a different point now (on the side), and you can now orient the iPad Pro on it for two different angles—one for your lap, another for your desk.Using the new iPad Pro for a few minutes, it seemed like an iterative improvement (with big aesthetic changes)—but it's a significant iteration. I'm still not sure this is a replacement for a MacBook Pro for that many users, but I can imagine quite a few niche users who would get a lot of mileage out of it. Some time ago, Steve Jobs described the iPad as the future of computing. That has looked more unlikely over time, and it's still probably not quite true. But first impressions are that the new iPad Pro makes that longterm vision a little less blurry.Listing image by Valentina PalladinoYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}