{"id": "Houston’s cityscape squeezed extra rain out of Hurricane Harvey", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nScott K. Johnson\n    -  Nov 16, 2018 5:15 pm UTC\nCities often see flash floods get worse as urbanization grows, as a cityscape is an incredibly efficient rainwater collector. The more land you pave, the more rain turns to surface runoff instead of soaking into the ground. If an area is connected by storm sewers, a lot of runoff can quickly come together in the same spot and pile up inconveniently.A hurricane is no ordinary rainstorm, but the same problem applies. After Hurricane Harvey released an incredible amount of water on Houston last year, every aspect of the storm was dissected by public discussion and scientific studies. Researchers have concluded that climate change very likely played a role in Harvey’s record-setting rainfall, for example.As for Houston’s rapid growth and development, attention has mostly focused on decisions to allow construction in risky, flood-prone areas. But a new study led by Wei Zhang and Gabriele Villarini of the University of Iowa has identified another impact beyond catching more of the rain with concrete—Houston actually increased the rainfall itself.It’s well known that cities experience warmer temperatures than the surrounding area as all that pavement heats up in the Sun. This warm air rises, where it can cool and wring out its moisture as rain; researchers have studied this weather influence in some cities in earlier studies.In this case, the researchers wanted to see if something similar could apply to a hurricane like Harvey. So they simulated Harvey with a computer model, swapping out the urban area of Houston for farmland in some simulations. The model used the actual temperature patterns from the days before the hurricane, allowing it to simulate a storm that behaved just like Harvey did.The results showed that a bigger Houston coaxed more rainfall out of the storm—several more inches of rain, in fact. It also shifted the location of the most intense rain to the east side of the city.How could that happen? By examining the model carefully, the researchers found that warmer surface temperatures helped, but it had more to do with the city interacting with winds. Surface roughness is important for the flow of any fluid, and the atmosphere is no different. Here, the extra drag the city's buildings caused at the surface resulted in a little bit of a traffic jam, pushing air upward. And that upward boost means more water vapor turns to raindrops.Another way to describe the extra rainfall is to calculate the changed probability of the Harvey flooding. Scaling actual stream channel records using the Harvey storm simulations, the researchers find that Houston’s development increased the odds of extreme flooding from rains produced by the storm by an incredible factor of 21 over what it would have been in 1950. As unlikely an event as Harvey was, that magnitude of flooding would have been even more rare if Houston hadn’t grown explosively.Natural disasters with human impacts are often not just “natural.” The decisions we make can have consequences for the destruction that results. In the case of Hurricane Harvey, it seems there are many ways that we accidentally made the situation worse, from climate change to urban planning to the construction of the city itself.Nature, 2018. DOI: 10.1038/s41586-018-0676-z   (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}