{"id": "Ajit Pai killed rules that could have helped Florida recover from hurricane", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJon Brodkin\n    -  Oct 18, 2018 9:19 pm UTC\nThe Federal Communications Commission chairman slammed wireless carriers on Tuesday for failing to quickly restore phone service in Florida after Hurricane Michael, calling the delay \"completely unacceptable.\"But FCC Chairman Ajit Pai's statement ignored his agency's deregulatory blitz that left consumers without protections designed to ensure restoration of service after disasters, according to longtime telecom attorney and consumer advocate Harold Feld.The Obama-era FCC wrote new regulations to protect consumers after Verizon tried to avoid rebuilding wireline phone infrastructure in Fire Island, New York, after Hurricane Sandy hit the area in October 2012. But Pai repealed those rules, claiming that they prevented carriers from upgrading old copper networks to fiber. Pai's repeal order makes zero mentions of Fire Island and makes reference to Verizon's response to Hurricane Sandy only once, in a footnote.\"In November 2017, Chairman Pai repealed many of the safeguards put in place by the Obama FCC following Superstorm Sandy, [which were] designed to prevent recurrence of the lengthy loss of service (and in some cases, discontinuance of service) suffered in many areas after Sandy,\" wrote Feld, the senior VP of advocacy group Public Knowledge.Among other things, the November 2017 FCC action eliminated a requirement that telcos turning off copper networks must provide Americans with service at least as good as those old copper networks. This change lets carriers replace wireline service with mobile service only, even if the new mobile option wouldn't pass a \"functional test\" that Pai's FCC eliminated.Additionally, \"in June 2018, Chairman Pai further deregulated telephone providers to make it easier to discontinue service after a natural disaster,\" Feld wrote.Pai argues that the regulations prevented carriers from upgrading copper to fiber. But while carriers have upgraded many densely populated areas to fiber, they've been reluctant to do so in rural areas where the financial payoff isn't as great. Mobile service in rural areas is also worse than in urban areas. That's why consumer advocates say FCC regulations are needed to protect customers from loss or degradation of service, especially after disasters.Public Knowledge and other consumer advocacy groups successfully lobbied for the FCC regulations after Sandy, when Democrats controlled the FCC. They later begged Pai not to eliminate them, to no avail. Public Knowledge and others are now challenging Pai's deregulation in court.Feld wrote:The situation in Florida shows what happens when regulators abandon their responsibilities to protect the public based on unenforceable promises from companies eager to cut costs for maintenance and emergency preparedness. This should be a wake-up call for the 37 states that have eliminated traditional oversight of telecommunications services and those states considering similar deregulation: critical communications services cannot be left without some kind of public oversight.Florida Governor Rick Scott has similarly been criticizing Verizon, which has apparently struggled more than other carriers in restoring wireless service after Hurricane Michael. But Scott—a Republican who is running for US Senate while he continues to govern Florida—has similarly deregulated the telecom industry in his state.\"In 2011, Governor Scott signed the 'Regulatory Reform Act of 2011,' which eliminated virtually all oversight of Florida's residential telephone service,\" Feld wrote. \"This included repeal of Florida's 'Carrier of Last Resort' (COLR) requirements—rules that require carriers to provide service to everyone in the state—as well as repeal of Public Service Commission (PSC) regulations governing service blackouts, timeliness of repairs, or regulation of customer billing.\"\"The deregulation was so thorough that the Florida PSC is not even allowed to take consumer complaints about residential phone service, which conveniently prevents the collection of any data that might show deregulation has costs in terms of consumer welfare,\" Feld also wrote in a second, more-detailed blog post yesterday.Gov. Scott has been doing the rounds with media to keep pressure on Verizon—and to make sure that Floridians know he's fighting for them. Similarly, Pai announced that he will visit the Florida Panhandle on Friday \"to assess the damage inflicted by Hurricane Michael and get an update on recovery efforts\" and said he will \"continu[e] to work to help residents and communities bounce back from this tragic storm.\"\"What neither Pai nor Scott mention is their own role in creating this sorry state of affairs,\" Feld wrote. \"Their radical deregulation of the telephone industry, despite the lessons of previous natural disasters such as Hurricane Sandy, guaranteed that providers would choose to cut costs and increase profits rather than invest in hardening networks or emergency preparedness.\"An FCC spokesperson criticized Feld and Public Knowledge, saying they made \"cheap and false political attacks while people in the Florida Panhandle are suffering,\" according to Politico. \"Indeed, it is disgraceful that they would seek to co-opt this disaster to advocate for ideologically motivated regulations that have nothing to do with what is going on in the Florida Panhandle.”The deregulation affected wireline service rather than cellular. But Florida and Georgia are suffering both wireless and wired outages—as of today, the FCC says 112,402 Florida households lacked cable or wireline service because of the storm and 38,129 Georgian households lacked service. (The FCC does not provide details on which carriers account for those outages.)Pai and Scott's complaints about continued wireless outages also highlight the importance of requiring stable wireline service.\"Even at its best, wireless has a lot of limitations,\" Feld wrote. \"That's why we have traditionally regulated wireline as a public utility, requiring 'five 9s' reliability (99.999 percent reliable) with state-level penalties for failure to restore service in a timely manner, maintenance requirements, and so forth. Because if you want to be able to restore communications after a disaster, you need to have a healthy network in place to start with.\"Eight percent of cell sites in Florida's disaster area are still out of service, including 47 percent in Bay County.Feld continued:Additionally, as we kept pointing out [to the FCC before it repealed the regulations], the wireless network rides on and depends on the wireline network. Failure to maintain that wireline network because the rules don't make you and there are no consequences for failing to invest money to maintain it means that, even if you don't care about wireline and only want wireless, you are going to have to spend a lot more money and spend a lot more time restoring the wireline component in order to have reliable wireless service.The carriers do still face public pressure to restore service. For wireless, Verizon today said it has restored service in a few areas but still has a lot of work to do.\"Multiple efforts are being worked urgently in parallel to restore service in Bay County and surrounding areas of the Panhandle experiencing service interruptions as a result of Hurricane Michael,\" Verizon said. Verizon previously said that the fiber lines that supply bandwidth to its wireless network suffered \"unprecedented\" damage from the hurricane.AT&T told Ars that its wireless network \"is operating normally in Alabama and Georgia. In Florida, we have a limited number of customers in the hardest-hit areas that we're still working to address.\"A mix of companies is trying to restore cable and wireline service.Comcast would not tell Ars how many of its customers are without service, but the company announced today that \"it is suspending billing for customers located in the hardest-hit areas within its Florida Panhandle service area, including impacted areas of Panama City and Marianna.\"\"Our teams are working around the clock to restore services to customers as quickly as possible in an incredibly challenging and difficult environment,\" Comcast told Ars.Comcast told customers a week ago that power outages may delay restoration of cable service.Charter said it has \"only a tiny presence in the Panhandle,\" and thus its network wasn't affected much by the storm. AT&T also has a limited presence in the hard-hit parts of Florida but declined to say how many wireline customers lack service.CenturyLink told Ars that it suffered \"some local network impacts that are disrupting voice services to [fewer] than 1,000 customers in Florida.\" Local power outages are complicating restoration, and CenturyLink said it \"do[es] not have an estimated time when service will be restored.\"Windstream told Ars that it is \"making steady progress on restoration. As of this morning, we had about 5,000 customers still out of service in Florida, Georgia, South Carolina, and North Carolina.\"You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}