{"id": "Russia was likely behind dangerous critical infrastructure attack, report says", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nDan Goodin\n    -  Oct 24, 2018 12:42 pm UTC\nMalware that caused a dangerous operational failure inside a Middle Eastern critical infrastructure facility was most likely developed by a Russian government-backed research institute, researchers from US security firm FireEye said Tuesday.In a report published Tuesday, FireEye said its researchers now assess with high confidence that the malware used in the attack was developed with the help of the Central Scientific Research Institute of Chemistry and Mechanics in Moscow. The assessment was based on a variety of evidence that not only implicated the institute, which in Russian is abbreviated as CNIIHM, but also a specific professor who works there. Evidence linking the CNIIHM to the attack—which FireEye now calls TEMP.Veles—included malware that was tested inside the institute, artifacts left inside the malware used in the attack, an IP address belonging to CNIIHM, and the malware developer’s operating hours, which showed them observing a normal work schedule in Moscow.FireEye never identified the Middle Eastern critical infrastructure facility that was attacked, but CyberScoop in January reported it was a petrochemical plant located in Saudi Arabia.According to Tuesday's report:During our investigation of TEMP.Veles activity, we found multiple unique tools that the group deployed in the target environment. Some of these same tools, identified by hash, were evaluated in a malware testing environment by a single user.Malware Testing Environment Tied to TEMP.VelesWe identified a malware testing environment that we assess with high confidence was used to refine some TEMP.Veles tools.Testing, Malware Artifacts, and Malicious Activity Suggests Tie to CNIIHMMultiple factors suggest that this activity is Russian in origin and associated with CNIIHM.When the December report was disclosed, it already underscored an unsettling escalation in hacks on industrial control systems used in power plants, gas refineries, and other types of critical infrastructure. Now that FireEye is saying it was carried out with invaluable support from a Russian-owned institute, the stakes could be higher still. Russia has already been blamed for attacks in December 2015 and December 2016 on Ukrainian power facilities that caused power outages during one of the coldest months in Eastern Europe.On Twitter, Robert M. Lee, an expert on critical infrastructure attacks at Dragos Security, praised the FireEye research even as he cautioned against relying on it too much.Their analysts obviously put a lot of work into it and used their language very carefully. I am not trying to give confirmation to or detract from it - only want to give a kudos to what was well done research— Robert M. Lee (@RobertMLee) October 23, 2018“The @DragosInc team avoids attribution as it’s an inherently political topic and our view is it doesn’t help our customers,” he wrote. “But I’ve been asked about @FireEye’s analysis released on TRITON attribution today. I found their analysis to be thorough and very professional. Good job.”You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}