{"id": "Sunset Overdrive review: Ride the rails to kaboom-town (finally on PCs, too)", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSam Machkovech\n    -  Nov 17, 2018 3:07 pm UTC\nKeep moving, keep moving, keep moving. If I stay still, the monsters attack. If I stop sliding down rails, bouncing off of car hoods, or rappelling over zip lines, everything falls apart—the music in my head stops playing; the electricity stops surging through my dodge-rolls; the fire stops spewing from my duct-taped battle-axe.Welcome to Sunset City, a sunny, dilapidated corpse of a not-so-futuristic riverside metropolis. The place used to be overrun by selfie-snapping hipsters until they chugged a brand-new energy drink that turned them into crazed mutants (we mean literally, as opposed to the figurative craze of a caffeine high). Somehow, \"you\" (by way of a relatively robust character creator, which happens to sport the dumbest hairstyles known to man) avoided taking a sip, and now you must survive and escape the madness alongside the few remaining human survivors.Unlike everyone else, of course, you come prepared. When you find high-powered weapons, like a freeze ray or a bowling-ball launcher, you're able to shoot everything in sight with remarkable aim. When you see a building edge, a zip line, or other grindable and bounceable objects, you become a lightning-fast, super-powered parkour master.Conveniently for you, Sunset City seems to be made up almost entirely of goofy weapons and rideable surfaces, and they connect you to a relatively simple—and certainly familiar—style of Crackdown-esque open-world video game, broken up into quests. Go here, blow up monsters, go there, find hidden item, blow more stuff up, collect reward, wash, rinse, repeat.Sunset Overdrive has a lot of surface-level insanity in its favor, from its bright, day-glo punk aesthetic to its vulgar, meta-obsessed dialogue; from its hulking, mutated beasts to the visually arresting weapons used to dismember said beasts. The game wants very badly to whack you over the head with its style, as well, yet developer Insomniac Games doesn't falter or fumble due to that stylistic obsession.Here's the weird thing: the f-bombs and reddit references eventually turn into white noise, and you may yawn when a Popper explodes in a Nickelodeon-orange gush of ooze for the 1,000th time—or when the game knowingly mocks yet another one of its formulaic fetch quests. But Sunset Overdrive's sense of urgency, fueled by a need for perpetual motion, never wanes. This is the extreeeeme open-world video game that puts its money where its wide-open mouth is.As you can imagine, Sunset Overdrive's structure doesn't emphasize puzzles or other cerebral platforming, but it's also not as much of a \"combat\" game as you might expect from Insomniac Games, the developers best known for the every-weapon-is-crazy Ratchet and Clank series. Guns certainly play a big, explosive role, but they actually feel surprisingly formulaic; just because the grenade launcher shoots teddy bears doesn't mean it's not just another grenade launcher, and most of the other weapons offer visual gimmicks atop a gun you've seen before. Instead, the game's real victory is in traversal—in enabling it and in patting players on the back for doing it correctly.Your \"amps,\" a series of unlockable, upgradable superpowers, only work if you maintain a chain of grinds, bounces, wall-runs, kills, and other maneuvers. The longer the chain, the more amps power on simultaneously. You need these amps for the game's battles, but you also need to keep moving to survive. The massive numbers of foes you face also happen to come with acid blasts, machine guns, and other firepower that will run your health bar into the ground if you walk-and-shoot like in other games. If you're not riding the rails, you'll very quickly ride the pine.Sunset Overdrive demands a lot of movement from its players—and a lot of camera and perspective shifting to keep up—so its guns have been tuned to compensate. For the most part, getting good at combat is less about twitchy aiming and more about controlling large crowds beneath your grind-and-hop path, thanks to a mix of auto-aiming machine guns and large, area-of-effect blasters. Lay down an acid-spitting trap; pick off an impending swarm with a ricochet-loaded gun that, uh, shoots vinyl records; stop a trio of snipers with an ice grenade (and then shatter them with a melee smash).To encourage players to spice up their parkouring and their blasting, Sunset Overdrive also doles out badges for pretty much every action you do. Grind a rail? Badge! Wall-run to bunny hop to grenade throw? That's progress on three badges right there, getting you that much closer to new weapons, armor, and maneuverability upgrades. In that sense, Sunset Overdrive feels a little more like Tony Hawk than Jet Set Radio, at least in terms of demanding players get the most out of their move variety.The city also hides roughly 9,420,768 collectibles (give or take), which can be cashed in for more upgrades. What's important here is, even more so than Crackdown before it, Sunset Overdrive's traversal for such collectibles is reinforced with a mix of enjoyable, controllable speed and constant, reaffirming rewards.The plot-driven campaign has a lot going for it—a slow reveal of the game's beautiful environs, a ton of nicely designed, rail-loaded battlegrounds to glide over, a mess of crass, goofy dialogue powered by a surprisingly capable cast of voice actors—but it's not all that challenging. Auto-aiming assists fuel a lot of the combat, and even if you stand around like an idiot and die, coming back to life doesn't set back your progress all that much.Instead, the campaign feels more like a training mode for the optional ranked challenges that players can take on to unlock giant cash bonuses and unique outfits. Some of them set you up in a tower-defense situation, where you lay traps and manage waves of foes (which has been duplicated in multiplayer). Others ask you to whip around a quick stretch of road as quickly as possible or battle enemies with specific point-bonus requirements.All of these require a lot more concentration than the campaign—more planning for the fastest parkour routes, smarter bouncing between weapons, better strategy for how to maximize kill points—and get pretty demanding for players who want to achieve highest marks. The developers have struck a good balance between a playable, fun campaign that lets players relax a bit and a smattering of brutal, well-composed challenges.Unfortunately, while the co-operative multiplayer modes essentially crib from the ranked challenge structure, the challenge hasn't been scaled to match the new number of players. Six players can carpet-bomb each challenge with area-of-effect attacks that seem to be designed for only two players, and they end as quickly as they begin.In better news, Sunset Overdrive is the visual stunner that Xbox One has been needing for so long (snoozer Ryse notwithstanding). This game is a cereal box of color and wild designs, with wide draw distances, impressive facial animations, swarms of boil-covered mutants, humorous explosion effects, and smooth frame rates to boost the game's sense of speed.Just as important is how the game handles plot—namely, that it creates a sense of place without demanding the player necessarily invest in things like characters or gags. Jokes and snide comments come and go too rapidly for players to ever feel like the writers care all too seriously about any of them, making it far easier to digest than a humor-loaded game that takes its own humor too seriously.My main beef with the humor came with the game's repeated need to break the fourth wall. This was fine to a point, but when the main character keeps mocking the game's relatively boring quest structure, it begins to feel like picking a particularly annoying scab.Even those formulaic fetch quests are forgivable, because Insomniac spit-shined the maneuvers and always-grinding combat—the core loop of the gameplay—as opposed to trying to reinvent the open-world wheel. Sunset Overdrive is a big, dumb, fast shooter that knows its place in the big, dumb gaming pantheon and, quite frankly, revels in it.Verdict: Xbox One owners in need of an action-parkour fix should buy, buy, buy.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}