{"id": "This ancient Greek ship is the oldest intact shipwreck ever discovered", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nKiona N. Smith\n    -  Oct 24, 2018 3:08 pm UTC\nAn archaeological survey expedition called the Black Sea Maritime Archaeological Project discovered a shipwreck about 80km (49.7 miles) from the Bulgarian city of Burgas. A pair of remotely operated vehicles (ROVs) made a 3D map of the site and took a sample of wood for radiocarbon dating, which suggest that the ship was built around 2,400 years ago.It looks surprisingly good for its age; its hull is still intact, its cargo is still piled in the hold, and the rowing benches on its deck look like they’re ready for the crew to pick up an oar and get to work. Truly ancient wrecks like this one usually leave behind only a scattering of amphorae, ballast stones, or broken pottery on the seafloor to tell the tale. But the depths of the Black Sea have turned out to be like a time capsule for ancient shipwrecks.The Black Sea’s depth averages 1,253m (4,111ft), but the deepest places on the seafloor lie 2,212m (7,257ft) beneath the waves. There are plenty of much deeper places in the world’s oceans, but the Black Sea is unique because its deeper layers, which flow in from the bottom of the Mediterranean, don’t mix with the oxygenated waters of the surface, which pour in from rivers. Most of the deep sea floor in the Black Sea is completely anoxic, making it a bad environment for most of the microbial species that would normally break down the wood of a shipwreck. So not much has happened to the ancient Greek trading ship as it has rested on its side in the anoxic darkness 2,000m (1.2 miles) below the surface, even as two and a half millennia of history passed in the world above.Archaeologists with Black Sea MAP say the 23m (75ft) long vessel was probably plying a route between Greece and its colonies on the Black Sea coast around 400 BCE, but it never reached its destination. While archaeologists would normally turn to the contents of its surviving cargo—examining, for example, stamps or inscriptions on amphorae or other pottery—to trace the ship back to at least one of the ports on its route, the incredible preservation of the ship presents a challenge in this case. With all of the cargo still sitting in the hold instead of scattered across the seabed, Black Sea MAP’s two ROVs couldn’t actually examine it.And although no one has ever seen a Greek trading ship of this age, the design is strikingly familiar to nautical archaeologists and historians. The wreck bears an undeniable resemblance to a ship painted on a vase from around 480 BCE. Now on display in the British Museum, the so-called Siren Vase depicts a scene from Homer’s Odyssey: Odysseus lashed to the mast of his ship as it passes the home of the Sirens.The overall shape of the painted hull looks a lot like the real ship lying on the bottom, but the ancient artist was surprisingly accurate about other details, too, like the position of the mast closer to the bow, the rowing benches amidships, and the shape of the rudder at the stern. When the wind blew favorably, the crew would have hoisted a square sail on the mast; the rest of the time, rowers would have lined up on the benches and propelled the ship along with large oars. It’s an interesting validation of a long-standing habit among archaeologists who study ancient ships: looking to ancient art for clues about how the ships were designed and built.In fact, many of the ideas we have about the early invention and design of rudders came from depictions of ships in ancient art. An intact 2,400-year-old rudder could help archaeologists answer more questions about the development of that technology. This shipwreck no doubt holds a bounty of other evidence about ancient ship design and construction, and its cargo probably contains more detailed information about ancient trade than any other single ancient shipwreck site yet discovered. But getting to it is going to be a challenge.The wreck lies far too deep for divers to reach. That offers great protection from treasure hunters and vandals, but it also makes archaeological excavation expensive and difficult. And any excavation that plans to raise artifacts will need plans, facilities, and funding to ensure that they’re treated and stored properly, which is especially important given the large number of very well-preserved artifacts at this site. Black Sea MAP currently has no funding for an excavation of the site, but it is presenting its results at a conference in the UK this week. Along with the ancient Greek merchant ship, its three-year survey has located 17th century Cossack raiders, an ancient Roman merchant ship, and more than 60 other shipwrecks.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}