{"id": "Abstract board games are all the rage—and Reef is the year’s best", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nAaron Zimmerman\n    -  Nov 17, 2018 2:20 pm UTC\nAbstract, family-style board games are all the rage these days, and for good reason. They tend to occupy that sweetest of sweet spots—accessible to non-gamers while remaining strategic enough to keep veteran players engaged. Their simple rulesets are packaged with quality components, bright colors, and light themes. In short, they're games that just about anyone can enjoy.Reef is a competitive game for one to four players about constructing coral reefs to score points. Presumably, you and your friends are corals, toiling for thousands of years to build gorgeous underwater ecosystems. Mechanically, this actually means you’re playing cards and stacking plastic pieces in a brisk 30-minute game.The unspoken rule in abstract game production is that, in order to make a hit that finds its way to every gaming family’s shelf, you have to include chunky, attractive game pieces. Reef delivers here, with substantial plastic blocks that stack easily and—while they look a bit like something you’d see in a preschooler’s toybox—are fun to play with.The game’s engine is remarkably simple, and you can teach the whole thing in minutes. On your turn, you can do one of two actions: take a card or play a card. But like all good games with simple rulesets, these two actions present a lot of strategy to chew on.If you take a card, you choose from a Ticket-to-Ride-style display of four options. Cards in three of the slots are free; the fourth slot requires you to place a point token on one of the free cards for the privilege of taking it (this keeps less desirable cards moving—hey, free points!).If you play a card, two things happen. First, you get the plastic reef pieces shown on the top of the card from the central supply (they come in four colors). Then, if you’ve managed to construct the pattern shown on the bottom of the card, you score points.Enlarge / Get what's on the top of the card, score what's on the bottom.Aaron ZimmermanIf you play the card to the right, for example, you'd acquire and place two purple pieces on your personal player board, and then you would score three points for every time you've matched the pattern on the bottom—in this case, an orange and a green next to each other. Some cards require you to have towers of certain heights or other such goals, with the color always denoting the highest piece in each stack.The genius of the game is that aside from a few rare “wild” color goals, the pieces you get from the top of a card never help you immediately accomplish the goals on the bottom of the card. If you’re playing a card that lets you score for purple coral, for instance, the top of the card is going to give you pieces of a different color. So you always have to be thinking several turns ahead, wrestling with often imperfect color acquisition and resisting the urge play your monster scoring card until the time is perfect. Your hand size is limited to four cards, so there’s no way to hoard a perfect sequence of cards to cut down on waste.Do you play a card that gets you the colors you need even though it wastes the scoring opportunity at the bottom of the card? Maybe you should grab that card in the display with a really nice scoring opportunity, but then you’d have to play another card first, and you were saving that card until you got some more green pieces—but playing green pieces would mess up this other plan...Chaining cards to squeeze every last drop of efficiency out of them requires a running cost/benefit analysis, as every time you play a card, you’re giving something up. Almost every decision you make is agonizing (in the best of ways), and when the heavens open up and you’re finally able to set your multi-card combo into motion, you feel like a genius.Some of these finer points will be lost on younger kids (and unenthusiastic adults), but when you’re stacking colorful coral reef pieces, it’s really hard to have a bad time.The game ends when one of the colors is depleted (or, rarely, if you make it through the entire deck of cards). Reef’s end condition is the source of my biggest complaint against the game—namely that there’s the potential for “kingmaking.” Ending the game when it’s advantageous for you to do so is simply good strategy, but what if you’re not winning? Do you take that last piece if it hands the victory to one player over another? The rulebook seems to acknowledge this potential issue, advising that while the victory point tokens are not hidden, you can stack them to make it harder to get an accurate count. It mostly works, and the issue shouldn’t arise often, but it’s worth mentioning.Reef is also very “multiplayer solitaire”—your interaction with your opponents is limited to denying them cards they want. You probably already know if this is a dealbreaker for you. (Being a hardcore Euro-head, I love the whole “do a puzzle with friends and compare scores at the end” thing.)How does Reef stack up against last year’s Azul? It’s lighter, it lacks the compelling (and cutthroat) interaction between players, and it feels less like an undeniably instant classic. Replayability is good, though it feels more like you’re playing a game and less like you’re playing your opponents, as you do in Azul.But there’s a ton to love here, and Reef is arguably a better fit for families. If you need a game for upcoming holiday gatherings—or just a fun filler for your next game night—we can't recommend Reef highly enough.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}