{"id": "NASA’s daring asteroid mission unfurls its sampling arm for the first time", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Nov 16, 2018 10:00 pm UTC\nNASA officials confirmed Friday that a test of a key component of the space agency's mission to sample an asteroid was completed successfully. On Wednesday, for the first time in more than two years, the OSIRIS-REx spacecraft unfurled its robotic arm and put it through a series of maneuvers to ensure its space-worthiness after being packed away for launch and a long flight to the asteroid Bennu.The asteroid sampling mission launched in September 2016, and the spacecraft has since been traveling through space to catch up to an asteroid known as Bennu, which has a diameter of about 500 meters. The spacecraft will officially \"arrive\" at Bennu in about two weeks, on December 3, so mission scientists wanted to make sure the robotic arm was functional after being stowed for so long.This arm and its sampler head, known as the Touch-and-Go Sample Acquisition Mechanism or TAGSAM, is critical to the mission's goal of retrieving at least 60 grams of material from the surface of Bennu and returning this sample to Earth by 2023. The collection device will act something like a reverse vacuum cleaner.NASA has never tried something like this before—a maneuver in which the arm will place the TAGSAM \"head\" at the surface of the asteroid. \"TAGSAM is about the size of an old air filter in a car,\" explained Beau Bierhaus, a Lockheed Martin scientist who leads TAGSAM operations and serves as the OSIRIS-REx mission science co-investigator. Lockheed Martin built the spacecraft for NASA, and one of its engineers conceived the TAGSAM mechanism.During the collection maneuver, a blast of compressed nitrogen gas will be sent from the spacecraft onto the surface of the asteroid. The TAGSAM will then collect dirt and dust particles kicked up by the nitrogen gas and store them in a special canister, while allowing the gas itself to escape. In microgravity and vacuum chamber tests, the sampling arm has collected between 400 and 500 grams during most attempts.This sampling maneuver will not occur until July 2020. Until then, OSIRIS-REx will study the asteroid in great detail—mapping the topology of the space rock to a greater resolution than even the Earth's surface. The map of Bennu will have on the order of 5cm spatial and a few cm vertical resolution, Bierhaus told Ars.The spacecraft will obtain this detailed map over the next 18 months or so, with a preliminary survey that brings OSIRIS-REx to within about 7km of the asteroid's surface and then two orbital phases that bring it down to within about 750 meters from the surface. From there, it will be time for a final site selection and sample selection rehearsals. Scientists will have their say in terms of the most interesting site to sample, but other criteria rank higher, including accessibility and the ability to keep the spacecraft safe during its approach to Bennu.NASA has few samples from other worlds in its collections. There are its Moon rocks, collected during the Apollo mission, of course. It also has bits of interstellar dust and cometary material. The Soviet Union flew three robotic landers in the 1970s that retrieved a few hundred grams of Moon rocks, and the Japanese space program has flown two asteroid sample return missions.So this stuff isn't easy. Making sure the long-dormant sampling arm can flex its joints is a good first step.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}