{"id": "Feds: 3 ex-Genentech scientists stole from biotech giant to help startup", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Oct 30, 2018 12:38 pm UTC\nAccording to a press release issued Monday by the United States Attorney’s Office in San Francisco, Xanthe Lam, Allen Lam, and James Quach are alleged to have taken \"confidential Genentech information to help a company in Taiwan create and sell drugs similar to those that were created by Genentech.\" John Chan, a fourth co-defendant, was never an employee at Genentech.Xanthe Lam, the wife of Allen Lam, and the two other men reportedly became consultants for a Taiwan-based company known as JHL Biotech, which was founded in 2012 and manufactures \"biosimilar\" pharmaceuticals. According to the Food and Drug Administration: \"A biosimilar is a biological product that is highly similar to and has no clinically meaningful differences from an existing FDA-approved reference product.\"Over the course of approximately five years, ending in October 2017, the four individuals are accused of stealing \"the company’s trade secrets related to biopharmaceuticals Pulmozyme, Rituxan, Herceptin, and Avastin,\" according to prosecutors. These drugs are used in treatments of cystic fibrosis, non-Hodgkin’s lymphoma, breast cancer, and other cancers.Court records show that the four made an appearance in federal court in San Francisco on Monday and were released on bond.The judge overseeing the case is US District Court Judge William Alsup, who coincidentally presided over the high-profile trade secrets case earlier this year, Waymo v. Uber.The defendants are all due back in court on November 2.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}