{"id": "Call of Duty: Black Ops 4 review: War games, now with battle royale!", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJulie Muncy\n        -  Oct 19, 2018 3:25 pm UTC\nTo be fair, Call of Duty: Black Ops 4 changes more than most. The highly choreographed, extravagantly cinematic single-player campaign that has been de rigueur for the series' entire lifespan has been excised. That leaves an awkward hole at the core of the experience, which developer Treyarch has filled with Blackout, an 88- to 100-player battle royale mode in the vein of Fortnite or PlayerUnknown's Battlegrounds. The rest of the game modes—the standard-by-now multiplayer suite and the ridiculous-but-addictive Zombies mode—fall in line around Blackout, creating a three-tiered experience of hyper-violence and militaristic energy.Black Ops 4 is the biggest single-game change for the Call of Duty franchise in ages. But it's still, when it comes right down to it, just another Call of Duty.Black Ops 4 doesn't present its content in any particular order. As a player, you can jump freely between its three modes, and nothing—except for player progression in each mode—is gated from the start. The natural place to start, though, is Blackout, the newest part of the Call of Duty package, both the most derivative and the most distinct mode on offer. Taking place on a sprawling map stitched together from locations and motifs in Call of Duty's multiplayer past, Blackout heavily resembles just about any other battle royale game, both in concept and execution.The rhythms of play are functionally the same: drop, scavenge, fight. Or, depending on your mood, hide with a white-knuckled grip on the best gun you can find. Not long after the match begins, a safe zone appears that steadily shrinks, forcing players into closer and closer confrontation, until only one is left standing. There are no chicken dinners for victors in Black Ops 4, but there's glory and the sweet, sweet tang of experience points.Blackout is, arguably, the first truly AAA take on the battle royale experience—the first made with the budget and complexity expected of major game releases. Despite that, the differences between the new mode and the existing battle royale competition are quite subtle. Gun handling and movement are fantastic, precise, and fluid, built on top of the core Call of Duty experience that lends a level of polish that other games in the genre often lack. And there are the obligatory bells and whistles that come with a production this size—you can break windows, bullets can penetrate walls, and you can swim and even fight underwater (which I would not recommend, based on my experience).But the biggest shift from other games in the genre is the pacing. Call of Duty is known as a series with fragile player characters. In multiplayer game jargon, this is measured in \"time to kill\"—the amount of sustained fire needed to take down another player. In Call of Duty, that measure is blazingly fast. This means Blackout can feel capricious and jarring in a way that other battle royale games don't. Most of my deaths in Blackout occur suddenly and unexpectedly, as a stray burst of fire cuts me down from afar.This creates an interesting vibe for this type of game, heightening the lingering tension and terror of the omnidirectional free-for-all. It gives the proceedings a paranoid, lone-gunman vibe that's very much in keeping with Call of Duty's aesthetics. But it also makes the mode a bit less accessible as a result. Blackout may draw existing Call of Duty fans into the battle royale experience, but it seems unlikely to attract anyone else.The other two play modes, while compelling in their own right, are less notable. The normal competitive multiplayer tries new things, but the scope of its modifications is less significant than it might appear.Within the standard set of deathmatch, capture-the-flag, and free-for-all modes, Black Ops 4 implements two new systems that purport to change the gameplay significantly. The first, and most noticeable, is a manual healing system. This comes in the form of a rechargeable health pack that the player uses at will, replacing the automatically replenishing health from older titles.The goal of this change seems to be to slow down play, and it works—a little. Changing the health system turns recovery into a strategic consideration, and such complications are always welcome. Being able to dive behind cover and heal when necessary makes players slightly harder to kill and allows you, in some situations, to even tank damage in order to get a retaliatory kill. But players, in my experience, can still do enough damage quickly enough that the strategic significance is often moot, especially for lower-skill competitors. The difference might not be significant enough to really change the rhythms of play for most people.The other change is the introduction of a class-based system, where each player chooses a character with specific skills attached to them. While most players might immediately compare this to Overwatch, the better comparison is to Rainbow Six Siege, which uses a similar combination of military aesthetics and abilities pulled from high-tech military technology to fill its game with a variety of unique characters. These abilities range from the offensive, like a powerful cluster grenade; to the defensive, like a massive anti-personnel shield; plus additional supportive abilities, like the ability to create a new spawn point for your team as well.The class system threatens to turn Black Ops 4 into a wholly different kind of shooter, but it mostly doesn't. While the abilities do matter, they're limited enough, and recharge slowly enough, that they merely supplement rather than define the play. This is less a new type of Call of Duty than it is a new flavor—an additional set of grace notes layered on top of the same experience you remember. Functionally, these are good additions and make the game somewhat more accessible to new players. They also, notably, include the only real story in the game, scattered among the tutorial missions that teach you how to play each character. It's classic Black Ops stuff—a futuristic world of horrid violence—and while it's layered thinly, it's nice, at least, to have it.Zombies mode, meanwhile, is roughly what it always has been: an eccentric, lighter, and goofier take on the formula with some fascinating and obscure puzzles for the hardcore. On the surface, it's a compelling player-versus-environment experience starring over-the-top characters and a bunch of zombies to kill. Go a little deeper, and it's wonderfully arcane, with hidden puzzles that reveal an elaborate and bizarre lore and complicated sets of map-specific mechanics that are pretty fun—if you play with someone who knows what they're doing.This, then, is Call of Duty Black Ops 4: a competent, carefully crafted but ultimately safe iteration in a long, storied franchise that, frankly, has much better entries. Yet it's also one of the most distinct Call of Duty games, an obvious bid at turning the series into a one-stop-shop multiplayer extravaganza—the only game Call of Duty fans will ever need. Until next year, at least.What that means is that it's difficult to recommend Black Ops 4, while also being hard to dismiss it outright. If the series appeals to you, there are interesting things here. If it doesn't, nothing is going to really change your mind. Which, I suppose, is par for the course. And hey, there's always next year.Verdict: Try it with some friends.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}