{"id": "Cultural barriers still stand in the way of HPV vaccine uptake", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCathleen O'Grady\n    -  Nov 4, 2018 4:00 pm UTC\nEvery year, nearly 34,000 cases of cancer in the US can be attributed to HPV, the human papillomavirus . The CDC estimates that vaccination could prevent around 93 percent of those cancers. Yet HPV vaccination rates are abysmal: only half of the teenagers in the US were fully vaccinated in 2017.Cultural barriers play a role in that low rate. Vaccinating pre-teens against a sexually transmitted infection has had parents concerned that that this would encourage their kids to have sex sooner, with more partners, or without protection or birth control. And vaccine rates vary across different social and cultural groups: for instance, rural teenagers are less likely to be vaccinated than urban ones.Two recent studies explore different facets of the cultural barriers standing in the way of better HPV vaccine uptake. The first, a paper published last month in the Canadian Medical Association Journal, looks at the data on whether the vaccine encourages riskier sexual behavior and finds no evidence that it does. And the second, an early draft of a paper presented at an American Association for Cancer Research meeting this week, reports the results of a culturally-targeted intervention aiming to increase vaccine uptake among low-income Chinese Americans.Although the vaccine is now recommended for both boys and girls, the initial drive was to get teenage girls vaccinated, given the link between HPV and cervical cancer. That’s why girls are the focus of the recent study on risky sexual behavior: the researchers used data from high school girls in Canada, where a huge survey on adolescent health is administered every few years.A team of researchers was able to use this data to compare results from the survey before and after a large-scale HPV vaccine program was implemented across high schools in Canada in 2008. The researchers compared data from 2003, before the program began, to data from 2008 and 2013. Altogether, nearly 300,000 girls’ survey responses were analyzed.The researchers found that, on every measure they looked at, risky sexual behaviors either decreased or stayed the same. The number of girls who had ever had sex decreased from 21.3 percent in 2003 to 18.3 percent in 2013. The girls who’d had sex before age 14 decreased from 14.3 percent to 10.2 percent, and girls who’d ever been pregnant went from 5.9 percent to 3.4 percent. The use of condoms increased, as did the use of birth control pills.The researchers are careful to point out that they don’t think the HPV vaccine caused the increase in safe sex among the teenagers. That shift was already underway, they write, pointing to data showing “a downward trend in risky sexual behaviors since before 2003.” But it does suggest that the introduction of the vaccine in 2008 wasn’t associated with an increase in risky sexual behaviors.Survey data like this has its problems, especially when the questions involve sex. It’s likely that the girls aren’t telling all, even when the survey is anonymous. But because all three years of the survey are likely to suffer from the same problem, the comparison is still apples with apples. And it’s possible that in a parallel universe without the vaccine, the risky behaviors could have plummeted even further; there's simply no way to tell.The researchers plan to explore whether risky behavior looks different in girls who had been vaccinated compared to those who hadn’t. To do this, they will introduce a new question in the survey, which asks girls about their HPV vaccination status. But in the meantime, these results fit in well with a growing body of literature: a study in the US that compared girls who were and weren’t vaccinated found no differences in pregnancy or STD rates between the two groups, while a different Canadian study found similar results.Some research has even found that girls who’ve had the vaccine have safer sex than those who haven’t. That could be because HPV vaccine programs often go hand-in-hand with sex education, and teasing apart those influences is extremely difficult. But it seems unlikely that a significant change in risky behavior is lurking hidden in the data.The obvious benefits of the vaccine make it important for us to understand why its uptake isn’t higher. The rate is even lower among certain groups, says Grace X. Ma, director of the Center for Asian Health in Philadelphia. While Asian American teenagers have rates similar to the average, “there are certain subgroups, such as Chinese Americans whose parents are low-income and have limited English proficiency, for whom uptake is much lower.” According to Ma, different sources placed the rate at between 10 and 30 percent at the time she started her research.Ma designed a program to reach these parents through doctors, using materials written in their own languages and delivered through a source they were inclined to trust. In a small pilot study, Ma engaged pediatricians working in low-income Asian communities in Philadelphia and New York. By the end of the study, 110 parents had been reached by the materials, while a control group of 70 hadn’t. More than 70 percent of the teenagers of those 110 parents “had at least one dose of the HPV vaccine, compared with 10 percent of adolescents whose parents did not receive the intervention,” Ma reports.Without a lot more information, it’s difficult to know what was driving this difference: it could be the cultural specificity of the materials, it could simply be access to the information in a language the parents understand, or a longer and more focused conversation with the doctor might drive the change.But research in this vein, exploring the effects of different kinds of interventions, could give important clues to how vaccine uptake could be improved in a wider range of population groups. The potential barriers could range from cultural attitudes about sex to language issues to financial access to medical care. But clearly, simple access to the vaccine isn’t enough to encourage widespread adoption.Canadian Medical Association Journal, 2018.  DOI: 10.1503/cmaj.180628  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}