{"id": "New year, same story: Cost of wind and solar fall below cost of coal and gas", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nMegan Geuss\n    -  Nov 12, 2018 3:23 pm UTC\nIt's that time of the year again: time for financial advisory company Lazard to release its annual Levelized Cost of Energy (LCOE) study. (We know, you've been waiting all year.) The numbers in the report offer economic insight into how energy choices were made in the previous year and how the energy landscape will likely change in the coming year.Lazard surveys energy buildouts that occurred in the previous year and divides the estimated cost of building and operating the plant, including fuel cost estimates, by the amount of energy a particular plant is expected to produce in its lifetime. This is useful because a nuclear power plant might cost billions to build, but it would have a vastly longer life and higher output than, say, a field of solar panels. By breaking costs down on a per-megawatt-hour basis, it becomes easier to compare sources of electricity.Here, utility-scale solar photovoltaic stands out because unsubsidized costs to install actually fell on a per-MWh basis, despite solar tariffs instituted by the Trump administration in early 2017. Part of this may be due to the fact that China ended a domestic solar panel subsidy, causing Chinese customers to buy fewer solar panels, resulting in a glut of panels that could be sold for even cheaper on the international market than before.Although this is Lazard's 12th year quantifying the cost of energy, it's only the fourth year that it has released a separate report quantifying the cost of storage (PDF). Energy storage includes grid-scale lithium-ion batteries as well as vanadium and zinc flow batteries, lead-acid batteries, and advanced lead batteries.Lazard breaks these down further by market: batteries selling storage wholesale have different revenue streams than batteries connected to utility-grade solar or commercial standalone batteries that are not controlled by a utility.Here, Lazard says that lithium-ion batteries showed significant cost declines in the relevant markets throughout 2018. Meanwhile, \"cost declines for flow batteries are less significant but still observable,\" Lazard writes. The financial advisory company unfortunately doesn't expect that to last: \"Future declines in the cost of lithium-ion technologies are expected to be mitigated by rising cobalt and lithium carbonate prices as well as delayed battery availability due to high levels of factory utilization.\"Lazard also found that shorter-duration batteries, which can discharge over about four hours, are the most cost-effective of any batteries. These batteries \"improve the grid’s ability to respond to momentary or short duration fluctuations in electricity supply and demand.\" This has been confirmed by reports from real-world battery use in Australia, where the massive Tesla battery at the Hornsdale Wind Farm has been used to maintain grid frequency, rather than replacing more traditional forms of electricity generation.Correction: This story has been updated to reflect that the financial advisory branch of Lazard produces its Levelized Cost of Energy Report, not the asset management branch.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}