{"id": "States will vote on these energy and environment issues in midterm elections", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nMegan Geuss\n    -  Nov 4, 2018 11:30 pm UTC\nIn the United States, mid-term elections are set to take place on Tuesday, November 6. Although much of the limelight is on Congressional races and gubernatorial races, US citizens also have the chance to vote on some important initiatives, measures, and amendments that are specific to their state. These state rules can often have a more direct impact on the lives of Americans than their representatives in Congress do, but because proposals tend to be long and nuanced, they also can attract a lot less attention.Energy and environment topics are among the most contentious of 2018's ballots, especially in western states where fossil fuel interests are facing a public that's increasingly concerned with climate change. Here's a look at seven proposed rules on US state ballots that could influence state economies and environments in serious ways.Salmon Habitat Protections and Permits InitiativeBallot Measure 1 has grown out of local contention over the Pebble Gold Mine, a massive project that was recently put on hold due to the mine's potential impacts on local watersheds and the salmon population in the area. Salmon and other fish that breed in fresh water but live most of their lives in salt water are important to many Alaskans, both as food and as industry, and this measure would seek to provide additional protection for salmon. But the measure is opposed by 12 of Alaska's Native Regional Corporations as well as mining and oil and gas companies. Those organizations say existing regulations have worked and the measure will hurt Alaska's economy.The measure seeks to change how the Department of Fish and Game evaluates industrial projects proposed in salmon habitats. It splits permitting into two parts: \"minor permits\" for projects that will not have a significant impact on salmon populations and \"major permits\" for projects \"such as mines, dams and anything determined to potentially have a significant impact on salmon-bearing water,\" the Anchorage Daily News reports. In addition to the new permitting tiers, mining or dam projects would also be required to take public comment before they could be issued a permit.Ban Offshore Oil and Gas Drilling and Ban Vaping in Enclosed Indoor Workplaces AmendmentThis odd ballot item ties two amendments to Florida's state constitution together in one. Voters who oppose offshore oil and gas drilling but support indoor workplace vaping, or those who support offshore oil and gas drilling but oppose indoor workplace vaping are out of luck; Florida voters must either support or oppose both. They're bundled together because that's how Florida's Constitutional Review Commission approved the potential changes, according to First Coast News.The offshore oil drilling portion of the Amendment change would ban oil and gas drilling in state waters, that is, up to three miles from Florida coastline. Florida residents and businesses have generally been opposed to oil and gas drilling near the coastline because the state is heavily tourism-dependent, and it fears a Deepwater-Horizon-like disaster.Separately, Florida's governor recently sought a concession from the federal government to spare Florida from offshore oil drilling in federal waters, that is, in waters beyond the three-mile state waters limit. The US Interior Department has excepted Florida from offshore oil lease sales, prompting lawsuits from other states that want similar protection against offshore drilling.Requirements for Permits and Reclamation Plans of New Hard Rock Mines InitiativeThis item on Montana's ballot deals with the way the state regulates hard rock mining, which includes mining for gold, copper, zinc, nickel, and more. Montana's Department of Environmental Quality (DEQ) reviews hard rock mining permits before they can be approved and requires that a mining company outline how it will close a proposed mine and reclaim the land after it's done mining. This new item will require those regulators to deny a permit if the mining company proposes a land reclamation plan that requires water on mined land to be treated indefinitely.A survey from Montana State University suggests that this measure has broad support among Montanans, with 50 percent of respondents saying they were for it and 28 percent saying they were against it, with the remainder saying they didn't know how they would vote.Carbon Emissions Fee MeasureWashington's Initiative 1631 sets a price of $15 on carbon emissions from large emitters, with the price increasing by $2 every year until the state's 2035 greenhouse gas emissions targets are met. According to McClatchy DC, \"the Washington Office of Financial Management said the fee would raise more than $2 billion in the first five years.\" Oil exported from Washington would be exempt, as would coal plants that are scheduled to close before 2025.Unlike the federal carbon tax proposed by a small handful of Republicans in Congress, the proposed initiative introduces a fee whose revenue will be placed into a few funds dedicated to environmental protections and community investments. The fee is also unlike the cap-and-trade program that exists in California, where emitters buy and sell credits that permit them to emit CO2 at regular credit auctions.Proponents of the initiative say that Washington is already one of the least carbon-intensive states in the nation, relying on hydropower for a significant portion of its electricity, so the initiative wouldn't increase electricity prices significantly. Opponents say that Initiative 1631 would increase gas prices by $0.14 per gallon, and utilities in southeastern Washington, where less hydropower is available, say their customers' electricity bills would increase as well.Minimum Distance Requirements for New Oil, Gas, and Fracking Projects InitiativeThis contentious proposition aims to change the minimum distance between oil drilling rigs and homes, schools, and other \"sensitive areas\" from 500ft to 2,500ft. The oil and gas industry has claimed that this would end drilling in a significant portion of the state and take high-paying jobs with it. Others have contended that the economic effects would not be quite as bad as oil and gas claim, due to the fact that oil wells can be drilled horizontally, underneath homes, for a length of up to two miles. The initiative would also not apply to federally owned land.The proposition comes on the heels of a March 2018 study in the journal Environmental Science and Technology that found that Coloradans who lived within 500ft of an oil or gas drilling rig had higher rates of cancer and other health issues than those who did not. Additionally, the proposition comes after a 2017 incident in which fugitive gas from a nearby oil well owned by Anadarko caused a home in Firestone, Colorado, to explode, killing two men and injuring a woman and a child. The house had been built 200 feet from the well some 20 years after the well had been sited. Oil and gas has spent some $30 million to defeat the proposition, dwarfing spending from the mostly grassroots proponents.Renewable Energy Standards InitiativeProposition 127 would require Arizona utilities to increase the amount of renewable energy it incorporates into the grid from 12 percent in 2020 to 50 percent in 2030. Currently, Arizona is targeting 15 percent renewable energy on its grid by 2025, so this new proposition would be significantly more aggressive.Both sides have spent a lot of money trying to get Proposition 127 passed or killed, and AZ Central recently reported that the ballot measure is the most expensive in Arizona history. Proponents of the measure point to other nearby states, like California, that have implemented much more aggressive renewables policies as solar and wind prices have fallen. Opponents claim that utilities would have to retire coal and nuclear plants years earlier than expected.Changes to Energy Market and Prohibit State-Sanctioned Electric-Generation Monopolies AmendmentThis item on Nevada's upcoming ballot would introduce some deregulatory action into Nevada's utility system. It would require the state to open up electricity generation to competition and prohibit the state from granting electricity generation monopolies in certain areas.Utility Dive notes that this question was put on the Nevada ballot to try to force more renewable energy on the grid, but NV Energy, Nevada's largest utility, has countered this measure by promising an aggressive renewable plan as long as voters reject Question 3. The utility says that it will only meet its minimum renewables requirement and no more if the ballot item is accepted.Renewable Energy Standards InitiativeQuestion 6 mirrors Arizona's Proposition 127 in that it requires state utilities to meet 50 percent renewable penetration by 2030. Currently, the state's renewables mandate requires utilities like NV Energy to cover 25 percent of its electricity generation with renewable sources by 2025, so again, Question 6 makes the state's renewables path more aggressive.Utility Dive also notes that there's less controversy around Nevada's Question 6 than there is around Arizona's Proposition 127 because NV Energy is already much further along when it comes to renewables penetration than Arizona is. Currently, about seven percent of Arizona's electricity comes from renewable sources, whereas 20 percent of Nevada's energy currently comes from renewable sources. In particular, Nevada has rich geothermal resources. If you're inclined to see for yourself, Ars toured some of northern Nevada's best geothermal resources in 2014!You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}