{"id": "Essen 2018: The best board games from the biggest board game con", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nOwen Duffy\n        -  Nov 3, 2018 12:00 pm UTC\nThis past weekend, tens of thousands of tabletop gaming fanatics made a pilgrimage to the German city of Essen for the annual Internationale Spieltage fair—better known to board gaming fans simply as Spiel (or Essen). It’s the most important event in the board gaming calendar, where major publishers unveil their new releases, indie designers clamor to draw attention to their passion projects, and players scramble to try the hottest new games before they hit store shelves.It’s a heaving, sprawling, noisy celebration of analogue gaming, and with thousands of new products on show, it’s impossible to do more than scratch the surface of what’s on offer. Once you set foot in the cavernous Messe Essen venue, you quickly realize that no matter how meticulously you’ve planned your visit, it all counts for nothing; it’s all about spotting empty spaces at demo tables and leaping at them before anyone else.Still, I managed to play a bevy of exciting new games, and along the way we discovered a few surprise favorites. Here are our highlights of Spiel 2018.Aya & Shun, Queen Games, 2 - 4 players, 45 minutes, ages 8+This fantasy-themed tile-laying game has players building chains of floating islands in the sky. You’ll score points by constructing different configurations of islands, populating cities, and avoiding empty space on your player board at game’s end. Standard stuff—but what makes it interesting is how you go about it.You’ll choose a single action to take on each turn, like adding a new land tile to your board or filling some of your islands with new inhabitants. But whatever action you choose, your opponents will immediately get to take a slightly less powerful version of the same action. It’s therefore almost impossible for one player to establish an unassailable lead, and you’ll need to pay close attention to your rivals’ boards to spot moves that benefit you—while not opening up opportunities for others.The result is that Skylands comes with just a touch more player interaction than similar games, where your only way to interfere with an opponent’s plans is by snatching resources they might want. This interaction adds an extra layer to your decision making. Combined with a multitude of ways to score points, it allows for some impressive tactical depth in a family-weight game.Richard Garfield, Fantasy Flight Games, 2 players, 15 - 45 minutes, ages 12+ (publisher suggests 14+) Ars Technica’s Aaron Zimmerman touched on Keyforge, the new card game from Magic: The Gathering creator Richard Garfield, in his report from Gen Con earlier this year. But I got my hands on a set of advance review decks around a month ago, and Keyforge has quickly become one of my favorite games of 2018.Each deck contains cards from three factions, and players can only activate a single faction on each turn. This neatly sidesteps Magic’s issue of “mana screw,” where players can be left without the resources they need to play the cards in their hand, but it still imposes interesting restrictions on what they’re able to do at any given time. It makes for a succession of big, swingy, dramatic events, but never at the expense of thoughtful strategy.The big question is whether Keyforge is likely to find an audience. Are there enough players who are interested in geeky card games but don’t want to get into the complexities of crafting their own decks? I hope so.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}