{"id": "FCC Republican claims municipal broadband is threat to First Amendment", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJon Brodkin\n    -  Oct 30, 2018 6:10 pm UTC\nA Republican on the Federal Communications Commission claimed that municipal broadband networks pose a unique threat to First Amendment free speech rights—but provided no compelling evidence to back his claim.FCC Commissioner Michael O'Rielly made his claim in a speech last week at the Media Institute's \"Free Speech America\" event. (Motherboard wrote about O'Rielly's speech yesterday, and the FCC posted a transcript.)O'Rielly said that broadband providers run by local governments \"have engaged in significant First Amendment mischief.\" But O'Rielly's only evidence to support his claim was the networks' Acceptable Use Policies, which contain boilerplate language similar to the policies used by private ISPs such as Comcast and AT&T.\"Back to the FCC, I would be remiss if my address omitted a discussion of a lesser-known, but particularly ominous, threat to the First Amendment in the age of the Internet: state-owned and operated broadband networks,\" O'Rielly said.After criticizing the Obama-era FCC for trying to promote municipally run networks, O'Rielly continued:In addition to creating competitive distortions and misdirecting scarce resources that should go to bringing broadband to the truly unserved areas, municipal broadband networks have engaged in significant First Amendment mischief. As Professor Enrique Armijo of the Elon University School of Law has shown in his research, municipalities such as Chattanooga, Tennessee, and Wilson, North Carolina, have been notorious for their use of speech codes in the terms of service of state-owned networks, prohibiting users from transmitting content that falls into amorphous categories like \"hateful\" or \"threatening.\" These content-based restrictions, implicating protected categories of speech, would never pass muster under strict scrutiny. In addition to conditioning network use upon waiver of the user's First Amendment rights, these terms are practically impossible to interpret objectively, and are inherently up to the whim of a bureaucrat's discretion. How frightening.The research O'Rielly pointed to is in a couple of white papers published in 2015 by the Free State Foundation, a conservative think tank whose policy positions generally mirror those of broadband industry lobby groups.Like O'Rielly's speech, the Free State Foundation didn't point to any specific incidents of municipal ISPs censoring their users' speech. Instead, the foundation focuses only on the Acceptable Use Policies of municipal networks in Chattanooga and Wilson, the two cities that were at the center of the Obama-era FCC's failed-attempt state laws that restricted the growth of municipal broadband networks.\"The terms of these 'acceptable user policies' are black-letter prior restraints on free speech,\" the Free State Foundation wrote. \"If I send a message across a municipal broadband network that—again, in the sole discretion of the government's network operator—violates one of these overbroad, content-based terms, my message will not be transmitted and my service will be terminated.\"But this theoretical threat is also posed by private ISPs such as Comcast, whose Acceptable Use Policy bars \"posting, storing, transmitting or disseminating information, data or material which is libelous, obscene, unlawful, threatening or defamatory.\"AT&T similarly bars content that \"is determined by AT&T to be obscene, indecent, hateful, malicious, racist, defamatory, fraudulent, libelous, treasonous, excessively violent or promoting the use of violence or otherwise harmful to others.\"As previously noted, O'Rielly's speech objected to municipal broadband networks enforcing Acceptable Use Policies that target \"amorphous categories like 'hateful' or 'threatening.'\" Yet O'Rielly didn't object to Comcast and AT&T enforcing Acceptable Use Policies with those same terms.\"There is no history of municipal networks censoring anyone's speech,\" municipal broadband expert Christopher Mitchell, director of the Institute for Local Self-Reliance's Community Broadband Networks Initiative, told Motherboard. Mitchell said that municipal broadband terms of service generally \"have been similar to or better than those of for-profit ISPs in terms of benefiting subscribers\" and that \"municipal ISPs have listened to public sentiments far more than any large cable or telephone company has.\"Of course, the Obama-era FCC prohibited ISPs—including municipal ISPs—from blocking legal content by enforcing net neutrality rules. O'Rielly and the rest of the FCC's Republican majority eliminated those rules after Donald Trump became president. In fact, FCC Chairman Ajit Pai justified the net neutrality repeal in part by saying the rules were too onerous for municipal ISPs.When the FCC repealed net neutrality rules that applied to both private and government-run networks, O'Rielly expressed no concern that removing the anti-blocking rule would lead to free speech violations.Net neutrality rules were based on \"baseless fearmongering,\" O'Rielly said at the time. People \"have been told that free speech and civil rights are on the line,\" O'Rielly said. \"It simply isn't true—and we know that from experience.\"\"I sincerely doubt that legitimate businesses are willing to subject themselves to a PR nightmare for attempting to engage in blocking, throttling, or improper discrimination,\" O'Rielly also said then. \"It is simply not worth the reputational cost and potential loss of business.\"Cities and towns generally only build their own broadband networks when private ISPs fail to provide modern service at reasonable prices to their residents. That's why Chattanooga started building its fiber network in 2008. Comcast responded by suing the local utility but lost the case and eventually started upgrading its service so it could compete against the municipal option.The FCC's repeal of anti-blocking rules has helped spur further interest in municipal broadband. Fort Collins, Colorado, and San Francisco, California, have both made net neutrality a key part of broadband plans (though San Francisco's project appears to be stalling).As we've previously reported, there's research showing that municipal broadband networks generally offer cheaper entry-level prices than private Internet providers and that the city-run networks also make it easier for customers to find out the real price of service. It's no wonder that private ISPs keep fighting against municipal networks, which have lured customers away by offering better service at lower rates.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}