{"id": "Atoms may come apart as the Universe’s biggest stars explode", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJohn Timmer\n    -  Oct 24, 2018 3:33 pm UTC\nThe building blocks of atoms, protons and neutrons, are composed of a collection of particles called quarks and gluons. Shortly after the Big Bang, however, the Universe was too energetic and dense for the quarks and gluons to form stable interactions. Instead, the Universe was filled with a form of matter called a quark-gluon plasma, where the particles could interact with each other promiscuously.Billions of years later, a bunch of primates figured out how to re-create a quark-gluon plasma by smashing heavy atoms together. It was the first time the material is known to have existed since the Universe's first moments. But a group of astrophysicists is now suggesting that the biggest stars in the Universe also form something like a quark-gluon plasma as they explode, and these researchers use this to explain why we see so many distinct-looking supernovae.Physical models of stellar explosions have done remarkably well at explaining what we see out in the Universe. They have helped us understand the amount of mass needed before a star will explode (as opposed to forming a white dwarf) and can describe the differences among a number of classes of supernovae. But something rather embarrassing happens as we move on to larger stars. For blue supergiants, with dozens of times the Sun's mass, the models stop exploding.(Many of these stars also experience periodic outbursts and explosions that don't destroy them, though we may have figured those out recently.)It's not that nothing happens to the stars. It's just that they go out with a whimper, forming a black hole quickly enough that the shockwave of the star's collapse never gets anywhere. While there is some evidence that this happens, we've also seen some very large stars explode. In fact, we've seen a couple of types of supernovae that are likely to be caused by the death of massive stars. Which tells us that the problem is with our models.The new paper suggests that the problem is how the models handle the instant of a star's destruction, where key events happen within a few fractions of a second as a star's fusion reactions stop producing enough energy to balance out its gravitational pull. At this moment, the star's iron-rich core collapses from the gravitational force, crushing its atoms into an extremely hot, dense state. Hot enough to produce a quark-gluon plasma?It's hard to know for sure. We've generally made the plasma by smashing gold or lead atoms together at immense energies in particle accelerators. During the collision, the boundaries between individual protons and neutrons dissolve for a brief moment before the collision dissipates into the surrounding space, creating a spray of well-defined particles.During a supernova, several solar masses of material may reach densities of over 2.6 × 1014 grams per cubic centimeter (for context, lead is 11 grams/cm3). We're not entirely sure of what happens then, though theoretical work has suggested the pressure creates something called quark matter that's related to the quark-gluon plasma. The exact energies and pressures required for the phase transition aren't clear, and it's possible that a mixture of phases could exist under some circumstances.So, how do you model these conditions when you don't know what they look like? In this case, the researchers have built a more general quark-gluon plasma model and included a phase transition between that and normal matter. On its own, this model could take a wide variety of behaviors, depending on the values chosen for some of its parameters. So, the researchers found ways of rejecting large ranges of parameters. For example, we've not observed neutron stars with much more than two solar masses of material, so any versions of the model that produced those were thrown out. Same thing if the model allowed a speed of sound during the phase transition that was faster than the speed of light.The behavior of the model also had to be consistent with the details of things like heavy ion particle collisions and the behavior of the two neutron stars that LIGO/VIRGO observed colliding.With that in place, the team modeled a star with a composition like the Sun's, but 50 times its mass. As the amount of iron in the core approaches two solar masses, the core begins to collapse and then some of it bounces outward in a shockwave as a neutron star is formed. That shockwave, however, stalls as the neutron star's gravity pulls more of the core inward through it. This is where supernova models normally stop exploding.But in the new model, the core of the neutron star undergoes a phase transition from individual neutrons to a quark-gluon material. The neutron star shrinks suddenly, and this produces a second shock wave that heads out at nearly the speed of light, blowing apart the rest of the star.All of this takes place within a matter of about 10 seconds, astonishingly fast in astronomical terms. And the end result is a neutron star just under two solar masses, with most of that material being an exotic form of matter of unbound quarks and gluons.Better yet, the model can explain multiple types of supernovae. If the star was unstable and blasted off a lot of its outer layers before exploding, then the material ejected by the supernova will slam into it and create an extremely bright event. If the star is largely intact when it explodes, it will create a relatively dim event. And, under the right conditions, matter can collapse onto the neutron star fast enough to overcome both shock waves and collapse it into a black hole (the model produced this with a 25 solar mass star).All of which makes this a viable explanation for how the largest stars explode. But ideally, we like our models to create testable predictions. In this case, the authors do identify one: two distinct bursts of neutrinos, one from the synthesis of new elements as the core collapses and a second from the phase transition to quark matter. While these would only be about a second apart, they'd have a distinct balance of antineutrinos and muon neutrinos. The authors calculate the difference could be apparent in existing detectors.This would, however, require a supernova that's close enough for us to detect a significant neutrino burst. Separately, it's also possible that the study of neutron stars, including the gravitational waves from neutron star mergers, would provide an additional hint of the presence of quark matter. And, as people explore this model in more detail, it's possible that they'll find other signatures of the phase transition to quark matter.Nature Astronomy, 2018. DOI: 10.1038/s41550-018-0583-0  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}