{"id": "SpaceX official says company about to launch a Falcon 9 for the third time", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Oct 24, 2018 10:06 pm UTC\nSpaceX has re-used its Falcon 9 rocket 16 times, but the company has never flown a single first stage more than twice. However, in May of this year the company debuted a newer version of its Falcon 9 rocket, dubbed Block 5, that is specifically optimized for reusability across multiple flights.SpaceX has since flown a handful of Block 5 rockets twice, but it has not taken the step of flying one of these rockets for the third time. However, that may happen quite soon, according to Lars Hoffman, senior director of government sales for the California-based rocket company.\"We've launched Falcon 9 over 60 times,\" Hoffman said at the Wernher von Braun Memorial Symposium on Wednesday afternoon. \"We've landed our first stage booster 30 times now. And relaunched 16 times. We're about to relaunch a booster for the third time. So we're turning this into routine access to space. High-reliability, higher-performance, lower-cost access to space; that opens it up to everybody.\"The company has not officially confirmed its plans, but at present SpaceX intends to reuse a Falcon 9 rocket for the third time to launch a rideshare mission of dozens of small satellites for Spaceflight. This Spaceflight SSO-A mission currently has a launch date of November 19, according to a calendar maintained by Spaceflight Now. An earlier report in The Space Review previously indicated this mission may involve the third flight of a booster.SpaceX put a lot of effort into the Block 5 version of its booster. \"For those that know rockets, this is a ridiculously hard thing,\" Elon Musk said in May, just before the first Block 5 flight. \"It has taken us since, man, since 2002. Sixteen years of extreme effort and many, many iterations and thousands of small but important development changes to get to where we think this is even possible.\" He paused for a second then added, \"Crazy hard.\"Early reviews of the booster have been positive. The first Block 5 variant of the rocket that launched in May flew again in less than three months. The engines and other components have reportedly come back in better-than-anticipated condition, and the company is confident that it will be able to hit its goal of at least 10 flights for each of the Block 5 boosters it builds. Flying a rocket three times within half a year would represent an impressive start toward this goal.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}