{"id": "Mario Segale, namesake for Nintendo’s mascot, dies at 84", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nKyle Orland\n    -  Nov 2, 2018 4:58 pm UTC\nMario Segale, the Seattle real estate and construction business owner who inspired the name for Nintendo's famous mascot, passed away on October 27 according to reports from The Seattle Times and The Auburn Reporter. He was 84 years old.As the story goes, when Segale came to Arakawa to demand payment for a late rent bill, inspiration struck.While the broad strokes of Segale's role in Mario's naming remain consistent, the particulars can change with the retelling. David Sheff's seminal Nintendo history Game Over suggests the executives exclaimed \"Super Mario!\" after Segale's visit in 1981 (though the book misspells his name \"Segali\"). As Benj Edwards notes in an in-depth 2010 exploration of the tale, though, the \"Super\" descriptor for the character wouldn't become common until the release of Super Mario Bros. in 1985. Other retellings over the years go so far as to suggest that the \"Super\" came from Segale's role as \"superintendent\" of the building, but these stories offer little in the way of direct evidence.In any case, as The Seattle Times obituary notes, Segale \"always ducked the notoriety [for being Mario's namesake] and wanted to be known instead for what he accomplished in his life,\" such as building a successful construction business from a single dump truck bought after high school in 1952. A 1993 Seattle Times article quotes him as joking, \"You might say I’m still waiting for my royalty checks,\" seemingly the only on-the-record comment on his ancillary role in Nintendo's history.Segale is survived by his wife Donna, four children, and nine grandchildren.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}