{"id": "Ford’s plan for driverless cars goes beyond technology", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nTimothy B. Lee\n    -  Oct 24, 2018 1:00 pm UTC\nWASHINGTON, D.C.—Waymo says it will launch a fully driverless taxi service later this year. GM's Cruise is aiming to do the same thing in 2019. Ford, by contrast, doesn't plan to launch a commercial service until 2021.You could view this as a sign that Ford is far behind in the race to driverless cars. But in a Monday meeting with Ars Technica, Ford executives argued that they are laying the foundations to make Ford a major player in the autonomous vehicle market over the coming decade.Ford was in Washington, DC—where both Ars car editor Jonathan Gitlin and I live—to announce that the nation's capital has been selected as Ford's second 2021 driverless cars launch city, alongside Miami. Mayor Muriel Bowser welcomed Ford to DC in a Monday press conference along the Potomac River waterfront.Ford's driverless car strategy is centered around Argo, a driverless car startup that got a $1 billion investment from Ford last year (making Ford the majority shareholder). As Argo works on its self-driving technology stack, the parent company is cultivating relationships with partners in business and government—including the government of Washington, DC. That effort is being led by Sherif Marakby, the CEO of a recently created subsidiary called Ford Autonomous Vehicles LLC.\"We're going to develop the business in parallel to developing the technology,\" Sherif Marakby told Ars ahead of Monday's press conference. It certainly makes sense for Ford to be ironing out details like business models, user interfaces, and relationships with policymakers. But what will ultimately matter most is whether Argo can deliver the core technology in a timely fashion.A 2021 launch is likely to put Ford behind Waymo and possibly Cruise, but that timeframe should put Ford on par with other carmakers. And given how long it takes to turn over the global automotive fleet, a 2021 launch could still give Ford plenty of time to claim a major role in the driverless car industry over the next decade.Ford has been involved in driverless car technology for more than a decade. The company fielded a team in the 2005 DARPA grand challenge, and it has ramped up its research and development efforts in the last few years. In 2016, Ford CEO Mark Fields vowed to introduce a fully driverless vehicle by 2021, but the company offered few details about how to reach this milestone.In early 2017, Ford made a billion dollar bet on Argo, putting the startup at the center of Ford's autonomous vehicle strategy. But then Ford suffered from executive turmoil. Fields was fired in May 2017 and replaced by current CEO Jim Hackett. Fields' choice to lead Ford's autonomous vehicle efforts, Raj Nair, lost his job in early 2018.Marakby, the Ford executive we talked to on Monday, left Ford to work on Uber's self-driving car project in 2016. When Hackett took over as CEO in mid-2017, he lured Marakby back to Ford to help lead autonomous vehicle efforts. A reorganization this summer put all of Ford's efforts related to autonomous vehicles under Marakby's leadership in the newly created Autonomous Vehicles, LLC.The result is a coherent structure that looks surprisingly similar to the one GM is using for its own self-driving efforts. Ford is the majority shareholder in Argo just as GM is the majority shareholder in Cruise. Argo and Cruise employees can both hold shares and receive stock options, giving them a financial stake in the company's success and making it easier to compete for the most sought-after talent. Making both Argo and AV LLC distinct companies from Ford also creates the possibility that other companies will want to make their own investments, just as Softbank and Honda recently did when taking big positions in the semi-independent Cruise.\"Ford is obviously not gonna be first to market with the technology,\" says industry analyst Sam Abuelsamid. \"But technology alone is not sufficient. Ultimately you have to build a business around the technology.\"As Waymo has prepared for its launch later this year, the company has been learning that it takes a wide range of partnerships to offer a driverless car service. Waymo has a deal with Avis to manage its vehicles in Arizona, for example. Waymo has a partnership with Walmart to let customers take a Waymo vehicle to pick up groceries. Waymo also has a deal with the region's transit agency to give employees rides to and from local bus and light rail stops. In the long run, this arrangement could be expanded to allow ordinary riders to take a short Waymo ride to the nearest transit stop.Waymo has negotiated most of these deals within the last 18 months, shortly before an expected commercial launch. By contrast, Ford is cultivating these kinds of relationships much earlier in the technology development cycle. More than a year ago, Ford was already doing experiments with Domino's using a \"self-driving car\" (really a human-driven car, but with a driver who stays out of sight) to deliver pizza to real customers. This year Ford has been running a similar experiment with Postmates, delivering products to real customers using a \"self-driving car\" that actually has a safety driver behind the wheel.\"This is our first self-driving research vehicle modified specifically to test a variety of interfaces— the touch screen, the locker system, the external audio system—to inform the design of our purpose-built self-driving vehicle that’s scheduled to arrive in 2021,\" Ford wrote back in June.Ford even sponsored a study by Virginia Tech researchers to see how pedestrians and other road users responded to a self-driving car. Since Ford doesn't yet have a fully self-driving car to use for testing, the researchers built a \"seat suit\" that essentially hides the driver inside the driver's seat. The researchers were experimenting with systems for a driverless car—which obviously can't make eye contact or use hand gestures—to signal its intentions to other drivers on the road.All of this means that, if and when Argo is ready to ship a fully self-driving car, Ford will have a wide range of expertise and supporting infrastructure to make the product successful. It will have buy-in from regulators in Miami, DC, and probably other cities. It will not only have partnerships with retailers like Domino's and Postmates, it will also have experience building user interfaces for these kinds of delivery services. It will have infrastructure in place to maintain, repair, and refuel the vehicles.All of this prep work—as well as Ford's vast manufacturing capacity—will help Ford quickly scale up production once Argo's technology is ready for market. But none of this will matter unless and until Argo develops a fully autonomous vehicle. And there's some reason to think that Argo is still several years away from being ready for a commercial launch.One is the size of Ford's test fleet. Ford told us that it has about 15 vehicles being tested in Miami. And at Monday's press conference, it said that it expected to begin testing in Washington, DC with five to 10 vehicles. Argo is also performing tests in the Pittsburgh and Detroit areas, so we don't know exactly how many vehicles Argo has nationwide. But all signs suggest that the number is in the low double digits. Ford says it's aiming to have 100 cars on the road by the end of 2019.For comparison, Google had two-dozen self-driving Lexus vehicles on public streets in mid-2015. That number has grown steadily over the last several years; Waymo purchased 100 Chrysler Pacifica minivans in 2016, and it bought another 500 in 2017.In an email to Ars, Ford spokesman Alan Hall argued that the number of vehicles in a test fleet is \"not a good measure of progress.\" And that's certainly true up to a point. Especially in the early years of autonomous driving, it's possible to make a lot of progress without having a lot of vehicles on the road.But there are some aspects of a self-driving system that can only be tested effectively by logging millions of miles on public roads. Waymo started that process two to three years ago and is continuing it today. It's hard to see how Argo could bring its cars to market without going through a similar large-scale testing process.Luckily, Ford can take some comfort in the fact that most of Ford's carmaking peers seem to be just as far behind Waymo. Hyundai has a partnership with Aurora, a startup cofounded by former Google self-driving car chief Chris Urmson and former Tesla autopilot chief Sterling Anderson. The two companies are aiming to launch their commercial service in 2021, the same year as Ford.Toyota has consistently been one of the most pessimistic automakers, with one executive saying in 2017 that he expects carmakers to have \"level 4\" vehicles—cars that are fully autonomous in a geofenced area—on the road within a decade.All of which means that if Waymo and Cruise meet their ambitious targets of launching in 2018 and 2019, respectively, they may have the market largely to themselves for a couple of years before facing increased competition in 2021. But that headstart might not actually be that important for Waymo's long-term success.The automotive market is vast, with cars often running for 20 years or more before going to the junkyard. Waymo will need a lot of help from conventional automakers to scale up its technology, so no matter how quickly Waymo expands, it's not going to replace more than a small fraction of the cars on the road between 2018 and 2021. So if Ford does manage to stick to its schedule of launching a large-scale driverless car service in 2021, the company may have plenty of time to claim a significant share of the self-driving vehicle market.Correction: I originally said that Ford has seven or eight vehicles being tested in Miami, but the company says the number is actually about 15.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}