{"id": "Hitman 2’s Denuvo DRM cracked days before the game’s release", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nKyle Orland\n    -  Nov 12, 2018 4:53 pm UTC\nThe early crack, released on November 10, was made possible by publisher Warner Bros.'s decision to make Hitman 2 available on November 9 to those who preordered the game—four days before the official street date of November 13. The quick crack also comes despite Hitman 2's use of a brand-new \"version 5.3\" variant of Denuvo, the latest in a long line of changes intended to thwart the cracking community.Hitman 2's DRM situation mirrors that of Final Fantasy XV's March release on PC. In that case, the preloading of unencrypted game executable via Origin let crackers remove Denuvo protection four days before the game's launch date.The quick cracking of Hitman 2 comes shortly after the Denuvo protection for both Soul Calibur 6 and Football Manager 2019 were publicly cracked four days after their respective releases. Prior to those games, recent versions of Denuvo had generally provided a longer window between release and cracking. Mega Man 11 and Assassin's Creed: Odyssey were both available for over a month before being cracked, for instance, while both Jurassic World Evolution and Puyo Puyo Tetris enjoyed three months of Denuvo-protected sales after their releases earlier this year.The Hitman 2 cracking comes months after the July criminal complaint against Voksi, a Bulgarian cracker responsible for breaking Denuvo protections in many titles. Since then, the Denuvo cracking scene has been joined by a new group called FCKDRM, which seems to take its name and logo from that of GOG's recent anti-DRM public relations campaign.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}