{"id": "The mid-range Google Pixel appears in pictures—complete with headphone jack", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nRon Amadeo\n    -  Nov 16, 2018 8:00 pm UTC\nRumors of a cheaper mid-range smartphone from Google have been circulating for some time, but now it's looking like the first pictures of this mythical device have popped up online. The Russian site Rozetked—which leaked the Pixel 3 XL earlier this year—has pictures of a device codenamed \"Sargo,\" which looks like a cheaper version of the Pixel 3.The phone resembles a smaller Pixel 3, but there appear to be a lot of changes to bring the price down. The body is now plastic instead of glass. The 5.5-inch OLED display has been swapped out for an LCD with a 2220×1080 resolution. Instead of the top-of-the-line Snapdragon 845, this device reportedly has a more modest Snapdragon 670. The baseline 64GB of storage has been downgraded to 32GB. It also looks like the bottom front-facing speaker has been cut, replaced by a bottom-firing speaker. It's unknown if the earpiece still functions as a second speaker for stereo sound.As far as price cutting measures go, that seems like it. There's reportedly still 4GB of RAM (which seems much more at home in a budget device), a 2915mAh battery, a rear fingerprint reader, and a USB-C port. Most importantly, Rozetked says the Pixel 3's world-class camera has not been downgraded and \"[it's] the same as the regular Pixel 3 and is not inferior in quality.\"This isn't the first time we've heard the codename \"Sargo\" from Google. References to the device popped up in Google's ARCore framework earlier this month, along with another device codenamed \"Bonito,\" which was the first \"mid-range Pixel\" codename rumored all the way back in June. Does this mean we're getting two mid-range Pixels? A Pixel 3 Lite and a Pixel 3 XL Lite?Since Google's transition from the cheaper Nexus line to the much more expensive Pixel line, people have clamored for Google to return to building cheaper devices. The company's Android performance optimizations, light software package, and AI camera tricks would be a great match in that price range. But today, Google's cheapest phone is the Pixel 2, which, at $649, gives Google the most expensive phone lineup on the market. Even Apple—which is styled as a premium electronics manufacturer—sells the iPhone 7 for $449. Google has a long way to go toward being a serious hardware competitor, and producing phones at a range of price points would open the company up to much more of the market.Listing image by RozetkedYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}