{"id": "Ars on your lunch break: Transforming citizens into scientists with satellites", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nRob Reid\n        -  Nov 2, 2018 3:50 pm UTC\nToday we present the third and final installment of my interview with Sarah Parcak, a prominent founding figure in the emerging field of astroarchaeology. Please check out parts one and two if you missed them. Otherwise, press play on the embedded player or pull up the transcript—both of which are below.We open today’s installment talking about the presentation Sarah made while accepting the TED prize—which came with a million-dollar check to advance her work. Sarah presented in full Indiana Jones regalia, and Harrison Ford turned out to be in the audience, and a rather fun story emerges from that. On a (slightly) related note, Sarah and I also discuss an amazing VR rig the people from The VOID set up at TED that year (fittingly, with a Temple of Doom theme).Most of today’s installment concerns a crowd-enabled detection project Sarah created with proceeds from the TED Prize. It’s called GlobalXplorer. Partly inspired by Galaxy Zoo, it let armies of “citizen scientists” scan twelve million quadrants of Peruvian satellite imagery for hints of archaeological remains. Tens of thousands of promising features were discovered. This will help the Peruvian archaeology community set its agenda over the coming decade. Sarah’s longer-term goal is to rally enough volunteers to scan the entire globe over the coming decade.If you enjoyed my conversation with Sarah, please consider browsing the full archive of the After On podcast on my site. Alternatively, you can find it in your favorite podcast app simply by searching for the words “After On.” I’ve posted deep-dive interviews with dozens of world-class thinkers, founders, and scientists—tackling subjects like cryptocurrency, astrophysics, drones, genomics, synthetic biology, neuroscience, consciousness, privacy & government hacking, and a more.Finally, I’d like to briefly mention a series of four articles that I’m posting to Medium this month on the uplifting topic of existential risks. Which is to say, the grim, yet perversely fascinating possibility that our technological creations might just annihilate us. I believe I present some arguments and analytic lenses that are new to this important topic, and the first piece in the series is right here. I should note that Medium is running this in their editorially curated, paid, members-only section. The goods news is, they give everyone access to a few articles per month with essentially zero friction (and here it is, only the second of the month!).This special edition of the Ars Technicast podcast can be accessed in the following places:iTunes:\nhttps://itunes.apple.com/us/podcast/the-ars-technicast/id522504024?mt=2 (Might take several hours after publication to appear.)RSS:\nhttp://arstechnica.libsyn.com/rssStitcher\nhttp://www.stitcher.com/podcast/ars-technicast/the-ars-technicastLibsyn:\nhttp://directory.libsyn.com/shows/view/id/arstechnicaYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}