{"id": "Database leak exposes millions of two-factor codes and reset links sent by SMS", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nDan Goodin\n    -  Nov 16, 2018 9:03 pm UTC\nMillions of SMS text messages—many containing one-time passcodes, password reset links, and plaintext passwords—were exposed in an Internet-accessible database that could be read or monitored by anyone who knew where to look, TechCrunch has reported.The discovery comes after years of rebukes from security practitioners that text messages are a woefully unsuitable medium for transmitting two-factor authentication (2FA) data. Despite those rebukes, SMS-based 2FA continues to be offered by banks such as Bank of America, cellular carriers such as T-Mobile, and a host of other businesses.The leaky database belonged to Voxox, a service that claims to process billions of calls and text messages monthly. TechCrunch said that Berlin-based researcher Sébastien Kaul used the Shodan search engine for publicly available devices and databases to find the messages. The database stored texts that were sent through a gateway Voxox provided to businesses that wanted an automated way to send data for password resets and other types of account management by SMS. The database provided a portal that showed two-factor codes and resent links being sent in near real-time, making it potentially possible for attackers who accessed the server to obtain data that would help them hijack other people’s accounts.TechCrunch counted more than 26 million messages sent since the beginning of the year, but based on the volume of messages the publication saw passing through the platform per minute, the actual number may be higher. The database ran on Amazon’s Elasticsearch and was configured with a Kibana front-end to make the phone numbers, names, and other contents easy to browse and search. As TechCrunch reported:Voxox locked down the database after TechCrunch privately reported it prior to publication. Voxox didn’t respond to a request by Ars for comment.While the exposure raises serious questions about Voxox’s security practices, it also reflects poorly on the countless companies that continue to use SMS to transmit data for 2FA and account resets. Weaknesses in Signaling System No. 7, a telephony signaling language that telecommunications companies around the world use to ensure their networks interoperate, has already been abused by thieves to steal 2FA codes German banks sent to customers.Crooks can also take over targets’ cellular numbers by masquerading as the rightful owners. Bank of America and T-Mobile didn’t provide comment for this post explaining why they continue to rely on SMS for account verification. And in fairness, they are by no means alone in making 2FA a medium for providing enhanced account security.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}