{"id": "Microsoft posts a record $29.1 billion Q1. Same old, same old", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nPeter Bright\n    -  Oct 24, 2018 11:57 pm UTC\nMicrosoft has posted the results of the first quarter of its 2019 financial year, which runs up until September 30, 2018. Revenue was $29.1 billion, up 19 percent year on year, to set a new record for the company's first quarter. Operating income rose 29 percent to $10.0 billion, and net income was up 34 percent to $8.8 billion. Earnings per share were up 36 percent at $1.14.Microsoft currently has three reporting segments: Productivity and Business Processes (covering Office, Exchange, SharePoint, Skype, Dynamics, and LinkedIn), Intelligent Cloud (including Azure, Windows Server, SQL Server, Visual Studio, and Enterprise Services), and More Personal Computing (covering Windows, hardware, and Xbox, as well as search and advertising).Productivity group revenue was up 19 percent to $9.8 billion, with operating income up 29 percent to $3.9 billion. Both commercial and consumer Office sales were up by 17 and 16 percent respectively, and Office 365 continues to grow; commercial seats were up 29 percent year on year, and it now has more than 155 million monthly active users. There are also now 32.5 million consumer subscribers. This ongoing switch to the cloud meant that perpetually licensed Office revenue was down 12 percent. Dynamics revenue is up 20 percent, and LinkedIn revenue has grown 33 percent.Intelligent Cloud revenue is up 24 percent to $8.6 billion, with operating income up 37 percent to $3.0 billion. Azure revenue was up 76 percent year-on-year, Server product revenue was up 10 percent, and Enterprise Services revenue grew by 6 percent. Enterprise Mobility Suite now has 88 million seats, up 59 percent year on year, and 6 million seats sequentially.Over in More Personal Computing, revenue was up 15 percent to $10.8 billion, with operating income up 23 percent to $3.1 billion. We continue to see the split between corporate PC sales, which are growing, and home PC sales, which are not. Windows Pro revenue was up 8 percent, in contrast to non-Pro revenue dropping by 5 percent. Windows cloud services grew by 12 percent compared to one year ago.Surface revenue was up 14 percent to $1.2 billion in a quarter that saw the launch of a new device, the Surface Go. Gaming looks strong, with revenue growing 44 percent to $2.8 billion, and a total of 57 million active Xbox Live users. Xbox hardware revenue nearly doubled, up by 94 percent. This is a product of having the Xbox One X on the market and the relatively weak hardware sales a year ago. Search revenue grew 17 percent.The numbers grow a bit bigger, but the story remains familiar: cloud services are growing, on-premises Office customers are adopting Office 365, and the corporate PC refresh cycle is bolstering some Windows revenue, partially offset by the continuing decline of the consumer PC market. Surface should start to reach new markets with the availability of the Surface Go, but thus far the revenue impact appears limited, leaving Microsoft's hardware division in this weird position: it's humming along steadily but still stuck at around that $1.1 billion-per-quarter mark, not shifting even when Microsoft adds new systems and price points to the mix.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}