{"id": "Tesla quietly drops “full self-driving” option as it adds $45,000 Model 3", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJonathan M. Gitlin\n    -  Oct 19, 2018 1:52 pm UTC\nThe mid-range Model 3s will be rear-wheel drive only, prompting some to wonder if the company was using software to limit battery capacity on existing RWD inventory in order to get it out of the door. But Tesla says it's able to build these slightly cheaper cars by using the same battery pack as the more expensive, longer-range cars but with fewer cells inside (so no future software upgrades can increase their range at a later date).However, Tesla is promoting the car as costing as little as $30,700 by factoring in \"gas savings\" and all possible federal and local electric vehicle tax incentives (but not the destination charge). That it did so is a little surprising; just seven days ago Tesla said that it could not guarantee any order received after October 15th would ship before the beginning of next year. Any new Tesla delivered after January 1st 2019 (but before July 1st 2019) is only eligible for a $3,750 IRS credit. Tesla says delivery for the new mid-range Model 3 should take six to 10 weeks.Potential customers in countries other than the US and Canada will also have to continue to wait. We asked Tesla why it's adding a new configuration of Model 3 instead of selling higher-margin all-wheel drive models in other markets, but we did not receive a reply. As for when European homologation might happen, your guess is as good as ours.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}