{"id": "Floating solar is more than panels on a platform—it’s hydroelectric’s symbiont", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nMegan Geuss\n    -  Nov 3, 2018 1:00 pm UTC\nA total of 1.1 gigawatts (GW) of solar have been installed around the world as of September, according to a new report by the World Bank (PDF). That's similar to the amount of traditional solar panel capacity that had been installed around the world in the year 2000, the report says. The World Bank expects that, like traditional solar 18 years ago, we're likely to see an explosion of floating solar over the next two decades.That's because floating solar is not simply \"solar panels on water.\" Solar panels prevent algae growth in dammed areas, and they inhibit evaporation from occurring in hotter climates. (According to Yale's School of Forestry and Environmental Studies, major lakes in the southwestern US like Lake Mead and Lake Powell can lose more than 800,000 acre-feet of water to evaporation per year, and the adorably-described \"floatovoltaics\" could prevent up to 90 percent of that evaporation.\") Additionally, floating solar avoids taking up space on land that is priced at a premium. In Northern California, for example, a floating solar installation was added to a nearby reservoir because the land around it was better used for growing grapes.Another benefit of floating solar is that ground doesn't have to be leveled before the plant is installed. Usually, fixed-tilt panels are attached to a floating platform that's moored to the bottom of the reservoir. Most systems send electricity through floating inverters, although in some smaller installations the inverters are situated on land.The downside is, of course, cost. Floating platforms and water-resistant wiring are more expensive for water-dwelling panels than for their land-based counterparts. As solar PV panel prices have been falling, however, the extra cost to make a floating system might save it from being considered too expensive.The World Bank contends that the real value of floating solar is going to become obvious as more and more panels are paired with hydroelectric systems.Floating solar and hydroelectric dams actually work in a pretty nice symbiosis. In some areas, hydroelectric dams produce energy in an extremely predictable manner. In these cases, the electricity can be used to augment the more variable solar energy coming from the panels. In other cases, hydroelectric energy wanes in times of drought, and solar energy can be used to augment hydroelectric power when water levels are low. \"Floating solar may therefore be of particular interest where grids are weak, such as in Sub-Saharan Africa and parts of developing Asia,\" the World Bank writes.The world's first combined hydro and floating photovoltaic plant was installed in Portugal between 2016 and 2017 at the Alto Rabagao Dam. According to EDP (the company that installed the panels), the system has an installed capacity of 220 kilowatts at peak (kWp) and produces 300 MWh per year. The system has been able to withstand a swell of 1 meter in harsh weather, the company wrote in December 2017.\"There is still some way to go before the costs of this solution are in line with conventional on-land options,\" EDP added. \"However, optimized solutions are already being studied and this cost difference should be reduced in the not too distant future.\"The World Bank notes that one of the earliest hydroelectric and solar pairings exists at the Longyangxia hydropower plant in Qinghai, China. Here, however, solar installations were built out in 2013 and 2015, so the panels are sited on land. But the hydro/solar combination still offers insight into how floating solar could work in other areas. \"The hybrid system is operated so that the energy generation of the hydro and PV components complement each other,\" the World Bank writes. When the solar panels are producing enough energy, Longyangxia's hydroelectric plant cuts back the amount of water that goes through the turbines, which results in more water behind the dam for operation during late nights and early mornings.The market for floating photovoltaics has been growing. Until this year, no floating solar systems had more than a 100 megawatt peak capacity, but as of 2018, several 100 MW floating solar systems have been connected to the grid, the largest being a 150 MW floating plant. \"Flooded mining sites in China support most of the largest installations,\" the World Bank writes.As costs come down, we might see more floating solar. At least, we have the space to physically add a lot more, according to the World Bank. The organization wrote that \"the most conservative estimate\" of surface area available to floating solar \"exceeds 400 GWp, which is equal to the 2017 cumulative installed PV capacity globally.\"You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}