{"id": "Attenborough’s calming narration comes to Netflix in 2019 doc Our Planet", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSam Machkovech\n    -  Nov 12, 2018 3:37 pm UTC\nTwo of the main people behind the BBC's modern wave of nature documentary series, including their iconic narrator, have signed on to make their next documentary project with Netflix.The soothing, British-accented tones of narrator Sir David Attenborough, along with Blue Planet and Planet Earth creator, director, and executive producer Alastair Fothergill, are the headline names for a new project, dubbed Our Planet. Netflix says this eight-part \"natural history\" documentary series will debut exclusively on its service on April 5, 2019.Netflix says the series has been in production for roughly four years, which means its gestation period may have overlapped with 2016's Planet Earth II, on which Fothergill was not credited. His last BBC production credit came with the four-part 2015 miniseries The Hunt. No plans have been announced about standalone Blu-ray versions of this series (and disc versions have driven the BBC duo's past titanic successes), but Netflix does have precedent in eventually releasing some of its streaming-only content to disc media at a later date.The last time we saw Attenborough was at this year's South by Southwest Film Festival, where the consummate narrator played host in a striking virtual reality museum, dubbed Hold the World. That app finally saw a formal launch last week, and at only $4, it's a no-brainer buy for anyone who owns an Oculus Rift (or, via the slightly awkward Revive workaround, an HTC Vive).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}