{"id": "Apple updates MacBook Air with Retina display, Touch ID", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nValentina Palladino\n    -  Oct 30, 2018 2:11 pm UTC\nNEW YORK—The wait is over: Apple on Tuesday unveiled a revamped MacBook Air at an event in Brooklyn, New York.The device is available for pre-order today and will begin shipping on November 7. It will start at $1,199, which is a jump from the $999 starting price of the older MacBook Air.The updated notebook is still called the MacBook Air and still features a 13.3-inch display, but the borders surrounding that screen are dramatically smaller—50-percent narrower, according to Apple—and the aluminum bezels that adorned the last MacBook Air are gone. Apple says the display now has a 2560×1600 resolution and 48-percent more color than the prior model. That Retina display should be a massive leap from the 1440×900 display of the past MacBook Air, which was simply outdated for a $1,000 laptop in 2018.There's no Touch Bar on the new MacBook Air, but there is Touch ID functionality for signing in to the laptop more quickly. It also uses Apple's T2 security chip, a three-mic array, and side-mounted speakers that Apple says are 25-percent louder than those of the prior model. There's a 720p front-facing camera above the display, too. The notebook uses 802.11ac Wi-Fi and Bluetooth 4.2.Apple says the device will run on an 8th-generation dual-core Intel Core i5 chip and support up to 16GB of RAM. The device is configurable with up to 1.5TB of SSD storage, too. The entry-level model will come with a 1.6GHz Core i5 chip with Intel UHD Graphics 617, 8GB of DDR3 RAM, and a 128GB SSD. While those specs are fairly standard for a new laptop today, they should result in much improved performance compared to the old MacBook Air, which has languished with an ancient 5th-generation Core i5 chip from 2015.That said, the processors in newer MacBook Pros have higher clock speeds, and some of the specifics surrounding the lone processor option here aren't fully clear: as Anandtech notes, Apple's description suggests it's using one of Intel's 5W Y-series chips, which are more power-efficient than the more common U-series chips but not as strong in performance. If so, the upside would be battery life, and to that end the company says the device will get 12 hours of battery life for workloads like Web browsing. The notebook comes with a 30W USB-C power adapter.There are two Thunderbolt 3 USB-C ports and a 3.5mm headphone jack on the notebook's sides, but that's it, so those needing USB-A, DisplayPort, or an SD card slot will have to buy an adapter of some sort. The device can hook up to an eGPU external graphics enclosure and power a 5K external display, according to Apple.The revamp does mean Apple is fully doing away with the traditional chiclet keyboard that came with the previous MacBook Air. Instead, the new model uses the latest-generation edition of Apple's ultra-thin butterfly keyboard, which is available on the company's latest MacBook Pro models and shouldn't suffer from the reliability issues of earlier iterations. Each key is individually backlit. Similarly, the notebook will use the thinner force touch trackpad of newer MacBooks; Apple says that it will have 20-percent more surface area than the classic MacBook Air.The new MacBook Air weighs 2.75 pounds and has a thickness of just 15.6mm. That's a quarter-pound lighter and 10-percent thinner than the previous Air model, according to Apple. Notably, the company says each new MacBook Air's enclosure will be made from 100-percent recycled aluminum and that it has significantly increased the use of recycled plastic in the device. The notebook will be available in silver, space gray, and gold finishes.The higher price, thinner keyboard, and exclusive use of USB-C may disappoint those who simply wanted Apple to add a Retina display and updated specs to the classic MacBook Air's design, but the update won't come as much of a surprise given the changes the company has made to its other laptop models in recent years. The bumped starting price may pose some risk when it comes to selling the device to schools, students, and other cash-strapped buyers, but Apple seems intent on moving those users to its iPad Pro lineup. It's also worth noting that Apple is still selling the old MacBook Air on its website in the wake of its event on Tuesday.In any event, the new MacBook Air essentially appears to be an entry-level version of the latest MacBook Pros. We'll be sure to get our hands on the notebook in the near future and figure out whether that makes it worth buying.Listing image by AppleYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}