{"id": "Windows 10 October 2018 Update still not released, running out of October", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nPeter Bright\n    -  Oct 30, 2018 6:49 pm UTC\nMicrosoft is making yet more fixes to Windows 10 build 17763, the build that has been blessed as the Windows 10 October 2018 Update.The update was initially published on the first Tuesday of the month, but within a few days, Microsoft had to pull the update due to a bug that could cause data loss. It turned out that the bug had been reported numerous times during the preview period, but for whatever reason, Microsoft had overlooked or ignored the feedback items describing the problem.Microsoft fixed that bug and sent the fixed build to Windows Insiders to test. The fixes published today include a fix for another widely reported (but apparently ignored) bug affecting users when dragging files from .ZIP archives in Explorer. If a file within the archive has the same name as a file in the destination directory, Explorer is supposed to show a prompt to ask whether to overwrite the existing file or rename the new one. For some reason, Windows build 17763 was not asking the question. Instead, it was skipping the extraction of the file with the conflicting name.The company pushed these patches out to the Insider Slow and Release Preview rings. With today being the penultimate day of October, it looks unlikely that the October 2018 update will actually ship in October 2018—a rather unfortunate state of affairs for a software release that was thought to be finalized in mid-September.We continue to believe that these problems indicate that the Windows development process is flawed. Inadequate testing (both automated and manual), combined with a general attitude of \"add the new code now, we'll fix the bugs later,\" means that with each new feature update, code quality takes a hit. Months can go by before the code gets back up to where it should be, with Windows users being caught in the resulting quagmire.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}