{"id": "More exclusive than a supercar: A beginner’s guide to buying a GT3 race car", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Tegler\n        -  Oct 19, 2018 4:53 pm UTC\nIn the past decade, the well-worn automotive cliché Race on Sunday, sell on Monday has taken a surprising twist. Now, automakers have realized that they can race on Sunday and sell race cars on Monday. If you've got the money, Porsche, Lamborghini, Audi, Acura, Ferrari, Mercedes, McLaren, Nissan, Bentley, and more have a race car for you—for around $500,000.The rise in popularity of supercars worldwide has been paralleled by explosive growth in international GT3 class sportscar racing. GT3 cars are racing versions of the road-going supercars/GT cars that star in video games, YouTube channels, and print platforms. Instead of being built to a specific set of technical rules, in GT3 each make of car is benchmarked and then \"performance balanced\" by the FIA (the sporting organization that governs world motorsport) to create a relatively level playing field.While the exact number is difficult to pinpoint, the manufacturers mentioned have sold approximately 500 GT3 race cars worldwide since 2013. That's more than $250 million dollars' worth of business, not counting spare parts. [And if there's one thing race cars need, it's a lot of spare parts—Ed.] Like their street car counterparts, new models of GT3 race cars are released every three years or so, roughly in line with the international FIA GT3 rules-cycle.Audi Sport Customer Racing, which sells the GT3 version of Audi's R8 sports car, has sold more than 200 copies of its R8 LMS GT3 globally. Audi Sport North America manager Tristan Herbert confirms that, while the company's racing arm was established within the company's experiential marketing division, its business success spurred moving it to the product division.Acura is one of the more recent entrants into the GT3 scene, launching its NSX GT3 (derived from its NSX supercar) in 2016. Though it has sold comparatively few race cars thus far, Acura NSX GT3 program Chief Engineer Lee Niffenegger says that selling the NSX GT3 is a business. \"That's absolutely the way we look at it.\"We looked at GT3 using the 2018 race season as a baseline for comparing cost and other specifics, speaking with five of the OEMs selling GT3s: Acura, Audi, Lamborghini, Mercedes, and Porsche.If you bought one of those cars this year, here's the sticker price you would have paid. Bear in mind these prices don't include spare parts, which you'll certainly need:The buying process is roughly similar across GT3 manufacturers, requiring money up front, technical familiarization, and unless you just want a pretty track toy, a race team. Take Mercedes' AMG GT3 for example. The race cars are sold by the automaker's AMG division in Affalterbach, Germany. You simply email the AMG Customer Management Team, who will then call you back to discuss the car configuration you want/need (sprint or endurance racing). Next, they'll ask for a pre-production down-payment of $115,000 (€100,000). The balance is due before delivery.As your GT3 is being built, AMG will invite your team/engineers/mechanics to Affalterbach for technical training (plan on travel/lodging bills) and determining your initial spare parts order. The AMG GT3 is officially delivered at Affalterbach, but Mercedes will support shipping it to your home country. They even send a support engineer to help you fire up the car the first time and do checks and basic set-up, gratis.You'll end up with a shockingly fast modern race car with copious aerodynamic downforce. As mentioned, GT3-spec cars are performance balanced, generally having around 550 horsepower. They generate about 1.6G of lateral grip and will do 0-60mph in less than three seconds on their way to 185-200mph (300-320km/h).For instance, the NSX GT3's turbo V6 is good for about 7,456 racing miles (12,000km) before a major refresh. That's a bit over a season's worth of racing. Acura's Lee Niffennegger adds that \"it's not junk once you hit that number,\" either. The 2019 NSX GT3 will be rated for 9,320 miles (15,000km).Contrast that with Audi's R8 LMS. Its V10 should go about 12,427 miles (20,000km) before a full refresh is needed. The AMG GT3's V8 can run 12,739 miles (20,500km) before it needs major refurbishment. Porsche expresses its 4.0L flat-six engine life in hours. It'll race for 60 hours, which roughly translates to 7,456 miles (12,000km).GT3 cars run six-speed sequential transmissions from suppliers like Xtrac and ZF. They, too, have life cycles. Mercedes, for instance, recommends transmission service at 6,200 miles (10,000km). But these can be done by teams themselves. Transmissions are typically serviced after every race, Niffenegger says.Acura's GT3 NSX customer technical manual (i.e. owner's manual) has a table specifying component life cycles for everything from suspension items (approximately 6,200mi/10,000km) to the chassis (about 18,650mi/30,000km).Unfortunately, repairs all add up cost-wise, and you can't forget spares. If you're racing, you're going to break/wear out stuff after all. Most GT3 manufacturers offer level 1 and 2 spares packages for their cars. Level 1 is very basic setup equipment, but level 2—everything from body panels and spindles to alternators and skid blocks—is what you'll want to buy with your new race car. Acura's level 2 NSX GT3 spares package is $123,000. Porsche's 911 GT3 R package is $100,000.There are no warranties. This is racing after all. Sooner or later you'll likely have a crash.Acura/Honda provides \"crash kits\" (front/rear components) for general damage and jigs for trackside repairs. Damage the NSX GT's chassis and it'll have to be repaired at Honda's Performance Manufacturing Center in Ohio. Expect a $15,000 to $30,000 dollar bill. Audi fixes chassis at the Audi Collision Center in Ashburn, Virginia. Teams can do most repairs themselves, however, and AMG Customer Racing and Porsche Motorsport North America have parts trucks at most professional races over here.As with any new car, you also get depreciation. Most OEMs, like Lamborghini and Mercedes, say depreciation depends on the individual car, its usage, and race history. Acura's GT3 program chief engineer offers a useful rule of thumb: given three-year rules cycles, GT3 cars depreciate considerably after new rules come into effect. Before then, most race teams figure on approximately one-third depreciation (roughly $167,000) per year. You can pick up a five-year-old car on the Internet relatively cheaply, Niffenegger confides.Clearly, what you get with a GT3 race car is the opportunity to spend a lot of money. On the other hand, you can have a hell of a lot of fun and—potentially—be a hero. That's probably worth a few bucks.Listing image by AudiYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}