{"id": "Can cities ban e-scooters in the name of public safety? Bird says no way", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Nov 4, 2018 3:00 pm UTC\nThe lawsuit, Bird Rides v. City of Beverly Hills, was filed Thursday in Los Angeles County Superior Court. The civil complaint argues that the city’s July 24, 2018, city council meeting—where the ban was quickly approved—was a “hasty and deceptive proceeding.”Worse still, the company alleges, city police have “embarked on a campaign of indiscriminate seizure, snatching up Bird’s property anywhere officers spot a scooter.” Bird claims that it has received over 950 citations and demands to pay over $100,000 in fines. The company also says that the city hasn’t provided proper documentation and justification for those seizures.The case was first reported Thursday by the Los Angeles Times.In the wake of the July 24 meeting, Beverly Hills issued a press release in which it described a “concern for public safety and a lack of any advanced planning and outreach by the motorized scooter companies as the primary reasons for the new ordinance.”Cities across the country have been trying to deal with the sudden influx of the dockless devices, which have proliferated with incredible speed.On Thursday, roughly 400 miles to the north of Beverly Hills, the Oakland city council passed a new “fee schedule” which will dictate how much scooter companies have to pay to operate in the city. The city council is expected to vote on a final measure in the coming weeks.Bird, which was founded in nearby Santa Monica just last year, has since expanded to numerous metropolises across the Golden State as well as cities in Oregon, Arizona, Utah, Colorado, Missouri, and more. Similarly, its primary competitor, Lime, also exists in many localities nationwide, including New York, Wisconsin, and Louisiana, among others. Scooters arrived in Boise, Idaho, just two weeks ago.The two companies operate on essentially the same business model: download the app, pay $1 to start a scooter rental, and then pay $0.15 - $0.20 per minute after that.Companies make users swear that they will abide by numerous policies, such as being over 18, wearing helmets, only riding in bike lanes, and not blocking public pathways. But such rules are routinely flouted.Months after scooters arrived in Beverly Hills, the city council seems to have moved quickly, when it declared the scooters as being “unregulated” and “frequently abandoned.”The lawsuit counters that Bird scooters are, in fact, regulated, because riders must abide by the California Vehicle Code. The lawsuit also states that there was not adequate notice given about the proposed ban as required under a state transparency law known as the Brown Act.Last month, a Santa Monica personal injury attorney brought a proposed class-action lawsuit on behalf of people who claim that they were injured by errant riders.Meanwhile, on Friday, Santa Monica officials began installation of dockless e-scooter and bike zones on city streets as a way to corral them properly.Redesigning our @santamonicacity streets for a multi-modal future.\nFirst in-street drop zone for e-scooters & e-bikes. pic.twitter.com/bjRI0qOsBS— Rick Cole (@SaMoCole) November 2, 2018You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}