{"id": "Behind-the-scenes audio from Apollo 11 mission made public for first time", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Nov 12, 2018 6:00 pm UTC\nWhen Neil Armstrong took his legendary first steps on the Moon on July 20, 1969, it defined a generation. As NASA prepares to mark the 50th anniversary of the Apollo 11 Moon landing next year, it has released newly unearthed backchannel conversations from the mission to the public, giving us an unprecedented peek at what was happening behind the scenes.The main air-to-ground recordings and on-board recordings from the historic mission have been publicly available online for decades. But that was just a fraction of the recorded communications for the mission. Thousands of hours of supplementary conversations (\"backroom loops\") between flight controllers and other support teams languished in storage at the National Archives and Records Administration building in Maryland—until now.Thanks to a year-long project to locate, digitize, and process all that extra audio (completed in July), diehard space fans can now access a fresh treasure trove of minutiae from the Apollo 11 mission. And those records are now preserved for future generations.“I think that Apollo 11 is one of the biggest engineering accomplishments in human history,” Greg Wiseman, an audio engineer at NASA Johnson Space Center in Houston involved in the project, told Inside Science News Service. “Landing on the Moon wasn't just Neil Armstrong. It was an entire team of people working together to make it happen, and all of this audio is their side of the story.”Wiseman set out to find the missing audio records after being contacted by John Hansen of the University of Texas at Dallas for a speech technology research project Hansen was developing. The NASA backchannel communications perfectly suited his needs. But according to Wiseman, locating a few boxes of tapes in the archives was akin to that scene in Raiders of the Lost Ark, when the ark of the covenant is stored in a vast government warehouse, indistinguishable from thousands of other generic wooden crates.But find them he did. And that posed a fresh challenge, since the tapes were analog and could only be played on a device called a SoundScriber that used old vacuum tube technology. There were only two such machines at NASA, and neither worked. Fortunately, Wiseman and UT-Dallas scientist Abhijeet Sangwan were able to take parts from one to make the other operational, with the help of a retired NASA technician.Then some poor undergraduate drew the short straw and spent five days a week over several months running through all the tapes to digitize them. (The tapes also included audio from Apollos 1 and 13 and Gemini 8, but those are not yet cleared for public release.) The result: 19,000 hours of newly digitized audio data, ready for Hansen's speech recognition analysis, which included identifying more than 600 different voices on the tapes.Hansen's research is focused on developing better speech recognition technology to analyze taped discussions of groups trying to solve problems. The knowledge gleaned could be useful for future Mars missions or any large team reliant on real-time audio communication, like the military or emergency response teams.But the true value, from a human perspective, is how the project captured and preserved the perspective of all the unsung heroes of the Apollo missions—not just the astronauts who were front and center in the public eye. Hansen's students set up the Explore Apollo website highlighting some key moments from the tapes for the idly curious who might be less inclined to wade through the entire archive. And NASA has uploaded the full audio to the publicly accessible archive.org, an invaluable resource for historians, filmmakers, and any others keen to savor the full Apollo 11 experience.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}