{"id": "Plastic found in the poop of eight people from eight different countries", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCathleen O'Grady\n    -  Oct 24, 2018 4:22 pm UTC\nThere’s plastic in your poop. Or at least, there’s microplastic in some people’s poop. A presentation at a gastroenterology conference in Vienna this week reported the preliminary results of a pilot study looking at fecal samples, finding nine different kinds of microplastics in the samples they analyzed. The news has attracted a lot of media attention, but the study is so small that it’s worth viewing it cautiously instead of drawing solid conclusions from it.Concern about plastic in the human food supply has been a hot topic for some time, with tiny particles from broken-down plastics being found in food, drinks, and even the air. If we’re taking plastic in on one end, and we can't digest it, it’s expected and logical that we’d see it on the other end, too. But expectation isn’t the same thing as actual evidence, and this study is the first to present evidence of those microplastics in the human gut.Gastroenterologist Philipp Schwabl and his colleagues asked their participants to keep a food diary for a week before packaging up their poop in a plastic-free sample kit and shipping it to Vienna. Then, those samples were cleared of all the stuff that’s expected to be there, like proteins and undigested plant matter, leaving the remainder to be tested for 10 different kinds of microplastic.The researchers found plastic in all eight of the samples—around 20 particles per 10 grams of poop. Those particles varied in size: the biggest were around half a millimeter, and the smallest were around a tenth as big as that, around the size of a speck of dust. The most common type was polypropylene, the plastic found in bottle caps, followed by polyethylene terephthalate (PET), the plastic found in the bottles themselves. Both of these types of plastic showed up in all eight samples. Another seven kinds of plastic, ranging from the types used in utensils and shopping bags to those used in automotive parts and electronics, showed up at much lower frequencies across some of the eight people’s poop.The research is far from complete. While conference presentations are generally reviewed before being accepted, it’s not the same depth of scrutiny that a scientific paper gets before being published in a journal. This means that there are important details that aren't yet available, like how the researchers tried to control for contamination throughout the process. The pilot study will have allowed the researchers to figure out the best methods for a much larger study that should be able to test far more people, but it’s not much data to go on by itself.One of the biggest open questions is how, precisely, the plastic got there. Plastic in food comes from two possible sources—the food itself and its packaging. But it’s also possible that at least some of it could have come from plastic dust fibers in the air. That highlights how difficult it is to avoid plastic contamination, making it difficult to say for sure that all the plastic they found in the poop was there because of what the people were eating, rather than some of it landing there while the subjects were packaging up their poop to mail it off.Another big question is what this means for human health. Plastic particles have been found to be absorbed from the gut into other organ systems in fish and mammals; in birds and fish, plastics in the gut have caused liver stress and problems with nutrient absorption. The chemicals carried by the plastics could also be a concern. But we’re just starting to explore this in humans, which Schwabl emphasized in a public statement: “Now that we have first evidence for microplastics inside humans, we need further research to understand what this means for human health.”You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}