{"id": "Volkswagen plans to make 50 million electric cars, CEO says", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJonathan M. Gitlin\n    -  Nov 12, 2018 4:06 pm UTC\nThey say new converts are always the most devout. Take Volkswagen: after betting big on diesel—and losing—the automaker is going full-speed ahead on electrification. Earlier this year, it revealed it had committed to spending $25 billion on batteries from a number of suppliers, including Samsung and LG Chem. Now those plans may be accelerating, if all goes well at a meeting of VW's supervisory board this coming Friday.Last week, Reuters reported that there is a proposal to convert two German factories over to electric vehicle production. One of these—at Emden—would build an as-yet unnamed sub-€20,000 ($22,550) EV and another called the I.D. Aero, both from VW Group's new EV architecture (called MEB). Another plant at Hannover would produce the crowd-pleasing I.D. Buzz. The first of VW's new MEB vehicles will be the I.D. which goes into production at a third factory in Zwickau in late 2019.And today, VW CEO Herbert Diess told the German publication Automobilwoche that total battery earmarks for the company were now up to €50 billion ($56 billion). \"We have bought batteries for 50 million vehicles,\" he told the publication.However, the board meeting is not a formality. EVs are less complex to manufacture than internal combustion-powered vehicles, and battery production would be handled by VW's suppliers. So although it seems a no-brainer from an emissions point of view, such a large switch to electric vehicle production could cost thousands of jobs, which won't be popular with the unions that comprise half of the board.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}