{"id": "Rocket Report: SpaceX gets top clearance, Europe job cuts, Russian plans", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Nov 16, 2018 12:00 pm UTC\nWelcome to Edition 1.26 of the Rocket Report! This week, we have plenty of news to share about successes at Rocket Lab, as well as an important launch for India's space program. We also link to an in-depth feature on the past, present, and future of Japan's launch industry.As always, we welcome reader submissions, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.Rocket Lab enters its operational phase. Rocket Lab has moved from a company testing a rocket to one that has truly begun commercial operations. With the third flight of its Electron booster, the company delivered seven different satellites into orbit as part of its first fully commercial spaceflight. \"The world is waking up to the new normal,\" the company's founder and chief executive, Peter Beck, said.A head start ... Rocket Lab now has a huge lead in the race to the small-satellite launch market. With two test flights and one operational mission, they are likely 12 to 18 months ahead of everyone else. In a market where probably just two to four out of dozens of competing companies will make it, that's a significant advantage. The company wants a final commercial launch this year before setting an ambitious goal of 16 launches for the year 2019. (submitted by dbayly)Rocket Lab also raises big money. Just after its third flight, Rocket Lab announced that it has raised an additional $140 million in Series E funding, bringing its total funding to date to $288 million. The company said its valuation has \"soared\" past $1 billion in capital markets.New programs? ... The new funding will support \"continued Electron vehicle production expansion, new launch sites, and three new major research and development programs.\" It is not clear what those new major R&D programs are, but we're intrigued. The future seems bright for the company. (submitted by Ken the Bin)\nFirst Name\n\n\nLast Name\n\n\nEmail\n\n\n\nVirgin Orbit puts rocket through taxi tests. Virgin Orbit notched another milestone over the Veterans Day weekend with the first high-speed taxi test of its modified Boeing 747 mothership and a LauncherOne rocket tucked beneath its wing. The airplane reached a speed of 125mph on a runway in Victorville, California, which was fast enough to simulate an aborted takeoff, GeekWire reports.Step by step ... This marked another step on the path toward in-flight tests of the rocket and, ultimately, a launch. The company has set the goal of its first LauncherOne launch this year, and about seven weeks are left to pull that off. It's a tight schedule, but we wish Virgin well. (submitted by Unrulycow and Ken the Bin)Avio tests new LOX-methane engine. The Italian firm says it successfully tested a prototype of its new M10 liquid-fueled engine, developed by Avio in partnership with the European Space Agency. The company plans to use the engine for the third stage of an evolved version of its smaller Vega rocket, possibly as soon as 2024.More efficient engine ... According to Giulio Ranzo, Avio's CEO, the engine will replace the Vega's last two propulsion stages with a new cryogenic stage that will be significantly more efficient and flexible. \"Our objective is to keep on increasing Vega's cost competitiveness and maneuverability to orbit small satellites in low Earth orbit,\" he said. The small-satellite launch competition will certainly be interesting come the mid-2020s. (submitted by Virkash)Japan seeks its place in modern launch industry. In a lengthy article, Ars captures the state of play in the Japanese launch industry as the country grapples with the rise of SpaceX and nears completion of its new H3 rocket. This vehicle is designed for reliability and reduced costs, but not reusability.Long history, bright future? ... Japan was the fourth country in the world to reach orbit, so it has a long history with spaceflight. It also has quiet but surprisingly robust ambitions in spaceflight, including completion of its own GPS network. The country has also long been interested in reusable rockets, but JAXA and its contractors have yet to receive the resources needed to bring them to flight.SpaceX cleared for NASA's most sensitive missions. NASA's Launch Services Program has awarded its Category 3 certification to SpaceX's Falcon 9 rocket, according to SpaceNews. This certification allows the space agency to use the Falcon 9 for its highest-value science missions.Ticking the boxes ... In the last few years, SpaceX has received Air Force certification for both the Falcon 9 and Falcon Heavy rockets, and now it has received NASA's most critical certification. It is pretty remarkable to think about the speed at which SpaceX has gone from outsider to critical partner for the US government and its most sensitive missions. (submitted by Ken the Bin)ArianeGroup cuts 2,300 jobs. The European rocket-maker ArianeGroup will cut 2,300 jobs by 2022 as it phases out use of its Ariane 5 rocket. The company said it faced tough competition from US space companies whose business is \"bolstered by a large volume of institutional orders,\" AFP reports. ArianeGroup will make the cuts by not replacing staff who leave or retire.Not unexpected ... One of the key selling points of ArianeGroup's new Ariane 6 rocket is that it costs less and will be more efficient to produce. Clearly, the biggest opportunity to cut production costs is simply to build rockets with fewer people in a shorter period of time. These cuts are part of ArianeGroup's efforts to better compete with SpaceX and other launch providers, an issue Ars dived deeply into earlier this year. (submitted by Ken the Bin and pmhparis)Russia has big plans for launch in 2019. Based upon a report in Space Daily, the Russian space corporation Roscosmos will carry out 17 space launches in 2018. However, it plans to bounce back with more than 35 launches in 2019, Roscosmos chief Dmitry Rogozin said. Ten of them will be \"heavy\" rockets, including nine Protons and one Angara.We'll see ... The Russian launch industry has been going the wrong way in recent years in terms of reliability, and that has been reflected in declining numbers of commercial orders. Frankly, we'll be surprised if the Russians reach their target of nine Proton launches in 2019 (especially since they've had just one so far this year).India’s GSLV Mark 3 aces test launch. It was the third test flight of India’s most powerful rocket, following a suborbital demonstration in 2014 and an orbital launch in 2017. Both missions were successful, and with Wednesday's successful launch, Indian officials declared the rocket ready for operational flights, beginning with the launch of the Chandrayaan-2 lunar lander as soon as January, SpaceFlight Now reports.A lot riding on this rocket ... The Mark 3 rocket can loft up to four tons to geostationary transfer orbit. The Mark 3 is also supposed to launch astronauts to orbit aboard India's planned Gaganyaan crew spacecraft as soon as December 2021. So it was important that the booster, which has a core stage driven by two hydrazine-fueled Vikas engines, works. (submitted by Ken the Bin)The Tesla roadster has passed through aphelion. Late last week, the vehicle launched by a Falcon Heavy rocket in February reached its first apogee from the Sun at a distance of 1.66 Astronomical Units, or about 250 million km, which puts it well beyond the orbit of Mars. The data on the Tesla's orbit comes from NASA and tracking by ground telescopes for the first six weeks after launch, when the Falcon Heavy's upper stage (and the Tesla) were still relatively close to Earth.Hubble says no ... The Tesla is so far from Earth that only the Hubble Space Telescope can now see it at the 30th magnitude. But Hubble isn't interested in the challenge. \"Hubble orbits are precious and highly competed for, and so it would be a waste of scientific time to devote the resources to look at it,\" Ray Villard, news director for the Space Telescope Science Institute, told Ars.China unveils a new heavy-lift rocket. Hu Xiaojun, a researcher at CALT, told press at the Zhuhai Airshow that the new launch vehicle is intended for future crewed spaceflight missions using China's next-generation crewed spacecraft, including lunar missions. It will be designed to send 25 metric tons to trans-lunar injection and 70 metric tons to low-Earth orbit, SpaceNews reports.Eyes on deep space ... Feasibility studies began in 2016, and the new rocket will likely be reusable. From slides presented during talks, the conceptual designs of the launch vehicles show clustered engines more reminiscent of the SpaceX Falcon 9 rocket than of typical Long March heritage. The plans signal China's interest in deep space (not to mention its willingness to copy the spacefaring ideas of others). (submitted by Unrulycow and Ken the Bin)Russia eyes new uses for the RD-180. As United Launch Alliance presses ahead with its Vulcan rocket development, Russia will eventually lose an important customer for its RD-180 engine. However, the RD-180 engine may instead be mounted on Russia's super-heavy carrier rocket and modernized Soyuz-2 launchers, Energomash CEO Igor Arbuzov told TASS at the Airshow China exhibition.Maybe, maybe not ... We have our doubts about whether such a super-sized rocket will, in fact, be built. According to reports, this beast will be capable of delivering 70 tons to low Earth orbit and will serve as the foundation for a deep-space exploration program. However, with a development cost of billions of dollars and a launch date no earlier than 2028, it is hard to take the vehicle too seriously in light of the Russian space program's current financial instability.Nov. 16: Soyuz-FG | Progress MS-10 | Baikonur Cosmodrome, Kazakhstan | 18:14 UTCNov. 17: Antares 230 | S.S. John Young Cygnus | Wallops Island, Virginia | 09:01 UTCNov. 19: Falcon 9 | Spaceflight SSO-A | Vandenberg Air Force Base, Calif. | 18:32 UTCYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}