{"id": "Report: Charges against Assange relate to Russian hacking", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nTimothy B. Lee\n    -  Nov 17, 2018 2:00 pm UTC\nThe Reporters Committee for Freedom of the Press has asked a federal court to unseal documents related to the federal government's pending prosecution of WikiLeaks founder Julian Assange.The existence of that prosecution appears to have been accidentally revealed due to a cut-and-paste error in an unrelated sex crimes case. Now that its existence has been revealed, the Reporters Committee argues, there's no good reason to continue to withhold other details of the charges against Assange.\"Both the press and the public have a particularly powerful interest in access to sealed court records related to the government's prosecution of Assange,\" the rights group said in its filing.Thursday's accidental revelation set off a flurry of subsequent reporting on the Assange prosecution. On Friday evening, The New York Times reported that the prosecution focuses on Assange's relationship with Russia.According to the Times, Trump's former CIA director Mike Pompeo (now secretary of state) launched an investigation of Assange shortly after taking the job. The Obama administration had treated Wikileaks as a journalistic entity. But Pompeo and former attorney general Jeff Sessions reconsidered that decision and began aggressively probing Assange's ties to the Russian government.\"Their work culminated in prosecutors secretly filing charges this summer against Mr. Assange,\" the Times wrote. The newspaper also notes that, when the federal government charged 12 Russians for hacking Democrats in July, the indictment \"contained thinly veiled references to WikiLeaks.\"But while it seems clear that the federal government has charged Assange with something, it's not known what specific charges he would face if taken into US custody. The Reporters Committee is seeking to change that, arguing that there's no reason to keep the details secret now that Assange knows he is under indictment.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}