{"id": "Why does one California county sheriff have the highest rate of stingray use?", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Oct 24, 2018 8:40 pm UTC\nThe lawsuit, Electronic Frontier Foundation v. County of San Bernardino et al., which was filed in county court on Tuesday, explains how a 2015 state law requires that law enforcement agencies in most cases seek a warrant to use the surveillance devices. Prior to the law's passage, Ars reported that since the San Bernardino Sheriff's Department (SBSD) acquired a stingray in late 2012, the agency has used it 303 times between January 1, 2014 and May 7, 2015, all without seeking a warrant.The SBSD is the law enforcement agency for the entire county, the twelfth-most populous county in the United States, and the fifth-most populous in California.As Ars has reported for years, stingrays are in use by both local and federal law enforcement agencies nationwide. The devices determine a target phone's location by spoofing or simulating a cell tower. Mobile phones in range of the stingray then connect to it and exchange data with the device as they would with a real cell tower.Once deployed, stingrays intercept data from the target phone along with information from other phones within the vicinity—up to and including full calls and text messages. At times, police have falsely claimed that information gathered from a stingray has instead come from a confidential informant.The EFF filed a public records request to obtain copies of six relevant warrant applications for stingray use in San Bernardino County in 2017. The request included the date range of the search, the nature of the investigation, and the items to be searched for, among other data included on a public California Department of Justice website.The Palm Springs Desert Sun reports that San Bernardino County’s law enforcement agencies \"were granted the most electronic warrants to search digital property per resident in the state.\" The county sheriff also has been cited as a primary opponent of a now-defeated surveillance oversight bill, SB 1186.However, the county denied the request, claiming that the EFF’s request was not specific enough and that the records were exempt under a section of the California Public Records Act that allows agencies to withhold \"investigatory\" files.According to the EFF’s civil complaint, neither reason is a \"legitimate justification\" for withholding the records. Michael Risher, an attorney representing the EFF, wrote:The request more than reasonably described the target records. In fact, it uniquely identified the warrants in question, providing the exact time frame covered by the warrant, the exact date and time the Defendants provided information about the warrants to the Department of Justice, and other identifying information. Defendants’ claim in this regard is particularly weak because their own policy—which state law requires them to adopt and make public—requires their personnel to obtain high-level approval for, and then maintain a log of, all warrants like those here at issue. This log must contain the dates that the cell site simulator was used, which would mirror or be contained within the time frame covered by the warrant, and so would allow Defendants to easily identify and locate the requested warrants.Search warrants, which are issued by the Court, are public records, as are the supporting affidavits. Penal Code § 1534 (a). In fact, the California Department of Justice has informed EFF that it could, and should, obtain copies of warrants included in its website directly from the agency that obtained them. Although the statutory scheme allows the issuing court to seal this type of warrant for limited time periods under certain conditions, there is no indication that the requested warrants are sealed (Defendants do not suggest that they are, and they appear to claim that they cannot even identify the warrants at issue).However, we did receive written responses last month sent by Sheriff John McMahon himself, in which he declared that stingrays were mere \"investigative tools.\"\"They are not covert ways to take a person’s private information,\" he wrote. \"We do not retrieve any personal information from the use of this equipment.\"When we asked why the county led the state in Electronic Search Warrant Notifications, McMahon seemed to suggest that it was because the agency was \"aggressive in investigating crimes,\" and he added that stingray use was \"a small percentage of these warrants.\"Ars also specifically asked how the SBSD interprets the California State Constitution’s affirmative right to privacy, as outlined in Article I, Section 1.\"We take people’s privacy seriously,\" he wrote. \"We adhere to the United States Constitution. The men and women of the San Bernardino County Sheriff's Department follow state laws and stay current with case law when accessing any personal/private information of a person.\"You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}