{"id": "Apple’s TV subscription service starts in 2019 to compete with Netflix, Amazon", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nValentina Palladino\n    -  Oct 24, 2018 2:19 pm UTC\nWe may be only a few months away from an Apple TV subscription service launch. According to a report by The Information, Apple plans to launch its TV subscription service in the US in the first half of 2019. The service will reportedly be available in more than 100 countries, starting with the US and coming to other regions in the months thereafter.Apple reportedly plans on making the original content on the service free for Apple device owners. This aspect of the service has been reported for a while now. But it has also been rumored that Apple will restrict the subscription service to Apple devices, such as the iPhone, iPad, and Apple TV.If true, it could limit the company's ability to expand the service and truly compete with the likes of Netflix, Amazon, and Hulu. All of those competitors make apps that are available across many devices and operating systems, including Roku streaming devices and smart TVs. That gives them the opportunity to reach more users and gain new subscribers without many hardware restrictions. Limiting its subscription service to Apple devices may hurt the service in the long run. However, Apple's strategy as of late has been to get new customers through its services and have those services bolster device sales.Even if the Apple's original content is free for device owners, it has to be compelling to get those users to actually watch it. Apple has invested a lot of time and money (at least $1 billion in 2018 alone) in original content over the past year or so. The company will reboot the science-fiction anthology show Amazing Stories, produce a space drama from Battlestar Galactica creator Ron Moore, and create a series with La La Land director Damien Chazelle. Apple has also signed a deal with Oprah Winfrey.But all of those projects are under wraps right now. We've only see a few pieces of original content from Apple so far: the shows Carpool Karaoke and Planet of the Apps, both of which live on Apple Music. It's also been reported that Apple wants its original shows to stay away from \"gratuitous sex, profanity, or violence\"—another factor that could limit the appeal of the service's content.Netflix dominates the subscription service space right now with over 125 million subscribers and standout original content including shows like Stranger Things, House of Cards, and Orange is the New Black. Amazon Prime Video also has a massive subscriber base (although, those numbers are mostly tied to Prime subscriptions since Prime Video is included in that service) and has received accolades for its original content as well. Apple will be playing catch-up, both on the subscription side and the original content side, when its subscription service debuts.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}