{"id": "Why figuring out what’s behind a big gender paradox won’t be easy", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCathleen O'Grady\n    -  Oct 18, 2018 8:25 pm UTC\nIn Sweden, girls are just as likely to go to school and university as boys are. Women make up a greater proportion of the country’s professional and technical workers than any other country in the world. And their representation in the country’s politics is among the world’s best. But when it comes to personality tests, Swedish men and women are worlds apart.Malaysia sits toward the opposite end of the scale: despite ranking among the world’s lowest for political empowerment of women and lagging when it comes to women’s health and survival, men and women end up looking similar in those same personality tests. What gives?This fascinating finding—dubbed the gender-equality paradox—isn't new, but two recent papers report fresh details. In a paper published in Science today, Armin Falk and Johannes Hermle report that gender differences in preferences like risk-taking, patience, and trust were more exaggerated in wealthier and more gender-equal countries. And in a recent paper in the International Journal of Psychology, Erik Mac Giolla and Petri Kajonius provide more detail on the original paradox.Falk and Hermle used data from the 2012 Gallup World Poll that explored the preferences of around 80,000 people from 76 different countries. People answered questions about how they felt about things like patience and taking risks, and they also did mini-experiments to provide less subjective measurements—for example, choosing whether to take a fixed payment or play a lottery for a larger sum of money. The researchers compared these results to GDP for the 76 countries and also to a measure of gender equality that took into account things like international rankings and how long women have had the vote in each country. They found that richer and more gender-equal countries had bigger gender gaps in people’s preferences.Mac Giolla and Kajonius looked at one of the older paradoxical findings: gender differences in personality ratings get bigger in more-equal countries. Building on previous research, they used a bigger dataset and more detailed personality questionnaire than previous work, as well as more advanced statistical techniques. They found that women tend to rate higher than men on all five facets of personality on the most widely used personality test—openness to experience, conscientiousness, extraversion, agreeableness, and neuroticism—and that the gap gets wider in countries that rank higher on the Global Gender Gap Index (meaning they score higher on some measures of equality).What’s the reason for these curious findings? Everyone’s got an explanation, which puts the gender-equality paradox in danger of causing heated arguments when what it needs is exploration with a microscope and a scalpel. Research exploring the paradox could tell us some fascinating things about how gender interacts with culture, but the list of open questions is dizzying. There are complications at every turn: in the datasets used by the researchers, how different sides of the debate interpret the findings, and most importantly, in the role that cultural history might play in creating the results.These results tap into questions about what causes any cognitive and psychological differences we find between men and women. Social role theory says that we can explain many important differences by looking at culture and how girls and boys are raised differently; other perspectives point to biology as the explanation. Of course, nothing is really that simple—culture and biology interact in complex ways, and the answer doesn’t need to be the same for every trait.Mac Giolla and Kajonius argue that the paradox creates a problem for social role theory: if culture is responsible for creating gender differences, they suggest, and the culture becomes more egalitarian, we should expect the gaps to close. And in some cases, they do: there are “some psychological sex differences that do become smaller in more gender-equal nations, but these are not mentioned by the authors,” says Alice Eagly, a proponent of social role theory, pointing to findings that gender gaps in math performance close in more gender-equal countries.But it’s also not clear that any correlations involving gender equality would necessarily be that simple, even if all psychological differences were created purely by culture. The Global Gender Gap Index, the metric used by Mac Giolla and Kajonius, involves a phenomenal attempt to pack all the complications of gender equality into a single ranking—but it understandably can’t capture absolutely everything about how gender works in myriad cultures across the world.The index looks at progress on measures like economic participation and political empowerment, but it isn’t able to capture wobblier human factors like cultural beliefs and stereotyping. This is illustrated by looking at Rwanda, which has made enormous strides in political representation of women while making little progress in changes to traditional gender roles; it currently ranks sixth on the index. And there’s evidence of greater gender stereotyping in precisely those countries that come out on top of this ranking, which could be a result of older and more entrenched cultural ideas, a cultural backlash, or something else entirely.There are complications on the biological end of things, too. The easy comparison here is height, which is determined by both biological and environmental factors. You might have the genes to be a basketball player, but if you don’t get enough food as a kid, you’ll never reach that potential. So, in countries with a lot of inequality, the environment plays a much bigger role in determining people’s heights. In more egalitarian countries, genes explain most of the difference.The argument here is similar: “when men and women are free to express individual characteristics in more unconstrained societies, sex differences may be enlarged,” write Mac Giolla and Kajonius. But that’s where the analogy with height seems to break down: it’s not clear how factors like having fewer women in parliament and more abortions of female fetuses could dampen the flourishing of psychological gender differences in quite the same way that not having enough food stops someone from getting tall.Falk and Hermle have a slightly different argument, centered more around a country’s economic strength than its gender-equality ranking: when basic material needs are fulfilled, they write, it paves the way for self-expression, including expression of gender. Of course, there’s a strong relationship between factors like GDP and the Gender Gap Index, and they look at economic development as well as various measures of gender equality, finding the correlations all the way through.Cries of “correlation isn’t causation” tend to accompany any studies like these, but they’re oddly absent from conversations about the paradox. That might be because it seems unnecessary—when you’re talking about gender equality and gender differences, there’s such an obvious relationship that it seems like, for once, we could ignore the niceties about correlation and just assume that one causes the other.But what if more sexist societies—ones with bigger differences in how people think about and treat men and women—were the ones where women had a bigger and earlier impetus to start campaigning for their rights? Rights and social equality might anti-correlate in this case, confusing any analysis. Data on whether the differences increase as countries climb the ranks of gender equality would be useful in teasing those two possibilities apart.There could be something else underlying the pattern: cultural history. In Falk and Hermle’s analysis, “Croatia, Serbia, [and] Bosnia and Herzegovina are treated as if these countries evolved independently from one another,” says Seán Roberts, a researcher with an interest in how traits pattern across different cultures. In the same vein, Mac Giolla and Kajonius treat Norway, Sweden, and Finland as if they were entirely separate, he explains. “These countries share a close history, and so unsurprisingly they have very similar gender differences and gender-equality scores.”Looking at cross-cultural patterns without accounting for this kind of shared history can lead to all kinds of surprising and wild findings—like more traffic accidents in countries with higher linguistic diversity or less smoking among speakers of languages that don’t have a separate future tense. Roberts and a colleague found that there was a “strong relationship between the amount of chocolate consumed in a country and how many serial killers [it] produced.” This sort of finding happens just because cultures often inherit things from their ancestors together: the foods they eat, the clothes they wear, and their political tendencies.The fact that those relationships weren’t controlled for here doesn’t make the results necessarily useless, but they might look bigger than they really are; it’s important to see what the results look like after accounting for shared history. “If the effect really is robust, then the correlation should be the same for each continent,” says Roberts. But that doesn’t seem to be the case, at least in Falk and Hermle’s data, he notes—Western European countries cluster at the top for both gender equality and personality differences, but “looking at the African countries, there might even be a negative correlation.”All of these caveats don’t mean the findings on the paradox are useless—they clearly tell us there’s something here that’s probably worth understanding. But we just don’t currently have enough information for us to draw strong conclusions. “Both studies are very impressive in the amount and scope of the data they have collected, and the analysis is very thorough,” Roberts says. But when a proper understanding of equality and gender differences is such a crucial conversation, he adds, “it’s important to hold this work to very high standards of rigor.”Science, 2018. DOI: 10.1126/science.aas9899  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}