{"id": "Samsung’s foldable smartphone reportedly costs $1,770, launches in March", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nRon Amadeo\n    -  Nov 12, 2018 3:59 pm UTC\nSamsung intrigued the world with the announcement last week that it would launch a smartphone with a folding display sometime early next year. Now a report from South Korea's Yonhap News Agency adds a few more details to Samsung's secretive tease.First is an actual name; according to Yonhap's sources, the phone will be called the \"Galaxy F\"—presumably that's \"F\" for \"Foldable.\" The second big claim in the article is a price: $1,770 (₩2,000,000) for Samsung's cutting-edge smartphone. That's a big increase from the ~$1,000 flagships of today, but if this rumor pans out, the Galaxy F wouldn't even be Samsung's most expensive phone. That honor goes to the $2,700 Samsung W2019, which, believe it or not, is a dual-screen flip phone with flagship specs and some ultra-luxury add-ons like a Samsung concierge service.According to the report, Samsung fully expects the nearly $1,800 price tag of the Galaxy F to limit sales. The company's mainstream flagship play will still be the Galaxy S10, and apparently Samsung is planning a one-two punch of the S10 in February and the Galaxy F in March.In addition to the Yonhap report, we've also been getting a few tidbits out of Google's Android developer conference last week. Google—which is working closely with Samsung to make Android work on the foldable display—told developers that currently, the front of the Samsung foldable has a tiny 4.58-inch display with a 1960×840 resolution, while the unfolded \"tablet\" mode has a massive 7.3-inch, 2152×1536 display. Samsung tried its best to hide the design of the foldable at its announcement last week, but even with the lights turned down, you could tell that the closed front design of the phone was a lot different from the nearly all-screen designs we're used to. For whatever reason, the front has a lot of real-estate dedicated to something other than the display. It looks like Samsung certainly has a unique device on its hands.Listing image by SamsungYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}