{"id": "Surface Go with integrated LTE available for preorder now, from $679", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nPeter Bright\n    -  Nov 12, 2018 5:08 pm UTC\nLast week Microsoft added an extra configuration to the Surface Go lineup. Today it's rounding out the range and filling the final gaps, adding systems with integrated LTE to the product mix.LTE adds $130 to the system price. At $679 is the consumer SKU: 8GB RAM, 128GB SSD storage, Windows 10 Home, and integrated LTE. Business users have two configurations: 8GB RAM, 128GB SSD storage, Windows 10 Pro, for $729, or the same spec with 256GB SSD storage, for $829. The LTE option adds a fraction to the weight (0.02lb/10 grams) and equips the machine with a nano-SIM tray, GPS, and GLONASS positioning.Microsoft estimates that the LTE model has marginally lower battery life than the Wi-Fi version, quoting 8.5 hours of video playback for the LTE model, in contrast to 9 hours for the Wi-Fi version. This is likely a small price to pay for the ability to get online anywhere and everywhere. Microsoft has positioned the Surface Go as an ideal system for frontline workers: people who may be out in the field on customer or other remote sites. Adding LTE means that these workers are always online and able to reach their corporate systems for inventory management, support tickets, or whatever else they need.Preorders begin today in the US and Canada, with devices shipping on November 20. Orders open up in another 21 markets on November 22.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}