{"id": "We’ve run wild on the Switch version of WarFrame—and it’s solid", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nArs Staff\n    -  Nov 16, 2018 5:20 pm UTC\nIf you had asked us a year ago whether the Nintendo Switch would ever deliver a shooter on par with the online team-questing of Destiny, we would surely have laughed you off. A solid, connected, shooting-filled 3D game for Nintendo's handheld? Go back to Mario Kart, dreamer.But the past year has seen developers unlock serious power—and reasonable compromises—in impressive Switch ports. Now, one of the industry's best Switch wranglers, Panic Button, has worked its magic on the free-to-play multiplayer shooter WarFrame, out this week on the platform.Ahead of the launch, we had the opportunity to sit with the combined brain trust behind WarFrame on Switch—a producer at series creator Digital Extremes and the head of Panic Button's porting team—and rap about what they made happen. We also went hands-on with the results and enjoyed the tweaked options laid out, including joystick sensitivity, button mapping, and—a rarity on the Nintendo Switch—a field-of-view slider, which first-person junkies will surely appreciate.Sadly, our attempts to squeeze serious technical explanations out of the duo came up short, as we didn't get deep answers on nuts-and-bolts queries about things like dynamic resolution tricks, lighting system revamps, and the like. However, we did learn that Panic Button has a few online-specific tweaks in store for Switch fans who wish Nintendo had gone the extra mile with its own online systems.Specifically, Panic Button has confirmed to Ars that you do not need to pay for the Switch Online subscription service to play WarFrame for Switch online, and you can expect headset support when playing the game in handheld mode. (Meaning you just plug a mic-equipped headset into your 3.5mm jack, and you can enjoy voice chat support with your teammates. No smartphone app required!)For now, WarFrame isn't quite on the same upgrade path as the PC and console versions, so you won't find any Fortuna content here yet; we've been told that will come to Switch in the following months. (Since series fans are probably wondering: your WarFrame account credentials will work on this Switch version, but cross-play with other consoles will not.)Dive into the video for more on the studio's perspective on maximizing Switch performance and why they think Nintendo's handheld is ideal for what WarFrame has to offer—along with capture of our own 30fps gameplay, which left us impressed.Listing image by Digital Extremes/Panic ButtonYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}