{"id": "Uber vice president resigns after sexual misconduct allegations", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Oct 24, 2018 12:15 pm UTC\nAccording to the Journal, Cameron Poetzscher, the vice president of corporate development, left the company as of Monday.The Australian had been with the company for around 4.5 years prior to his departure. Uber conducted an internal investigation, formally reprimanded him in late 2017, reduced his bonus, and had him attend sensitivity training. However, several months later, Poetzscher was promoted anyway.Uber did not respond to Ars’ request for comment on Tuesday.Poetzscher was alleged to have made sexual remarks about his female colleagues and also had a consensual affair with another woman at the company against company policy, the newspaper reported, citing anonymous sources.\"I deeply regret and have learned from this error in judgment, and I am proud of how hard everyone at Uber is working to ensure our company is a positive, respectful, and inspiring place to work,\" he told the newspaper in a September 2018 statement.Poetzscher’s name came up a few times during the Waymo v. Uber trial, which took place earlier this year in federal court in San Francisco.His testimony illustrated how he served as then-CEO Travis Kalanick’s right-hand man, particularly during the deal to acquire Otto, a short-lived self-driving startup founded by two ex-Google engineers that was quickly acquired by Uber.In May 2018, the company ended mandatory arbitration in sexual assault and harassment cases.Uber’s leadership has been under intense scrutiny particularly since the February 2017 revelation that Susan Fowler, an Uber engineer, revealed that she experienced institutional sexism upon her arrival at the company in late 2015.Going back at least four years ago, Uber has been accused of other instances of misogynistic behavior. Back in October 2014, the company ran ads in France with scantily clad women that prompted public rebuke in some corners. That same year, Kalanick was profiled in GQ (which, like Ars Technica, is a Conde Nast property) and caused ire with a joke involving the term \"Boob-er.\"Since Monday, Poetzscher has changed his status on LinkedIn to \"on the beach.\"You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}