{"id": "Cut-and-paste error apparently reveals federal charges against Assange", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nTimothy B. Lee\n    -  Nov 16, 2018 4:00 pm UTC\nFederal prosecutors have accidentally revealed that criminal charges have been filed against \"Assange\"—an apparent reference to Wikileaks founder Julian Assange. The feds filed the revealing document back in August, but the slip-up wasn't noticed until it was flagged in a Thursday evening tweet.The filing was in an unrelated sex crimes case in the Eastern District of Virginia. Federal prosecutors asked the court to seal its criminal complaint and arrest warrant against a man named  Seitu Sulayman Kokayi—for \"coercion and enticement of a juvenile to engage in unlawful sexual activity\"—to avoid tipping the suspect off. But in two places, the document refers to \"Assange\" instead of the actual defendant in the case.The document argues that the case should be sealed because, \"due to the sophistication of the defendant and the publicity surrounding the case, no other procedure is likely to keep confidential the fact that Assange has been charged.\"That claim makes no sense in the context of the Kokayi case—there's no reason to consider him a sophisticated defendant, and his case hasn't received significant publicity before now. But it obviously fits the circumstances of Julian Assange's case perfectly.Later in the same document, the feds state that documents in the case \"would need to remain sealed until Assange is arrested in connection with the charges in the criminal complaint and can therefore no longer evade or avoid arrest and extradition in this matter.\"For the last several years, Assange has been hiding out in the Ecuadorian embassy in London to evade arrest and extradition over sexual assault charges in Sweden. Sweden dropped the charges last year, but Assange could still face charges related to skipping bail if he left the embassy. Assange has also expressed fear that turning himself in would lead to his extradition to the United States—a fear that now appears to be well-founded.The federal government has admitted it made a mistake with the filing but hasn't explained how it happened. But it's widely assumed that this was a cut-and-paste mistake.It's not uncommon for federal prosecutors to start with a document in a previous case and then modify key details for use in a new case. In this case, someone in the federal prosecutor's office apparently started with a still-secret document asking to keep charges against Assange secret, and replaced Assange's name with the name of the defendant in an unrelated case. But this person seems to have gotten sloppy, failing to replace Assange's name in two places in the document.While we now have strong evidence that Assange is facing some kind of US criminal charges, the exact details of those charges are unknown.The federal government charged Chelsea Manning with violations of the US Espionage Act and computer hacking laws for leaking US military secrets to Assange's Wikileaks. She was convicted in 2013, but her sentence was later commuted by President Obama. The federal government may want to prosecute Assange for his role in the disclosures as well.But it's not clear if the same laws apply to an Australian national like Assange. And in the famous Pentagon Papers case, the Supreme Court upheld a newspaper's right to publish classified information. So prosecuting Assange for publishing Manning's disclosure could run afoul of the First Amendment.The charges might also have nothing to do with Manning. For example, federal prosecutors indicted 12 Russian nationals earlier this year for hacking Democrats during the US presidential election campaign in 2016. Some of those stolen emails were passed to Wikileaks for publication, so the indictments could have something to do with that incident.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}