{"id": "RIP William Goldman, creator of beloved film, The Princess Bride", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Nov 16, 2018 7:23 pm UTC\nLegendary Hollywood screenwriter William Goldman has died at the age of 87 from colon cancer and pneumonia, The New York Times reports. Goldman won two screenwriting Oscars, for Butch Cassidy and the Sundance Kid (1969) and All the President's Men (1976). But by far his most beloved (and most widely quoted) film across multiple generations is 1987's postmodern fairytale, The Princess Bride.The man once called \"the world's greatest and most famous living screenwriter\" by the Guardian actually started out as a novelist, but his early novels got mixed reviews. Discouraged, Goldman agreed to adapt Daniel Keyes' bestselling 1966 novel Flowers for Algernon into a screenplay. He was fired from the project, and even Goldman himself declared it was a \"terrible\" screenplay. But he learned from the experience and went on to sell his first original screenplay, Butch Cassidy and the Sundance Kid, for a record (at the time) $400,000.The rest is Hollywood history. His other screenwriting credits include The Stepford Wives (the 1974 original, not the mediocre 2004 remake), A Bridge Too Far (1977), Chaplin (1992), and Misery (1990). Two of his screenplays are adaptations of his own novels: Marathon Man (1976) and The Princess Bride. Goldman was especially fond of the latter novel, first published in 1973. It was 15 years before Director Rob Reiner managed to bring the story to the silver screen after having long been a fan of the book.The Princess Bride was only a modest success at the box office, grossing $30.8 million against its relatively modest $16 million production budget. But it kept gaining new fans, especially after it was released on home video, to eventually achieve cult classic status. The American Film Institute lists it among the 100 greatest love stories of all time, and the Writers Guild of America placed the screenplay as #88 in its list of best screenplays of all time.The film is sheer perfection, a delightful mix of swashbuckling action, comedy, and pathos, with an all-star cast that includes scene-stealing cameos by Billy Crystal, Carol Kane, and Peter Cook as the \"Impressive Clergyman\" with the hilarious speech impediment. It features one of the finest fencing duels in film history between Mandy Patinkin's Spanish swordsman Inigo Montoya and Cary Elwes' Man in Black. (Patinkin and Elwes learned to fence—both right- and left-handed—for the sequence. Apart from a couple of somersaults performed by stuntmen, it really is them fencing.)Above all, the film celebrates selfless love (\"As you wish\") and offers occasional pearls of wisdom. \"You mock my pain!\" Princess Buttercup (Robin Wright) declares at one point to the Man in Black (secretly her presumed-dead true love, Wesley). He responds, \"Life is pain, highness. Anyone who says differently is selling something.\"In that regard, it captures the essence of Goldman's own writing philosophy. \"As a writer, I believe that all the basic human truths are known,\" Goldman wrote in his memoir, Adventures in the Screen Trade. \"And what we try to do as best we can is come at those truths from our own unique angle, to re-illuminate those truths in a hopefully different way.\" So we can think of no better way to honor Goldman's passing than a look back at some of our favorite moments from The Princess Bride.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}