{"id": "Lenovo Yoga Book 2018 review: The keyless keyboard returns, now in E Ink", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nValentina Palladino\n    -  Nov 2, 2018 2:00 pm UTC\nLenovo's quirky Yoga Book is back with some significant updates for 2018. The original Yoga Book was a unique hybrid of a tablet sporting a \"halo\" keyboard panel with no actual keys and a real paper drawing pad. Part netbook and part convertible, this year's edition remains quirky but seems more practical and less cumbersome than the original.For 2018, Lenovo ditched the halo keyboard and paper pad and opted for an E Ink panel that can switch between keyboard, note, and e-reader modes. There's also a new embedded fingerprint sensor, new precision pen, and bumped-up specs. All together, those features also bump up the Yoga Book's price to $999.Do the changes add up to a more competent companion device? After spending some time with the new model, it seems like a lot of the hardware issues with the original Yoga Book may be resolved by Lenovo's updates. In fact, the Yoga Book may even have some more mainstream appeal thanks to these improvements. Still, this doesn't seem like a device made to replace most people's all-purpose convertibles.I never owned a netbook, but the compactness of the Yoga Book makes me believe I may have liked one of those tiny technology dinosaurs. Of course, most netbooks were not as thin and light as the Yoga Book is—Lenovo's updated device measures just 9.6mm thick and weighs 1.71 pounds. It takes up less physical space in my backpack than a hardcover book does, which will be great for people like me who already have too many things in their bags to begin with.\nWhen closed, the new Yoga Book looks nearly identical to the original—the chassis and lid are both clean slates of iron gray, joined together by Lenovo's watchband hinge. While the company didn't include the signature hinge in the Yoga C930 convertible, its newest ultrabook, it's not retiring the mechanism entirely. The hinge serves the Yoga Book well in particular because it allows both the chassis and the lid to lay completely flat when opened to 180 degrees—a comfortable position for note-takers, artists, and pen enthusiasts who use the E Ink panel often.Lenovo upped the display to a 10.8-inch QHD touch panel, while the E Ink panel measures the same size but has an FHD resolution. Uniform bezels surround the touchscreen, blemished only by the 2MP front-facing camera at the top bezel and the Yoga Book logo on the bottom-right corner. This device doesn't have any of Lenovo's camera privacy features—no physical shutter, no camera disable button—but considering its niche nature, Lenovo probably didn't deem it necessary to include such features.However, the company included an optical infrared fingerprint sensor at the top-right corner of the E Ink panel. It's marked only by a silver circle that's barely visible in low-light, allowing it to blend almost seamlessly into the chassis. But I couldn't even finish registering my fingerprint in the Windows Hello settings. After I pressed my index finger down the first time during the initial setup, I continued getting errors that said the fingerprint reader was having trouble recognizing my print.In the end, it seemed my review unit had a defective fingerprint reader. Lenovo sent another Yoga Book, and its fingerprint reader worked as expected. The setup process only took a minute or two of pressing my finger down onto the glass-covered reader at different angles, and the device unlocked quickly when I used the fingerprint reader after that.We'll save further discussion of the E Ink panel, but let's talk about possibly one of the most gimmicky features of the Yoga Book: knock-knock. This lets you pop open the lid when the device is closed by simply knocking twice on it. Since the edges of the chassis and lid are flush, it's difficult to open with your fingers. It's possible to do so, especially if you have moderately long nails like I do, but it will likely frustrate most users.While knock-knock may be gimmicky, it actually works well. Rapping your knuckle lightly on the top of the lid forces the device to make a peculiar gear-turning sound, followed by a cute woosh sound as the lid pops up maybe a half-inch from the chassis. I used knock-knock much more than I initially anticipated, and while I still think it's a gimmick, at least it's a useful one.The minute thickness of the Yoga Book prevents it from having a ton of ports. Two USB-C 3.1 Gen 1 ports live on its edges, one on either side, and a microSD card slot sits on the left edge as well. Aside from the power and volume buttons, that's it—there isn't even a headphone jack on the new Yoga Book. It's a strange decision considering the device is just thick enough that a headphone jack could fit, but Lenovo decided to leave it out. Sure, wireless earbuds are slowly getting better and becoming more popular, but some still appreciate (or demand) the reliability of a headphone jack.E Ink technology replaces Lenovo's \"halo\" tech on the original Yoga Book, and even before I tried out the new device, I thought this was a good decision. Last year's Yoga Book had many limitations—the halo keyboard wasn't active when the stylus was active, and you had to switch between writing on the halo keyboard and on the \"Book Pad\" paper pad that came with the device. When using the Book Pad on top of the halo keyboard, you had to first switch the pen's tip out for a special nib, and all of your scribbles were transfered to the PC similarly to how a Wacom digitizer makes digital strokes on a PC (just not as elegantly).With the E Ink panel, the Yoga Book supports touch and pen input and drawing directly on the panel. There's also a new read mode. Those options alone makes the E Ink panel much more versatile and practical than the previous generation, and it's a perk that most people are familiar with thanks to e-readers.This E Ink panel is pretty standard: it's great to look at in most lighting environments, but it's slow to refresh. Switching between keyboard, note, and and reading modes took at least one to two seconds before the appropriate interface fully loaded on the panel.However, I was happy to see that the panel doesn't completely refresh every time you press a key or make a small change to the on-screen interface. On e-readers like Kindle devices, the E Ink panel refreshes every time you flip the page and the transition isn't always seamless. On this panel, the panel doesn't glitch or change while you're typing or when you select certain options that are isolated to one area of the panel.But I did notice some ghosting when switching between modes. This typically happened when I switched from keyboard mode to another mode, likely because keyboard mode was my primary mode so it remained on the E Ink panel for long periods of time before the panel needed to refresh. Thankfully, ghosting only lasted about three to five seconds after the panel refreshed.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}