{"id": "HBO calls Trump’s Game of Thrones-tinged tweet a “misappropriation” of trademark", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSam Machkovech\n    -  Nov 2, 2018 6:45 pm UTC\nFriday morning, President Trump used Twitter to issue a rare kind of foreign-policy announcement: a slogan lifted from a pop-culture meme, repurposed to vaguely suggest future political action. And it drew criticism from one significant party: HBO, who cited its \"trademark\" in disapproving of the president's choice of message delivery.That response came as a result of Trump using both a Game of Thrones-styled typeface (including its crossed-O design) and a co-opting of that series' popular \"Winter is coming\" motto. Trump's version twists the phrase to announce, \"sanctions are coming,\" which is an apparent call to reinstate economic sanctions against Iran that had been lifted in a landmark 2015 deal made by an international coalition.When we asked HBO for comment, the company offered a one-sentence statement: \"We were not aware of this messaging and would prefer our trademark not be misappropriated for political purposes.\"Shortly after we received HBO’s statement, the company's Twitter account offered another response:How do you say trademark misuse in Dothraki?— HBO (@HBO) November 2, 2018HBO's specific references to its \"trademark\" may imply some possible action, but while the media company is no stranger to issuing online takedown requests, its legal footing isn't necessarily clear in this case. HBO's filed trademarks for the TV series include the specific phrase \"Winter is coming\" and certain typeface tweaks, particularly bars and lines in and around the letters found in most official logos for both the show's name and that phrase. But one person's \"misappropriated\" trademark may very well be another person's fair use.In the past, Trump has wielded his own understanding of trademark law to request takedowns of Trump-related websites and merchandise.Beyond legal questions, there's also the Trump camp's potential misunderstanding of the HBO series' popular phrase. As New York Times TV critic James Poniewozik pointed out on Friday: \"Does anyone in the WH even watch Game of Thrones? In GoT, winter is a DISASTER. Nobody wants it! It's not a weapon. It's not, like: 'Get ready, sucker, I'm bringing some WINTER down on your ass!'\"You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}