{"id": "Rocket Lab now has a fully operational small satellite launcher", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Nov 12, 2018 5:18 pm UTC\nRocket Lab succeeded this weekend in moving from a company testing its rocket to one that has truly begun commercial operations. With the third flight of its Electron booster, the company delivered seven different satellites into orbit as part of its first fully commercial spaceflight.“The world is waking up to the new normal,\" the company's founder and chief executive, Peter Beck, said in a news release. \"With the Electron launch vehicle, rapid and reliable access to space is now a reality for small satellites. We’re thrilled to be leading the small satellite launch industry by reaching orbit a second time and deploying more payloads.\"The launch occurred at 4:50pm local time (03:50 UTC) on Sunday, from New Zealand’s Māhia Peninsula. The rocket's kick stage, named Curie, deployed six satellites for customers Spire Global, Tyvak Nano-Satellite Systems, Fleet Space Technologies, and the Irvine CubeSat Stem Program. The Curie third stage also carried a drag sail technology demonstrator, named NABEO, which will attempt to passively de-orbit inactive small satellites and reduce space junk.Rocket Lab has now flown the Electron booster, a small-satellite launcher, three times. The first test launch in May 2017 failed to reach orbit. However, in January 2018, a second mission did reach its intended orbit, carrying a couple of CubeSats and a payload inspired by Beck—Humanity's Star.Ten months have passed since that flight. While the company spent some of that time addressing issues with the Electron rocket, Beck told Ars that most of the company's work has been done to scale the company's operations. Rocket Lab has opened a second production facility in New Zealand (in addition to one in Southern California) this fall and recently announced a second launch site at Wallops Island, in Virginia.\"It’s one thing to have a couple of hot fires and do a couple of suborbital launches and whatnot,\" he said in October. \"For us, just going to orbit was a good milestone, but going to orbit once is just the start. The amount of effort that we’ve invested the last nine months, really, it's been just extraordinary.\"Now the company intends to attempt a final commercial launch this year, before setting an ambitious goal of 16 launches for the year 2019. The Electron vehicle has a payload capacity of 150kg to 225kg to a 500km Sun-synchronous orbit and costs about $6 million per launch.Listing image by Rocket LabYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}