{"id": "Ars on your lunch break: What happens when China curb-stomps your startup", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nRob Reid\n        -  Oct 24, 2018 4:00 pm UTC\nToday we’re presenting the second installment of my wide-ranging interview with Chris Anderson. He was Wired magazine’s editor-in-chief for 12 years and then started one of the most influential companies in the brief history of consumer drones. Part one ran yesterday. If you missed it, click right here. Otherwise, you can press play on the embedded audio player, or pull up the transcript, both of which are below.Anderson met a brilliant fellow maker named Jordi Muñoz through the online community of drone tinkerers. They became well-acquainted over the discussion forums, and he eventually invited Jordi to start a company with him. The startup was (and remains) 3D Robotics. Anderson had no idea that his cofounder was a Tijuana-based teenager—and it wouldn’t have bothered him in the slightest if he’d known.Though 3DR eventually raised major financing, it ran and grew for years from an initial investment of just $500 worth of parts that Anderson threw into it. Everything went great for a while. 3DR’s revenues eventually hit a $100 million annual run-rate—and then China stepped in. Targeting a $1,500 price point with a product that cost about $850 to make, 3DR found itself up against a comparable drone made by China’s DJI, which was retailing for $600.If you enjoy this installment and just can’t wait for part three (which will go up on Ars tomorrow), you can find it in my podcast feed, where it first appeared on October 3rd of last year. The full archive of my episodes can be found on my site, or right in your favorite podcast app by searching for the words “After On” (the podcast’s title). There you’ll find deep-dive interviews with other world-class thinkers, founders, and scientists—tackling subjects including robotics, cryptocurrency, astrophysics, genomics, synthetic biology, neuroscience, consciousness, privacy and government hacking, and a whole lot more.Finally, I’d like to briefly mention a series of four articles that I’m posting to Medium this month on the uplifting topic of existential risks. Which is to say, the grim yet perversely fascinating possibility that our technological creations might just annihilate us. I believe I present some arguments and analytic lenses that are new to this important topic, and the first piece in the series is right here.If you want to jump straight to my take on the ever-controversial topic of super AI risk (it’s fine to read the pieces out of sequence), that article is here. And if you’re seeking some truly sunny thoughts, don’t miss my maximalist take on what lone-wolf rampage murderers might achieve if our technology gets just a little bit more awesome.I should note that Medium is running this in their editorially curated, paid, members-only section. The goods news is that Medium gives everyone access to a few articles per month with essentially zero friction.This special edition of the Ars Technicast podcast can be accessed in the following places:iTunes:\nhttps://itunes.apple.com/us/podcast/the-ars-technicast/id522504024?mt=2 (Might take several hours after publication to appear.)RSS:\nhttp://arstechnica.libsyn.com/rssStitcher\nhttp://www.stitcher.com/podcast/ars-technicast/the-ars-technicastLibsyn:\nhttp://directory.libsyn.com/shows/view/id/arstechnicaYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}