{"id": "HP Elitebook x360 1030 review: Small tweaks made to a stylish work 2-in-1", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nValentina Palladino\n    -  Nov 16, 2018 5:10 pm UTC\nIt has been 10 years since HP launched the original Elitebook, and the company continues to improve upon this already stellar business notebook family. This year's Elitebook x360 1030 is the follow-up to last year's model and will replace the 1020 model in the Elitebook lineup.The new Elitebook has been sprinkled with updates that you'd expect in a convertible that didn't have many major problems: HP stuck a new processor inside, shrank some bezels, made the chassis' footprint smaller and lighter, added an LTE option, and improved the optional Active Pen. There were a few sub-par aspects about the previous model, so HP addressed them in this device, too. However, those improvements, while thoughtful, may not be crucial enough to push current Elitebook users to upgrade.HP changed little about the Elitebook x360's skeleton—it's still an all-aluminum convertible with a unibody chassis and slick, diamond-cut edges. It now has a 10 percent smaller footprint than the previous model, measuring 15.8mm thick and weighing 2.76 pounds, and the bezels around its 13.3-inch touchscreen are slimmer than ever before. The side bezels are 50 percent thinner, and the chin is 39 percent smaller, too.\nThe top bezel remains thick enough to include a new FHD webcam and an IR camera, both of which are important for business customers to have. However, HP didn't include a privacy shutter over the webcam. Numerous ultrabooks have embraced the privacy shutter or another way to disable the front-facing camera to give users more control over their privacy. But most ultrabooks that have both a webcam and an IR camera for Windows Hello don't include a shutter—I'm not surprised that HP left it out in the Elitebook x360, but it would have been a welcome feature, especially on a business-focused convertible like this.The screen comes in FHD (1920×1080) and UHD (3840×2160) options, with one of the FHD options equipped with HP's SureView technology. The integrated privacy screen makes it difficult for passersby to peer over your shoulder at your potentially sensitive work materials. While our review unit didn't have SureView, I've seen it in action and understand how it would be indispensable for professionals who are constantly traveling or working from unfamiliar locations.The two FHD display options can be equipped with HP's new anti-glare coating, making it easier to read in direct sunlight. Making this a standard feature would have been ideal, but some users rarely work outside or need such a feature on their display. Nevertheless, it will accompany the 400 nit and 700 nit brightness maximums of those panels well. The UHD panel is the only configuration without the option of anti-glare coating, and that panel reaches up to 500 nits of brightness.The diamond-cut edges point to a more refined design than the previous model. The new angled hinges that connect the lid to the chassis do, too, as do the honeycomb speaker grilles on either side of the keyboard. HP included both top and bottom firing on this model, which should emit sound well regardless of the position of the convertible.These small changes bring even more Spectre-chic to the Elitebook line without being garish. HP also designed the device to pass MIL-STD 801G stress tests (drop, vibration, shock, temperature, dust, and others), making it both attractive and strong in the face of harsh environments and accidental drops.The build quality of this Elitebook matches that of last year's model. Most of the design changes only result in noticeable aesthetic differences, rather than changes felt in the sturdiness of the machine. The bump in MIL-STD certification is a nice touch, but most users will likely appreciate that HP built a machine that's both relatively thin and light and also has an overall solid design that doesn't give under pressure.The selection of ports on the new Elitebook x360 changed a bit: now, it includes two Thunderbolt 3 ports, one USB-A 3.1 Gen 1 port, one HDMI port, one nano SIM slot (only on some models), one audio-combo jack, and one lock slot. Gone are the extra USB-A port, the microSD card reader, the smart card reader, and HP's proprietary charging port. Nixing the last of those is a welcome change—there's no reason to take up space with a proprietary charging port when a USB-C/Thunderbolt 3 port charges the device and does more in terms of data transfer and peripheral connectivity.Some will be frustrated by the other ports that weren't included. However, I'm happy that HP kept one of the two Type-A ports, because not all users (and their workplaces) have made the switch to USB-C yet. MicroSD card slots certainly aren't obsolete, but the new nano SIM slot is more important for HP's vision for this device. Much like the new Spectre x360 and the Acer Swift 7, LTE connectivity is becoming a popular optional feature on ultrabooks like these. It allows professionals to get online anywhere there's decent cellular service, and it lessens their dependence on public Wi-Fi (which poses security risks for those working with sensitive information). Optional LTE may be the new feature that persuades existing Elitebook users to consider this upgrade, and it will put the Elitebook x360 on the radars of new customers who need LTE in their next laptop.The keyboard on the new Elitebook x360 is just as good as the one on last year's model, which is to say it's fantastic. I'd say these keyboards are second only to Lenovo's keyboards on devices like the ThinkPad X1 Carbon. Typing on the Elitebook x360 was comfortable and easy, and I like that you can hear the chiclet keys as you type, but they emit a subdued, softer sound than other keys. I also like the full Fn row of keys at the top of the keyboard, even if many of those keys are geared toward professional programs that I don't use much, like the default Windows calendar or Skype.Below the keyboard are the Precision trackpad and the fingerprint reader, both of which were present on the previous Elitebook model. Not much has changed with either: the trackpad is still responsive and great for Windows-specific gestures, while the fingerprint reader complements the IR camera to give users two Windows Hello biometric authentication options.While the optional Active Pen looks identical to the previous one, it has a few important improvements. For one, the Pen recharges via a USB-C port hidden underneath a flap of gray silicone near its top. That's much better than the previous model, which used a AAAA battery for power. Considering the Elitebook x360 charges via USB-C itself, users can charge both the convertible and its pen using the same cable.I'm not crazy about the fact that the Active Pen costs extra and doesn't come with the Elitebook x360—unless there's something unique or spectacular about it, I think convertibles should come with their pens because inking abilities are some of the biggest selling points about such devices. HP's Active Pen is a solid stylus that shows little (if any) latency in multiple sketching apps, and it's even more pressure sensitive than the previous pen. It also responds well to tilted input, making shading and nuanced sketching easy.But creatives are the users who demand such features, and there are a bunch of strong competitors in the convertible and detachable space that may appeal to creatives more than the Elitebook x360—some of which include a stylus in their prices. Those who only need standard inking abilities could go with a device like the $1,299 Lenovo C930 two-in-one, which includes a basic stylus that lives in its chassis.HP came up with a clever way to keep its Active Pen alongside the Elitebook x360 at all times: it attaches magnetically to three of the four sides of the convertible's chassis (it doesn't attach to the back edge, near the hinge, for obvious reasons). All of its three buttons can be customized in the Pen Settings to open various ink-friendly programs like SketchPad, Ink Workstation, and others. Quick actions like going home or launching a specific app can also be assigned to any of the buttons.HP's radial menu, a circle that appears on the screen with additional quick actions that you can initiate via touch or Pen input, is quite useful when you're primarily using the Active Pen. By assigning one of the Pen's buttons to open the radial menu, you essentially get a bunch of actions that you can quickly perform when the keyboard isn't accessible, such as pausing/playing music, adjusting the volume, and taking a scribble-ready screenshot. It's similar to Samsung's Air Command, which is one of my favorite pieces of software that's unique to Samsung devices like the Notebook 9 Pen—now, HP has an equivalent.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}