{"id": "“Wolf’s jaw” star cluster may have inspired parts of Ragnarök myth", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Nov 16, 2018 12:55 pm UTC\nIn Norse mythology, Ragnarök is a cataclysmic series of events leading to the death of Odin and his fellow Asgardian gods and, ultimately, to the end of the world. Some iconographic details of this mythical apocalypse that emerged around 1000 AD may have been influenced by astronomical events—notably comets and total eclipses.This is not to say that the myth of Ragnarök originated with such events; rather, they reinforced mythologies that already existed in the popular imagination. That's the central thesis of Johnni Langer, a historian specializing in Old Norse mythology and literature at the Federal University of Paraíba in Brazil. He has outlined his argument in detail in a recent paper (translated from the original Portuguese) in the journal Archeoastronomy and Ancient Technologies.Langer's analysis is based on the relatively young field of archeoastronomy: the cultural study of myths, oral narratives, iconographic sources, and other forms of ancient beliefs, with the aim of identifying possible connections with historical observations in astronomy. Both total eclipses and the passage of large comets were theoretically visible in medieval Scandinavia, and there are corresponding direct records of such events in Anglo-Saxon and German chronicles from around the same time period. These could have had a cultural influence on evolving Norse mythology, including the concept of Ragnarök.It's admittedly a bit speculative. But Langer has identified several comets and eclipses in the eighth and ninth centuries that he believes may have fanned the flames of apocalyptic fears in the populace, culminating in an explosion of literary and visual references to Ragnarök in the 10th century.Described in several Norse sources (primarily Snorri Sturluson's 13th century Prose Edda), Ragnarök begins with a brutal winter lasting three times longer than usual, driving mankind to lawless desperation. The stars disappear, and the giant wolf, Fenrir, breaks free of his chains and devours everything in his path. A gigantic sea-dwelling serpent named Jormungand rises, and the trickster god Loki leads an army of giants into battle against Odin and the other gods at Asgard. The gods perish, and whatever remains of the world sinks into the sea.The late English antiquarian Hilda Ellis Davidson suggested that some elements of Ragnarok—the Sun turned to black, flames shooting toward the sky—could have been inspired by the eruption of volcanos in Iceland. Icelandic volcanic eruptions may also have inspired the figure of the fire demon Surtr. (For Marvel fans, he's the one who holds Thor captive at the start of Thor: Ragnarok and threatens to bring on the apocalypse by tossing his crown into the Eternal Flame in Odin's vault.)Many scholars believe that astronomical events were influential to mythologies of many different cultures, and there is some evidence that this was true for the Scandinavians as well, according to Langer. The Hyades cluster, roughly 153 lightyears from the Sun in the constellation Taurus, is central to his argument. Its five brightest stars form a \"V\" shape within the cluster. In Greek mythology, they represented the five daughters of Atlas, transformed into stars after the death of their beloved brother Hyas.But in Norse mythology, the Hyades cluster was known as Ulf's Keptr, or the \"wolf's jaw.\" It is likely associated with Fenrir or perhaps the wolves Skoll and Hati, who are said to have chased the Sun and Moon since the dawn of time. At Ragnarök, they finally catch their prey, bringing on darkness—a detail that may have been influenced by solar and lunar eclipses. The total solar eclipses of 755, 840, and 885 AD in particular would have seemed to medieval Scandinavians like a wolf swallowing the Sun.Similarly, a comet or meteor streaking across the sky might have looked very snakelike to superstitious Norsemen, who likely would have viewed them as manifestations of Jormungand. There is no direct mention of comets in the Eddas and old Icelandic sagas, but there are records in England, France, and Germany of the 837, 912, and 1066 Halley's comet appearances (as well as the Great Comet of 891 AD). Langer therefore reasoned the events would also be visible over Scandinavia. He ran computer simulations of the passage of comets through the Hyades, as viewed from what is now Stockholm, and concluded this was indeed the case.\"A convincing astronomical explanation of Ragnarök would be of interest,\" says Donald Olson, an astronomer at Texas State University known as the \"Celestial Sleuth\" for his work in so-called \"forensic astronomy.\" Olson has found evidence that the Moon may have contributed to the sinking of the Titanic, helped identify the precise location of Julius Caesar’s landing site in Britain in 55 BC, and showed that Mary Shelley was probably telling the truth about a moonlit “waking dream” that inspired Frankenstein. But he thinks Langer's argument falls short of being truly convincing.Ideally, says Olson, Langer would have cited primary Scandinavian sources of astronomical observations at the time before and near 1000 AD. Instead, he cites English and German chronicles, along with direct astronomical observations in England. Primary contemporary sources would indeed be ideal, but Langer said that there are none; he opted for the next best thing.There are also a few astronomical errors in the paper, according to Olson. For instance, the paper mentions Aldebaran as belonging to the Hyades cluster. Aldebaran is actually much closer to Earth and not part of the cluster at all. It just seems to be because it lies along the same line of sight as the major stars in the Hyades. This turns out to be an error in translation from the original Portuguese into English. \"But this does not interfere with the results, since for the visual observation of the ancient peoples, the star Aldebaran was part of the Hyades,\" Langer says.Also, Langer maintains that the position of the Moon during the lunar eclipse of December 25, 828 AD (coinciding with the winter solstice) was close to the Hyades. Olson's own computer calculations indicate the Moon was more than 45 degrees from the cluster, which he does not consider especially close.Olson also had difficulty reproducing some of the figures shown in Langer's simulations. He believes this might be due to a beginner's error. When he opened the program, Langer may have changed the location from Brazil to the region of interest without changing the time zone. His own students have been known to do this, getting \"very strange results for van Gogh's sky in France, as expressed in the time zone of Texas,\" says Olson. \"Errors like these reduce the confidence that Langer has made a significant breakthrough with his astronomical analysis.\"There's no doubt a clash of academic cultures here—archaeoastronomy places more emphasis on social and cultural evidence and interpretations, whereas astronomy is all about precise data. But addressing Olson's concerns would go a long way toward strengthening Langer's case. It's nonetheless an interesting paper, and Langer hopes it will inspire other scholars to explore the intersection of astronomy with myth, religion, and the popular imagination.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}