{"id": "Review: Intel’s 9th Gen Core i9 9900K processor hits 5GHz—just at a price", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nRichard Baguley\n        -  Nov 17, 2018 1:00 pm UTC\nLet's be honest here: modern processors aren’t exciting. Speed bumps no longer thrill us, and we’ve become blasé about adding more cores. But we are living in a time when computers casually offer amounts of processing power that would have made previous generations swoon.It’s also a competitive time, primarily with two companies fighting for your silicon spending and giving you great computing bang for your buck. On one side we have Intel, the 800-pound gorilla of the processor world. On the other side, we have AMD, the upstart that occasionally steals the crown by doing something unexpected that changes the rules.The $580 Intel 9th Gen Core i9 9900K is Intel's play for the processor socket of gamers. It’s the top model in the S-series, built for speed with eight cores. With hyperthreading (which splits the work on a single core into two parts), that is doubled to 16 threads, each of which can crunch away at a different task. There are two other chips in this series, the 8-core 3.6GHz $410 i7-9700K and the 6-core 3.7GHz $280 i5-9600K. These are similar, but they eschew hyperthreading, a technology that seems to be falling out of favor at Intel as the number of real processor cores on their consumer processors rises and the company looks for ways to justify the price of premium models. While this new Intel offering does increase your speed based on our testing, it'll cost you.\nSo what’s this 9th generation stuff about? Intel is a little vague on the concept, and the i9 9900K does not feature any new manufacturing technology. It uses the same 14nm manufacturing process that the 8th generation chips used, as Intel is reportedly struggling with making chips in quantity with a new 10nm process that would make company chips faster and more efficient. Nor does the Core i9 9900K feature any new architecture: it uses the same Coffee Lake architecture as the older 8th generation.What the 9th gen stuff means is that this is a slightly new spin on the same fundamental processor, just with some speed bumps and internal changes that make it more flexible. While most of these changes are somewhat arcane, there are a couple worth noting—particularly improved turbo performance and a new way of getting the heat of the processor away.The 8th gen processors introduced turbo mode, in which one of the processor cores could be given a speed bump that gave it an extra edge. The 8th gen i7-8086K could bump a single core of the six it had to 5GHz, for instance. The 9th gen makes this a bit more flexible; while it comes with a standard clock speed of 3.6Ghz, the i9-9900K can bump one processor core to 5GHz, four cores to 4.8GHz, and all eight to 4.6GHz. If a big task is running on one core, that one kicks up to 5GHz, while the others slow down to minimize the heat output.That scenario seldom happens outside of synthetic benchmarks, though—most modern programs are written to be multi-threaded, meaning they can run on several different cores at the same time. So in practice you will seldom see the 5GHz speed kick in. Instead, you will most often see this processor running at 4.8 and 4.6GHz multi-core speeds, with each core constantly in flux as tasks kick off and finish. All of this aggressive clock management is designed to do one thing: keep the amount of energy (and thus the heat the processor emits) down.That brings us to the second major 9th gen enhancement: STIM. Intel has added a feature called the Solder Thermal Interface Material (STIM), a layer of metal on top of the actual silicon chip that conducts heat away. This, the theory goes, conducts heat better than the thermal glue that Intel used on previous processors under the metal heat spreader that covers and protects the chip. Some overclockers, frustrated by their inability to cool Intel chips, had tried a somewhat perilous technique called delidding that involves removing the metal heat spreader that protects the processor, removing the thermal conductor, and attaching a heatsink directly to the chip. Intel claims that STIM will eliminate the necessity for this, but we found the feature was not as effective as many had hoped. In testing, this is a hot little chip that needs a lot of cooling to work effectively.Listing image by Richard BaguleyYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}