{"id": "Waymo gets green light from California DMV: AVs in some cities are ok", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Oct 30, 2018 10:36 pm UTC\nWaymo and the California Department of Motor Vehicles announced Tuesday that the Golden State had approved a permit for the self-driving-car company to drive in a handful of Silicon Valley cities.Those cities include Palo Alto, Los Altos, Los Altos Hills, Sunnyvale, and Alphabet's home city of Mountain View.Waymo, which was formerly a division of Alphabet subsidiary Google, has been allowed under state law to operate autonomous cars since 2014. The new permit, the DMV says, \"allows the company to test a fleet of about three dozen test vehicles without drivers behind the wheel.\"While Waymo is the first such company to get this type of permit, the DMV also noted that 60 manufacturers have licenses that allow them to operate with \"safety drivers.\"According to the company, its permit allows \"day and night testing on city streets, rural roads, and highways with posted speed limits of up to 65 miles per hour.\"\"If a Waymo vehicle comes across a situation it doesn't understand, it does what any good driver would do: comes to a safe stop until it does understand how to proceed,\" Waymo continued in a press release. \"For our cars, that means following well-established protocols, which include contacting Waymo fleet and rider support for help in resolving the issue.\"If you see or interact with a driverless car in Silicon Valley or elsewhere, we'd love to know. Email timothy.lee@arstechnica.com (based in Washington, DC), or cyrus.farivar@arstechnica.com (based in Oakland).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}