{"id": "NASA is about to turn off the Kepler spacecraft, and it will drift away", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Oct 30, 2018 8:48 pm UTC\nAfter more than nine years in operation, the Kepler Space Telescope has run out of hydrazine fuel. Mission managers will now send a command to the spacecraft, which is presently trailing Earth in a heliocentric orbit about 150 million kilometers away, to turn off the spacecraft's transmitters. It will be cast adrift into the silent blackness of space.But though the spacecraft's effective mission will end, it will live on in troves of data that scientists have yet to process. Already, during its lifetime, the spacecraft has found 2,681 confirmed planets and an additional 2,899 candidate planets that require follow-up confirmation from ground-based telescopes. Those numbers were current as of Monday evening.Kepler can safely be counted as one of the most transformative missions that NASA has ever sent into space. Prior to its launch, astronomers knew planets existed around other stars, but their knowledge beyond that was fuzzy. Now, astronomers have a wealth of information. \"Because of Kepler, what we think about our place in the universe has changed,\" Paul Hertz, Astrophysics Division director at NASA Headquarters, said Tuesday during a conference call with reporters.For example, astronomers now know that many more planets exist in the Milky Way than the billions of stars out there and that these worlds are considerably more diverse than the eight planets in our own Solar System. Astronomers have found everything from small rocky planets to huge Jovian-like worlds. They've also discovered a new class of planets dubbed \"Super Earths\" that are larger than Earth but smaller than Neptune.Moreover, astronomers have found that planetary systems around other stars come in an extraordinary variety of configurations, from large gas giants orbiting around their stars within a few days to clusters of small, rocky planets packed into tight orbits near their stars.During Tuesday's call, the now-retired principal investigator of the Kepler mission, Bill Borucki, was asked what his favorite find was. He quickly cited Kepler-22b, a planet identified in 2011 with a radius 2.4 times the Earth's that orbits on the inner edge of the habitable zone for life as we understand it.Subsequent observations have revealed that this world is very likely entirely covered in water and may have a water-vapor atmosphere. Such an ocean world, he mused, would be an incredible place to search for life. Alas, 22b is 600 light years away.Now, in the considerable wake of Kepler, NASA is pressing ahead. With the Transiting Exoplanet Survey Satellite, launched in April, the space agency is already finding planets orbiting some 200,000 of the brightest and nearest stars to the Earth. These worlds may potentially be explored for signs of life by the James Webb Space Telescope. This instrument, due to launch in 2021, may have the capability to study the atmospheres of worlds within tens of light years of Earth.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}