{"id": "Power sector CO2 emissions are lower than they have been since 1987", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nMegan Geuss\n    -  Oct 30, 2018 1:00 pm UTC\nA bit of moderately good news this morning: carbon dioxide (CO2) emissions from the US electricity sector decreased by 28 percent between 2005 and 2017, according to data from the Energy Information Administration (EIA).Turning back to the electricity sector, though, the EIA looked at energy demand in 2005 and projected how it might have grown out to 2017 if everything had stayed the same over those 12 years. In the prior period—between 1996 and 2005—electricity demand was growing at nearly two percent per year, causing a steady rise in emissions. If that growth trend had continued out to 2017 and no other changes to the carbon-intensity of the energy mix had been made, the electricity sector would be emitting more than 620 million metric tons of CO2 than it was in 2005.Instead, electricity demand shrank at an average rate of -0.1 percent per year between 2005 and 2017. A lot of that likely comes from the economic recession that the US experienced in 2008, but some of that might also come from more energy-efficient technology. The EIA doesn't distinguish between the causes of demand reduction.The good news is, even if some of the last decade's CO2 reductions came from the kind of event we don't want to repeat (a recession) the US electricity sector did manage to make some inroad on carbon emissions through more productive means. In the last several years, the price of natural gas has dramatically decreased, allowing power companies to close more polluting coal plants in favor of relatively cleaner natural gas plants. This shift has offset 329 million metric tons of CO2, according to the EIA.Also, state renewable mandates and falling wind and solar costs have also cleaned up the power sector's emissions profile. Adding non-carbon-emitting sources of energy to the grid has reduced CO2 emissions by 316 million metric tons compared to 2005—almost as much as switching from coal to natural gas.The result? the power sector emitted 1,744 million metric tons of CO2 in 2017, down from 2,416 million metric tons in 2005. The 2017 number is equivalent to the amount of CO2 the electricity sector was emitting in 1987. And if there's one thing to feel nostalgic about from the 1980's, low CO2 emissions is probably at the top of everyone's list.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}