{"id": "Winklevoss twins claim famed crypto evangelist stole 5,000 bitcoins from them", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Nov 4, 2018 2:00 pm UTC\nShrem was released from prison in 2016 after he was convicted for aiding and abetting an unlicensed money-transfer business—sending $1 million in bitcoins that ended up on the notorious drug website, Silk Road.According to the new lawsuit—which was filed in federal court in Manhattan in September 2018 and only recently unsealed—Winklevoss Capital Fund (WCF) hired Shrem in late 2012 to purchase bitcoins on its behalf.However, WCF alleges that, of the $250,000 sent to Shrem in the fall of 2012 for this purpose, only $189,000 was accounted for. The company now claims that Shrem pocketed the difference ($61,000) to \"purchase 5,000 bitcoin for himself.\"The investment firm is asking for the 5,000 bitcoins back, which at present exchange rates would be worth over $31.3 million. The case was first reported by The New York Times on Friday.Cameron Winklevoss noticed this error within months and emailed Shrem on February 19, 2013, to provide a fully accurate accounting of how he had spent their money:\"I have been patient and at this point it's getting a bit absurd,\" he wrote. \"I will have no choice but to take measures to get this done if you don't start giving me a firm answer as to when you will complete this work.\"It is not clear why Winklevoss waited until over five years later to bring a lawsuit.In any case, citing blockchain analysis, WCF said in the lawsuit that the analysis can definitively show that Shrem soon took those 5,000 bitcoins and transferred them to a vanity wallet address that contained the string \"1Shrem.\"Another court filing notes that:Shrem has been on a steadily increasing buying spree since July of last year, paying cash for more than $4 million in real estate in and around Sarasota, Florida, (ii) two Maseratis, and two power boats. Most of these assets were acquired in just the last six months, including a $2.25 million property purchased on July 27, 2018; a $370,000 property purchased on June 19, 2018; two properties worth a combined $825,000 in March 2018; and one Maserati in July 2018.Shrem did not respond to Ars' request for comment. His lawyer, Brian Klein, declined to respond to Ars' questions.\"The lawsuit erroneously alleges that, about six years ago, Charlie essentially misappropriated thousands of bitcoins,\" Klein emailed Ars in a statement. \"Nothing could be further from the truth. Charlie plans to vigorously defend himself and quickly clear his name.\"Klein, a well-known criminal defense attorney, also represents Marcus Hutchins (aka MalwareTech), who is currently being prosecuted in Wisconsin.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}