{"id": "Tinkerers, repair shops will have mixed feelings about this iPad Pro teardown", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nValentina Palladino\n    -  Nov 12, 2018 6:30 pm UTC\nFollowing the controlled destruction of the Mac mini and the MacBook Air, iFixit turned its gaze to the new 11-inch iPad Pro. Its teardown reveals lots of adhesive, even more magnets, and only a few surprises inside the newest Apple tablet.Unsurprisingly, the super-narrow bezels make the new iPad Pro harder to get into than the previous models. Awkwardly positioned display ribbons make removing the display more difficult, but underneath it we find the usual suspects: the logic board, speakers, TrueDepth camera array, and batteries, to name a few components.The new iPad Pro should be an entertainment powerhouse thanks to a total of eight speakers, composed of four woofers and four tweeters. Combine those with the Liquid Retina display with a 120Hz refresh rate, and you have a stellar music and video consumption device. However, the speakers proved impossible to remove without destroying a portion of them, thanks to their housings being carved into the aluminum case. Magnets also live under the speakers, and those are just a fraction of the magnets present inside the iPad Pro.iFixit notes that the TrueDepth array—made up of the dot projector, ambient light sensor, IR camera, and other sensors—looks similar to the one inside the newest iPhones but has a \"slightly modified form factor.\" The report didn't elaborate on this, so we still don't know what Apple had to do to make Face ID possible in both landscape and portrait mode on this tablet. It's still possible that such a feature could make its way to forthcoming iPhones (current iPhone X, XS and XS Max, and XR models can only use Face ID in portrait mode), but it's still unclear how difficult it will be for Apple to do so.Apple brought back pull tabs to support the two battery cells inside the iPad Pro. These should make the batteries easier to remove, but unfortunately the batteries are also secured with an adhesive that eliminates any ease of removal brought back by the pull tabs. Adhesive also secures the logic board and the speakers, making it difficult to safely remove most of the device's crucial components. Notably, the iPad Pro actually contains a slightly smaller battery than the old 10.5-inch model: it's a 29.45Wh cell, down from the previous 30.8Wh cell.One upside is that the new USB-C port is fully modular and independent from the main board, unlike the Lightning port that came before it on previous models. That means it can be more easily replaced, which is a great perk to have in a component that inevitably sees a lot of wear. The iPad Pro is the first iOS device to ditch Apple's Lightning port. While that's ideal for future-proofing and embracing more modern ports, it will likely frustrate those who are entrenched in the Apple ecosystem and have numerous Lightning cables that they could have used to charge the new iPad Pro.iFixit also pried its way into the new Apple Pencil, which is much harder to get into than even the iPad Pro. The internals are much like the previous Pencil model, save for the new wireless charging components. Also, Apple appears to have included a capacitive grid inside the new Pencil, which could signal more complex gestures coming in the future.The new Apple Pencil attaches magnetically to one edge of the new iPad Pros, allowing it to charge using the iPad Pro's battery and stick close to the device with which it will be used. Unlike the old Apple Pencil, it doesn't need to connect to the tablet's USB-C port in order to charge or pair with the device. However, the replaceable tips represent the only common ground between the old and new Apple Pencils—old Apple Pencils won't work with the new iPad Pros, so you'll have to invest another $129 in the new Pencil if you need it.iFixit gave the iPad Pro and its Apple Pencil a repairability score of three. Check out the full teardown for more details.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}