{"id": "Diablo III leads our list of older games born anew on Nintendo Switch", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSam Machkovech\n    -  Nov 2, 2018 4:00 pm UTC\nIf you're interested in a review of Diablo III: Eternal Edition for the Nintendo Switch, here's a quick one. The new version, out on Friday for $59.99, is still Diablo III. The game's existing versions on PC and console are nearly identical to this new Switch port, and that's great news.Over the past few years, Blizzard climbed quite the corpse-laden mountain to get this dungeon-crawling game past its troubled 2012 launch. The worst we could say last year, upon the launch of a $15 DLC expansion, was that the core of Diablo III had already improved tremendously for all existing players—and thus rendered the paid Necromancer pack a bit moot.So on Nintendo Switch, everything about Diablo III, from its basic loot-driven combat to its expansive, \"seasons\"-driven endgame, is the same. (Every DLC add-on and free patch from the console and PC versions arrives here intact.) Yet, it's also born anew on this platform. Diablo III truly is the ultimate kind of game to work on Nintendo's hybrid console. It works as well for satisfying, quick-burst combat as it does marathon bed-battle sessions.Plus, obviously, Diablo III's core engine was designed for computers made in 2012. This is a portable, power-sipping 3D system, after all, and that lower-powered target matters both in keeping frame rates locked to a crisp, 60 frames-per-second refresh and in making sure frantic combat always looks and feels smooth for intrepid adventurers.Those qualities got us thinking about an obnoxious Nintendo Switch reality. Ahead of its two-year anniversary, the home-portable hybrid system has now seen a bunch of older games come back to life as perfect Switch fodder... but many of them are now lost in the Nintendo eShop's hideous interface. Thus, we're using Diablo III's Switch port as an excuse to talk about one beloved category on the system: ports of games that came out before the Switch existed.The above video rattles through personal favorites that fit this criteria, and my chosen games nail two other important aspects: they emphasize the Switch difference, and their graphical performance fits neatly into the Switch's limitations. Does the game in question run smoothly? Does it look good on a small screen? And might its action stand out neatly while propped up in \"tablet\" mode on a bar?As such, your personal favorite \"oldie but Switchie\" may not have made our cut, but we'd still appreciate your thoughts below on the best older games born anew on Switch—along with your votes for other older games you'd love to see come back with Switch's boons (and limits) in mind.Listing image by Blizzard EntertainmentYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}