{"id": "Weird water phase “ice-VII” can grow as fast as 1,000 miles per hour", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Oct 24, 2018 12:49 pm UTC\nKurt Vonnegut's 1963 novel Cat's Cradle introduced the world to so-called \"Ice Nine,\" a fictional form of water that freezes at room temperature. If it so much as touches a drop of regular water, that will freeze, too, and so on, spreading so rapidly that it freezes everything that comes into contact with it.Fortunately for Earth, Ice-Nine doesn't exist. But there is an exotic form of ice dubbed \"ice VII\" that physicists can create in the laboratory. It's harmless in terrestrial conditions. But on an ocean world like Jupiter's moon, Europa, it could behave just like Ice-Nine under the right conditions, freezing an entire world within hours—with some key implications for the possibility of finding life on distant exoplanets. Now we know more about just how that special freezing process occurs, according to a recent paper in Physical Review Letters.It's the shape formed by the water molecules that determine which phase of ice you get. That ice in your glass of whiskey is technically ice Ih—\"h\" for hexagon, since that's the shape that all the oxygen atoms line up in during freezing. But in theory, there should be at least 17 different crystalline phases of water—which one you get depends on the pressure and temperature of any given environment.Ice Ih will turn into ice-II if you apply enough pressure, with oxygen atoms arranged in a rhomboid shape.  Keep increasing the pressure and you'll get ice-III, ice-IV, ice-V, ice-VI and so on. Some form of ice is theoretically possible even at crazy-high temperatures of hundreds of degrees Celsius, provided the pressure is high enough.Ice-VII's oxygen atoms are arranged in a cubic shape, something that only occurs at pressures more than 10,000 times that on Earth's surface. It's created in the lab by zapping thin samples of water sandwiched between plates with high-intensity shock waves or laser pulses. In 2017, Stanford University physicists captured the formation of ice VII (in just six nanoseconds) on film for the very first time.And earlier this year, Science reported the surprising discovery of naturally occurring ice-VII lurking in diamonds mined from deep in Earth's mantle. Temperatures are high there, and so is the pressure; that's how diamonds form in the first place. Those are not ideal conditions for ice-VII, but it doesn't actually form there. If water bubbles get trapped in diamonds as they form (in pockets called inclusions), that water is exposed to cooler temperatures as it gradually moves up to the surface, while still being subjected to high pressures.That's how you can get pockets of ice-VII trapped in diamonds. \"Water in diamonds is not unknown, but finding this very high pressure form of water ice intact, that was really fortuitous,\" co-author George Rossman, a mineralogist at Caltech, told the Los Angeles Times.In this latest paper, physicists at Lawrence Livermore National Laboratory (LLNL) have devised a new mathematical model, based on the idea of nucleation. Nucleation is what happens at the very beginning of the freezing process, when a few water molecules start to arrange themselves into a solid molecular structure. That forms tiny ice crystals. Get the conditions just right, and those crystals will get bigger and combine with their neighbors, spreading until all the water in a given sample is frozen.It turns out that even if the pressure seems to be sufficiently high for ice-VII to form, if it's not above a very specific threshold, the nucleation will spread inward toward the sample's center. Cross that threshold, however, and you get a rapid phase transition as the nucleation spreads throughout the entire sample, so the ice forms and spreads very quickly—an \"Ice-Nine\" scenario. The nascent ice crystal and the surrounding water must be at different temperatures for this rapid freezing rate to occur.\"Our work shows that ice-VII forms in a very unusual way—by popping into existence in tiny clusters of about 100 molecules and then growing extremely fast, at over 1,000 miles per hour,\" co-author Jonathan Belof told Physics Buzz. These might just be the kinds of conditions that exist on so-called \"ocean worlds\": bodies that, like Earth, have an abundance of water. \"Water on the ocean worlds, under bombardment from other planetary bodies such as meteors or comets, undergoes intense changes for which life might not survive,\" he says.The shock waves from those explosions would be sufficient to compress any water to just the right high pressure to make it freeze into ice-VII at sufficient depths (several hundreds of kilometers). And if that ice-VII spreads rapidly to the surface, it could spell doom for any life on said exoplanet. \"Our aim is to find out as much as possible about [ice-VII] so that we can figure out if these planets really can support life, and what the limits of habitability might be,\" says Belof.DOI: Physical Review Letters, 2018. 10.1103/PhysRevLett.121.155701  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}