{"id": "Being a morning person might have some health advantages", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCathleen O'Grady\n    -  Nov 12, 2018 10:00 pm UTC\nA paper presented at the National Cancer Research Institute this week has made for some flashy headlines, like this confident declaration from India’s Economic Times: “Ladies, check your alarm: Waking up early may cut breast-cancer risk.” But most headlines have been appropriately measured and wordy, like The Independent’s “Women who prefer to wake up early have lower risk of breast cancer than night owls.”In amidst the largely cautious coverage is a truckload of confusion over the details. Some reports frame the paper’s findings as being about preference (preferring to wake up early or stay up late) while others frame them as being about behavior (actually waking up earlier, regardless of preference). Some hold questions of cause and effect at arm’s length, while others dive right in with claims about sleep habits causing cancer.And what’s the data that was used by the National Cancer Research Institute? Health News Review, in its critique of media coverage of the research, reports that researchers examined “self-reported responses” about being a morning person, but genetic data came into the mix, too.Between the paper, the press release, and the news, plenty of important details have started to blur. That’s because the research itself is complex and multi-faceted: it used a variety of different sources of data and found fairly robust evidence of a small but meaningful link between sleep and breast cancer, but the results don’t translate into easy take-home advice.The research itself comes from a paper titled “Investigating causal relationships between sleep traits and risk of breast cancer” that had been made available online before it was submitted to a peer-reviewed journal—a polished draft called a preprint. This means it “has not gone through any formal peer-review process,” said Dipender Gill, a clinical research fellow at Imperial College London, but “the standard is generally close to that of a peer-reviewed publication.” The preprint is still essentially a robust piece of scientific work, but things will likely change before it is published in its final form.Lead author Rebecca Richmond and her colleagues used genetic data, questionnaire results, and health records from nearly 400,000 women, conducting a variety of different statistical tests to explore the link between sleep and cancer. Some of those tests used women’s self-reported preferences on whether they considered themselves “morning people” or “evening people,\" as well as data on how long they slept every day and how often they suffered insomnia. But the researchers also used genetic data, focusing on variants that have been linked to “chronotype”—the tendency to be a night owl or morning lark—and influence sleep duration and insomnia.The results showed that morning larks had a lower incidence of breast cancer. Based on the results, you could estimate that, out of 100 night owls, approximately two people would have breast cancer, compared to one person out of 100 morning fans. There was also some evidence that sleeping for longer was linked to a higher cancer risk, but this was more inconsistent across the different tests.The skeptical reader’s cries of “correlation isn’t causation!” notwithstanding, Richmond and colleagues were explicitly asking a causal question: does sleep affect breast cancer? In a short explainer video, Richmond’s co-author, George Davey Smith, explains how the technique they used, called Mendelian randomization, is designed to answer causal questions about disease. It does so by looking at different versions of a gene that have been linked to some kind of health risk factor.For example, “smokers who carry one version of a gene... tend to smoke less heavily than those who carry a different version [of the same gene],” Dr. Smith explains. The gene variant itself isn’t linked to shorter life spans in non-smokers, but smokers who carry the heavy-smoking version have higher rates of smoking-related diseases. So, their higher rate of smoking will be causing the higher rate of disease.The logic is that genes can’t be affected by lifestyle factors or other complications: they’re at the very start of the causal chain, present from the second a person is conceived. Linking the gene to the risk factor makes it possible to link the risk factor to the disease in a way that doesn't get confused by other possible influences (like smokers eating less-healthy diets).That’s the concept, at least—the world isn’t quite so tidy. Mendelian randomization can point more strongly at causality than other methods, but it isn’t incontrovertible evidence. A big problem is whether the genes in question might be associated with other factors that influence the disease. For example, what if the genes linked to chronotype are also linked to BMI and exercise levels? Or what if the chronotype genes themselves are in some way implicated in higher cancer risks?“In such a scenario,” says Gill, “sleep patterns may be associated with risk of breast cancer but not directly cause it.”Research that explicitly sets out to answer a causal question but doesn’t quite get there leaves room for a lot of confusion, especially when the press release drums home causal claims. But the other major source of confusion—is this about behavior or preference?—is one that has the researchers scratching their heads, too. It’s not clear, they write, “whether it is the actual behavior which poses the health risk or the preference to morning versus evening.”That is, it might be the case that getting up early, regardless of how awful it feels for you, could slightly reduce your risk of breast cancer. But it could also be the case that the risk factor comes from being born a night owl, and getting up early will achieve nothing other than making you (and everyone around you) more miserable.Mornings might be more important than evenings, anyway: the researchers lay out some possible reasons for the link between sleep and cancer, and they center around exposure to light at night. Understanding how our brightly lit lives affect our health is an important direction for research to take, especially when it comes to understanding the link between shift work, disrupted sleep, and disease.There’s just no take-home message here yet. The study is “informative and interesting,” says Gill. But “people should not be changing their sleep patterns based on the evidence presented here.”You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}