{"id": "How leaky is natural gas production? One puzzle solved", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nScott K. Johnson\n    -  Nov 2, 2018 11:30 am UTC\nIn the US, the effort to slash the CO2 emissions of our electrical grid has actually gotten an early bump from the low price of natural gas. New natural gas plants can produce electricity with about half the emissions of the older, dirtier (and now more expensive) coal plants they’re replacing. But there has been a lot of debate over a drawback that eats into that gain: some of the natural gas leaks into the atmosphere during production and transportation. Precisely how much methane (a greenhouse gas) leaks is important—leak enough and natural gas isn’t actually better than coal.Some estimates have suggested that leaks were a serious problem, while others produced much lower numbers. Now, a new study figures out why the different analyses produced a range of numbers: it depends on the time of day people were looking for leaks.Studies estimating real-world leakage have come in two primary flavors. The first type of study uses what is referred to as a “bottom-up” approach. This involves walking around gas wells and pipeline equipment while measuring leakage. With estimates for each process or type of equipment, you scale up to the big picture based on an inventory of equipment and records of the amount of natural gas produced.The second approach is to go “top-down.” Here, researchers fly research planes upwind and downwind of a natural gas field, measuring the difference in methane concentrations. While you have to subtract the influence of other methane sources—like wetlands and livestock operations—this has the advantage of directly measuring the total leakage rather than adding up a complex estimate.Top-down studies have typically estimated leakage to be around 50 percent higher than bottom-up work, reaching rates that some have argued challenge the benefit of natural gas. A number of explanations have been proposed for this difference, including the idea that bottom-up studies may miss the occasional piece of malfunctioning equipment that accounts for an outsized share of the total leakage.A new study led by Colorado State’s Timothy Vaughn tests a different hypothesis: top-down measurements just happen to be made at a leakier-than-average time of day.Given more access to production sites, researchers have recently documented that leakage can vary considerably over time. There is even a daily cycle to it. Some of the manual interventions by workers—like clearing liquid from sputtering wells—cause extra leakage that obviously occurs during workday hours. Considering the time it takes for the workers to get to a site and set up, this means that leakage tends to peak in the afternoon.It just so happens that top-down measurement flights also take place in the afternoon. That’s the best time of day to make these measurements, because methane concentrations are the most evenly mixed.Testing whether this explains matters necessitates running top-down and bottom-up studies in parallel. So, in the fall of 2015, a group of researchers swarmed Arkansas’ Fayetteville natural gas field, making measurements on the ground and in the air. The researchers were also given detailed activity logs by gas companies, allowing them to see when work was being done.A detailed model was built from the bottom-up measurements to calculate the location and timing of all leakage emissions. The model showed that afternoon leakage was double the leakage in the overnight hours because of the manual work clearing out wells.As a result, the top-down leakage estimates were higher than the bottom-up model. But to check for consistency, the researchers used their model to calculate the apparent leakage at the time of the top-down flights. Lined up in that way, the two actually matched pretty well. The top-down estimate was still a little higher, but this can be explained by small inaccuracies in the activity logs, which were only updated hourly.So what does this mean? First of all, typical bottom-up and top-down studies are apples and oranges that shouldn’t be compared directly. And as for the true leakage rates, you can guess they have typically been between the apples and oranges. Bottom-up estimates of average leakage that don’t account for high-leakage activities will be too low, while top-down estimates that assume afternoon leakage is typical will be too high. That could make sense of a lot of conflicting estimates.What’s more, the researchers point out that every natural gas field can be a little different, so this larger effort has to be repeated in each place to get a solid answer on local leakage. And understanding the sources of leakage more accurately could enable the design of more effective policies to rein in that leakage. After all, leakage is a lose-lose: companies lose revenue and the atmosphere sees more greenhouse gas that didn’t even do anything for us along the way.PNAS, 2018. DOI: 10.1073/pnas.1805687115  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}