{"id": "Pokemon Let’s Go: Well, I guess my adult ass is going to collect them all", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSam Machkovech\n    -  Nov 16, 2018 12:30 pm UTC\nThe new (optional) Poké Ball-shaped controller was uncomfortable. The waggle-loaded capturing system was simplistic. The E3 demo's brief gameplay slice was repetitive. And the zone was one fans have played through a zillion times. Pokémon was coming to Nintendo Switch, alright, but this was not the \"Generation 8\" many fans had hoped for.Yet something about that brief glimpse at Pokémon Let's Go put a little worm into my brain. (Probably a Weedle.) Weeks later, I wondered: Is there something here? Was Nintendo breaking down the sinewy tissue of age-old JRPGs in a way that seems boring in a crowded expo hall but might prove perfect for a lengthy, semi-portable adventure?Especially for someone who—let's face it—never fit Pokémon into his gaming diet?Reviews for the game have come pouring in ahead of today's worldwide launch, and some are targeted at people who know the series' Kanto region like the back of their Poké-hand. Me, I'm a guy who cut his teeth on random-battle JRPGs only to break up with the genre once I got older. I wanted to put Nintendo's adult-minded sales pitch to the test.The result is by no means a must-play game for anyone who is crestfallen with video games. If breezily collecting monsters in a fantasy land sounds silly to you, that will persist. But Pokémon Let's Go taps into my long-dormant JRPG interest—one I'm sure a few of you share—and this is the game that has finally put a breeze in my hair about this whole collecting-them-all thing.That all boils down to new, small touches, as opposed to a bigger-picture revamp.We're back to the world of Pokémon Red and Blue (or, as Let's Go Director Junichi Masuda says, Pocket Monsters Red and Green, which were the true Game Boy originals in Japan). The layout of the region, the cast of monsters, the focus on one-on-one monster face-offs, even the two-version gimmick that requires trading monsters with real-life friends—they're all there. Unsurprisingly, so is the basic plot thrust of being yet another kid finally getting in on this monster-catching business. A man by the name of Professor Oak gives you your first creature, your first Poké Balls, and a simple directive: either catch every single one to help with his research, or simply train your favorite monsters up to win \"gym battles\" across the Kanto region.The most notable differences stem from the word \"Go\" in the title. You may have heard about a little smartphone game called Pokémon Go, still topping smartphone download (and income) lists since launching two years ago. In that game, players simply walk up to Pokémon in real-world locations, then wear them down and catch them in a Poké Ball-throwing mini-game. You can eventually engage in Pokémon battles, in which the monsters' types (grass, water, fire, electric, etc.) play off each other in a complicated rock-paper-Scyther matrix, but those fights are simplified from their source material—as are other series staples like Gym Battles.Pokémon Let's Go, on the other hand, has a clever idea about all of this. It mixes up the original games' random-battle doldrums with some Pokémon Go smartphone inspirations and leaves most of the other stuff intact.When you meander around the familiar Kanto region in this new game, classic monsters can now be seen wandering on the screen, instead of existing as invisible spirits that surprise-ambush you. Should you wish to get into a \"random battle,\" walk up to the monster with your character, and a Poké Ball throwing mini-game starts. A standard Joy-Con can be used to replicate a throwing motion, or if that sounds annoying, you can opt for a joystick and buttons to aim your tosses. Catch the monster to toss it into your bag (much bigger in this game) and score experience points for your monster roster.These encounters can be canceled out (by \"running away\") at any time, and they effectively replace an unsavory truth of the JRPG grind: the old standard of tapping the \"attack\" button over and over and over to level-up. And I sure don't miss it. In older games, random battles rarely offer much educational or strategic value beyond making players equip a more suitable Pokémon for a given zone (i.e. \"it's a watery area, so Squirtle is useless here\"). And in some cases, you're just walking back and forth in a given patch of grass until a rare monster emerges.But what if the press-A-over-and-over standard was swapped with a quick-flick alternative? And what if you could instantly see which monsters were in your zone, so that you're not wasting your time with 40,000 useless Rattatas? Pokémon Let's Go places a bet on both of these ideas as upgrades, and they sure feel that way in action.The experience grind is also streamlined in this catch-'em system, as all six monsters in your party (the series' standard number) enjoy a flood of experience points after each encounter, whether it's a full-blown battle or a quick Poké Ball throw.There are certainly still classic Pokémon battles to be had. In fact, more wishful trainers dot your journey than in previous games. Many of the trainers along your journey are affiliated with famed series villains Team Rocket, who enjoy a decidedly Saturday Morning Cartoon flavor in their cheesy shouts against you. When any Pokémon-toting humans spot you, a fight against one-to-three Pokémon ensues... and maybe it's because the random battles have been removed, but the Let's Go development team has definitely turned the battle-difficulty heat up earlier in this game.Meaning, when you do get down to Poke-battling in Let's Go, it more immediately has stakes. This shift represents a smart reallocation of the game's \"battling\" currency, and I found myself quickly graduating to research and plotting about smart party formation.The rest of the good stuff in the base experience—namely, the production values—will likely delight series faithful more than newcomers. I appreciate the fully 3D characters running around, the clean character designs for all of the trainers, the beautiful world designs, the shadow and lighting effects, and the immaculately played, full-orchestra spins on the series' existing melodies. (The latter is easily one of the finest in a Pokémon game yet, and it makes Dragon Quest XI's MIDI-soaked trash fire of a score sound even dinkier in comparison.) But the way all of this aesthetic content comes together seems more like a dream version of Pokémon Red and Blue for those games' oldest fans than a design catering to brand-new players fresh off of Pokémon Go.Otherwise, we're in traditional Pokémon territory. You can expect a relatively linear trajectory through the Kanto region, ample access to much-needed Poké Balls and monster medicines, a need to balance your monsters' ever-changing range of attacks, buffs, and evolutions, cheesy encounters with friends and rivals alike, and ever-more-difficult battles along the way.In other words: that's everything I wanted from Pokémon Go in the first place.Turn to page two for a lot more on the new Poké Ball Plus accessory and how it connects both to this game and to Pokémon Go...You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}