{"id": "New MacBook Air, Mac mini hands-on: Making old favorites new again", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nValentina Palladino\n    -  Oct 30, 2018 9:52 pm UTC\nNEW YORK—Apple led today's event by talking about two of its most-loved devices: the MacBook Air and the Mac mini. While Apple customers may have loved these devices since their debuts, Apple hasn't shown them much love over the past couple of years.That changed today with the introduction of the new MacBook Air (which includes updates like a Retina display, Touch ID, and Apple's butterfly keyboard) and a new Mac mini (which got a big spec bump with quad- and hexa-core processors). Today's event brought the biggest hardware changes that both devices have seen in a long time, and yet they still have a lot in common with their predecessors—and that's a good thing.The MacBook Air began showing its age long before the 12-inch MacBook and the new MacBook Pros entered Apple's laptop lineup. But the stale, circa-2010 design is almost gone now (keyword almost), as the new MacBook Air takes notes from its more expensive siblings. It's still a sleek, all-metal notebook that's 10 percent thinner than the old model and weighs just 2.75 pounds.The Air is noticeably heavier than the 12-inch MacBook (2.06 pounds), but I appreciated the weight of it when I picked it up. Despite the various ways Apple managed to shrink the device, it still felt like a MacBook Air in my hands. Its tapered profile, with the widest point at the back, feels familiar and sturdy, and now the device is made of 100-percent recycled aluminum. Apple also added new colors to the lineup and will offer the MacBook Air in silver, space gray, and gold.Gone are the wide, metal bezels around the 13.3-inch display, as they've been replaced by the glossy black bezels we're accustomed to seeing around new MacBook displays. But the fact that the new MacBook Air has a Retina display will be enough to make fans swoon. The 2560×1600 display is a huge upgrade from the old Air's 1440×900 display, and it's about time that Apple included it on this laptop. The old Air was the final Retina holdout after the high-quality screen already made it onto the 12-inch MacBook and the MacBook Pros.Apple opted not to put its full Touch Bar on the new MacBook Air, but instead it carved out the Touch ID fingerprint reader and stuck it on the top-right corner of the keyboard. You won't find Face ID on this device (it's still sequestered to iPhones and iPads), but including Touch ID brings a much-loved feature to a much-loved laptop. The device is also more secure thanks to the inclusion of Apple's T2 security chip.Apple made the right call by forgoing the Touch Bar, because including that OLED strip would have added to the price of the device, and it may have had a negative effect on battery life. There are also some users who simply don't want or need the Touch Bar, so keeping the new MacBook Air simple will likely speak to those users.The keyboard and trackpad area looks similar to its counterpart on the 12-inch MacBook: there's little space between the bottom keys and the enormous force touch trackpad, and the keyboard uses Apple's butterfly mechanism. That may scare off some users since butterfly keys have had problems in the past and have been known to be polarizing. But Apple clearly hasn't been deterred by the naysayers: it has put butterfly keys on the 12-inch MacBook and the MacBook Pros. It was only a matter of time before Apple retired the MacBook Air's chiclet keys and brought in the butterfly switches.The speakers still sit on either side of the keys, but Apple promises they'll be 25-percent louder than those on the old Air. The new MacBook Air's hardware looks more streamlined than that on the old Air, but it's not as dramatic as that of the 12-inch MacBook. The former device was never for me, particularly because I felt like it would shatter (or, at the very least, be severely damaged) if I were to drop it, and because I don't like the look of the cramped keyboard-and-trackpad area. The new MacBook Air seems to marry the most crucial parts of the 12-inch MacBook's design (butterfly keyboard, huge trackpad) with a chassis setup that will feel familiar to MacBook Air lovers.In addition to the butterfly keys, the new MacBook Air's port situation may turn bothersome. It has two Thunderbolt 3 ports on its left edge and a headphone jack on the right edge. It's slightly too thin to fit a USB-A port, which is a bummer, and it means that Mac users will continue to live the dongle life for the foreseeable future. I also wish Apple put one Thunderbolt 3 port on either side of the device—being able to charge up or connect to peripherals from both sides of a laptop is useful, particularly when you're in a tight space.Let's recap the new MacBook Air's specs: it'll run on 8th-gen Intel Core i5 CPUs and support up to 16GB of RAM and 1.5TB of storage. While we're disappointed that there's no Core i7 option, those specs are significantly improved from the old Air (it was lagging on a 5th-gen Core i5 chip). Apple claims the new MacBook Air will last 12 hours on a single charge.The last time Apple talked about the Mac mini on stage was in 2014, and some did not like what the company had to say. Apple got rid of the four-core CPU option for the Mac mini at that time, and the device became harder to upgrade.While we can't speak to the new Mac mini's upgradability, Apple rectified the device's performance problems by including quad- and hexa-core Intel CPU options, as well as support for up to 64GB of RAM and 2TB of storage.Along with the addition of the T2 security chip, the new Mac mini has an array of ports on its back edge: four Thunderbolt 3 ports, two USB-A ports, an Ethernet port that can be configured to support 10Gb speeds, an HDMI port, and a headphone jack.All of the Mac mini's significant changes lie within the device itself. The outer shell doesn't look much different from the previous model, aside from the fact that it now comes in space gray. It takes up a small 7.7×7.7-inch footprint on a desk, and you can stack them on top of or next to one another if you need the power of more than one Mac mini at once.The Mac mini's small frame remains one of the best things about it, because it saves space on users' desks while also providing a decent amount of power. We're eager to get our hands on one to test out the new internals and see just how well the new Mac mini stands up to the newest competing desktop PCs.The new MacBook Air starts at $1,199, and the new Mac mini starts at $799. Both are available to order today, and devices should arrive on November 7. Check back for Ars' full reviews of both devices in the coming weeks.Listing image by Valentina PalladinoYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}