{"id": "New material could up efficiency of concentrated solar power", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJohn Timmer\n    -  Oct 19, 2018 3:37 pm UTC\nWith the price of photovoltaics having plunged dramatically, solar is likely to become a major contributor to the electrical generating mix in many countries. But the intermittent nature of photovoltaics could put a limit on how much they contribute to future grids or force us to develop massive storage capabilities.But photovoltaics aren't the only solar technology out there. Concentrated solar power uses mirrors to focus the Sun's light, providing heat that can be used to drive turbines. Advances in heat storage mean that the technology can now generate power around the clock, essentially integrating storage into the process of producing energy. Unfortunately, the price of concentrated solar hasn't budged much, and photovoltaics have left it in the dust. But some materials scientists may have figured out a way to boost concentrated solar's efficiency considerably, clawing back some of photovoltaics' advantage.Solar thermal revolves around transfers of heat. Sunlight is used to heat up a working fluid at the mirrors' focus. That then transfers the heat either to a storage system or directly to another fluid that is used to drive a turbine—typically steam. Higher temperatures typically mean more work can be extracted, making the efficiency of these transfers critical.Above a certain temperature, it becomes possible to replace the steam with supercritical carbon dioxide. This works more efficiently, potentially providing a boost of more than 20 percent, but it requires temperatures in excess of 1,000K. That makes things a bit more challenging, given that many metals will melt at such temperatures; others will react with carbon dioxide under these conditions. Finding a material that could work involves balancing a lot of factors, including heat and chemical resistance, ease of manufacture, and high heat transfer rates.The researchers involved in the new work, a large US-based collaboration, focus on a composite material: tungsten and zirconium carbide. These have extremely high melting points: 3,700K for both materials. Both of them conduct heat extremely well, and neither of them expands or softens much under these conditions, meaning they would hold up better to the mechanical stresses.While the stats are impressive, the amazing part of this is how the material is fabricated. The researchers started with tungsten carbide, a ceramic that can be formed into a porous material simply by pouring it as a powder into a mold and heating it. At this point, the ceramic can be further machined to produce a final shape. Once in its final form, the ceramic was placed in a bath of a molten mixture of copper and zirconium. The molten mixture filled the pores, and the zirconium reacted with the tungsten carbide, replacing the tungsten. The copper in the molten material formed a thin film on the surface of the solid.The tungsten then filled the pores in the resulting material, allowing it to retain the same shape and size despite the chemical changes. The zircon carbide ends up providing the material with a stiffness even at high temperatures, while the tungsten is flexible enough to keep the whole thing from being brittle. And the whole thing conducted heat better than the metals currently in use.The remaining issue is that, at the conditions involved in solar thermal plants, the copper on the material would react with the carbon dioxide, forming a copper oxide and releasing carbon monoxide. But the researchers determined that adding a small amount of carbon monoxide to the supercritical CO2 would suppress this reaction, something that they confirmed experimentally.Because the material holds up to these conditions so much better than the metals currently in use, it's possible to use much less of it to build a heat exchanger. This is great economically (since you need fewer raw materials), and the small size increases the power density and efficiency of the heat exchanger.While a big boost in efficiency is great, concentrated solar is far enough behind photovoltaics on price that it's not going to make a big enough difference in a direct competition. But the real competition here isn't directly with photovoltaics; instead there are two separate competitions. One is against photovoltaics plus batteries, since only that provides the possibility of around-the-clock energy access. Here, the costs are changing fast enough that it's difficult to figure out where things stand.The other competition would be with traditional fossil fuel plants, where concentrated solar can provide a direct replacement in a way that photovoltaics can't. But the situation here is murky as well. As some countries start to get serious about their commitments to lowering emissions, there's a possibility that they'll find ways of pricing emissions-free energy production in a way that helps improve concentrated solar's competitiveness. One problem here is that both natural gas and nuclear plants also rely on heat exchangers, and there's no reason this material can't be used to boost their efficiency, too.Nature, 2018. DOI: 10.1038/s41586-018-0593-1  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}