{"id": "Five solar roof shingles that aren’t from Tesla", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nMegan Geuss\n    -  Oct 24, 2018 11:30 am UTC\nIn November 2016, Tesla CEO Elon Musk gathered a collection of investors, fans, and journalists at the Universal Studios backlot in Los Angeles, California, and revealed his vision of a \"solar roof\"—that is, tiles with solar cells integrated into them so that they look just like regular roofing tiles, except they produce power.Tesla has said that it's taking time to verify the safety of these solar roofs to make sure they'll work for decades rather than a dozen years. In the company's Q2 shareholder letter, Tesla wrote, \"We are steadily ramping Solar Roof production in Buffalo and are also continuing to iterate on the product design and production process, learning from our early factory production and field installations. We have deployed Solar Roof on additional homes in Q2 and are gaining valuable feedback from each new installation.\" The letter added that Tesla plans to ramp up more toward the end of 2018, so if you're on the reservation list, you might get lucky soon.But if you're not on the reservation list, you might want to know how you can get a solar roof without waiting on Tesla. The car company didn't invent solar tiles—they existed as rare specialty products produced by a couple of lesser-known solar companies. In the years since, some of those companies have stopped producing or talking about solar tiles, while others have stepped into the game. So, as of October 2018, here are five solar shingle makers you might bet on to replace your old asphalt roof faster than Tesla can.CertainTeed is an old company with a new name; it was originally (in 1904) General Roofing Manufacturing Company. Now, CertainTeed is a subsidiary of building product company Saint-Gobain, and it specializes not just in roofing but in \"siding, fence, decking, railing, trim, insulation, gypsum, and ceilings,\" according to the company website.One advantage that CertainTeed has on its competitors is that its Apollo II solar shingles have been available for about five years now, and it's possible to buy said shingles through an installer. Each shingle or tile contains \"14 high-efficiency monocrystalline silicon solar cells\" that \"provide a power rating of 60 watts per solar shingle,\" CertainTeed says.In an email to Ars, Chris Fisher, manager of Solar Product Development & Marketing for CertainTeed, said installation costs depend on the installer. (EnergySage says that, according to solar installation data, the cost is approximately $4.90/Watt, compared to $3.14/Watt for an average rack-mounted system and $6.40 for an estimated Tesla installation).Fisher said that his company's solar shingles are four- to seven-percent less efficient than traditional rack-mounted solar panels because without air circulation under the shingles, the solar cells have to be able to work at higher temperatures (this is common to most solar shingles).Luma Solar has also been installing solar roofs for years, and it has roofs in more than 20 US states as well as a few in Canada and the Caribbean, according to the company's chief advisor Marty Aquino.Aquino said that the price of Luma's solar roof varies by the complexity of the system. If a customer just wants a portion of their roof solarized, then it costs about $4.50 per Watt, although an \"edge-to-edge\" custom solar system can run up to $38 per square foot. Custom roofs take into account the customer's future energy use, their roof's sun exposure, and the customer's overall budget.Luma also advertises a higher efficiency rate for its solar shingles. The company says that because its patented shingle design allows for airflow underneath the shingle, its system has a 21-percent solar-to-electricity conversion efficiency, which is high even for rack-mounted panels. Aquino added that, \"because of the smaller shingle profile, our Solar Shingles will generally 'turn on' earlier in the day (at about one-half to almost one-third the power needed as compared with conventional solar panels at an average of 18 to 24 volts per panel to 'turn on').\"Luma generally seeks local installers to put in an installation, but it's capable of doing an installation itself, as well.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}