{"id": "Dems to probe whether Trump retaliated against CNN, Washington Post", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nTimothy B. Lee\n    -  Nov 12, 2018 5:02 pm UTC\nDemocrats in Congress are planning to probe whether the Trump administration improperly used its regulatory powers to punish the owners of CNN and The Washington Post—two high-profile media outlets that have repeatedly clashed with Donald Trump.Adam Schiff, a senior Democrat in the House of Representatives, told Axios that Democrats would try to find out whether Trump used \"the instruments of state power to punish the press.\"In 2016, AT&T announced that it intended to acquire Time Warner, parent company of CNN. The Trump administration objected to the merger, but a federal court ruled against the administration earlier this year, allowing the merger to go through.Federal antitrust policy is jointly managed by the Federal Trade Commission and the Justice Department. Antitrust officials in these agencies are supposed to operate independently, without interference from the White House. But some Trump critics questioned whether Trump himself may have pressured his antitrust officials to block the merger. Trump has repeatedly attacked CNN, dismissing the network as \"fake news.\"The Washington Post is owned by Amazon.com CEO Jeff Bezos; Bezos and Amazon have been frequent targets of Trump's ire.\"The Amazon Washington Post has gone crazy against me ever since they lost the Internet Tax Case in the U.S. Supreme Court two months ago,\" Trump tweeted in July. \"Next up is the U.S. Post Office which they use, at a fraction of real cost, as their 'delivery boy' for a BIG percentage of their packages.\"Trump has reportedly pushed the Postmaster General to raise the postage rates charged to Amazon, but those requests were rebuffed. According to The Washington Post, Postmaster Megan Brennan told Trump that the rates Amazon pays \"are bound by contracts and must be reviewed by a regulatory commission.\"The Republican-controlled Senate had planned to probe the rates the Post Office charges big shippers back in September, but the hearing was canceled.There was little House Democrats could do about any of this while they were in the minority. But last week's midterm election gave Democrats a sizable majority in the House. That means that beginning in January, Democrats will chair House committees and will have the power to subpoena government agencies. They will be able to demand details about the decision-making process that led the Justice Department to try to stop AT&T's merger with Time Warner.\"We don't know whether the effort to hold up the merger of the parent of CNN was a concern over antitrust or whether this was an effort merely to punish CNN,\" Schiff told Axios in an interview that will air on Axios’ HBO show on Sunday.And they'll be able to gather information about how the Trump White House has pressured the Post Office to offer Amazon less-favorable terms—and whether the Post Office has acted on any of those requests.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}