{"id": "Apple confirms iOS 12.1 shipping today with 32-person Group Facetime", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSam Machkovech\n    -  Oct 30, 2018 3:28 pm UTC\nNEW YORK—Apple CEO Tim Cook concluded today's Apple news event by confirming the release of iOS 12.1 for all iOS devices.Cook highlighted a few features shipping in 12.1, most notably a Group Facetime feature that will support a whopping 32 simultaneous participants.As Apple's announcement site clarifies:FaceTime uses on-device intelligence to display the most prominent speakers on the call, automatically highlighting the current speaker by bringing them to the forefront. It automatically sizes each person’s image depending upon how active they are in the conversation, based on duration of speech, volume and even motion. Participants who are not active will appear at the bottom of the screen until they speak. A simple tap also brings a participant front and center.Additionally, dual-SIM support via eSIM, which was announced as an upcoming feature in September, will finally be enabled for iPhone XS and XR models. And Cook said users can expect an additional 70 emoji throughout iOS, which are largely made up of this suite of characters announced earlier this year as part of the Unicode Emoji 11.0 set. (Get ready for more redheaded emoji.) You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}