{"id": "Comcast uses NBC to harm other cable companies, rivals say", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJon Brodkin\n    -  Nov 12, 2018 5:33 pm UTC\nComcast's smaller rivals in the cable industry have called on the Department of Justice to investigate whether Comcast uses its ownership of TV programming to harm competitors.The American Cable Association (ACA), a lobby group for more than 700 smaller TV and broadband companies, asked for the investigation in a letter to Department of Justice (DOJ) antitrust chief Makan Delrahim.The investigation should target \"the business practices of the vertically integrated media giant Comcast-NBCU, focusing on harms stemming from the dominant communications firm's control of cable systems, TV stations, and regional sports networks (RSNs) concentrated in some of the largest local markets in the country,\" the ACA said in a press release today. Some ACA members such as RCN, Wide Open West, and Wave Broadband compete directly against Comcast for TV and broadband customers in certain local markets.Comcast told Ars that the ACA's letter to the DOJ \"is without merit and constitutes an inappropriate attempt to gain leverage in the commercial marketplace.\"In 2011, the US government imposed restrictions on Comcast's business practices in exchange for approving Comcast's purchase of NBCUniversal, but those conditions expired this year, the ACA noted. The ACA says that Comcast today poses \"an even bigger threat to competition than in 2011,\" and a bigger threat than the recently completed merger of AT&T and Time Warner Inc.—which the DOJ is trying to reverse in a court case.Comcast is likely to use its increased leverage to raise the price of programming that smaller cable companies purchase from Comcast, the ACA said.Last year, Sen. Richard Blumenthal (D-Conn.) urged the Department of Justice to investigate the possibility of breaking up Comcast and NBC after the merger conditions expire or to at least extend the conditions beyond the expiration date. The DOJ did not extend the conditions but warned Comcast in August that it will \"continue to monitor developments in how the company handles TV programming and distribution,\" Bloomberg reported at the time.The ACA said this is a good step but that a full investigation is needed as well. The lobby group said that it and its members \"will cooperate fully to assist in the investigation, including by providing information about Comcast-NBCU's practices.\"\"While monitoring by DOJ is certainly a step in the right direction, such a passive approach is unlikely to be effective against a sophisticated, giant firm like Comcast-NBCU,\" the ACA told the DOJ. \"By opening a formal investigation, the DOJ will demonstrate seriousness of purpose and give it the ability to collect sufficient information to determine whether Comcast-NBC is acting anticompetitively. It also will be a sign to rivals that the DOJ is serious about hearing their experiences with Comcast-NBCU and will preserve the confidentiality of those communications.\"In a statement to Ars, Comcast defended itself and said it faces robust competition in the video market. Comcast said:The video programming and distribution markets are incredibly competitive. New programmers and distribution platforms are offering consumers increasing choices on what and where to watch. At Comcast NBCUniversal, we are competing in this dynamic environment the way we always have—by continuing to innovate and conducting our business in compliance with antitrust laws and other legal requirements.Among other things, Comcast Cable has brought Netflix and YouTube to our X1 platform. And NBCUniversal has provided content to Hulu, Netflix, and hundreds of other traditional and over-the-top providers.We contacted the DOJ today and will update this story if we get a response.President Donald Trump weighed in on Twitter:American Cable Association has big problems with Comcast. They say that Comcast routinely violates Antitrust Laws. “These guys are acting much worse, and have much more potential for damage to consumers, than anything AT&T-Time Warner would do.” Charlie Gasparino— Donald J. Trump (@realDonaldTrump) November 12, 2018The ACA said that Comcast's ability to raise prices on rivals \"is unmatched by any similar problem created by the AT&T-TW combination.\"\"Unlike Time Warner, Comcast-NBCU owns significant must-have local programming, including 11 NBC local television stations and seven NBC Regional Sports Networks, and unlike AT&T, Comcast is the dominant multichannel video programming distributor in many of these local markets with market shares above 60 percent,\" the ACA said.Comcast offers bundles of video and broadband service in a larger portion of the US than AT&T, which \"means that Comcast-NBCU is likely to earn significantly higher average profit margins on switching customers than AT&T will, which in turn implies that Comcast-NBCU has dramatically increased leverage over programming prices compared to that of AT&T-TW,\" the ACA said.Comcast \"demonstrated a willingness\" to abuse this leverage in order to harm rivals, even while the merger conditions were in force, the ACA wrote. For example, \"Comcast-NBCU used its deep pockets to engage in delaying tactics that forestalled compliance with the condition that it carry Bloomberg TV\" and \"refused to offer standalone broadband Internet access service as the FCC condition required,\" the ACA said. (In 2012, the FCC fined Comcast $800,000 for the standalone broadband violation and extended that merger condition for one year.)The ACA letter added, \"we do not even know how many times Comcast's rivals had to threaten to utilize the arbitration [merger condition] or some other condition to get Comcast-NBCU to limit to some degree its natural proclivity to harm rivals.\"Now that the Comcast/NBCU merger conditions are expired, the ACA said its members also fear that Comcast will use its 30-percent ownership stake in Hulu to restrict rivals' \"ability to access Hulu and make it available to their customers as an alternative to their cable offerings.\"\"When it was subject to the 2011 [merger] conditions, Comcast-NBCU at least thought twice about engaging in anticompetitive acts,\" the ACA said. \"Without a leash, it can engage in a much wider range of bad behavior and, if it gets caught, merely use its deep pockets to play out the clock or, at worst, ask for forgiveness.\"You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}