{"id": "Comcast gigabit cable ($105 with 1TB data cap) now available in 39 states", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJon Brodkin\n    -  Oct 19, 2018 7:50 pm UTC\nComcast's gigabit cable service is now available to nearly all of the 58 million homes and businesses in the company's US territory, Comcast announced yesterday.Comcast, the nation's largest ISP with more than 26 million subscribers, began rolling out gigabit cable in early 2016. It's now available almost universally through Comcast's territory that includes 39 states and the District of Columbia.Comcast's gigabit cable relies on DOCSIS 3.1 technology to deliver download speeds of up to 1,000Mbps, though Comcast notes that speeds will vary based on network traffic and \"actual download speeds might be limited to 940Mbps due to Ethernet technical limitations.\" Upload speeds are still limited to a comparatively paltry 35Mbps.According to Comcast, the new milestone ensures that it is \"the nation's largest provider of gigabit broadband.\" It's not clear how many subscribers opt for gigabit service, but Comcast said that 75 percent of its broadband customers \"choose plans with speeds of 100Mbps or more, double the speed those customers took just three years ago.\"The standard prices for Comcast gigabit cable vary from $104.95 to $139.95 depending on where you live, Comcast told Ars. Promotions also vary by location. I found a deal of $89.99 a month for the first 12 months (and $104.95 a month thereafter) by checking offers in my part of Massachusetts with Comcast's availability checker. The online ordering tool told me I'd have to pay a $60 fee for a \"professional installation,\" even if I use my own modem instead of renting one from Comcast.Unfortunately, the gigabit service is subject to Comcast's 1TB data cap and overage fees if you live in one of the 27 states where Comcast enforces the cap. Comcast automatically charges $10 for each additional 50GB allotment, up to a maximum of $200 in any given month. The company provides two \"courtesy months\" in which customers are not charged for overages.You can upgrade to unlimited data for an extra $50 a month. Another way to avoid the cap is to buy Comcast's \"Gigabit Pro\" fiber service, which offers 2Gbps speeds both downstream and upstream. But the fiber-to-the-home service costs $300 a month and isn't as widely available as the gigabit cable. Comcast told Ars that its Gigabit Pro service is available to about 18 million homes.Charter, the nation's second biggest cable company after Comcast, also offers gigabit cable service but without data caps.Disclosure: The Advance/Newhouse Partnership, which owns 13 percent of Charter, is part of Advance Publications. Advance Publications owns Condé Nast, which owns Ars Technica.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}