{"id": "Enigmatic ridges on Pluto may be the remains of vanished nitrogen glaciers", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJohn Timmer\n    -  Nov 17, 2018 3:00 pm UTC\nAs we've gathered more details about the other planets of the Solar System, we've largely managed to explain the geography we've found by drawing analogies to things we're familiar with from Earth. Glaciers and wind-driven erosion produce similar results both here and on Mars, for instance. But further out in the Solar System, the materials involved in the geology change—water ice becomes as hard as rock, and methane and nitrogen freeze—which raises the prospect of some entirely unfamiliar processes.This week, scientists proposed that some weird terrain found on Pluto could be the product of large fields of nitrogen ice sublimating off into the atmosphere. While this explanation could account for some properties of Pluto's geography, it doesn't explain why the process resulted in a series of parallel ridges.The strange terrain lies to the northwest of Sputnik Planitia, the heart-shaped plane that dominates the side of Pluto we have the best images of. Called \"washboard\" or \"fluted,\" the area consists of large numbers of roughly parallel ridges with roughly a kilometer or two separating them. Aside from their appearance and general orientation, these ridges don't seem to have a lot in common. They're discontiguous and don't fill the entire region. They run down slopes and spread across valley floors—in some cases a single ridge will run down a slope and then flatten out. And in several cases, they create a starburst-like pattern on along the walls of craters.The easiest explanation for a series of ridges like this would be a moraine, debris left behind at the edge of a glacier's furthest extent. While you can get more than one moraine if a glacier retreats and stabilizes a number of times, this would typically occur at multiple locations running across a downhill slope. It's difficult to understand how glaciers would terminate across such varied terrain and maintain a consistent orientation across such a varied landscape.To get a better sense of what might be going on, a team of researchers decided to map the full extent of the washboard/fluted terrain (which they disconcertingly refer to as WFT in their paper describing the results). They find that the ridges extend from the edge of Sputnik Planitia, which is at a low elevation, up to a plateau that's nearly five kilometers above the plane. Within that region, they're mostly concentrated within lower elevation basins and valleys, and they become less frequent as the elevation increases.The prevalence of washboard terrain at lower elevations does tend to suggest the involvement of glaciers, but moraines are unlikely to account for the terrain. So what else could be going on?The researchers were inspired by examples of what are called \"sublimation pits\" in Sputnik Planitia. These are areas where the ice of the plain appears to be losing nitrogen to the atmosphere. Since the plain is predominantly nitrogen ice, this means results in the loss of some of the surface of the plain. Critically, this loss seems to be concentrated in kilometer-scale pits that form in parallel lines with a similar spacing to that seen in the washboard terrain.The researchers suggest that the washboard terrain was also occupied by nitrogen ices at some point in the distant past and that these were covered in a variety of debris, including blocks of water ice. Over time, as orbital changes heated up this region, the nitrogen would start to sublimate away into the atmosphere, perhaps breaking through a water ice crust to do so. If this occurred through a process like the formation of sublimation pits, it would leave parallel lines of water ice intact. Once all the nitrogen ice was gone, this material would pile up to create the washboard terrain.This same process would lead to the accumulation of nitrogen ice in the basin that now hosts Sputnik Planitia. Since that was thought to have formed early in Pluto's history, this suggests that the washboard terrain should be roughly four billion years old. That number is consistent with the number of craters in the terrain.While all of this is plausible, there's still a bit of mystery here: we have no idea what aspect of physics causes the sublimation pits to form in parallel rows in the first place. Without that knowledge, it's hard to predict whether similar structures are likely to form outside of Sputnik Planitia.Nature Astronomy, 2017. DOI: 10.1038/s41550-018-0592-z  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}