{"id": "Making light twist into a bowtie may reveal dark matter", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nChris Lee\n    -  Nov 12, 2018 8:08 pm UTC\nDark matter is a theory that is excellent for inspiring new theories. It also seems to be an excellent way to generate new and expensive detector hardware. A new paper bucks the trend, though, proposing a dark-matter experiment that seems almost... cheap.I have a rather dark view of theoretical physics.Unbeknownst to most, theoretical physicists (there is no other type) increase their stability by splitting into two, which happens during a process known as defending a PhD. During this fission, new dark-matter-particle candidates are emitted, mostly of a variety called axions. Whenever there is a conference of theoretical physicists, critical mass is exceeded, and an explosion of more dark-matter-candidate particles is produced. These events will occasionally emit large and expensive experiments.It came as a shock, therefore, to find a dark-matter search proposal that didn't involve tons of isotopically pure xenon and a billion expensive light detectors. No cosmic-ray observatories are involved. We do not need to search for tiny anomalies in the cosmic microwave background with an army of radio telescopes.Nope, just one good laser, a few very good mirrors, and some excellent electronics.Let's rise above my cynicism for a moment to look at this particular dark-matter candidate. The axion potentially comes in multitudes, so we should say axion-like particles. They're in nearly every extension to the Standard Model physicists have come up with. These particles could have nearly any mass at all, but most experiments have looked for large-mass axions and failed to find them; these experiments have only low sensitivity to low-mass axions.There are a couple of ways that the axion might be seen. In a strong magnetic field, axions can modify a light field. And, occasionally, an axion becomes a photon. This allows axion searches to use light from the Sun, cosmic rays, and sources of radiation in the lab.The last entry in this list is the most interesting. A trio of Japanese researchers has proposed looking at how axions slow light that corkscrews clockwise slightly more than light that corkscrews counter-clockwise.If you're lost, don't worry; I'll drop a food parcel. Light consists of an electric field and a magnetic field that regenerate each other. The electric field generates the magnetic field as it changes, and the magnetic field recreates the electric field as it changes.To picture this, imagine that you are looking down the barrel of a laser. As the light moves toward you, the electric and magnetic fields rotate like the hands on a clock (always at right angles to each other). The hands can rotate clockwise or counter-clockwise.Light that is rotating counter-clockwise will be slowed just a little bit by axions, while light that is rotating clockwise will be sped up just a little (this is compared to space that is free from axions). We should be able to measure that change by comparing the relative phases of two light beams that have opposite rotations.This is what the researchers propose to do. In their experiment, light will go into a series of mirrors that force it to travel in a bowtie pattern. The light can keep doing this for quite a few laps before it eventually leaks out of one of the mirrors. The light that leaks out is sent back into the bowtie cavity in the opposite direction and with the opposite rotational sense. That light will also eventually leak out. At this point, the phase of the light is compared to the light that is sent into the bowtie.If the light refuses to play with axions, there will be no phase difference between light going into the bowtie and light leaving the bowtie. But any influence of axions will shift that phase. This is the same sort of measurement that lets us detect gravitational waves, so it can be made incredibly sensitive.The nice thing is that the configuration is kind of self-stabilizing. Temperature changes will modify light traveling in both directions equally. The same with vibrations and other environmental effects. It is almost a naturally noise-cancelling experiment. As a result, the researchers expect to have, for reasonable optical components, a sensitivity an order of magnitude or two better than current detectors. (Remember, this is only for very light axions; for heavy particles, current detectors are better).If we really put the resources in and make a large bowtie with mirrors that are state of the art (and probably a bit better than that), then the sensitivity is pretty incredible. But even if we take this more expensive route, we are talking about a very cheap dark-matter detector. I just hope they are building it.Before it's built, though, I have a theory to publish...Physical Review Letters, 2018, DOI: 10.1103/PhysRevLett.121.161301 (About DOIs)You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}