{"id": "Review: Istanbul: The Dice Game rules the bazaar", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nNate Anderson\n    -  Oct 20, 2018 12:00 pm UTC\nWhen it comes to gaming, I am a man of simple pleasures. I need no boxes of sculpted minis, no hour-long setup, no manuals the size of novels. Let me chuck huge handfuls of dice, collect colorful goods, earn chunky gems, and I am content. Wrap the whole package in elegant artwork with a clear ruleset and a low price, and I am ready to play, anytime, anywhere.That's why I love Istanbul: The Dice Game, the (inevitable) dice-driven implementation of 2014's award-winning board game, Istanbul. In that earlier big-box game, players moved their \"merchants\" around the \"bazaar\" to collect and trade goods, or to gamble in the tea shop, or to spring a relative from jail and send him on an errand for you. (Don't ask.) The goal was to collect enough shiny acrylic rubies to retire rich.The trick was that your merchant could only take actions when leaving an \"assistant\" behind on an action space, or when collecting an assistant by landing on it again. The game's resource collection and conversion mechanics were thus overlaid with a spatial puzzle in which you would waste turns if your merchant ever ended up alone. Figuring out how to drop and collect assistants—while still accomplishing useful goals—made for a wonderful, satisfying game. Designer Rüdiger Dorn was awarded the prestigious Kennerspiel des Jahres prize for his effort.That spatial puzzle, with its drop-and-collect gameplay, set Istanbul apart from other resource conversion games. So when it came time to produce a dice version, Dorn naturally... eliminated the spatial aspect altogether?This was a bold and controversial decision; read reviews of Istanbul: The Dice Game online and you will quickly find complaints about it gutting the ONE THING THAT MADE THE ORIGINAL UNIQUE!!! But stripping out this chunk of gameplay brought playtime down from 60 minutes to 20 minutes, simplified setup, and made the game into an even purer race for rubies. No longer are you stuck taking suboptimal moves just so you can make it to the spot you really want to be next time; no longer will you waste entire turns returning to the fountain in order to summon all of your assistants back home.Instead, Istanbul: The Dice Game chooses to shower you in resources. Every turn you will roll a fistful of custom wooden dice to get more goods, money, re-roll crystals, one-time use cards, or perpetual bonus tiles. Within minutes, the bonuses begin to stack; 15 minutes into a game, you might be rolling two additional dice and picking up three lira on every single turn. This is not a stingy game with a tight economy; this is a game that rains down abundance upon you.You need to turn that abundance into rubies before everyone else can do the same. Just as in the original Istanbul, rubies here get progressively more expensive. Buy a ruby with cash and the next one costs even more; pick up a ruby for four yellow goods and the next ruby costs five. So using only one approach to ruby collection—say, money—gets progressively harder, helping to prevent runaway leaders who have built up a specific kind of engine.From its description, the game might sound too simple—chuck some dice and collect the results—but in reality, it's not so straightforward.For one thing, you can use the dice in different ways. You might cash two \"red good\" dice in for a \"red goods tile\" that persists across turns—but you might also pair a \"red good\" die with a \"blue good\" die to pick up a re-roll crystal. Or, you might turn in three different goods dice to pick up a \"wild\" good. Or four different goods dice can be used to grab two goods tiles of any color. You can also pair your current dice with goods tiles acquired on previous turns, making numerous combo possibilities.Second, you can alter the dice by re-rolling them—just cash in one of your re-roll crystals each time you do so. While it can be hard to use your precious dice to acquire re-roll crystals instead of goods or money, it can pay off; I've won several games by rolling the dice multiple times on my final turn until getting the result I needed. And you can further specialize in re-roll crystals by acquiring bonus cards that provide them at the start of every turn.Third, you only get two actions per turn, which means you may have to leave dice actions unused on some rounds. Bonus tiles can grant you extra actions, so a strategy that's heavy on acquiring both extra dice to roll and more actions to take with them can be a viable way to move faster than your opponents.The heart of Istanbul: The Dice Game is this decision about how to build your engine. Do you burn several initial turns trying to collect bonus tiles that will pay off for the rest of the game, or do you just race right for goods and money, hoping to win before your opponent's faster engine can overtake your head start? Do you specialize in money, and if so, what do you do when your opponent buys up several of the rubies and you're now collecting massive money with nowhere to spend it?The game's exuberant abundance, its cascading bonuses, its multiple paths to victory, and the limited control it gives you over the dice combine to produce a wonderful race game. It's not spatial. It's not incredibly deep. It's not a brain burner. The \"engine\" you build will only power a Ford Pinto. But Istanbul: The Dice Game is a near-perfect after-dinner weeknight game—fast and fun, with quick setup and engaging turns. It also plays wonderfully with two, though the game scales up to four thanks to a double-sided board.The art, the cards, the mosque tiles, and the rubies all have that classic Istanbul feel to them. Everything is well made apart from the too-thin player aids, but this is an attractive package for just $25, and there's plenty of dice-chucking fun to be had.Accept the game for what it is and you should have a great time. And when you want something a little thinkier, a little puzzlier, and a little longer, the original Istanbul (and its excellent expansions) remains a solid option.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}