{"id": "Video: How do we figure out that rocks are billions of years old?", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJohn Timmer\n    -  Oct 30, 2018 4:10 pm UTC\nFor our first entry of our new science video series, we looked at some one-of-a-kind hardware that gets things moving at nearly the speed of light. Today, we're going to take a look at a process that takes place all over the world. While it does require some specialized equipment, the equipment is common enough that many universities have their own version. Despite being relatively common, though, we can still learn some amazing things from it.The subject of this description is radiometric dating, which uses radioactive decay of some elements to figure out how old things are. Putting an age on something may seem fairly mundane, but the simple answers provided by dating can impact a huge range of scientific fields.Carbon dating helps us understand when cultural artifacts were made and when archeological samples were deposited. It helps us figure out when lost environments flourished. Other isotopes let us go older, figuring out when extinct species lived and when evidence of past climate change was put in place. Deeper back in time, we can work through movements of supercontinents that no longer exist, the formation of the Earth's first rocks, and (using some off-world samples) even the start of the Solar System.This process doesn't work with every rock and every isotope, but there are ways we can build confidence in the dates we have for rocks that are over four billion years old. To find out how, watch the video.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}