{"id": "NOAA is about to make some big changes to its global weather model", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Oct 24, 2018 2:33 pm UTC\nThe nation's weather and climate organization, NOAA, has appointed a new director of its Environmental Modeling Center. This position essentially oversees development of the US computer models used to forecast weather around the world. The new director is Brian Gross, who fortunately has extensive experience in the field, having worked at NASA and led NOAA's prestigious Geophysical Fluid Dynamics Laboratory.Gross becomes the full-time leader of NOAA's modeling center at a critical time. The organization is about to substantially change the dynamic core, or engine, of its primary weather model—the Global Forecast System. This GFS model provides the foundation of many, if not most, seven- and 10-day forecasts that consumers see on their weather apps or in the nightly news. It also provides critical forecasts for hurricane tracks and other significant weather around the world.NOAA plans to implement this change, to what's known as the \"FV3 dynamic core,\" as early as the end of January 2019. \"This is the biggest change to the global model that’s being run in operations in about 40 years,\" Gross told Ars in an interview. \"We think the FV3 is going to prepare us for a very bright future in terms of prediction capability.\"The use of an FV3 core should allow for a more computationally efficient model, which means that supercomputers should be able to process the model more quickly, and this should allow for more rapid results and the capacity to run the model at higher resolutions with future, faster supercomputers. The FV3 should also capture better details about the physical terrain of the Earth's surface, such as more accurately representing mountains.NOAA has been running the FV3 core in the background for about a year, comparing its performance to the operational GFS model as well as \"hindcasting\" past weather events to assess its performance. All told, the FV3 ran 8,000 forecast cycles—four cycles a day—for 2,000 days. All of this data has been made public in the last month. (It can be found here, along with presentations highlighting some of the model's successes and failures). \"One of the most exciting things is how deeply engaged the community was,\" Gross said.The top-line finding is that yes, the FV3 core generally performs a bit better than the GFS model. The most widely accepted method of measuring a model's accuracy is by scoring its \"anomaly correlation,\" a measure of its ability to accurately predict observations (a score of 1 is perfect) at the 500mb level of the atmosphere (about 5.5km above the Earth's surface).For the period of mid-August to mid-September of this year, using this metric, the FV3 model had a score of 0.903 while the operational GFS score 0.897 for the northern hemisphere. For the entire globe, the FV3 had a score of 0.883 and the GFS was 0.872.These are not bad scores, and it is nice to see some modest improvement from the FV3, but it still is not the best in the world. For the entire globe, the FV3 model would still rank behind the best-in-class European model (0.910) and the United Kingdom Met Office (0.887). Essentially, the FV3 upgrade appears to bring the US model from third or fourth best global weather model to pushing the United Kingdom for second-best in the world.Presentations made at a series of meetings in late September and early October highlight some of the positives and negatives with the new model. For example, the new FV3 model does not have the problem the GFS model did with over-intensifying most tropical cyclones or sometimes generating tropical systems with two centers. The new model also showed some slight improvements in the accuracy of hurricane tracks through the first five days.However, there were also some concerns. For example, the FV3 model had problems with hurricane track accuracy at days six and seven of the forecast period. The new model also seems to have a bias toward being too dry in some of its precipitation forecasts (this is a bit worrisome because it might undersell the rainfall threat from a storm like Hurricane Florence) and too cold with some of its nighttime temperatures.Enlarge / FV3 model performance on hurricane tracks fell off at day 6 and 7.NOAASo in summary, the new model is not perfect, and it probably will not put the United States on par with the premier modeling center in the world, the European Center for Medium-Range Weather Forecasts and its ECMWF model. However, the new core does modernize the US global model and provides a foundation upon which further improvements can be made.Perhaps most importantly, NOAA's global weather model and its associated data will remain freely available to the public, with virtually no proprietary information. The same cannot be said for many of the other global models around the world, including the ECMWF, which charges fees to users. \"We're going to continue to make sure we're providing the same products to all of our users,\" Gross said.For some people, that means hurricane forecasts. For others, that's winter storm warnings. And for others, that's surf conditions in Hawaii. While NOAA has revamped what's under the hood, the end results should remain more or less the same and, we hope, more accurate than ever.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}