{"id": "Collapse of ancient city’s water system may have led to its demise", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Oct 20, 2018 1:30 pm UTC\nThe Cambodian city of Angkor was once the largest in the world... then the vast majority of its inhabitants suddenly decamped in the 15th century to a region near the modern city of Phnom Penh. Historians have put forth several theories about why this mass exodus occurred. A new paper in Science Advances argues that one major contributing factor was an overloaded water distribution system, exacerbated by extreme swings in the climate.Angkor dates back to around 802 CE. Its vast network of canals, moats, embankments, and reservoirs developed over the next 600 years, helping distribute vital water resources for such uses as irrigation and to help control occasional flooding. By the end of the 11th century, the system bore all the features of a complex network, with thousands of interconnected individual components heavily dependent on each other.Such a configuration, hovering at or near the so-called critical point, is ideal for the effective flow of resources, whether we're talking about water, electricity (power grids), traffic, the spread of disease, or information (the stock market and the Internet). The tradeoff is that it can become much more sensitive to even tiny perturbations—so much so that a small outage in one part of the network can trigger a sudden network-wide cascading failure.That's what a team of researchers from the University of Sydney think happened to Angkor. Sure, the Siamese sacked the city in 1431 CE, but most historians believe that event alone would not have been sufficient to drive most of the population from the city. The area had also suffered decades-long drought around the same time, followed by a period of unusually intense summer monsoons. According to the scientists, these extreme climate shifts critically damaged the water distribution infrastructure.\"The water management infrastructure of Angkor had been developed over centuries, becoming very large, tightly interconnected, and dependent on older and aging components,\" says co-author Mikhail Prokopenko, director of the Complex Systems Research Group at the University of Sydney. \"The change in the middle of the 14th century CE, from prolonged drought to particularly wet years, put too much stress on this complex network, making the water distribution unstable.\"Using archaeological maps of the region's water distribution system as it existed in the middle of the 14th century, Prokopenko and his colleagues built a mathematical model based on erosion and sedimentation dynamics. Their goal was to identify the particular areas in the network that were most vulnerable to catastrophic failure.Their model network had 1013 edges (including excavated canals, embankments, dikes, and so forth serving to control and direct the flow of water) and 617 nodes (canal confluences or bifurcations, reservoirs, temple moats), which represent points at which edges meet or terminate. They found that the damage was most severe upstream, in areas that served as primary hubs, akin to major airline hubs like Chicago's O'Hare Airport. If O'Hare shuts down for some reason, the delays will ripple through the entire network, because it is a central transfer point. This is likely what happened in Angkor with the extreme flooding during heavier than usual monsoon seasons, following on the heels of decades of drought.There is a lesson here for our modern-day cities in the fate of Angkor. Our cities are larger, more complex—and our infrastructure is aging rapidly. This makes cities more vulnerable to the rippling effects brought on by climate change, most notably an increase in extreme weather events. \"If we don't build resilience into our critical infrastructure, we may face severe and lasting disruptions to our civil systems, that can be intensified by external shocks and threaten our environment and economy,\" says Prokopenko.DOI: Science Advances, 2018. 10.1126/sciadv.aau4029  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}