{"id": "Dealmaster: Take up to 25% off an Amazon Fire HD tablet", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nArs Staff\n    -  Oct 30, 2018 5:40 pm UTC\nGreetings, Arsians! Courtesy of our friends at TechBargains, we have another round of deals to share. Today's list is highlighted by a new set of deals on Amazon's Fire tablets.All three of Amazon's primary slates are on sale: the entry-level Fire 7 and larger Fire HD 10 are down 20-percent to $40 and $120, respectively, while the mid-tier Fire HD 8 is down 25-percent to $60. Of those, the Fire HD 8 is probably the best buy for most: that HD display is a big step up from the dirt-cheap panel on the Fire 7, but, at $60, it's still plenty affordable for a tablet that's really best suited for casual Web browsing, video viewing, and generally tossing around the house. But the Fire HD 10 is still decent if you need the bigger display, and it's worth noting that the \"Kids Edition\" models of these devices are all currently discounted as well.We also have an all-time low on the 128GB variant of Samsung's EVO Select microSD card, a $600 discount on a recommended configuration of Lenovo's ThinkPad X1 Carbon laptop (an Ars favorite), a nice deal on an Amazon Echo Dot and Tile Bluetooth tracker bundle, and much more. Have a look for yourself below.Note: Ars Technica may earn compensation for sales from links on this post through affiliate programs.More Laptops & Desktop PC Deals here.More TV Deals here.More Electronics & Tech Deals here.For more great deals, go to TechBargains.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}