{"id": "Cockroaches deliver karate kicks to avoid being turned into “zombies”", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Nov 3, 2018 3:00 pm UTC\nIf you ever want to witness just how horrifyingly \"red in tooth and claw\" nature can be, you only have to look to the emerald jewel wasp. The female of the species is known for stinging unsuspecting cockroaches with a nasty venom that turns the roach into her docile slave. That way she can lay her eggs in the still-living roach and bury it alive, ensuring her offspring have something to eat when they hatch. Even if you don't like cockroaches, it's a pretty gruesome fate—they become the walking dead.But it turns out that the poor roach is not without defenses of its own, according to a new paper in Brain, Behavior and Evolution with the rather puckish title, \"How Not To Be Turned Into a Zombie.\" Roaches can use their hard, spiky legs as weapons, even delivering wide sweeping kicks to ward off an attacking jewel wasp. It's the most detailed study yet of how roaches fight off attacks to turn them into insectoid zombies.The author, Vanderbilt University's Ken Catania, has a knack for creatively studying the aggressive behavior of various creatures; his specialty is predator/prey interactions. Back in 2016, he experimentally verified naturalist and explorer Alexander von Humboldt's 19th-century account of electric eels in Venezuela aggressively leaping up and stunning horses with a series of high-voltage discharges. (Part of that experiment involved LED lights mounted on a fake alligator head, attached with strips of conductive tape, to better visualize those discharges. Because of course it did.)This time around, he investigated the defense mechanisms of the American cockroach (Periplaneta americana) against female jewel wasps (Ampulex compressa, aka emerald cockroach wasp). Catania had read accounts of roaches trying to defend themselves from these devastating attacks and thought they warranted a closer look—in this case, with ultra slow-speed videography, the better to capture the intricacies of the interactions.The wasp delivers two stings. The first paralyzes the roach's legs. Then the wasp shoves its stinger through the throat's soft tissues and up into the brain. All this takes just 11 seconds. That lets the wasp lead the now-docile roach to her nest by the antenna—after the roach engages in a spot of compulsive grooming behavior, because who doesn't want to look their best while being eaten alive? But a roach has a decent shot at survival if it can spot the oncoming attack in time.\"The cockroach has a suite of behaviors it can deploy to fend off the zombie makers,\" says Catania. \"This starts out with what I call the en garde position, like in fencing.\" It's also known as \"stilt standing.\" From that position, the roach can track an approaching wasp with its antenna and elevate its body, the better to aim a swift, hard kick at the wasp's head and body. The roach uses its leg almost like a baseball bat. If it puts up enough of a fight, \"The wasp usually figures out there's a smaller and less-defensive cockroach out there to be had,\" he says.He found that the kicking defense was surprisingly effective: 63 percent of adult roaches picked up on the approaching wasp and warded off the attack for a full three minutes (Catania's metric for success). The youngsters, alas, were not so fortunate. Nearly all the juvenile roaches in the experiments failed in their defense and wound up being turned into zombie slaves.Catania hopes his work will help reveal how these unique predator (the wasp) and prey (the roach) behaviors evolved over time. \"It seems likely that the cockroach defenses have evolved in response to a wide range of different predators,\" he writes. \"On the other hand, every jewel wasp is 'of cockroach born'—the result of a successful attack on a cockroach.\"So what is his advice for not being turned into a zombie, at least if you're a cockroach? \"The best strategy is to be vigilant, protect your throat, and strike repeatedly at the head of the attacker,\" he writes. It might just work for humans, too.DOI: Brain, Behavior and Evolution, 2018. 10.1159/000490341  (About DOIs).You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}