{"id": "Hitman 2 review: Accessible stealth oozing with style", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJulie Muncy\n        -  Nov 16, 2018 4:52 pm UTC\nIt begins unassumingly on a beach with Agent 47 creeping through the tall grass like in any other stealth game. Once you reach the opening mission’s seaside resort home, though, the options spiral wildly. Soon you're hiding in closets, waiting for a target to reach the right location, juggling ideas about chloroform and bad ventilation systems with possible plans involving disguising yourself as a guard, and the nagging idea that, hey, maybe I could just throw her into the ocean…This opening level is, in microcosm, the entire Hitman 2 experience. More than any other stealth game series, Io Interactive's stealth murder simulator is an ode to options. It’s a vast array of silly and inspired possibilities for causing mayhem, creating distractions, and, finally, slitting a victim's throat. Or blowing them up in their experimental race car. Or getting them to take a swing at an exploding golf ball, as the case may be.The creativity and sheer excellence of Hitman 2 comes out of what is, all told, a fairly storied recent history. After its immediate predecessor, published by Square Enix, failed to achieve the sales numbers it perhaps deserved, Square Enix divested itself from Io Interactive entirely, leaving the now-independent company to work on shipping a sequel by itself. It was both a unique opportunity and an onerous challenge for Io: to create something that did justice to the long-running series with fewer resources than it has perhaps ever had.2016's Hitman was, despite its limited success commercially, a small triumph. It managed to modernize the series, turning the expansive set of creative options found in its best earlier installments and making them work with a more streamlined control scheme, clearer tutorial options, and a set of customizations that made the series, for perhaps the first time, accessible to players unfamiliar with it.Hitman 2 expands on those successes on all fronts. The stages are bigger and more elaborate, the rhythms of play have been smoothed out and made more full, and the systems underlying the missions are more robust, and more flexible, than ever. Hitman 2 feels like a mission statement: this is what Io can do with minimal outside help and full control over its properties.I've not explained in all that much detail where you go in Hitman 2, or what, precisely, you do. And a large part of that is a desire to avoid spoiling the game's eccentricities. But, largely, each mission plays out in a similar fashion. You are briefed on one or more targets in the game's stages: each of which is large, bustling, and consists of varied locales based on the real world. Then you enter the level, explore, plan, and carry out a kill before escaping.But that description belies the improvisational joy of the Hitman experience. Each mission is full of myriad routes to your objective, planned or not, involving silly disguises and gadgets and truly surprising amounts of rat poison. It's like an elaborate murder puzzle box, putting out values of mayhem for any of the unlikely combinations the player can come up with. Unlike most stealth games, this is social stealth, as much about fooling the people around you with impersonation and distraction as it is about simply avoiding sight lines and taking out sentries. The pleasure is in the drama you cause—and the wicked delight of having gotten away with it.What Hitman 2 adds to that formula, aside from a handful of massive, fantastic new levels to play around in, is a clarity to the systems that make it easier for new players to jump in and feel good even when they fail. Hiding places are more clearly marked, and players are better notified when they're hidden, which is essential for when a plan fails and you have to run away, improvise, and try again. Certain traditional stealth mechanics—like crouching and hiding in the bushes—have been reintroduced to the mix in a way that doesn’t alter the action but adds familiar means of onboarding for players more familiar with, say, Metal Gear Solid's approach to remaining undiscovered.And on top of those refinements, Hitman 2 styles itself in a fashion designed to offer the player as much freedom in planning and carrying out missions as possible. Each successful run opens up more options for equipment and spawn locations, and missions are playable in any order, regardless of the story. In addition, side contracts, which are updated every so often by Io, provide new ways to play old missions, with entirely new characters and scenarios baked into existing levels. As an additional show of good will, Io has offered the entire suite of levels from the first game as downloadable content in the second, complete with the refined play style of the new game.All told, Hitman 2 feels almost like a platform for Hitman itself as a concept: a staging area for new levels with room for later updates, large amounts of customization, and infinite player creativity. Hitman games, at their best, are creativity engines. They are built to be played and replayed as the player seeks the perfect, most thrilling, most ridiculous kill. Hitman 2 is a brilliant outing because every part of it feels designed to cater to that. Would that every game so lucidly understood what it is.An expertly crafted, improvisational playspace for stealth mayhem. Buy it.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}