{"id": "Entire broadband industry sues Vermont to stop state net neutrality law", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJon Brodkin\n    -  Oct 19, 2018 5:19 pm UTC\nThe nation's largest broadband industry lobby groups have sued Vermont to stop a state law that requires ISPs to follow net neutrality principles in order to qualify for government contracts.The lawsuit was filed yesterday in US District Court in Vermont by mobile industry lobby CTIA, cable industry lobby NCTA, telco lobby USTelecom, the New England Cable & Telecommunications Association, and the American Cable Association (ACA), which represents small and mid-size cable companies.CTIA, NCTA, USTelecom, and the ACA also previously sued California to stop a much stricter net neutrality law, but they're now expanding the legal battle to multiple states. These lobby groups represent all the biggest mobile and home Internet providers in the US and hundreds of smaller ISPs. Comcast, Charter, AT&T, Verizon, T-Mobile US, Sprint, Cox, Frontier, and CenturyLink are among the groups' members.While the California law applies to all consumer broadband providers, Vermont's law is narrower and may be more likely to survive legal challenge. Vermont's law creates a process in which ISPs can certify that they comply with net neutrality guidelines, and it says that state agencies may only buy Internet service from ISPs that obtain those certifications.Vermont Governor Phil Scott, a Republican, also issued an executive order imposing similar requirements on state agencies. The broadband industry lawsuit asks the court to rule that both the Vermont law and executive order are preempted by federal law.The lobby groups point to the Federal Communications Commission repeal of US-wide net neutrality rules because the FCC order claims the authority to preempt state net neutrality laws.The Vermont law and executive order \"impose pervasive common-carrier net neutrality mandates on an ISP at the moment it signs a service contract with the State,\" the industry lawsuit says. The complaint further states:Vermont's attempts to revive and, indeed, expand a repealed regulatory regime are plainly preempted by federal law—an outcome that, as discussed below, members of the Vermont government specifically brought to the attention of the Vermont General Assembly and the Governor before they adopted these measures, but that they disregarded in moving forward with these actions. Under the Supremacy Clause of the United States Constitution, state measures that contravene validly adopted federal laws and policy determinations, including those contained in FCC orders, are preempted and have no force or effect.The state law is also preempted because of \"the inherently interstate nature\" of broadband, the complaint said.To get certified for state contracts, Vermont says that ISPs must demonstrate that they do not block or throttle lawful Internet traffic or engage in paid prioritization. The certification also prohibits ISPs from \"engaging in deceptive or misleading marketing practices that misrepresent the treatment of Internet traffic or content to its customers.\" ISPs seeking certification also have to publicly disclose accurate information about their network management practices, network performance, and the commercial terms of their Internet service.Scott criticized the lobby groups, saying he will work with the state attorney general's office to defend against the lawsuit. Scott's statement said:Our net neutrality legislation and my Executive Order demonstrate a clear commitment from Vermont's elected officials, across branches and party lines, to preserving and promoting a free and open Internet in Vermont.I am disappointed to hear national telecom and cable organizations plan to sue us for taking action to protect our citizens and our economy.While I understand consistent regulation is important to ensuring a vibrant and thriving telecom and cable sector, our obligation as a state government is to our citizens, who I strongly believe have a right to free and open access to information on the Internet. In the absence of a national standard to protect that right, states must act.The industry lawsuit against Vermont may be more difficult to win than the one against California because states have wide latitude in determining how to award contracts to vendors.Despite that limitation, the industry lawsuit argues that the Vermont requirements are over-reaching:The State cannot escape the preemptive force of the 2018 Order [that repealed federal net neutrality rules] and federal law more broadly by claiming that it is merely exercising its spending power like any private market participant. The Executive Order and [legislation] expressly regulate ISPs' provision of service to all customers throughout the State, not just to government customers and contracts. Controlling judicial precedent holds that states may not escape federal preemption by regulating indirectly through their spending, procurement, or other commercial powers what they are forbidden from regulating directly. Indeed, if states were permitted to circumvent federal preemption in this manner, they would have a free hand to use their spending powers to undermine established federal law on virtually any topic—including civil rights, religious freedom, and a variety of other issues.The lawsuit could serve as a test case for other states that are attempting to regulate net neutrality indirectly through state contracts. Besides Vermont, the governors of Hawaii, Montana, New Jersey, New York, and Rhode Island have also issued executive orders to impose net neutrality rules on ISPs that provide Internet service to state government agencies.Oregon also imposed a state law that forbids state agencies from purchasing fixed or mobile Internet service from ISPs that violate core net neutrality principles.Like California, the state of Washington went further and imposed net neutrality rules on all ISPs.The US Department of Justice also sued California to stop its net neutrality law. But the key question of whether the FCC may preempt any state net neutrality law, no matter how broad, will be decided in a different case pending at the US Court of Appeals for District of Columbia Circuit. In that suit, state attorneys general and other litigants sued the FCC to reverse the repeal of federal net neutrality rules and the preemption of state laws.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}