{"id": "True Detective seems ready to return to top form in new S3 trailer", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Nov 2, 2018 8:35 pm UTC\nWe'd almost forgotten about HBO's uneven crime anthology series True Detective. It had a fantastic first season, only to hemorrhage viewers with the abysmally dreary, disappointing second season. But now the series is coming back for season 3, and if the new trailer is any indication, it's a welcome return to form.The brainchild of former lit professor and novelist Nic Pizzolatto, True Detective has always fostered a very literary, philosophical tone, and, shall we say, unhurried pacing. When it works, it's brilliant. Season 1 was set in the Louisiana Bayou, as Detective Rustin \"Rust\" Cohle (Matthew McConaughey) and his partner Detective Martin \"Marty\" Hart (Woody Harrelson) tracked down a twisted serial killer with a fondness for leaving weird twig sculptures in the woods.The spooky setting and strong chemistry between the lead actors pretty much ensured its success with viewers and critics alike. It was well-plotted to reel the viewer in, and the dialogue between McConaughey and Harrelson yielded some much-needed comic relief. (Only McConaughey could pull off those long, drawling abstract ruminations without everyone wanting to strangle him, his partner included.)And then season 2 dropped like a lead balloon. Despite strong performances from leads Colin Farrell, Rachel McAdams, and Taylor Kitsch, the plot was a mess—something about a dead city manager, political corruption, and a crime boss' ill-fated rail project, all set in the fictional town of Vinci, California. The dialogue just didn't have the same shine this go-round, either.Today's trailer gives us hope that True Detective might recapture some of that fine season 1 magic. Season 3 is set in the Ozarks over three separate time periods, and it stars Oscar-winning actor Mahershala Ali (Moonlight, Cottonmouth in season 1 of Luke Cage) as Detective Wayne Hays. Hays is haunted by a 1980 case involving two missing children, and he seems to be harboring some of his own dark secrets to boot. Personally, I would watch Ali read the phone book; he has a riveting screen presence. So if anyone can pull off Pizzolatto's bordering-on-lugubrious dialogue, he can.And notably, this trailer reintroduces some elements that made season 1 so enjoyable: a mysterious cold case in an atmospheric setting; a community harboring lots of secrets; conflict and violence simmering just below the surface; and a cop tormented by regret and personal demons. When the show returns on January 13, here's hoping the full season measures up to the trailer.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}