{"id": "VA’s software so SNAFU’d that vets were made homeless waiting for benefits", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nSean Gallagher\n    -  Nov 12, 2018 4:44 pm UTC\nThe Department of Veterans Affairs has acknowledged that the failure of a new IT system for processing claims for Post-9/11 GI Bill benefits has been holding up payments for months and causing financial hardship for thousands of veterans. \"Many of our Post-9/11 GI Bill students are experiencing longer than typical wait times to receive monthly housing payments,\" the VA said in a statement, with processing times averaging \"a little over 35 days\" for first-time veteran applicants. More than 82,000 veterans were still waiting for housing payments for the fall semester as of November 8, with some having lost housing as the result of non-payment.In a statement issued by the VA on October 25, a spokesperson said:We continue to experience a high pending claims inventory which is causing continuing processing delays for some GI Bill students. We apologize for these delays, and want to assure you we are doing everything in our power to reduce the pending workload, address the oldest claims, and continue to test the housing payment IT modifications required for the Colmery Act. As of October 24, our pending work is continuing to go down, and we are maintaining our focus on the oldest items. As we get reports of hardship situations we are addressing those immediately.Passed in July 2017, the Colmery Act (also known as the Forever GI Bill) added new housing allowances based on the ZIP code of the school being attended by veterans. Previously, benefits were based on where the veterans lived before they enrolled in school. But the VA found that the software was improperly calculating benefits. Since the school year had already begun, the VA rolled back to the 2017 system—resulting in smaller housing stipend payments to veteran students by 1 percent. Then the old system broke down under a stress test, which delayed the process of having schools enroll students for benefits until July 16. Even then, many schools delayed filing information because they were told that they would have to resubmit it when a software update was rolled out in August.That delay has resulted in a massive meltdown of claims processing. As NBC reported, some veterans have been forced to pay housing costs on their own by either depleting their own savings or borrowing from others for months now, with some losing their housing and facing homelessness.This is in many ways a repeat of the problems the VA faced after the passing of the Post 9/11 GI Bill. In 2009, some veterans waited as long as four months for payments, and the VA had to send specialists out to write emergency $3,000 checks to fill the gap. But it also comes at a time when nearly all of the VA's major software efforts are coming off the rails. A GAO report in January 2018 found that the VA had wasted more than $1.1 billion on failed electronic medical records projects. And a 2011 $543 million contract with HP Enterprise Services for a system to track the location of medical equipment, labeled as in danger of \"catastrophic failure\" in a 2017 VA inspector general report, is still not complete. You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}