{"id": "Two orbiters begin their long journey to Mercury Friday night", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Oct 19, 2018 2:41 pm UTC\nOne might think it's a relatively easy thing to reach Mercury, the innermost planet in the Solar System. At its closest approach, Mercury is just 77 million kilometers from Earth, or not all that much farther than the closest that Earth comes to Mars. The Earth-Mars transit typically only takes about six months.However, the Sun's enormous gravity makes putting a spacecraft into orbit around Mercury quite difficult. How much gravity are we talking about? The g-force at the surface of the Earth is 9.8 meters/second^2. By comparison, the Sun's gravity is nearly 30 times greater, at 274 m/s^2.To overcome this gravity, a mission intended to reach a stable orbit around the tiny planet of Mercury (with a gravity of just 3.7 m/s^2) therefore requires an enormous amount of energy—more than is required to send a probe to Pluto. Over the course of such a mission, a spacecraft must build up energy to resist the Sun's gravitational pull and slide into orbit around Mercury.Enlarge / It is no easy task to put a spacecraft into orbit around Mercury. ESAThe European Space Agency's BepiColombo mission, which launches Friday night from Kourou, French Guiana, will carry not one but two orbiters to the small, gray world. And while it has one of the world's most powerful launch vehicles in the Ariane 5 rocket, it will still require a seven-year journey to enter orbit around Mercury rather than the Sun. During that time, the spacecraft will make one flyby of Earth, two of Venus, and six of Mercury before finally reaching its destination.Only in March 2026 will science activities begin in earnest around the planet Mercury. BepiColombo is Europe's first mission to the planet, and it is intended as a follow-on to NASA's Messenger spacecraft that spent a period from 2011 to 2015 at Mercury and studied its chemistry, geology, and magnetic field.BepiColombo, named after the 20th century Italian scientist Giuseppe \"Bepi\" Colombo who studied the planet Mercury, is a European-built spacecraft that will transport the European Space Agency's Mercury Planetary Orbiter and the Japanese Space Agency's Mercury Magnetospheric Orbiter to their final orbits, which will bring them down to within a few hundred kilometers of the planet's surface.Overall, the orbiters will investigate a number of important scientific questions, including how the planet Mercury formed in a stable orbit so close to the Sun. For example, Messenger found that Mercury's radius has shrunk by about 7km as the planet's interior cooled. BepiColombo will image the planet at a higher resolution and attempt to improve the scientific understanding of how a planet without plate tectonics cools. More information on the orbiters and their scientific objectives can be found in the mission's press kit.The spacecraft and its orbiters are also outfitted with technology such as a sun shield and multilayered insulation to resist temperatures ranging from -100° to 450° Celsius. European engineers plan to use knowledge gained from the operation of BepiColombo to develop a future mission to study the Sun.Arianespace, Europe's primary launch company, has already rolled the Ariane 5 rocket and its payload to a launch pad in South America. Launch time is set for 9:45pm ET Friday (01:45 UTC Saturday). A livestream of the launch will begin about 30 minutes before the scheduled liftoff time.Listing image by ESAYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}