{"id": "Before crucial holiday season, Nintendo struggles as Sony shines", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nKyle Orland\n    -  Oct 30, 2018 3:02 pm UTC\nLet's start with Nintendo, which recently announced worldwide shipments of 3.2 million Switch systems in the July through September quarter. The good news is, that's up slightly from the 2.93 million sold in the same period a year ago. The bad news is that slight increase doesn't put Nintendo on track to meet its long-standing projection for 20 million Switch units sold during the fiscal year (which ends in March 2019). Overall, Nintendo's quarterly profits and revenues both came in significantly below analyst estimates as well, though both were up from a year prior.A strong holiday season could give Nintendo the boost it needs to hit that target, of course. But Nintendo's next two months feature only a couple of major first-party titles—November's Pokémon: Let's Go and December's Super Smash Bros. Ultimate—alongside a laundry list of third-party ports and downloadable indie games.The worry for Nintendo is that last year's pent-up demand for marquee Mario and Zelda titles (not to mention Mario Kart and Splatoon sequels/remakes) has already been spent, so to speak. Nintendo's 2018 first-party releases—including Donkey Kong: Tropical Freeze, Kirby Star Allies, and Mario Tennis Aces—haven't sold nearly as well as last year's Nintendo juggernauts. That relative first-party software trickle may not be enough to sustain sales until promised Metroid and Pokémon games show up.The PS4's prospects have been boosted by a pair of major exclusives this year: God of War in April, which sold 3.1 million copies in its first three days; and Spider-Man in September, which sold 3.3 million in its opening weekend. And while the Switch is struggling to attract many major third-party titles, games like Red Dead Redemption II, Battlefield V, and Fallout 76 could attract customers to Sony's (and Microsoft's) console this holiday season.Nintendo and Sony's stock market performance shows just how much the conventional wisdom around the two companies has shifted of late. Since the beginning of the year, Sony stock is up just over 11 percent, while Nintendo's is down nearly 17 percent. Not exactly what many would have predicted for this point going into 2018.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}