{"id": "After man was gunned down by US Park Police, two lawmakers want more body cams", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Nov 17, 2018 12:00 pm UTC\nThe law is meant to prevent situations like the November 2017 death of an unarmed Virginia man, Bijan Ghaisar, who died at the hands of United States Park Police officers in Fairfax County, Virginia. The 25-year-old had fled a car crash, but it remains unclear exactly why federal officers opened fire.The House members, Rep. Eleanor Holmes Norton (D-DC) and Rep. Don Beyer (D-VA), said in a Friday statement that absent dashboard camera footage, Ghaisar’s parents would know even less than they currently do as the FBI has yet to release any public information about the case.\"The Ghaisars have experienced a tragedy with no access to information and would still be left completely in the dark if it were not for the Fairfax County Police Department,\" Norton said in a statement. \"We owe it to the Ghaisars to do everything we can to ensure other families are not similarly left in the dark.\"The two lawmakers note that both DC and Fairfax County mandate their officers to already observe a camera requirement.According to the National Conference of State Legislatures, just five states have enacted laws that require at least some officers to use body-worn cameras.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}