{"id": "French investigators to work directly with Facebook to monitor hate speech", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nCyrus Farivar\n    -  Nov 12, 2018 11:03 pm UTC\nIn a French-language speech before the Internet Governance Forum held in Paris on Monday, French President Emmanuel Macron said that the two sides would work together for six months starting in early 2019 to come up with \"joint, precise, and concrete\" proposals that both Menlo Park and Paris could agree with.LIVE l Ouverture du Forum sur la Gouvernance de l'Internet. #GovTechSummit #IGF2018https://t.co/fKXpXDjP4G— Emmanuel Macron (@EmmanuelMacron) November 12, 2018\"There's a Californian Internet and a Chinese Internet,\" he explained, urging those in attendance to seek a middle-ground \"European\" model.In a 49-minute address, Macron outlined what he meant and encouraged private companies to collaborate with government to codify this in regulations.Macron called for a \"common roadmap,\" which would include user-data protection and regulation of content.However, European laws are generally less permissive than the sweeping powers of the First Amendment, which generally permits hate speech. So, it remains unclear how the global community can come to agreement as to what speech would be allowed.The French government has also proposed a \"Paris Call,\" which features a list of supporting companies, organizations, and national governments, ranging from Estonia to the United Arab Emirates. The United States is not on the list.Facebook spokesman Andy Stone emailed Ars to say that this was not an \"'embed' program.\"He continued:It's a pilot program of a more structured engagement with the French government so that both sides can better understand the other's challenges in dealing with the issue of hate speech online. The program will allow a team of regulators, chosen by the Elysée, to familiarize [itself] with the tools and processes set up by Facebook to fight against hate speech. The working group will not be based in one location but will travel to different Facebook facilities around the world, with likely visits to Dublin and California. The purpose of this program is to enable regulators to better understand Facebook's tools and policies to combat hate speech and, for Facebook, to better understand the needs of regulators.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}