{"id": "There’s a new record-holder for closest human object to the Sun", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nEric Berger\n    -  Oct 30, 2018 1:26 pm UTC\nIn August, the Parker Solar Probe rocketed away from Earth aboard a Delta IV Heavy booster. The relatively small, 685kg spacecraft needed to achieve a high speed in order to establish an orbit around the Sun—rather than getting drawn into the star's massive gravity well never to escape.According to NASA, the spacecraft is well on its way. The space agency reports that the probe now holds the record for closest approach to the Sun by a human-made object, passing inside the current record of 42.7 million kilometers from the Sun's surface on October 29, 2018, at about 1:04pm ET (17:04 UTC). The previous record was established in April 1976, by the German-American Helios 2 spacecraft.“It’s been just 78 days since Parker Solar Probe launched, and we’ve now come closer to our star than any other spacecraft in history,” said Project Manager Andy Driesman, from the Johns Hopkins Applied Physics Laboratory in Laurel, Maryland, in a news release. “It’s a proud moment for the team, though we remain focused on our first solar encounter, which begins on Oct. 31.\"Later today, the solar probe should also break Helios 2's record for velocity relative to the Sun of 246,960 km/hour. The probe is still moving closer to the Sun and should reach its first relatively close encounter with the star on November 5. At its closest approach in 2024, the probe is due to get within 6.2 million kilometers of the Sun's surface.The primary purpose of the Parker Solar Probe is to study the solar wind. It is named after Eugene Parker, who first theorized a stream of particles was flowing away from the Sun about six decades ago. Over time, astronomers came to accept this idea, and then they began to study this moving plasma of electrons and its effects on the Solar System, from the loss of Mars' atmosphere to space weather on Earth and the protection of orbiting satellites.But to truly understand solar wind, scientists need to get closer to the Sun, and they've been thinking about such a mission such as the Parker Solar Probe since the late 1970s. The probe is now in the process of aligning itself into an elliptical orbit that will enable studies of the solar wind near its source. The spacecraft should complete the last of its two-dozen close flybys of the Sun in 2025.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}