{"id": "Free Flickr accounts slashed to 1,000 pictures; the rest will be deleted", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nPeter Bright\n    -  Nov 2, 2018 6:40 pm UTC\nVenerable photo sharing site Flickr has announced that from January 8, 2019, free accounts will be limited to 1,000 photos or videos. Any content above that limit will be deleted, starting February 5, 2019, beginning with the oldest images first. To go beyond the 1,000 item limit, you'll have to pay $50/year for Flickr Pro.Created in 2004, Flickr was bought by Yahoo in 2005. The original model was that free accounts were limited to 200 pictures, with payment required to go beyond this limit. During Yahoo's ownership, free Flickr accounts were made more and more capable, with the biggest change coming in 2013, when free accounts were given 1TB of total space. Yahoo was bought by Verizon in 2017, and in April of this year, Flickr was sold to SmugMug, another photo hosting site.Flickr's new owners say that the change is being made to better concentrate on what Flickr should be: a community for photographers to store, showcase, and talk about their work. Expanding storage to 1TB for free accounts brought in the wrong kind of users—not people who loved photography, but rather people attracted by a large bitbucket they could dump files into.The large storage offer also pushed Flickr in the direction of collecting data about users to subsequently sell to advertisers. SmugMug wants Flickr to be funded through subscriptions, not advertising or data collection, so the focus can be on providing (paying) customers with the features they want rather than simply attracting ever greater numbers of (free) users and showing them tailored advertising. In giving away so much for free, SmugMug also maintains that Yahoo was devaluing Flickr, especially its community aspect.As such, the new policy marks a return to something much closer to Flickr's original business model. Free accounts are there to give users a taste of what the platform offers, but any more serious use will require a subscription. It's also an explicit rejection of the data-hungry business model used by services such as Facebook's Instagram where, as the old mantra goes, if you're not paying, you're the product.For serious Flickr users, this is likely to be a positive change. However, the way in which SmugMug is handling the transition leaves many concerned. The company says that some 97 percent of free accounts have fewer than 1,000 pictures and videos anyway, so they will be unaffected by the new limit. But for those accounts that do pass the limit, the decision to actually delete pictures (rather than merely freeze the accounts and prevent any further uploads) represents a kind of destruction that should alarm any users of any kind of online storage provider. Those pictures and videos that SmugMug plans to delete come February may be the only copies of those photos.If a malicious hacker were to break into Flickr's systems and perform such a deletion, then they'd rightly be labelled a harmful, destructive vandal. The same action taken by Flickr's owners is no less vandalistic, even if it is, technically, SmugMug's right to discard those excess photos.This may be bad news for more than just the owners of those pictures. Flickr is also a substantial repository for Creative Commons-licensed works, and there are fears that many of the deleted pictures will be Creative Commons licensed, robbing a wider community of permissively licensed images.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}