{"id": "Legendary Marvel Comics creator Stan Lee has died", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nNathan Mattise\n    -  Nov 12, 2018 7:07 pm UTC\nStan Lee—the Marvel Comics legend responsible for cultural icons from Spider-Man and Iron Man to X-Men and Black Panther—has died, according to multiple reports from places like TMZ and The Hollywood Reporter.THR spoke with a source that said Lee died early Monday morning at Cedars-Sinai Medical Center in Los Angeles. TMZ spoke to Lee's daughter, J.C., who said an ambulance rushed to Lee's Hollywood Hills home early Monday morning to take him to Cedars-Sinai. That outlet noted Lee had suffered several illnesses over the last year or so, including dealing with pneumonia. Lee was 95 years old.\"My father loved all of his fans,\" J.C. Lee told TMZ. \"He was the greatest, most decent man.\"Indisputably, Lee's decades-spanning career has spawned some of the most beloved pop-culture characters and franchises of all time. He began working on comics as an assistant at Timely Comics in 1939; that entity would eventually morph into Marvel Comics in the 1960s. Alongside other eventual giants of the industry like Jack Kirby and Steve Ditko, Lee helped create seemingly every adored comic hero this side of Batman, Superman, and Wonder Woman: in addition to the credits above, Lee had a hand in the Hulk, Doctor Strange, the Fantastic Four, Daredevil, and characters like Ant-Man and Thor, among others.Over time, the industry veteran held virtually every position within Marvel Comics—writer, editor, publisher, media producer, television host, actor, and perhaps most notably, president and chairman. In the 1980s, he even moved west to help the company start its then-nascent film and TV initiatives, something Marvel has arguably become better known for than the comics themselves (take your pick—Captain America, Iron Man, Spider-Man, Logan, Deadpool, Guardians of the Galaxy, Jessica Jones, and on and on). Lee also publicly advocated for the storytelling potential in video games, famously saying the medium had surpassed film itself in the late aughts.That unparalleled body of work helped Lee earn just about every award available within the comics world: Lee entered the Will Eisner Award Hall of Fame in 1994 and the Jack Kirby Hall of Fame in 1995. He received a National Medal of Arts in 2008.Lee's career was not entirely without controversy, of course. Around the time of the first Avengers movie, for instance, media reflections on his relationship with Kirby renewed a discussion about content creators versus those who receive the ultimate credit within the industry (see Grantland, Comics Alliance, Slate, etc.). And over the last two decades, Lee himself has been tangled up in lawsuits over various rights—he sued Marvel directly in the early 2000s for not fulfilling the terms of his employment contract (specifically, payments Lee believed he deserved when Marvel film franchises finally took off). Just this year, Lee dropped a $1 billion lawsuit against his former company, POW! Entertainment, regarding rights to use his name and likeness.Still, the impact of Lee's work and contributions to today's pop culture landscape likely cannot be overstated. Tributes from the larger community have started popping up—Dark Knight ink master Frank Miller tweeted that Lee \"was a childhood inspiration, an instructor to me when I was just getting started, and a genuinely sweet man.\" DC Entertainment Chief Creative Officer-Publisher/legendary comics artist Jim Lee (no relation) offered his own deeply personal tribute through Twitter:Stan Lee gave so much to so many, but to me, a shy, awkward kid—growing up as an immigrant in a strange, new world—Stan Lee gave me the greatest gift of all. He gave me a place to escape into—an endless, imaginative playground filled with the most amazing, fantastic, and uncanny heroes ever. And through these characters, Stan Lee gave me my childhood and showed me the value of being different. To embrace heroism and to shun prejudice. That it was cool to want to be the goody and that there was a price for not standing up for the downtrodden, the oppressed, the little guy...After today, comic book fans of all stripes hope to see at least one more famed Lee cameo in a superhero film, depending on what productions have wrapped. For now, we all at least have the last Lee cameo that hit any screen, courtesy of Insomniac Games' well-received Spider-Man game from earlier this year.Listing image by Evan Hurd/Sygma/Corbis via Getty ImagesYou must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}