{"id": "Vivaldi 2.0 review: The modern Web browser does not have to be so bland", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nScott Gilbertson\n        -  Oct 19, 2018 1:10 pm UTC\nThe Web browser is likely the most important piece of software on your hardware, whatever that hardware may be. In fact, whenever a new bit of hardware arrives that somehow lacks a way to browse the Web, invariably one of the first things enthusiasts will do is figure out a way to run a browser on it.Despite their ubiquity, though, there remains very little difference between common Web browsers. Most people seem to get by with whatever was installed by default, and no wonder. Modern browsers like Edge, Internet Explorer, Firefox, Chrome, Safari, and Opera are largely indistinguishable both in appearance and features—why bother with one over the other?But this uniformity is its own choice, the result of a particular approach to software development. The prevailing wisdom of the moment is that Web browsers should be like children of the Victorian Age: seen and not heard. Or, maybe more specifically in the case of browsers, neither seen nor heard.Fortunately for those of us who would like something different, something we can bend to our will rather than the other way around, there is an alternative. It's called Vivaldi.Vivaldi first came upon the Ars radar in early 2015. And given that uniformity mentioned above, it stood out quickly. Led by CEO Jon S. von Tetzchner, co-founder and former CEO of Opera, the primary goal seemed to be rebuilding the browser that Opera once was—the power user's browser. And by the time its 1.0 came around the following spring, Vivaldi appeared to be on the right track. This could be the cure for the common browser.Roughly a year and a half later, Vivaldi has recently hit the 2.0 milestone. You can download the latest version from the Vivaldi site or install it through the app store or package manager of your OS. And at first blush, perhaps the most shocking thing about this release is that it's merely 2.0. This release is a throwback to an earlier time when version numbers had meaning, and a major number increment meant that something major had happened.While the version number here does mean something, it's also perhaps a tad misleading. Under the hood, Vivaldi tracks Chromium updates, and, like Chrome and Firefox, it issues minor updates every six weeks or so. That means some of the features I'll be discussing as part of 2.0 actually trickled in over time, rather than arriving all together in one monolithic release. It also means that under the hood Vivaldi 2.0 uses Chromium 69.But if you'd like to go beyond the vanilla browsing experience offered by the big-name browser makers, if you'd like to customize your browser in myriad ways, and if you'd like to have more control over your browsing experience, Vivaldi 2.0 is well worth trying.Vivaldi 2.0 has several headline-grabbing new features, but the most welcome is undoubtedly the new syncing feature.Vivaldi 2.0 can synchronize your bookmarks, passwords, autofill data, typed URLs, notes, remote sessions, and some, though not all, of your settings between installs.Syncing data is no small undertaking since it requires a server-side component as well as the in-browser UI. Because of its focus on data privacy, Vivaldi opted to build its own sync tools, and the company did so in such a way that your data is encrypted end-to-end (provided you set a password, which you should). Vivaldi stores, but has no way to read, your data. It isn't sending any data to third-party servers at all; everything is in-house.While I don't actually have a use for sync until there's a mobile version of Vivaldi, I've been testing Vivaldi's syncing features for over a month now. While syncing everything between my machine and my wife's machine, I have yet to experience any hiccups or problems. It just works.Vivaldi's von Tetzchner tells Ars that sync will be evolving quickly from here, hopefully soon including the ability to sync more settings, history, Web panels, themes, and more.As welcome as sync is, there's something a little bittersweet about it since it makes a mobile version of Vivaldi even more desirable. Thus far that doesn't exist. Publicly anyway, von Tetzchner tells Ars that the mobile version does exist but that it isn't ready for prime time yet. He did not give me any kind of time frame, but I think it's safe to say that a mobile version of Vivaldi is a very high priority.In the meantime, there are quite a few other improvements in Vivaldi 2.0 that make it an even more powerful tool than before. One feature that I haven't seen Vivaldi tout much is how much faster Vivaldi 2.0 is than it was back in the 1.0 days. According to von Tetzchner, some of the speed boost is a result of Chromium improvements, and some of it is related to a significant Chromium change that came along last year, which forced Vivaldi's engineers to refactor a considerable amount of code, speeding up the browser in the process.Whatever the case, Vivaldi 2.0 is noticeably faster than 1.0, both in terms of UI and page load speeds. In my testing, this improvement is most noticeable if you have a lot of tabs open, as well as a lot of bookmarks and notes. (As an aside, if you do have a lot of tabs open, periodically right-click the active tab and select \"Hibernate Background Tabs.\" This will stop background tabs from eating up memory. In my testing, this can free up as much as 500MB of RAM. Ah, JavaScript, what would RAM makers do without you?)This is the third time I've covered Vivaldi for Ars, so before I dig in to some of the nice refinements in 2.0, I wanted to briefly revisit some previous nitpicks. In my review of Vivaldi 1.0, I criticized Vivaldi for a few missing features, like no syncing between computers, no mobile version, no way to dock the developer tools panel, and no way to customize buttons in the URL bar.I'm happy to report that Vivaldi 2.0 has solved nearly all these problems plus a slew of smaller ones. (The lingering exception is, of course, that lack of a mobile version.)After the sync and speed improvements, Vivaldi 2.0's feature list becomes a browser tinkerer's wonderland. Vivaldi's MO has always been to continually refine and fine-tune existing features, and this release is no exception. There are so many new options, added little features, and tweaks that it's tough to know where to start. I highly recommend checking out the Vivaldi blog for more details and the complete list of everything that's new in 2.0.My favorite feature in this release is in Vivaldi's Tab Tiling feature. Perhaps one of Vivaldi's most innovative features, tab tiling allows you to view several tabs in a single window that's split into little subwindows (nerds: think tmux in your browser). As someone who does a tremendous amount of online research, especially comparing things, this feature is what made Vivaldi my default browser years ago. I can't imagine browsing the Web without it.In Vivaldi 2.0, you can now resize each tiled tab's window by dragging that tile's border. Even better, your customized layout persists through restarts and loading of saved sessions.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}