{"id": "Another Defender bites the dust as Netflix cancels Luke Cage", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nJennifer Ouellette\n    -  Oct 20, 2018 5:08 am UTC\nJust one week ago, Netflix surprised us all by canceling Iron Fist after a much-improved second season. Now we can add Luke Cage to the casualties.Netflix unexpectedly pulled the plug on a third season today. This reduces the original Defenders to Jessica Jones, The Punisher, and Daredevil, whose third season just made its debut.This is frankly a huge disappointment to fans of the Defenders series. Luke Cage had a strong first two seasons, with a terrific supporting cast—most notably Alfre Woodard as Mariah Dillard and Theo Rossi as her right hand, Hernan \"Shades\" Alvarez. While season 2 was a bit uneven, it ended with the dearly departed Mariah turning the tables on Luke, deeding him the Harlem's Paradise nightclub. We were looking forward to seeing what kind of corrupting influence that kind of power might have had on Harlem's hero.Here's the joint statement from Marvel and Netflix:Unfortunately, Marvel's Luke Cage will not return for a third season. Everyone at Marvel Television and Netflix is grateful to the dedicated showrunner, writers, cast, and crew who brought Harlem's Hero to life for the past two seasons and to all the fans who have supported the series.However, a source told The Hollywood Reporter the cancellation was due to \"creative differences and the inability to agree to terms for a third season of the show.\" That might come as a surprise, since a a third season was considered all but a done deal, with scripts in development and all the main actors still under contract. But then the writer's room was suspended in September with rumors of trimming the season from 13 episodes to ten.Deadline Hollywood has more:It eventually escalated to behind-the-scenes turmoil in the past two days and demands for changes in creative reign. With Marvel and Netflix seemingly in intractable and different sides of the disputes, a harsh cancelation became the only viable exit strategy, it appears.So far, there has been no comment from star Mike Colter or showrunner Cheo Hodari Coker. But Finn Jones, star of the also-cancelled Iron Fist, showed his solidarity by posting an image on Instagram of the Iron Fist meeting the fist of Luke Cage, punctuated by two fist emojis (one black, one white) on either side of a heart.UPDATE: Hodari Coker weighed in with grace on Twitter: \"A lot memories. A lot of individual thank you calls to make. Just want to say thank you to Marvel, Netflix, the best Writer’s room, cast, crew, the Midnight Hour, all those who graced the stage at Harlem’s Paradise and the most incredible fan base in the world. Forward always...\"You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}