{"id": "Cats, beetles, other mummified animals found—along with a sealed door", "paragraph": "Front page layoutSite themeSign up or login to join the discussions!\nKiona N. Smith\n    -  Nov 12, 2018 11:19 pm UTC\nArchaeologists discovered dozens of mummified cats in seven previously undisturbed tombs in a 4,500-year-old pyramid complex near Saqqara, south of Cairo. The cats were found along with a collection of mummified scarab beetles, gilded wood cat statues, painted animal sarcophagi, and other artifacts.Today, dozens of intact mummies of any species are a relatively rare find for archaeologists, but mummifying cats and other animals was a common practice in Egypt for thousands of years. The Saqqara cats, like millions of others throughout Egyptian history, would have been bred and raised for eventual mass sacrifice to the protective goddess Bastet, who often appears in Egyptian art as a woman with the head of a lioness or, after about 1000 BCE, a domestic cat.Most of those once-common mummies were lost to rampant looting across the centuries, which peaked between the 1700s and early 1900s. Europeans looted hundreds of thousands of animal mummies, including baboons, cats, crocodiles, and ibises, most of which were destroyed to make fertilizer.One collection of ibises played a role in the early debate about evolution. More recently, genetic studies of ancient Egyptian cat mummies have offered hints about how domestic cats have changed over the last few thousand years, as well as when (and how) the process of feline domestication started. It’s possible that this collection could help shed more light on some of those questions, as well as filling in more detail about Egyptian mummification and religious practices.Other ancient tombs have yielded countless mummified ibises, and archaeologists have also found mummified baboons and crocodiles. But the scarabs are a more unusual find. Archaeologists found two large beetles wrapped in linen and tucked into a limestone sarcophagus with a carved lid, along with a collection of even more mummified beetles in a smaller sarcophagus. Carved amulets, seals, or illustrations of scarabs are common at Egyptian sites, because the god Ra was believed to take the form of a scarab to roll the Sun above the horizon every morning. But actual preserved beetles are another matter.“A couple of days ago, when we discovered those coffins, they were sealed coffins with drawings of scarabs. I never heard about them before,” Mostafa Waziri, secretary-general of Egypt’s Supreme Council of Antiquities, told Reuters.Along with the mummified cats and scarabs, the Saqqara tombs contained more than a hundred gilded wooden cat statues and one of solid bronze, all dedicated to Bastet, as well as gilded statues of lions, a cow, and a falcon. Archaeologists also found painted wood sarcophagi containing a mummified crocodile and two mummified cobras, as well as an assortment of amulets, canopic jars, writing instruments, and papyri, all of which could help reveal more about life and death in Egypt’s Old Kingdom.An undisturbed ancient Egyptian tomb is a rare find, and archaeologists from Egypt’s Ministry of Antiquities have discovered and excavated seven of them in the last six months of work at a buried ridge near the edge of the Saqqara pyramid complex. The complex served as a necropolis for the Old Kingdom capital of Memphis, and the recently excavated tombs date to Egypt’s fifth dynasty—the line of pharaohs that rose to power just after the builders of the Great Pyramid and its neighbors at Giza. Work resumed at the sites earlier in 2018, following a hiatus in 2013.The Ministry of Antiquities says that its archaeologists made one more surprising find over the weekend while preparing to announce the newly discovered animal mummies: an intact, sealed door, behind which lies another tomb. Because the façade and door remain intact, it’s likely that living eyes have not seen inside the tomb in more than 4,000 years. Archaeologists plan to open it, along with a handful of others at the complex, over the next few weeks.You must login or create an account to comment.Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.\n  CNMN Collection\n  WIRED Media Group\n  © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices\n"}