{"id": "Florida yoga shooter spouted misogynistic and racist views on YouTube", "paragraph": "Scott Beierle, the man who killed two women at a yoga studio in Tallahassee, Florida, before apparently killing himself, appeared to have posted dozens of misogynistic and racist videos and songs to YouTube and SoundCloud before the attack.Tallahassee police identified Beierle, 40, as the shooter who killed Nancy Van Vessem, 61, and Maura Binkley, 21, and injured several other people inside Hot Yoga before turning the gun on himself on Friday.An account that appears to be Beierle's posted several grainy, dimly lighted videos four years ago, which show Beierle discussing his misogyny, as well as his racist beliefs, including that interracial couples stem from mental illness and that women who are promiscuous should be crucified.Beierle's 17 videos got only a handful of views, and his channel had only three subscribers as of Saturday before his account was removed by YouTube. His videos were first reported by BuzzFeed.\"Content of any type that promotes violence or includes hate speech is prohibited on YouTube. We carefully review the material in flagged videos against our Community Guidelines and remove content that violates these policies,\" according to a statement from the Google Press Team, which represents YouTube.Videos uploaded to the account included titles like \"The Rebirth of My Misogynism,\" \"The Dangers of Diversity\" and \"Dreadlocks are the Black Man's Mullet.\"A SoundCloud account, which has since been removed, that also appears to have belonged to Beierle featured racist and misogynist songs with titles like \"Bring Your Fatwa\" and \"I Don't F--- Fatties.\"Tallahassee police spokesman Damon Miller Jr. said he could not verify the accounts. SoundCloud did not immediately respond to a request for comment.In one video, titled \"Plight of the Adolescent Male,\" Beierle mentioned Elliot Rodger, 22, a self-described virgin, who killed six people in Isla Vista, California. Rodger is often referred to as an \"incel\" — short for \"involuntarily celibate\" — in toxic online message boards comprising people who also identify as incels.Beierle said in the video that he had a similar outlook to Rodger's when he was Rodger's age.In message boards and on forums for incels, users argued over whether Beierle was actually a \"Chad,\" the term used in the incel community to refer to men who are presumed to sleep with many women, or was too conventionally attractive to be a true incel.Regardless, posters celebrated the Tallahassee murders, and true to form, they blamed women for the violence.\"Women mock and ridicule virgin males and refuse to date them, then wonder why some guys lose it,\" one such poster said. Another wrote, \"I wish these happened every week.\"Police have yet to release a motive. However, Beierle had a history of harassing women, and police said \"he has been the subject of prior calls for service in the Tallahassee area related to harassment of young women.\" They did not elaborate.Beierle was arrested twice, once in 2012 and again in 2016, on charges of battery, accused of having inappropriately touched women, but the charges in both cases were dropped.As police continued to investigate, the incel community celebrated on forums, drawing parallels to past killings in which hate for women was a factor.In 2009, George Sodini, 48, walked into a Pennsylvania athletic club and shot 12 women in an aerobics class, killing three, before turning the gun on himself. Police said Sodini's motive was \"hatred\" after finding a plan for the attack and chilling rants about his misfortune with and hatred toward women in physical notes and an online blog.\"Women just don't like me. There are 30 million desirable women in the US (my estimate) and I cannot find one. Not one of them finds me attractive,\" he wrote.Several men have left behind similar manifestos, blaming the women who they say rejected them for the murders they would go on to commit. In 2014, Rodger listed sexual frustration and a hatred for women as his chief motivation for the attack.Rodger, who was killed during his shooting, left behind a 137-page manifesto, a series of YouTube videos and a slew of online rants that laid out his plan and the reasoning behind his rage.\"You will finally see that I am the superior one, the true alpha male,\" he said in one.Alek Minassian, who is accused of killing 10 people with a van in Toronto in April, also self-identified with the online community of misogynists, posting on his Facebook page before the attack that the \"incel rebellion has already begun.\"Kalhan Rosenblatt is a reporter for NBC News, based in New York.Brandy Zadrozny is an investigative reporter for NBC News.© 2018 NBC UNIVERSAL"}