{"id": "Former Adidas executive, two other basketball recruiting insiders convicted in corruption case", "paragraph": "NEW YORK — An Adidas executive and two other insiders from the high-stakes world of college basketball recruiting were convicted Wednesday in a corruption case that prosecutors said exposed the underbelly of the sport.A federal jury in Manhattan found former Adidas executive James Gatto, business manager Christian Dawkins and amateur league director Merl Code guilty of fraud charges.The trial centered on whether the men's admitted efforts to channel secret payments to the families of top recruits luring them to major basketball programs sponsored by Adidas was criminal. At stake was a fortune in revenue for the basketball programs and potential endorsement deals for the players if they went pro.Evidence included text messages between the defendants and coaches from top-tier coaches like Bill Self of Kansas and Rick Pitino of Louisville and testimony from the father of prized recruit Brian Bowen Jr. describing how a Louisville assistant handed him an envelope stuffed with cash.Prosecutors claimed the schools were in the dark about the payment schemes, including $100,000 promised to Bowen's family, that are outlawed by the NCAA. They accused the defendants of defrauding universities by tricking them into passing out scholarships to players who should have been ineligible.In closing arguments, prosecutor Noah Solowiejczyk recounted testimony from cooperators and wiretap evidence about how the defendants took steps to create false invoices to Adidas, route funds through various bank accounts and convert it to cash for the families.The behavior \"tells you an awful lot about the defendants,\" the prosecutor said. \"It tells you that what they were doing was wrong.\"The defendants didn't deny they sought to make the payments. But they argued that was how the recruitment game was played by Adidas, Nike and other sportswear companies - and that talent-hungry coaching staffs knew it.A lawyer for defendant Dawkins, who was instrumental in steering Bowen to Louisville, claimed his client thought he was helping the program succeed to the benefit of everyone involved.\"What proof did the government present that Louisville suffered any harm?\" attorney Steven Haney said in closing arguments. In Dawkins' mind, \"he thought what he was doing was OK.\"Defense attorneys sought to convince the jury the text messages and phone records showing Self and Patinto were in touch with the recruitment middlemen aligned with Adidas proved they had to be aware of the payments. They said further proof the schools weren't blind to the schemes was testimony by Brian Bowen Sr. claiming he received $1,300 from Louisville assistant Kenny Johnson and other testimony by a cooperator, former Adidas consultant, Thomas \"T.J.\" Gassnola, that he delivered $40,000 to North Carolina State assistant coach Orlando Early intended for the family of highly-touted point guard Dennis Smith Jr.In the texts last year, Gassnola told Self he was in the touch with the guardian of player Silvio De Sousa, who prosecutors say was among recruits whose families were offered secret payments.Self responded: \"We good,\" according to an exhibit of the communication.Gassnola said: \"Always. That was light work.\"Another exhibit showed how Dawkins texted Pitino as Bowen was nearing a decision about where he would play, asking, \"Would you have any interest in Brian Bowen or are you done with recruiting?\"Pitino responded: \"We would love to have him.\"The exhibit showed Gatto also reached out to Pitino by text asking if they could speak on the phone, and records show there was a conversation afterward.But there were no communications in which the coaches mentioned money. The coaches and the schools have either denied any wrongdoing or not commented on the case.Self remains at Kansas, where De Sousa is still on the team. Kansas announced this week De Sousa is being held off the court until information that came out of the trial was reviewed. But at Louisville, the scandal resulted in the firing of Pitino and forced Bowen to leave the university and pursue a professional career.The trial's most emotional moment came when a prosecutor first began questioning the elder Bowen about his son, who goes by the nickname \"Tugs.\"\"Is Tugs in college?\" asked prosecutor Edward Diskant.\"No, he's not,\" Bowen responded.When the prosecutor asked why not, Bowen dropped his head into his hands and wept.© 2018 NBC UNIVERSAL"}