{"id": "U.S. stocks continue to slide, Dow and S&P now down for the year", "paragraph": "U.S. stocks plunged again on Wednesday, confirming a correction for the Nasdaq and erasing the Dow and S&P 500's gains for the year, as disappointing forecasts from chipmakers and weak home sales data fueled jitters about economic and profit growth.The Nasdaq closed down 12.4 percent from its Aug. 29 record closing high, falling 4.4 percent for the day in its biggest one-day percentage decline since Aug. 18, 2011.\"It's a big global risk-off trade,\" said Paul Zemsky, chief investment officer of multi-asset strategies and solutions at Voya Investment Management in New York.\"We've had some headwinds, higher interest rates affecting housing, tariffs causing input costs for manufacturers to go up, which makes earnings look not as stellar ... but that doesn't mean the whole economy is rolling over,\" he said.Sales of new U.S. single-family homes fell to a near two-year low in September, the latest sign that rising mortgage rates and higher prices were hurting demand for housing.Adding to weaker sentiment in late trading, the Federal Reserve said in its latest report on the economy that U.S. factories have raised their prices because of tariffs.Stocks have been punished this month by a range of worries, from rising borrowing costs and bond yields to Italy's budget and the upcoming U.S. congressional elections in less than two weeks.The Cboe Volatility Index , the most widely followed barometer of expected near-term gyrations for the S&P 500, jumped 4.52 points to close at 25.23, its highest close since Feb. 12. The S&P 500 fell for a sixth consecutive day.\"It looks like more panic and fear as the selling has continued to roll,\" said Chris Zaccarelli, Chief Investment Officer for Independent Advisor Alliance based in Charlotte, North Carolina.The Dow Jones Industrial Average fell 608.01 points, or 2.41 percent, to 24,583.42, the S&P 500 SPX> lost 84.59 points, or 3.09 percent, to 2,656.1 and the Nasdaq Composite dropped 329.14 points, or 4.43 percent, to 7,108.40.On the earnings front, chipmakers Texas Instruments and STMicroelectronics warned of slowing demand. They followed disappointing forecasts on Tuesday from industrial giants Caterpillar and 3M .Texas Instruments dropped 8.5 percent, helping pull the Philadelphia Semiconductor index down 6.6 percent in its biggest daily percentage drop since October 2014. Intel , due to report earnings later this week, was down 4.7 percent.The beaten-down S&P technology sector retreated another 4.4 percent.While third quarter profit growth estimates have risen to 22.4 percent from 21.6 percent in the last 10 days, weaker forecasts have pulled down fourth quarter growth estimates to 19.5 percent from 20 percent, according to I/B/E/S data from Refinitiv.Declining issues outnumbered advancing ones on the NYSE by a 3.38-to-1 ratio; on Nasdaq, a 5.42-to-1 ratio favored decliners.The S&P 500 posted 14 new 52-week highs and 91 new lows; the Nasdaq Composite recorded 15 new highs and 445 new lows.About 9.6 billion shares changed hands on U.S. exchanges. That compares with the 8 billion daily average for the past 20 trading days.© 2018 NBC UNIVERSAL"}