{"id": "Following backlash, company stops selling Caitlyn Jenner costume ", "paragraph": "After defending its controversial \"I Am Cait\" Halloween costume, Michigan-based company Costume Agent said it is yanking the product.“As of this morning, we’ve decided to stop selling the costume,” a spokesperson for the company told NBC News. “After hearing concerns from those who are offended, regardless of our own thoughts and opinions, we decided to remove it.”In an interview with TMZ that was published Tuesday, a representative from the company said despite multiple threats, the product would continue being sold, adding, \"It's a costume. It's funny.\"The costume, which the company sold through eBay and Amazon, included a brunette wig, a gold medal and an outfit similar to the one Jenner wore during the 1976 Olympics — well before her 2015 gender transition. While Costume Agent claims the product is unisex, the model in one of its promotional images appears to be a bearded man.Following backlash from LGBTQ advocates who slammed the costume as transphobic and offensive, eBay pulled the product from its website Tuesday and, according to the Daily Mail, issued an apology.“This item is absolutely not permitted and the seller will be contacted directly,” an eBay spokesperson told the news outlet.But while Costume Agent said it is no longer selling the controversial costume, the product was still available on Amazon Wednesday afternoon through a reseller named Rad Kell. Other items sold by the reseller include camouflage apparel, Texas longhorn cookie cutters and American flag patches.A commenter on Amazon wrote, “This product is transphobic. If you buy this, and wear it, you are harming the trans community.”Transgender advocate Ashlee Marie Preston agreed, saying the costume is an “attack” on Jenner’s “trans identity.”“Pretending to celebrate Caitlyn Jenner in the product’s description while using her ‘dead name’ in the product’s title is the textbook definition of gaslighting,” Preston said. A “dead name” refers to a transgender person’s pre-transition name.Preston called out Amazon — which has a reputation for being a very LGBTQ-inclusive organization — for still selling the product.“I call on Amazon to stop straddling the fence as allies to the LGBTQ community and kowtowing to bigotry while pocketing the profits,” Preston said.Amazon did not immediately respond to NBC News’ request for comment.FOLLOW NBC OUT ON TWITTER, FACEBOOK AND INSTAGRAM© 2018 NBC UNIVERSAL"}