{"id": "Paul Manafort's health and age could help shorten his sentence", "paragraph": "Former Trump campaign chairman Paul Manafort appeared in a Virginia federal court Friday in a wheelchair, missing his right shoe, and appearing visibly grayer. His legal team advised Judge T.S. Ellis that Manafort, 69, was dealing with “significant” health issues related to his confinement, and asked the court to expedite his sentencing so that he could be transferred to a facility better equipped to take care of him.There’s no question that incarceration has negative health effects. It’s also probably part of a wise strategy for Manafort’s defense team to make these health issues known to the judge well in advance of the sentencing hearing. Manafort’s age and infirmity can bolster a defense argument to the judge for a significant reduction in his sentence.Federal judges are permitted to consider a defendant’s advanced age and health issues in order to impose fair punishment and provide essential medical care. Following an amendment to the Federal Sentencing Guidelines in 2010, the defendant’s age and physical condition, including his physique, may be relevant in reducing a sentence. However, this is only if the condition is unusual and distinguishable from other cases. An extraordinary physical impairment or a seriously infirm defendant can justify granting home detention as a less-costly option than imprisonment. The guidelines permit the court to consider alternative forms of incarceration for such an offender if those alternatives are “equally efficient” as prison.It’s not clear what health condition confined Manafort to a wheelchair with only one shoe on Friday. The court may consider a defendant’s need for medical care when fashioning a sentence. Courts have considered a variety of conditions during sentencing that can affect the feet, including diabetes, and gout. Still, Manafort’s defense team should be prepared to show that these ailments are extraordinary, and they cannot be treated adequately by the Bureau of Prisons.The Department of Justice has recognized that the aging process accelerates for prisoners. Elderly prisoners such as Manafort are more vulnerable to predators. They require special physical accommodations in a place that is not designed for special accommodation. According to the DOJ, the annual cost of incarcerating elderly prisoners has risen to an average of $60,000 to $70,000 for each elderly inmate, compared with about $27,000 for others in the general population.Manafort’s defense attorneys will probably use the defendant’s age and poor health to show how incarceration particularly harms the defendant, bolstering an argument for minimal confinement. They can also use his age and poor health to argue that he is not a threat to society, and therefore he is a good candidate for minimal confinement.Elderly defendants are substantially less likely than younger offenders to commit new crimes after they are released. The U.S. Sentencing Commission reported that over an eight-year period, only 13.4 percent of offenders age 65 or older were re-arrested compared to 67.6 percent of offenders younger than age 21 when they were released.Of course, expect the prosecutors to point out that after he was originally charged and out on release, Manafort committed new obstruction crimes by trying to influence witnesses. The government will surely counter that Manafort is one of those rare older offenders who is likely to commit new crimes — because he already did.Danny Cevallos is an MSNBC legal analyst. Follow @CevallosLaw on Twitter.© 2018 NBC UNIVERSAL"}