{"id": "Remains of dozens of fetuses removed from Detroit funeral home", "paragraph": "A funeral home in Detroit has been shut down after police on Friday discovered remains of numerous fetuses that had been improperly stored, according to officials.Police discovered three unrefrigerated boxes containing \"36 deceased bodies of fetuses or infants plus a deep freezer containing an unknown number of additional deceased bodies\" at the Perry Funeral Home, according to a press release from the Michigan Department of Licensing and Regulatory Affairs (LARA).The license for the funeral home and the license of its director Gary Deak have since been suspended.Deak did not immediately respond to a request for comment made by NBC News.However, the Detroit Free Press reported that another 27 remains were found in freezers, totaling 63 fetus remains found within the funeral home.Some of the remains date back to 2015, according to LARA, which described the funeral home as being in \"heinous conditions and negligent conduct.\"Perry Funeral Home also failed to certify and file death certificates for the bodies of fetuses and infants within 72 hours of death, according to LARA. In some cases, the home embalmed remains without the knowledge or consent of the families, the department said.Detroit Police Chief James Craig said during a press conference that the department was tipped off about the funeral home after a parent, involved in a civil suit over the improper burial of his daughter, saw another story about fetuses being improperly stored at the former Cantrell Funeral Home in Detroit.\"It's because of the first story involving Cantrell that the second issue emerged,\" Craig said.Earlier this month, the decomposing bodies of 10 fetuses and a baby were found above a ceiling of Cantrell Funeral Home.Craig said he had \"never seen anything\" like what was discovered at the two funeral homes.“I hope this is isolated to these two,\" Craig said. \"I can’t say that with certainty, and so this is much larger than we might know.\"Craig did not specify if families believed the remains had been buried or returned to them, and how that was accomplished. The remains recovered on Friday are now in custody of the state.Craig said a criminal investigation into the funeral home is ongoing.© 2018 NBC UNIVERSAL"}