{"id": "Pipe bombs mailed to political figures had matching characteristics", "paragraph": "The series of explosive devices that were sent to various political and media figures this week all had matching features, officials told NBC News on Wednesday night.Bombs sent to former President Barack Obama, former Secretary of State Hillary Clinton, former CIA Director John Brennan and former Attorney General Eric Holder on Wednesday all have the same characteristics as one sent to billionaire investor George Soros on Monday, three senior law enforcement officials with direct knowledge of the matter tell NBC News.The bombs each were made from PVC pipe with a digital timer attached to set off the detonator, the officials said. And each bomb also contained powder from either a low explosive or a pyrotechnic, as in fireworks.X-rays showed there were likely pieces of shrapnel inside of the PVC pipes, the officials said.Multiple senior bomb technicians briefed on the case said that the aspiring bomber had all the components necessary to set off a successful explosion.The bomb intended for Brennan was wrapped in tape and was designed to be functional, officials told NBC News. The device arrived at CNN's offices in a manila envelope that had an unknown white powder inside.It was addressed to Brennan (with his name spelled \"Brenan\") and had stamps and signatures on it, although he is now a senior national security and intelligence analyst for NBC News and MSNBC.Shortly after 10 a.m. ET CNN employees were forced to evacuate the Time Warner building in Manhattan after a package was discovered.Clinton's package was intercepted on Tuesday after it was discovered near her and Bill Clinton's Chappaqua, New York home, the Secret Service and FBI said. The package addressed to Obama was intercepted on Wednesday in Washington, D.C.The packages contained a return address that belonged to Rep. Debbie Wasserman Schultz, who also received a device that was initially intended for Holder but had the wrong address on it. Secret Service intercepted that package as well, the department said in a statement.Soros, a Democratic megadonor, first received a package at his home in Bedford, New York, on Monday.Forensics will now play a major role in identifying suspects, experts say. Authorities will check for fingerprints, DNA and any hair or fiber that may be preserved inside the packages. Any handwriting on the packages could also offer hints into the personality or even nationality of the sender, based on how letters and numbers are formed.© 2018 NBC UNIVERSAL"}