{"id": "McSally wields real ax on stage in Arizona — to cut taxes, not her opponent", "paragraph": "Republican Rep. Martha McSally wielded a literal ax on the campaign trail Sunday as she vowed to cut taxes if Arizona voters elect her to the Senate.\"I like this,\" McSally said of her \"tax ax.\" \"Remember, I'm a warrior.\"In the race, the candidates have certainly been getting creative in how they run for office: Democratic Senate nominee Kyrsten Sinema ran a half-marathon through Phoenix on Sunday morning, scoring a personal best race time of 1 hour and 43 minutes, according to her campaign. On Saturday, the pair attended the Arizona State University football game: McSally sang the national anthem, while Sinema did the coin toss.The Arizona Senate rivals aren't the only people pulling out all the stops and photo ops just two days before the midterm elections.Musician John Legend was rallying Ohio voters in three events Sunday, while Latina actresses rallied voters in the Florida governor's race. Former President Barack Obama and former Vice President Joe Biden were hosting two events each, while President Donald Trump had two rallies.Obama pleaded with Indiana voters to get out the vote for vulnerable Democratic Sen. Joe Donnelly, who is opposed by Republican Mike Braun, if they're unhappy with the current administration — \"don't boo, vote!\" the former president said repeatedly — and stressed the GOP's longtime opposition to his Affordable Care Act and its recent self-proclaimed interest in preserving care for people with pre-existing conditions.\"When I was president, Republicans voted more than a dozen times to get rid of protections for pre-existing conditions. Last year, they fell just one vote short, and if they win on Tuesday, they might finally succeed,\" Obama said. \"Indiana, we can't let Joe's opponent become the deciding vote.\"Obama was received like a rock star at the rally, and he condemned Republicans for dishonesty on the campaign trail — even encouraging voters to check his facts.\"Unlike some people, I don't just make stuff up when I'm talking. I've got facts to back me up,\" Obama said. \"I believe in a fact-based campaign. I believe in reality-based governance.\"Former New York City mayor Michael Bloomberg launched a lengthy television ad on Sunday night  that calls for Americans to vote for Democrats this year. Speaking directly to the camera, the potential 2020 candidate introduces himself in the ad \"as an American who is deeply concerned with the direction of our nation.\"\"I've never been a particularly partisan person. I've supported candidates from both sides, but at this moment, we must send a signal to Republicans in Washington that they have failed to lead, failed to find solutions, and failed to bring us together,\" Bloomberg says in the ad. \"That’s why I'm voting Democratic.\"The ad will run nationally on CBS, CNN, MSNBC and major broadcast television networks through Monday, November 5th.A hoarse former Vice President Joe Biden hosted two events in Pennsylvania on Sunday.\"I’ve traveled, as you can tell by my voice, to 22 states to campaign for 63 candidates,\" he told a Harrisburg, Pennsylvania crowd.\"This is so important for our kids. This is the most imp election you've ever been part of, no matter how young or old you are. The very character of our nation is on the ballot on Tuesday,\" he said.So far, more than 34 million votes have been cast with early or absentee ballots nationwide, according to data provided by TargetSmart, a Democratic political data company, and independently analyzed by the NBC News Data Analytics Lab. That number exceeds the total nationwide early vote by Election Day 2014, when more than 21 million people had voted early or absentee.The contentious governor's race isn't slowing down. After Trump attacked Democratic candidate Andrew Gillum as \"not equipped\" to be governor during a Pensacola rally in support of his rival, former Republican Rep. Ron DeSantis, Democrats started the day with some Hollywood star power.Latina actresses America Ferrera, Eva Longoria, Gina Rodriguez, Rosario Dawson and Zoe Saldana rallied Floridians to vote early for Gillum at rally in Kissimmee with Gillum's wife, R. Jai. The Latino vote in Florida is crucial: 17 percent of registered voters in the state are Latino.Florida leads the nation in early and absentee ballots cast, at more than 4.3 million so far, according to data provided by TargetSmart.The singer Rihanna also jumped into the race with an endorsement of Gillum on Sunday afternoon that was posted to Instagram.\"You have the opportunity to make history this election. The US has only had four black Governors in its entire history, and we can help make #AndrewGillum the next one and Florida's first!\" she wrote, while encouraging voters to approve a ballot initiative that would restore voting rights to millions of ex-felons.The most melodious surrogate of the day was Ohio-born John Legend, the singer-songwriter and EGOT winner, who returned to his home state for three events in support of Ohio Democrats, including Rich Cordray and Betty Sutton, who are running a joint ticket for governor and lieutenant governor, and vulnerable Sen. Sherrod Brown.Jane C. Timm is a political reporter and fact checker, covering voting rights, the Trump administration, and elections.© 2018 NBC UNIVERSAL"}