{"id": "Pete Davidson criticized for 'SNL' joke about Navy SEAL congressional candidate", "paragraph": "\"Saturday Night Live\" performer Pete Davidson received criticism on Sunday for a joke he made about Texas congressional candidate Dan Crenshaw. The segment focused on Davidson's first impressions of midterm election candidates.Appearing on the show's mock news program, \"Weekend Update,\" Davidson made jokes and comments about multiple midterm candidates based entirely on their appearance — the obvious joke being that Davidson is uninformed about the election.\"The midterm elections are obviously a huge deal,\" Davidson said. \"And after I had to move back in with my mom, I started paying attention to them.\" The comedian recently ended a short-lived engagement to the singer Ariana Grande, forcing him to move out of her New York City apartment.Davidson took shots at Florida Gov. Rick Scott, a Republican running for the Senate, and Rep. Peter King, R-N.Y., before he took aim at Crenshaw, a Republican. The show pulled up an image of Crenshaw wearing an eye patch, with Davidson commenting, \"This guy is kind of cool, Dan Crenshaw.\"\"You may be surprised to hear that he's a congressional candidate from Texas and not a hitman in a porno movie,\" Davidson said, unable to keep himself from laughing.\"I'm sorry. I know he lost his eye in war or whatever,\" he added.Many took issue with the joke, calling it insensitive to Crenshaw's service and injury. Crenshaw was in the Navy for 10 years, retiring from the SEALs as a lieutenant commander in 2016. While he was serving in Afghanistan, an improvised explosive device resulted in Crenshaw's losing his eye in 2012.Crenshaw took a diplomatic approach. He responded on Twitter, saying: \"I try hard not to offend; I try harder not to be offended.\" However, he did say \"SNL\" should try to be more sensitive to veterans.Good rule in life: I try hard not to offend; I try harder not to be offended. That being said,  I hope @nbcsnl recognizes that vets don’t deserve to see their wounds used as punchlines for bad jokes.NBC and \"Saturday Night Live\" declined to comment. NBC and NBC News are owned by NBCUniversal.\"Getting dumped by your pop star girlfriend is no excuse for lashing out at a decorated war hero who lost his eye serving our country,\" said Jack Pandol, a spokesman for the National Republican Congressional Committee. \"Pete Davidson and NBC should immediately apologize to Dan, and to the millions of veterans and military families who tune in every weekend — because they are not laughing.\"Many chimed in on Twitter, although some noted what they characterized as the double standard of supporters of President Donald Trump.The unhinged Left has respect for no one, including our nations war heroes. Utterly shameful that @nbcsnl is mocking Republican Congressional candidate and Navy Seal veteran @DanCrenshawTX for his sacrifice in the line of duty.https://t.co/D3Snni9BZCPete Davidson making fun of a one-eyed war hero is only marginally worse than Kate McKinnon singing “Hallelujah” after Hillary lost. The McKinnon thing is actually probably worse, since there was no universe in which it’d be funny, and the Davidson thing is at least a joke.If you didn’t have anything to say about Trump’s disrespect of John McCain, the Khan family, or LaDavid Johnson, please sit all the way down about Pete Davidson’s decidedly less terrible (though lame) disrespect of ex-Navy Seal & current GOP congressional candidate Dan Crenshaw.Davidson criticized not only others during his segment, but also himself.\"I shouldn't be making fun of how anyone looks,\" he said. \"I look like I make vape juice in a bathtub.\"Phil McCausland is an NBC News reporter focused on the rural-urban divide.© 2018 NBC UNIVERSAL"}