{"id": "Why some researchers say 'brain tingles' could be the next big trend in relaxation ", "paragraph": "Have you ever felt a static-like or tingling sensation on the top of your head when someone brushes your hair or whispers to you? The feeling may travel down your arms and your spine, and it likely makes you feel very relaxed. Some call it a “sparkly” feeling, and it might happen when you hear someone crinkle a piece of paper or when someone traces a word on your back.The phenomenon is one that has captured the attention of psychologists and other researchers over the past decade or so. They’ve termed it “autonomous sensory meridian response” (or “ASMR”), though some also refer to it as a “brain orgasm.”“For me, my brain goes delightfully fuzzy. I’m so relaxed that I want to put my head down wherever I’m at,” says Craig Richard, PhD, professor of biopharmaceutical sciences at Shenandoah University in Winchester, Virginia, and author of a new book about ASMR, \"Brain Tingles.\"Researchers started paying attention to ASMR, Richard explains, in large part because of the boom of online videos of ASMR triggers — and the claims of those who watched them.Many of the videos show someone whispering, lightly tapping on the camera or a microphone, stroking their hair, folding napkins or showing you a thimble collection. (To those who’ve never seen or heard about ASMR, they will likely seem odd.)“It wasn't just that ASMR videos were popular,” Richard says. “Cat videos have always been popular too. But people kept posting comments online about how ASMR videos helped them to relax, de-stress, [and] fall asleep.”And that included people who said they had been diagnosed with an anxiety disorder or insomnia, he says. Richard is also founder of ASMR University, an online resource to teach people about what ASMR is and the evidence behind it.But there were obvious research questions here, Richard says. Is there something physiologically going on? What is happening? And is there a potential clinical use for it to help people with problems like insomnia, anxiety, depression, and chronic pain, as people anecdotally have reported it does?“We’re trying to explain the basics of this,” he says — “and then how can this be applied as, perhaps, part of clinical treatments.”Unfortunately given how recently scientists started paying attention to ASMR, there’s still very little data published on it. But the findings so far suggest something is going on to trigger the response.For one study, researchers used fMRI scanning to compare brain activity in people who report experiencing ASMR with people who don’t experience it. The work compared which brain cell networks were active in both the ASMR-experiencing group and the non-ASMR-experiencing group.Everyone’s brains were in a resting state (as they were all lying still in the scanning machine when the imaging was done). And during rest, there tended to be weaker activity in what’s known as the “default mode” network (which is the one that becomes active when we’re daydreaming or disengaged from what’s happening around us) in the ASMR group.“We don’t know exactly what’s going on while someone is experiencing ASMR tingles,” study co-author Stephen Smith, PhD, associate professor of psychology at the University of Winnipeg in Canada, tells NBC News BETTER.But the takeaway from these is that the brains of people who are able to experience ASMR may be wired slightly differently than those who don’t experience it, he says.Another study from Smith’s group suggests that it may even be that people who experience ASMR are more likely to have certain personality traits (like being open to new experiences and neuroticism) than those who can’t.“Some people appear to have brains that are organized in a way that makes them receptive to ASMR tingles and other people do not,” Smith says about the work he’s done on the topic (noting though that the evidence is all still preliminary because of the lack of additional trials).Other research has identified physiological changes associated with ASMR that back up the claim it really does relax people.A group of psychologists at the University of Sheffield published a paper earlier this year in the journal PLOS One that reported for the first time that people who report experiencing the sensation actually do appear to have a physiological response: their heart rates tend to slow down. The researchers recruited 112 individuals, half of who reported experiencing ASMR and the rest of whom reported not experiencing the sensation and monitored everyone’s heart rate while watching an ASMR video.“It’s not just people telling us that ASMR makes them feel relaxed — their physiology is telling us the same thing, too,” says study co-author, Guilia Poerio, PhD, a psychologist who researches ASMR (along with sleep, mind-wandering, and imagination and well-being) at The University of Sheffield in the U.K.A noteworthy point about the results of the experiment is that the observed reductions in heart rate were comparable to other tried-and-true stress relief methods, like music and mindfulness, Poerio says.And just last month, Richard and colleagues published data that shows results of fMRI brain imaging scans for 10 individuals (who all previously reported experiencing ASMR) as they watched an ASMR video and reported feeling the sensation. The parts of the brain active when we’re socially engaged with others, when we feel empathy, and when our brain’s reward centers are on, appeared to be active when people said they experienced ASMR.ASMR triggers vary significantly, Richard says. They can be visual (in that you watch them happen in front of you or in a video), audio (in that you listen to them via recording or podcast) or tactile (in that you physically need to be touched for the sensation to happen).It’s different from experiencing the “chills” or goosebumps when you hear a song that moves you  or watch a scary movie because those sensations are triggered by a strong emotional response you’re having. ASMR is less emotional, and more characterized by that deep relaxation you feel.As has already been suggested, Richard, Smith, and Poerio all agree that it’s probably the case that not everyone can experience ASMR. (Based on his work teaching ASMR, Richard suspects it’s a significant minority.)But, he adds, if you’re curious if you fall in that camp, here are some tips for making it happen for you:Stress can be inhibiting, Richard says. “So the more relaxed you are the more likely you’ll be able to experience ASMR,” he says — especially to start out with. Try it when you’re at home, just before bed, he says.It also might be the case that you need an in-person physical trigger to experience ASMR rather than being able to feel it after watching a Youtube clip, Richard adds. Have someone play with your hair, touch your arm lightly, draw letters on your back with their fingers or whisper to you. “ASMR is ultimately about that personal connection,” Richard says.What works for someone may not be an ASMR trigger for you — tapping versus hair brushing, for instance. There are a lot of different types of triggers, different ASMR artists, and different styles of presenting triggers, Richard says. “Be patient and be open to trying many triggers to find out which ones do work best or if any work at all.”Want more tips like these? NBC News BETTER is obsessed with finding easier, healthier and smarter ways to live. Sign up for our newsletter and follow us on Facebook, Twitter and Instagram.© 2018 NBC UNIVERSAL"}