{"id": "Scared to run alone? Women runners share their best safety tips", "paragraph": "I used to like to run by myself in the evening, away from the busy streets and bright lights. Then, one night I was followed by a group of men. Fortunately I made it home unscathed, but my appetite for solo jogs was spoiled after that. I guess it was the last straw. I was already exhausted by the aggressive male behavior I had to endure: catcalling, heckling and lewd propositioning.These disturbing incidents were random, uncontrollable and at times terrifying. I’ve known so many women who can relate, and now I know even more after researching this article.None of these women succumb to fear. They recognize that they can’t control what others do, that there’s no such thing as “asking for it”, and that you can take all the safety precautions in the world and still end up a victim. But they don’t give up what they love, an attitude that inspires me to get my sneakers back on and go for it, with some handy tips in mind.Part of what helps women runners stay confident is taking safety precautions. This doesn’t mean they’re guaranteeing their safety (that’s not possible), or that anyone who has been hurt or worse while running could have been spared had they taken more precautions (that’s victim-blaming).What it does mean is that they’re having better, less stressful workouts by practicing risk-aversion.“It is probably smart for women to have a certain level of risk aversion while they run because they are vulnerable targets to predators,” says Laura Dugan, Professor of Criminology and Criminal Justice at the University of Maryland. “With risk aversion, they can make decisions that will reduce their vulnerability and consequently allow them to enjoy their running.”Here’s how to practice risk-aversion when running alone as a woman:“Predators will [typically] only attack when nobody else is around,” says Dugan. “While it might be nice to run in the woods, perhaps [women] can choose to run in a more popular park where others will be around. Also, women should avoid running at night.”Lauren Crain, a woman runner, has a firm policy around this.“If I'm running on a path, and I don't see anyone else for more than five minutes, I never run on that path anymore,” she says. “I feel a lot safer when there are other runners or bikers around, and if I don't see anyone for more than five minutes, I'll usually turn around and go back.”If you’re new to an area, and not sure where to run, Tina Willis, a personal injury attorney and avid distance runner for nearly 20 years, recommends asking neighbors and even dropping by your local police station to learn what trails local officers recommend.Also, given her expertise in personal injury law, Willis stresses to not forget about another serious threat to all runners: drivers.“I cannot overstate the importance of staying off road shoulders, especially really narrow or non-existent ones,” she says.So, choose an area populated by people, not cars.“One important thing I have changed in my running routine is that unless I am around a lot of people or running on the boardwalk during the day, I no longer put headphones on,” says Christie Maruka, a fitness enthusiast who runs/speed walks daily. “Headphones playing music [is distracting] and I would zone out listening, and [thus be unable to] hear if someone is coming up behind me or at me. As much as I enjoy running to music it’s really not safe.”Crain makes a compromise.“When I go running, I wear my broken headphones,” she says. “The right earbud doesn't work, so I can still be aware of my surroundings.”At night, Crain ditches the earbuds altogether, feeling that the mere appearance of them make her appear like she’s not aware of her surroundings, “so I want to limit that view of me especially when it's semi-dark outside.”Maruka also keeps her keys in her hand as a ready weapon, while many other women (myself included when I’m walking the dogs alone at night) carry pepper spray or another weapon.This may help you feel safer, but Dugar discourages women from carrying weapons “unless they are well trained on how to use them. This includes pepper spray and knives.”Dugar’s reasoning is mainly that your weapons can actually be used against you by an attacker. Moreover, she points out, pepper spray expires, so if you are trained to use it, and confident doing so, make sure it’s not past date.Susan MacTavish Best the founder and CEO of Living MacTavish, carries a large stone in one hand.“I did this on the island of Port-Cros after I heard a wild boar,” says Best. I look at it both as a way for me to feel more confident and as a bonus, it [makes] my arm stronger.”“I always share my location when I go running,” says Crain. “I let my partner know where I'll be, and share my location with him via Google.”Jen McMahon, a certified integrative nutrition health coach, certified personal trainer and running coach, also makes a habit of letting people she trusts know when and where she’s running.“Create a check-in system with a buddy so they know you made it home safely,” she suggests.“Always carry your charged cell phone with you while running,” she adds. “There are new safety apps with GPS tracking that will dial the police or friend/family member for you if needed with just one click.”“If you are ever attacked while running, use your powerful voice. Shout, yell, curse and do whatever you can to momentarily shock your attacker into changing their mind,” says Jennifer Cassetta, a clinical nutritionist, personal trainer and self defense expert who founded Stilettos and Self Defense.If things get physical, Cassetta describes tactics you can use to take an attacker down:Some of us just really like to run at night, but as Dugar pointed out, women are vulnerable to predators, and they are most vulnerable at night when alone. Running in a group is the easiest way to handle this, but why not take it a step further by joining or forming a local movement that is determined to empower women and involve men through conversation and action.You may be able to turn to your workplace to get things off the ground.“My co-workers and I decided to start a movement, called Despite the Dark, where we shed light on the safety issues women face when they run, specifically at night,” says Rachel Colonna, a creative studio designer and a founding member of the Despite the Dark team, who found that women co-workers were feeling more afraid of running after recent events such as the murders of runners Wendy Martinez and Mollie Tibbets, respectively.“Our biggest takeaway is that there is safety in numbers, which is why we are creating a community of runners to ensure a safe environment,” Colonna says. “Sadly, there is no way to be 100 percent safe all the time, but starting a conversation and a community is a way we have coped with the severity of these situations and started to find an answer.”Want more tips like these? NBC News BETTER is obsessed with finding easier, healthier and smarter ways to live. Sign up for our newsletter and follow us on Facebook, Twitter and Instagram.© 2018 NBC UNIVERSAL"}