{"id": "Doctors believe a hospital bed shouldn't be a barrier to voting. And they're doing something about it.   ", "paragraph": "In 2016, Dr. Kelly Wong's patients expressed frustration about being stuck in the hospital on Election Day, unable to cast their ballots. Wong decided she wanted to find a way to change that.\"I didn't know patients could vote — and what I'm learning is that many health care providers also don't know that there are processes in place to help patients vote,\" Wong told NBC News.After doing some research, Wong, an emergency medicine resident at the Brown Alpert Medical School in Providence, Rhode Island, along with other hospitals, launched patientvoting.com, a website where patients can go to find out the options available to them.\"In most states, there is a process for submitting an emergency absentee ballot application to your local election officials,\" Wong said. \"In some states, you can designate a friend or family member to pick up your ballot and deliver it to you. In other states, the board of elections may send someone to the hospital for you.\"The effort to help patients vote has spread, including Penn Presbyterian Medical Center and the Hospital of the University of Pennsylvania, where they have been working together on an initiative called the \"Penn Votes Project,\" the Associated Press reported.Wong wanted to make the website easy to use, understanding that the last thing hospital patients wanted was to start digging for information on how they could apply for emergency absentee ballots.Using each state's board of elections website, she gathered the necessary information that patient-voters would need to apply for ballots.They can go to patientvoting.com and click on the link for the state where they are registered to vote. The link will bring them to a page with step-by-step instructions on how to obtain a ballot, when the application is due and information from the state's board of elections website.Wong's goal is to spread the word to as many patients as possible using social media and word of mouth.She has also recruited volunteers such as Dr. Chiazotam Ekekezie, chief resident in the Department of Internal Medicine at the Brown Alpert Medical School, to help with the in-patient aspect of the program. Ekekezie's duties include getting out the information on the in-patient floors, translating instructions into Spanish and securing funding for printing.Ekekezie told NBC News she has been working \"to provide basic instructions in both English and Spanish for patients...who may not be able to make it to the polls to vote in person.\"\"I have also tried to raise awareness among clinicians and house staff who may not be able to participate in voting at the polls due to being on call or duties in our intensive care units,\" she said.Caitlin Fichtel is a New York-based social media reporter.© 2018 NBC UNIVERSAL"}