{"id": "Mismanagement isn't to blame for California wildfires, scientists say, bucking Trump", "paragraph": "Fire scientists to Trump: You’re wrong!The devastating wildfires that ignited across California last week — killing 44 so far and destroying thousands of homes — had little to do with \"gross mismanagement,\" experts said.President Trump made that claim on Saturday during a trip to France, saying, without evidence, that \"there is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor.\"But scientists and fire officials say that climate change — and the dried out trees and shrubs produced by a changing environment — are the real culprits.Asked about Trump’s claim on Monday, one of the fire officials in charge of battling Southern California’s Woosely Fire, Los Angeles County Fire Chief Daryl Osby, said he found it \"unsatisfactory.\"\"We’re in extreme climate change right now,\" Obsy said. \"We’re doing all that we can to prevent incidents and mitigate incidents and save lives.\"LA Co. fire chief on President Trump's tweet blaming only \"forest management\" for Calif. wildfires:“We’re in extreme climate change right now … I personally find that statement unsatisfactory, and it's very hurtful for all first responders\" (corrects: LA Co. chief, not LAFD) pic.twitter.com/mZc38OS0pEUniversity of Utah fire scientist Philip Dennison said that researchers know that mismanagement isn’t to blame because some of the same areas now burning were charred in 2005 and 2008.They aren't \"fuel-choked closed-canopy forests,\" Dennison said.In those earlier fires, Paradise was threatened but escaped major damage, he said. In the current blazes, the town was virtually destroyed.The other major fire, in Southern California, burned through shrub land, not forest, Dennison said.\"It's not about forest management,\" he said. \"These aren't forests.\"The dean of the University of Michigan's environmental school, Jonathan Overpeck, said Western fires are getting bigger and more severe. He said it \"is much less due to bad management and is instead the result of our baking of our forests, woodlands and grasslands with ever-worsening climate change.\"Wildfires have become more devastating because of the extreme weather swings from global warming, fire scientists said. The average number of U.S. acres burned by wildfires has doubled over the level from 30 years ago.As of Monday, more than 13,200 square miles have burned. That's more than a third higher than the 10-year average.The two fires now burning \"aren't that far out of line with the fires we've seen in these areas in recent decades,\" Dennison said.\"The biggest factor was wind,\" Dennison said in an email. \"With wind speeds as high as they were, there was nothing firefighters could do to stop the advance of the fires.\"The wind is so strong that fire breaks — areas where trees and brush have been cleared or intentionally burned to deprive the advancing flames of fuel — won't work. One of the fires jumped over eight lanes of freeway, about 140 feet, Dennison said.Southern California had fires similar to the Woolsey fire in 1982, when winds were 60 mph, but \"the difference between 1982 and today is a much higher population in these areas. Many more people were threatened and had to evacuated,\" Dennison said.California also has been in drought for all but a few years of the 21st century and is now experiencing its longest drought, which began on Dec. 27, 2011, and has lasted 358 weeks, according to the U.S. Drought Monitor. Nearly two-thirds of the state is abnormally dry.The first nine months of the year have been fourth-warmest on record for California, and this past summer was the second-hottest on record in the state.Because of that, there are 129 million dead trees, which provide fuel for fires, said wildfire expert Kristen Thornicke of the Potsdam Institute for Climate Impact Research in Germany.And it's more than trees. Dead shrubs around the bottom of trees provide what is called \"ladder fuel,\" offering a path for fire to climb from the ground to the treetops and intensifying the conflagration by a factor of 10 to 100, said Kevin Ryan, a fire consultant and former fire scientist at the U.S. Forest Service.While many conservatives advocate cutting down more trees to prevent fires, no one makes money by cutting dead shrubs, and that's a problem, he said.Local and state officials have cleared some Southern California shrub, enough for normal weather and winds. But that's not enough for this type of extreme drought, said Ryan, also a former firefighter.University of Alberta fire scientist Mike Flanigan earlier this year told The Associated Press that the hotter and drier the weather, the easier it is for fires to start, spread and burn more intensely.It's simple, he said: \"The warmer it is, the more fire we see.\"Tim Stelloh is a reporter for NBC News, based in California.© 2018 NBC UNIVERSAL"}