{"id": "3 Miami police officers arrested in drug sting ", "paragraph": "Three Miami police officers appeared before a federal judge Wednesday following their arrest on drug trafficking charges for allegedly working as protection for a phony narcotics ring.Officers Schonton Harris and Kelvin Harris, who are not related, and James Archibald were arrested Tuesday in an undercover sting run by the FBI and Miami police, authorities said.The judge set bond for Kelvin Harris and Archibald at $200,000 each, NBC affiliate WTVJ reported. A pre-trial detention hearing for Schonton Harris was set for Friday, according to a U.S. Department of Justice spokeswoman in Miami.The three are charged with conspiracy to possess and distribute cocaine and carrying a firearm while trafficking drugs.Jonathan Schwartz, a lawyer for Kelvin Harris, said his client will fight the charges.\"He, like everyone else, even though he’s a police officer, maintains his innocence and has a presumption of innocence and he intends to prove that innocence,\" Schwartz told WTVJ.U.S. Attorney Ariana Fajardo Orshan said on Tuesday that the suspects disgraced their badges.\"Instead of ridding our streets of drugs, which are ravaging our communities, these officers were willing to profit from money-laundering and drug-trafficking enterprises,\" Orshan said.Investigators claim they have the defendants on tape making incriminating statements.\"Video and/or audio recordings were made throughout the investigation which ultimately involved the defendants collectively providing protection to the transportation and distribution of purported cocaine, opioids or drug proceeds,\" according to a federal criminal complaint written by FBI Special Agent Thompson Haggin Jr. \"After each protection detail, the defendants received cash payments.\"Although the accused officers never had to get physical in escorting drug runners, according to the complaint, Schonton Harris was caught on tape saying she wouldn't care how violent a job could get.\"With me, I don't give a f-ck,\" Harris allegedly said. \"You can tell me, I still won't care. I don't care if it's a dead body cut up into pieces.\"The fake cartel overlords once told Schonton Harris that a thief had stolen some drugs and needed to be killed.\"Schonton Harris had agreed to provide the uniform for $10,000 and the badge for $500 for the purported hit man to use, and she was paid accordingly,\" Haggin wrote.During a string of staged drug transports, Schonton Harris made $17,000 in payments from the sham drug cartel, Kelvin Harris $10,000 and James Archibald $6,500, according to Haggin.Schonton Harris joined the Miami police force in 1999, Kelvin Harris in 1992 and Archibald in 2016.\"I hope these arrests serve as a warning to any officer who would break their oath, shame our ranks and dishonor our badge,\" Orshan said. \"There is no refuge for you here. If you are corrupt, we will find you, and you will answer for your crimes.\"© 2018 NBC UNIVERSAL"}