{"id": "Murdochs plan a new vision of TV with New Fox", "paragraph": "After selling the majority of its entertainment business to Disney, 21st Century Fox is preparing for its future as a news-and-sports destination by taking a close look at the last vestiges of the Roger Ailes era of Fox News.The reorganization of the company, known as “New Fox” in media circles, highlights the Murdoch family’s view of a future in which television networks like theirs return to content that is live and urgent, moving away from entertainment that will be left to Netflix and its streaming competitors.Cuts will be coming to Fox News, where a source familiar with the network who was not authorized to speak publicly said the company had been going through the ranks with a scalpel, looking for any last overpaid vestiges of the channel’s pre-Trump epoch. One group ripe for reduction includes correspondents in the field, given how much attention is on the White House, news industry executives told NBC News.In the next few weeks, Fox is expected to complete the sale of $71.3 billion worth of movie and TV assets to Disney, pending regulatory approvals from the European Union and China. The deal turns Fox from a major producer of entertainment into primarily a buyer, leaving behind the Fox broadcast network and its 28 local TV stations, Fox News Channel, Fox Business Network, and Fox Sports 1 and 2. Netflix even pointed to New Fox’s strategy in its most recent quarterly shareholder letter, predicting, perhaps hopefully, that competitors would eventually follow.Michael Nathanson of the independent research firm MoffettNathanson wrote in an investor note that the company has to fill only six hours of prime-time entertainment programming every week, assuming that New Fox will keep its animation block on Sundays and sports programming Thursday through Saturday.The lean “New Fox” is a bet that news and sports will remain immune to the on-demand entertainment revolution that Netflix started.“They’re in a good position,” Todd Klein, a partner at venture firm Revolution Growth, said. “The media is resolving into two very distinct spheres: live and on-demand. They sold off the on-demand part, the movies and TV stuff, and live is sports and news, and they are well positioned there.”Fox declined to comment.Fox News already held an outsized role at the Old Fox, but at New Fox, the channel reigns supreme. New Fox also has a new leader — Lachlan Murdoch, the eldest son of media mogul Rupert Murdoch, who built Fox and remains its co-chairman.As chairman and chief executive officer of the remaining Fox properties, 47-year-old Lachlan Murdoch will bear the responsibility for the continued success of the Fox News brand, the financial engine of the company — and his moves are being closely watched by an industry in flux.Sources say Murdoch has attended senior-level meetings with the Fox News staff in the past few months, politely asking questions about the news of the day. He’s already made a handful of staff announcements, appointing Fox News’ president of ad sales Marianne Gambelli to the same position across the entire company. Joe Marchese, president of advertising at Fox Networks Group, is departing after a period of consulting for the company.Fox News Channel alone is expected to reap $1.7 billion in affiliate fees and more than a billion dollars in ad revenue in 2019, according to SNL Kagan. The channel’s ratings have been particularly strong in the weeks leading to the 2018 U.S. midterm elections.The channel’s continued success has been driven by its primetime line-up of Tucker Carlson, Sean Hannity and Laura Ingraham, which has taken the company in a distinctly pro-Trump direction that also has left little time for non-White House coverage. Two correspondents recently left Fox News: Jerusalem-based reporter Conor Powell, and Los Angeles-based reporter Adam Housley, amid reports that there are diminished opportunities for hard-news reporters.The move away from entertainment comes as many in Hollywood and the industry at large have taken issue with the news channel’s coverage and perceived coziness with the Trump administration — critiques that were bolstered by the arrival of Hope Hicks, the former White House communications director who will soon start as PR chief of New Fox.Others point out that Rupert Murdoch has also picked Democrats in the past to run his communications operations.The Murdoch bet on news is coupled with a renewed emphasis on sports from its network broadcast and remaining cable channels — a risky proposition, as sports rights continue to become more expensive.The network has lost millions of dollars since the departure of “American Idol,” according to Nathanson, and is now more reliant than ever on sports. Fox recently spent $1 billion on professional wrestling with WWE “Smackdown” and another $3 billion for five seasons of Thursday Night Football. It already pays $1 billion for the NFL’s Sunday package, which expires in 2022. Fox also broadcasts MLB games and the World Series. Thanks to its new Thursday Night Football contract, Fox ratings were up 38 percent over last year so far this season.Those sports rights provide “New Fox” with leverage to negotiate new distribution agreements with AT&T’s DirecTV, Dish and Charter in the coming year, Nathanson said.“As long as they have NFL, they still have a lot of leverage with distributors,” said one media industry CEO, who did not wish to be named because of business sensitivities.But in the industry, that reliance can be used by sports leagues to push for more money, particularly as tech companies have begun bidding for lower-level packages.“If I’m a league and I know that Fox needs NFL or MLB and can’t survive without them, I can make life very difficult when it comes to negotiations,” said one sports industry executive, who asked to remain anonymous due to business relationships.\"It is crucially important [New Fox] remain in the NFL,” said one Madison Avenue advertising executive. \"Fox's prime time offering is a question mark: Whether it really has a long-term commitment to developing content.” Charlie Collier, the former president of AMC, is joining “New Fox,” as CEO of Entertainment.“New Fox” may also not remain lean for very long and could look to use its cash, which analysts have put between $1.5 billion and $2 billion, to add to its business. The company’s assets are valued at $13 billion, but few people think it will remain at that size.“It’s deeply unlikely they’ll remain at divestiture size,” said Dan Cryan, executive director at the research firm IHS Markit.Among the first assets Fox could target are RSNs, or regional sports networks, which the company initially sold to Disney. Disney is now in the process of selling those networks — and New Fox is a possible buyer.“The first big inflection point is the RSNs,” said one former Fox executive who spoke on the condition of anonymity to freely discuss a previous employer. “Will they get them back or not?”Earlier this month, bankers sent out a book for prospective buyers of the regional sports networks that Fox sold to Disney, which is divesting them as part of an agreement with regulators to approve their acquisition of Fox’s content assets.Fox declined to comment on the sports networks and it’s unclear if there are legal limitations on what it could acquire given the Disney agreement.The new company may also choose to acquire more local TV stations. It had made a run at Tribune Broadcasting before being knocked out of the bidding by Sinclair. Those stations are up for sale again.Les Hinton, former publisher of the Wall Street Journal and author of “An Untidy Life,” about the years he spent working with Rupert Murdoch, said he wondered if “New Fox” might end up combining with its former print sibling, News Corp., which houses newspapers, including The Wall Street Journal, as well as digital content and Australian TV assets.However, Hinton noted: “The problem is that legacy newspapers are inclined to drag on stock prices, so it may not be possible for him. When the company split that in Australia, the family’s home turf, Murdoch kept some cable assets inside News Corp.”New Fox could also look to expand beyond traditional TV into the internet-delivered market, known as “over the top,” or OTT. Fox News is readying the launch a new streaming news service, Fox Nation, on November 27.“They’ve got smarter and more aggressive about digital,” said Revolution’s Klein, noting the upcoming over-the-top network. Fox has already made a $100 million investment in a live social streaming company called Caffeine, aimed at broadcasting e-sports and live events such as gaming.One veteran media investor, who did not wish to be named, said he would be buying “New Fox,” when it hits the market. When asked for his rationale, he responded simply: “Cheap.”© 2018 NBC UNIVERSAL"}