{"id": "RNC Chair McDaniel says Trump's closing message is focused on more than immigration ", "paragraph": "Republican National Committee Chairwoman Ronna McDaniel insisted Sunday that immigration wasn't the main focus of President Donald Trump's closing message ahead of Tuesday's midterm elections.McDaniel argued that media is zeroing in on the subject.\"I think the media’s focused on immigration constantly, and I get that,\" McDaniel said on ABC's \"This Week.\" \"But he's focusing on the economy, he's talking about the jobs.\"For weeks, Trump has focused on a caravan of migrants traveling through Mexico to the U.S. southern border in hopes of being granted asylum. Last week, he stated his intention to end birthright citizenship and change the nation's system of seeking asylum — two moves that experts say would be an uphill legal battle — in addition to announcing that up to 15,000 troops would be sent to the border to handle the caravan that is still hundreds of miles away from the U.S.The president also released a video on his Twitter page last week — one that critics have labeled \"racist\" and \"false\" — that assigned blame for an undocumented immigrant killing two police officers on Democrats.The president's intense end-of-campaign messaging on immigration comes against the backdrop of a strong economy that many Republicans on the trail have focused on throughout the campaign season.At a rally on Friday, Trump said the U.S. has \"the greatest economy in the history of our country, but sometimes that's not as exciting to talk about the economy, right?\"McDaniel insisted that Trump was focusing on the economy in addition to \"many different things that he's accomplished as president,\" adding that the president wants to highlight \"a failure in our immigration system\" ahead of Election Day.On CNN's \"State of the Union,\" McDaniel was pressed extensively on the president's web video. That ad featured Luis Bracamontes, an undocumented immigrant from Mexico who was in February convicted of killing two California policemen. Bracamontes had previously been deported but returned to the U.S.Asked by CNN's Jake Tapper whether she had any concerns with that video, McDaniel said Trump was just highlighting that \"we didn't want this individual in our country.\"Meanwhile, Georgia Democratic gubernatorial hopeful Stacey Abrams panned Trump's recent dismissal of her qualifications on NBC's \"Meet the Press.\"Asked by host Chuck Todd about the president's declaration that she is \"not qualified to be the governor of Georgia,\" Abrams pushed back by calling his statement \"vapid and shallow.\" \"I am the most qualified candidate. I am a business owner, a tax attorney who trained at Yale Law School. I am a civic leader who helped register more than 200,000 Georgians. I am a very accomplished political leader who worked across the aisle to improve access to education, transportation, and I blocked the single largest tax increase in Georgia history,\" she said.Elsewhere, Republican Sen. Thom Tillis of North Carolina, who is vice chairman of the National Republican Senatorial Committee, told \"Fox News Sunday\" that \"people are taking 30-second soundbites\" when asked about why the president was focusing on immigration over the economy.\"He's spending a lot of his time on (the economy,)\" Tillis said, \"but when you have to boil it down to 15 or 30-sound bites, they're going to pick the piece that seems like he is not talking about that.\"Allan Smith is a political reporter for NBC News.© 2018 NBC UNIVERSAL"}