{"id": "Harry Potter franchise's new 'Fantastic Beasts' sequel should not have been written by J.K. Rowling", "paragraph": "“Fantastic Beasts: The Crimes of Grindelwald” would be a far better movie if it was willing to be about its titular creatures, instead of its subhead. Overstuffed with plot twists and turns and frustratingly obscure in its worldbuilding, the highly anticipated sequel to “Fantastic Beasts” saunters in with the overconfidence of a mediocre white man, or Johnny Depp. And despite a strong cast and the Harry Potter cachet, it’s sadly one more example of the failed prequel genre pioneered by George Lucas’ “Star Wars” films of the early aughts and cemented by Peter Jackson’s “The Hobbit” trilogy.The problem begins and ends with Warner Brothers thinking it was a good idea to let J.K. Rowling write the scripts. Rowling is a writer of books — an excellent writer of books — and not necessarily a writer of screenplays. Yet, after spending 2012 developing “Harry Potter and the Cursed Child” with someone else writing the script, she jumped at the idea of writing a movie based on her slim 2001 novel “Fantastic Beasts and Where To Find Them.”Overstuffed with plot twists and turns and frustratingly obscure in its worldbuilding, the highly anticipated sequel to “Fantastic Beasts” saunters in with the overconfidence of a mediocre white man, or Johnny Depp.This was partly to keep control of her own material. (It is much easier to argue about what does and doesn’t happen in your universe if you are the one penning the script.) But there’s also a good reason why scriptwriters exist. Rowling’s book “Order of the Phoenix” for example, the longest of the “Harry Potter” books, was adapted for Hollywood by a writer who knew how to take all her subplots and streamline them into a tight film. Some subtext becomes text, a few subplots get referenced, but most get cut.The “Harry Potter” series in particular is built around the slow reveal. The surface-level plot of an orphan who gets to go to the most magical school on Earth actually hides a much larger narrative about bigotry, fascism, love and sacrifice that only starts to solidify after several books and several hundred more pages. The first big reveal, which doesn’t come until the end of “Prisoner of Azkaban,” is storytelling at some of its most magical.Movies don’t have the same luxurious amount of time, at least not giant blockbusters. The first “Fantastic Beasts” movie synopsis promised fans a small-time magical romp with a bumbling magizoologist and a pair of accidentally switched briefcases. What viewers got was a story that barely had time to establish those characters, or check to see if their foundations were solid, before Rowling blew down the wall for the reveal. It could have worked, had the series given the viewers more time to settle in.“Fantastic Beasts: The Crimes of Grindelwald” has this same problem. Nominally about the adventures of Newt Scamander (Eddie Redmayne) and his American pals in Paris, the film again has way too many subplots, asides and backstories. Dumbledore (Jude Law) is plotting his eventual fight with evil genius Grindelwald (Johnny Depp) from the shadows of Hogwarts. Newt’s older brother Theseus (Callum Turner) and his fiancé Leta LeStrange (Zoe Kravtiz) worry about Dumbledore secretly being in the pocket of Grindelwald and leading their beloved Newt towards danger.Credence (Ezra Miller) and his pal Nagini (Claudia Kim) search for Credence’s real mother, who may or may not be Leta’s father’s first wife, while another half-brother Yusuf (William Nadylum) searches for him as well. Nicholas Flamel shows up. Footage from World War II gets played out of what can only be described as a skull hookah. (Apparently Grindelwald’s plot to subjugate and eradicate muggles is in service of stopping the Holocaust.)But perhaps the most frustrating part of the whole endeavor is watching a beloved franchise slowly crumble under the weight of unnecessary expectations.There are even more subplots but my editor made me cut them because even she was getting confused. The truth is, the best movie hidden away in here is an adorable little romantic comedy of a story, featuring the four stars of the first movie, Newt, Tina Goldstein (Katherine Waterson), her sister Queenie (Alison Sodul) and muggle Jacob (Dan Fogelman). It would have cute and fun, and perfectly on trend. Ultimately, though, the plot that wins out is the one that puts Dumbledore and Grindelwald front and center, with an ending that is both shocking and confusing.But perhaps the most frustrating part of the whole endeavor is watching a beloved franchise slowly crumble under the weight of unnecessary expectations. It’s as if Rowling was afraid the world she’d built wouldn’t be accepted unless every old character from the books had a cameo, even if their meticulously crafted backstories made such a thing chronologically impossible. She didn’t need to tie every one of these new movies back to her original series every five minutes. Instead of trusting her own universe, it feels like she's now frantically dismantling it.One big reason Rowling's “Harry Potter” books are so beloved is that the world they created could support not only her own tale but the imaginations (and fan fiction) of thousands of devoted readers. Why she couldn’t trust it to hold a story about Newt Scamander and his friends without making it about everything else is a mystery no one, not even Dumbledore, can solve.Ani Bundel has been blogging professionally since 2010. Regular bylines can be found at Elite Daily, WETA's TellyVisions, and Ani-Izzy.com.© 2018 NBC UNIVERSAL"}