{"id": "Mississippi GOP Sen. Cindy Hyde-Smith mum on 'public hanging' remark", "paragraph": "Republican Sen. Cindy Hyde-Smith of Mississippi, a state with a history of lynchings, refused to answer questions Monday about her \"public hanging\" remark after it went viral Sunday, drawing swift condemnation even as she insisted there was no negative connotation.Hyde-Smith, who appeared at a news conference alongside GOP Gov. Phil Bryant to announce an endorsement from anti-abortion rights group the National Right to Life Committee, faced repeated inquiries about her comment, only to defer to her previously issued statement each time.\"Obviously I'd like to ask the senator about the public hanging comment,\" one reporter asked.\"We put out a statement yesterday and we stand by the statement,\" Hyde-Smith responded.During a campaign stop in Tupelo, Mississippi, on Nov. 2, Hyde-Smith said, \"If he invited me to a public hanging, I'd be on the front row,\" referring to a man next to her who was identified as a local rancher.\"If he invited me to a public hanging, I'd be on the front row\"- Sen. Cindy Hyde-Smith says in Tupelo, MS after Colin Hutchinson, cattle rancher, praises her. Hyde-Smith is in a runoff on Nov 27th against Mike Espy. pic.twitter.com/0a9jOEjokrFootage of the remark was first posted on Sunday.Many understood the comment to have a link to lynching and the state's history of racial violence. Between 1882 and 1968, 581 lynchings took place in Mississippi, the most of any state in that period, according to the NAACP.Shortly after the remark gained traction, Hyde-Smith released a statement saying she \"referred to accepting an invitation to a speaking engagement\" and \"used an exaggerated expression of regard.\"\"Any attempt to turn this into a negative connotation is ridiculous,\" she added.Asked to expand on that statement Monday, clarify what she meant, and if she was familiar with Mississippi's history of lynching, Hyde-Smith, who is set to take on African-American Democrat Mike Espy in a runoff election for her Senate seat later this month, insisted that she had nothing more to add.Reporters at the news conference then turned to Bryant, who appointed Hyde-Smith earlier this year to serve as a replacement for longtime Sen. Thad Cochran, who retired. She is currently running to serve the remaining two years of his term.Asked what he thought of Hyde-Smith continuing to point to her statement as her lone response to questions about the comment, Bryant said Hyde-Smith was \"certainly addressing the fact that she has put out a statement.\"\"I could tell you all of us in public life have said things on occasion that we could've phrased better,\" Bryant added. \"When you make as many speeches as we do in public life, that does occur. But I know this woman, I know her heart and I knew it when I appointed her. I know it now. She meant no offense by that statement. There was nothing in her heart of ill-will.\"In today’s press conference receiving an endorsement from the National Right to Life President, @SenHydeSmith was only asked questions regarding her statement on “public hangings” this is what she and Gov. @PhilBryantMS had to say: #mssen #mselex pic.twitter.com/HuFZlNlq34Espy said Hyde-Smith's comment was \"reprehensible\" and served as proof of why she is unfit to serve Mississippi\"We need leaders, not dividers, and her words show that she lacks the understanding and judgment to represent the people of our state,\" he said.NAACP President and CEO Derrick Johnson, who is from Mississippi, said in a statement that Hyde-Smith's \"decision to joke about 'hanging,' in a state known for its violent and terroristic history toward African-Americans, is sick.\"\"To envision this brutal and degenerate type of frame during a time when Black people, Jewish People and immigrants are still being targeted for violence by White nationalists and racists is hateful and hurtful,\" he added.Hyde-Smith's electoral battle with Espy is heading to a runoff after neither candidate broke 50 percent on Tuesday. Both candidates ended up with a total of just more than 40 percent of the vote.President Donald Trump campaigned for Hyde-Smith in Mississippi last month. A former state agriculture commissioner and state senator, Hyde-Smith was a Democrat until 2010, when she switched parties. She is the first woman to represent Mississippi in Congress.Espy, meanwhile, would be the first black man to serve as a senator from Mississippi since Reconstruction and the first Democrat since 1989.The runoff election will take place on Nov. 27.CORRECTION (Nov. 13, 10:52 a.m.): An earlier version of this article misstated the name of the town in Mississippi where Republican Sen. Cindy Hyde-Smith made a campaign stop. It is Tupelo, not Toledo. Allan Smith is a political reporter for NBC News.© 2018 NBC UNIVERSAL"}