{"id": "Dozens of Wisconsin high school students apparently give Nazi salute in viral photo", "paragraph": "A Wisconsin school district has launched an investigation after a photo of what appears to be a group of mostly white male students holding up a Nazi salute went viral.In the image, about 50 students from Baraboo High School in Baraboo, Wisconsin, dressed in suits, are seen smiling with their right arms extended straight in the air, reminiscent of the infamous \"Sieg Heil\" salute.Some students also appear to be giving the okay-sign white power salute in the photo.Baraboo School district superintendent Lori Mueller released a statement on Monday condemning the group photo.\"If the gesture is what it appears to be, the District will pursue any and all available and appropriate actions, including legal, to address the issue,\" Mueller said in a letter sent to parents Monday morning.The Baraboo Police Department also said it is assisting the school district with its investigation.Mueller said the district has determined that the photo is from last spring and was not taken on school property or at a school-sponsored event. The image was originally posted to a photographer's website with other photos from the school's junior prom. The entire album has since been removed.Correction: The photo of students doing salutes is the Class of 2019, not 2018, and was taken during their junior prom.Here is a higher resolution photo (which was apparently taken by one of the parents, and is on the parent's website as part of their collective prom photos.) pic.twitter.com/lkrFln9pyzA few of the teens did not make any gesture.The Anti-Defamation League of the Midwest said in a statement the Sieg Heil salute is never acceptable and must not be normalized, adding that the agency \"stands ready to educate with resources and training.\"The organization also said it hopes the school will take appropriate action.State representative Dave Considine, D-Baraboo, said the incident is a clear reminder that racism is still present in the Baraboo community and in America.\"I hope we use this incident as an opportunity to take a serious, critical look at the differences between our stated values and the behaviors we see in our community,\" Considine said.The Auschwitz-Birkenau Memorial and Museum in Poland also denounced the image.\"We need to explain what is the danger of hateful ideology rising,\" the museum said in a tweet. \"Auschwitz with its gas chambers was at the very end of the long process of normalizing and accommodating hatred.\"Separately, a Connecticut professor was placed on paid leave after he gave a Nazi salute during a recent meeting of faculty and administrators.Several faculty members said Charles Meyrick, assistant professor of business and economics at Housatonic Community College, held a Nazi salute for 5 to 10 minutes at a Nov. 2 meeting at Manchester Community College.Campus police were called. Faculty members said Meyrick withdrew the salute once police arrived.A spokeswoman for the university said an investigation is underway and Meyrick is on paid leave pending the results.Mark Ojakian, president of Connecticut State Colleges and Universities, said the incident was \"appalling and unacceptable.\"Ojakian said the matter would be dealt with “promptly and appropriately.”In an email sent to staff at Housatonic Community College on Nov. 5, a copy of which was provided to NBC News, Ojakian said the incident went beyond the limit of civil discourse and made some people concerned for their safety.“I want to be clear there is a difference between our support of freedom of speech and our tolerance for behavior that is deliberately intended to trigger fear, incite violence, or makes people feel uncomfortable or violated,” Ojakian said.Faculty members told the Hartford Courant Meyrick became agitated over efforts to eventually consolidate all 12 community colleges into a single statewide college.Janelle Griffith is a breaking news reporter for NBC News. © 2018 NBC UNIVERSAL"}