{"id": "Whitey Bulger was a fixture on the FBI's 'Most Wanted' list — and for good reason", "paragraph": "His nickname was \"Whitey,\" and for law enforcement, mobster and murderer James Bulger was their great white whale — an elusive foe they hunted relentlessly for years.The notorious South Boston crime lord was a fixture on the FBI's 10 \"Most Wanted\" list after he vanished in 1994, shortly before he was due to be arrested for his alleged role in 19 murders. The hunt for him spanned the country and around the globe, with investigators reportedly chasing down leads in 19 countries.They finally caught up to him in 2011 in Santa Monica, California, where it turned out he'd been living for years under an assumed name in a modest rent-controlled apartment. The hot-tempered Bulger cursed out agents and officers who arrested him. Inside the $1,145-a-month apartment, they found a cache of more than 30 guns and $800,000 in cash.Bulger, 89, was killed Tuesday at a federal prison in West Virginia, where he was serving a life sentence for a litany of crimes including multiple murders and racketeering.Tom Duffy, a retired state police detective who searched for Bulger, called word of his death \"celebratory news.\"\"You could go back in the annals of criminal history and you’d be hard-pressed to find anyone as diabolical as Bulger,\" he said. Duffy was an adviser on the 2006 Martin Scorsese film \"The Departed,\" and Bulger was the inspiration for Jack Nicholson's \"Frank Costello\" character.Growing up in rough and tumble South Boston — his father was a one-armed longshoreman — Bulger was first arrested at age 13 for delinquency. He joined a local gang and other arrests followed, including for assault and robbery.But after a 4-year stint in the Air Force ending with an honorable discharge in 1952, his crimes got bigger and bolder — he was busted for armed robbery in 1956 and wound up doing time in Alcatraz.To get time shaved off of his 20-year sentence, he volunteered for a secret government program studying the effects of LSD on people. He said the CIA program, called MK-ULTRA, left him permanently scarred.Writing in a notebook about the experiments years later, he blamed the drug for giving him \"nightly nightmares\" and years of \"stomach problems,\" WBZ-TV reported.Nicknamed \"Whitey\" because of his blonde hair, Bulger returned in 1965 to South Boston, where his brother Billy was a state senator. Bulger eventually joined the violent Winter Hill Gang, and muscled his way up the ranks by helping to take out the gang's rivals.By 1975, Bulger had been involved with seven slayings, and was eventually recruited to become an informant for the FBI. But the arrangement worked better for Bulger than the feds — he bribed his handler and allegedly used information from him to take out another informant.Bulger would give the agent, John Connolly, information about his rivals while Connolly would tip him off to investigations and other informants.By 1979, Bulger had taken control of the Winter Hill Gang — and his connections to law enforcement helped him run a thriving loan-sharking, gun-running and drug-dealing operation. Rivals were killed or forced out of town — but Bulger also garnered a reputation as a local hero for helping to fix up the neighborhood and delivering turkeys to poor families at Thanksgiving.His luck got even better in 1991, when he \"won\" the Massachusetts \"Mass Millions\" lottery. The ticket had been purchased in a store Bulger had owned, and the winner said Bulger and two of his pals were sharing in the $14 million jackpot.By 1994, it was clear that the FBI was compromised when it came to Bulger, leading the DEA and the state police to start their own probe. The then-retired FBI agent Connolly, however, found out that Bulger had been indicted and tipped him off — letting Bulger skip out of town before he could be arrested.Bulger — who'd left safety deposit boxes of cash peppered around the country — met up with girlfriend Catherine Greig, and used fake identities wherever they went.A $2 million reward was offered for his arrest, and as the search dragged on for years, he rose to No. 2 on the FBI's \"Most Wanted\" list — behind only 9/11 mastermind Osama bin Laden.Investigators' big break came after a former neighbor who'd moved to Iceland saw a report on the search for Bulger and Greig on TV, and recognized them as the couple that would help her tend to an abandoned cat in the area, the Boston Globe reported. \"A cat got me captured,\" Bulger later groused.He was was convicted in 2013 for his role in 11 murders, as well as extortion, and money-laundering. He was sentenced to two consecutive life sentences.His brother Billy, who'd been head of the Massachusetts state senate for 17 years, never attended the trial.Grieg, 67, is at the low-level Federal Correctional Institution, Waseca, in Minnesota after she was convicted for helping Bulger stay on the run for so many years.She's scheduled to be released on Sept. 29, 2020, according to Bureau of Prison records.© 2018 NBC UNIVERSAL"}