{"id": "Jews assail 'Christian rabbi' who appeared with Pence, and so does his own movement", "paragraph": "The \"Messianic rabbi\" who outraged many Jews by invoking the name of Jesus while delivering a prayer in memory of the Pittsburgh synagogue massacre victims was also spurned Tuesday by the organization that ordained him.Loren Jacobs, who was invited onstage by Vice President Mike Pence to speak at a rally in Michigan for a GOP congressional candidate, was defrocked 15 years ago, according to a spokeswoman for the Union of Messianic Jewish Congregations.“Loren Jacobs was stripped of his rabbinic ordination by the UMJC in 2003, after our judicial board found him guilty of libel,” Monique Brumbach said in an email.Brumbach did not say who Jacobs allegedly libeled, but it appears from his synagogue website he was involved in a theological battle with other leaders of the group, which believes that Jesus is the son of God — a belief that is anathema to the vast majority of the world's Jews. Jacobs seemed to be concerned that the group was insufficiently conservative on doctrinal matters.Meanwhile, mainstream Jewish leaders and experts on the faith said they could not fathom why GOP congressional candidate Lena Epstein, herself a longtime member of a Detroit–area synagogue, invited Jacobs at all to her rally Tuesday because in their eyes he’s not even a real Jew, let alone a rabbi.“We don’t even recognize him as a rabbi,” Rabbi Marla Hornsten, past president of the Michigan Board of Rabbis, told NBC News. “Even to call him a rabbi is offensive.”As for Jacobs, he was not taking any questions about his brief appearance onstage at a rally in suburban Detroit that set social media aflame.“At this time, he isn’t taking any interviews or answering any questions,” said Jennifer Goldstein of Congregation Shema Yisrael in Bloomfield Hills, Michigan, a Messianic house of worship. “Our beliefs can be found on our web site.”And it’s their belief in Jesus as a divine savior that makes \"Jews for Jesus\" like Jacobs pariahs in the Jewish world, experts said.“Judaism itself is a multi-denominational religion that encompasses multiple forms of expression and belief,” said the Rabbinical Assembly, an organization that represents the rabbis of the Conservative Movement, in a statement. “Nonetheless, so-called 'Messianic Judaism' is not a Jewish movement, and the phrase 'Jews for Jesus' is a contradiction in terms, insofar as Judaism does not recognize Jesus of Nazareth as the Messiah.”In mainstream Jewish theology, the messiah has not yet arrived.Pence, who has called himself a born-again evangelical Christian and an ardent supporter of Israel, has been harshly criticized for having Jacobs come onstage to “offer a word of prayer” at the rally for Epstein, a Republican running for Congress in Michigan’s 11th District. His spokesman later insisted that Epstein invited Jacobs to the rally.In a statement posted on Twitter after the rally, Epstein declared herself a proud Jew and said she \"invited the prayer because we must unite as a nation — while embracing our religious differences — in the aftermath of Pennsylvania.”But while Epstein went on to accuse critics of her or Pence of “religious intolerance,” the candidate did not explain why Jacobs got the nod to give the prayer. In fact, she did not mention his name at all in her tweet.Statement on Jewish Faith and Religious Tolerance: pic.twitter.com/QUxYG3ZIh5Neither Epstein nor her campaign spokesman could be reached for comment Tuesday.“That is the question,” Hornsten said, when asked to speculate on why Epstein had Jacobs at the rally. “She didn’t reach out to any of us. That being said, none of us would have done it. Rabbis who are members of the Michigan Board of Rabbis are not participating in political campaigns.”Epstein belongs to Temple Beth El in Bloomfield Hills, Michigan, which is a Reform Jewish synagogue. NBC News reached out for comment to Rabbi Mark Miller, the temple's senior rabbi, but he did not respond.David Shyovitz, an associate professor of Jewish history at Northwestern University, said the GOP decision to “invite a rabbi who many in the Jewish community would consider a Christian is incredibly tone-deaf.”“I don’t begrudge anyone their own personal set of beliefs, but the idea that you would choose a rabbi who is not considered a Jew to deliver this kind of prayer reinforces concerns in the Jewish community that specifically Jewish concerns are not being put front and center,” he said.Shyovitz said he doesn’t doubt that Pence and other evangelical Christians are sincere in their support for Israel and Jews. It’s the \"why\" that troubles a lot of Jews, he said.“There’s at least two major issues,” he said. “One of them is that, from a historical perspective, it’s hard to disentangle Jewish-Christian relations from anti-Semitism…For a very long time, anti-Semitism was tied to certain currents in Christian ideology, like the idea that Judaism has been rejected by God and replaced by Christianity.”Secondly, he said, some trends in contemporary evangelical Christianity seem to be the opposite of anti-Semitic.“They talk about support for Israel, their love for the Jewish people, and on the surface that comes across as very unifying,” he said. “But there is a deep suspicion in much of the Jewish community that they see the state of Israel as a means to an end, that their support is based on the belief that when Jesus returns, the Jews will be converted to Christianity, or wiped out.”Corky Siemaszko is a senior writer at NBC News Digital.© 2018 NBC UNIVERSAL"}