{"id": "Healthier sides and desserts for your holiday table ", "paragraph": "No matter what your health goals are, we can all agree on one thing: The holidays aren’t a time to compromise on deliciousness! To prove that healthy holiday food  is anything but drab, I’ve rounded up some better-for-you recipes — from starters to sides to desserts — that’ll impress your guests throughout the season. You’ll definitely want to add these great-tasting recipes to your holiday lineup.Shaved Brussels sprouts are easy to find in supermarkets, and they’re the base of this elegant, easy-to-assemble salad. If you have trouble timing your holiday meals, this is one dish that can be prepared up to two days in advance. Dried cranberries are a festive addition, and sliced almonds add more nutrition and crunch to the mix. After the holidays, feel free to sub other dried fruits and nuts.Starting a holiday (or any meal) with soup is a strategy that might prevent overdoing it over the next few courses. Studies suggest that soup reduces hunger and promotes feelings of fullness, thereby curbing food intake later on. This soup has all the flavors of the holidays (butternut squash, apples), married with sharp cheddar. Plain Greek yogurt keeps things creamy (and packs in some bonus protein) and helps keep the cheese in check. Of course, there’s no need to pass on this once the holidays are over; save the recipe so you can cozy up to a bowl all winter long.This dish is a Thanksgiving classic, but with updated ingredients you and your guests will appreciate. One notable healthy replacement: Gluten-free alternative ground flax seeds thicken the sauce without needing flour. It also happens to supply some fiber. One tradition that stays: Fried onions (because, well, it’s green bean casserole after all!), though the recipe uses much less than the standard version.Even your most discerning guests are sure to love this healthier version of mashed potatoes. Starting with a base of Yukon gold potatoes makes them extra creamy since this spud has an unmatched luxurious texture. Other swaps include nonfat plain Greek yogurt for full fat sour cream and nonfat milk for heavy cream. Though these mashed potatoes still call for butter (thank goodness!), to keep with the healthy theme, the recipe uses less than others. Fresh herbs are added to boost the flavor and the holiday flair.The healthfulness of this dish come down to the whole food ingredient list. The base is homemade, gluten-free cornbread — a step that’s worth the effort for a holiday meal. But if you want to save time, you could always sub with another cornbread or gluten free bread. Once made, the bread is combined with fresh herbs, chopped walnuts, and dried cranberries. The various flavors and textures play well together and make this a holiday dish you’ll remember long after you finish your last bite.You already know that cauliflower is the master of disguise! Here, it stands in for potatoes to make latkes. This swap cuts the carbs and calories, but the recipe also suggests serving the latkes with unsweetened applesauce instead of the traditional sweetened variety and plain 0% Greek yogurt in place of sour cream. Plus, rather than deep frying the latkes, they’re sautéed in a non-stick skillet coated with a spritz of olive oil. Taken together, these recipe swaps will save you carbs, calories and sugar, leaving a little room for another Chanukah tradition: jelly donuts!With a blend of gingerbread spices, apples, and a crispy, crumble topping, this dessert will be at home at Thanksgiving and Christmas. Since it’s made in a slow cooker, you can multi-task, letting it cook (while the aroma fills your kitchen), as you’re making other holiday dishes. Since the crumble is made with ultra-healthy ground flaxseed, whole grain oats and pecans, and because the dish is low in added sugars, you could also serve it for a deliciously low-fuss holiday brunch. As a dessert, you’ll probably want to add a spoonful of whipped cream or vanilla ice cream, but if you’re going the brunch route, add a spoonful of Greek yogurt instead. If you skip the toppings or use dairy free alternatives, this crumble is both vegan and gluten free.This is one holiday dessert that won’t put you in a sugar coma! The blend of spices and the nut-free topping offer the flavor fix of a fruit crumble or pie minus a few hundred calories and the after-dessert bloat — even with the optional whipped topping or spoonful of ice cream. PS, did I mention it’s healthy, too?The aroma of gingerbread spices lends holiday cred, while the white whole wheat flour keeps this baked quick bread in the healthy lane. Tahini is a spread (similar to other nut and seed butters) made from ground sesame seeds. It’s a culinary upgrade that supplies protein and fiber, as well as important vitamins and minerals, such as magnesium. It’s so delicious, in addition to using it as an optional drizzle, you might want to consider using it as a spread for this warm, wonderful bread, and you’ll certainly find many other uses for it (say, as a dip for apples) throughout the year.Want more tips like these? NBC News BETTER is obsessed with finding easier, healthier and smarter ways to live. Sign up for our newsletter and follow us on Facebook, Twitter and Instagram.© 2018 NBC UNIVERSAL"}