{"id": "Migrants from Honduras take shelter in Mexico before heading to U.S. border", "paragraph": "CHIAPAS, Mexico — Kesler Steven, 12, was crossing from Guatemala into Mexico along with thousands of migrants fleeing from Honduras when fights broke out.Kesler said people began throwing sticks. Then the police threw tear gas.\"At first I didn't feel anything, but later I got dizzy and I couldn't feel my body,\" he said. \"I felt everything hard. I wasn't even able to walk anymore.\"In the chaos, Kesler temporarily lost track of his mother Isis Ramirez, 32. They were later reunited before the family arrived at a temporary shelter in Ciudad Hidalgo, a city in the southern Mexican state of Chiapas, which borders Guatemala.On Saturday, hundreds of migrants waited at the shelter before they were expected to continue to the U.S.-Mexico border, more than 1,000 miles away. The group is part of a caravan of approximately 4,000 immigrants fleeing Central America. On Thursday night, a portion of the group split off and crossed from Guatemala into Mexico. The approximately 2,000 to 3,000 migrants remaining in the Guatemalan border town of Tecun Uman began crossing hours after the first group.Mexican authorities were only letting small groups at a time into the country, rather than allowing mass entry, according to The Associated Press, which estimated that as many as 3,000 people had entered by Saturday.The caravan began with hundreds preparing to leave Honduras, and grew in size after media coverage. Many of the travelers, which included families with young infants, had already planned to leave the country and felt that traveling in a group would lessen the risk of falling victim to robbery and assault.Mexican authorities said on Saturday that 640 migrants from the caravan have presented asylum claims to the Mexican government, but it was unclear how many entered the country in total.As the migrants arrived in Ciudad Hidalgo, they were warmly greeted with cheers and applause by the local community. Volunteers cooked and handed out meals on the street as the group approached the temporary shelter.Inside the shelter, groups rested on blankets and slept on tiled floors beneath colorful dangling paper decorations. Others stood together, discussing what would happen next.Ramirez and her three sons left from San Pedro Sula, Honduras, with the caravan to trek toward the United States due to economic insecurity. Ramirez said at the shelter Saturday that her family left Honduras because jobs are scarce, wages are low and crime is rampant.\"We are living in very difficult situations in our country to the point that we can't even defend our own rights. When we defend our own rights, they persecute us. They kill us,\" she said. \"If the United States would investigate more about what happens in our country, they would be convinced that what we Hondurans say is true.\"Jorge Antonio Perez echoed the challenges faced in Honduras, saying people are leaving out of necessity.\"We aren't coming from Honduras because we want to, we come because we have to. Why? Because the crisis in Honduras is great — crime, basic care, health, in various aspects Honduras is bad,\" he said.U.S. Secretary of State Mike Pompeo met with Mexican President Enrique Peña Nieto and Foreign Secretary Luis Videgaray on Friday and \"discussed the caravan of migrants from Central America,\" according to a press release on Saturday.\"The Mexican Government is fully engaged in finding a solution that encourages safe, secure, and orderly migration, and both the United States and Mexico continue to work with Central American governments to address the economic, security, and governance drivers of illegal immigration,\" spokesperson Heather Nauert said in a statement.Miriam Carias, 50, who was among those who had made it to the shelter in Hidalgo, said the group would wait for other members of the caravan to join them before they continued moving north.\"Well, that's the goal,\" Carias said. \"For all of us to cross together because the caravan is very big.\"Those who crossed into Mexico and spoke with NBC News said they will have approximately 30 days to stay in the country before they must move elsewhere. But some said they wouldn't mind staying in Mexico.\"Our hope is to get to the United States but if Mexico gives us refuge then we'll stay and work here,\" Tania Rodriguez, 28, said.Many said they hoped President Donald Trump, who tweeted  without evidence on Thursday that the group of migrants was a Democrat-led \"assault on our country,\" would allow them to enter and stay in the United States.Trump on Saturday threatened to send the U.S. military to the border and seal it off if the caravan attempted to enter.\"If we are migrating, it's not because we want to leave the comfort of our homes,\" Ramirez said. \"Because if I lived okay, if we had excellent conditions, I wouldn't leave the comfort of my home to come to this country to suffer and risk my kids' lives.\"Perez begged Trump to consider his own family and how he would feel if they were among those fleeing danger and poverty.\"He is human, he knows how we feel,\" Perez said. \"So why not think about all of us? We are all human beings.\"Natalie Valdés reported from Chiapas, Mexico. Kalhan Rosenblatt and Kimberly Flores Guzmán reported from New York.© 2018 NBC UNIVERSAL"}