{"id": "Trump visits site of California's most deadly fire, pledges federal help", "paragraph": "President Donald Trump toured areas devastated by the Camp Fire in California on Saturday, pledging federal assistance to the state and the thousands of people whose homes were damaged or destroyed in the most destructive and deadly wildfire in state history.Trump, who criticized what he called poor \"forest management\" and had threatened to withhold federal funds as wildfires fires erupted a week ago, said in a visit to Paradise, a town all but wiped out by the Northern California fire that erupted Nov. 8, that the destruction was hard to imagine.\"To see what's happened here — nobody would have ever thought this could have happened,\" Trump said. \"The federal government is behind you, we're all behind each other.\"\"This is very sad to see. As far as the lives are concerned, nobody knows quite yet,\" Trump said. \"Right now we want to take care of the people that are so badly hurt, the families where they've lost — a lot of people have been lost,\" he said.At least 71 people have died in the Camp Fire, which has burned more than 148,000 acres, according to fire officials. It was 55 percent contained as of Saturday afternoon.Three people were killed in another wildfire in Southern California, bringing the deaths statewide to at least 74.The death toll in the Camp Fire could rise as searchers comb through the ruins looking for human remains, a grim but important task that involves more than 10,000 destroyed structures.More than 1,000 people are listed as unaccounted for, but Butte County Sheriff-Coroner Kory L. Honea said it may include names of survivors who don't know they've been reported missing, as well as duplicates and name misspellings.Nichole Jolly, a nurse from Paradise who fled from a hospital that caught fire, met with Trump and said \"it was wonderful to have his support, with our community.\"\"I mean, during that whole time we all felt completely helpless,\" she said. \"And just the fact that he wants to help and he wants to try and figure something else out to prevent this from happening in a different community — it’s heartwarming knowing that he does care.\"Jolly said the message she wanted to send was that displaced residents need financial assistance.\"There's rain coming, there’s kids sleeping in tents. There’s families living in motorhomes in driveways,” she said. “And insurance isn’t happening fast enough.”Trump was joined in Paradise, a town of around 26,000, by Gov. Jerry Brown and Gov.-elect Gavin Newsom.\"People have to see this to understand it,\" Trump said as he surveyed what was once the Skyway Villa Mobile Home and RV Park.In Paradise, Trump talked about looking to other countries like Finland on how to successfully manage California's forests. Trump’s comments about forest management last week as the fires raged drew criticism  from firefighters groups in California.The president later flew to the scene of the Woolsey Fire, which also broke out Nov. 8 and has burned more than 98,000 acres in Los Angeles and Ventura counties. It's destroyed at least 836 homes and other structures, according to the California Department of Forestry and Fire Protection, also known as Cal Fire.Around 200,000 people were under evacuation orders at the height of the fire. The Woolsey Fire was 82 percent contained as of Saturday afternoon, according to Cal Fire.Trump visited Malibu, the seaside community that was forced to evacuate.\"This is incredible,\" Trump said. \"We’re in Malibu, and a certain section of Malibu that was lovely. You don't get much better than this, and you see the devastation.\"He praised government officials and first responders, calling the evacuation orders \"the right decision.\"\"It's horrible, but it's also pretty incredible, the job they've done,\" Trump said.Trump was asked Saturday in Northern California whether seeing the devastation of the fires firsthand had changed his opinion on climate change.\"No. I have a strong opinion. I want great climate, and we're going to have a forest that is very safe. We can't go through this every year,\" Trump said.Trump has signed a major disaster declaration to provide federal aid for the state. In a joint statement before Trump's arrival, Brown and Newsom said they welcomed Trump's visit.\"We welcome the President’s visit to California and are grateful for the quick response to our aid requests. Now is a time to pull together for the people of California,\" the statement read.When asked what the federal government should be doing to help, Brown said in Paradise that \"what needs to be done is what is being done,\" including putting the Federal Emergency Management Agency on the job, supporting first responders and conducting cleanup and the search for victims of the fire. Brown called it \"a terrible tragedy.\"It is Trump’s second visit to California during his presidency.Kalhan Rosenblatt is a reporter for NBC News, based in New York.Phil Helsel is a reporter for NBC News.© 2018 NBC UNIVERSAL"}