{"id": "Sweden may become latest country to annul child marriages", "paragraph": "Swedish lawmakers are set to vote on a proposed crackdown on child marriage next week — a move echoing measures taken by a host of countries in the wake of Europe's refugee crisis.A current ban on marriages for people under 18 would be extended, if the bill is approved, to invalidate such unions of foreigners carried out abroad. Couples who wish to stay together will have to wait until 18 to remarry.The potential law and others are widely seen as a reflection of the challenges involved in integrating the more than one million migrants who have arrived in Europe since 2015.\"We need to let children be children no matter if they are from Sweden or another country,\" said My Hellberg, from TRIS, or the Young Women's Rights Society, which runs shelters and campaigns against domestic abuse perpetrated in the name of “honor” for bringing shame on families.Child marriage disproportionately affects girls, and increases their chances of dropping out of education, living in poverty and becoming victims of domestic violence.The number of underage married asylum-seekers and refugees across Europe is not known, however, and rights groups estimate that many unions go unrecorded.\"I don’t think it makes you an apologist for child marriage in any way to say that these situations are complicated.\"Most European countries still allow marriage under the age of 18 in certain circumstances, such as with parental consent or the approval of a judicial or governmental authority. In U.S. the situation is similar, with Delaware this year becoming the first state to ban marriage for anyone under 18 without exception.But in the last three years, the Netherlands, Denmark and Norway have either outlawed child marriage or extended their bans to include the marriages of young foreign nationals wed abroad. A British lawmaker has also introduced a bill to ban unions under the age of 18 in England and Wales.Swedish lawmakers are due to vote on the proposal on Wednesday.In 2016, Sweden's Migration Agency said it had identified 132 cases of children who said they were married on asylum applications, but acknowledged there were probably more. In the same year, more than 1,400 underage foreign children were listed as married in Germany, according to the country’s Central Register of Foreign Nationals.In 2017, Germany outlawed all marriages involving anyone under 18. So far this year, the official number of married underage foreigners has dropped to under 300, but women’s rights organization Terre Des Femmes said the real number was likely much higher.\"We fear that many girls now coming to Germany lie about their age or claim they are not married in order not to have their marriage declared invalid,\" said Monika Michell, an expert in honor-based violence for Terre Des Femmes in Germany.While it has recently gained currency because of the refugee crisis, the issue of child marriage among migrants is not new.Sara Mohammad has spoken of how her brother once held a Kalashnikov to her head. She was 17 and he was trying to force her to marry a man she had never met.On the day before her wedding Mohammad fled Iraq. She would eventually claim asylum in Sweden, where she now runs a charity, GAPF, which campaigns against honor-related violence.More than 30 years later, she is hopeful her adoptive country will extend its ban on child marriage.“It would be a great thing for the Swedish government to show the world that we protect children from child marriage,” she said.So Sweden’s legislation could not come soon enough for Mohammad. She said she believed guilt felt by many in former colonizing countries and a fear of being accused of racism or Islamophobia has stopped European Union governments from legislating against child marriage for foreigners.Cultural relativism — the idea that morality is not absolute but exists in relation to one’s culture or religion — also played a role, she said. \"We see them as victims,\" Mohammad added.But others argue that religion, culture and circumstance should be taken into account when considering invalidating child marriages of foreigners and especially asylum-seekers.“If the child concerned is happy and it was a consensual relationship, why would I break them up? Why would I want to annul that?” asked Ajmal Masroor, a British imam. “The revised law is going to target them disproportionately, marginalizing them even further, criminalize them for nothing and may push them into a more vulnerable position than they already are.\"Masroor criticized the “hypocrisy” of European countries’ tendency to consider a young person adult enough to choose to have sex but not to decide to marry.Practicing Muslims cannot have sex or start a family before they are married, and therefore any legislation that raises the age of marital consent above the age of sexual consent discriminates against them, he said.Heather Barr, a senior researcher at the Women’s Rights Division of Human Rights Watch, said while she supported outlawing child marriage, a blanket decision to invalidate all underage unions of refugees and asylum-seekers was not the answer.“When somebody arrives and they’re already married, the situation is more complicated and that’s why nothing short of an individual assessment is going to do the trick,” she said.She said social workers would have to assess the best interests of the child considering that she is already married. This, Barr said, included asking how the girl may be perceived by her community if she is no longer married and whether it might expose her to a higher risk of violence.“I don’t think it makes you an apologist for child marriage in any way to say that these situations are complicated,” she said.Decisions by countries such as Germany, Norway or Denmark to raise the age of marital consent in the wake of the refugee crisis struck her as “ugly,” and she suggested that it was most likely fueled by stereotypes and xenophobia.“Lots of European countries that didn’t see any problem with the laws that they have on the books that permitted child marriage have suddenly become concerned that those laws are a problem,” she said.Saphora Smith is a London-based reporter for NBC News Digital. © 2018 NBC UNIVERSAL"}