{"id": "From sperm donor to 'Dad': When strangers with shared DNA become a family", "paragraph": "When Peter Ellenstein goes out to dinner with his children, who range in age from 17 to 30, the meals are raucous, and there is always a lot of catching up to do — especially because no one in the family knew each other before last October.Ellenstein, 57, donated sperm anonymously in his 20s and early 30s to make some extra cash, and never expected to meet any of his offspring. But this past year, thanks to online tools, including DNA test kits, he discovered that he has at least 24 biological children. A divorced theater director living in Los Angeles who never raised any kids of his own, Ellenstein has met 20 of them so far. One calls him every day and recently took a three-week trip to Europe with him; others are less involved, but still show up to family dinners, some with the hope that he’ll pick up the check.When Ellenstein first found out about his offspring, “it was just a huge shock,” he said. Fearing the interactions might be awkward or disappointing, he was initially reluctant to meet his children.Now, though, his life revolves around them — whether he’s proudly introducing them to his mother or helping them play practical jokes on one another.“It’s the best thing that’s ever happened to me,” he said. “Each kid so far that I’ve met is a whole other adventure and a whole new exciting thing in my life.”As more donor-conceived children connect with each other and their biological parents thanks to social media and at-home genetics tests such as 23andMe and Ancestry.com, a new kind of modern family is emerging. The first meeting between half-siblings and sperm donor dads can be fraught, but what follows over the ensuing years may be even more complicated. Some children grow close with their biological fathers and half-siblings, even moving in with them. Others are more hesitant, unsure of how or whether to build a relationship with people whose existence, in some cases, was a family secret.The newly formed connections raise delicate questions: Should a sperm donor who didn’t raise his children refer to them as his son or daughter? Should they call him Dad? And how does the introduction of this new blood relative affect existing relationships with the parents and siblings that a person grew up with?NBC News spoke to more than a dozen sperm donors, donor-conceived children and parents who received sperm donations about what happens when strangers with shared DNA get to know each other. Some donor-conceived children spoke glowingly of spending Father’s Day with their sperm donors. Others described friction with the parents who raised them. One recalled learning in her 30s that she was donor-conceived, which set off panic attacks over her sense of self, even though she and her sperm donor get along well.And for others, the hoped-for relationship never materialized at all.\"There’s never a dull moment.\"“There’s no social script for any of these scenarios,” said Erin Jackson, founder of We Are Donor Conceived, a support group and resource page with more than 650 members on Facebook.Jackson, 38, of San Diego, started the group in 2016 after finding out that she had been donor-conceived. She had tracked down her biological father and sent him a letter, tucking a photo of herself inside. He didn’t write back until two years later, and when he finally did, “he basically told me to get lost,” Jackson said. “I tried not to get my hopes up, but I was still disappointed.”Now, she helps others navigate the emotional twists and turns.“There’s never a dull moment,” she said.Although there are no firm numbers, experts say more people than ever are connecting with biological relatives. Over 15 million have signed up for 23andMe and Ancestry.com, the two major at-home genetics testing companies, both of which offer an optional relatives matching tool (the companies do not disclose how many matches have been made).The matching tools work by showing customers others who have signed up for the same genetics test whose DNA overlaps with their own, if they have also opted in to the feature. By displaying the percentage of overlap, it indicates how close the relation is. Users can send then messages to their connections through 23andMe or Ancestry.com.Meanwhile, on the Donor Sibling Registry, the largest matching site for donor-conceived people, more than 16,300 offspring have found half-siblings or donors, with nearly a quarter of those connections being made in just the last three years, says its co-founder and director, Wendy Kramer, whose son, Ryan, is donor-conceived. Kramer and her son co-founded the registry in 2000.Increasingly, donors and their offspring are going beyond an initial online connection, according to Rosanna Hertz, a professor of sociology and women’s and gender studies at Wellesley College in Massachusetts who researches contemporary reproduction.“In early surveys that I did [in 2009], people would find other donor siblings. They would exchange emails, maybe some photographs, and that would be it. Now more people are choosing to meet offline,” said Hertz, the co-author of a new book, “Random Families: Genetic Strangers, Sperm Donor Siblings and the Creation of New Kin.”But the unregulated landscape of sperm banks has added to the challenges donors and offspring face when they meet. For one thing, with no federal data or tracking, donors have no idea how many offspring they have sired — and consequently, no idea how many they can expect to hear from.Despite efforts to increase regulation, sperm banks in America operate with barely any federal scrutiny. Experts say there is no official tally of how many babies have been born as a result of sperm donations in the U.S, nor is there a large effort on the part of banks to obtain such data (most ask sperm recipients to self-report any pregnancies and births, but they do not require it).And while there are recommendations for how many times a single sperm donor’s specimen should be used, there are no laws officially limiting how many babies can be born from one man’s sperm, as there are in the United Kingdom, Norway and Hong Kong, among many other countries.For the growing number of donors and their children, figuring out a relationship can be complex, Hertz said.\"The donors usually play it by what the kids want.\"Some donors want to get to know their offspring, but have never told their spouses that they used to donate sperm. Other times, a donor gets overly excited and will post pictures of his offspring on Facebook, upsetting the parents who raised the children.But generally, donors are respectful, Hertz said, based on her interviews with more than 550 people and surveys of more than 4,000 others.“The donors usually play it by what the kids want,” she said.That is the approach that Ellenstein says he has taken with each of his children. Rachel White, 24, was the first to make contact with Ellenstein after she used the scant details that the sperm bank had given her mother to find him on the Internet Movie Database in 2017 and match his birthday and other information.When White, who works in music production, first met Ellenstein, she saw a lot of herself in him — and the similarities went beyond their looks. Ellenstein bumped into a table as he walked toward her at the Los Angeles cafe where they met — White, whose mother is dancer, had always wondered where her clumsiness came from.White talks to Ellenstein on the phone daily now, asking for advice on everything from money to car repairs, and catching up on how her half-siblings are doing. She said she sometimes jokingly calls Ellenstein “dad,” but he’s more like an uncle.\"He almost feels like a strange, older, male extension of myself.\"“He almost feels like a strange, older male extension of myself,” she said. “But obviously we’re not the same person. We are vastly different in many ways, but it feels like a weird limb that I discovered.”In a private Facebook group with his offspring, Ellenstein has noticed that his children share his love for board games, podcasts and puns and word play.“I’ve been nicknamed all kinds of things by them — ‘Papa Jerk’ included,” he said, laughing. “They all have a pretty word-oriented and snarky and kind of profane sense of humor. There’s no shortage of swearing.”Michael Rubino, a Los Angeles artist, donated sperm in the 1990s in the hopes of helping couples struggling with infertility. He has 20 offspring, 18 of whom he has met. A Democrat, atheist and vegetarian, Rubino was initially worried when he first heard from one of his biological children: Nathan Mayes, a Republican, evangelical Christian from Bryant, Arkansas, who enjoys hunting.Mayes, 20, also wasn’t sure what to expect. He does mission work and was worried about Rubino’s lack of belief in God. Nonetheless, he flew to California a couple years ago to meet Rubino, 59, and they bonded over their shared passion for creating art.\"We are polar opposites, yet we are so much alike.\"Encouraged, Mayes then invited Rubino to meet the family who raised him. But Mayes was nervous about how Rubino would respond to displays of faith, so he requested beforehand that his family not say grace during the visit, something they normally do at every meal.“We were still kind of getting to know each other, and I definitely didn’t want to make him uncomfortable,” Mayes said.A few days into the visit — during which Rubino found more common ground with the family than he expected — the family confessed to Rubino that they usually said grace, but had held off at Mayes’ request.That struck Rubino as considerate but unnecessary.“When I found out, I said, ‘Oh no, you guys. Nathan, please be yourself.’”Since then, their relationship has strengthened. Like Rubino, Mayes enjoys painting. So when Mayes was scraping together money for a study-abroad program, Rubino invited him to join him on a mural-painting job in California. The two have since worked on two other murals together.“I was excited and really, really nervous when I did my first painting with him,” Mayes said. “But he is so easy and comfortable to work with.”Their relationship now is like that of “best friends,” Mayes added. “We are polar opposites, yet we are so much alike.”Jessica Share, whose 13-year-old daughter Alice Mikell is donor-conceived, never expected to meet her child’s sperm donor, never mind date him and move in with him. But that is exactly what happened last year.Until she signed Alice up for a 23andMe test, Share, who lived in Oregon and works in marketing, simply knew Alice’s father as Donor No. 2008 at the Fairfax Cryobank. When Aaron Long, 52, popped up as a DNA match in February 2017, Share sent him a message.Long, a communications specialist for a nonprofit in Seattle, had donated sperm more than two decades earlier to make some money after returning from teaching English overseas. He had already begun hearing from some of his offspring (he has at least 10), and he wrote back a warm introduction about himself to Share, attaching a 13-page biography that he had written and shared with his other biological children.For the next five months, Share and Long continued to exchange messages. Then in July 2017, Long invited all of the biological children he had connected with by that point to visit Seattle.When they met in person, Share was struck by how familiar Long already seemed: So many of his mannerisms were similar to their daughter’s.“I felt like I had been watching him for over a decade,” said Share, who has another daughter who was also donor-conceived by Long (that daughter lives with Share’s ex-wife and has not met Long). “I had these threads of him. This wasn’t what made the bond, but it certainly made him very familiar to me because he right away looked and acted like people I had known and loved for a decade.”Weeks after meeting Long, Share, 42, and Alice were having trouble with their landlord in Oregon. A spot opened up in Long’s building, a communal living cooperative, and given how close Long was growing with Share, he suggested they move in for a few months.It ended up going well — so well that Long and Share began dating and now live together, with Alice. In May, another biological daughter of Long’s, who is 21, joined them from Virginia.For Share, the new living arrangement is a welcome twist. But everyone in the family is quick to acknowledge that while they live in close quarters, Long is not a father figure to Alice — especially Alice herself.\"We’re definitely not a family. This is not the nuclear ‘Brady Bunch’ thing.\"While Alice says the two are “chill” together, the teen sees Long more as her mother’s boyfriend than anything else.“We’re definitely not a family. This is not the nuclear ‘Brady Bunch’ thing,” Alice said. “You can’t just adopt someone as your dad, despite what chick flicks say.”For Ellenstein, the new relationships with his 24 children have gone well — so far. He sometimes worries that more offspring will be discovered and that he will be spread too thin to give each the attention that they want and deserve.But each child, in his mind, has been an unexpected bonus in his life.“I lucked out,” Ellenstein said.Elizabeth Chuck is a reporter for NBC News.© 2018 NBC UNIVERSAL"}