{"id": "Mike Pence laughs off reports that Trump questioned his loyalty", "paragraph": "PORT MORESBY, Papua New Guinea — Vice President Mike Pence on Saturday laughed off the suggestion that President Donald Trump has recently questioned his loyalty, saying that he “was tempted not to dignify it with a comment.”A New York Times story on Friday reported that multiple aides and outside advisers to the president had said Trump was openly asking whether Pence was loyal to him.Earlier in the week at a White House press conference, Trump was asked about Pence and had his vice president stand as he responded that he felt “very fine” about having Pence be on his 2020 ticket.While talking to reporters overseas on Saturday, Pence acknowledged talking with Trump in a phone call earlier in the day about the article but said that Trump made clear to him that he had never questioned Pence’s loyalty.“Let’s just leave it that we had a good laugh, and you know, the president said to me, ‘There are no anonymous sources that would say what that article said,’” Pence said.Pence responded to the article while in Papua New Guinea at APEC, the Asia-Pacific Economic Cooperation.“The president and I are very close,” Pence said to reporters. “We have a very strong relationship. And I’ve been honored to serve as his vice president. And I was honored when he asked me to run with him again.”On Saturday, Trump tweet without evidence that The New York Times \"made up sources\" for their story and that they \"refused to ask\" Trump for a quote.\"I can’t imagine any President having a better or closer relationship with their Vice President then the two of us,\" Trump tweeted.The New York Times did a phony story, as usual, about my relationship with @VP Mike Pence. They made up sources and refused to ask me, the only one that would know, for a quote....The vice president was also asked about NBC News’ report that his current chief of staff, Nick Ayers, is under consideration to replace Gen. John Kelly as President Trump’s chief of staff.“If the president is going to make any changes, I’ll leave it to the president to announce changes,” Pence said. “But Nick has done a phenomenal job. I think John Kelly has done a tremendous job as chief of staff.”Vaughn Hillyard is a political reporter for NBC News. © 2018 NBC UNIVERSAL"}