{"id": "Migrant caravan embarks on 'route of death' through Mexico", "paragraph": "ISLA, Mexico — Thousands of wary Central American migrants resumed their push toward the United States  on Sunday, a day after arguments over the path ahead saw some travelers splinter away from the main caravan, which is entering a treacherous part of its journey through Mexico.The majority of the roughly 4,000 migrants are now headed along what some called the \"route of death\" toward the town of Cordoba, in the state of Veracruz, which is about 124 miles up the road. The daily trek will be one of the longest yet, as the exhausted group of travelers tries to make progress any way it can to the U.S. border still hundreds of miles away.The arduous trip has already taken its toll.A day prior, the group was beset by divisions as migrants argued with caravan organizers and criticized Mexican officials before setting out on their own for Puebla and Mexico City.Some were disappointed after caravan organizers unsuccessfully pleaded for buses after three weeks on the road. Others were angry for being directed northward through the Gulf Coast state of Veracruz, calling it the \"route of death.\"A trek via the sugar fields and fruit groves of Veracruz takes them through a state where hundreds of migrants have disappeared in recent years, falling prey to kidnappers looking for ransom payments.Authorities in Veracruz said in September they had discovered remains from at least 174 people buried in clandestine graves, raising questions about whether the bodies belonged to migrants.But even with the group somewhat more scattered, the majority of migrants trekking through Veracruz on Sunday were convinced that traveling as a large mass was their best hope for leaving their old lives behind and reaching the U.S. The vast majority of migrants are fleeing rampant poverty, gang violence, and political instability primarily in the Central American countries of Honduras, Guatemala, El Salvador and Nicaragua.\"We think that it is better to continue together with the caravan. We are going to stay with it and respect the organizers,\" said Luis Euseda, a 32-year-old from Tegucigalpa, Honduras who is traveling with his wife Jessica Fugon. \"Others went ahead, maybe they have no goal, but we do have a goal and it is to arrive.\"Mynor Chavez, a 19-year-old from Copan, Honduras, was determined to continue.\"I have no hope. I graduated as a computer technician and not even with a degree have I been able to find work,\" he said of life in his home country.In his desperation to flee, Chavez was one of the many people who crossed a river from Guatemala into Mexico, defying authorities deployed to patrol that country's southern frontier.It remained to be seen if the main group will now continue directly north through Veracruz to the closest U.S. border, or veer slightly westward and make a stop in the country's capital.The capital could serve as a better launching pad for reaching a broader array of destinations along the U.S. border. They could also receive additional support, although Mexican officials have appeared conflicted over whether to help or hinder their journeys.Mexico now faces the unprecedented situation of having three caravans stretched over 300 miles (500 kilometers) of highway in the states of Chiapas, Oaxaca and Veracruz, with a total of more than 6,000 migrants.On Friday, a caravan from El Salvador waded over the Suchiate River into Mexico, bringing 1,000 to 1,500 people who want to reach the U.S. border.That caravan initially tried to cross the bridge between Guatemala and Mexico, but Mexican authorities told them they would have to show passports and visas and enter in groups of 50 for processing.Another caravan, also of about 1,000 to 1,500 people, entered Mexico earlier this week and is now in Chiapas. That group includes Hondurans, Salvadorans and some Guatemalans.The first, largest group of mainly Honduran migrants entered Mexico on Oct.19.Immigration agents and police have at times detained migrants in the smaller caravans. But several mayors have rolled out the welcome mat for migrants who reached their towns — arranging for food and camp sites.Mexico's Interior Department says nearly 3,000 of the migrants in the first caravan have applied for refuge in Mexico and hundreds more have returned home.With or without the government's help, uncertainty awaits.President Donald Trump has ordered U.S. troops to the Mexican border in response to the caravans. More than 7,000 active duty troops have been told to deploy to Texas, Arizona and California ahead of the midterm elections.He plans to sign an order next week that could lead to the large-scale detention of migrants crossing the southern border and bar anyone caught crossing illegally from claiming asylum.© 2018 NBC UNIVERSAL"}