{"id": "Trump on Abrams: 'One of the most extreme, far-left politicians in the entire country' ", "paragraph": "WASHINGTON — President Donald Trump praised Georgia Secretary of State Brian Kemp, the Republican candidate for governor, saying on Sunday that his campaign has been \"extraordinary\" and tagging Democrat Stacey Abrams as an extremist.\"He studied for this job for a longtime. He will be a great executive and he will keep Georgia on the path it is going, which is up,\" Trump told reporters as he left the White House for a campaign rally with Kemp in Macon, Georgia.At the event, Trump ripped into Abrams.\"If Stacey Abrams gets in, your 2nd Amendment is gone,\" Trump said. \"Stacey Abrams is one of the most extreme, far-left politicians in the entire country.\"Abrams has said she supports the 2nd Amendment but also favors stricter gun control.Trump called Abrams weak on crime and claimed, \"You put Stacey in there and you are going to have Georgia turn into Venezuela\" — a criticism the president has made against many Democrats.Kemp is running in a close race against Abrams, who would become the first black woman to be elected governor in the country if she wins.Georgia's history of voter disenfranchisement, coupled with Abram's historic campaign, and recent vote fraud and suppression charges from both sides have put voter rights issues front and center in the governor's race.Kemp has come under fire from Democrats for allegedly suppressing minority votes in his role as secretary of state, which oversees elections in the state. And Kemp accused the state Democratic Party on Sunday of an attempted hack of the voter registration system. The Democratic Party called Kemp’s accusations, for which he provided no evidence or specifics, a \"political stunt.\"\"If she gets in, Georgia goes backwards,\" Trump said before leaving he White House. \"If he gets in, Georgia goes forward.\"Trump also expressed confidence in GOP enthusiasm just two days before the midterm election on Tuesday.\"I have never seen such an enthusiastic Republican Party,\" Trump told reporters. \"The level of fervor, the level of fever, is very strong on the Republican side.\"Trump finished his campaigning Sunday night in Chattanooga with Republican Senate candidate Rep. Marsha Blackburn.Blackburn has found herself in a surprisingly close race against former Democratic governor Phil Bredesen in a state that Trump carried by more than 20 points in 2016. A recent NBC/Marist poll shows 51 percent of likely voters supporting Blackburn compared to 46 for Bredesen, within the poll’s margin of error.Despite Bredesen’s reputation as a moderate bipartisan, Trump attempted to portray him as a fringe candidate — an attack the president frequently uses on the campaign trail.\"Marsha is running against a far-left liberal — and you are finding that out finally — named Phil Bredesen,\" Trump said to the Tennessee rally goers. \"He is the handpicked candidate of Chuck Schumer.\"Blackburn, too, was there to remind voters of the “D” next to Bredesen’s name.\"If my opponent had his way, Hillary Clinton...would be president,\" Blackburn said, inciting a change of \"Lock her up!\" from the crowd. \"Not any of this would be happening,\" Blackburn added, touting Trump’s accomplishments.Trump will hold rallies in Ohio, Indiana and Missouri on Monday for his final day of midterm campaigning before the Tuesday election.© 2018 NBC UNIVERSAL"}