{"id": "USC offers $215M to settle gynecologist sex abuse claims, some opposed", "paragraph": "LOS ANGELES — The University of Southern California says it would pay $215 million to settle claims of sexual abuse and harassment by a school gynecologist, but lawyers for hundreds of the accusers say it's not enough money and the university has yet to fully disclose what it knew about the doctor's behavior.The tentative settlement, which needs a judge's approval, will provide compensation ranging from $2,500 up to $250,000 to women who say Dr. George Tyndall abused them between 1988 and 2016, USC Interim President Wanda Austin said Friday in a statement.About 500 current and former students have now made accusations against Tyndall and filed various lawsuits. They contend he routinely made crude comments, took inappropriate photos, forced them to strip naked and groped them under the guise of medical treatment.Tyndall spent about three decades as a USC staff gynecologist before retiring last year after a university investigation concluded there was evidence that he sexually harassed students during exams.Tyndall has denied the allegations and has not been charged with a crime. The Los Angeles police and the Los Angeles County district attorney's office are reviewing allegations against him.His attorney, Leonard Levine, said in a statement that Tyndall \"continues to focus on the criminal investigation\" and had no further comment.The proposed settlement specifically applies to a pending federal class-action lawsuit that involves a fraction of the overall accusers but is open to every woman who ever had an appointment with the gynecologist.Three attorneys representing nearly 300 alleged victims say they're strongly advising their clients against joining the federal action so they can continue their fight in state court instead.\"The only guaranteed number in this case is $2,500 — $2,500 won't even get you a 50-yard-line seat at a USC football game, let alone compensate somebody for being sexually assaulted by their doctor when they were 18 or 17,\" said John Manly, an attorney who represents 180 accusers.Attorney Gloria Allred, who represents 36 women who have accused Tyndall, said in a statement that the amount of money under the proposed settlement is \"way too minimal.\"\"In our opinion, for what some of the victims went through, this is a nuisance amount and may not properly compensate victims for what some of them have suffered,\" she said.Manly also criticized the proposed settlement as failing to hold USC accountable and called it an effort to cap future monetary damages.\"We still don't know when did USC first know, how often were they warned, what administrators were involved, was there criminal conduct?\" Manly said. \"Our clients, more than anything, want those answers and people held accountable, not because it helps their case but to protect the future women at USC.\"Tara Lee, an attorney who represents USC, said questions regarding potential criminal conduct are being investigated \"and those answers will be available when the investigation itself is completed.\"\"The settlement process they're criticizing would not provide for that,\" she said. \"The settlement process would be very victim-focused to address their needs and make sure they have their claims identified and awarded.\"She said the university has worked \"to make this as inclusive a process as possible.\"Under the proposed settlement, any woman who had an appointment with Tyndall will get $2,500. Those who submit written claims detailing their allegations and the impact on their lives would be eligible for between $7,500 and $20,000. Women who agree to further detail their allegations in a private interview with a psychologist could see damages of up to $250,000.\"We tried to come up with a structure for the settlement that allows for individual plaintiffs in the punitive class to decide on an individualized level of engagement with the process,\" Lee said.Attorney Mike Arias, who represents 80 accusers, criticized how fast the proposed settlement came about, saying he and other attorneys were expecting USC to disclose more information about the case during mediation.\"USC may quell the depth of the anger and upset by getting hundreds of other victims to join the settlement, but it's not going to be over,\" Arias said, adding that he and other attorneys will \"fight like hell\" against the settlement's approval.The university was first criticized in the case after the Los Angeles Times reported earlier this year that complaints and comments about Tyndall's care went unheeded by the school for decades and that USC failed to report him to the medical board even after the school quietly forced him into retirement.Two administrators were fired, and President C.L. Max Nikias stepped down  following the criticism. USC has denied accusations of a cover-up.Austin said in a statement that since she became interim university president, \"a fair and respectful resolution for as many former patients as possible has been a priority for the university and for me personally.\"\"Many sweeping changes have been made and we continue to work every day to prevent all forms of misconduct on our campuses, to provide outstanding care to all students, and to ensure we have policies and procedures that prioritize respect for our students and our entire university community,\" she said.On Thursday, 93 women who say Tyndall abused or harassed them announced the latest lawsuit against the university, saying it ignored decades of complaints.Dana Loewy said Tyndall assaulted her during an exam in 1993.\"I am part of an accidental sisterhood of hundreds of women because the university we love betrayed our trust,\" she said.© 2018 NBC UNIVERSAL"}