{"id": "Saudi Arabia's explanation for Khashoggi's death draws international criticism", "paragraph": "Saudi Arabia said Friday evening that 18 of its citizens are responsible for the killing of Saudi journalist Jamal Khashoggi at its Istanbul consulate, with the Saudi general prosecutor claiming that the writer's death was a result of a \"quarrel and fighting by hand.\"On Friday, President Donald Trump continued to stop short of criticizing the Saudi government, with which he maintains close diplomatic ties after making a major arms deal Trump says is worth $110 billion in May 2017.He called the alleged fistfight \"a theory that was put out\" on Friday. His comment came days after he suggested that Khashoggi, a Virginia resident who disappeared Oct. 2 after entering the Saudi consulate in Istanbul, was murdered by \"rogue killers.\"\"It's early — we haven't finished our review or investigation — but it's, I think, a very important first step, and it happened sooner than people thought it would happen,\" the president said Friday after news of the arrests became public.Trump was criticized by some for his response to the Saudi explanation. The president said Saturday in Nevada that \"I'm not satisfied until we find the answer\" and \"I want to get to the answer.\" He repeated his support for the arms deal and said it should not be cancelled, but said \"there are other things that can be done, including sanctions.\"The Washington Post, the newspaper that Khashoggi wrote for, said that this is just the latest falsehood from a a Saudi government that has lacked credibility since the journalist first disappeared.\"The Government of Saudi Arabia has shamefully and repeatedly offered one lie after another in the nearly three weeks since Jamal Khashoggi disappeared in their Istanbul consulate,\" the Washington Post said in a statement. \"Offering no proof, and contrary to all available evidence, they now expect the world to believe that Jamal died in a fight following a discussion. This is not an explanation; it is a coverup.\"The Washington Post called on President Trump, Congress and leaders across the world to conduct an independent investigation. \"The Saudis cannot be allowed to fabricate a face-saving solution to an atrocity that appears to have been directed by the highest levels of their government,” the newspaper's statement added.The kingdom's latest explanation, its numerous changes in narrative and the fact that Khashoggi's body still has not been discovered leaves a number of unanswered questions  and has earned international criticism, as well as criticism from many members of Congress on both sides of the aisle.Former Vice President Joe Biden did not hold back at a Nevada Democratic Party rally in Las Vegas on Saturday, telling the crowd the world is watching the United States, \"and they're wondering, where in the hell are we?\"\"You don’t bring bone saws to fights,\" Biden said, referring to reports that Saudi agents dismembered Khashoggi's body. \"What is going on here? It's embarrassing, but it's also dangerous.\"Republicans and Democrats in the House and Senate have called for the president to hold Saudi Arabia accountable. Some have gone as far as to call for Trump to pull back on the nation's close ties with the kingdom.Rep. Mike Coffman, R-Colo., a member of the House Armed Services Committee and Marine Corps veteran, provided a particularly blistering statement that said “our country must stand up for our values and demand our allies respect human rights — I did not fight to have us look the other way.”The congressman, who is in the middle of a tough re-election bid in a district that Hillary Clinton won by 9 points in 2016, called for an international and diplomatic response.“The United States and the rest of the international community must condemn the murder of Mr. Khashoggi and the use of diplomatic posts as torture chambers for rogue nations,” Coffman said in a statement. “I am calling on President Trump to immediately recall the (Acting) U.S. Ambassador to the Kingdom pending further consultation with Congress.”Sen. Lindsey Graham, R-S.C., a close ally of President Trump and member of the Armed Services Committee, did not seem to buy the kingdom's official claim about a fistfight.“To say that I am skeptical of the new Saudi narrative about Mr. Khashoggi is an understatement,” Graham tweeted.Graham signed a letter to Trump along with Sens. Bob Corker, R-Tenn., Bob Menendez, D-N.J., and Patrick Leahy, D-Vt., as well as 18 other senators last week that triggered an investigation under the Global Magnitsky Act. The law allows the federal government to sanction and restrict the travel of those people who violate human rights.“The story the Saudis have told about Jamal Khashoggi’s disappearance continues to change with each passing day, so we should not assume their latest story holds water,” said Corker, the chairman of the Senate Foreign Relations Committee, on Friday evening. “They can undergo their own investigation, but the U.S. administration must make its own independent, credible determination of responsibility for Khashoggi’s murder under the Global Magnitsky investigation as required by law.”Sen. Chris Coons, D-Del., who also signed the letter and serves as a member of the Senate Foreign Relations Committee, agreed with his Republican colleague’s assessment, stating that “the explanation by Saudi officials that [Khashoggi] was killed in an impromptu ‘fist fight’ is not credible.”Amnesty International and the Committee to Protect Journalists both called for an independent investigation, a demand that has earned international support.#JamalKhashoggi walked into a #Saudi Arabian consulate in Turkey and disappeared. We need to know what happened. Without an independent investigation, we may never get the full truth. Take action now. https://t.co/ybMmxQoSQU“We need an international investigation and relentless pressure on #SaudiArabia from the Trump administration, if we ever hope to get to the truth.” @Joelcpj https://t.co/U7H38nIHBKNumerous countries have called for further clarity surrounding Khashoggi’s death.The Associated Press reported that German Chancellor Angela Merkel said that “still nothing has been cleared up,” adding that her government would demand transparency.Germany is in a similar economic position with Saudi Arabia as the United States, as the German government authorized arms exports worth more than $290 million to Saudi Arabia over the past six months, according to the AP.Dutch Prime Minister Mark Rutte also emphasized that many questions remain surrounding Khashoggi's death.\"A lot still remains uncertain. What happened? How did he die? Who is responsible? I expect and I hope that all relevant facts will be clear as soon as possible,\" Rutte said in Copenhagen, according to Reuters. \"Thorough investigation is necessary.\"The European Union’s high representative also said in a statement Saturday that \"The emerging circumstances of Jamal Khashoggi’s death are deeply troubling\" and violated the 1963 Vienna Convention on Consular Relations.\"The European Union, like its partners, insists on the need for continued thorough, credible and transparent investigation, shedding proper clarity on the circumstances of the killing and ensuring full accountability of all those responsible for it,\" the EU statement said.Meanwhile, Saudi Arabia has also received some international support as well.Egypt Ministry of Foreign Affairs shared a statement that gave the benefit of the doubt to the Saudi king, asserting that the Kingdom appeared committed “to finding the truth of this incident and taking the required legal action against those involved.”“The Arab Republic of Egypt offers the sincerest condolences to journalist Jamal Khashoggi's family, and expresses its trust that the judicial procedures undertaken by the Saudi government will resolve the truth of what happened with irrefutable evidence, and cut off any attempt to politicize the case with the aim of targeting the sister Kingdom of Saudi Arabia,” the Egyptian Ministry of Foreign Affairs said in a statement.© 2018 NBC UNIVERSAL"}