{"id": "'Blue Zones': 6 secrets to borrow from people who live the longest", "paragraph": "Move over seven wonders of the world! We’re obsessed with the five Blue Zones, the mysterious regions where people statistically live the longest.These five locales, Sardinia, Italy; the islands of Okinawa, Japan; Nicoya Peninsula in Costa Rica; Ikaria, Greece; and Loma Linda, California; don’t appear to have too much in common at first glance. They’re all relatively warm year-round, fairly small, remote and close to the ocean.But the cultural differences far outweigh these broadly shared attributes, and it’s safe to say that a person from Loma Linda would experience a bit of culture shock if suddenly transplanted to Okinawa (and vice versa).The beauty of the Blue Zones is not one or two big things, but a constellation of little things that add up.So what’s the secret? Why do people in these places, despite their striking cultural differences, share the likelihood of sailing into their 90s and beyond, often eluding heart disease and even cancer?We spoke with Dan Buettner, the author, educator and explorer who discovered the Blue Zones (and coined the term) to learn what makes these areas and their residents so special, and how we can bring some Blue Zone magic into our own lives.Your average menu in Okinawa may not have feature the same dishes as that from an eatery in a Sardinian village, but you will discover parallels among core ingredients — just as you will in any of the other Blue Zones.“In all five places, the common denominators include mostly a plant-based diet,” Buettner tells NBC News Better. “There’s five pillars to every Blue Zone diet: whole grains, greens, tuberous (sweet potatoes or potatoes), nuts and beans. The most important one is beans. A cup of beans a day could add two to three years to your life.”As for what type of bean to consume, you really can’t go wrong with any, but for your own palette (and to get a full variety of nutrients) you should mix up the types of beans you consume, and though canned beans are okay, Buettner recommends using dried beans when possible, if only “to not toss another can into the world.”Beef and cow dairy are “not significant” in these Blue Zone diets, Buettner notes, though you’ll find some sheep and goat’s milk. Additionally, “no more than three eggs are consumed per week.”As for beverages, Blue Zones are heavy on water and tea.“They’re drinking herbal tea all day long,” says Buettner. “In Okinawa it’s often green tea, while in Ikaria it’s usually a tea made with oregano, rosemary or mint. They drink no more than two glasses of wine a day.”The wine choices depend, but Buettner recommends a garnet red variety called Cannonau. “It’s filled with artery scrubbing antioxidants.”Coffee is also embraced in the morning, though it should be noted that in Loma Linda, California, the only American destination on this list, the Blue Zone effect is attributed to the predominance of Seventh Day Adventists who tend to abstain from caffeine, do not drink alcohol and lean heavily toward vegetarianism.Buettner stresses that the beauty of the Blue Zones is not one or two big things, but a “constellation of little things that add up.” Diet is just one part of the picture, while social activity, community and a strong sense of one’s purpose are other integral factors.The option to be lonely shaves eight years off life expectancy here [in the U.S], but that does not exist in Blue Zones.“People [in Blue Zones] aren't waking up in the morning rudderless. They're driven by life meaning and purpose,” Buettner says. “They’re investing in family, keeping their minds engaged and there’s no existential stress of being worthless in life like so many Americans. The option to be lonely shaves eight years off life expectancy here [in the U.S] but that does not exist in Blue Zones. You can't walk outside your front door in these regions without bumping into somebody you know, and this is all so much more powerful than we think.”Humans are extremely social creatures, and from a young age we learn the importance of teamwork and collaboration (for instance, Buettner says, young children who can’t lift a bucket of water on their own will understand that if they together they’ll succeed, whereas a young chimpanzee may not figure this out).“We're genetically hardwired to crave social interaction and when you don't have it, there’s a level of subconscious stress that grates away at you,” he adds.Three of the five Blue Zones (Okinawa, Ikaria and Sardinia) are located in very narrow, steep regions that didn’t always have access to industrial roads. This element of being tucked away in remote hilltop isolation not only “protected these zones from the corrosive effects of globalization,” Buettner says, it forces people to form tight social connections with one another, and to incorporate a lot of up and downhill walking into their daily routines.“Walking is one of the best forms of exercise and you can do it without thinking about it,” says Buettner, who encourages people to rely less on cars and more on public transportation so that they have to walk more. He also recommends bringing a dog into your life if you’re struggling to get outdoors much.“Adopting a dog is really the best Blue Zone strategies there is,” he says. “It’s that perfect nudge to get you walking everyday.”Ultimately, the secrets of the Blue Zone are not so secret after all. They each prioritize health and happiness in ways that we’re increasingly learning about and embracing.“We're all looking for magic dietary pills or serums or supplements, but you see none of that in the Blue Zones,” says Buettner. “It's mostly small things driven by the right environment. If America wants to get healthier, it will drop the freneticism with diets and disciplines and shift the focus to changing the environments of our cities, schools and workplaces.”We can also build Blue Zone values into our own lives. You can get started assessing where you are and what you might want to change by taking the True Vitality Test by Blue Zones. (I took the test and found it helpful and slightly worrying, such that I changed my dinner plans and decided: A. Not to eat alone and B. To opt for whole grains instead of French fries.)Suzanne Dixon, a registered dietitian, epidemiologist and medical writer shares her tips for a day of Blue Zone-style eating in the menu below:Dixon’s pro-tip: “If you want to really go for something fun and new, make your entree in this dinner as follows: Fresh tomato wedges topped with seared skinless/boneless sardines and drizzled with olive oil and sprinkled with sea salt.”And enjoy these meals in good company, if possible.“People eat to live, they don't live to eat,” Dixon says of the typical Blue Zone behavior towards food. “Each eating opportunity is a time for connection with others, being with family and a time for gratitude for all of the good things in their lives. They take the time to savor food, enjoy company and slow down for a bit.”Want more tips like these? NBC News BETTER is obsessed with finding easier, healthier and smarter ways to live. Sign up for our newsletter and follow us on Facebook, Twitter and Instagram.© 2018 NBC UNIVERSAL"}