{"id": "Facebook, Airbnb and eBay join Google in ending forced arbitration for sexual harassment claims", "paragraph": "Facebook, Airbnb and eBay have joined Google in changing a crucial policy that allowed them to handle sexual harassment and misconduct claims in private, a system that critics said provided a way for perpetrators and companies to avoid serious consequences.The policy, known as forced arbitration, keeps employee complaints from ending up in court. Google first changed its policy on Thursday in response to a widespread walkout by employees following a report from The New York Times that executives credibly accused of sexual misconduct left the company with tens of millions of dollars in exit packages and allowed a third to stay on before he later resigned.\"Today, we are announcing changes that reflect conversations we have had with employees and outside experts,” Airbnb said in a statement on Monday. “We are a company who believes that in the 21st Century it is important to continually consider and reconsider the best ways to support our employees and strengthen our workplace.”the answer to \"will worker organization at Google over transparency, ethics, diversity, inclusion, and sexual misconduct & harassment have a domino effect on the tech industry?\" is looking like a yes today https://t.co/zOatXSysElThe statement, which was first sent to BuzzFeed News, announced that the company will “not require our employees to use arbitration in cases involving discrimination in the workplace” as well as “sexual harassment.”Julianne Whitelaw, eBay's head of corporate communications, confirmed Monday that the company made a similar adjustment, scrapping private arbitration for sexual harassment claims in order to “better reflect and encourage eBay’s values of being open, honest and direct.”The Times report resulted in a swift backlash from employees who staged walkouts at the company’s global offices around the world. Among the demands posted by the event’s organizers was a call to end forced arbitration on cases of harassment and discrimination — a policy that CEO Sundar Pichai told employees Thursday would only partially change.“We will make arbitration optional for individual sexual harassment and sexual assault claims,” Pichai wrote in an email to Google employees.According to Pinchai, the tech giant may still recommend arbitration as the “best path for a number of reasons,” including personal privacy, but will leave the choice up to employees.Facebook issued a similar change the following day in an internal post to employees, saying that arbitration for sexual harassment and misconduct will now be optional.“Today, we are publishing our updated Workplace Relationships policy and amending our arbitration agreements to make arbitration a choice rather than a requirement in sexual harassment claims,” Anthony Harrison, Facebook's director of corporate media relations, said in a statement.Among the stipulations concerning relationships in the workplace is a rule requiring that executives such as company directors report any relationships with employees to human resources.“Sexual harassment is something that we take very seriously and there is no place for it at Facebook,” Harrison said.Other tech companies including Twitter have said they do not need to adjust their policies, which never included forced arbitration.Just to be clear, we don't force arbitration and never have. We support our employees.“Just to be clear, we don't force arbitration and never have,” the company announced through Twitter Monday evening after initially declining to comment on the matter. “We support our employees.”Didi Martinez writes for NBC News.© 2018 NBC UNIVERSAL"}