{"id": "Danielle Campoamor  The pipe bomb packages mailed to frequent Trump targets are acts of domestic terror. But is anyone surprised?", "paragraph": "On Tuesday, a pipe bomb was found in the mailbox of prominent Democrat George Soros. Less than 24 hours later, explosive devices apparently meant for former secretary of state and Democratic presidential nominee for Hillary Clinton, former President Barack Obama, former Attorney General Eric Holder, Rep. Maxine Waters and former CIA Director John Brennan were intercepted in New York and Washington, D.C. The CNN newsroom in New York City was evacuated after the package addressed to former Brennan was sent to the outlet’s mailroom. Several of the packages listed Rep. Debbie Wasserman Schultz, D-Fla., as the (fake) return address.The motive of the current person or persons engaging in this domestic terrorism remains unknown. The White House quickly condemned the attacks, with White House press secretary Sarah Sanders releasing a statement and Vice President Mike Pence also tweeting his disapproval: “We condemn the attacks against fmr Pres Obama, the Clintons, CNN, & others. These cowardly acts are despicable & have no place in this Country.” President Donald Trump tweeted that he “agreed wholeheartedly” with his vice president’s sentiments. Trump later elaborated on those comments briefly during a press conference, calling the attacks “despicable.”I agree wholeheartedly! https://t.co/ndzu0A30vUInvestigations will be ongoing, statements of condemnation will continue to be issued and hopefully the person or people behind these attacks will be apprehended and held accountable. But few Americans at this point can be that surprised by these horrifying events. We’re currently being led by a president who attacks George Soros, Hillary Clinton, Maxine Waters and Barack Obama consistently and with near total impunity, recklessly promoting conspiracy theories behind the safety of a Secret Service detail.Congresswoman Maxine Waters, an extraordinarily low IQ person, has become, together with Nancy Pelosi, the Face of the Democrat Party. She has just called for harm to supporters, of which there are many, of the Make America Great Again movement. Be careful what you wish for Max!We have heard and seen the president target CNN specifically and repeatedly, calling the media generally the “enemy of the people.” On Oct. 18, Trump stood in front of thousands of fans in Missouri and praised GOP politicians for physically assaulting reporters. We’ve seen Trump supporters proudly wear T-shirts with the words, “Rope. Tree. Journalist. Some assembly required.” The president of the United States even promised his fan base that he would pay their legal fees if they physically assault protestors.Trump has labeled Democrats an “angry mob,” and yet Sanders claims the president has “never promoted or encouraged violence.” At most, he is just a “passionate” guy who “fights fire with fire.” But this is not exactly true. Trump is happy to wrap his hyperbole in hate and align himself with groups who have been far more explicit in their desire to do whatever it takes to see their agenda fulfilled.The truth is, most bomb scares are not clearly tied back to a political group or even movement. One of the bigger exceptions are extreme anti-abortion activists, who over the years have harassed patients and providers outside of clinics, bombed health centers, committed acts of arson and even murdered abortion providers outside their homes and in churches.Trump has never told anti-abortion groups that they should hurt abortion providers. But these groups are reading between the lines just the same, and what they see there matters. Look, for example, at how violent alt-right and white supremacist groups were emboldened by Trump’s statements following the deadly Unite the Right rally in Charlottesville. When the president calls himself a nationalist, white nationalists feel like they have more license to spread their own, ever more extreme brand of hate.Trump has never told anti-abortion groups that they should hurt abortion providers. But these groups are reading between the lines just the same.Hatred, and a “do whatever it takes” policy, has been a part of the modern anti-abortion movement for years. In 2015, a man walked into a Planned Parenthood in Colorado Springs and murdered three people. The shooter said he attacked the clinic because he was “upset with them performing abortions and the selling of baby parts.” And since Trump took office, anti-abortion harassment has been on the rise, according to a study from the National Abortion of Federation, a pro-abortion rights group and professional association of abortion providers. In 2017 alone, abortion providers reported 62 death threats, 287 instances of hate mail and harassing calls and over 1,700 instances of trespassing and obstruction. In April of 2017, an office building in Virginia that houses an abortion provider was evacuated twice when fireworks exploded inside an elevator and a bomb threat was found.And yet many on the right have continued to accept money from anti-abortion groups, groups who regurgitate the same rhetoric that can fuel extremists. Between 2017 and 2018 Voter Education Pac, Protect Our Future, National Pro-Life Alliance, Right To Life, and Susan B. Anthony List — organizations that seek to end abortion access in the United States — have spent hundreds of thousands of dollars helping conservative groups and Republicans.In an op-ed for USA Today, Doug Pagitt, the executive director of Vote Common Good and an evangelical pastor, called out religious leaders for abandoning their moral fiber in the name of political power. “These conservative leaders are willing, at all costs, to make a moral trade — anti-abortion laws and court decisions in exchange for basic human dignity.” Clearly, the president and the GOP politicians who empower him are willing to do the same.Two things are technically true: The White House has condemned the today’s alleged attacks, and the people targeted are the same people singled out by the White House as political and cultural enemies of Americans. But which message are the people who scream “lock her up” at MAGA rallies really going to absorb? Especially when conservatives are already floating the conspiracy theory that liberals sent the bombs to garner sympathy for Democrats before the midterms.Oh what a hill to die on. pic.twitter.com/e7sgsymFgZProminent Republican politicians may call for “civility” after their restaurant meals are interrupted, but until they disassociate themselves with groups who engage in far worse, such false equivalency does little to blunt the rhetoric of the president and his surrogates over the past three years.So the president can claim he’s “extremely angry, upset, unhappy, about what we witnessed this morning,” but condemnation after the fact is not always enough. One cannot stoke racial and ideological divides and then be appalled when those who listen to you take action — whether you ever thought they would or not. The damage is done.Danielle Campoamor is a senior editor at Romper and author of Bustle's Abortion AMA column. She's been published in Teen Vogue, Harper's Bazaar, CNN Opinion, Playboy, Newsweek, BuzzFeed, and Marie Claire, among others. © 2018 NBC UNIVERSAL"}