{"id": "Girl dies after court battle to keep her on life support", "paragraph": "A 9-year-old Texas girl who was the subject of a court battle to keep her breathing died Friday night after her heart stopped, an attorney for the child's family said in Twitter.\"According to Payton's parents, her heart stopped beating on its own, \" said her family's attorney Justin Moore. \"She wasn't removed from life support.\"Winifred King, a spokesman for Cook Children's Medical Center in Fort Worth, Texas, where Payton Summons was being kept alive, expressed condolences but said details of Summons' passing would not be immediately forthcoming.\"At Cook Children’s, we mourn the loss of any young life and we understand that this has been a difficult and heartbreaking time for this family,\" he said. \"Out of respect for Payton and her parents we feel it inappropriate to comment at this time.\"The girl was considered brain dead under Texas law, according to a statement released earlier this month by the hospital.\"A person is considered dead when they have suffered an irreversible loss of all brain function,\" hospital officials said in explaining why they moved to pull her off like support.But Payton's parents, citing religious objections, launched a legal challenge. On Friday afternoon, Texas' Second Court of Appeals allowed them to keep the girl on life support through Monday, according to NBC News affiliate KXAS in Dallas-Fort Worth.It was a short-lived victory.\"Known by everyone as full of determination and fight she fought until her heart gave out,\" Moore tweeted. \"After scoring a big win in the Appeals court today, she left us just a few hours later She showed us how to fight against the odds.\"Payton had an undetected cancerous growth called a Wilms tumor that caused her to go into cardiac arrest Sept. 25, according to Cook Children's Medical Center. A hospital attorney told KXAS the growth was crushing the girl's heart and lungs.Doctors at the hospital were able to revive her heartbeat, hospital officials said.But her breathing was recharged only with the aid of a ventilator, Cook Children's officials said, leading them to declare her dead and warn her parents that Payton would be taken off life support.© 2018 NBC UNIVERSAL"}