{"id": "Gillum officially concedes Florida governor race, congratulates DeSantis on winning", "paragraph": "WEST PALM BEACH, Fla. — Democrat Andrew Gillum conceded the Florida governor's race to Republican Ron DeSantis Saturday, offering his congratulations in a message streamed on Facebook.\"We wanted to make sure that every single vote ... as long as it was a legally cast vote, we wanted those votes to be counted,\" Gillum said. Meanwhile, counties across the state worked toward a Sunday noon deadline to hand count certain ballots in other races. \"And now that we are rounding that process out R. Jai and I wanted to take a moment to congratulate Mr. DeSantis on becoming the governor of the great state of Florida.”DeSantis' victory isn't a surprise, but it is very good news for President Donald Trump, whose party — and a close ally — will control the state government apparatus for the 2020 election. Florida, which has favored the winning candidate in each of the last six presidential elections, has a long history of razor-thin margins. In 2000, the contest was decided by 537 votes after a recount, and no presidential candidate has won with more than 52.1 percent of the vote here since 1988.DeSantis responded to a congratulatory tweet from Gillum without mentioning his opponent. \"This was a hard-fought campaign,\" DeSantis wrote in a subtweet. \"Now it's time to bring Florida together.\"I want to congratulate @RonDeSantisFL on becoming the next Governor of the great state of Florida. My wife R. Jai and I could not be prouder of the way we ran this race. We could not be more thankful to my running mate, @ChrisKingFL and his wife Kristen.Gillum, the mayor of Tallahassee, trailed DeSantis by roughly .41 percent, or a little less than 34,000 votes out of more than 8 million cast after a machine recount conducted earlier this week. That effectively sealed the result of his contest because Gillum would have needed to finish within .25 percent of DeSantis to force a hand recount in their race.Gillum, who would have been Florida's first black governor, originally conceded on Election Day, when it appeared that his deficit would be too large to overcome. But as more votes were tallied, DeSantis' lead was cut to less than .5 percent — the difference required by Florida law to trigger a machine recount.After he fell within that threshold, Gillum essentially withdrew his concession as he called on Florida to count all the votes before he would make any further announcement.NBC News had already rated DeSantis as the apparent winner of the race.Democratic Sen. Bill Nelson, who was locked in a tight battle for his seat with Republican Gov. Rick Scott, trailed by about .15 percent after the machine recount. His last hope to reverse the outcome appeared to be dashed Friday when it was revealed that \"under-votes\" in Broward County — ballots on which electronic readers did not show votes in the Senate race — were not the result of machine error.Republicans such as Scott and Trump have insisted Democrats are trying to \"steal\" the election, with each suggesting that rampant voter fraud could be taking place in key Democratic-leaning Broward and Palm Beach Counties.No evidence of such fraud has been brought forth. State election officials said they have not seen any evidence of fraud.Congratulations to Andrew Gillum on having run a really tough and competitive race for Governor of the Great State of Florida. He will be a strong Democrat warrior long into the future - a force to reckon with!While he had tweeted earlier in the week that the election should be immediately called in favor of Scott and DeSantis, Trump wrote on Saturday morning to congratulate Gillum on \"having run a really tough and competitive race.\" Jonathan Allen reported from Florida. Allan Smith reported from New York. Jonathan Allen is a Washington-based national political reporter for NBC News who focuses on the presidency.Allan Smith is a political reporter for NBC News.© 2018 NBC UNIVERSAL"}