{"id": "Trump visits site of Pittsburgh synagogue massacre", "paragraph": "PITTSBURGH — President Donald Trump visited the Tree of Life synagogue, site of a mass shooting that killed 11 people Saturday, amid protests of his presence here Tuesday.The president, who was accompanied by daughter Ivanka and son-in-law Jared Kushner — both of whom are Jewish — and his wife, Melania, spent about 13 minutes inside the synagogue.While he was there, the president laid stones and white flowers at memorials for each of the 11 victims.He did not make public remarks before departing in a motorcade.His visit was controversial in the Squirrel Hill neighborhood, the Jewish community here, among city leaders and in the political world. Trump has denounced the \"scourge of anti-Semitism\" that drove the shootings, but his critics have said that his highly charged rhetoric has contributed to toxicity in American politics.Outside the synagogue, peaceful protesters yelled at Trump.\"It's not about you,\" \"go back, we don't want you here,\" and \"we reject your hatred,\" were among the phrases they called out as the president was in earshot.Adam Marenoff, 55, who moved to the Squirrel Hill neighborhood from Tel Aviv, Israel, 20 years ago out of concern for the safety of his family, had just returned from the funeral for Jerry Rabinowitz, one of the worshipers killed in the shooting rampage, when he was told to move from his spot mourning outside the synagogue to make way for Trump's arrival.\"Trump coming feels inappropriate to me. It’s just, why? I’m standing there thinking about a guy I just went to a funeral for, Jerry,\" Marenoff, an artist, said. \"He was my doctor. He’s dead. I’m standing there looking at a star with his name on it and they’re moving me because the president is coming. That doesn’t make me feel so great.\"Several local Jewish leaders wrote a letter asking Trump not to come unless and until he issued a full condemnation of white nationalism, Pittsburgh's mayor, Democrat Bill Peduto, said on CNN that Trump was not welcome during the week of the funerals, and Republican and Democratic congressional leaders declined Trump's invitation to join him on the trip.\"The horrific tragedy in Pittsburgh is not a political event and out of respect, the President extended a bipartisan invitation to Congressional Leadership to travel with him to Pennsylvania,\" White House press secretary Sarah Sanders said in a statement. \"Understandably, the members had prior commitments or wanted to show their respect in a private way.”Most of the protesters who spoke to NBC said they were surprised that the president ignored appeals to remain in Washington.Amy Schwartz, a 26-year-old social worker who attends another synagogue, said it was disrespectful of Trump to come when many city and Jewish community leaders had asked him to stay away from the area in the wake of the slayings.\"Pittsburgh has made one request of our president, and he wasn't able to comply with that request,\" she said. \"It's one thing to not know where my community stands but I know where my community stands, and it's really disheartening that he's here.\"But Miriam Wess, 54, who mourned at a public memorial Tuesday, said that she appreciated the president's presence.\"I think it's important for Trump to be here to show solidarity,\" said Weiss, a 31-year resident of the neighborhood who has had trouble explaining the murders to her 12 children. \"I know a lot of people blame him, which is crazy. He didn't pull the trigger. I think it's nice. I think it's appropriate.\"As Trump's motorcade made its way through Pittsburgh to the synagogue, he was greeted with some symbols of protest, including one-finger salutes and thumbs-down signs.Blocks away from the synagogue, thousands of Pittsburgh residents filled the streets of Squirrel Hill, singing traditional Jewish songs. “Trump shouldn’t have come. We asked him not to,” said Taylor Wescott, 26. “The march is incredible though, there are thousands of people there.”After their stop at the synagogue, the Trump family departed for the University of Pittsburgh Medical Center, where the president and first lady were expected to meet with survivors of the shooting. Sanders said there is one police officer still in the intensive care unit and one other person still being treated at the hospital.Phil McCausland reported from Pittsburgh, Jonathan Allen from Washington.Phil McCausland is an NBC News reporter focused on the rural-urban divide.Jonathan Allen is a Washington-based national political reporter for NBC News who focuses on the presidency.© 2018 NBC UNIVERSAL"}