{"id": "Immunotherapy scores a first win against some breast cancers", "paragraph": "For the first time, one of the new immunotherapy drugs has shown promise against breast cancer in a large study that combined it with chemotherapy to treat an aggressive form of the disease. But the benefit for most women was small, raising questions about whether the treatment is worth its high cost and side effects.Results were discussed Saturday at a cancer conference in Munich and published by the New England Journal of Medicine.Drugs called checkpoint inhibitors have transformed treatment of many types of cancer by removing a chemical brake that keeps the immune system from killing tumor cells. Their discovery recently earned scientists a Nobel Prize. Until now, though, they haven't proved valuable against breast cancer.The new study tested one from Roche called Tecentriq plus chemo versus chemo alone in 902 women with advanced triple-negative breast cancer. About 15 percent of cases are this type — their growth is not fueled by the hormones estrogen or progesterone, or the gene that Herceptin targets, making them hard to treat.Women in the study who received Tecentriq plus chemo went two months longer on average without their cancer worsening compared with those on chemo alone — a modest benefit. The combo did not significantly improve survival in an early look before long-term follow-up is complete.Previous studies found that immunotherapies work best in patients with high levels of a protein that the drugs target, and the plan for the breast cancer study called for analyzing how women fared according to that factor if Tecentriq improved survival overall.The drug failed that test, but researchers still looked at protein-level results and saw encouraging signs. Women with high levels who received the combo treatment lived roughly 25 months on average versus about 15 months for women given chemo alone.That's a big difference, but it will take more time to see if there's a reliable way to predict benefit, said Dr. Jennifer Litton of the MD Anderson Cancer Center in Houston. She had no role in running the study but enrolled some patients in it, and oversees 14 others testing immunotherapies.\"We're really hopeful that we can identify a group of women who can get a much bigger and longer response,\" she said.Another breast cancer specialist with no role in the study, Dr. Michael Hassett at Dana-Farber Cancer Institute in Boston, said he felt \"cautious excitement\" that immunotherapy may prove helpful for certain breast cancer patients.Side effects need a close look, both doctors said. Nearly all study participants had typical chemo side effects such as nausea or low blood cell counts, but serious ones were more common with the combo treatment and twice as many women on it stopped treatment for that reason.Three of the six deaths from side effects in the combo group were blamed on the treatment itself; only one of three such deaths in the chemo group was.Cost is another concern. Tecentriq is $12,500 a month. The chemo in this study was Celgene's Abraxane, which costs about $3,000 per dose plus doctor fees for the IV treatments. Older chemo drugs cost less but require patients to use a steroid to prevent allergic reactions that might interfere with the immunotherapy. Abraxane was chosen because it avoids the need for a steroid, said one study leader, Dr. Sylvia Adams of NYU Langone Health.The study was sponsored by Roche and many study leaders consult or work for the company or own stock in it.© 2018 NBC UNIVERSAL"}