{"id": "Measles outbreak raging in Europe could be brought to U.S., doctors warn", "paragraph": "A raging measles outbreak in Europe may be a warning sign of what could occur in the U.S. if something doesn’t change soon, experts say.So far this year, there have been 41,000 cases in Europe and 40 deaths, according to the World Health Organization. The European experience may offer a window on how quickly things can go awry when parents choose not to vaccinate their children, doctors caution.Because measles is relatively rare in the U.S., many Americans have no idea of the disease's frightening impact and its stunning contagiousness.Many forget that measles isn’t just a childhood disease.Silvia Rosetti, who lives in Rome, still has nightmares about contracting measles when she was 32 weeks pregnant in 2017. When Rosetti, now 41, was a child, measles vaccines were not required and she didn't think about the risk of exposure when she first became pregnant. She was healthy and ecstatic at the thought of having her first child. But then she caught measles and the symptoms came on in a rush: fever, cough and congestion so bad she could barely breathe.“The situation got worse and worse so they decided to do a C-section,” Rosetti said. “I went into quarantine for five days. I couldn’t see my baby.” Her newborn son, Nathan, was also quarantined until doctors determined he was not infected. Rosetti developed pneumonia as a complication of her measles and was so weak she couldn’t stand up.\"And I had a rash even in my eyes, so I couldn't see anything,\" Rosetti told NBC News.Rosetti eventually recovered. Her baby, Nathan is now a year old and has gotten all his vaccinations.\"If you do the vaccination, you love yourself, you love your sons, and you love everybody,\" she said. \"You protect everybody. It's not just for myself or for my son.\"Rosetti is one of the more than 2,000 people in Italy who have been diagnosed with measles already this year.“We have a very serious situation,” said Dr. Alberto Villani, pediatric infectious disease doctor at Bambino Gesù Pediatric Hospital and the president of the Italian Pediatric Society. “People are dying from measles. This was unbelievable five or 10 years ago.”Even in England, which had been declared free of measles by the World Health Organization a year ago, cases are surging.The reason, experts say, is that in Europe, many parents have opted to skip vaccinating their children. “It’s the main factor leading to the outbreaks,” said Anca Paduraru of the European Commission in Brussels. “It’s unacceptable to have in the 21st century diseases that should have been and could have been eradicated.”At least 95 percent of the population must have received at least two doses of measles vaccine to prevent outbreaks, WHO said. Some parts of Europe are below 70 percent.The measles vaccine has been available in the U.S. since 1963, and is now commonly administered to children in tandem with the vaccines for mumps and rubella. The effectiveness of the vaccine led federal officials to declare measles eradicated in the U.S. back in 2000. Before the vaccine, there were 3 million to 4 million cases annually, according to the Centers for Disease Control and Prevention.“They don’t realize their child is at risk for measles meningitis, encephalitis and permanent brain damage.”But the success of vaccines has at least in part been their undoing.Many parents are unfamiliar with the havoc measles can wreak because there have been few cases in the U.S. since the vaccine became widely available, said Dr. Jeffrey D. Klausner, a professor of medicine and public health at the University of California, Los Angeles.“People don’t see them and so they forget about them or they think the diseases don’t exist anymore,” Klausner said. “They don’t realize their child is at risk for measles meningitis, encephalitis and permanent brain damage.”As in Europe, the number of children in the U.S. going unvaccinated has been increasing in certain parts of the country, said Dr. Albert W. Wu, an internist and professor of health policy and management at the Johns Hopkins Bloomberg School of Public Health.“This is a real setup for disaster since measles is insanely contagious,” Wu said. “This is an accident waiting to happen.”Why, when vaccines have been so successful at wiping out scourges like smallpox and polio, have parents become so skeptical of them?“What has been happening in Europe is now happening in the U.S. — on a smaller scale at this point,” said Dr. Peter Hotez, director of the Texas Children’s Hospital Center for Vaccine Development at Baylor College of Medicine and author of “Vaccines Did Not Cause Rachel's Autism: My Journey as a Vaccine Scientist, Pediatrician, and Autism Dad.”The problem is the plethora of misinformation online, Hotez said. “The anti-vaccine groups have made very strategic use of the internet and social media,” he added. “It’s estimated that there are more than 400 anti-vaccine websites now, and when you put ‘vaccine’ into a search engine, it’s almost inevitable you’re going to get an anti-vaccine website popping up.”And it’s not just the internet, Hotez said. “Now there are political action committees popping up in several states, including Texas,” he added.It’s not clear what exactly is driving the anti-vaccine movement, Hotez said. But “there’s an element of the anti-vaccine movement that is peddling alternative therapies and making money off of phony treatments,” he said. “And there’s an element that have tied themselves to different political groups. In Texas the major anti-vaccine lobby likes to use libertarian garbage terms like ‘medical freedom’ or ‘medical choice.’ ”The anti-vaxxers have had such a large impact that “now there is a terrific vulnerability in states like Texas and up in the Pacific Northwest,” Hotez said. “People forget that before kids were getting vaccinated we had between 400 and 700 deaths from measles annually in the U.S.”Right now, there is no public relations campaign to explain why vaccines are so important, Hotez said. “It’s left to a handful of academics who are willing, like me, to go out and tell their personal stories,” he said. “And we’re clearly outgunned.”Hotez said he wouldn’t be surprised to see a major measles outbreak in the U.S. this year.That might help people understand what’s at stake, Wu said, adding, “I’m afraid it will take a really big outbreak in the United States before we begin to see a reversal of this anti-vaccine sentiment.”Lauren Dunn is a producer on NBC News' Medical Unit in New York. She's a veteran of WRC-TV in Washington, D.C.Linda Carroll is a regular health contributor to NBC News. She is coauthor of \"The Concussion Crisis: Anatomy of a Silent Epidemic\" and \"Duel for the Crown: Affirmed, Alydar, and Racing's Greatest Rivalry.\" © 2018 NBC UNIVERSAL"}