{"id": "Roger Stone pal Jerome Corsi says Mueller is planning to indict him", "paragraph": "Jerome Corsi, an associate of Roger Stone, says he expects to be indicted for perjury as part of special counsel Robert Mueller's investigation of Russian election meddling.Corsi, who has been questioned over his knowledge of WikiLeaks obtaining hacked emails from Hillary Clinton's campaign chairman, said Mueller's team delivered the news at a meeting about a week ago.\"They told me they were going to indict me,\" he told NBC News in a phone interview Monday.\"This was one of the most confusing and frightening things I've experienced. I'm 72 years and I'm afraid they're going to lock me up and put me in solitary confinement.\"NBC News reported late last month that Mueller's office had obtained communications suggesting that Corsi was aware in advance that emails from former Clinton campaign chairman John Podesta had been stolen and handed to WikiLeaks.\"I don't recall ever meeting [WikiLeaks founder] Julian Assange or getting information from anyone about what he had including the Podesta emails,\" Corsi said Monday. \"But they have all your emails and phone records…They're very good at the perjury trap.\"Mueller's spokesman, Peter Carr, declined to comment.In a statement, Roger Stone told NBC News, \"My attorneys have fully reviewed all my written communications with Dr. Corsi. When those aren't viewed out of context they prove everything I have said under oath regarding my interaction with Dr. Corsi is true. It is possible to take individual communications out of context to create a false impression to a grand jury. Such a case would be weak and would fail.\"Added Stone, \"Dr. Corsi strikes me as a man who has been squeezed hard but refuses to do anything but tell the truth which is why they may be indicting him.\"Corsi is one of nearly a dozen Stone associates who have been summoned by Mueller to appear before his Washington, D.C,. grand jury, according to people familiar with the investigation.A conservative author and commentator, Corsi has denied having any advance knowledge or playing any role in the hacking and release of Podesta's emails in October.Corsi told NBC News that he \"figured out\" that Podesta’s emails would be released in October after reading the initial WikiLeaks dump of Democratic National Committee emails and finding few Podesta messages among them. He said he connected the dots and anticipated they would be published later by Wikileaks.Corsi said he's cooperated extensively with Mueller's team in grueling interview sessions.\"They seemed determined to find a connection with WikiLeaks and me,\" Corsi told NBC News.\"Forty hours, six prosecutors, plus an army of FBI. There were nine people sitting on the other side of the conference table. My mind was just mush,\" he added.Corsi is considered to be the founder of the so-called Birther movement focused on amplifying the false claim that Barack Obama was not a U.S. citizen. In 2017, Corsi became the Washington, D.C., bureau chief for InfoWars, a website run by Alex Jones, whose inflammatory lies about the 2014 Sandy Hook Elementary School shooting have gotten him banned from YouTube, Facebook and Twitter. Corsi no longer works there.Anna Schecter is a producer for the investigations unit of NBC News.© 2018 NBC UNIVERSAL"}