{"id": "New Music Round-Up: Robyn, Cardi B, BTS, Ellie Goulding & More!", "paragraph": "Plus we have new tunes from Calvin Harris, Normani, Lauren Jauregui, Becky G and others...October has arguably been the best month of 2018 for new music (so far, at least) and it's going out with a bang, as this week's new releases are simply phenomenal.A big week for both debuts and returns, many fans' agonising waits are finally over as Robyn releases her long-awaited album Honey (her first in 8 years!), Normani releases two solo collaborations with Calvin Harris and Lauren Jauregui makes her arrival with her first 'proper' solo single.Plus, Ellie Goulding kicks off a new era with a massive collaboration, BTS drop their first ever fully-English track and many, many more of our faves treat us to new tunes. Let's get into it...Ellie Goulding, Diplo & Swae Lee - ‘Close to Me’She's back! Ellie Goulding makes a surprising return with 'Close To Me', a trap-infused pop anthem born out of a collaboration with Diplo and Rae Sremmurd's Swae Lee. In the era of Post Malone and mumble rap, Goulding sounds right at home while remaining distinctively unique.Lauren Jauregui - ‘Expectations’Lauren Jauregui's solo collaborations tackled pop, R&B, EDM and hip-hop, however her debut single 'Expectations' defies all possible, er, expectations. The slinky guitar-led track leans into the soulfulness of her soaring voice, which takes centre stage to set a sexy - if agonising - mood that sounds equal parts Joss Stone and James Bond. Obsessed.Cardi B - 'Money'Firstly, no - it isn't 'Money Bag'. 'Money' is Cardi B's brand new single, another pounding ode to getting your bag and cutting your cheques. Second, it goes off just as much as you'd expect. The rap queen officially declares a healthy bank balance as more important than getting the D, so this might actually be an early New Year's Resolution for some.Steve Aoki - 'Waste It On Me (feat. BTS)'One year on from 'Mic Drop', BTS reunite with dance legend Steve Aoki for their first-ever English track 'Waste It On Me'. The radio-ready bop tugs on heartstrings as the boys make a desperate plea for their lover to give them just one more try, with the anthemic chorus and crashing synths perfect for stadium sing-alongs.Normani x Calvin Harris - 'Slow Down' / 'Checklist (feat. Wizkid)'Normani has arrived. After much teasing, the budding superstar's collaboration with Calvin Harris dropped this week and - surprise! - they actually gave us two songs. 'Slow Down' and 'Checklist' are both certified bops: dancehall-inspired, low-key sultry bangers that have you winding your waist, feeling sexy AF and lip syncing on the dancefloor like you are the star.Rudimental - 'Walk Alone (feat. Tom Walker)'Tom Walker links up with Rudimental for his first major collaboration and the result is this inspirational banger that'll perfectly soundtrack tipsy \"I love you\" convos with your mates in the pub this winter.P!nk - 'A Million Dreams'The Greatest Showman's all-star Reimagined covers album was announced last week and one of its most anticipated tracks arrives this week as P!nk takes on 'A Million Dreams'. To approximately no one's surprise, she completely nails it and takes it to a whole new plane of emotion with her incredible vocals.SG Lewis - 'A.A.T (feat. Drew Love)'Issssslit! SG Lewis steps away from under the disco lights for the brooding, Weeknd-esque 'A.A.T' with THEY.'s Drew Love.The Chainsmokers & Aazar - 'Siren'The Chainsmokers venture into dubstep territory on their massive Aazar collaboration 'Siren', which is a complete 180 from the calm, radio-ready of 'Closer'.Geko x Not3s - 'Will Smith'Not3s teams up with Geko for this flirtatious track that dreams up a relationship like Will & Jada because, duh, goals.Sabrina Carpenter - 'Paris'Sabrina. Did. That. Taken from her upcoming EP Singular: Act 1, 'Paris' is a thrilling electro-pop rush of romance.Becky G. x C. Tangana - 'Booty (feat. Alizzz)'Becky G gives Lady Gaga's 'Why Did You Do That To Me?' some major competition to be 2018's best song about butts.Olly Murs - 'Take Your Love'Plinky-plonky house piano keys, a soaring plea for love and a drop that actually drops to something? Come through with the bops, Olly!EHRIE - 'Half Bad'Meet EHRIE, the queer identical twins with butter-smooth vocals who can werk a house beat and do a sombre R&B moment to equally high standards.Robyn - HoneyJust short of Body Talk's eighth anniversary, Robyn returns from her extended hiatus fully refreshed, recharged and renewed. Honey - her eighth album - departs from the robotic electro-pop of the legendary Body Talk series to reveal a softer side to the Swedish pop icon. To suggest the crying-on-the-dancefloor pioneer is only now getting vulnerable would be wrong, although the raw subjects of the album are barely disguised through its smooth soundscape. Still fit for the dance floor, Honey is like healing therapy between old pals, and could be her best yet.RAY BLK - EmpressThree and a half years after she released her first EP, RAY BLK drops her debut studio album today and it is absolutely sublime. Laidback, feel-good, sharp and purposeful, with ultra-smooth production and storytelling that feels very needed in 2018, the singer makes one hell of a statement in a chic, effortles way. You need to check out 'Mama' - an early fave of ours - which is basically an ode to mums that lies somewhere between Spice Girls' 'Mama' and will.i.am's 'I Got It From My Mama' - the highest of comparisons, we swear.Tory Lanez - LoVE me NOw?That was quick! Tory Lanez drops his third album just seven months after Memories Don't Die, and it's another collaboration-heavy set that leans into the Autotuned arena of trap-pop and succeeds very well. 'Cut Me Off', with NAV, and the Bryson Tiller-assisted 'Keep In Touch' are the two absolute standouts hereNAO - SATURNNAO's second album arrives this week, and her sugary-sweet vocals find home across more gorgeous grooves. 'If You Ever', featuring 6LACK, is one of her finest recordings yet, and might be one of the best songs of 2018.MJ Cole - Foundations EPLegendary producer, the one and only, MJ Cole gifts us three brilliant new tracks with his Foundations EP, including the massive 'Phoenix'.Tom Odell - Jubilee RoadDescribed as \"the album i have been trying to make my entire career,\" Tom Odell finds his stride on the impressively lush Jubilee Road."}