{"id": "The Greatest Showman Reimagined: Watch P!nk & Daughter Willow Sage Hart’s ‘A Million Dreams’ Cover", "paragraph": "The first taste of the cover album of the hugely successful soundtrack just arrived and it’s the cutest thing in the world ever…Our hearts cannot handle what you’re about to hear. Earlier this month the incredible news dropped that a stellar cast of music artists will take on The Greatest Showman soundtrack is to be released and now the CUTEST collab of all time has just been released from it.P!nk and her daughter Willow Sage Hart’s version of ‘A Million Dreams’ and the Reprise just went live today along with this ADORABLE companion visual of both mother and daughter in the studio alongside direct Michael Gracey and songwriters Benj Hasek and Justin Paul.In the video P!nk thanks the songwriters for creating the worldwide smash hit movie and soundtrack.“I grew up listening to Annie,” she explains. “and no one has done this for me, for my heart since I was a little girl, and to have her finally have something like this…You made our favourite movie ever.”LOOK AT THAT FACE!The Greatest Showman Reimagined is released on 16th November and also features covers from Kelly Clarkson, Panic! At The Disco, Years & Years, Jess Glynne, James Arthur, Kesha and more.1. The Greatest Show – Panic! At The Disco\n2. A Million Dreams – P!nk\n3. A Million Dreams (Reprise) – Willow Sage Hart\n4. Come Alive – Years & Years and Jess Glynne\n5. The Other Side – MAX and Ty Dolla $ign\n6. Never Enough – Kelly Clarkson\n7. This Is Me (The Reimagined Remix) –Keala Settle, Kesha and Missy Elliott\n8. Rewrite The Stars – James Arthur and Anne-Marie\n9. Tightrope – Sara Bareilles\n10. From Now On – Zac Brown Band\n \nBONUS:11. The Greatest Show – Pentatonix\n12. Come Alive - Craig David\n13. This Is Me - Kesha\n14. Rewrite The Stars (Acoustic) – Zendaya\n"}