{"id": "Trump, in exclusive interview, suggests turning off Acosta's camera, reveals Obama's private guidance on greatest threat to the US", "paragraph": "\n      This material may not be published, broadcast, rewritten,\n      or redistributed. ©2018 FOX News Network, LLC. All rights reserved.\n      All market data delayed 20 minutes.\n    Part 1 of Chris Wallace's exclusive 'Fox News Sunday' interview with President Trump.President Trump, speaking exclusively to Fox News' Chris Wallace in a wide-ranging interview, revealed what President Obama told him was the biggest challenge facing the U.S., discussed potential high-level departures from his administration and admitted that he occasionally enjoys calling on CNN reporter Jim Acosta.\"Actually I like to do it, but in many cases I don’t,\" Trump acknowledged. In ruling that the administration temporarily has to restore Acosta's White House access pass on Fifth Amendment due process grounds, federal judge Timothy J. Kelly noted that Trump could simply choose to ignore Acosta. (The judge, in his preliminary decision, did not rule on CNN's First Amendment claim.)But Trump, speaking to Wallace, floated another idea for handling Acosta.\"I think one of the things we’ll do is maybe turn the camera off that faces them, because then they don’t have any air time, although I’ll probably be sued for that and maybe, you know, win or lose it, who knows,\" Trump mused. \"I mean, with this stuff you never know what’s going to happen.\"Calling Acosta \"unbelievably rude to [White House press secretary] Sarah Huckabee, who’s a wonderful woman,\" Trump said his administration is currently formulating \"rules and regulations\" for White House reporters. \"And if he misbehaves, we’ll throw him out or we’ll stop the news conference,\" the president added.\n      As President Donald Trump points to CNN's Jim Acosta, a White House aide takes the microphone from him during a news conference in the East Room of the White House, Wednesday, Nov. 7, 2018, in Washington. (AP Photo/Evan Vucci)\n      Trump also defended Acting Attorney General Matthew Whitaker against Democrats' calls that he should recuse himself because he has written critically of Special Counsel Robert Mueller's probe.\"I did not know that,\" Trump said, when asked if he was aware prior to appointing him that Whitaker had argued Mueller's authority and funding could justifiably be limited. \"I did not know he took views on the Mueller investigation as such.\"SEN. FLAKE VOWS TO BOYCOTT GOP JUDICIAL NOMINEES UNLESS MUELLER PROTECTION LEGISLATION GETS A VOTE -- BUT GOP RAISES CONSTITUTIONAL ISSUESTrump added that he \"would not get involved\" in Whitaker's decisions as he oversees Mueller's probe in his new role as head of the Justice Department. The DOJ's Office of Legal Counsel issued an opinion affirming the constitutionality of Whitaker's temporary appointment without Senate approval.\"Look he -- it’s going to be up to him,\" Trump said. I think he’s very well aware politically.  I think he’s astute politically.  He’s a very smart person.  A very respected person.  He’s going to do what’s right.  I really believe he’s going to do what’s right.\"\n      FILE -Then-Iowa Republican senatorial candidate and former U.S. Attorney Matt Whitaker watches before a live televised debate in Johnston, Iowa.\n      (Associated Press)The president added that he has personally responded to Mueller's written questions in the Russia probe and that they would be submitted \"very soon.\" Trump said his team is \"writing what I tell them to write\" in response to the inquiries.Turning to another one of his frequent critics -- former President Barack Obama -- Trump took something of a victory lap, following news that some of the top candidates Obama had backed in the midterm elections had come up short.FOX NEWS EXCLUSIVE: WHITAKER TELLS SEN. GRAHAM HE SEES NO NEED TO RECUSE HIMSELF\"I won against President Obama and Oprah Winfrey and Michelle Obama in a great state called Georgia for the governor,\" Trump said, referring to defeated Democratic candidate Stacey Abrams' top surrogates. \"And it was all stacked against Brian [Kemp], and I was the one that went for Brian, and Brian won.\" (Abrams acknowledged in a fiery speech this week that she would not win the race, but strongly suggested Republican Brian Kemp had prevailed because of voter suppression, and vowed a lawsuit.)\"Look at Florida,\" Trump continued. \"I went down to Florida. [GOP Senate candidate] Rick Scott won, and he won by a lot.  I don’t know what happened to all those votes that disappeared at the very end.  And if I didn’t put a spotlight on that election before it got down to the 12,500 votes, he would have lost that election, OK?  In my opinion he would have lost.  They would have taken that election away from him. Rick Scott won Florida.\"The results of a manual recount in the Florida Senate will be reported on Sunday, and Scott is expected to prevail over Democratic incumbent Sen. Bill Nelson, following a series of lawsuits and snafus that exposed long-running issues with ballot counting in the state. In the gubernatorial race, Democrat Andrew Gillum conceded this weekend in his close fight with Republican Ron DeSantis.\n      Michelle Obama, right, is greeted by Oprah Winfrey to discusses her new book during an intimate conversation to promote \"Becoming\" at the United Center on Tuesday, Nov. 13, 2018, in Chicago. (Photo by Rob Grabowski/Invision/AP)\n      FLORIDA ELECTION BOSS SAYS RACISM MAY BE REASON SHE'S CRITICIZED FOR INCOMPETENCE, POTENTIAL FRAUDBut Trump also revealed that Obama, who also campaigned against Trump in several other states, had offered him some important guidance in the White House shortly after his 2016 election.\"I think North Korea’s been very tough because you know we were very close. When I took that over -- President Obama right in those two chairs, we sat and talked and he said that’s by far the biggest problem that this country has,\" Trump told Wallace.  And I think we had real decision as to which way to go on North Korea and certainly at least so far I’m very happy with the way we went.\"Addressing national security matters, Trump told Wallace that he has been briefed on the audio recording of journalist Jamal Khashoggi's apparent murder in Turkey, but said he hasn't listened to it, calling it a \"suffering tape\" that he was advised not to hear.\"You saw we put on very heavy sanctions, massive sanctions on a large group of people from Saudi Arabia,\" Trump said. \"But at the same time we do have an ally and I want to stick with an ally that in many ways has been very good.\" He also said it \"takes two to tango\" to resolve the conflict in Yemen, where Iranian-backed insurgents are facing off in a proxy war against Saudi-backed forces, noting that \"I want Saudi to stop, but I want Iran to stop also.\"Trump went on to defend his administration's decision to pull hundreds of millions of dollars in military aid to Pakistan, saying the country doesn't do \"a damn thing for us\" and charging that its government helped terror leader Osama bin Laden hide there.\"They don’t do a damn thing for us.\"\"You know, living – think of this – living in Pakistan, beautifully in Pakistan in what I guess they considered a nice mansion, I don’t know, I’ve seen nicer,\" Trump said, referring to bin Laden and his former compound in Abbottabad, Pakistan. The compound was demolished shortly after United States Naval Special Warfare Development Group forces, in a daring late-night helicopter raid, killed bin Laden there in 2011.\"But living in Pakistan right next to the military academy, everybody in Pakistan knew he was there,\" he added.  \"And we give Pakistan $1.3 billion a year . ... [bin Laden] lived in Pakistan, we’re supporting Pakistan, we’re giving them $1.3 billion a year --which we don’t give them anymore, by the way, I ended it because they don’t do anything for us, they don’t do a damn thing for us.\"And Trump sounded a note of regret for not visiting Arlington National Cemetary in Washington, D.C., on Veterans Day -- which Obama did every year while he was in office.\"I should have done that,\" Trump said. \"I was extremely busy on calls for the country, we did a lot of calling, as you know. ...  I probably, you know, in retrospect I should have and I did last year and I will virtually every year.  But we had come in very late at night and I had just left, literally, the American cemetery in Paris and I really probably assumed that was fine and I was extremely busy because of affairs of state doing other things.\"'EMERGENCY' NYC PROTEST AGAINST SESSIONS PROTEST HEADS THROUGH D.C. -- HIGH ON ENERGY, IRONYTrump, who spent nearly an hour Thursday at the Marine Barracks in Washington, D.C. -- where tables were lined with miniature pumpkin pies ahead of Thanksgiving -- said he has some plans to potentially visit U.S. troops stationed in Iraq and Afghanistan for the first time.\"Well, I think you will see that happen,\" the president said, after Wallace noted that Obama and former President George W. Bush had each visited soldiers in war zones. \"There are things that are being planned.  We don’t want to talk about it because of -- obviously because of security reasons and everything else.\"Explaining why he canceled a trip to visit a World War I memorial ceremony in Paris, Trump cited the weather and sharply criticized the media for making a \"big deal\" out of the situation. The president noted he attended an event the next day in the rain at a cemetary just outside Paris on Armistice Day.\"They said, 'Sir,' the Secret Service said, 'Sir, you cannot go. We are not prepared. You cannot go,'\" Trump said. \"Because it was supposed to be helicopter, but the helicopter couldn’t fly because of zero visibility.\"\n      Two Central American migrants walk along the top of the border structure separating Mexico and the United States Wednesday, Nov. 14, 2018, in Tijuana, Mexico. Migrants in a caravan of Central Americans scrambled to reach the U.S. border, catching rides on buses and trucks for hundreds of miles in the last leg of their journey Wednesday as the first sizable groups began arriving in the border city of Tijuana. (AP Photo/Gregory Bull)\n      Calling media reports that he is bitter and resentful following the midterm elections nothing more than \"disgusting fake news,\" Trump next addressed some potential high-level departures from his administration.On Department of Homeland Security head Kirstjen Nielsen, Trump suggested he wants to see an improvement on border security. The first members of a large Central American migrant caravan arrived in the Mexican city of Tijuana last week and were photographed attempting to climb a border fence there.\"Well, I like her a lot. I respect her a lot,\" Trump said, referring to Nielsen. \"She’s very smart.  I want her to get much tougher and we’ll see what happens there. But I want to be extremely tough. ...  I like her very much, I respect her very much, I’d like her to be much tougher on the border -- much tougher, period.\"He added there's a \"chance\" that Nielsen, who was accosted in a restaurant this summer by far-left progressive activists as her security detail kept close watch, will continue in her role.\n      A Catholic nun gives travel advice to Central American migrants riding in the bed of a semi-trailer, as they move toward the U.S. border, in Ixtlán del Rio, Nayarit, Mexico, Tuesday, Nov. 13, 2018. The U.S. government said it was starting work Tuesday to \"harden\" the border crossing from Tijuana, Mexico, to prepare for the arrival of a migrant caravan leapfrogging its way across western Mexico. (AP Photo/Marco Ugarte)\n      On Chief of Staff John Kelly, Trump said he will \"move on\" at some point.\"There are certain things I love what he does,\" the president said. \"And there are certain things that I don’t like that he does -- that aren’t his strength. It’s not that he doesn’t do -- you know he works so hard. He’s doing an excellent job in many ways. There are a couple of things where it’s just not his strength. It’s not his fault, it’s not his strength. ... But John, at some point, is going to want to move on. John will move on.\"\n      White House Chief of Staff John Kelly takes questions from the media while addressing the daily briefing at the White House in Washington, U.S., October 12, 2017. REUTERS/Kevin Lamarque - HP1EDAC1F1Q8V\n      (REUTERS)And on Deputy National Security Adviser Mira Ricardel, whom the White House announced would depart her role this week, Trump offered a blunt assessment.\"I met with Mira two days ago, and we’re going to move her around,\" Trump said. \"She was with me for a long time, although I don’t know her.  She’s really somebody I don’t know very well.  But we’re going to move her around because she’s got certain talents. But, frankly, she is not -- she’ll never be put in the United Nations, let me put it that way. ... She’s not too diplomatic, but she’s talented.\"Taking stock of the administration's progress after two years, amid some past and apparently pending roster changes, Trump gave himself high marks -- literally.\"I think I’m doing a great job.  We have the best economy we’ve ever had,\" the president said. \"We’re doing really well. We would have been at war with North Korea if, let’s say, that administration continued forward.\"Trump continued: \"I would give myself, I would – look, I hate to do it, but I will do it, I would give myself an A+, is that enough? Can I go higher than that?\"This material may not be published, broadcast, rewritten, or redistributed. ©2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes."}
