{"id": "A ‘stress test’ for the next campaign: Florida recount sets the rules of engagement for the 2020 race", "paragraph": "  Two days after Election Day, Rep. Matt Gaetz (R-Fla.) got a call from President Trump’s reelection campaign manager: Get to Broward County, Florida’s Democratic stronghold, where officials were still tallying ballots in a tight U.S. Senate race. Around the same time, Marc Elias, a top Democratic Party lawyer who was general counsel to Hillary Clinton’s 2016 campaign, was preparing to fly to Florida to lead a likely recount in that contest.Over the next eight days, armies of lawyers and party operatives swarmed the state as elections officials undertook a laborious recount of the Senate vote and two other statewide elections, racing into courtrooms and onto the airwaves and social media to jockey over every ballot. In the end, the exhausting fight did little to change Republican Gov. Rick Scott’s lead over Democratic incumbent Bill Nelson, who now appears to face insurmountable odds. But there was much more at stake in the nation’s biggest presidential swing state: the rules of engagement for 2020. Amid the raucous street protests and updates from sleep-deprived election workers, influential figures in both parties inserted themselves into the drama — testing legal strategies to influence the makeup of the electorate and political arguments to win public opinion. Florida’s sprawling and diverse landscape of largely Democratic big cities, politically independent suburbs and conservative rural swaths make it a key battleground for debates over voting rights and ballot access expected to shape the next campaign. [Nelson’s chance at win in Florida Senate race dwindles as key counties complete hand recount]“The recount was a stress test of the Florida electoral system,” said Gaetz, who had just left Broward County when the call came from Brad Parscale to drive the 300 miles back. “If you were the Trump 2020 campaign, wouldn’t you have concerns right now about what the terrain here will look like?’’ Charles Lichtman, a Democratic attorney who worked on Florida’s infamous 2000 recount and represented Nelson and the Florida Democratic Party this year, called last week’s recount “the warm-up.” “Starting tomorrow, 2020 will be the most important election in our lifetime,” he said.As they slogged through the vote counts, party operatives and lawyers wielded the tactics they are honing for the next contest.For Democrats, who typically perform better in high-turnout elections, that meant pushing to count as many votes as possible and accusing Republicans of trying to suppress the vote. For Republicans, the goal was to limit the number of eligible votes and claim Democrats were trying to steal the election. The tone was set by Trump, who fired a series of tweets after Election Day exhorting the GOP to “expose the FRAUD!” and asserting without evidence that Democrats were rigging the election. In a news conference from the governor’s mansion in Tallahassee, Scott accused Democrats of “rampant fraud.” Sen. Marco Rubio (R-Fla.) invoked the Bible to make the same case, tweeting: “What is crooked cannot be made straight, and you cannot count what is not there.” Democrats — including the party’s last presidential nominee — said the GOP was trying to disenfranchise eligible voters, especially people of color.“It’s unbelievable that any elected official wouldn’t call for a fair and accurate count of the votes,” said Clinton in a fundraising email for Nelson one week after the election.Potential 2020 Democratic contenders such as Sen. Kamala D. Harris of California and Sen. Cory Booker of New Jersey also weighed in, urging election officials to count every vote.Sen. Elizabeth Warren (D-Mass.) — who deployed a staffer to Florida in the homestretch of the race and gave $50,000 from her reelection campaign to Florida Democrats last month — sent out a fundraising appeal on Nelson’s behalf.On the ground in Broward County, street protesters also looked ahead to the next presidential contest. One day during the recount, a few dozen people rallied outside the elections office, many wearing black T-shirts touting “The New Florida Majority,” a group that aims to increase the voting clout among minorities and immigrants. There were no Nelson campaign T-shirts in sight. “Florida has a history of voter suppression and discrimination,” said Serena Perez, the group’s organizing director. “They’ve tried all tricks in the book before, after and during the election, yet we’re still on the verge of winning this state.”[Republicans fan unfounded worries about voter fraud in Florida and other close contests]Others who came to register their objections to Democrats also appeared to have little vested in the Senate race. David Rosenthal was among those protesting Broward County Elections Supervisor Brenda Snipes, who has been accused of mismanagement. “If I were going to be frank with you, I don’t give a flying fig about Rick Scott,” he said, wearing a Trump 2020 baseball hat. Separate dramas played out in courthouses across the state, where campaign lawyers parried judges’ rapid-fire questions in about a dozen dueling legal fights throughout the week. Republicans, Democrats and civil rights groups challenged mail-in ballots rejected for mismatched signatures and rules for inspecting ballots by hand, among other issues. Those cases — many of which will play out in the coming months — could shape whose votes will count and how they will be counted in 2020. “I didn’t come all the way to Florida on a week when I’ve had no sleep because my primary concern was what happens in this one election,” said Myrna Pérez, a voting-rights lawyer with New York University Law School’s Brennan Center for Justice. Pérez represented the League of Women Voters of Florida, which intervened in a lawsuit Scott filed seeking to toss Broward County ballots counted after Nov. 10, the deadline to finish the initial canvass. A judge ruled against Scott. “My hope is that a candidate will think twice before coming into a courtroom and asking a judge to stop counting ballots cast by eligible voters in a timely way because of a mistake by an election official,” Pérez said.The courtroom actions produced several immediate legal wins for the Republicans, who blocked efforts to allow more lenient standards for counting hard-to-read ballots, extend the recount deadline and count mail-in ballots that were postmarked — rather than received — by Election Day. In the ballot-reading suit, U.S. District Judge Mark Walker said that changing the rules in the middle of an election “at this point would likely create a bigger problem.”But in several of those cases, final rulings are still to come that could possibly force new laws for future elections.Democrats did score a significant win in the signature-matching case, which could lead to a change in Florida’s practices and challenges in other states. In that case, Walker ruled voters must have a chance to fix mail-in ballots with mismatched or missing signatures.Liberal groups are also banking on a new constitutional amendment passed in Florida this month that restores voting rights to an estimated 1.4 million Floridians with felony convictions who have completed their sentences. Those new voters could tilt elections in closely divided Florida, where the past two presidential and the past three gubernatorial contests — including this year’s race — have been decided by roughly one percentage point.Civil rights groups plan to push for similar measures ahead of 2020 in the three other states that impose lifetime voting bans on convicted felons.“We need an intense campaign stamping out voter suppression, and it needs to start the moment these last campaigns are over,” said Kristen Clarke, president of the Lawyers’ Committee for Civil Rights Under Law.Republicans said such efforts manipulate the voting rolls for political advantage.“Democrats have not found a way to win Florida in the last few election cycles so they decided to try to gut the state election laws,” said Brad Todd, a political adviser to Scott. “You have to win with the electorate you have.”[Does your vote count in Florida? It might depend on your signature.]But Republicans, citing the need for election security, have also sought to exert control over the voting rolls, with GOP-controlled statehouses in recent years passing voter ID laws and other restrictions that tend to sideline minorities and young people who lean Democratic.Both political parties have used Florida as a leading laboratory to test election strategies since the 2000 election, when just 537 votes separated Republican George W. Bush from Democrat Al Gore in the state — leading to more than a month of political and legal wrangling. After his 2010 election, Scott began using his gubernatorial powers to influence the shape of the electorate. He announced a purge of noncitizens from voting rolls that ultimately resulted in the removal of just 85 people out of an electorate of about 12 million, according to Polifact Florida. Within months of taking office, he rolled back rules making it easier to restore ex-felons’ voting rights.That policy was repudiated on Election Day, when 64 percent of Florida voters approved the constitutional amendment granting voting rights to felons who have completed their sentences. Scott and the presumed next governor of Florida, Ron DeSantis, opposed the measure that could face more hurdles in the GOP-controlled capital.A notice quietly appeared on a state website Thursday announcing a hold on all pending applications for voting-rights restoration and suggesting a need for “implementing legislation.” Civil rights advocates said they would sue if Republicans try to slow-walk the measure.Scott’s office said it would defer to the incoming administration and the legislature on implementing the amendment, scheduled to go into effect in January.During this year’s recount, even as Scott accused Nelson of voter fraud, he remained silent when the election supervisor in a conservative Panhandle county hit hard by Hurricane Michael accepted ballots by email, which state law does not allow.But Republicans sought to leverage other claims of voting irregularities.Scott’s campaign distributed an excerpt of a transcript of a canvassing board meeting in Palm Beach in which an attorney for the Nelson campaign objected when a ballot was not counted because the voter was a noncitizen. The attorney later said the comment was a joke made after long hours of reviewing ballots, according to PolitiFact Florida.Trump’s son Donald Trump Jr. misleadingly tweeted a 2012 Associated Press story headlined “Nearly 200,000 Florida Voters May Not Be Citizens” that was published when the state released the initial, unverified list of noncitizen voters.The state’s top election official, Secretary of State Ken Detzner, referred only one matter for criminal investigation: allegations that state Democrats sent incorrect instructions to mail-in voters in four counties. Democratic officials said they were investigating claims that someone altered the deadline listed on follow-up affidavit forms.But they said Republicans overhyped claims about fraud to discourage voter participation.In a fiery speech at a century-old church in Fort Lauderdale, Democrat Andrew Gillum, whose bid to be Florida’s first black governor fell short, accused Republicans of playing “mind tricks” to discourage voters from going to the polls.“You hear the governor of your state, the president of the United States, the junior senator of the state of Florida say that there is rampant voter fraud in the process and we need to stop the count — with no proof,” said Gillum, as the mostly black crowd of hundreds of people murmured their assent. “What do you think that does to the mind and the psyche of the person who decided to step out?” In Washington, the new Democratic majority in the House plans to counter what they call Republican attempts at voter suppression with legislation aimed at expanding voter participation and requiring voting machines to leave a paper trail for use in recounts.“It seems like we keep replaying this particular scene over and over again,” said Rep. John Sarbanes, the Maryland Democrat who is leading a government reform task force. “It seems like Florida is always at the center of this.” Lori Rozsa in Riviera Beach, Fla., and Sean Sullivan in Tallahassee contributed to this report. "}