{"id": "Portugal qualifies for finals, Italy earn positives in draw", "paragraph": "MILAN — No Cristiano Ronaldo, no problem.Portugal drew with Italy 0-0 on Saturday to pick up the point it needed to qualify for the UEFA Nations League finals and confirm it as host of the first Final Four in June.Ronaldo is taking a break from the national team and wasn’t present at San Siro, just as he wasn’t in Portugal’s first two Nations League matches — both of which they won.“There’s a lot of satisfaction at having reached the final phase,” Portugal coach Fernando Santos said.“It was a difficult match, much more than we thought it would be. When we had the ball it was difficult to build and that was merit to Italy and demerit to us. Italy had a great game.”Poland has already been assured of finishing last in Group A3 and will be relegated to League B, and Italy will finish second.All three expressed interest in staging the finals so the winners of the group were always assured of being host. Portugal proposed Porto’s Estadio do Dragao and the Estadio D. Afonso Henriques in Guimaraes as host venues in their bid dossier and they are expected to be ratified by UEFA at a meeting of its executive committee on Dec. 3, when the draw will also take place.Despite failing to qualify for the finals, there are positive signs for the Azzurri a year after Italian football’s darkest moment.Italy dominated and had the better of the chances in front of a packed crowd in Milan but ended with a sixth successive home draw. The Azzurri have also scored only twice in four matches in the competition — but only conceded as many.“I don’t think there’s so many problems up front, it’s a question of five centimeters here, 10 there,” Italy coach Roberto Mancini said.There was a lot of good interplay from the hosts with crisp, efficient passing in the best performance seen by an Italy side in a long time.It was a far cry from Italy’s last match at San Siro, when it drew with Sweden 0-0 last November and failed to qualify for the World Cup for the first time in six decades.“Little by little we’ll manage to sort out the attack, too,” Mancini said. “Having so much possession in their half is something very significant. We’re a step further ahead than we thought we’d be. We have to resolve this small problem (of scoring) but we will.”The fans are also starting to fall back in love with the Azzurri, with 73,000 spectators at San Siro.LEAGUE BSweden kept alive its hopes of promotion with a 1-0 victory at Turkey, which was relegated to League C.Andreas Granqvist netted the only goal with a second-half penalty after Okay Yokuslu brought down Marcus Berg.Sweden will be promoted on Tuesday if it beats Russia, which leads Group B2.LEAGUE CScotland will win Group C1 if it beats Israel on Tuesday following a 4-0 victory over 10-man Albania in Tirana.Ryan Fraser scored his first international goal shortly before Albania captain Mergim Mavraj was sent off.Steven Fletcher doubled Scotland’s tally from the penalty spot, and James Forrest netted a second-half double.Serbia beat Montenegro 2-1 despite Aleksandar Mitrovic missing a penalty and will win Group C4 if it beats Lithuania on Tuesday.Lithuania lost 3-0 at Romania, which will go up if it beats Montenegro and Serbia fails to win.LEAGUE DKosovo beat Malta 5-0 and Azerbaijan beat the Faroe Islands 2-0. The teams set up a winner-takes-all clash when they meet on Tuesday in Group D3, although a draw would be enough for Kosovo.The Nations League also offers a second chance to qualify for the European Championship in 2020. The 16 group winners in Leagues A, B, C and D — or the next best-placed teams who have not already qualified via the European qualifiers starting in March — will progress to the playoffs to compete for the last four qualifying places.___More AP soccer: https://apnews.com/tag/apf-Soccer and https://twitter.com/AP_SportsCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}