{"id": "‘Handmaid’s Tale: The Musical’ puts a millennial twist on dystopia", "paragraph": "Desktop notifications are on   | Turn off Get breaking news alerts from  The Washington Post Turn on desktop notifications?Early on in “Handmaid’s Tale: The Musical,” the story’s narrator swiftly moves to address the elephant in the theater.“Are they legally allowed to be doing this?” she asks. “The answer is: probably.”That fourth wall-breaking gag sets the stage for the thoroughly non-canonical satire to come. So does the fact that the narrator is a character named Rory Gilmore, an absurdist reference to “The Handmaid’s Tale” actress Alexis Bledel’s breakout role on “Gilmore Girls.”New York comedians Marcia Belsky and Melissa Stokoski co-created “Handmaid’s Tale: The Musical,” a parody of Margaret Atwood’s 1985 novel and the hit Hulu series adaptation. After a half-dozen performances spread out over the past year, the minimalist production is headed to D.C. for a pair of shows Saturday at the Kennedy Center as part of the annual Bentzen Ball comedy festival.Belsky inhabits the protagonist Offred (played by Elisabeth Moss in the Hulu show), while Stokoski takes on the Rory Gilmore character. The idea for the production took root a year ago, when the friends found themselves watching “The Handmaid’s Tale” and were so overwhelmed by the show’s bleakness that they could only cope by poking fun at it.“We started laughing about how everything has become a musical, basically — how they made ‘Spider-Man’ into a musical, ‘SpongeBob’ and all of this stuff — and how it would be funny if someone did ‘Handmaid’s Tale’ as a musical because it was so dark,” Belsky says. “We just started joking about that, and then it kind of came together.”[3 ways to laugh at the 2018 Bentzen Ball comedy festival]While the source material imagines a dystopian future in which fertile women are enslaved as child-rearing “handmaids,” this version centers around the decidedly less extreme story of millennials in 2028 Brooklyn whose lives are upended when they’re forced to — gasp — hand over their cellphones. In Atwood’s “The Handmaid’s Tale,” Offred is a mother brutally separated from her husband and daughter; here, she’s a cliched musical theater heroine who relocates to New York to fulfill her dream of becoming a barista.“I thought it would be funny to write a show where it doesn’t undermine the message of the seriousness of the handmaid story, but it also pokes fun at what the spoiled, entitled people of my generation might act like in those situations,” Belsky says.Belsky and Stokoski wrote the book and lyrics for “Handmaid’s Tale: The Musical” in two months before debuting the show this past January, with composer Fernanda Douglas putting together the musical arrangements. As far as the co-creators are concerned, the show is protected by fair-use law regarding parodies — though they’ve never heard from anyone associated with “The Handmaid’s Tale.”After the Bentzen Ball, “Handmaid’s Tale: The Musical” will be staged at least one more time, at next month’s New York Comedy Festival. The creative team also hopes to record a cast album with the ensemble, and an off-Broadway run isn’t off the table should investors emerge.As a politically timely parody — the complicit and sadistic Aunt Lydia is, for example, reimagined as Aunt Betsy DeVos — “Handmaid’s Tale: The Musical” has been updated with each iteration to reflect the news cycle. With the Kennedy Center performances taking place a month after Brett Kavanaugh’s Supreme Court confirmation hearings thrust the #MeToo movement further into the political spotlight, Belsky hopes this take on “The Handmaid’s Tale” can prove particularly therapeutic to a D.C. crowd.“Satire can just be so cathartic and relaxing when as soon as you step out that door and get on Twitter or whatever — especially in D.C. — s--- gets real again,” Belsky says. “I want it to be an escape.”Kennedy Center, 2700 F St. NW; Sat., 7:30 & 10 p.m., sold out."}