{"id": "PM Update: Clouds and showers build overnight. Heavy rain for Monday morning.", "paragraph": "It’s been a nearly perfect autumn day today, with lots of sunshine and crisp, but not too crisp, temperatures. Unfortunately, these pristine conditions won’t last. We’ve got a bout of heavy rain to deal with Monday morning and another round coming Tuesday. Thankfully, things will calm down by midweek.Listen to our daily D.C. forecasts: Apple Podcasts | Amazon Echo | More optionsThrough tonight: Nothing but sunshine to finish out the day, which as a reminder, now ends at 5:04 p.m. Clouds will quickly begin to move in just before midnight, leaving us with mostly cloudy skies for the overnight period. Showers will move in from the south after 3 a.m., with light rain overspreading the region just before sunrise. Low temperatures will range from the mid- to upper 40s, with low 50s downtown. Winds will be light out of the east at about 5 mph.View the current weather at The Washington Post.Tomorrow (Monday): Things will be very wet to start out the workweek. Widespread light to moderate rain will be draped across the region tomorrow morning, making for a tough commute. A few rumbles of thunder can’t be ruled out. The steady rain should shift east of our area by the early afternoon, but not before upward of an inch of rain has fallen. Mostly cloudy and cool for the remainder of the day, with highs in the low 50s. Mostly cloudy with a slight chance of scattered showers tomorrow night, with lows in the upper 40s to low 50s.See Brian Jackson’s forecast through next weekend. And if you haven’t already, join us on Facebook, and follow us on Twitter and Instagram. For related traffic news, check out Gridlock.Friday tornadoes: The National Weather Service confirmed that two EF-1 tornadoes touched down in Carroll County and Baltimore City and County in Maryland on Friday night. The tornado in Baltimore resulted in two fatalities after a wall caved in at one of Amazon.com’s distribution centers. These were the first tornado-related fatalities in Maryland since 2002.Both tornadoes came without any official warning, although there were signs of potential trouble by Friday afternoon. At the core of the issue was a drastic contrast in air masses, located on both sides of a potent cold front. Additionally, a wave of low pressure developed and strengthened rather quickly right along the front. All of those ingredients resulted in a few hours of extreme and localized instability.Compounding the problem was the presence of heavy rain and the lack of daylight. Deep pockets of heavy rain developed right along the front, which meant that both tornadoes were “rain wrapped,” making them somewhat invisible to radar detection as well as to the naked eye. We do have the capability to look through the rain and diagnose rotation with other products. However, these storms were moving fast with a tight and localized rotation signature, making them extremely hard to diagnose in real time.Want our 5 a.m. forecast delivered to your email inbox? Subscribe here."}