{"id": "The Leonid meteor shower peaks this week. Here’s how to see it.", "paragraph": "The Leonid meteor shower peaks Friday and Saturday, with clouds clearing in time to see several shooting stars in the hours before dawn.The Leonids have a history of producing amazing meteor storms. In 1966, the Leonid shower produced thousands of shooting stars an hour at the peak. But perhaps the most intense meteor shower in recorded history was the Leonids of 1833, when “the storm produced as many as 200,000 meteors per hour, startling some 19th-century observers into near-catatonic terror,” according to astronomers at Slooh.com.The meteor frequency of the 1833 Leonids “was estimated to be about half that of flakes of snow in an average snowstorm,” according to 19th-century British astronomer Agnes Mary Clerke.Despite their magical appearance from the ground, meteor showers are little more than cosmic trash. Comets orbit the sun the same way Earth does. When they get close to the sun, the dirty space snowballs warm up a little and leave dusty trails behind. Earth, of course, is always traveling around the sun, and sometimes we collide with these trails of comet debris. The specks strike our atmosphere, then burn up, and we get to enjoy a shooting star show.The Leonids’ icy parental comet, Tempel-Tuttle, is a periodic comet discovered independently by German astronomer Ernst Wilhelm Tempel and by American astronomer Horace P. Tuttle during the winter of 1865-1866. Tuttle, an astronomer from the U.S. Naval Observatory, made his discovery on Jan. 5, 1866, from the observatory — which was then located at Foggy Bottom. Tuttle died in 1923, and he is buried in Falls Church, near Seven Corners, in an unmarked grave.About every 33 years, Comet Tempel-Tuttle makes a close approach to Earth and usually brings impressive meteoric showers with it. It happened last in 1998, and gazers enjoyed hundreds of shooting stars during the time of the Leonids. The comet’s next close visit will be in 2031.This year’s shower won’t be a meteor torrent, but you’re much more likely to see a shooting star this week than an average night. The best chance you’ll have is late at night after the moon sets. We’re still a week away from a full moon, but the half-moon will be bright enough to wash out the sporadic meteors. If you can hold out until later in the night or in the dark hours before sunrise, you’ll be rewarded with roughly 10 to 15 meteors per hour, according to the American Meteor Society.In Washington, the best sky conditions will be Friday night into Saturday morning, when few clouds are expected after a week of cold, gray weather."}