{"id": "‘This would be a very good time to do a shutdown,’ Trump says", "paragraph": "President Trump suggested Saturday he was prepared to shut down the federal government next month if Congress fails to give him the money he wants to build a wall along the U.S. border with Mexico.“If I was ever going to do a shutdown over border security — when you look at the caravan, when you look at the mess, when you look at the people coming in,” the president said. “. . . This would be a very good time to do a shutdown.”The president has asked lawmakers for $5 billion for new wall construction in fiscal 2019, but Democrats oppose the project, and a bipartisan Senate compromise earlier this year included just $1.6 billion for it.During the 2016 campaign, Trump repeatedly promised voters that Mexico would pay for the roughly 2,000-mile barrier, which carries an estimated price tag of $20 billion. But since taking office, he has acknowledged that American taxpayers will have to put up the cash.Speaking to reporters before traveling to California to tour recent wildfire devastation, Trump predicted Democrats would stave off his shutdown threat by agreeing to wall funding.“I don’t think it’s going to be necessary because I think the Democrats will come to their senses. And if they don’t come to their senses, we will continue to win elections,” the president said, referring to the Republicans’ success in retaining their Senate majority this month.Funding for the Department of Homeland Security and several other agencies runs out Dec. 7, meaning a partial government shutdown will occur if a new spending bill is not finalized by then.[GOP leaders aim to avert shutdown over wall funding, but Trump makes no promises]Most federal departments, including the Pentagon, are funded through the current fiscal year, which ends September 30. But even a partial shutdown of other government activities next month would mean disrupted services as well as unpaid furloughs for thousands of federal workers amid the holiday shopping season.“I don’t think a majority of the American people are looking forward to a shutdown right before the holidays,” said Jim Manley, a former Democratic Senate leadership aide.The president’s willingness to shutter the government is not shared by Republican leaders on Capitol Hill. Senate Majority Leader Mitch McConnell (Ky.) said flatly last week, “No, we’re not going to do that,” when asked about prospects for a shutdown over wall funding.Trump’s advisers have warned him that he is unlikely to secure full wall funding, according to a person briefed on the confidential discussions. Republican leaders persuaded the president to avoid a showdown over the wall before the midterm elections, fearing that it would alienate swing voters.In a meeting with GOP leaders last week, the president was noncommittal about signing a spending bill that lacked full funding for his signature project, according to Senate Appropriations Chairman Richard C. Shelby (Ala.).The president did make frequent public comments during the midterm campaign about several migrant caravans making their way through Mexico to the U.S. southern border, warning without evidence of what he called “an invasion” by groups including criminals and Middle Eastern terrorists.Trump also deployed more than 5,900 active-duty soldiers to the border to provide logistical support for U.S. Customs and Border Protection agents who are tasked with processing migrants’ asylum claims.Democrats have criticized the deployment as a political stunt designed to impress voters before the midterms. To date, the troops — barred by the Posse Comitatus Act and Pentagon regulations from engaging in law enforcement activities on U.S. soil — have strung barbed wire along miles of the border.[Trump’s border deployment will face scrutiny from new Democrats with national security experience]Defense Secretary Jim Mattis said last week that he did not expect soldiers to come in direct contact with migrants.The Pentagon plans to recall the troops on Dec. 15 unless the president extends their “border support” mission. Erica Werner and Damian Paletta contributed to this report. "}