{"id": "Central Americans in caravan cross into Mexico", "paragraph": " CIUDAD HIDALGO, Mexico — Hundreds of Central American migrants arrived in southern Mexico late Friday and early Saturday, taking small rafts across the narrow river from Guatemala, continuing a journey toward the United States. President Trump seems to hope the migrant caravan will galvanize his base ahead of next month’s midterm elections. He played up the threat as he stumped for GOP candidates this past week. “These are some bad people coming through. These aren’t babies, these aren’t little angels coming into our country,” he said Friday at the White House.At a rally Saturday in Elko, Nev., Trump falsely suggested that the Democratic Party was behind the caravan, and he thanked Mexico for its assistance in deterring the migrants.But along the Mexico-Guatemala border, it was clear Saturday that stopping the caravan would require both resources and will that, so far, have been lacking.While hundreds of migrants waited at an official border crossing point, behind a fence erected by Mexican authorities, hundreds — or even thousands — more gave up on crossing legally. Instead, they swam or took small rafts to Mexico.Mexican authorities watched the migrants arrive, occasionally patting them down but allowing them to proceed to Ciudad Hidalgo’s central plaza, where the Central Americans held an informal assembly, cheering “Si, se puede,” each time more migrants arrived.“I didn’t think it would be this easy,” said Samuel Barela, 17, who crossed in a raft Friday night, about a week after leaving his hometown of Choluteca in southern Honduras. Like many of the migrants, he said he was in pursuit of work in the United States, and a lifeline from his impoverished city.The border between Mexico and Guatemala has long been famously porous. On most days, goods are traded by raft, while authorities from both countries stamp passports on the official bridge above. It has never been particularly hard for migrants to cross the border here, and the caravan’s arrival has made law enforcement even more difficult, despite Mexico’s recent deployment of additional federal police.“With so many people here now, there’s no way they can control them,” said Juan Carlos Arana, who works for one of the informal raft businesses.As the migrants amassed in the center of this small city in Chiapas state, they shared stories of the lives they were leaving behind. Some carried Honduran flags. For many, the decision to join the caravan had been made without much forethought. They left their homes without telling their families, without packing their bags, without informing their bosses that they wouldn’t be returning to work.“I chose the caravan in an instant,” said Eduardo Martinez, 25, also from Choluteca.“As soon as I heard about it on television, I decided right away,” said Nestor Rogelio Reyes, 34.Reyes said he was deported from the United States last year, after spending eight years in Columbus, Ohio. He left behind two American daughters and an American wife. “A white lady,” he said.He knew he would eventually try to return to the United States, and the caravan provided a rare opportunity: It would allow him to travel to the U.S. border without paying a coyote, or smuggler, and with a lesser risk of kidnapping or extortion.Like many other members of the caravan, Reyes had only a vague sense of what he would do once he arrived at the U.S. border. Some migrants said they planned to apply for asylum. Others suggested they might have to attempt to cross illegally.It remained unclear Saturday if and how Mexican authorities would allow the migrants to proceed north.And so the migrants here camped out in the plaza, some on the stage of a small open-air amphitheater. That’s where Marjorie Milla, 21, slept with her 5-year-old daughter, Stephanie.“Back home, the gangs kill whoever they want,” Milla said.She had told Stephanie that they were traveling to the United States, where it would be easier for her to study. The little girl, with a short brown ponytail, smiled wide imagining her life there.“I can play more,” she said.The Mexican government said in a statement that it had received “requests for refuge” from 640 migrants, including 104 minors. It said it was “privileging at all times the human right of any foreigner to receive protection from the Mexican state.”Mexican authorities said the age of the youngest migrant they had processed was 3 months.The country’s National Institute of Migration declined to comment on the apparent lack of enforcement along Mexico’s southern border. The agency had set up a small checkpoint north of the city, where officials checked some of the vehicles heading north, roughly 2,500 miles from the U.S. border.Read moreHunger, not violence, fuels Guatemalan migration surge, U.S. saysPompeo meets with Mexican officials as a migrant caravan inches northToday’s coverage from Post correspondents around the worldLike Washington Post World on Facebook and stay updated on foreign news"}