{"id": "House Democrats’ hope for wave election diminishes as Republicans rebound", "paragraph": "Democratic hopes for a wave election that would carry them to a significant House majority have been tempered in recent weeks amid a shifting political landscape and a torrent of hard-hitting attack ads from Republicans.Democrats remain favored to win, but GOP leaders believe they can minimize the number of seats they would lose — and, perhaps, find a path to preserving their advantage in the chamber.The tightening, with just over two weeks left, reflects how President Trump’s rising approval rating and the polarizing fight over Supreme Court Justice Brett M. Kavanaugh appear to be boosting the party’s candidates in a number of conservative and rural districts that have been considered up for grabs.But Democrats have retained their strength in key suburban areas, where polls show female voters furious with Trump are likely to help flip Republican-held seats.“The past few weeks haven’t really diminished Democrats’ chances of a takeover by that much, but they’ve increased the chances of a small Democratic majority,” said David Wasserman, House editor for the nonpartisan Cook Political Report. He estimated Democrats have a 70 to 75 percent chance of winning the House.At stake is the fate of the Trump presidency — whether Democrats will gain the power to investigate his administration and thwart his agenda, or if emboldened Republicans will fulfill the president’s vision for the nation, from building a border wall to repeal of the Obama-era health-care law.Together, both parties have reserved about $150 million worth of airtime for TV and radio commercials between Tuesday and the Nov. 6 midterm elections, according to data obtained by The Washington Post, with most of the money coming from Democrats. Many are expected to be attack ads.Underscoring the fast-changing political fortunes are the cold calculations by both parties in the final days.The GOP is redirecting $1 million from a suburban district in Colorado to Florida, bailing on incumbent Rep. Mike Coffman to try to hold an open seat in Miami. Democrat Donna Shalala, a former Health and Human Services secretary in the Clinton administration, is struggling to break away from Maria Elvira Salazar, a Cuban American and former television anchor, in a district Hillary Clinton won by nearly 20 points.Republicans have also pulled back in a Democratic-held open seat in Nevada that includes some of the suburbs of Las Vegas. Clinton won there, as well.Democrats, meanwhile, are cutting funds in a GOP-held district in Nebraska and a Democratic-held district in northern Minnesota, two places Trump won. The latter represents one of the GOP’s best chances to flip a seat from blue to red.In other Trump districts, such as GOP Rep. Fred Upton’s seat in southwest Michigan, Democrats have been adding money.To galvanize their voters, Republicans are airing attack ads that argue Democrats would target Trump and Kavanaugh, unleash mob rule and threaten cultural values.“Closing with a little fear,” said Scott Reed, senior political strategist at the U.S. Chamber of Commerce, describing the GOP approach. Reed predicted that Republicans would keep their losses to 20 House seats, just under the 23 Democrats need to return to power.Republicans are favored to hold their majority in the Senate, which stands at 51-49.Consider a National Republican Congressional Committee ad in an open House seat across the southern border of Minnesota. The commercial seeks to link Democratic candidate Dan Feehan to former San Francisco 49ers quarterback Colin Kaepernick and NFL players who kneel during the national anthem, billionaire Jewish investor and liberal donor George Soros and “left-wing mobs paid to riot in the streets.”“The left owns Feehan. He will never be for you,” the ad says of the Army veteran who did two tours of duty in Iraq and earned the Bronze Star for service.One of the biggest targets of attack ads tying her to liberal leaders and protesters is Democrat Amy McGrath, a former fighter pilot trying to unseat Republican Rep. Garland “Andy” Barr in a Kentucky district that stretches from Lexington, the state’s second-most populous city, to rural areas. Trump won there by 15 points in 2016 and campaigned for Barr this month. Polls show a tight race.McGrath said that while she understood the emotions during the Kavanaugh fight, some of the strident anti-Kavanaugh protests were “unhelpful.” She also expressed some frustration at Republicans associating her views with other Democrats who support her, but with whom she does not agree.“I just don’t think that that’s right or fair,” McGrath said.Stoking divisive culture wars could help the GOP hang onto battleground districts Trump won in 2016. But in many of the 25 districts the Republicans hold that Hillary Clinton carried, they face stiff head winds. In these heavily suburban areas, anger with Trump and the GOP is intense, particularly among women. Democrats are hammering Republicans over health care in an effort to expand their appeal across party lines.Republicans face other obstacles, including strong Democratic fundraising and enthusiasm, as well as struggling top-of-ticket GOP contenders in some Midwestern states that could hurt candidates down the ballot.In a newly drawn Pennsylvania district in the suburbs of Philadelphia, where Clinton won by two percentage points, Democrat Scott Wallace, a wealthy philanthropist, said the contentious Kavanaugh fight has improved his chances of ousting first-term GOP Rep. Brian Fitzpatrick.“On the independent and Democratic side, and of course moderate Republicans, there is a sense of anger about how Dr. Ford was treated,” said Wallace, referring to Christine Blasey Ford, who accused Kavanaugh of sexually assaulting her when both were teenagers; Kavanaugh denied the allegations. “My observation is that anger is a stronger motivator than gratitude. So, I think by Election Day, you will see the Kavanaugh effect will produce more energy on our side.”A recent New York Times Upshot/Siena College poll showed Wallace leading Fitzpatrick. The Republican held an edge in surveys earlier in the year.Health care has been a main focal point of Democratic ads, which cast Republicans who voted repeatedly to repeal the law as threats to protections for people with preexisting medical conditions. Democrats have also slammed Republicans who supported the sweeping tax bill, which hasn’t produced the political boost the GOP envisioned.“Consistently, the number one issue that I hear about from voters is health care,” said Rep. Katherine M. Clark (Mass.), recruitment vice chair for the Democratic Congressional Campaign Committee. Clark said she has been to six states in the last three weeks and Democratic energy is still higher than she’s ever seen in a midterm.Democrats worry about Hispanic voters in battleground House races. While Latinos tend to vote Democratic, concerns about whether campaigns have done enough to encourage strong turnout has weighed on party strategists and officials.Rep. Will Hurd (R-Tex.), a moderate on immigration whose district includes about 800 miles of the border and many Latino residents, has put himself in a better position than many other Republicans running in Clinton districts by distancing himself from Trump. “I feel confident that when the voters of TX-23 grade my paper on Election Day, I’ll get a passing grade,” he said in a statement to The Post.The generic congressional ballot, one measure often used in public polls, shows Democrats in position to capture the majority. Voters are asked whether they would vote for the Democrat or the Republican, without names.Among registered voters, Democratic candidates led 53 percent to 42 percent, a Washington Post-ABC News poll conducted this month showed. Election forecasters and analysts estimate that Democrats need a six- to eight-point advantage to win a majority.But the same poll showed Trump’s approval rating, another indicator, had risen five points, to 43 percent, after tying a record low in August. Rep. Tom Cole (R-Okla.) who chaired the House GOP campaign arm during a difficult 2008 election cycle for Republicans, said there is a different sentiment among Republican incumbents now.“They were resigned in ’08,” said Cole, who ventured the chances of holding the majority improved from one-in-three to one-in-two. “I think the mood is we have a real shot,”In a memo to donors, Corry Bliss, the head of the Congressional Leadership Fund, a super PAC with ties to Speaker Paul D. Ryan (R-Wis.), wrote that the map was moving in a good direction for Republicans, but Democrats had the financial advantage. He said his group had raised $10 million in two weeks, but that Democrats were outspending the GOP on TV in top races.Another worrisome factor for Republicans: their gubernatorial nominees in Illinois, Michigan and Kansas, who are trailing or in a tight race and therefore offering little in the way of coattails down ballot. Republicans are defending a dozen competitive or potentially competitive House seats in those states, according to the Cook Political Report. Emily Guskin and Scott Clement contributed to this report.  powerpostThank You!You are now subscribed to  Please enter a valid email address You might also like... See all newsletters"}