{"id": "A fast-rising journalist hits a speed bump with his latest scoop about Trump", "paragraph": "Jonathan Swan landed a big scoop about President Trump last week, another in a series of big scoops the young reporter has landed since Trump took office.The reaction? Brutal.Swan, who covers the White House for the online news site Axios, was first to report that Trump intended to propose terminating “birthright citizenship,” the constitutionally protected guarantee of citizenship for anyone born in the United States. Swan was so far ahead of the press pack on the story that even Trump expressed surprise that Swan knew about the proposal when Swan brought it up during a White House interview, which HBO will air on Sunday.Nice work . . . except for a few things online critics weren’t shy about pointing out.For one, Axios’s story and headline — “Exclusive: Trump to terminate birthright citizenship” — failed to note that Trump can’t just override the Constitution with the stroke of a pen (the story and headline were later amended to reflect this). For another, a clip of Swan’s encounter with Trump drew an angry backlash on social media for Swan’s failure to push back on Trump’s claim that other countries don’t have birthright citizenship (in fact, dozens do) or the notion that the proposal might just be a stunt by Trump to stir up anti-immigrant sentiment days before an election.“This is less a news story than it is a press release,” wrote one critic, beneath a headline calling Swan “a bootlicker.” “This is a news outlet willingly staging a press event for a racist administration.”The triumph-to-fiasco nature of Swan’s story marked a rare bit of turbulence for a reporter who has been on a sustained hot streak since Trump took office. Swan has broken story after story about Trump, drawing traffic and attention to Axios, a site founded just two years ago by  a team that started Politico in 2007 .Among his greatest hits: Swan was first to report that Trump intended to pull the United States out of the Paris climate accord; that Trump planned to move the U.S. Embassy in Israel to Jerusalem; that White House chief strategist Stephen K. Bannon would be fired; that House Speaker Paul D. Ryan (R-Wis.) wouldn’t seek reelection; that Trump would end President Barack Obama’s executive order protecting children brought to the United States by undocumented immigrants; that Anthony Scaramucci would be named White House communications director; and that Trump had accepted Nikki Haley’s resignation as U.S. ambassador to the United Nations.A few days after he broke the birthright citizenship story, Swan broke the news that Trump was “strongly” considering State Department spokeswoman Heather Nauert as Haley’s replacement. Trump later confirmed the story, saying Nauert was “under very serious consideration” for the job.The run of stories puts Swan “in the top tier” of reporters covering Trump, says Bob Woodward, the legendary Washington Post reporter and author of the recent bestseller “Fear,” about the Trump White House. “I don’t get the sense that he’s soft at all,” Woodward says. “Walking that line of being tough but fair while also listening to the people you’re covering is a delicate one, particularly in daily reporting. He’s in that class that’s hitting Trump pretty hard but listening to him and giving him” a chance to air his side.Woodward says Swan belongs with the best of a rising group of Washington reporters that includes Maggie Haberman of the New York Times, Michael Bender of the Wall Street Journal and Robert Costa, Philip Rucker and Ashley Parker of The Post.What’s noteworthy about Swan, 33, is that he’s been a journalist for only a few years and a journalist in Washington for even less time than that.Born and raised in Australia, he didn’t get started in the profession until he was 25, despite journalism running in his family. Swan’s father, Norman Swan, is famous Down Under as a health and science broadcaster. An aunt and uncle are also reporters in his native country.After short stints covering politics and other topics for the Sydney Morning Herald, Swan came to the United States in 2013 on an academic fellowship and served briefly as an aide on Capitol Hill. His first real American reporting job was with the Hill; he joined the publication in 2015, covering campaign finance and, occasionally, a candidate named Donald Trump. (Swan is an Australian citizen who holds a work visa; he intends to seek American citizenship after he marries his fiancee, Daily Beast political reporter Betsy Woodruff.)His career accelerated when he joined Axios soon after its launch in early 2017. There he fell under the tutelage of the site’s co-founders, chief executive Jim VandeHei and writer-editor Mike Allen, whom the site describes as “the world’s most-wired reporter.” VandeHei and Allen evidently saw in Swan the kind of plugged-in, high-metabolism journalist they have been in the course of working at The Washington Post and at Politico, which Allen and VandeHei left in 2016 after a falling-out with co-founder John Harris.“You won’t find a tougher, more thorough or harder-working reporter,” says VandeHei of his protege. “I could not be more proud of him, as a reporter and person. I would give my right arm for an army of Swans.”VandeHei won’t provide figures, but Swan’s Trump scoops have undoubtedly played a major role in Axios’s early traffic-building efforts. The site had 8.3 million unique visitors in September, according to the Web-tracking firm ComScore. That’s a mere fraction of much larger competitors (Washington Post: 85.6 million; Politico: 32.4 million) but an impressive number for a young site with just two dozen editorial employees.Swan himself produces a weekly newsletter that has become a franchise unto itself. The newsletter, Axios Sneak Peek, has about 150,000 subscribers, according to VandeHei. Swan has also leveraged his TV appearances on “Morning Joe” and “PBS NewsHour” into a lucrative speaking career; he reportedly receives as much as $25,000 per speech, although his speakers’ agency listing says his fees “vary.”Swan himself declined to comment on the record for this story. He had that in common with about a half-dozen of his competitors on the White House beat, all of whom spoke about him on the condition that they not be identified or quoted directly.Even accounting for competitive jealousies among reporters, the take on Swan among his peers is generally positive. Rivals on the beat say he earns his scoops fair and square, through an extensive network of contacts and connections and a seven-days-a-week work ethic. Notwithstanding the birthright citizenship episode, they describe Swan as a rigorous and independent reporter.The one knock on Swan is that he isn’t Washington’s deepest reporter or finest writer; his stories sometimes read like news flashes or blurbs, shorn of context, depth or larger connections. His scoop about Trump’s plans for the U.S. Embassy in Israel, for instance, was literally 55 words long.Nevertheless, Woodward, for one, remains a fan. “I don’t know if Jonathan Swan gets the MVP award” for reporting on Trump, he says. “But he’s in that group worth watching. Maybe he’s the rookie of the year.”"}