{"id": "Tumbling markets complicate Trump’s midterm messaging", "paragraph": "U.S. stock markets fell sharply Wednesday, erasing all gains for the year and muddying one of President Trump’s favorite talking points two weeks before the midterm elections.The technology-heavy Nasdaq fell 4.4 percent Wednesday, its worst one-day drop since the financial crisis. The index has slid more than 12 percent since the end of August. The Standard & Poor’s 500-stock index, which tracks a broader group of U.S. companies, has lost $2 trillion in value since late September, down 9 percent. The Dow Jones industrial average, meanwhile, lost 608 points Wednesday and is down 8.3 percent in the past three weeks.The financial swoon threatens to undermine a market rise for which Trump has frequently claimed credit and to highlight controversial aspects of Trump’s agenda, including tariffs many companies are blaming for their struggles and a tax cut that polls suggest the public views as inadequately helpful for the middle class.[Dow plunges more than 600 points in another day of losses]Trump has increasingly looked to shift focus away from economic indicators he once touted and toward immigration and other issues — and assign blame elsewhere for any economic setbacks.He has pummeled the Federal Reserve, alleging higher interest rates pose the biggest risk to growth — even musing he might have made a mistake when he nominated Jerome H. Powell as the nation’s top central banker less than a year ago. It is unusual for a president to attack the central bank — the Fed aims to maintain independence from the White House to avoid the taint of politics on its economic decisions.Trump has also promised a 10 percent middle-class tax cut, a proposal that caught his aides by surprise and that lawmakers said was exceedingly unlikely in the near future.In recent days, Trump has suggested he could mobilize the military to protect the southern border from a caravan of migrants, But he has said little about the recent stock-market movement.“The president is very good at manipulating the narrative and getting people — either through traditional media or social media — to focus on what he wants them to focus on,” said Brian Gardner, managing director at Keefe, Bruyette & Woods, an investment bank.Trump’s focus on immigration and his surprise proposal for a middle-class tax cut come as the strong economy exhibits signs of strain.Beyond the slumping market, rates on 30-year mortgages are climbing, with many loans now eclipsing 5 percent. Higher interest rates can limit borrowing, slowing home sales and the economy. And multiple businesses — including firms that Trump has praised, such as Harley-Davidson and United Technologies — are warning that the White House’s trade strategy could cost them millions of dollars in revenue.Forty-eight S&P 500 companies mentioned “tariffs” during calls with analysts in recent days, many warning that they threaten to cause a drag on the economy.Trump has dismissed complaints from chief executives about the White House’s trade policy, telling the Wall Street Journal that overpaid executives will not take responsibility for their own bad decisions.“I have created such an incredible economy,” Trump said in Montana last week. “I have created so many jobs.”Trump said repeatedly during the summer that the United States was experiencing the greatest economy in its history, largely citing the low unemployment rate. And Tuesday, in an interview with the Wall Street Journal, he falsely denied imposing any tariffs on imports, even though he has implemented numerous tariffs against a range of countries this year.His comments to the Journal directly contradict his Twitter post from a few hours earlier, in which he said the tariffs he had launched were bringing billions of dollars into the government’s coffers. Trump has mischaracterized the way tariffs work, suggesting they are paid by other countries rather than by U.S. companies that import the products — often passing those costs to U.S. consumers.White House officials have denied that Trump’s recent behavior is driven by concerns about a weakening economy, saying the new tax plan, despite its surprise rollout, is meant to build on last year’s tax law and help the middle class. And a number of senior officials have said the fundamentals of the economy remain strong, and the White House has an upbeat outlook for next year.“Our job is to focus on what the economic numbers say, and the numbers are very solid right now,” Kevin Hassett, chairman of the White House Council of Economic Advisers, said in an interview. “If your policies have produced the numbers we are observing, then you shouldn’t duck.”Douglas Holtz-Eakin, a Republican economist, said the new tax-cut announcement struck many as an act of knee-jerk desperation.“I don’t think it helps to have the president invent a tax cut,” he said. “That looks panicky. That hurts the larger effort. That wasn’t the White House. That was him.”Job growth during Trump’s presidency is roughly comparable to the last four years of the Obama administration, though the jobless rate is lower and economic growth has picked up. Economists are mixed on whether this is sustainable, with some cautioning the gains from tax cuts and higher federal spending are temporary.“It’s easy to say [Trump is] trying to set the Fed up for the fall here, but a lot of people were warning that the president was taking a risk and Republicans were taking a risk by putting forward a bunch of fiscal stimulus at this point in the business cycle,” said James Pethokoukis, a policy analyst at the American Enterprise Institute.New-home sales sank for the fourth straight month in September, reflecting the impact of mortgage rates that now top 5 percent for many borrowers.Sales of new single-family homes last month fell 5.5 percent from the previous month, to a seasonally adjusted annual rate of 553,000, according to a government report. September’s sales volume was more than 13 percent lower than the same month one year earlier, and figures for June, July and August were also revised down.Though the strong labor market is likely to support demand, some economists are beginning to worry about collateral damage from a housing downturn.“The economy cannot grow at a sustainable 3 percent pace for long if new-home sales continue to tumble,” warned economist Chris Rupkey of MUFG Union Bank.Many executives had hoped trade fights with China and other countries would be resolved swiftly, but it appears a number of disagreements will drag into at least next year.The $260 billion in tariffs Trump unleashed on Beijing took effect in this year’s third quarter, covering roughly half of what the United States buys from China.American companies have warned for months that Trump’s trade war with China and other nations could wrench their bottom lines, and now they are quantifying that damage in dour earnings reports.Ford recently reported levies on metals will shave $1 billion off the automaker’s profits, while consumer-goods giant Honeywell said it expects to absorb “hundreds of millions of dollars” in new duty-related costs.Minnesota manufacturer 3M projected a loss next year of $100 million, blaming “tariff head winds.” Caterpillar shares took the sharpest dive in seven years after the tractor maker said the commercial battle between the world’s two largest economies was driving up the price of steel.Walmart cautioned that prices could swell because a third of the products on its shelves arrive from outside the United States — and many are labeled “Made in China.”United Technologies, which once lauded Trump for saving its Carrier subsidiary’s Indianapolis furnace factory, has changed its public stance on the president’s economic moves, saying his flurry of levies will sting to the tune of $200 million.And Harley-Davidson said this week the duties will zap $20 million out of its wallet this year and that retaliatory tariffs from the European Union could deal an additional $45 million blow.More than a third of the 110 S&P 500 companies that have shared third-quarter earnings since Tuesday have discussed the impact of higher border taxes during their conference calls with analysts, according to the investor research group FactSet.Some companies have appealed directly to the administration, urging Trump to lower the trade barriers before the burden falls on American shoppers.“As the largest retailer in the United States and a major buyer of U.S. manufactured goods, we are very concerned about the impacts these tariffs would have on our business, our customers, our suppliers and the U.S. economy as a whole,” Walmart wrote in a late-September letter to U.S. Trade Representative Robert E. Lighthizer.Several economic factors could converge in the coming weeks to put more pressure on growth, including a decision from Powell about whether to again raise a key borrowing rate in December and an expected fight over federal spending levels. The results of those could give investors and households a new perspective on Trump’s stewardship of an economy that looks much different from its appearance one year ago.Offering one of the last snapshots of the economy before the midterm elections, the government is scheduled to release economic data Friday that measures how much the economy grew from July through September. Analysts diverge strongly on how strong or weak the report will be. David J. Lynch contributed to this report. "}