{"id": "Redskins trade for safety Ha Ha Clinton-Dix, send a fourth-round pick to Packers", "paragraph": "The Washington Redskins traded a 2019 fourth-round draft pick for Green Bay Packers safety Ha Ha Clinton-Dix, the team announced Tuesday afternoon. The move strengthens a defense that is already one of the NFL’s best, and it reflects the team’s willingness to give up a future asset to improve its playoff chances this season.The Redskins, who lead the NFC East with a 5-2 record, added to its secondary ahead of the league’s 4 p.m. trade deadline Tuesday. Clinton-Dix gives the Redskins one of the best safety tandems in the league with Clinton-Dix and D.J. Swearinger, who leads the NFL with four interceptions.Clinton-Dix is in the final year of his rookie contract, after the Packers picked up his fifth-year option for the 2018 season. He was the No. 21 overall pick in 2014 out of Alabama, and he made the Pro Bowl in 2016 when he had five interceptions and 79 tackles. He had 100-plus tackles in his first two seasons and has not missed a single game during his five-year career. Clinton-Dix has recorded 27 tackles, three interceptions, one sack and one forced fumble in 2018.[Arbitrator rules in favor of Redskins in Scot McCloughan’s grievance over firing]He is scheduled to be an unrestricted free agent in 2019 and became a trade candidate after he and the Packers weren’t able to agree to a long-term deal.“Right now, I’m playing each and every game like it’s my last. I don’t think I’m going to be here next year,” Clinton-Dix told the Wisconsin State Journal earlier this month. “That’s how I look at it. I just [have to] be honest with myself. You’ve got to play it game-by-game. Whether we’re losing by 60 points, you’ve got to go out there and perform. This is my biggest interview of my career. So I’ve got to perform, regardless of what the record says.”The statistics website Pro Football Focus has graded Clinton-Dix (6-foot-1, 208 pounds) as the third-best safety this season, behind Seattle’s Earl Thomas, who is out for the season with an injury, and his new teammate Swearinger.The addition brings another former member of the Alabama football team to Washington. Defensive linemen Daron Payne and Jonathan Allen were first-round picks out of the school the past two seasons. Linebackers Ryan Anderson and Shaun Dion Hamilton are also products of Alabama, along with offensive lineman Arie Kouandjio and wide receiver Cam Sims, who are both on injured reserve.Clinton-Dix will likely replace second-year pro Montae Nicholson in the starting lineup. The Redskins have been relatively vulnerable through the air this season, allowing 242 passing yards per game — 13th best in the league. Their run defense has been a bigger strength and has allowed the second-fewest yards per game in the NFL.Washington was thin at safety after rookie Troy Apke was placed on injured reserve with a hamstring injury this week. That left Nicholson and Deshazor Everett as the only safeties in the regular rotation with Swearinger. The team traded away Su’a Cravens to the Denver Broncos during the offseason.[Redskins will have to wait and see on Trent Williams’s thumb]Clinton-Dix voiced his frustrations with the Packers organization at the end of a 2017 season in which the team finished 7-9. He didn’t attend organized team activities during the offseason but was one of four Packers to play every defensive snap last week against the Los Angeles Rams.“We’ve had so much change come through here that I don’t think we ever had a chance to develop a team,” Clinton-Dix told ESPN at the end of last season. “It’s business, but at the same time, we’re trying to build a championship team, and if you don’t have the chemistry within the team, and you’ve got so many different individuals coming into the locker room that aren’t worth a [expletive], it’s kind of tough.”Packers Coach Mike McCarthy said he understood the frustration at the time.“Ha Ha is one of our core guys,” McCarthy told ESPN after the 2017 season. “He’s been to the Pro Bowl for a reason. . . . I love his passion. I love his commitment to the team. I think [it was] words of frustration.”The Redskins weren’t the only NFC East team to add a player ahead of Tuesday’s trade deadline. The Philadelphia Eagles added wide receiver Golden Tate from the Detroit Lions on Tuesday, after the Dallas Cowboys added wide receiver Amari Cooper from the Oakland Raiders last week.Redskins Coach Jay Gruden wasn’t optimistic about making a trade this week, but did allow that injuries could play a factor.“You never know. We’ll wait and see,” Gruden said on the NBC Sports Washington podcast. “I like the team we have. I really don’t think we need any changes right now.”More Redskins:Clinton Portis says ‘Hip Hip Hooray’ divided the Redskins the last time they started 5-24 stats that show how D.J. Swearinger has been NFL’s best safety this seasonAdrian Peterson is making all of his doubters look foolish"}