{"id": "U.S. Navy officer could face questions in Norwegian frigate collision", "paragraph": "The U.S. Navy expects one of its officers to be questioned as part of an investigation into the collision of a Norwegian warship and a commercial oil tanker this month in one of the Scandinavian nation’s fjords.The American officer, who has not been identified, was onboard the Norwegian navy frigate as part of a military personnel exchange, according to U.S. and Norwegian officials. The sailor’s role on the ship remains unclear.The Nov. 8 incident ultimately sank the 439-foot Norwegian warship and left several people injured.Norwegian naval officers beached the vessel — the KNM Helge Ingstad — in an attempt to save it, but the frigate sank five days later after the cables holding it in place snapped. The tanker it struck, the Sola TS, was nearly twice its size at 820 feet. It suffered only minor damage.“The U.S. Navy has an officer assigned to the Personnel Exchange Program (PEP) with Norway as part of the crew of the KNM Helge Ingstad,” Cmdr. Kyle Raines, a spokesman for the U.S. Navy’s 6th Fleet, said in a statement. “This program exchanges personnel from various military components to foreign countries to enhance interoperability with partner navies and services. The concept was born out of the need for partners and allies to share ideas and build relationships.”Raines declined to identify the American officer by name, citing privacy interests. He said the U.S. Navy is supporting the Norwegian investigation.Traditionally, investigators interview all officers onboard military ships involved in collisions, so the U.S. Navy expects the American officer to be questioned as well, officials said.Ann Kristin Salbuvik, an official at the Norwegian Defense Ministry, confirmed that an American officer was onboard the ship but declined to specify the officer’s duties. “The exchange program has been established to share experiences and create a basis for good cooperation between our navies,” Salbuvik said. “If incidents should occur or if there are situations that involve personnel on an exchange, there is a duty, according to the valid status agreement, to inform the sending state’s military authorities, as well as to ensure that relevant authorities are put in contact with relevant national authorities.” Salbuvik said Norwegian authorities have notified their American counterparts but declined to elaborate.The KNM Helge Ingstad was involved in a massive naval exercise last month — Trident Juncture 2018 — in which the U.S. Navy sent an aircraft carrier, the USS Harry S. Truman, north of the Arctic Circle for the first time in decades. The exercise was widely seen as a message to Russia.  The Navy has a tradition of hosting Norwegian military personnel and embarking its own personnel on foreign vessels through exchange programs. Participants typically serve two-year tours as a fully integrated member of the host nation’s navy.U.S. service members who participate in such programs are required to obey all orders from host commanders and remain subject to the American military’s rules and regulations.“Any individual who commits an offense against the host service code of discipline during the exchange assignment may be withdrawn from his or her assignment,” according to the March 2018 order outlining the program. “If the offense committed by U.S. Navy exchange personnel against the host service code is also an offense against the [Uniform Code of Military Justice], disciplinary action may be taken against the individual by U.S. Navy authorities.”The incident comes at a sensitive time for the U.S. Navy, following two fatal collisions of guided-missile destroyers in the Pacific last year that together left 17 sailors dead.Seven sailors died off the southern coast of Japan in June 2017 when the USS Fitzgerald struck a much larger container ship, and 10 sailors died two months later when the USS John S. McCain collided with another vessel off the coast of Singapore.A Navy investigation of those disasters determined they were preventable and caused by “multiple failures” among service members who were standing watch the nights of the accidents. The service has since forced some personnel who were involved into retirement and launched court-martial proceedings against others."}