{"id": "Amid incendiary rhetoric, targets of Trump’s words become targets of bombs", "paragraph": "In the home stretch of the fall campaign, President Trump has called Democrats “evil” and argued they are “too dangerous to govern.” He has denounced Barack Obama’s presidency and demonized former secretary of state Hillary Clinton, inspiring chants of “Lock her up!” at his rallies.The president has also used his bully pulpit to taunt Rep. Maxine Waters (D-Calif.) as a “low I.Q. individual,” impugn former CIA director John Brennan and fan conspiracy theories about liberal philanthropist George Soros. And he has called the news media “the enemy of the people,” singling out CNN’s reporting as “fake news.”This week, these targets of Trump’s rhetoric became the intended targets of actual violence in the form of pipe bombs, many of which turned up Wednesday.Investigators have not disclosed information about the origin of the packages, and no evidence has surfaced connecting the acts to any political campaign. Still, a common theme among the targets was unmistakable: Each has been a recurring subject of Trump attacks.Law enforcement authorities said packages containing pipe bombs and addressed to the homes of Obama and Clinton were intercepted by the Secret Service, while on Monday, one was found at Soros’s home.In addition, an undetonated device addressed to Brennan was found at CNN’s New York headquarters and another, addressed to Waters, was discovered at a congressional mail-sorting facility. A similar package was found addressed to former attorney general Eric H. Holder Jr.Trump and other Republican leaders rushed Wednesday to decry the thwarted attacks on Democrats and CNN, saying that such acts cannot be tolerated. For many politicians, the day was a reckoning — a sobering pause just 13 days from Election Day to reflect on a political atmosphere notable for apocalyptic imagery and violent confrontations.[Homemade bombs sent to Obama, Clinton, CNN offices and Holder, officials say]Speaking from the East Room of the White House, Trump said he and officials in his administration were “extremely angry, upset, unhappy about what we witnessed.” The president sounded a call to all Americans to unite, though he did not address the tone of his own campaign rhetoric.“We have to come together and send one very clear, strong, unmistakable message that acts or threats of political violence of any kind have no place in the United States of America,” Trump said.Senate Minority Leader Charles E. Schumer (D-N.Y.) and House Minority Leader Nancy Pelosi (D-Calif.) responded in a joint statement: “President Trump’s words ring hollow until he reverses his statements that condone acts of violence.”They went on to argue that Trump has “divided Americans with his words and actions,” citing his cheers for Rep. Greg Gianforte (R-Mont.) for body-slamming a journalist; his equivocations over the deadly neo-Nazi and white supremacist rally in August 2017 in Charlottesville; his encouragement of supporters at rallies who have gotten violent with protesters; his praise for foreign dictators who kill their own citizens; and his attacks on the free press as “the enemy of the people.”Trump traveled Wednesday evening to Wisconsin for a campaign rally, where he sought to make a show of behaving himself by pointing out during his relatively subdued speech that he was “trying to be nice.”“No nation can succeed that tolerates violence or the threat of violence as a method of political intimidation, coercion or control,” Trump told the crowd in Mosinee.[Trump takes aim at media after homemade bombs sent to Clinton, Obama and CNN]Trump again shirked responsibility for his own inflammatory contributions to the political discourse and instead assigned blame to others. “The media also has a responsibility to set a civil tone and to stop the endless hostility and constant negative — and oftentimes, false — attacks and stories,” he said.The president, who has made a sport out of mocking his political rivals with nicknames like “Crooked Hillary,” also exhorted others in the political arena to “stop treating their opponents as morally defective.”Jon Meacham, a journalist, historian and author of the book “The Soul of America: The Battle for our Better Angels,” said the most divisive political periods of the nation’s history have resulted in violence against political figures. He said he has long worried history could repeat itself in the Trump era.“We have examples of political violence in the United States in the age of Jackson, in the road to Civil War, during the Civil War, in the Progressive Era and in the cataclysm of the 1960s,” Meacham said. “What happened today is a reminder of the stakes of the era in which we’re living. This is an era of fundamental redefinition of politics and culture. It requires leadership that is steadying, not incendiary, and we’ve seen far too much incendiary language from the top.”Throughout the political world, there were widespread calls to quickly bring to justice those responsible.Clinton, speaking at a fundraiser for congressional candidate Donna Shalala in Coral Gables, Fla., thanked the Secret Service for intercepting the package addressed to her home and called it “a troubling time.”“It is a time of deep divisions, and we have to do everything we can to bring our country together,” she said.[CNN finds itself at the center of the news as a mail bomb forces evacuation of its New York office]House Majority Whip Steve Scalise (R-La.), who survived a shooting that targeted lawmakers at an Alexandria baseball field in 2017, wrote in tweets, “These attempted attacks that have been made are beyond criminal, they are acts of pure terror. Violence and terror have no place in our politics or anywhere else in our society.”He added, “As a nation, we must agree that this is a dangerous path and it cannot become the new normal.”When asked Wednesday whether some of Trump’s rhetoric might have contributed to the mailings, Sen. Orrin G. Hatch (R-Utah) defended the president.“A lot of things could have contributed to that,” he said.He added, “I don’t see anything really wrong with the president. I think that, you know, he’s in a tough position, he’s attacked on all sides and he ought to be able to express himself.”But Sen. Jeff Flake (R-Ariz.), who has long bemoaned the disappearance of civility from the nation’s politics, said Wednesday that it was obvious to him that the attempted attacks were “political.”“What the president says matters, and if he were to take a more civil tone, it would make a difference,” Flake said in an interview on CNN. “Civility can’t wait until after an election. The president shouldn’t refer to the press as the ‘enemy of the people.’ . . . People hear that and they follow it.”CNN President Jeff Zucker said that the White House has “a total and complete lack of understanding” about the consequences of their attacks on the media.“The president, and especially the White House press secretary, should understand their words matter,” Zucker said in a statement. “Thus far, they have shown no comprehension of that.”Trump has long assailed the targets of the packages. He regularly excoriates Obama’s presidency and was a leading proponent of the falsehood that the nation’s first black president was not born in the United States.Despite defeating Clinton in the 2016 presidential election, Trump still goes after her in his speeches, inspiring chants from crowds to “Lock her up!” Before Trump’s appearance at the Wisconsin rally Wednesday, the crowd erupted in a “Lock her up!” chant while Senate Republican candidate Leah Vukmir was attacking Clinton.At his rallies, Trump also routinely mocks Waters and attacks CNN as reporting “fake news,” to which his rally crowds regularly chant back, “CNN sucks!” And Soros has long been a target of far-right groups and the subject of conspiracy theories with anti-Semitic overtones.In the wake of angry protests over Supreme Court Justice Brett M. Kavanaugh’s confirmation battle, Trump and other Republicans have tried to cast Democrats as the party of the “mob” and attempted to link specific candidates to radical figures on the left.[The instant, inevitable cries of ‘false flag’ after bomb threats targeting the Clintons, Obamas and CNN]A number of Trump’s supporters advanced the “false flag” theory on social media and talk radio, arguing that the potential explosive devices may have been sent by liberals with the intention of reversing the “mob” argument and painting Democrats as victims of unruly conservatives.Explaining the theory, conservative talk-radio host Rush Limbaugh said on the air Wednesday, “For the last few weeks, the Democrats have had all of that horrible PR, all of these angry mobs . . . Wouldn’t it serve you up here if you’re a Democrat operative to make it look like the Republicans are a bunch of insane lunatics and have some mobsters on their side as well?”The “mob” frame has not only been a feature of Trump’s rally speeches, but also central to some GOP campaign advertising.In Minnesota’s rural 1st Congressional District, the National Republican Congressional Committee has repeatedly sought to tie Dan Feehan, an Army veteran who was awarded a Bronze Star, to leftist anti-fascist activists who have clashed with police and right-wing protesters.“Feehan works at a liberal organization bankrolled by George Soros, chief financier of the global left and anti-American causes,” a narrator says in one spot, as the sound of smashing glass plays over images of anarchist protesters. Josh Dawsey in Mosinee, Wis., and Felicia Sonmez, John Wagner, Erica Werner and David Weigel in Washington contributed to this report. "}