{"id": "Maryland vs. Ohio State had nearly everything but a breakthrough win for the Terps", "paragraph": "Matt Canada had decided on the final play well before it happened. With Maryland on the verge of a huge upset of the No. 10 Ohio State Buckeyes to achieve bowl eligibility, at the end of a breathless senior day game that featured a remarkable performance by running back Anthony McFarland, the Terrapins' interim coach wanted to play to win — not to tie, not to bring this matchup into a second overtime.Canada called going for a two-point conversion a gut decision, one he talked over with quarterback Tyrrell Pigrome before Ohio State scored on its possession to open overtime. The two discussed two possible play-calls, and Canada said they both felt good about the play the offense later attempted.But when the chance to win came, Pigrome missed on a throw to an open Jeshaun Jones in the end zone to seal a 52-51 win for the Buckeyes at Maryland Stadium.“Every game, you want a play back here or there,” Canada said after the loss. “But I’m guessing everybody who doesn’t sit in this [team meeting] room every day, outside in the entire world, didn’t give us a chance. The season was over last week. That’s what everybody thought. We were done. We were written off.”Earlier in overtime, Ohio State had converted on a fourth down with inches to go with a pass from quarterback Dwayne Haskins, a Maryland native who once committed to the Terps. Haskins then threw a touchdown pass to pull his team ahead for the first time all day.Maryland answered, naturally, with McFarland. The redshirt freshman carried to the 1-yard line on the Terps’ first snap in overtime, giving him 298 rushing yards for the game and setting up a Tayon Fleet-Davis score on the next play. McFarland’s total, on just 21 carries, was the second highest in a game in program history and came despite an apparent shoulder injury that temporarily forced him from the game in the fourth quarter.But the failed two-point attempt dropped Maryland (5-6, 3-5 Big Ten) to its third straight loss, and the team teeters on the edge of bowl eligibility heading into next week’s regular season finale at Penn State.A win would have carried significance for Maryland, which has only gone to three bowl games in the past seven seasons; for Canada, who could have made a stronger case for retaining the top job; and the players, who have endured a chaotic season after the death of teammate Jordan McNair. But the Buckeyes (10-1, 7-1) — and their roster stacked with talent — barely won out.In the first half, McFarland powered past the Buckeyes’ defense, gaining massive chunks of yardage at a time. On the second play of the game, he notched an 81-yard rushing touchdown. Ohio State responded with a field goal, and the redshirt freshman ran for a 75-yard score on the first play of the subsequent drive.McFarland’s 231 rushing yards in the first half were a team record. His 153 rushing yards in the first quarter were the most in the first quarter by a player in a Football Bowl Subdivision game this season.Ohio State, which had been playing catch-up all day, tied the game at 38 with 3:41 left in the fourth quarter. But Pigrome nailed a 60-yard pass to Darryl Jones to the 1-yard line on the first play of the subsequent drive. On third down, McFarland fumbled the ball as he reached into the end zone but tight end Chigoziem Okonkwo recovered for the go-ahead score with 1:41 remaining.With no timeouts left, Haskins led the Buckeyes down the field to tie it at 45 with 40 seconds left. Maryland still wasn’t done, with Pigrome hitting Taivon Jacobs, a senior receiver, for 30 yards to the Ohio State 38. When about 10 more yards could have brought the Terps into field goal range to win in regulation, Pigrome was sacked for a loss of 14 yards. Ohio State then sacked Pigrome again on a Hail Mary attempt to send the game to overtime.Pigrome, who took over the starting job after Kasim Hill suffered a torn ACL in last week’s 34-32 loss at Indiana, completed 6 of 13 passes for 181 yards and a touchdown. But in a game that had just about everything, he wasn’t the only Terps player who made a big play in the passing game.After Ohio State tied the game for the first time early in the fourth, the Terps called a fake punt on fourth down and Australian punter Wade Lees connected with Jacobs for a 15-yard gain. Not long after, Jeshaun Jones caught a 27-yard touchdown pass on third down for a 38-31 lead.“Our mentality wasn’t to upset Ohio State,” linebacker Tre Watson said. “It was to beat Ohio State. … There was not a moment in the game today where we didn’t expect that we were going to win.”Maryland held a 24-17 lead at halftime thanks largely to McFarland and a key stop. With Ohio State driving to close out the first half, Maryland’s Seun Oluwatimi forced a fumble and Ayinde Eley recovered in the end zone, preventing the Buckeyes from tying the score heading into the locker room. When the teams returned, Maryland’s defense again delivered. On Ohio State’s second snap, Haskins threw an interception that RaVon Davis returned 37 yards to the end zone.Through most of the day, however, Haskins tore apart Maryland’s defense, passing for 405 yards and three touchdowns as he completed 28 of 38 attempts. Haskins also had three rushing touchdowns. J.K. Dobbins recorded 203 yards on the ground for the Buckeyes on 37 carries. The Buckeyes finished with three turnovers but 688 total yards.Throughout the season, Ohio State’s defense has struggled to prevent explosive plays, while Maryland has excelled at creating them, as exemplified by McFarland’s chunk yardage. As a whole, the Terps’ running game accumulated 339 yards on 48 carries.Thanks to the rushing success, Pigrome hardly had to throw the ball and made several big plays when he did. But the incompletion that he will remember is the one that came in overtime.“He put us in the position to win the game,\" Canada said of Pigrome. “… Being a quarterback, it’s the greatest position in all of sport. It doesn’t mean you’re more important than anybody else, but there’s a lot to it, right? You get all the credit. You get all the blame. I know he’s having a tough time right now.”Still, when asked if it would be difficult for the team to come back from this loss, Canada said, “It won’t be hard at all.”“Last week everybody in the country said we were done, right?\" Canada said, referring to the loss at Indiana that was considered the Terps' best shot at earning bowl eligibility. \"Said the freaking season’s over. Shouldn’t even play the last two. Our guys will be fine. ... I have no doubt we’ll come back and play really hard next week. That’s who they are.”Read more:‘Big Game' between Cal and Stanford postponed due to poor air qualityBarry Svrluga: As Ohio State and Maryland show, a football coach’s record is his leverageFor Taivon Jacobs, six years of football and fatherhood at MarylandDino Babers, college football’s tent revivalist"}