{"id": "U.S. and Israel weigh whether Saudi crown prince can deliver on Mideast peace and Iran", "paragraph": "U.S. and Israeli officials have expressed concern that Saudi Crown Prince Mohammed bin Salman may have less leeway to pursue the gradual warming of relations between Israel and its Arab neighbors amid the political fallout from the killing of journalist Jamal Khashoggi.The fate of the crown prince, the kingdom’s de facto ruler, has implications for the Arab-Israeli peace package developed by the Trump administration and for cooperation among opponents of Iran.“We should not allow an action like that to go unanswered,” the Israeli ambassador to the United States, Ron Dermer, told an audience last week, referring to Khashoggi’s killing. “But we also have to be careful about not throwing away a relationship that has strategic value.”“I think the administration, when they know all the facts, are going to have to decide, how can they on the one hand make clear that this action is unacceptable, but also not throw out the prince with the bathwater, let’s put it that way.”President Trump has called Saudi Arabia a key to regional stability and a valuable purchaser of American arms but has said little publicly about what a diminished role for the kingdom or Mohammed might mean for Israel or Arab-Israeli peace. Trump’s chief Mideast envoy, son-in-law Jared Kushner, however, has discussed with diplomats and others how the crown prince’s position might affect U.S. plans, people familiar with the discussions said.[Saudi crown price told White House that slain writer was a ‘dangerous Islamist’]Saudi Arabia has acknowledged that Khashoggi, a dissident Saudi journalist and contributing Washington Post columnist, was killed in the Saudi Consulate in Istanbul last month. But the kingdom’s shifting explanations have angered and worried some Trump administration officials, who say the episode may leave the prince with less leverage to lead politically or culturally difficult shifts.Mohammed has denounced the killing and denies involvement, but U.S. statements have stopped short of exonerating him. Current and former U.S. officials say the lethal operation could not have occurred without the prince’s knowledge and approval.The Trump administration revoked the visas or made travel ineligible for 21 Saudi nationals implicated by Turkey and Saudi Arabia in Khashoggi’s death.Israeli officials have become more vocal about separating the killing from the kingdom’s strategic value.“What happened in the Istanbul consulate was horrendous and it should be duly dealt with,” Israeli Prime Minister Benjamin Netanyahu said Friday. “Yet at the same time, I say that it is very important for the stability of the world, of the region and of the world, that Saudi Arabia remain stable.”“I think that a way must be found to achieve both goals, because I think that the larger problem is Iran,” he said.Bahraini Foreign Minister Khalid bin Ahmad al-Khalifa tweeted that Netanyahu showed “a clear vision to the stability of the region and the role of Saudi Arabia to keep that stability.”[Netanyahu calls Khashoggi killing ‘horrendous’ but stresses Saudi stability]Mohammed, known by his initials MBS, has been the leading figure in a tentative and risky strategy to become more open about tacit or secret Israeli-Saudi cooperation. U.S. officials have hoped that he could also be the pivot point for a new, transactional Arab relationship with Israel that would undergird the Trump peace program.That was always a long shot, and it was placed in heavy doubt over the summer.Saudi King Salman, the prince’s father, reassured Palestinians and their Arab backers in July that he would not accept a peace plan that ruled out a Palestinian capital in East Jerusalem. The month before, Saudi and other Arab leaders told Kushner that the Trump administration’s decision to move the U.S. Embassy to contested Jerusalem had jeopardized their support for a plan that had seemed imminent.“The Israeli perception is that MBS is much better for their own purposes,” a Saudi government official said. “It is true that MBS has mentioned several times he would like to see a different Middle East and wasn’t as sympathetic with Palestinians as they might have wished for.”And on Iran, “MBS did give Israel more security in the sense that he was framing Iran as the biggest threat,” the official said. The official as well as others from the Middle East and elsewhere spoke on the condition of anonymity to protect diplomatic discussions.Trump’s chief negotiator, lawyer Jason D. Greenblatt, was in Israel this weekend amid signs that the plan, repeatedly shelved in recent months, may be released soon.At the time of his last meeting with Netanyahu, in late September, Trump had said the plan would be made public in two to four months. Khashoggi was killed a week after that meeting, and it is not yet clear whether it altered the White House timeline.The plan is expected to offer the possibility of a package deal for a settlement among Israel and Arab neighbors. Saudi pressure on the Palestinians to accept a settlement is considered crucial.The Trump peace package has undergone several revisions, including a step back from a plan to soften the ground for talks and increase pressure on the Palestinians to accept a deal, said a foreign diplomat familiar with aspects of the White House thinking.The crown prince was supposed to be a key figure in that approach but had already “had his wings clipped” somewhat over the embassy move when the Khashoggi case added new questions about his influence, the diplomat said.“MBS is not going to do the heavy lifting expected before now, and they are deciding what to do next,” the diplomat said.An Israeli government official said Saudi Arabia is already playing a main role by allowing or encouraging small diplomatic steps over the past month.Saudi Arabia, the most powerful gulf Arab state, has sent signals to Oman, the United Arab Emirates and Bahrain condoning diplomatic overtures to Israel, the official said.“All the current steps between Israel and especially gulf states wouldn’t have been possible without the backing of the Saudis,” the official said.“And the change of mind inside the Saudi has, from our perspective, a lot to do with MBS. He did open the door for more visible and official relationships with countries in the region.”Netanyahu visited Oman late last month, the highest-level contact between the countries since 1996. The talks were focused on the prospects for peace and on Iran, diplomats said.Netanyahu’s office called the trip “a significant step in implementing the policy outlined by Prime Minister Netanyahu on deepening relations with the states of the region while leveraging Israel’s advantages in security, technology and economic matters.”The goal is to combine forces against Iran and open Israel’s strong economy to greater Arab investment and partnership.“We welcome the warming ties & growing cooperation between our regional friends,” Greenblatt tweeted about the visit. “This is a helpful step for our peace efforts & essential to create an atmosphere of stability, security & prosperity between Israelis, Palestinians & their neighbors. Looking forward to seeing more meetings like this!”Dermer, the Israeli ambassador, told an audience at Congregation Beth Israel in Houston, that he is “more optimistic about the prospects for reconciliation in our region than I have ever been,” because of what he called a shift in Arab thinking about the value of a strategic relationship with Israel.“I see a change that is happening in the broader Arab world . . . for the first time in 70 years,” Dermer said. “Arab governments recognize that Israel is not the enemy, but a potential partner in confronting Iran, in confronting radical Sunni Islam.”"}