{"id": "Steelers continue ‘Le’Veon who?’ portion of season with a critical win over Ravens", "paragraph": " BALTIMORE — The Pittsburgh Steelers remain in the “Le’Veon who?” portion of their season. Holdout running back Le’Veon Bell still was nowhere to be seen. James Conner, his replacement, again was the focal point of the offense. And the Steelers kept winning, posting their fourth straight victory as they beat the Baltimore Ravens, 23-16, on Sunday at M&T Bank Stadium, enduring an injury scare to quarterback Ben Roethlisberger along the way.The Steelers upped their record to 5-2-1 and stayed ahead of the idle Cincinnati Bengals, who are 5-3, atop the AFC North. They added to mounting woes of the Ravens, who suffered their third straight loss to fall to 4-5.The hold-your-breath portion of the day for the Steelers came when Roethlisberger landed on his right shoulder as he was tackled by Ravens linebacker Za’Darius Smith at the end of a fourth-quarter run. Roethlisberger remained on the turf by the Steelers’ sideline as members of the team’s medical staff rushed to examine him.[Biggest moments from an exciting Week 9 of the NFL season]Suddenly, a Pittsburgh offense that has been without Bell all season — he has refused to sign his franchise-player deal and report to the team — was facing the prospect of being without Roethlisberger as well.But as Roethlisberger stood on the sideline near midfield, without the medical staff around him, backup Joshua Dobbs delivered a key, 22-yard completion to wide receiver JuJu Smith-Schuster for a first down on his first regular season NFL pass.“I almost left Josh in after that play,” Roethlisberger said.Roethlisberger said he merely had the wind knocked out of him, an assessment echoed by Coach Mike Tomlin.“You can’t breathe for a second,” Roethlisberger said. “You’re laying there. Once you start getting your breath, you start doing an evaluation. I knew right away it wasn’t my head. Then you start talking shoulders, elbows — ­everything like that. Once I was able to get up, I knew I’d probably be okay.”Roethlisberger trotted back on the field after missing only just that one play and soon provided a 51-yard strike to tight end Jesse James that led to a field goal to extend the Steelers’ lead to 10 points.Conner did much of the rest, continuing to thrive in Bell’s absence. He ran for 107 yards on 24 carries. He had seven catches for 56 yards and a touchdown. No, he isn’t Bell, but he is doing a pretty credible impersonation, delivering as both a runner and as a pass-catcher out of the backfield.“I don’t want to take anything away from James,” Tomlin said. “But the big boys up front are opening holes. And so it’s a collective effort. James is going above and beyond. I’m more pleased by what he’s doing in the passing game and from a blitz-pickup standpoint. That’s a little bit more unique than the rushing. We knew he could run the ball.”Conner managed only 19 rushing yards on nine carries when the Steelers lost to the Ravens, 26-14, on Sept. 30 in Pittsburgh. The Steelers haven’t lost since, and it was clear practically from the outset Sunday that this game would be different for Conner. He had his fourth straight 100-yard rushing game and fifth of the season.“The last time we played them, we had some turnovers and penalties,” Conner said. “We just had the opportunity to start fast ­[Sunday].”Some, including Steelers teammates, expected Bell to show up before the season. He didn’t. It was reported that he would join the team during its recent bye week, or possibly after last week’s trade deadline. He still hasn’t.The wisdom of Bell staying away and losing more than $855,000 per week of his $14.5 million franchise deal has been debated exhaustively. But there’s no going back now — not for Bell and not for the Steelers. If Bell wants to play this season, under NFL rules he must report to the Steelers by Nov. 13.The inclination for the Steelers and their fans might be to take a vindictive approach. They have done well without Bell, after all, but that probably would be the wrong option.If Bell comes back, he probably wouldn’t replace Conner in the lineup but should add value as a complementary player in the running game and as a pass-catcher. He probably would make the Steelers better.For the Steelers, the Bell situation isn’t merely about outlasting the Bengals and lapping the ­Ravens in the division. It’s about battling the New England Patriots and Kansas City Chiefs to be the AFC’s top team. It’s about winning the Super Bowl while they can with Bell, Roethlisberger and wide receiver Antonio Brown.Bell probably can help that cause during whatever is left of his Steelers tenure."}