{"id": "CIA director listens to audio of journalist’s alleged murder", "paragraph": "CIA Director Gina Haspel listened to audio purportedly capturing the interrogation and killing of journalist Jamal Khashoggi, giving a key member of President Trump’s Cabinet access to the evidence used by Turkey to accuse Saudi Arabia of premeditated murder.Haspel, who departed for a secret trip to Turkey on Monday, heard the audio during her visit, according to people familiar with her meetings.President Trump, who has made Saudi Arabia a central pillar of his Middle East strategy, has grown increasingly skeptical of the kingdom’s claim that Khashoggi’s death was a “rogue operation” that occurred after a fistfight broke out in the Saudi Consulate in Istanbul on Oct. 2.On Tuesday, Trump said Saudi officials had engaged in the “worst coverup ever” and that those behind the killing “should be in big trouble.”A person familiar with the audio said it was “compelling” and could put more pressure on the United States to hold Saudi Arabia accountable for the death of Khashoggi, a contributing columnist for The Washington Post.“This puts the ball firmly in Washington’s court,” said Bruce Riedel, a former CIA official and scholar at the Brookings Institution. “Not only will there be more pressure now from the media but Congress will say, ‘Gina, we would love to have you come visit and you can tell us exactly what you heard.’ ”The Trump administration took its first concrete steps to penalize Saudi Arabia on Tuesday by revoking visas for agents implicated in the killing, a modest move considering 18 of the 21 Saudi suspects were already under arrest.In announcing the measures, Secretary of State Mike Pompeo said he is working with the Treasury Department on whether to impose sanctions on those responsible for the journalist’s death.“These penalties will not be the last word on this matter from the United States,” Pompeo said. “We will continue to explore additional measures to hold those responsible accountable.”Trump has reiterated that he views Saudi Arabia as a great ally and an important purchaser of U.S. tanks, bombs and planes.Saudi Crown Prince Mohammed bin Salman, the country’s de facto leader, has denied having knowledge of the mission and on Wednesday promised to bring those responsible to justice. He called the killing of Khashoggi a “heinous crime.”Turkish officials have voiced their doubts about his intention to support a full investigation.“How should a real investigation in Saudi Arabia work when one of the main suspects is the crown prince MBS?” said a Turkish senior official, referring to the crown prince by his initials.“He is one of the suspects. Members of his royal guard were part of the killing squad. The U.S. nor the rest of the world should really accept this,” said the official, who like others spoke on the condition of anonymity to discuss a sensitive topic.Riedel said it will be difficult for Haspel to resist requests by Congress for a briefing. “It will be pretty hard for her to say no because at a minimum the intelligence committees can ask her to come in secret, but even if it’s a secret session, it will leak fast,” he said.U.S. lawmakers have increased their pressure on the Trump administration, accusing the crown prince of ordering the killing.“Do I think he did it? Yes, I think he did it,” Sen. Bob Corker (R-Tenn.), chairman of the Senate Foreign Relations Committee, said in an interview with CNN.Sen. Thom Tillis, another Republican, told NBC that “in Saudi Arabia, you do not do something of this magnitude without having clearance from the top.”"}