{"id": "A mass shooting in Pittsburgh and a Trump visit expose a divided America", "paragraph": " PITTSBURGH — For Julia Santucci, there was without question a connection between what she saw as President Trump’s “fearmongering” about an immigrant invasion and the deadliest attack on American Jews in the nation’s history, a few miles from her home. “You’re fomenting a type of hatred that others take too far,” said Julia, a senior lecturer at the University of Pittsburgh, of the president and his most ardent backers.Her father, an insurance broker and lifelong Republican, believed that line of thought made little sense. Trump could often be blunt and crude, but Rocco Santucci did not believe he was racist, anti-Semitic or even anti-immigrant. In his view, Trump was no more to blame for the killings than Democratic politicians who also stoked Americans’ fears.“Trump’s a shrewd guy,” Rocco said of the president. “He picks what sells.”The debate between father and daughter this week mirrored the one that played out in bars, houses of worship, universities and at dinner tables in this city that Trump has held up as a metaphor for his kind of America.“I was elected to represent the citizens of Pittsburgh, not Paris,” he said a little more than a year ago when he withdrew the United States from a global accord on climate change.Trump’s view of Pittsburgh as a symbol of the might of American manufacturing was largely misplaced. The last big steel mill here was abandoned in 1998. Today, the land it occupied, just across the street from a test track for driverless cars, is being redeveloped as a low-carbon-footprint technology park.But Pittsburgh and its surrounding suburbs are a reflection of something else — a country so divided that many here are asking whether the president, his raucous “build the wall” rallies and his most ardent and angry supporters bear some culpability for one of the worst tragedies in the city’s history. Others bristle with anger at the suggestion.That dispute played out most publicly in the disagreement over whether Trump should come to the city and play the traditional consoling role expected of presidents in moments of tragedy. On Monday, before Trump and the first lady announced that they would come here on Tuesday, Mayor Bill Peduto (D) said the White House should consider the “will of the families” of those who died. He asked that a presidential visit not happen “while we are burying the dead.”But the divide is also evident in more subtle ways. One involved Julia, 38, who on the Monday after the shooting was thinking about her 69-year-old father. He had been the chairman of the Ross Township Republican Committee in the 1980s and had volunteered on behalf of President Ronald Reagan. Through the 1990s and the 2000s, they argued — sometimes heatedly — about politics.Lately, though, they had found it harder and harder to even discuss Trump. “My dad is a lifelong Republican but not a Trump Republican,” she said, pausing. “I think.” She knew with certainty that her father had voted for Reagan, both Bushes, John McCain and Mitt Romney.But in the 2016 election, for the first time in her life, she wasn’t certain who he voted for. “I didn’t ask,” she said.Did she really want to know?“I don’t know,” she said. “It’s hard not to take these things personally. . . . It’s hard not to view a vote for Trump as a rejection of the things I value.”***America’s biggest tragedies often provoke moments of “thoughtful introspection and self-examination that we so rarely see in public life,” President Barack Obama said in the wake of the killing of nine worshipers at the Emanuel African Methodist Episcopal Church in Charleston, S.C., three years ago.The Charleston shooting provoked a discussion about race and the Confederate battle flag. In the aftermath of the attack, South Carolina lawmakers, led by then-Gov. Nikki Haley (R), voted overwhelmingly to remove the banner from the state capitol.The 2012 slaughter of 20 children and six adult staff members at Sandy Hook Elementary School in Connecticut renewed a national debate about whether private ownership of assault weapons and high-capacity magazines should be permitted and whether mental-health-care services in the country should be bolstered.The killing of 11 worshipers from ages 54 to 97 in Pittsburgh has made some of those debates resurface. The “common denominator of every mass shooting in America” is guns, said Peduto, the mayor of this overwhelmingly Democratic city, in the immediate aftermath of the tragedy. Trump countered that the answer was more guns and more armed guards in places that might be vulnerable.But this violent incident, far more than any previous attack, has opened a fresh discussion: about the role that America’s toxic politics may have played in radicalizing the suspected shooter.Taylor Seybolt, an international affairs professor at the University of Pittsburgh, dedicated his class Monday to the shooting. “What is it you want or need to know?” he asked his students.Many wondered whether the suspect’s anti-Semitic beliefs were inflamed by the heated political rhetoric surrounding a caravan of several thousand immigrants coming from Latin America and headed to the United States, Seybolt said. Trump has often characterized the caravan as an “invasion,” and others such as Rep. Matt Gaetz (R-Fla.) speculated before the killings that George Soros — the wealthy Jewish philanthropist — might be funding the caravan.Beyond the university’s walls, the discussion quickly morphed into a debate over whether Trump should visit Pittsburgh. “President Trump, you are not welcome in Pittsburgh until you cease your assault on immigrants and refugees,” a group of Jewish progressive leaders called Bend The Arc wrote in an open letter to the president. The group’s online petition gathered more than 80,000 signatures as of Tuesday night.The debate also played out on local talk radio, where it was broken up by ads for host Glenn Beck’s “Addicted to Outrage” tour, which was scheduled to make a stop in Pittsburgh on Saturday.“Should Trump come?” one KDKA radio host asked Monday morning. “Would he be welcome?”“I need him now,” said a caller, who identified herself as a Jewish resident of Squirrel Hill, the close-knit neighborhood where the killings happened. “It’s horrible that I have to go to all these people’s shiva houses and hold them.”On Monday, Rabbi Jeffrey Myers of Tree of Life synagogue, the site of the shooting, weighed in.“Hate is not political,” Myers told The Washington Post. “It is not blue or red, it’s not male or female, it doesn’t know any of those divisions.”***For Julia and her father, Rocco, the debate over whether Trump should visit Pittsburgh led someplace more personal.She and her father often argued heatedly about politics, particularly after her politics shifted left in college, but they shared a common belief in the importance of a strong national defense. After graduate school at the University of Arizona, Julia joined the CIA as an analyst. She did a stint at the White House from 2012 to 2014, where she focused on Egypt policy.“In Egypt, you could see how political leaders create a culture that allowed violence to flourish,” she said.As the years passed, her father made a vow not to talk about politics with his daughter on the phone, where they both grew too heated.“We love each other very much,” he said. “But our differences in politics are many.”One exception came the day after the election in November 2016. On the phone that day, her father said, a devastated Julia told him that Trump’s election made her feel “unsafe” as a woman.To her father, her concerns seemed overstated and even foolish. “The country is not going to change because this guy is president,” he recalled telling her.In August 2017, Julia and her husband returned home to Pittsburgh, where they had both grown up.She and her father couldn’t avoid Trump’s divisive presidency. Rocco had initially brushed off Trump’s candidacy as “a joke.” But he saw a lot to like in the way Trump was running the country. “He says things to stir people up, and, boy, does he ever,” Rocco said. “But what’s happening in the country is good. The economy has gone well. Internationally, things are going well.”Julia got the news of the killings from an alert on her phone. “Horror, but not surprise” is how she described her reaction. “It’s become all too common in America.”Rocco’s Internet was down, so he found out about the attack from the Verizon repairman. He quickly checked the news on his phone, and a short time later, he learned that one of the dead was his longtime dentist, Richard Gottfried, whose wife, Peg, sometimes attended his church.At Mass on Sunday, Rocco’s priest called the attack an act of “utter horror and total cowardice.” On Monday, the news on Rocco’s phone was still full of reports about the killings in Pittsburgh and the immigrant caravan headed toward the southern border of the United States. The website he was reading said the convoy was growing larger, although reporters at the scene said it was actually shrinking.Rocco had helped raise money for refu­gee families through Catholic Charities of Pittsburgh. He didn’t consider himself anti-immigrant. Nor did he think Trump’s views were significantly out of step with the country.“A majority of Americans are not anti-immigrant. They are anti-illegal-immigrant,” he said. But, he asked, “does anyone really believe that we should let all these people in?”The answer, he said, was to stop it “by any means necessary.”Julia saw Trump’s rhetoric on this issue and so many others differently. Earlier this month, the president had described the caravan as being full of criminals and “Middle Easterners” and warned that its approach was a “national emergency.”To Julia, such hysteria inflamed the worst passions in Americans. And now that hysteria has spilled into a synagogue in her hometown.“Can you support a Republican candidate and not support the fearmongering aspects of the party?” she asked on Monday, two days after the shooting. “It’s really hard. I personally would say no. But I can look at people like my parents. They are not hate-filled people. . . . This type of hate spewing is not who they are.”Julia never asked her father about his vote in 2016, and he never volunteered it. They talked often and avoided the topic.Rocco said he believed that Hillary Clinton was “dangerous” and that Trump would be better for the country. But in the privacy of the voting booth, he said, he pulled the lever for Clinton “for Julia’s sake.”On Monday, after telling a Post reporter who he had voted for, Rocco called his daughter.“It surprised me, too,” Julia wrote in an email after learning of his father’s decision two years earlier. “Although I am not surprised he prioritized family over politics.”That division healed, they both returned to the news of the day, refracted through the lens of Trump’s unconventional presidency and the nation’s unsettling politics.Julia blamed Trump. Rocco saw a larger problem. “There are people on both sides of the spectrum who can’t behave civilly, and that filters down to people,” Rocco said. “That’s why Trump was elected. People are just fed up.”"}