{"id": "Why it matters who governs America’s public schools", "paragraph": " Perspective  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  Does it matter who operates America’s public schools?That’s a central question in the national debate about education and the movement to find alternatives to school districts that are publicly funded and operated. While charter schools are publicly funded, they are privately operated and are not required in most places to be as transparent as publicly operated schools. The public also has little say in key operations of private and public schools that accept publicly funded vouchers.This post, written by Carol Burris and Diane Ravitch, looks at the issue of governance and why it matters who is in charge.Burris is a former New York high school principal who now serves as executive director of the Network for Public Education, a nonprofit advocacy group. She was named the 2010 Educator of the Year by the School Administrators Association of New York State, and in 2013, the National Association of Secondary School Principals named her the New York State High School Principal of the Year. Burris has been chronicling problems with modern school restructuring and school choice for years on this blog. She has previously written about problems with charter schools in California and other states.Ravitch, an education historian, became the titular leader of the movement against corporate school restructuring in 2010, when her book, “The Death and Life of the Great American School System,” was published and became a bestseller. An assistant secretary of education under President George H.W. Bush, she explains in the book that she dropped her support for No Child Left Behind, the chief education initiative of President George W. Bush and standardized-test-based school restructuring, after looking at evidence about how it was harming public schools.By Carol Burris and Diane RavitchAt a meeting of the California Charter Schools Association during the spring of 2014, Netflix founder and CEO Reed Hastings told the audience that the problem with public schools is that they are run by elected school boards. He contrasted this style of school governance with that of charter schools, governed by private boards, which operate beyond the reach of the people. Hastings justified the movement of school governance from public to private hands by claiming that the private boards of charter schools are more stable. This is an odd claim considering that 33 percent of all charter schools that opened in 2000 were closed 10 years later. By year 13, 40 percent were gone.Hastings acknowledged that the elimination of public control of public schooling, which had its beginnings in the early 19th century, would be met with community resistance. He therefore proposed an alternate plan to get the job done.“So what we have to do is to work with school districts to grow [charters] steadily, and the work ahead is really hard because we’re at 8 percent of students in California, whereas in New Orleans, they’re at 90 percent, so we have a lot of catch-up to do,” he said.The objective could not be clearer: Influence districts to expand their charter sector until eventually all, or nearly all, schools are privately operated and managed. Those district offices that remain could be filled not by educational leaders but by managers and technicians hired to ensure that buses run on time, schools are opened, closed or transferred to other operators, enrollment is managed, and funding is distributed. Public voice is stifled. Schools become publicly funded businesses.This plan, of course, is not theoretical. The Network for Public Education Action’s recent report, “Hijacked by Billionaires,” documents that Hastings has spent nearly $10 million on pushing charters through referendums or school board elections in Los Angeles, Washington state and New Orleans alone. Hastings is one of a larger group of the uber-wealthy who share the same vision.It is almost impossible to track all of the hundreds of millions spent by other billionaires such as the Walton family of the Walmart fortune, Arthur Rock, the family of Education Secretary Betsy DeVos, former New York mayor Michael Bloomberg, Doris Fisher of The Gap and former Enron trader John Arnold in their quest to elect school board members and policymakers who will undermine the public’s right to govern its schools.As the school choice movement grows, the governance of schools has become a topic of great interest beyond the billionaire class. Last month, the California nonprofit think tank Learning Policy Institute issued a report entitled, “The Tapestry of American Public Education: How Can We Create a System of Schools Worth Choosing for All?” The thesis of the report is that school choice — the movement to find alternatives to publicly funded and publicly operated school districts — is not an end in itself but rather a means to an end. In the words of the authors, it exists to “create a system in which all children choose and are chosen by a good school that serves them well and is easily accessible. “There is much in the report with which we agree. The authors acknowledge that for 75 percent of parents, their first choice is a neighborhood public school, and therefore such schools must be preserved. They recognized many of the problems associated with publicly funded but privately operated charter schools — high suspension rates, corruption and increased segregation — and insist such deficiencies must be addressed.What concerns us, however, was the report’s insistence that school governance doesn’t matter. The authors deny the negative impact that charter schools have on the viability of neighborhood public schools, the very schools they acknowledge the vast majority want. We know from experience that charter schools and vouchers drain finances and the students they want from the district public schools, causing budget cuts, teacher layoffs and larger class sizes in the schools that enroll the most children. Yet the report suggests that charter school caps should be removed, which is likely to further destabilize public schools.From the first recommendation of the report:“Debates that focus on questions such as how many charters a district should have are focused on adults and their preferences for school governance, rather than on the needs of children.”This claim is wrong. School governance directly affects the rights and well-being of students. Ask the students of the Delaware Academy of Public Safety and Security Charter High School, which was abruptly shut down just weeks after opening this September, leaving students scrambling to find a school. Or ask the students who were methodically pushed out of the Success Academy of Fort Greene in Brooklyn, which kept a “got to go” list, or the 6-year-old boy whose mother says he was pushed out of an Arizona charter because of his disability.Governance matters to a 4-year-old girl who attends Charter Day School in North Carolina. She is not allowed to wear pants to school because the charter school chain leader, conservative entrepreneur Baker Mitchell, bizarrely insists that his dress code promotes chivalry and protects the school from school shootings. There is no school board to which she can appeal. She can go only to the courts.It is, in our opinion, irresponsible to minimize the importance of democratic governance with a scolding, false claim that those who care about it are not concerned with the welfare of children. The authors would do well to read the resolution of the National NAACP, which called for a moratorium on new charter schools because of the way they destabilize public schools while they are not subject to the same accountability, oversight and transparency as public schools.[NAACP sticks by its call for charter school moratorium, says they are ‘not a substitute’ for traditional public schools]Of related concern is the report’s support for the “portfolio” model of school governance, specifically mentioning it as a strategy for school improvement. The phrase “portfolio management” was coined by charter advocate Paul Hill of the University of Washington to champion a system of publicly funded but privately managed charter schools.Portfolio management is based on a stock market metaphor — the portfolio manager is entrusted with retaining “good” schools while turning “bad” schools over to a charter or shutting the school down, the same way one would dump a bad stock. Districts that adopt the model consistently end up with more charter schools and fewer public schools by design. You can read more about how this model has taken over the schools of Indianapolis here.[What’s really going on in Indiana’s public schools]To push this model, a recently formed nonprofit, known as City Fund, is being heavily funded by Hastings’s foundation and the Laura and John Arnold Foundation. Both foundations have invested a fortune into transforming publicly governed schools into a marketplace of schools dominated by charter schools. As mentioned earlier, Hastings and the Arnolds have contributed millions to the campaigns of school board members, organizations and legislators who share that goal.Those who push the portfolio model point to Denver and New Orleans as examples of success, but they avoid talking about the dismal failures of the model in Memphis, Nashville and Philadelphia. Ironically, Chris Barbic, the architect and leader of Tennessee’s Achievement District, which produced abysmal results, is one of the leaders of City Fund.Public governance of our schools matters for the health of our democracy. The public school was designed to serve and promote the common good; it is paid for by the public, and it belongs to the public, not entrepreneurs. If governance is really no more than an adult preference, how long will it be before private and religious schools are included in the portfolio as well?In her thoughtful essay in the Atlantic, Amy Lueck traces the history of the American high school as a center and anchor for communities. She argues that school choice and the “charterization” of public schooling is putting that institution at risk. Lueck concludes with this warning:As an institution, the fate of the high school cannot be detached from the community of which it is a part. Like all educational institutions, it is inextricably wrapped up with the goals and values of the town, city, and nation in which it is located, reflecting and perpetuating them. Those values include Americans’ attitude to the very schools that would pass them along, too. If, as a nation, we decide that the public schools are a “dead end” for students, we should not be surprised if they become so—and along with them, the cities, towns, and communities they once built together.Billionaires live in an echo chamber of their own. As they jet across the globe to and from their many homes, the neighborhood school with its bake sales, homecoming dances and lively community elections are foreign and inconsequential. They believe that the role of the average woman or man is to be a consumer, not a decider.The Learning Policy Institute may be sincere in its desire to preserve public education and in its belief that school choice can be “reformed.” However, when it buys into the narrative that public governance of our schools does not matter, it is complicit in the agenda of those who seek to make public schools obsolete.-0-0-0-0-VS: (Correction: An earlier version said in my introduction to this piece that the public has no say in the operations of private and religious schools that get public funding. There are some public regulations that these schools must follow in most places.)"}