{"id": "SNL’s Pete Davidson hasn’t apologized for mocking a GOP candidate who lost an eye in war", "paragraph": "Pete Davidson of “Saturday Night Live” is facing mounting pressure to apologize for a widely condemned bit in which he mocked a wounded veteran and GOP congressional candidate for wearing an eye patch.Following Davidson’s remarks about Dan Crenshaw, who on Tuesday won his election to represent Texas’s 2nd Congressional District, the comedian, his show and SNL’s executive producer were hammered by politicians, talk-show hosts, veterans and others.“This is absolutely appalling,” tweeted Sen. Tammy Duckworth (D-Ill.), who lost her legs in Iraq. “No one should ever mock a Veteran for the wounds they received while defending our great nation, regardless of political party or what you think of their politics. Pete Davidson owes Dan Crenshaw an apology.”Former White House press secretary Sean Spicer said that SNL’s executive producer Lorne Michaels should be fired.Saturday Night Live mocked the appearance of a combat veteran that lost an eye on the battlefield. This was not funny in any way. They scripted it, rehearsed it, laughed at it, aired it and promoted it. VSOs should demand @nbcsnl head Lorne Michaels he fired #FireLorneMichaelsBut Crenshaw — who lost his right eye in 2012 after a bomb exploded during a mission in Afghanistan, his third military deployment — said he won’t ask for an apology from Davidson or SNL.“They probably should apologize, but that doesn’t mean I’m going to demand an apology,” he said Monday on “Fox & Friends,” adding: “They certainly crossed the line, but their apology won’t mean anything to me.”When asked about the matter on Sunday — and again on Monday — NBC representatives said the network would not be commenting.Davidson has not yet responded to the criticism.“They certainly crossed the line, but their apology won’t mean anything to me” -@DanCrenshawTX explains why he isn’t demanding an apology from SNL pic.twitter.com/mM7XttQIlhDespite being told he would probably never see again, Crenshaw, a Navy SEAL, regained sight in his left eye and went on two more deployments. “It’s actually a miracle I can see at all and can continue serving the American people,” he said on Fox.Davidson seemed to be aware of Crenshaw’s background during Saturday’s “Weekend Update” segment, in which he gave his “first impressions” of various candidates running in this election cycle.“This guy is kind of cool, Dan Crenshaw,” Davidson said, as an image of Crenshaw wearing an eye patch flashed on the screen.His co-host, Michael Che, chuckled and said, “Yo, come on.”“Hold on,” Davidson replied. “You may be surprised to hear he’s a congressional candidate from Texas and not a hit man in a porno movie.”The audience laughed.“I’m sorry; I know he lost his eye in war, or whatever,” Davidson added, shrugging and grinning. “Whatever.”[Utah mayor and father of seven killed in Afghanistan on fourth deployment]Online, scores of people have expressed anger over the sketch and demanded Davidson and NBC apologize.“Getting dumped by your pop star girlfriend is no excuse for lashing out at a decorated war hero who lost his eye serving our country,” Jack Pandol, a spokesman for the National Republican Congressional Committee, said in a statement that referenced Davidson’s much-publicized recent breakup with singer Ariana Grande.Eric Trump tweeted that NBC and SNL “should be ashamed of themselves . . . Thankfully, we have brave men & women like @DanCrenshawTX otherwise gutless cowards like #PeteDavidson wouldn’t have a desk to sit behind.”.@DanCrenshawTX is a war hero who has sacrificed so much for our country. Pete Davidson’s comments were abhorrent and SNL owes @DanCrenshawTX and all Veterans an apology. https://t.co/S7i26Boe4UThe Texas Republican Party called the bit “utterly abhorrent.”Rep. Peter T. King (R-N.Y.), another candidate who was mocked in Davidson’s sketch, said the jab at Crenshaw was a “disgrace” and indicated that the comedian should be booted from the show.“What are NBC’s standards for firing? PC to insult wounded vets?!?” King demanded, adding: “(Davidson also insulted me. Who cares?!)”I once asked @DanCrenshawTX what was behind his eyepatch. It was a glass eye with a gold Navy SEAL Eagle & trident logo. Such. A. Badass. pic.twitter.com/O6KHW7abR5“This is outrageous. It isn’t funny at all,” wrote Dana Perino, a Fox News contributor and former White House press secretary. Crenshaw, she wrote, “served his country — sacrificed for it — and now is willing to serve again as a Member of Congress (or whatever).”On Monday, “The View” hosts called it a “sucker punch,” a “tone deaf” statement and a “really crappy joke.”But Joy Behar said offensive humor is SNL’s “stock in trade” and that the show “doesn’t take any prisoners.”“They took a shot at Alec Baldwin, who is part of their family, so they go after a lot of people,” she said. “And this kid Davidson, his father died in 9/11, and he said, ‘I like making things of a dark, awkward — weird things that you don’t really find funny, funny. There’s nothing I won’t joke about, and I think it’s because of what happened to me.’\"So, I mean, he’s coming from a place of, you know, you make fun of things that are so painful to lighten the load. That’s where he’s coming from, I think.”Fellow SNL cast member Kenan Thompson also acknowledged the challenges that comedians are up against, but he said that Davidson “missed the mark.”“It’s tough when you’re fishing for jokes, like that’s how stand-ups feel — like there’s no real filters out there in the world when they’re trying to go for a great joke,” he said on the “Today” show. “But at the same time, when you miss the mark, you’re offending people. So you have to kind of like really be a little more aware, in my opinion.“He definitely missed the mark, and I think he was more so commenting on the fact that the joke maybe didn’t land as hard as he wanted to, as opposed to being like, ‘I don’t care about veterans.’ I think Pete’s a very humble dude, and he’s got a big heart. I don’t think he goes out to offend people. But stand-ups, they’re the ones that help us laugh through the most awful things in the first place, so they’re always fishing in weird places.”In a tweet over the weekend, Crenshaw acknowledged the overwhelming outrage over Davidson’s remarks.He didn’t demand an apology, but he did urge the show’s writers not to use injured veterans as “punchlines.”Good rule in life: I try hard not to offend; I try harder not to be offended. That being said, I hope @nbcsnl recognizes that vets don’t deserve to see their wounds used as punchlines for bad jokes.Crenshaw later told TMZ that he didn’t necessarily want an apology.“I want us to get away from this culture where we demand apologies every time someone misspeaks,” he said. “I think that would be very healthy for our nation to go in that direction. We don’t need to be outwardly outraged. I don’t need to demand apologies from them. They can do whatever they want, you know. They are feeling the heat from around the country right now, and that’s fine.”He added: “But I would like [Davidson] and ‘Saturday Night Live’ to recognize something, which is that veterans across the country probably don’t feel as though their wounds they received in battle should be the subject of a bad punchline for a bad joke. And here’s the real atrocity in all of this: It wasn’t even funny . . . It was just mean-spirited.”Appearing Monday morning on Fox, Crenshaw suggested that Davidson and his SNL colleagues consider pooling money together and donating to a veterans charity.On Tuesday, Crenshaw told supporters at his victory party that “it’s been an interesting last 72 hours for us,” adding that “I’m from the SEAL team so we don’t really get offended.”Read more:Kanye West praised Trump in a meandering speech on SNL. It didn’t air.In SNL’s cold open, Fox News hosts offer some thoughts on the migrant caravan. Spoiler alert: They’re not fans.The SNL season premiere was also obsessed with Pete Davidson and Ariana GrandePost Malone is the perfect pop star for this American moment. That’s not a compliment."}