{"id": "The federal hate crime law is both unconstitutional and unwise", "paragraph": "After showing off his swastika tattoo, Randy Metcalf became involved in a barroom brawl. One of his opponents was an African American, whom he and his friends knocked unconscious. Metcalf repeatedly kicked him in the head and, according to a witness, said, “Die, [n-word], die.” Metcalf was sentenced to 10 years in prison under the federal Hate Crimes Prevention Act that was enacted six years earlier, in 2009.Soon, perhaps at its conference this Friday, the Supreme Court will decide whether to hear Metcalf’s argument that the provision of the HCPA that he was convicted under is unconstitutional because none of the Constitution’s enumerated powers authorized Congress to enact it. The court should hear and endorse this argument, lest the nation’s dangerously attenuated commitment to limited government become even more so.The HCPA creates criminal penalties for, among other things, crimes committed “because of the actual or perceived race . . . of any person.” Actual hatred is not required. It is enough that the defendant acted “because of” somebody’s race.Congress, always eager to slip what little remains of the Constitution’s leash that limits Congress’s powers by enumerating them, frequently justifies doing whatever it wants by saying that the behavior it wants to proscribe or prescribe affects interstate commerce and therefore comes under Congress’s enumerated power to regulate this. But although the commerce clause has been construed to be so elastic that it is almost entirely permissive, Congress, perhaps manifesting a vestigial capacity for embarrassment, looked elsewhere for the power to prohibit racially motivated crimes.Embarrassingly, it pretended to act under the 13th Amendment. Ratified in 1865, it says:“Section 1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.“Section 2. Congress shall have power to enforce this article by appropriate legislation.”To justify enacting the HCPA, Congress cited the power granted to it 144 years earlier to effectuate the end of slavery, which shows no sign of returning. Congress, surely with more audacity than sincerity, said that the 13th Amendment, written to erase slavery, authorizes Congress to pursue any goal that it asserts is in some way, however attenuated, a response to a “relic” or “incidents” or lingering reverberation of slavery.This, says an amicus brief on Metcalf’s behalf, reflects “a growing movement in both academia and Congress to use the 13th Amendment to address a variety of social ills thought to be in some way traceable to, or aggravated by, slavery.” Yet the amendment’s legal significance is unusually clear and limited: It bans slavery, period. So, in 1883, the Supreme Court held that the amendment did not empower Congress to prohibit race discrimination in public accommodations. Congress did that 81 years later, properly acting under the commerce clause. If now the court allows Congress to construe — to flagrantly misconstrue, to its advantage — a notably unambiguous constitutional provision, the damage done by this misguided judicial deference will go beyond injuries to federalism. This dereliction of judicial duty will devalue the written Constitution itself.Hate crimes (usually vandalism, e.g., graffiti, or intimidation, e.g., verbal abuse) are a tiny fraction of 1 percent of all reported crimes. Almost all states have such laws, and a federal law duplicating them merely serves two disreputable purposes. It allows Congress to express theatrical indignation about hate. And it exposes to double jeopardy, under a federal law, defendants who are acquitted in politically charged state trials, especially ones involving race or religion.Even though states, unlike the federal government, have police powers, states’ hate crime laws also are problematic on policy grounds. They mandate enhanced punishments for crimes committed as a result of, or at least when accompanied by, particular states of mind that the government disapproves. The law holds us responsible for controlling our minds, which should control our conduct. The law always has had, and should have, the expressive function of stigmatizing particular kinds of conduct. But hate crime laws treat certain actions as especially reprehensible because the people committing them had odious (although not illegal) frames of mind. Such laws burden juries with the task of detecting an expanding number of impermissible motives for acts already criminalized. And juries must distinguish causation (a particular frame of mind causing an act) from correlation (the person who committed the act happened to have this or that mentality). So, even if the HCPA were not unconstitutional, it would be unwise.Read more from George F. Will’s archive or follow him on Facebook.Read more: Abigail Hauslohner: Hate crimes reports are soaring — but we still don’t know how many people are victimizedEditorial Board: Hate in America is on the riseEditorial Board: Trump retweets hateEditorial Board: Sessions should know prosecuting hate crimes against transgender people isn’t enoughThe Post’s View: A transgender high school student can graduate knowing he got justiceWe are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}