{"id": "How small donations gave underdog Democrats a fighting chance for the House", "paragraph": "M.J. Hegar was a long-shot Democratic candidate running to unseat a Republican incumbent who has held his House seat for 15 years. But her outlook brightened when she raised $750,000 over 10 days — an influx of cash that put her in contention for Texas’s 31st Congressional District just outside of Austin.It wasn’t just that Hegar, a tattooed veteran and mother, benefited from the wave of small, individual donations going to Democrats this election on the strength of anti-Trump sentiment.Her windfall was part of a carefully coordinated strategy behind the scenes by Democrats to increase the number of competitive House races nationally by attracting small-dollar donations to underdog candidates who otherwise would have been given little chance of success.Democratic candidates raised more money than Republicans in the 2018 midterms, particularly in small sums under $200. Strategists across the political spectrum point to their breakneck fundraising pace as a sign that the party could be well positioned to take control of the House this year.Republicans, too, have benefited from a surge in small-dollar donations, driven by loyal supporters of President Trump. The Republican National Committee raised $117 million in small contributions this election — more than half of its direct donations. That money, as well as millions from outside groups, has helped the GOP prop up struggling incumbents as the party seeks to retain its control of Congress.Nonetheless, Democrats raised more than three times as much money in small-dollar donations as Republicans despite lacking the centralized organization of the GOP, harnessing the trend to widen the midterm landscape and giving more of their candidates a fighting chance.“What Democrats’ money allowed them to do is expand the battlefield beyond the handful of most vulnerable Republican seats,” said David Wasserman, House editor of the nonpartisan Cook Report, a political handicapping website.As of October, Democratic candidates had outraised their Republican opponents in 53 of the 73 most competitive congressional races, including 20 districts that Trump won by double digits in 2016, according to a Washington Post analysis. Twenty-two contests became competitive after Democrats began heavily fundraising.For Abigail Spanberger, who is challenging Republican Rep. Dave Brat in Virginia’s 7th Congressional District, a buzzworthy debate performance led to a gush of cash. For Kristen Carlson in Florida’s 15th, it was an early endorsement from Emily’s List, which supports women who back abortion rights. For Nancy Soderberg in Florida’s 6th, campaign ads about health care caught donors’ attention. For Joe Cunningham in South Carolina’s 1st, the stunning primary loss of the three-term GOP incumbent signaled to donors that he might have a shot.[Democratic candidates for Congress have raised a record-shattering $1 billion this election]Joyce Abrams, 80, has donated this election through ActBlue, an online fundraising platform. Often, she said, it was in response to a solicitation from a Democratic candidate trying to cross a fundraising threshold, giving as little as $5 just to show her support.“In some cases, I’m really doing token giving. . . . Sometimes, it’s very important that there are numbers of people donating, as much as the amount,” said Abrams, a registered Democrat in southern Oregon.The amounts raised by first-time candidates in particular have upended fundraising expectations of political newcomers and underscored the intensity on the left — though Republicans note that being outraised does not matter if you are able to stay competitive and turn out your voters.“The Democrats’ ‘green wave’ is challenging,” Corry Bliss, executive director of Congressional Leadership Fund, a super PAC that supports House Republicans, warned donors last month in memos obtained by The Post. “But we don’t need to outraise the Democrats, we only need to raise enough to compete and turn out our voters.”The green wave was less an act of nature than the result of careful planning on the part of Democrats.Even before the primary season, Democratic strategists worked to prepare candidates for moments of national attention, and on how to capi­tal­ize on them.To assist in the effort, an “expansion” team of five Democratic Congressional Campaign Committee strategists tasked with widening the midterm map for the party crisscrossed the country, helping the campaigns quickly respond when a fundraising opportunity arose.In the case of Hegar, the committee recognized that the Purple Heart recipient’s story — from a violent childhood home, to a pilot in the Air Force, to a signatory on a lawsuit to end the ban on women in combat — could easily go viral. With a five-figure investment, the organization hired Democratic ad agency Putnam Partners to produce her 3½ -minute ad, “Doors,” which became the most-watched campaign video of the election, with 3 million views.The average donation the week after the video was released was less than $50 — a sign that her story resonated widely, her campaign said.“This is a story about doors, a lot of them,” Hegar says in narrating the video, outlining challenges that required her to be “opening, pushing, sometimes kicking through every door that was in my way.”[With blunt talk and compelling stories, viral videos are turning unknown female candidates into political sensations]A spokesman for the campaign of Republican Rep. John Carter, whom Hegar is seeking to unseat, said Hegar got a greater share of her donations from outside of Texas than Carter did.“She’s receiving more support from Californians than Texans. That is why her campaign has struggled so badly this fall. California donors love her ultraliberal agenda, but Texas voters don’t,” said Bruce Harvie, a Carter campaign spokesman.Democrats this year have been buoyed by ActBlue, a sophisticated online fundraising tool that made donating as easy as one click on a smartphone.Donations through ActBlue have surpassed $1.5 billion for the 2018 cycle, with $250 million raised in October alone, according to the organization. There were more than 3 million new donors this cycle, with an average contribution of $40.Users can choose from a menu of candidates and groups to donate to, and they have the option of donating to lists created by others, such as battleground candidates, female candidates or candidates who support “Medicare-for-all.”ActBlue and other groups have allowed donors to give on impulse — when they are angry with the president, frustrated by Congress or hopeful about a candidate’s ad message.“They read a Trump tweet, they see a video and they get really upset. They’re sitting there, and have 15 minutes before their next meeting. How does their intention turn into productive action in that short period of time?” said Ethan Todras-Whitehill, executive director and co-founder of Swing Left, which has raised $10 million for battleground House districts this cycle.Sonia Immasche, a 72-year-old Democrat in Fort Collins, Colo., said she gave money when she felt the most enraged.“Sometimes when I’m feeling particularly frustrated, I donate,” said Immasche, who has given through ActBlue. “What really fires me up is all the garbage that comes through in my emails and on Facebook, and occasionally on Twitter. . . . I want something meaningful to happen to our country and have it not be harmed further.”[Where the money is going in the final push before Election Day]Many Democrats have benefited from this emotion-driven giving.The fundraising success of Democratic challenger Amy McGrath has made the deep-red 6th Congressional District of Kentucky one of the most competitive races this fall.McGrath has raised nearly $8 million — a rare feat for a first-time candidate — which has allowed the campaign to build a ground game with a field office in each of the 19 counties in her district, and print new yard signs that were personalized for every county.But her operation also bumped up against the limits of what money can do. When it recently looked to place more television ads, the campaign found that there was no more airtime left to buy, said Mark Nickolas, McGrath’s campaign manager.When Democrat Joe Cunningham announced his campaign in the Charleston, S.C., area, he was considered a long shot in his deeply pro-Trump district.Then, the stunning loss of incumbent Mark Sanford to a Trump-endorsed Republican primary opponent catapulted his campaign. Small-dollar donations started flowing. Cunningham has raised $1.9 million, one-quarter of it in low-dollar amounts.“Every Democratic candidate in the country has been looking for a moment this year . . . to tap into that national small-dollar fundraising army that exists for Democrats,” said Tyler Jones, a general consultant for Cunningham’s campaign. “When we started to see an influx of fundraising, it made us all look at each other and say, ‘We can do this.’ ”"}