{"id": "Boris Johnson’s family is in row over Brexit ", "paragraph": " LONDON — A Brexit deal may be days, weeks or an eternity away, and it is tearing everyone apart — the people, the parties, even Boris Johnson’s family. The leader of the opposition Labour Party, Jeremy Corbyn, told the Germans in an interview published Friday that “we can’t stop” Brexit. His top lieutenants immediately went on television to say Corbyn doesn’t know what he is talking about. The Tories? They spent the weekend on the talk shows, trash-talking their prime minister, as factions threaten open revolt in Parliament this week.And the poor public? As hopelessly divided as ever, according to the hopelessly muddled opinion polls, which suggest that the people — who in 2016 narrowly voted in favor of Britain leaving the European Union — may have changed their minds and now support “Regrexit.”Get it? Then there is the Johnson family.The blond brood of mop-headed Oxford University overachievers whose best-known member is the former London mayor and former foreign secretary Boris Johnson — and the man who brought Britain Brexit — has suddenly emerged as the country’s symbol of tumult over its departure from the continental trading bloc.The Johnson clan is in full public churn — for and against Brexit, and one another.There is intrafamilial tweeting, people.Johnson wants a clean break from the E.U. No second thoughts. No compromise. When he quit Prime Minister Theresa May’s cabinet in July, he wailed that May was surrendering to Brussels in Brexit negotiations and that Britain was “headed for the status of a colony.”Younger brother Jo Johnson was also part of May’s cabinet, as transport minister, and he echoed some of Boris’s sentiment when he resigned in a huff on Friday. May’s plan for Brexit was simply too much of a shambolic compromise, he said. She was presenting Britain with a choice between “vassalage” to E.U. rules or the “chaos” of a no-deal Brexit — think food shortages and grounded aircraft.Except, unlike his brother, Jo Johnson voted to “remain” in the 2016 Brexit referendum. And what he wants next is a do-over. “It is imperative that we now go back to the people and check that they are content to proceed on this extraordinary basis,” he said.The editorial board of the Financial Times, where Jo Johnson toiled as an editor and correspondent before running for public office, called him “the serious Mr. Johnson,” as opposed to the bombastic Boris.The elder Johnson, for his part, cheered his brother on, saying that though the two disagree over Brexit, his sibling was right to take a hike.“Boundless admiration as ever for my brother Jo,” Johnson posted on Twitter a few hours after the announcement. “We may not have agreed about Brexit but we are united in dismay at the intellectually and politically indefensible of the U.K. position,” which he said “does not remotely correspond to the mandate of the people.”Jo Johnson’s exit from Brexit was also given props by his father, the author and former British politician Stanley Johnson, who shares the family’s gift of understatement, declaring that May’s Brexit plan was “careering into the jaws of death.”Stanley Johnson has experienced his own wrenching reversals over Brexit. After voting to remain in the European Union in the 2016 referendum, he later announced that he had changed his mind.“The time has come to bail out,” Stanley Johnson decided in 2017. This even though the elder Johnson had had his bread long buttered in Brussels, serving as a Tory party member of the European Parliament and as head of European Commission’s Environment Action Program.Will it ever end? Apparently, no.Rachel Johnson, a broadcaster and book author and sister of Boris and Jo, was tweeting on Monday that “the problem with Brexit is Brexit.” Rachel is a “remainer.” So much so that she left the familial perch in the Conservative Party for the Liberal Democrats in 2017 in opposition to Brexit.And then there’s brother Leo Johnson, a broadcaster and megatrends expert. Leo would prefer to remain in the E.U., too. He also supports a second referendum, a “People’s Vote” that would allow citizens to tick “yes” or “no” on May’s final deal — or no deal — with Brussels.On Friday, Rachel retweeted Leo, who retweeted her after she retweeted their brother’s resignation message on Twitter.This family feud has not escaped notice.“Wow,” the Guardian newspaper columnist John Crace tweeted. “Looking like 4-1 in favour of second referendum in Johnson household with only one brother and the mother yet to declare.”That tweet, too, was retweeted by Rachel. “Maybe way to settle this matter once and for all is to spare the country another one and simply have a referendum in the Johnson family then,” she wrote.Read moreBrexit bankroller Arron Banks faces criminal probe over referendum campaign paymentsQueen Elizabeth breaks silence on Brexit — in a very queenlike wayTheresa May just warned of a ‘no-deal Brexit.’ Here are some of the doomsday scenarios.Today’s coverage from Post correspondents around the worldLike Washington Post World on Facebook and stay updated on foreign news"}