{"id": "Republicans are scared of Stacey Abrams. They should be.", "paragraph": " ATLANTA By engaging in voter suppression, Stacey Abrams’s opponents are paying her the highest possible compliment.The former Democratic minority leader of the state House of Representatives, Yale Law School grad and the first African American woman to be nominated by a major party for governor is so close to winning that Republicans seem to think the only way to stop her is to keep thousands from casting ballots.And it happens that her GOP opponent, Brian Kemp, is the secretary of state, the man overseeing this election. He made clear to his supporters that the thing worrying him most is . . . a lot of people voting.Kemp’s recent comments on the subject were recorded at a ticketed campaign event and leaked to Rolling Stone. He expressed alarm at the success of Abrams’s campaign in generating “an unprecedented number” of absentee ballots, and that this was “something that continues to concern us, especially if everybody uses and exercises their right to vote — which they absolutely can — and mail those ballots in. We gotta have a heavy turnout to offset that.”Rarely have citizens received such a direct lesson in the power of democracy.Abrams, who has spearheaded efforts over the years to mobilize new voters in a state undergoing rapid demographic changes, is not surprised. “I think they’re shocked to find that this is a dead heat,” Abrams told me in an interview. “If we turn out unlikely voters, if we turn out those who aren’t typically seen as part of the midterm electorate, then I will win this election.”She criticized Kemp at a debate on Tuesday for leaving 53,000 voter registration applications “pending,” in most cases because of a law requiring that the names on applications exactly match those on other government documents. “The reality is, voter suppression is not simply about being told no,” Abrams said. “It’s about being told it’s going to be hard to cast a ballot.”Abrams’s identity would make her election historic. But her campaign also matters because she represents the growing strength of a pragmatic style of progressivism that could transform the politics of states long cast as conservative bastions.Despite Kemp’s predictable efforts to paint Abrams as radical, she is proud of her record of working with Republicans to secure incremental victories. In a speech Sunday at a union hall here, she ticked off some of them: “funding for kinship care for grandparents who were raising grandchildren,” “more money into public transit than at any time in 30 years” and a new program for returning veterans.“I am a progressive with Georgia values,” she said on her campaign bus, which has traveled to some of the most Republican counties in the state. Her strategy is twofold: stepping up turnout among Democratic voters who normally skip midterms and cutting GOP margins in their own areas from, say, 80-20 to 70-30 or less.“People who want to make a good living need good jobs, and that means you have to work with business if you want to be progressive,” she said. “And [when] you live in a state where Republicans control every mechanism of politics, then you’ve got to be able to work with everyone. And the ability to work with everyone is sometimes cast as being moderate. I consider it pragmatism. I can’t win by myself.”Like Democrats elsewhere, Abrams is making health care a major theme, promising to embrace the Affordable Care Act’s Medicaid expansion, which the state has rejected up to now. This appeals not only to low-income voters who would finally get health insurance (“You are not too poor in Georgia for us to serve you,” she said at her rally) but also to rural counties that have faced hospital closures.The polls show a contest that’s virtually tied — and could go into a December runoff if a Libertarian candidate pulls enough votes to deprive either Abrams or Kemp of a majority.Today’s efforts to roll back black political participation are often described as the end of the Second Reconstruction represented by the Civil Rights era. But Abrams has an answer to the forces of reaction. “We have to always be vigilant about the retrenchment, but we’ve got to be even more aggressive about the progress,” she said, “because the further ahead we get, the harder it is to drag us back.”On Nov. 6, Georgia’s voters will decide how big a leap they want their state to take. It will help a lot if all of them have the chance to cast ballots.Read more from E.J. Dionne’s archive, follow him on Twitter or subscribe to his updates on Facebook.Read more:Charles Lane: Good for Stacey AbramsJennifer Rubin: A Stacey Abrams win in Georgia may rewrite the political rule book for DemocratsThe Post’s View: Georgia’s voter suppression problem goes much deeper than Brian KempE.J. Dionne Jr.: The hidden costs of the GOP’s deficit two-stepPaul Waldman: Republicans may be about to steal an election in GeorgiaWe are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}