{"id": "Electric scooter giant Lime says it recalled scooters amid fears that some could catch on fire", "paragraph": "Lime, one of the nation’s largest electric scooter companies, pulled thousands of its scooters off the streets this summer after discovering that a small number of them may be carrying batteries with the potential to catch fire, according to company officials.The company said in a statement Tuesday that it learned of a risk in August that a “manufacturing defect” in some of its scooters “could result in the battery smoldering, or in some cases catching fire.”The statement came in response to questions from The Washington Post about Lime’s scooters catching on fire. Though company officials said in an interview that Lime recalled about 2,000 scooters, they said the risk of smoldering and fires was real in only a tiny percentage of cases. The company said it took off the streets the much larger number out of an abundance of caution.“All vulnerable scooters were quickly removed from circulation, minimally impacting service to our Los Angeles, San Diego and Lake Tahoe markets,” the company said in the statement. “At no time were riders or members of the public put at risk.”[Class-action lawsuit accuses e-scooter companies of ‘gross negligence’]At the same time, the company acknowledged it may face continuing challenges. It said it has received an unconfirmed report that another scooter model it uses “may also be vulnerable to battery failure.”And it said that, in an unrelated issue, it is exploring whether some of its scooters “can sometimes break when subjected to repeated abuse.” The company said it’s possible for these scooters “to crack or break if ridden off a curb at high speed.”Before Lime’s statement Tuesday, some employees raised concerns internally about whether the company was doing enough to address safety risks with its scooters, according to a Lime mechanic speaking on the condition of anonymity out of fear of retribution for commenting publicly. The mechanic provided images of internal Slack messages in which another employee also raises concerns.“I feel that these scoots, or the product as a whole, should be removed from the market until they are safe to handle and operate,” the other employee wrote in the “mechanics” slack room. “I get that the scoots are expendable and replaceable, but are we now resigned to say the same for the safety of employees and customers?”On one occasion, the fire department was summoned to the company’s Lake Tahoe facility in August after a scooter burst into flames, according to a department report.Like much of its competition, Lime has raced across the country in recent months, depositing its vehicles in dozens of cities. Scooter start-ups have become powerful forces at the local level, pushing city officials to rewrite regulations with promises of valuable data-sharing and less traffic.But the companies’ rapid growth has come at a price, according to critics. Emergency room physicians have reported an uptick in severe injuries — including head trauma and broken bones — since electric scooters appeared on streets across the country. Critics have raised concerns that some scooter companies have failed to properly maintain their vehicles, most of which were designed for personal and not widespread public use.[Scooter use is rising in major cities. So are trips to the emergency room.]In response to criticism, the scooter industry has emphasized that safety is its top priority and that cars cause far more deaths and injuries than scooters.“Scooters are a new mode of transportation and Lime, together with the micro-mobility industry, remains committed to ensuring everyone knows how to ride safely,” Lime said in the statement.Lime said the battery issue concerned a brand of scooter manufactured by the mobility company Segway Ninebot. Segway did not respond to requests for comment. Lime said some of the welding surrounding the battery may have had weak spots, causing the batteries to short.External cases that hold Lime scooter batteries often sustain damage from vehicles hitting the ground and colliding with objects. While saying he’s unable to make a determination without examining the battery directly, Tim Ellis — a metallurgical engineer whose company, RSR Technologies, specializes in recycling batteries — said that damage could make a lithium ion battery more prone to catching on fire.“Anything you do that mechanically juggles, vibrates, bangs or runs into things will absolutely enhance the possibility of failure,” Ellis said. “The box the battery is in looks really heavy. That suggests it can handle a huge amount of damage, but at some level everything breaks.\"Inside the company, some employees have been worrying about the safety of its products for months.In an interview, the Lime mechanic described sharing fears with managers that the people who Lime pays to recharge scooters in their homes overnight — known as “juicers” — may not be aware of the risk of fire.The employee cited an internal Slack messages provided to The Post in which a Lime manager instructs an employee to retrieve a “code red” scooter — shorthand for the scooters with the battery defect — from a juicer’s home in August. When the juicer refused to hand over the vehicle, the manager instructed the employee to “warn him that it’s urgent,” but did not mention the threat of fire.“These people are plugging these scooters into their house at night and going to sleep thinking they’re safe and that they just earned an easy $15,” the employee said. “When I asked my managers if we were going to tell them, all I got was shrugged shoulders and ‘I don’t know.'\"Lime did not comment on the mechanic’s assertion, but said in its own statement that going forward Segway Ninebot scooters will be charged only at Lime’s “scooter storage facilities” and would “no longer be available to Juicers for after hours charging.” The company said it is also staffing global charging facilities 24 hours a day with employees trained to handle “these particular batteries.”The only known case where a Lime scooter caused a fire was at the company’s Lake Tahoe facility on Aug. 27. By the time the fire department arrived, a flaming electric scooter had been blasted with a fire extinguisher and placed in a back parking lot, according to the fire department’s incident report.The vehicle was still smoking, the battery periodically re-erupting in flames, the report states, its fumes filling the air with an acrid chemical stench.A night employee told investigators the fire began with “a loud bang,” prompting the employee to walk inside a “scooter repair room,” where he witnessed “flames showing from the battery area of a scooter as well as an adjacent chair,” according to the incident report.The fire prompted the fire department to tell the company to remove all scooters suspected of having faulty batteries to the parking lot “to ensure that there wouldn’t be another scooter fire inside the building.”Correction: An earlier version of this story misstated the day when Lime issued its statement. "}