{"id": "U.S. missionary shot and killed in front of wife and son amid escalating Cameroon crisis", "paragraph": "An American citizen was shot and killed in Cameroon on Tuesday, said Indiana Gov. Eric Holcomb and a church in the state.In a statement, the governor’s office said the victim, Charles Wesco, was working as a missionary in Cameroon. His brother, Timothy Wesco, serves in Indiana’s House of Representatives.Dave Halyaman, assistant pastor at Believers Baptist Church in Warsaw, Ind., which sent Wesco and his family on its mission to Cameroon, told The Washington Post that the church “is grieving greatly the murder of Charles Wesco, but we are also trusting God that he has a purpose in all of this.” The congregation’s senior pastor is Wesco’s father-in-law, he said.The family was living in a suburb of Bamenda, a major town in Cameroon’s northwest Anglophone region, Halyaman said.Unrest broke out in that region in late 2016 over complaints that the Anglophone community was being marginalized by Cameroon’s central government, which is largely controlled by French speakers. The country is bilingual, but Francophones have historically held more governmental power than English speakers. Security forces stifled peaceful protests in the Anglophone regions, and an armed separatist movement emerged. Around 400 civilians have been killed in violence in the country’s two Anglophone regions. Tens of thousands have fled the country as refugees and others are now internally displaced.Halyaman said that Wesco, his wife and one of their sons were traveling with another missionary to go shopping on Tuesday morning when at least two shots were fired, striking the windshield and hitting Wesco twice. “He was unconscious,” Halyaman said, adding that Wesco was taken to a nearby clinic for treatment, then transferred to a hospital in Bamenda where “doctors attempted to resuscitate him but were unsuccessful.”Halyaman described the area they were in as having “a lot of high weeds.” On social media, some placed the blame on government troops and others on armed separatists, but Halyaman said it was not immediately clear who shot at the vehicle.Cameroonian Defense Minister Joseph Beti Assomo released a statement saying that “a group of terrorists” shot at Wesco’s vehicle around nine miles from Bamenda, striking him in the temple. Security forces tracked the group, the statement said, then engaged in crossfire with them, killing four. A U.S. State Department official confirmed to The Post that an American citizen died in Bamenda on Tuesday but did not offer further details.Doctors Without Borders, the international aid group that goes by the initials MSF, told The Post in an email that “an MSF ambulance transported the man” who died in Bamenda, and that he died at a hospital supported by the group.The Wesco family’s website described a deep calling for mission work, which Charles and his wife, Stephanie, wrote intensified in 2014. They had arrived in Cameroon this month. “While this is a terrible tragedy and we want the perpetrators to face justice, we are trusting God that He is going to do something good through all of this, though we just really don’t know what it would be,” Halyaman told The Post. “There’s no telling why he was singled out and shot. There’s just no way to tell at this point.”Read moreCameroon is spiraling further into violenceAfrica’s next civil war could be in Cameroon"}