{"id": "Kanye West says he’s distancing himself from politics: 'I’ve been used to spread messages I don’t believe in’", "paragraph": "The past several months have been quite the wild ride in the land of Kanye West news. His comments about slavery being a choice, calls to abolish the 13th Amendment and outspoken admiration for President Trump, much to the chagrin of many of his fans, all came to a head with his bizarre, televised Oval Office meeting with the president earlier this month.Just this weekend, he had been credited with designing the logo for shirts connected to “Blexit,” a call for African Americans to leave the Democratic Party that has been championed by Candace Owens, the spokeswoman for the pro-Trump organization Turning Point USA.Now, West is apparently cutting off all political ties. In tweets posted Tuesday, he seemingly attempted to retreat from many of the claims, statements, social media snippets and interviews that have characterized his public persona in recent months.“My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in,” he tweeted. “I am distancing myself from politics and completely focusing on being creative !!!”My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!Perhaps the tipping point came this weekend. That’s when the “Blexit” merchandise was unveiled during Turning Point USA’s Young Black Leadership Summit.\"Blexit is a renaissance and I am blessed to say that this logo, these colors, were created by my dear friend and fellow superhero Kanye West,” said Owens, an activist in the pro-Trump Internet, according to Page Six.But West tweeted that he didn’t actually design the logo and he wants nothing to do with “Blexit.”I introduced Candace to the person who made the logo and they didn’t want their name on it so she used mine. I never wanted any association with Blexit. I have nothing to do with it.Before tweeting about the “Blexit” drama, West fired off messages about the current state of his political stances.I support creating jobs and opportunities for people who need them the most, I support prison reform, I support common-sense gun laws that will make our world safer.I support those who risk their lives to serve and protect us and I support holding people who misuse their power accountable. I believe in love and compassion for people seeking asylum and parents who are fighting to protect their children from violence and war.It’s unclear what prompted the sudden tweeting, but he seems to imply that his family and friends — who support his “ACTUAL beliefs” — might be involved.I would like to thank my family, loved ones, and community for supporting my ACTUAL beliefs and my vision for a better world.West has long been prone to public outbursts. But it felt a little different at a concert in 2016 when he surprised his fans by claiming that he would have voted for Trump — if he had voted at all. He also stormed offstage during another concert.Days later, he was hospitalized for stress and exhaustion at the Ronald Reagan UCLA Medical Center in Los Angeles, and the remainder of his tour dates were canceled.West remained out of the spotlight for a while, even deleting his Twitter account. He returned to the social media platform in April to announce several albums. He also said he was writing a philosophy book titled “Break the Simulation,” only to later reveal that the philosophy book was actually his tweets.Among these tweets was one that read “I love the way Candace Owens thinks.” Owens, who once used the social media handle “Red Pill Black,” has argued that the media has brainwashed black people to vote for Democrats.During the same period, West appeared to again express support for Trump, tweeting a photo of a signed red “Make America Great Again” hat. He even released a song in which he and rapper T.I. debate West’s admiration for Trump.West also used the cover of his “Ye” album to express that he had bipolar disorder, though he later told the president in their White House meeting that he had been misdiagnosed.But perhaps the most provocative thing West did in the past few months was imply during an interview with TMZ that slavery was a choice made by the enslaved.“When you hear about slavery for 400 years — for 400 years?” West said. “That sounds like a choice. Like, you was there for 400 years, and it’s all of y’all? It’s like we’re mentally in prison.”"}