{"id": "Three Girl Scouts picking up litter killed in ‘tragic and senseless’ hit-and-run", "paragraph": "Desktop notifications are on   | Turn off Get breaking news alerts from  The Washington Post Turn on desktop notifications?The Girl Scouts from Chippewa Falls had adopted the hilly, rural stretch of County Road P in western Wisconsin, so, with trash bags in hand, they dutifully picked up litter Saturday afternoon, tunics and sashes supplanted by lime-green safety vests.Suddenly, a speeding Ford F-150 veered off the road into a ditch where three girls and an adult chaperone were performing community service. The two-ton pickup slammed into the Scouts, visiting tragedy on the town of 14,000 before speeding off.Two girls and a chaperone were killed on the roadside, according to the Lake Hallie Police Department, which is investigating. One girl died later at a hospital. A surviving Scout was in critical condition. Authorities have not released the identities of the victims.Colten Treu, 21, who is also from Chippewa Falls, later surrendered to police, authorities said. Investigators haven’t said what caused him to drive off the road. He was jailed Sunday and charged with four counts of homicide through the negligent use of a vehicle.The rest of the community was left to come to grips with a sudden, almost unfathomable loss.[Boy Scout seeking shelter from storm killed by falling tree at camp in Georgia]“A tragic and senseless act that happened earlier today in Hallie involving a Halmstad Girl Scout troop has us all asking Why?” the Nokomis Service Area Girl Scouts said in a Facebook post Saturday, on a page that had days earlier been used to inform families about how their daughters could earn outdoor merit badges or remind the troop about Camp Nawakwa Shirt Friday.“Today Nokomis suffered a tremendous loss. It is with profound sadness that we join together in mourning the tragic loss of our Girl Scout sisters.\"💔💚 pic.twitter.com/m16HY7oMrC“Our hearts are broken for the girls and families of the Girl Scouts of the Northwestern Great Lakes,” Sylvia Acevedo, chief executive of Girl Scouts of the USA, said in a statement Sunday.[A Girl Scout wrote to companies with a heartfelt request. As a result, they cut down on millions of plastic straws.]It was the third tragedy in the greater community of Scouts in less than five months.On Sept. 30, Boy Scouts on Long Island were headed to a hike when the group was slammed into by a suspected drunk driver, according to New York ABC affiliate WABC. Killed in the crash was Andrew McMorris, 12, a seventh-grader who had just started taking flying lessons and hoped to one day earn his Eagle Scout badge.And in June, a 14-year-old Boy Scout taking shelter from 50 mph winds at a jamboree in northern Georgia was crushed in his tent. Another Scout, just a few feet away, wasn’t injured.In Wisconsin, the school, the community of Scouts and most of Chippewa were preparing to attend a memorial at 6 p.m. Sunday at the elementary school the three girls who were killed attended.The next day, officials announced, grief counselors will arrive.Read more: Boy Scouts drop the ‘boy’ as they welcome girls to Scouts BSA‘I couldn’t move my arm or my fingers’: 5-year-old trick-or-treater tests positive for methAn 8-year-old tried selling water for a trip to Disneyland. A white woman threatened to call police.She said a dreadlocked man snatched her toddler. Then police found bloody clothes in her home. Sign up for email updates from the \"Confronting the Caliphate\" series.  You have signed up for the \"Confronting the Caliphate\" series. "}