{"id": "Trump promises to stop the migrant caravan. But his administration struggles with how to do it.", "paragraph": "President Trump’s attempts to pin political blame on Democrats for a caravan of thousands of Central American migrants headed toward the United States have obscured growing concern within the White House over how to manage a potentially unprecedented massing at the southern border.Trump and his aides have ­convened high-level emergency meetings in an effort to mount an effective response to halt the loosely organized group of men, women and children, which is moving slowly through Mexico. The primary focus has been on pressuring Mexican authorities to disperse the migrants, but the president also has been imploring aides to develop a more forceful plan to keep the group from entering the United States, said several administration officials with knowledge of the deliberations.“They will not be successful getting into the United States illegally no matter what, under any circumstance,” Secretary of State Mike Pompeo told reporters this week, saying he had spoken twice with his Mexican counterpart, Luis Videgaray, since they met in Mexico City last week.It remained far from clear when the caravan, which remains highly fluid and disorganized, would reach the United States. A day after the United Nations estimated the group at 7,200, Mexican officials said Wednesday that it was about half that size, at 3,630, and added that they had processed more than 1,700 refu­gee claims.The caravan, which originated in Honduras, is traveling primarily by foot, which means its arrival at the U.S.-Mexico border could be weeks away. With no formal leadership, the group also could thin out and break up along the way, experts said, with a portion of the migrants choosing various paths: remaining in Mexico, taking alternative routes, or giving up and heading home. That would make the situation more manageable for U.S. authorities.“The goal is maximum pressure on Mexico,” said one Trump administration official, speaking on the condition of anonymity to describe sensitive talks.“I think we’ll know in the next 48 hours if they’re going to do something or not,” said the official, emphasizing that the migrants will be increasingly difficult to turn back as they move deeper into Mexico.But Roberta Jacobson, who served as U.S. ambassador to Mexico from June 2016 to this past May, noted that President Enrique Peña Nieto has just a month left in office. The incoming administration of leftist Andrés Manuel López Obrador has said it wants to focus on the promotion of development in Central America, not border enforcement tactics.“Obviously, there’s not much incentive to do something truly radical that’s going to be highly unpopular, as more forceful measures would be,” Jacobson said.Senior Trump administration officials have expressed alarm over the images this week of the migrants breaking past a security gate in northern Guatemala and streaming over a bridge, with some jumping into and wading through a river, to enter Mexico.Trump said the scene amounted to “heartbreak on both sides” and added that it “spells out to Congress: Something has to be done. You can’t have this happen.”Although the size of the caravan remains relatively small compared with the total number of unauthorized immigrants arrested each month at the southern U.S. border — more than 50,000 were taken into custody in September, according to the Department of Homeland Security — the arrival of thousands in a single group, with a phalanx of international reporters in tow, could create a humanitarian challenge and a political crisis for the White House.It also could become a potent leverage point if Trump makes good on threats to force a partial government shutdown in a fight for funding for his border wall during the lame-duck congressional session after the midterm elections.Democrats cautioned that Trump was fanning public fears by exaggerating the threats posed by migrants; the president has acknowledged that he has seen no evidence to support his public assertions that potential terrorists are in the caravan.Amy Pope, who as deputy homeland security adviser in the Obama administration helped coordinate an emergency response to a surge of unaccompanied minors in 2014, said the Central American caravan is not a national security threat.“This is not people attacking the border,” she said. “They are presenting themselves [to Border Patrol agents] and making a case for asylum. I think the best solutions are ones where we are working with Mexico to come up with a way to manage the identification of people who should get asylum.”Trump’s response so far, she added, was “more about messaging and politics” to rally his conservative base ahead of the midterms.In Twitter messages this week, Trump has suggested that he is considering sending military troops to the border and cutting financial aid to Guatemala and Honduras, and possibly Mexico, for failing to halt the caravan. Up to 2,100 National Guard troops have been deployed to the border mission in support roles after the president authorized the move in the spring, though it is unclear whether Trump is eyeing adding more guardsmen or using other military assets.Officials at the State Department and Pentagon said this week that they have received no new directives from the White House.Behind the scenes, senior administration officials acknowledged that such moves would have minimal effect in stopping the overall flow of Central Americans.In the fiscal year that ended last month, U.S. authorities arrested a record 107,212 Central American family members at the southern border, obliterating the previous high of 77,000 in 2016. Experts said the surge has been driven by deteriorating conditions in Honduras, El Salvador and Guatemala, including gang violence, organized crime, poverty and hunger.[Migrant caravan: Why thousands of Central Americans are walking to the border]But Trump aides blamed U.S. laws for being too lenient in allowing the Central American families to remain in the United States and said the only solution to blunt the spiking border numbers would be for Congress to amend the laws to speed up deportations.Under the law, families and unaccompanied minors from countries that do not border the United States are offered greater legal safeguards than those from Mexico or Canada. In most cases, after applying for asylum, they are released into the interior of the country while awaiting a hearing before an immigration judge — a process that can take more than a year because of massive backlogs.“The administration wants the ability to return whole Central American families, and also minors, after apprehension,” one senior administration official said during a background briefing with reporters. Doing so, the official added, would send a strong deterrence message that would dissuade others from attempting a costly and dangerous journey.“If we could do that, there is no border crisis,” the official said.But humanitarian groups disputed that strategy. In 2000, roughly 95 percent of the immigrants apprehended at the border were from Mexico, most of them single men seeking employment, according to DHS officials. Last month, nearly 50 percent of the immigrants taken into custody were from Central America, most of them families with children, the officials said.Wendy Young, executive director of Kids in Need of Defense, said the federal laws were enacted to offer greater safeguards to these vulnerable populations.“The immigration system can’t be one-size-fits-all,” she said. Josh Dawsey, Dan Lamothe and Carol Morello contributed to this report. "}