{"id": "We are more united than we imagine", "paragraph": "Let’s use this year’s elections to insist that there is still a “we” in our country. It is a “we” that crosses the lines of race and gender, country of origin and religion. “We” is the very first word of our Constitution. Declaring that it is still alive is essential to keeping our democratic republic.As a nation, we are not as divided as we seem to be. And we do not have to be as divided as we are. Paradoxically, the best way to begin bringing us back together is to divide government in Washington by giving Democrats control of the House of Representatives and (admittedly a longer shot) the Senate.An avalanche against President Trump and his party would be a shout from Americans who have had it with an approach to politics that depends for its success upon misdirection, division, hatred and fear.The best indication that we are closer to one other than mounds of data to the contrary might suggest is the desperate nature of Trump’s demagogic campaigning in the twilight of this bitter struggle. Why has he invented a border crisis and unpatriotically deployed our military for purely partisan purposes? Because he has had to conjure anxieties most Americans are not feeling.Day after day, he has ratcheted up his rhetoric and told lie after lie because nothing he has done in office has brought the country to his side. His best approval ratings have consistently shown that a majority is against him. His worst approval ratings show that majority to be overwhelming.Even among his supporters, many know there is something badly defective about his approach to leadership. A Public Religion Research Institute poll released last week found that 69 percent of Americans see Trump as having damaged the dignity of the presidency. The same proportion said they would like it if his speech and behavior were more consistent with the conduct of other presidents. On that question, 57 percent of Republicans agreed.Further evidence that we are more united than we imagine is the extent to which conservative Republicans lack the courage of their convictions. They are not even trying to make a case for their worldview because they know that most of us reject right-wing positions on taxes, health care and regulation.Republicans know they have failed to convince  Americans that Obamacare should be repealed. So they falsely pretend that they would protect the insurance coverage of those with preexisting conditions.Their one major legislative achievement, a huge corporate tax cut, has gained no traction with voters outside the boardroom. So the GOP is hoping that the president’s incendiary rhetoric encourages everyone to overlook how its greatest exertions have left those whom Trump called the “forgotten” feeling as forgotten as ever.What has long been true is still true: We have a healthy mistrust of government but still count on it to make our lives better. We know that in many spheres, the market alone will not guard us from hazard. We also know it won’t invest in the public goods essential for all of us to thrive.Notice what is happening in the key industrial states that swung Trump’s way in 2016. Democratic Sens. Sherrod Brown of Ohio, Robert P. Casey Jr. of Pennsylvania, Debbie Stabenow of Michigan and Tammy Baldwin of Wisconsin appear on their way to robust victories.As for governorships, Democrats will hold Pennsylvania’s and have decent shots in Ohio, Michigan and Wisconsin, which are held by the GOP. Many of the blue-collar voters who backed Trump two years ago in protest were never taken by his extreme selfishness or his relentless immigrant-baiting. They are poised to send him a message.And could there be any better response to Trump’s racial demagoguery than electing two new African American governors, Stacey Abrams in Georgia and Andrew Gillum in Florida? Both are Democratic standouts this year, and the fact that their contests are so close tells us that Trumpism is not our future.The signal here, amid all the noise Trump is generating, is that Americans yearn for a very different style of politics. But their plea will get through loud and clear only if they vote in large numbers to say we will not allow Trump and his party to build virtual political walls in the heart of our nation, separating us by our backgrounds, our races or our faith.Through our ballots, we can send forth a forceful and joyous “we.” It’s our right. It’s also our obligation.Read more from E.J. Dionne’s archive, follow him on Twitter or subscribe to his updates on Facebook.Read more:E.J. Dionne Jr.: Forget left and right. This is what will determine the midterms.Alexandra Petri: These racist appeals do not work on me, because I am not racistGreg Sargent: Trump floats a new absurdity to support his latest hate narrativeSusan Estrich: Don’t let Trump get away with his racist adCatherine Rampell: Republicans’ closing argument: Be afraid, be very afraidWe are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}