{"id": "California faces one more day of critical fire danger while its air quality is in the tank", "paragraph": "The end is in sight for California’s hellacious fire weather threat, but one more day remains in which active blazes will be difficult to contain, and new ones could erupt. At the same time, a suffocating plume of smoke fills the air in many parts of northern and central California, which will take some time to disperse.In northern California, where the catastrophic Camp Fire became the state’s most destructive blaze on record, conditions conducive to fires are easing. The National Weather Service reports it’s still bone-dry, but winds have begun to relax, and by Tuesday, the fire risk is expected to return to normal.[The weather and climate behind the California infernos that wrecked Paradise and torched Malibu]But in Southern California, where the Woolsey Fire has charred nearly 92,000 acres, the Weather Service describes a “very volatile environment favorable for rapid fire spread/growth” through Tuesday. In some areas, the relative humidity percentages are expected to dip into the single digits while winds roar down the mountain slopes at 30 to 40 mph, gusting even higher.Red-flag warnings are in effect through Tuesday for very rapid fire growth and extreme fire behavior. These dangerous conditions could even linger into Wednesday morning. After that, winds are forecast to decrease.Even as the fire conditions are no longer as severe in northern California, the Camp Fire is only 25 percent contained and is pumping out a thick veil of smoke.[As Camp Fire death toll climbs, investigators face grim task of finding remains]Many areas around Sacramento and San Francisco are experiencing unhealthy air quality as a result. San Francisco reported an air quality index of 164 at noon Monday, which is “unhealthy” or code red. Sacramento’s level was 177, also in the unhealthy range.Air quality was forecast to remain in this unhealthy range in both cities Tuesday.Here is a sampling of webcams this morning showing another smoky start to the day. Many air quality stations are in the unhealthy category. Do your best to mitigate smoke impacts. Here is a great resource from the CDC https://t.co/BQ1w3FrniH pic.twitter.com/xDjZWMSBOV“Try to limit outdoor activity and check on sensitive groups,” the Weather Service office in Sacramento said.The Weather Service said that because of a strong temperature inversion in the Sacramento Valley, the smoke may be trapped there for several more days.Why is it so smoky in the Central Valley? An inversion cap is acting like a lid, keeping the wildfire smoke from rising, while the mountains prevent it from moving horizontally, trapping it in the area. #cawx #CampFire pic.twitter.com/AvCvXljgdKNext week, weather models are advertising an auspicious pattern change for the entire state, with back-to-back rain events leading into Thanksgiving. This should help put out lingering fires and clear the air of the noxious smoke."}