{"id": "Josh Norman doesn’t know Redskins history", "paragraph": " Perspective  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  Sports columnist Thomas Boswell was asked in his weekly online chat about Redskins cornerback Josh Norman’s criticism of Washington fans for failing to support the team at FedEx Field. Please tell Norman, the reader wrote, “to ‘encourage’ rather than ‘slam’ his hometown fans. How loud do you think the boo birds will be at the next FedEx Field game?”Boswell: Norman obviously has little or no sense of Skins history over the last 25 years, especially the 20 years of the Snyder era. Many fans have felt that they were driven away from rooting for the home team because of bad performance by the players or bad behavior (of many types) by team executives or owner Daniel Snyder. At the least, there are many fans who are, with good reason, “quick to turn” when things go badly because they have been burned so often before.The type of player that epitomizes this era is the overhyped, overpaid SnyderSkins Fake Superstar, whether that is Albert Haynesworth or the long line of past their prime “stars” like Donovan McNabb, late-career Deion Sanders . . . I was going to make a list, but it is just too long and depressing.Here’s the irony: Norman does not realize that he is one of these overhyped, overpaid Snyder-toy guys! Just a few weeks ago, national TV analysts were pointing out his deficiencies in pass coverage and how other opposing teams picked on him. Norman has been adequate this season — not, as some say, the Skins' “third-best cornerback.” But he needs to understand that with two interceptions this year and none last year, he is an example of exactly why Skins fans boo the players that they associate with Snyder-era mistakes. For every fan it’s a different list of players who seem tarnished or symptomatic of this period. Alex Smith is a perfect example. Those who miss Kirk Cousins will bemoan Smith’s limitations and wish for Wonderful Kirk to return. Those who were glad to see Kirk and his drama leave town may be miffed that Smith hasn’t done more to prove them right that No Cousins could be overcome.It’s a tough situation for the Skins, and has been for several years at FedEx because the only people that fans can boo are the players. But they (in most cases) really want to boo Snyder and team president Bruce Allen. The players think, “Our fans are against us.” It’s far closer to the truth just to say that many fans are FedUp at FedEx and take it out on any target of opportunity when things go badly.And, of course, general declining interest also opens up tickets for fans of the visiting team to show up and cheer.None of this is going to change fast. But, as this questioner points out, 6-3 is 6-3, so give some credit. Yes, even in a year when one game ends with the opponent, trailing by three points, hitting the goal post with a last-second field goal attempt while, the next week, the Skins hit a goal post and the kick is good.[Svrluga: Redskins players have every reason to be frustrated. Redskins fans have even more.]Norman’s criticism of Redskins fans prompted another question. Does a player, this reader asked, “ever benefit when he (or she) criticizes the team’s fans for being insufficiently supportive at home, particularly when that player is one of the team’s highest paid and has performed unevenly over the past few years? Is it frustrating that FedEx lacks the home field advantage that RFK once held? Sure. But I’ve always been of the view that fans pay for their tickets and are entitled to “boo” as long as they check the expletives and control their alcohol intake.” Boswell: All fans, as you say, have the right to express themselves as long as they aren’t drunken louts. More to the point with the Skins, entering this year, they had the 25th-best — or, put another way, the eighth-worst — record in the NFL over the previous 25 years. That is an eternity of bad football, even though the Skins — thanks to their fans — have had enormous resources to spend on players (and coaches) in this period. To rub salt in that wound, the Skins have not had even one really good year or even one really outstanding season in all that time!From ’72 through ’91, the Skins had 10 teams with a winning percentage of .688 (11-5) or better. Ten. Since then, in 26 seasons, how many Skins teams have had a winning percentage of .688 (11-5 or better)? Zero! None!From 10 in a span of 20 years to zero in 26 years.Josh needs to study those numbers and “internalize” the reality of the team he plays for. That way, if things go poorly and the Skins end up 8-8 (or whatever) and miss the playoffs and Norman has a couple of bad games, perhaps he won’t become the face of the unraveling.BTW, Norman gave one of the most intelligent, engaging, not boastful, one-on-one postgame interviews I’ve heard this season after Sunday’s game. When he has a mob of 15 or more reporters in his face beside his locker after games it seems to bring out his inner egotist and exaggerator. When he has a little more room to breathe, he’s a lot more likable. Everybody knows that defensive backs, like Major League Baseball closers, have to have tons of self-confidence, often a form of extreme athletic arrogance, to survive in their job. But I suspect the “real” Norman — not the amped-up desperate-man-on-an-island that he must become during games — is somebody most fans would like. Of course, he didn’t help himself with his current comments.Read more on the Redskins:D.J. Swearinger agrees with Josh Norman, doesn’t ‘feel the loyalty’ from Redskins fansJosh Norman slams Redskins fans after road win: ‘They just boo everything’Hail or Fail: Redskins' incredible streak without a lead chance is now nine gamesThese Redskins have a winning strategy: Keep it simple and let the other team loseRedskins' win over Bucs didn’t look pretty, but it passes the smell testTakeaways from Washington’s 16-3 win at Tampa Bay"}