{"id": "GOP’s responses to the elections in Florida exacerbate concerns about voter suppression", "paragraph": " Analysis  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  Recounts are underway in three Florida races after the margin of votes separating the candidates was small enough to trigger a recount according to state law. Republicans lead in the biggest races — the gubernatorial and Senate contests — and that’s prompting GOP officials and lawmakers to line up with their partisan allies and cry foul.Those cries, in the absence of evidence to back up any allegations of voter fraud or other wrongdoing, are dredging up fears that the votes of primarily people of color will not be properly counted. Concerns about protecting the right to vote of people of color have existed since some states put laws in place after the passing of the 15th Amendment, which guaranteed black men the right to vote. These anxieties increased in 2013 after the Supreme Court ruled against upholding what is considered the crux of the Voting Rights Act.Though there is no evidence of foul play, President Trump suggested that some ballots shouldn’t be counted. He has gone as far as to say that the Republican candidates should simply be able to assume the seats.The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!And days after the election, GOP Senate candidate and current governor Rick Scott accused liberal activists of trying to steal the election from him.“Every Floridian should be concerned there may be rampant fraud happening in Palm Beach and Broward counties,” he told reporters Thursday at a news conference. “No ragtime group of liberal activists or lawyers from D.C. will be allowed to steal this election from the voters in this great state.”And Sen. Marco Rubio (R-Fla.) has been accused of not wanting every ballot counted — something he denies — after he posted numerous tweets attacking the officials overseeing the ballot count in Broward County, an area with a sizable percentages of people of color who support Democratic candidates.JUST IN: Facing criticism from Pres. Trump, Sen. Rubio, Gov. Scott and other Republicans, Palm Beach Co. supervisor of elections says it's “unfortunate” that they “are trying to disrupt our democracy because they don’t like the demographics of our voters.” https://t.co/WgZYvQ3yud pic.twitter.com/ngnsNYnUKvFears about the integrity of elections in Florida in particular have existed since at least 2000, when the Supreme Court stopped a recount, thus allowing President George W. Bush to win the election. That anxiety resurfaced even before Election Day.There is voter suppression happening in Florida right now and it’s not being reported. I’ve talked to families who’ve had multiple people request vote-by-mail and never received the ballot. Students studying in another state, people in other counties who didn’t receive ballots.Hours-long waits to vote in predominantly black neighborhoods in the Miami area have prompted some to believe that powerful Republicans were trying to discourage people of color from casting their ballot for Tallahassee Mayor Andrew Gillum (D), who would be the state’s first black governor, and incumbent Senate Democrat Bill Nelson.Similarly long wait times in Georgia in some predominantly black neighborhoods were also particularly noteworthy considering the dynamics of the governor’s race in that state: Democrat Stacey Abrams was seeking to become the first black woman in the country to hold that office. Republican Brian Kemp — also the secretary of state, who oversees elections — had been dogged by allegations that he was taking official actions to suppress minorities’ votes.The Washington Post’s James Hohmann reports that Scott is forging ahead with plans for his Senate office, hiring staffers and meeting with Senate Majority Leader Mitch McConnell (R-Ky.) to discuss committee assignments.While turnout in this year’s midterm election appeared to have broken records, doubts about the fairness of the system could proliferate in the wake of the Florida recount controversy and Republicans' insistence on moving quickly.Voters from demographics that historically don’t turn out for midterm elections, including millennials and people of color, were energized to have their say on whether Trumpism is truly the political ideology they want to see govern the country. The mass shooting at a high school in Parkland, Fla., and the influx of Puerto Ricans to the state after Hurricane Maria were expected to — and ultimately may have — increased the turnout rate in Florida. But regardless of the results, the situation in Florida threatens to lead some people who prioritized voting to conclude that their vote actually doesn’t count."}