{"id": "Florida official indicted on murder charge after state rejects ‘stand your ground’ claim", "paragraph": "Desktop notifications are on   | Turn off Get breaking news alerts from  The Washington Post Turn on desktop notifications?A city official in central Florida has been charged with second-degree murder after a fatal shooting at a military surplus store he owns, authorities said.In indicting Lakeland City Commissioner Michael Dunn on the murder charge, a grand jury effectively rejected Florida’s “stand your ground” law as a possible defense for the commissioner’s actions, though the argument that Dunn acted in self-defense will probably appear again in court, officials said.On Oct. 3, police responded to Dunn’s business, the Vets Army and Navy Surplus store in Lakeland, where Dunn said a man had attempted to steal a small hatchet, according to a statement by the Lakeland Police Department.That alleged shoplifter, 50-year-old Christobal Lopez, was found at the entrance of the store with gunshot wounds and pronounced dead at the scene, police said.According to police, Dunn said Lopez had come into the store with his father, then attempted to take and hide a hatchet while the father was making a purchase.“Dunn stopped Lopez asking him if he was going to pay for the item and a confrontation ensued,” police stated. “Dunn then fired his weapon, striking Lopez, who was still in possession of the hatchet.\"Police said they interviewed Dunn, Lopez’s father and two employees who were working at the store at the time.On Oct. 15, police also released several surveillance videos from the military surplus store showing Dunn grabbing onto the left sleeve of Lopez’s shirt as he tries to leave through the store’s entrance.Moments later in the video, as Lopez is seen gripping the handle of the door, Dunn raises a gun and shoots Lopez in the upper left torso. Lopez falls facedown on the ground, while Dunn moves to the right, partly obstructing the view of what happens next in the video.However, soon afterward, Lopez’s body stops moving. As Dunn steps outside, a pool of blood can be seen forming beneath Lopez’s body. On the ground, just to the upper right of Lopez’s body, is a small hatchet.Dunn is being held at the Polk County Jail on no bond, officials said. He was taken into custody Friday from his attorney’s office and was cooperative, Lakeland Police Chief Larry Giddens told reporters.Dunn’s attorney, Rusty Franklin, did not immediately respond to a phone call and a message sent through his website requesting comment Saturday. However, Franklin previously told other local news outlets that Dunn was justified in shooting Lopez because Lopez was “wielding an ax.”On Friday, Franklin told WTSP News that he would continue to “vigorously assert Mr. Dunn’s lawful right of self-defense.”\"This situation was commenced and started not by Michael Dunn,” Franklin told the news station. “Someone made a choice to shoplift.”According to CNN, a probable cause affidavit stated that, as Lopez and Dunn struggled, the hatchet fell down Lopez’s pant leg. Lopez reportedly offered to pay for the hatchet but then tried to flee the store, police said.“At no time did the victim appear to have made any threatening movements towards the suspect,” the affidavit stated, according to CNN.Dunn’s actions were not justified by Florida’s stand-your-ground law, Brian Haas, the state attorney for the 10th Judicial Circuit of Florida, said at a news conference Friday.The law gained notoriety and national attention after an attorney for George Zimmerman considered using it to say his client was justified in shooting 17-year-old Trayvon Martin in Sanford, Fla., in 2012. Under the statute, a person is justified in using deadly force if he or she believes it is necessary to “prevent imminent death or great bodily harm to himself or herself or another or to prevent the imminent commission of a forcible felony.”“There’s been so much discussion on the facts of this case and the application of the stand-your-ground law,” Haas said. “I fully anticipate that those issues will be brought before a judge for a hearing. But let me be clear: It is the policy of my office to comply with and abide by the stand-your-ground law. However, I have determined that this case and the actions of Mr. Dunn fall outside the protections of the stand-your-ground law.”Haas said Dunn’s position as city commissioner had no bearing on his decision to take the case to a grand jury.“What I can tell you is that the grand jury carefully considered the evidence that was presented to it, and they did their job, and that’s what we’re going to go forward on,” Haas said. “[Dunn] was an owner of a store who, through this set of facts, this killing happened. It’s not something that we see every day.”According to his city bio, Dunn took office as a commissioner in January and represents Lakeland’s southwest district. He served as chairman of the Lakeland Code Enforcement Board and graduated from the Lakeland Citizens' Police Academy.Police described Lopez as a transient, according to the Tampa Bay Times. His sister, Veronica Lopez, told the newspaper he was not a violent person.“My brother didn’t need to be killed like some animal,” she told the Times.Giddens, the police chief, defended the lengthy investigation of the case, saying the department submitted a complaint affidavit to the state attorney’s office only nine days after the shooting.“The process was one which was handled with the utmost care, as all investigations must be,” Giddens said in a statement Friday. “Although this investigation may have taken longer than some would have liked, we had an obligation to do it right, and that is what we will always do to ensure the citizens of this community can continue to have the faith and confidence in us that we have earned in these past several years.”Correction: A previous version of this story incorrectly stated Michael Dunn was arrested Oct. 3. He was arrested Oct. 19. A previous version of this story also incorrectly stated George Zimmerman used Florida’s stand-your-grand law to justify his fatal shooting of Trayvon Martin. Though Zimmerman’s attorney considered using that statute as a defense, he ultimately did not.Read more:In ‘classic stand-your-ground case,’ Fla. sheriff says an Uber driver killed a man threatening him‘Who did this?!’: Someone put googly eyes on a historic Georgia statue. Police want answers.Man charged in ’stand your ground’ killing has history of gun threats, prosecutors say Sign up for email updates from the \"Confronting the Caliphate\" series.  You have signed up for the \"Confronting the Caliphate\" series. "}