{"id": "UEFA warns clubs over financial abuses after Man City leaks", "paragraph": "MANCHESTER, England — Previously concluded Financial Fair Play cases could be reopened, UEFA warned on Monday as evidence grows of Manchester City’s attempts to disguise its source of income and spending.The UEFA statement on the prospect of the financial compliance system being “abused” by teams comes after internal correspondence exposing City’s alleged deception was published by European media outlets.The reigning English Premier League champion and current leader has not provided a defense or disputed the authenticity of the information from leaked emails which reveal elaborate attempts over several years to try to avoid breaching the rules designed to curb overspending on player costs.City, which has been owned by Abu Dhabi’s Sheikh Mansour for a decade, has already been punished for violating FFP after reaching a settlement agreement with UEFA in 2014 that saw it fined rather than banned from the Champions League.Having spent more than a week declining to comment on the information in the “Football Leaks” documents, UEFA has issued a response to questions about City that raises the prospect of new sanctions.“Should new information suggest that previously concluded cases have been abused, those cases may be capable of being re-opened as determined on a case by case basis,” UEFA said. “This approach is applied universally to all clubs that apply for a UEFA license and participate in European club competitions.”The agreement with UEFA eventually saw City forfeit only 20 million euros ($23 million) in Champions League prize money. UEFA has not said how aware it was in 2014 of City’s plans to hide spending of more recent schemes, which have been reported in a five-part series by German magazine Der Spiegel.“FFP is a framework which clubs that wish to play in UEFA competitions agree to abide by,” the organizer of the Champions League and Europa League said in a statement. “It relies on the cooperation of clubs to declare a complete and genuine financial position. While UEFA can test the information it receives, it relies on that information being fair and accurate reflections of a club’s finances.”The title sponsor of City’s stadium, training campus, and jersey backer is Etihad Airways, the state-owned airline from Abu Dhabi. Sheikh Mansour is a member of Abu Dhabi’s royal family and deputy prime minister of the United Arab Emirates.The leaks emails claimed to show in 2015 how the Etihad deal generated 67.5 million pounds annually for City. But City’s holding company — state-backed Abu Dhabi United Group — channeled 59.9 million pounds back to Etihad, according to Jorge Chumillas, the club chief financial officer in an internal email.The evidence could be significant for UEFA which checks clubs’ finances annually to ensure they are meeting break-even requirements on a rolling three-year basis.“This includes a thorough assessment of clubs’ financial positions on the basis of both the information disclosed by the clubs (based on their independently audited financial statements) as well as a number of compliance checks and analysis undertaken by UEFA (including independent external audits),” UEFA said. “If new information comes to light that may be material to this assessment, UEFA will use that to challenge the figures and will seek explanation, clarification or rebuttal from the club concerned.”Abu Dhabi United Group was also alleged to be sending cash to a shell vehicle which was created to supposedly buy the right to use players’ images in marketing campaigns. This helped raise revenue by 30 million euros in one case cited by Der Spiegel, which reported City’s emails from 2013.City has not commented on its use of the Fordham Sports Management image rights company or attempts to shift costs away from the club.Roberto Mancini, who managed City from 2009-13 and won the Premier League in 2012, was also shown to have received more pay from a team Sheikh Mansour owns in Abu Dhabi than from the Manchester club. Der Spiegel shows Mancini signed two contracts at the same time, to receive a base salary of 1.45 million pounds from City and 1.45 million pounds and 1.75 million pounds for advising Al Jazira Sports.Since July 2011, UEFA has monitored the annual accounts of all clubs entering its two club competitions. The first period UEFA assessed clubs for compliance with FFP was 2011-13 when owners were allowed to cover losses up to 45 million euros.UEFA requires clubs to approach break-even on football-related business — television rights fees, buying and selling players, salaries, sponsor deals, tickets sales, prize money. The complex accounting rules encourage clubs to spend on long-term projects — stadiums, youth training — which do not count as losses for FFP purposes.“Financial Fair Play has led to a step change in the health of the finances in European club football,” UEFA said on Monday. “Seven years ago, European clubs had a cumulative debt of 1.7 billion euros. Last year it was a profit of 600 million euros. Without question, it has been a success for the game across Europe.”Qatar-owned Paris Saint-Germain was sanctioned for overspending in 2014 at the same time as City. The Spanish soccer league last year asked UEFA to investigate City and PSG, claiming they benefit from state aid which “distorts European competitions” and “is irreparably harming the football industry.”___More AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_SportsCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}