{"id": "In death, Saudi writer’s mild calls for reform grew into a defiant shout", "paragraph": "When he began his self-imposed exile to Washington last year, Jamal Khashoggi described himself simply as one “independent journalist using his pen for the good of his country.” With his brutal killing in Turkey this month, the Saudi journalist became much more: the Arab world’s loudest dissenter and an international symbol for the cause of free expression.In their effort to silence the 59-year-old writer, Saudi officials eliminated a domestic nuisance who had angered the country’s de facto ruler, Crown Prince Mohammed bin Salman. In the process, however, they touched off a temblor of global outrage that would shake the kingdom and strain relations with its most important allies.After two weeks of denials, the Saudi government acknowledged early Saturday that Mr. Khashoggi had died violently inside the country’s diplomatic consulate in Istanbul, while claiming that the death resulted from an argument and fistfight. A government statement announced the arrests of 18 Saudis, the firing of five top officials and a plan to overhaul the country’s intelligence agencies — to be overseen by Mohammed.[Read Jamal Khashoggi’s columns for The Washington Post]Yet, if anything, the admission appeared only to further amplify Mr. Khashoggi’s criticisms of the Saudi government. Senior U.S. lawmakers of both political parties expressed skepticism Saturday over the Saudi explanation for his killing, and Rep. Adam B. Schiff (Calif.), the ranking Democrat on the House Intelligence Committee, demanded in a Twitter post that “The Kingdom must be held to account.” Sen. Lindsey O. Graham (R-S.C.) tweeted: “To say that I am skeptical of the new Saudi narrative about Mr. Khashoggi is an understatement. . . . It’s hard to find this latest ‘explanation’ as credible.”Ironically, Mr. Khashoggi had never sought to be a disrupter and instead, as a lifelong member of the Saudi political establishment, had been an advocate for modest reform within the system. Refusing to be labeled a “dissident,” he argued simply that his fellow Arabs deserved the “right to speak their minds without fear of imprisonment,” as he wrote in a Washington Post column in April.Up until his death, he firmly believed that such reforms were within reach, even in Saudi Arabia, friends and former colleagues said.“This was Jamal: He had a never-ending hope that changes could happen, and that Arabs could lead the way,” said Maggie Mitchell Salem, a former State Department official and Middle East specialist who became a lifelong friend.“In killing him, it’s like they killed more than a man,” she said. “They killed a vision of what Arab media and society could be like.”Mr. Khashoggi spent his life straddling uncomfortable boundaries between occupations and interests that often seemed in conflict.He was a lifelong journalist who also moved easily within the highest circles of Saudi politics, and sometimes served as a spokesman and adviser to senior government officials. He was a supporter of political Islam who at times sympathized with the Muslim Brotherhood, the transnational Sunni Muslim movement that is now outlawed in Saudi Arabia. Yet he was a strident critic of Islamist extremism, and he spent his later years championing liberal causes such as women’s rights and freedom of expression in Muslim societies.Early in his journalistic career, in the 1980s and 1990s, he became famous for his repeated interviews with Osama bin Laden, and he wrote admiringly in those days about the wealthy Saudi whose U.S.-backed mujahideen militia was fighting the communist government of Afghanistan. But he later broke sharply with bin Laden over his embrace of terrorism, and he became one of the Arab world’s most vociferous critics of ­al-Qaeda after the Sept. 11, 2001, attacks.“The most pressing issue now,” he wrote in a 2002 essay, “is to ensure that our children can never be influenced by extremist ideas, like those 15 Saudis who were misled into hijacking four planes that fine September day, piloting them, and us, straight into the jaws of hell.”He considered himself to be a fierce Saudi patriot, friends say, though he embraced the West and was frequently critical of his country’s rulers and policies. He met freely with officials and operatives from foreign intelligence agencies, including those of the United States and other Western countries, but sought no favors and “carefully avoided compromising his journalistic integrity,” according to a former U.S. intelligence official who met frequently with him over two decades.“He believed in working within legal parameters” to improve conditions in his country, said the official, who insisted on anonymity in describing his agency’s information-collection efforts. “He also believed that the United States could be a force for good in Saudi Arabia.”[Crown Prince Mohammed bin Salman’s ‘dark’ and bullying side]His seemingly contradictory stances earned Mr. Khashoggi legions of opponents and critics. Some Arab dissidents distrusted him because of his close ties with senior government officials, such as Turki al-Faisal, the Saudi prince and former ambassador to Washington, for whom Mr. Khashoggi once worked as a media adviser. But over time, it was the Saudi establishment that turned on the journalist, moving first to shut down his publishing platforms in the Arab peninsula, and then to crush him.His chief offense: speaking out boldly about the problems he saw at home, said Hisham Melhem, a columnist for the Lebanese newspaper An-Nahar and longtime acquaintance of Mr. Khashoggi.“He was offended by the corruption he saw, and he pushed for a degree of political empowerment for Saudi citizens,” Melhem said. For Saudi Arabia’s leaders, “that put Khashoggi in the category of misfits and troublemakers.”Born in the Saudi holy city of Medina, Mr. Khashoggi grew up without wealth in a middle-class Saudi family with Turkish ancestry. He did have numerous important familial connections to the upper echelons of Saudi society. His grandfather was a physician to the royal court. His uncle, Adnan Khashoggi, was an international arms dealer who briefly became a figure in the Iran-contra scandal of the 1980s. He was a first cousin of Dodi Fayed, the Egyptian film producer who was dating Britain’s Diana, Princess of Wales, at the time of their fatal car crash in Paris in 1997.Khashoggi studied business administration at Indiana State University and managed bookstores in Saudi Arabia before venturing into journalism. He covered conflicts in Afghanistan, Algeria and Sudan for the Saudi Gazette and later would rise to the top ranks of Saudi newspaper writers and opinion-makers. But it was his advocacy of democratic reforms — most notably in the wake of the Arab Spring uprisings — that won him notoriety abroad and deep distrust within the inner circles of the Saudi elite.“He was always drawing my attention,” said Yasin Aktay, an adviser to Turkey’s ruling AKP party who frequently engaged with Mr. Khashoggi during panels and conferences. “After the Arab Spring, he was very prominent in discussions, because, while his country was anti-Arab Spring, he was pro-Arab Spring, and promoting democratization movements. He thought the Arab Spring was a historical chance for the Arab world.”Friends say Mr. Khashoggi had a complex view of the Muslim Brotherhood and other political Islamists, particularly in his later years. He believed that democracy in the Middle East was impossible unless moderate Islamists were allowed a voice, acquaintances said, but also he disdained extremism, and his social leanings were decidedly secularist.“His idea was that we shouldn’t be an enemy to them,” said a Saudi friend who requested anonymity because of the risk of official retaliation. “It’s wasn’t his mentality. He was more liberal, more Western.”In part because of his deep connections to Turki, the former ambassador, and to billionaire Saudi Prince Alwaleed bin Talal, Mr. Khashoggi managed to rise to increasingly prominent positions in the Arab media world, only to find his path blocked by more conservative Saudi officials who objected to his political views. He was twice appointed as editor of the influential Saudi daily ­al-Watan but was quickly fired both times — once after just three months on the job.In 2015, he was named founding director of a new all-Arab satellite news channel, al-Arab, bankrolled by bin Talal. After four years of preparations, the broadcaster went on the air on Feb. 1, 2015, from a lavish studio in the World Trade Center in Manama, Bahrain. But the station quickly ran into trouble when it aired, during one of its first shows, a segment that featured a Shiite dissident critical of Bahrain’s violent crackdown on Arab Spring protesters four years earlier.Bahraini officials halted all programming that same day, citing technical difficulties. Al-Arab would never come back.Afterward, the man who was twice fired from newspaper jobs for allowing the expression of dissenting views seemed genuinely surprised that the TV project was shut down, said Salem, his Washington friend.“His goal was to create a first-rate media outlet with the highest standards, in Arabic, because it was important to him that Arabs could access this kind of information,” she said. “He felt that the people in power would keep their word. He said, ‘They told me it would be protected.’ ”For some of Mr. Khashoggi’s friends and colleagues, the question that has reverberated since his disappearance and killing inside a Saudi consulate is simply: Why? Why should the mild criticisms of a gregarious, well-connected Saudi citizen so enrage the country’s crown prince?“That’s the question,” the Saudi friend said. “You have four or five people in London that were far more dangerous for the government than Jamal. From the beginning, I was really surprised.”One obvious contributing factor, some say, was the dramatic power shift in Saudi Arabia since Mohammed’s assent to power. Previously, Mr. Khashoggi’s main patrons in the government were members of the al-Faisal branch of the royal family, including Turki and Prince Khalid al-Faisal, who was the journalist’s boss while he served as editor at al-Watan. But over the last two years, many of his backers were sidelined, and some were arrested by the crown prince, who has cracked down on all forms of dissent while also liberalizing certain aspects of Saudi society and culture.After Mr. Khashoggi was barred last year from writing his weekly column in Al-Hayat, a Saudi-owned newspaper based in London, the pressure inside his own country became unbearable, friends say. His wife — his second — sued for divorce, citing the increasing risk to his adult children — two daughters and two sons — and Mr. Khashoggi moved into a condo in McLean, Va., in the Washington suburbs. Soon afterward, he accepted an offer to become a regular contributor to The Post’s “Global Opinions” column.“I’m under so much pressure from family members and friends to stay silent. But this isn’t right,” he explained in a text message to Karen Attiah, the section editor who recruited him. “We have enough Arab failing states. I don’t want my country to be one, too.”His Post columns, translated into English, gave Mr. Khashoggi a powerful new platform and a vastly larger global audience. Yet many Saudi dissidents remained suspicious, and some resisted his efforts to recruit them for a new pro-democracy foundation he talked of launching.“Jamal used to work for the government for the last 30 or 35 years, and because of that, he was away from dissidents,” said Omar Abdulaziz, a 27-year-old Saudi activist in Canada who runs a popular YouTube channel. “When he left the country and decided to criticize the Saudi government, the majority of them were saying, ‘You know what? Maybe Jamal is a spy.’ ”[Secret recordings give insight into Saudi attempt to silence critics]Yahya Assiri, a London-based activist who runs the ALQST human rights organization, said he also was skeptical when Mr. Khashoggi phoned him one day to see if he was willing to help.“You used to be pro-government, and now you want to work with us,” Assiri recalled telling Mr. Khashoggi. The journalist replied that he had been supportive all along but had sought to work within the system — an option that was no longer tenable for him.“I completely support your demands, when you demand democracy, when you demand human rights,” he quoted Mr. Khashoggi as saying. “But I was trying to do this reform from inside the country, from inside the regime.”While writing his Post column, Mr. Khashoggi continued to lobby friends to help him launch his new foundation, which he had tentatively decided to call Democracy for Arab World Now, or DAWN, to be jointly based in the United States and Turkey. He also turned his efforts to online activism, funding a project to build what he called a “bee army” to counter pro-government trolls on social media platforms such as Twitter. He put up $5,000 of his own money to help buy foreign SIM cards for mobile phones, to be assigned to users in Saudi Arabia who were critical of the government but afraid to link their Saudi numbers to their Twitter accounts, activists said. About 200 SIM cards have already been assigned.In late September, he met friends in London to discuss his various plans. Then he flew to Istanbul to deal with a bit of unfinished personal business: obtaining paperwork from Saudi Arabia that would allow him to marry his fiancee, Turkish doctoral student Hatice Cengiz.On Oct. 2, he entered the Saudi Consulate to pick the document up in advance of the couple’s marriage, planned for the following day. He was never seen again.His death would become a global media sensation, in part because of the brutal fashion in which he was killed, according to accounts leaked over the following days by Turkish officials, who said he was tortured and dismembered inside the consulate.For Arab colleagues, the gruesome details bore echoes of previous slayings of writers and dissidents whose hands and fingers were mutilated to send a warning to others who might dare to pick up a pen to criticize the powerful.“The symbolism is deliberate: If you write with your right hand, your right fingers would be cut off, or burned in acid,” said Melhem, the Lebanese journalist.“For us, Jamal is the last in a long train of journalists, artists and scholars to be killed in the Arab world,” he said. “It has been done mostly with impunity — until now.”"}