{"id": "Yelling ‘Heil Trump!’ during ‘Fiddler on the Roof’ seemed like a good idea while drunk, man says", "paragraph": "A man who caused panic at a Baltimore theater by shouting “Heil Hitler!” and “Heil Trump!” during a showing of “Fiddler on the Roof” has apologized, explaining that the outburst was his ill-conceived attempt to protest President Trump’s immigration policies.“I was trying to compare Trump to Hitler because he plays into the fears of the people, and, and, and it just came out wrong,” Anthony Derlunas II told WBAL-TV from his front porch, where several reporters tracked him down Friday — two days after police removed him from his balcony seat at the Hippodrome Theatre.“I realize now that it was so hurtful in how it came out anti-Semitic,” Derlunas said in a shaky voice. “I have no hate in me.”Derlunas told the Baltimore Sun he drank several glasses of wine before the musical, which tells the story of a Jewish family persecuted for their faith in imperial tsarist Russia and opened at the Hippodrome two weeks after a gunman killed 11 people at a Pittsburgh synagogue.“That didn’t help my thinking one bit,” Derlunas said.[‘They showed his photo, and my stomach just dropped’: Neighbors recall synagogue massacre suspect as a loner]The 58-year-old said the first act’s final scene — in which an anti-Semitic pogrom disrupts a Jewish wedding — reminded him of Trump’s immigration policies, which call for mass deportations and a wall along the U.S. southern border.So during the intermission, with the wine still infusing his logic, Derlunas stood up from his seat in the balcony to make a performance of his own.“I meant to put it in that light of a dictatorship and no compassion and mercy,” he told WJZ.What happened instead became the subject of a brief police investigation and viral videos. Derlunas allegedly shouted, “Heil Hitler!” and “Heil Trump!” and made a Nazi salute from his seat as people jumped from theirs and ran for the exits — some expecting another massacre to follow the shouts.“The next thing I expected to hear was gunshots, frankly,” said Rich Scherr, who filmed the commotion from below as Derlunas’s balcony neighbors appeared to confront him.Derlunas said he realized his error immediately. “Instantly it was like, ‘Oh my God, what did you do?' ” he told the Sun.Security personnel escorted him and his girlfriend out of the theater. At least one frightened patron had called 911, and an officer arrived at the lobby shortly before 10 p.m. to interview Derlunas.“It appeared to this officer based on my interview of Mr. Derlunas that his intention was to express his dislike of Donald Trump,” the officer wrote in his report. He had no criminal history and so was released from the Hippodrome — with lifetime ban from returning.\"I would ban me too if I was in their position,” Derlunas told the Sun on Friday, after the Anti-Defamation League demanded his prosecution for what the group called an “anti-Semitic outburst.”In his doorstep interviews, Derlunas tried to convince any skeptics that espousing bigotry has been the opposite of his intent.“The thing that I can’t stand is Trump spreading hatred, and what did I do? I spread hatred,” he told the Sun.“I’m torn apart, I can’t eat, I can’t sleep,” he told WJZ. “I’m so disgusted and upset with myself for doing what I did.”He’s been trying to make amends. Derlunas’s listed phone number was not accepting incoming calls over the weekend. The Sun reported that he had phoned the theater and the Baltimore Jewish Council to apologize and was trying to reach local rabbis to do the same.Read more:A man shouted ‘Heil Hitler’ and ‘Heil Trump’ during ‘Fiddler on the Roof’ — and people fledA father who ‘loves history’ donned a Nazi uniform for Halloween — and dressed his 5-year-old as HitlerApparent Nazi salute at prom investigated by Wisconsin school district"}