{"id": "Redskins’ new safety Ha Ha Clinton-Dix grew up idolizing Sean Taylor", "paragraph": "With their trade Tuesday for Green Bay Packers safety Ha Ha Clinton-Dix, the Washington Redskins are getting more than another former Alabama standout to bolster their already stingy defense. They are also getting a player who idolized and modeled his play after Sean Taylor.Clinton-Dix, who wasn’t yet 15 when Taylor was murdered in his Florida home in 2007, described his admiration for the late Redskins safety in a 2014 Q&A with Milwaukee Journal-Sentinel reporter Tyler Dunne. When asked whether he could have dinner with any three people, dead or alive, Clinton-Dix said Taylor. “I don’t really have a two or three,” he added.“He was my inspiration,” Clinton-Dix, then a rookie, explained. “I looked up to him. I idolized him. He’s a heck of a player. Man, he was a beast. I liked him a lot. To see him pass at such a young age, it was sad to me, like he was my brother or something. And I didn’t even know him.”When asked what he liked most about Taylor’s game, Clinton-Dix referenced Taylor’s intimidation factor, including the infamous hit he laid on Buffalo Bills punter Brian Moorman in the Pro Bowl.“The way he comes up and hits,” Clinton-Dix said. “Everyone was scared of him. He was fast, too. He was a big kid, man. It was unbelievable to see the plays he could make. He’d knock people out in the Pro Bowl. It was crazy.”Clinton-Dix, who played high school football in Orlando, wore No. 6 during his three seasons at Alabama, but has worn Taylor’s No. 21 since the Packers selected him with the 21st overall pick of the 2014 draft.“The reason why we play this game when we put on a 21 jersey is because of him,” Clinton-Dix said in a “Sunday NFL Countdown” feature that aired last November on ESPN. “That was the first guy I seen in the 21. Just to be here and representing this 21 now, I got to make sure I carry this number with pride and respect.”In the piece, Clinton-Dix also revealed that the last thing he does before stepping on the field is watch a highlight of Taylor. There’s no shortage of them on YouTube, despite the fact that Taylor’s NFL career was limited to 55 games.“I envision myself making the plays that he’s already made,” said Clinton-Dix, who was named to the Pro Bowl in 2016 and has three interceptions this season.I hate the fact that Sean Taylor is no longer on earth no telling what his career would have been like R.I.P[From the Bog archive: For a generation of safeties, 'it's all about Sean T']Clinton-Dix shares a deep respect for Taylor with his new Redskins teammate and fellow safety D.J. Swearinger, who also revered Taylor while watching Miami Hurricanes games as a kid in South Carolina. No Redskins player has worn Taylor’s No. 21 since his death, except in practice, but Swearinger paid Su’a Cravens $75,000 for the rights to wear Taylor’s rookie number, 36, after signing with Washington in March 2017.“A lot of those Miami guys I grew up watching, and then when he got to the league, his rookie year was my freshman year [at South Carolina],” Swearinger told Redskins Nation last year. “He had 36. I ended up getting 36. It was actually a family number. My dad wore 36 and my uncle out here wore 36, so 36 just stuck with me since then.”Swearinger arrived at FedEx Field in a Taylor No. 21 jersey before the Redskins' win over the Carolina Panthers earlier this month“I’m going to pick up where Sean Taylor left off,” Swearinger said while sporting a Taylor No. 21 jersey in an Instagram video before last season. “That’s a lot of shoes, that’s a lot of weight, but I’m putting that on my shoulders.” Swea to God I love this Game. So geeked up to share this field with #2spoonzswagggu🥄🥄 Sunday.🤘🏾 ‼️‼️🔥 #God100 #SafetyFirst #SECboys #Jerseyswap‼️ #RIPseanTayor #36 #21 #Soild #Boutwhateva #Hungry @jungleboi_swagggA post shared by  Haha Clinton-Dix (@_ha21) on Sep 25, 2018 at 2:14pm PDTSwearinger and Clinton-Dix, who swapped jerseys after the Redskins defeated the Packers at FedEx Field in September, could form one of the better safety duos in the league. Entering Sunday, they were the NFL’s two highest-graded safeties this season, according to Pro Football Focus. In fact, Swearinger said he felt disrespected that Pro Football Focus decided to use a photo of Clinton-Dix in a tweet featuring a list of the top five graded safeties, despite the fact that Swearinger was No. 1. With Clinton-Dix en route to Landover, perhaps Swearinger can laugh about the perceived slight.The highest graded safeties in the NFL so far this season. pic.twitter.com/4JRxNQc0uORead more on the Redskins:Redskins trade for Ha Ha Clinton-DixAdrian Peterson is making all of his doubters look foolishClinton Portis says ‘Hip Hip Hooray’ divided the Redskins the last time they started 5-2Hail or Fail: Redskins' defensive front held a party in the Giants' backfieldRedskins-Giants takeaways: Scorching D.J. Swearinger fuels Washington’s winRedskins are cruising along in first place, but it doesn’t always look like it"}