{"id": "Patriots face growing list of issues heading into bye week", "paragraph": "FOXBOROUGH, Mass. — The Patriots have been adept at masking most of their issues this season.After a 1-2 start by New England that seemed to offer at least a sliver of opportunity for someone to end its streak of nine straight AFC East titles, it hushed those rumblings by running off six straight victories.But recent injuries, mounting issues on the offensive line and mistakes on defense returned during a 34-10 loss at Tennessee on Sunday.It left coach Bill Belichick with a refrain he repeated both after the game and again Monday when asked for his assessment.“None of it was good enough,” he said.It’s also brought back a small cloud of uncertainty about the prospects of a team that now enters its bye week facing the task of playing catch-up to a 9-1 Kansas City Chiefs team for home-field advantage in the AFC playoffs.“You better learn from a game like this, because the weeks get harder and harder,” receiver Julian Edelman said following Sunday’s loss. “We’ve got to fix it because this is when you start separating or you start falling behind.”Tom Brady put together an MVP season in 2017 despite losing Edelman to a preseason knee injury. He was able to do it largely because of the strong seasons from tight end Rob Gronkowski, running back Dion Lewis and receiver Brandin Cooks.And despite a slow start, the defense was strong down the stretch, ending the regular season allowing just 18.5 points per game.Fast-forward to 2018 and so much has changed following roster changes in the offseason.Lewis signed with the Titans in free agency, creating a hole at running back that the Patriots have had trouble plugging. Cooks was traded and Brady has yet to develop consistent chemistry with a revamped group of receivers that has also had injuries.As a result, Brady spent a good portion his 300th career NFL game Sunday under increasing pressure. He was sacked three times and hurried a total of six times by the Titans. He’s only been sacked 16 times this season, but he’s working harder in the pocket.Brady already has seven interceptions in 2018, one fewer than he had in all of 2017. They haven’t all been the result of pressure from the defense. But he’s had more overthrows working behind an increasingly injury-battered line that may be missing the leadership of free agency departure Nate Solder at left tackle.Trent Brown, who the Patriots acquired to fill Solder’s spot, has started all 10 games and been solid. But he’s now part of a growing list of offensive linemen nursing injuries.Brown missed the final drive of the first half against the Titans because of illness. LaAdrian Waddle replaced him for that series, with Brown returning early in the third quarter. But Brown left again with an injured back.Even more concerning for the Patriots (7-3) was the sight of Edelman leaving with an ankle injury. Gronkowski, who sat out Sunday, has now missed two of the last three games with ankle and back injuries. His backup, Dwayne Allen, could also miss some time after injuring his knee against Tennessee.Brady tried to lean on Josh Gordon, who has shined in recent weeks since his trade from Cleveland. But Gordon had just four catches on 12 targets against the Titans.It added up to Brady being held without a touchdown pass for the second time in three weeks. His passer rating is down from 102.8 last season to 94.8 this season.Defensively there are concerns, too. After finding a groove in the second half of 2017, the Patriots haven’t quite turned the same corner with linebacker coach Brian Flores calling plays following the departure of former defensive coordinator Matt Patricia. They are allowing 24 points and giving up 381 yards per game and continue to struggle with mobile quarterbacks.Brady said this upcoming bye week must feature a lot of self-assessment.“I think the coaches will do a lot of self-scouting. I think we as players have to do the same thing,” he said. “Hopefully we learn from it. All of these games are a little bit different. ... The ones that we’re going to play will be a little bit different. Winning football takes a lot of things. It takes a lot of good performances from a lot of people. Losing football is the exact opposite.“Winning in the NFL is hard. You can’t just show up expecting to win.”___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL___Follow Kyle Hightower on Twitter at http://www.twitter.com/khightowerCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}