{"id": "Buccaneers sticking with Fitzpatrick as starting QB", "paragraph": "TAMPA, Fla. — The Tampa Bay Buccaneers are sticking with Ryan Fitzpatrick as their No. 1 quarterback.Coach Dirk Koetter said Monday that the 14th-year pro, who failed to produce a touchdown in the previous day’s 16-3 loss to Washington, will start next Sunday on the road against the New York Giants.The Bucs (3-6) have dropped six of seven games following a 2-0 start, with Fitzpatrick starting four of the losses after leading the team to surprising victories over New Orleans and Philadelphia while Jameis Winston was serving a suspension for violating the NFL’s personal conduct policy.“We’re going to go with Fitz this week,” Koetter said, adding he still feels Fitzpatrick “gives us the best opportunity” to win and pull out of a tailspin that’s jeopardized the prospects of ending a long playoff drought.Also, struggling kicker Chandler Catanzaro was waived.Catanzaro was one for three on field goals against the Redskins, missing from 30 and 47 yards. In addition to being 11 of 15 through nine games, the fifth-year pro who signed as a free agent after spending last season with the New York Jets has missed four extra points.Winston, banned the first three games of the season for touching a female Uber driver inappropriately in 2016, regained his starting job for three games before being benched three weeks ago.Koetter left open the possibility of switching back to Winston after the Bucs gained 501 yards, but only scored three points against the Redskins. Fitzpatrick threw for 406 yards, but was intercepted twice and lost a fumble.Washington finished with four takeaways, while Tampa Bay failed to force a turnover for the sixth consecutive game.“Turnovers are killing us right now. We’re minus-19 (in turnover differential), last in the league,” Koetter said. “Thirteen turnovers and no takeaways in the last four games. That’s by far the No. 1 thing that’s hurting our team.”Winston hasn’t played since throwing four interceptions during the first three quarters of a road loss at Cincinnati on Oct. 28. The fourth-year player has thrown 10 picks and lost one fumble in four games since returning from his suspension.Koetter remains optimistic that the Bucs, who haven’t made the playoffs since 2007, can turn themselves around.Winston, the first overall pick from the 2015 draft, is due to earn $20.9 million next year in the final season of the contract he signed as a rookie.Koetter said he understands the thinking that the Bucs need to find out exactly what they have in the fourth-year pro.Nevertheless, he’s sticking with Fitzpatrick for now.“We’re barely past the halfway point in the season. There’s a lot of football to be played. I don’t think it’s out of the realm of possibility that we can turn this thing and get on a little bit of a win streak,” Koetter said.“We’ve got to play better football more consistently across the board,” the coach added. “Our defense took a nice step in that direction (Sunday). I still think when we put it together on both sides of the ball we’ll be all right.”Fitzpatrick, 2-4 as the starter this season, has 2,199 yards, 17 touchdowns and nine interceptions. He’s turned the ball over five times the past two weeks during losses to Carolina and Washington.After Sunday’s game, the 35-year-old shrugged off a question about whether he felt he had done enough to retain the starting job.“I love playing football. That’s not something I concern myself with or care about,” said Fitzpatrick, who’s played for seven teams over 14 seasons. “If I get a chance to go out there, I try to do my best and play as hard as I can and enjoy myself.”___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFLCopyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}