{"id": "Public advocate beats charter supporter for California schools chief", "paragraph": "Finally, more than a week after the vote, there is now a winner in the race for California’s superintendent of public instruction after the most expensive race in history for a state schools chief.State legislator Tony Thurmond, an advocate for traditional public schools, beat out charter schools supporter Marshall Tuck. He tweeted the following on Saturday:I want to thank the voters of CA for electing me to serve the 6 million students of CA. I intend to be a champion of public schools & a Superintendent for all CA students. I want to thank Marshall Tuck for his gracious call to congratulate me & wish me well. Time to get to work!The election of Thurmond was a victory for forces in California who want to reform the scandal-ridden charter school sector and a blow to the charter school lobby and wealthy philanthropists, some of them out of state, who had poured millions into Tuck’s campaign. Both men are Democrats.Thurmond had established an insurmountable lead more than a week after the actual election, with 50.8 percent of the vote to 49.2 percent for Tuck, who lost his second consecutive bid for the job.Until Saturday the race appeared to be too close too call, with a gap of only a few thousand votes at one point. Tuck initially led, but as more votes were counted, Thurmond took the lead and opened a wide enough margin for Tuck to concede.Thurmond was elected to the California State Assembly in 2014 from the East Bay and has been a member of two school boards.Tuck was the first president of the Green Dot network of charter schools in Los Angeles and then founded a nonprofit that used private donations to help turn around troubled traditional public schools. Four years ago, Tuck ran for state superintendent, losing in a race that cost some $30 million, with a lot of coming from billionaires backing Tuck.This year’s race had a price tag of more than $50 million, making it the most expensive for a state superintendent ever.The state superintendent in California cannot independently make education policy; that is done by the California State Board of Education. But the superintendent runs the state Department of Education and sits on the governing boards of California’s two public university systems and of its teachers’ pension fund.The race was the latest chapter in a long-running debate about public education in a state with severely underfunded traditional school districts. California has been called the Wild West when it comes to charters because of repeated financial and other scandals in the sector. The state has more charter schools — which are publicly funded but privately operated — and more charter students than any other state. There are about 1,275 charter schools that enroll about 630,000 students. Nearly 35 charter schools with some 25,000 students are run by five for-profit companies.Thurmond said he wants to spend more money on traditional schools and stop the expansion of charters until funding and transparency issues are resolved. Tuck does not want to stop expansion, though he agreed with Thurmond that poor-performing charters should be shut and for-profits should be banned.Outgoing Gov. Jerry Brown (D), a charter school supporter, recently signed a bill into law that supposedly bans for-profit charters in the state, but it is not clear it will really do that."}