{"id": "Class-action lawsuit accuses e-scooter companies of ‘gross negligence’", "paragraph": "The nation’s electronic-scooter companies are facing more blowback as concerns rise about the safety of these devices — this time in the form of a class-action lawsuit filed Friday in California.The lawsuit, filed in Los Angeles County Superior Court, accuses two of the largest e-scooter companies, Lime and Bird, as well as other e-scooter firms, of “gross negligence” and “aiding and abetting assault.”The lawsuit, filed on behalf of eight initial plaintiffs, says the companies' practices have contributed to injuries in multiple ways. By “dumping” scooters on public streets without an appropriate warning, the suit alleges e-scooter companies acted negligently and should have known that their devices would become a dangerous “public nuisance.”Three plaintiffs claim they were walking when e-scooter riders crashed into them from behind, resulting in severe injuries. The suit alleges that e-scooter companies knew their riders were injuring pedestrians and –– by failing to stop the collisions from occurring –– assisted and encouraged scooter riders as they committed “assaults.”The suit also states that both companies' scooters contain defective electronics and mechanical parts, as well inadequate safety instructions for riders and that they have “a wanton disregard for the safety of others.” The risks posed by the devices, the suit states, “were known and/or knowable” based on “professional knowledge” known within the transportation community.The suit makes numerous claims about scooters' mechanical issues, but does not provide concrete evidence for those claims.The suit also names scooter manufacturers Xiaomi United States and Segway as defendants.“While acting under the guise of the commendable goals of furthering personal freedom and mobility and protecting the environment, the Defendants, and each of them, are endangering the health, safety and welfare of riders, pedestrians and the general public,” the suit states.The suit adds that “scores (if not hundreds) of riders and pedestrians and members of the public have suffered, are continuing to suffer and will to continue to suffer egregious and avoidable injuries and damage to their person and property.”[Scooter use is rising in major cities. So are trips to the emergency room.]Spokespersons for Segway and Xiaomi United States did not respond to a request for comment.A Lime spokesperson said the company is in the process of reviewing the complaint.“While we don’t comment on pending litigation, safety has always been at the very core of everything we do at Lime –– as is our mission of reducing cars from city streets and making them safer and greener for pedestrians, bike and scooter riders alike,” the spokesperson said, adding that the company “prides itself on taking proactive steps relating safety wherever we have a presence.\"In a statement released by Bird, the company pointed out that the complaint has been brought “against the entire e-scooter industry\" and said shared e-scooters have become an important transportation mode “for hundreds of thousands of people in 100 cities worldwide.”“We believe that the climate crisis and our car dependency demand a transportation mode shift, and clean energy vehicles like e-scooters are already replacing millions of short car trips,” the statement said. “There is no evidence that riding an e-scooter presents a greater level of danger to riders than riding a bike. Cars remain the greatest threat to commuters, killing over 40,000 people in the US yearly.”Since their sudden arrival in recent months, e-scooters have been linked to an uptick in severe injuries in hospitals around the country, according to emergency-room physicians. As the value and popularity of companies such as Bird and Lime have soared, a growing number of critics –– including doctors, former riders and scooter mechanics –– claim that e-scooter fleets are poorly maintained and prone to dangerous mechanical failures.Two e-scooter riders –– one in Dallas and another in the District –– have been involved in accidents that led to their deaths, authorities say.The class-action suit adds a new category of people to the list of those fiercely opposed to the latest form of controversial transportation sweeping the country: pedestrians.Among the plaintiffs is David Petersen, a 62-year-old street performer known as “Davy Rocks,” who alleges that he was severely injured after being struck by an e-scooter rider in June.Dancing for onlookers near the Santa Monica pier in California, Petersen, clad in his trademark “gladiator outfit,” told The Washington Post that he was hit from behind by a man on a Bird scooter; the man fled the scene. Petersen said the force of the collision knocked him down, but he managed to lessen the impact by catching himself with his right hand. Had he been an elderly person or a small child, he said, he could’ve been killed.[Fatal e-scooter accident emerges just as California legalizes riding without a helmet]Petersen said he suffered a fractured arm and a severed biceps, an injury that caused him to miss weeks of work. The muscle had to be surgically reattached using a cadaver graft, he said.“My arm is never going to be the same, not to mention the five-inch-long scar it’s got now,” he said, noting that his arm has lost rotation and feels stiff. “If Bird is going to profit off the human meat grinder they’ve created in Santa Monica, they should be held responsible for the suffering they’ve caused.”Additionally, the lawsuit accuses Bird and Lime of multiple breaches of each company’s warranty and alleges that their vehicles were “not suitable” for repeated use in public places.Stating that the deployment of e-scooters is unlawful, the suit claims that each company should be prohibited from continuing to deploy scooters in California. Beyond seeking damages, the suit claims that scooter companies should be required to include “adequate warnings and/or instructions” to their apps and vehicles.Catherine Lerer –– a personal-injury lawyer from Santa Monica who is representing the plaintiffs with lawyer Jeffrey Lee Costell –– said she has received more than 100 calls from people injured by scooters in recent months. Whether they involve riders or pedestrians, she said, the injuries are consistent: broken noses, legs, arms, wrists, hands and ribs, as well as head injuries and tears to anterior cruciate ligaments and rotator cuffs that require surgery.“We filed this class-action lawsuit against Bird and Lime and the manufacturers of their electric scooters to address the terrible injuries they have inflicted on their riders and pedestrians, and the continuing harm they are causing,” Lerer said."}