{"id": "President campaigns for former foe at Nevada rally", "paragraph": " ELKO, Nev. — Before President Trump’s improbable victory nearly two years ago, Dean Heller, this state’s Republican senator, told reporters that “I vehemently oppose” the GOP’s nominee and gave a campaign contribution from Trump to charity. But on Saturday, here in this small, conservative mining town in northeastern Nevada, Heller couldn’t stop showering Trump with praise as he faces the final stretch of a tough reelection bid.“Welcome to Trump country!” the senator said as he walked onto the stage, introduced warmly by the person Heller would not admit he voted for until nearly seven months into Trump’s presidency.“Mr. President, this is not the swamp. Now, Mr. President, you know a little bit about gold. In fact, I think everything you touch turns to gold.” Trump had introduced the senator in kind, thanking Heller for his support for his two Supreme Court picks — Justices Neil M. Gorsuch and Brett M. Kavanaugh — and his work on veterans’ issues and on the Republican tax bill that was signed into law late last year. In the tax fight, “there was nobody tougher, there was nobody smarter,” Trump said.“I’m thrilled to introduce a man that I spent a long time getting to know,” Trump said, acknowledging their initial tumultuous relationship. “At first, I fought him. I said, ‘This guy’s tough. What’s the story here?’ ” But the men eventually came to understand each other, Trump said, adding: “There’s no better partner that I had in Washington than Dean Heller.”Saturday marked the first day of early voting in Nevada, a crucial state in the presidential nominating contests that is also home to one of the most competitive Senate races this year. Heller is the sole GOP senator running for reelection in a state that Trump opponent Hillary Clinton won in 2016. He is facing a robust challenge from Democrat Jacky Rosen for a seat that both parties are fighting for with an eye on the Senate majority. Polls show a tight race. Creating a campaign-ready image, Heller and Trump together walked off Air Force One just steps away from the rally site. Heller had flown with Trump from Scottsdale, Ariz., where the president had stayed after campaigning on behalf of Arizona GOP Senate candidate Martha McSally in Mesa.At the Nevada rally, Trump called Heller’s opponent “Wacky Jacky” and warned against handing control of Congress to Democrats. Trump was optimistic on the Republicans’ prospects next month, arguing that “I think that blue wave is being rapidly shattered.”“The people of Nevada are going to reelect Senator Dean Heller to protect your jobs, defend your borders and continue making America great again,” Trump said. “This will be the election of Kavanaugh, the caravan, law and order, tax cuts, and common sense.” Trump was referring to the hundreds of central American migrants who were trying to cross into Mexico this weekend on their way to the U.S. border.The rest of the 56-minute rally, held outside by the town’s airport against the backdrop of mountains, was Trump’s standard red-meat campaign fare, as he proudly touted the nation’s economy, taunted Democrats and warned of the dangers of illegal immigration. Under the intense desert sun, Trump quipped: “I’ll end up with a nice tan.”Trump also campaigned on behalf of Adam Laxalt, the state’s attorney general, who is running for governor against Democrat Steve Sisolak, the Clark County commissioner.Shortly after the rally, Trump said Republicans are planning to implement a “very major tax cut” for middle-income earners before next month, even though Congress is out of session until after November’s midterm elections.He did not go into specifics of the plan, but said the cuts would be done “sometime just prior, I would say, to November.” It was not clear what Trump was referring to, and the White House did not immediately respond to a request for clarification.“We are going to be putting in and are studying very deeply right now, around the clock, a major tax cut for middle-income people,” Trump said. “Not for business at all. For middle-income people.” Saturday also gave way to a political split screen of sorts in Nevada. More than six hours south of this remote town of 20,000 people, former vice president Joe Biden rallied on behalf of Democratic candidates in a Las Vegas event sponsored by the state party, the Latino Victory Fund and the Culinary Workers Union — a powerful force in Nevada Democratic politics. “These guys are not good guys. This is not your father’s Republican Party,” Biden said. “I travel the world a lot . . . they look at me and they wonder what the hell is going on in America. Ripping infants from their mothers’ arms at the border. What are we doing? What have we become?” Shortly after, in Elko, Trump claimed that Biden’s event attracted just 193 people, although reporters on the ground said the figure was in the multiple hundreds. Trump attacked Biden as “1 percent Joe” — referring to Biden’s low level of support in his previous presidential bids — adding, “and then [President Barack] Obama came along and took him off the trash heap and made him vice president.”The rally in Elko was Trump’s third and final one in his three-day campaign swing out West this week, stumping on behalf of House and Senate Republican candidates. He’ll be on the road again Monday to campaign for Sen. Ted Cruz (R-Tex.) in Houston. Matt Viser in Las Vegas contributed to this report. "}