{"id": "The Trump administration again tries to sabotage the Obamacare model", "paragraph": " Opinion  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  WHILE THE nation was focused on migrant caravans, mail bombs and President Trump’s disgusting tweets last week, his administration was making another big change to the Affordable Care Act, also known as Obamacare. The new plan would give states far more flexibility in regulating health-insurance markets within their borders. That sounds like a good thing. It is not.Obamacare reorganized the market for individual insurance plans — that is, coverage people do not get from their employers or directly from the government. The law recognized that there are only so many ways to get people with preexisting conditions onto the comprehensive plans they need. The government could insure them directly, at high taxpayer expense, or it could mandate that everyone carry decent, private health-care coverage. With many people, healthy and sick, in the system, premiums overall would be contained and everyone would have quality health insurance that would cover expected and unexpected medical costs.Republican state leaders, the GOP-majority Congress and the Trump administration have tried to sabotage this model. They eliminated the mandate that people buy insurance. They legalized skimpy insurance plans of little use to those with preexisting conditions; these plans threaten to draw healthier people out of the comprehensive plans that sick people need, raising costs for those who need the most help. Now Republicans’ new rules could allow states to subsidize people buying skimpy plans, enhancing the incentive for healthy people to desert their comprehensive coverage.When those healthy people become sick, they may well end up without the coverage they need. Those left behind on more expensive comprehensive plans would be in jeopardy of seeing higher costs. Theoretically, the federal government would be able to nix any state plan that would lead to premium hikes for those with preexisting conditions. But the Trump administration’s new policy would give states so much leeway that it could be hard to prevent insurance markets from deteriorating as states upend their markets once more. State waivers that would raise some people’s costs could be approved as long as other users are projected to see substantially lower costs. States might get approval for plans that would cut the number of people with coverage as long as they could argue that they would boost coverage in the future. Projections may very well not pan out.The fact remains that there are very few ways to adequately serve people with preexisting conditions. The government either needs to pump lots of money into directly subsidizing their care or it must foster insurance markets to which everyone contributes and in which costs are averaged over a large number of people. The law is premised on the latter option. It is a good model, in part because it provides a path for nearly everyone to have comprehensive coverage, which should be a minimal standard in the world’s largest economy. Republicans should stop trying to push in the opposite direction.Read more:Alex M. Azar II: Obamacare forgot about you. But Trump didn’t.The Post’s View: Americans are starting to suffer from Trump’s health-care sabotageThe Post’s View: The Trump administration’s latest health-care move will cause even more painRobert J. Samuelson: There’s a genuine solution to our health-care problemThe Post’s View: Health care is still a mess. Republicans are making it worse.We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}