{"id": "Fresh sanctions on Iran are already choking off medicine imports, economists say", "paragraph": " ISTANBUL — New U.S. sanctions on Iranian financial firms, including a bank that until recently handled most payments for Iran’s imports of humanitarian goods, are having a chilling effect on foreign companies that help supply medicine and other medical products, economic analysts say. The trade of humanitarian goods is allowed under U.S. sanctions, according to Treasury Department guidelines, permitting Iran to import food, medicine and medical devices without punishment.But the far-reaching sanctions on Iranian financial firms reimposed two weeks ago could endanger the flow of humanitarian goods as foreign banks and outside suppliers abandon business ties with their partners in Iran, analysts and experts warn. In recent months, some European banks have refused to process payments even from Iranian firms that are exempt from sanctions out of fear of U.S. penalties, according to people familiar with the transactions.The number of European and Iranian banks conducting such transactions has dwindled, observers say. The refusal to process payments has alarmed Iranian importers. Some say they fear transactions with outside banks could cease altogether, prompting shortages of vital goods, including medicine.“You just don’t know when other parties are going to be added or targeted. What was true yesterday may not be true this afternoon,” said Alan Enslen, an international trade lawyer at Baker Donelson in Washington, explaining how companies are weighing the risks.The Trump administration imposed a near-total embargo on the Iranian economy this month as part of a “maximum pressure campaign” to force Iran to give up its ballistic missile program and curtail its support for militant groups such as Hamas in Gaza and Lebanon’s Hezbollah. The sanctions — which were lifted in 2016 after Iran signed a nuclear deal with the United States and other world powers — target things from oil sales to shipbuilding to multinational firms that violate the provisions.Treasury’s Office of Foreign Assets Control, or OFAC, says it has blacklisted a number of Iranian banks that met criteria, laid out in executive orders, linking the firms to terrorism or the proliferation of weapons of mass destruction.The administration last month imposed sanctions on Parsian Bank, one of Iran’s most reputable private-sector institutions, for what OFAC said was support for an investment company it says is linked, through yet another company, to Iran’s paramilitary Basij Resistance Force. The investment company had profited from shares it purchased in Parsian Bank, OFAC said, and those profits in turn were funneled to leaders of the Basij network.Policy analysts and sanctions experts, however, say Parsian processed much of Iran’s humanitarian trade transactions and was trusted by European firms. It was one of the few Iranian banks whose anti-money-laundering procedures were up to international standards, said Esfandyar Batmanghelidj, an expert on business relations between Iran and Western countries.“It was like going after Citibank. It was that significant,” said Batmanghelidj, co-founder of the Europe-Iran Forum, an annual conference promoting trade between Iran and Europe.“The way Parsian was designated suggests that other banks could also be targeted at some stage, so you suddenly have a risk,” he said. “Companies that know they can trade with Iran now face challenges in finding a bank, affording that bank’s services and sustaining their trade knowing that at any point, that channel can be shut.”The Trump administration insists that it is not targeting or prohibiting humanitarian trade with Iran and that U.S. actions are instead aimed at persuading the Iranian government to “change its behavior” and return to the negotiating table for a more comprehensive deal.President Trump announced in May that the United States was ending its participation in the 2015 nuclear deal, which curbed Iran’s atomic energy program in exchange for major sanctions relief. The administration says the agreement did not go far enough toward Iran’s nuclear weapons program, despite Iran’s continued compliance with the deal’s restrictions, according to the International Atomic Energy Agency.“The burden is not on the United States to identify the safe channels” for humanitarian trade, Brian Hook, the State Department’s special envoy for Iran, said in a briefing with reporters this month. “The burden is on the Iranian regime to create a financial system that complies with international banking standards to facilitate the provision of humanitarian goods and assistance.”“The regime’s attempts to mischaracterize these humanitarian exemptions are a pathetic effort to distract from its own corruption and mismanagement,” he said at a later briefing, as the harshest U.S. sanctions went back into effect. “The regime has enough money to invest in its own people.”Among the concerns facing Iranians is whether they will be able to continue importing advanced medicine and equipment used to treat chronic illnesses.On Twitter this past week, Iranian Foreign Minister Mohammad Javad Zarif posted letters he indicated were from four European pharmaceutical companies announcing the end of their business activities in Iran. Iran has a large pharmaceutical industry of its own but imports some of the raw materials needed to produce medication.Employees in Iran’s pharmaceutical industry said in interviews that companies have already been forced to switch banks to pay for drug imports and that some have to cut back on staff and paying salaries.“Many companies have started limiting their activities and laying off employees,” said an Iranian employee at the local affiliate of German pharmaceutical giant Bayer AG. She added that her company faced difficulties transferring money to pay for imported drugs.“We were working with Parsian Bank, but we have not made any payments since November 4th,” she said, adding that Bayer Iran planned to move its business to the much smaller Hekmat Iranian Bank. The employee spoke on the condition of anonymity because she was not authorized to speak to the media. “The problem is that foreign banks must accept the risk” of working with lesser-known financial firms in Iran, she said.According to Enslen, the international trade lawyer, general licenses for food and medicine are still available under sanctions and Iranian banks that help facilitate such transactions.“The U.S. government doesn’t want to target humanitarian trade, but in order to achieve their objectives, which are pretty strong and bold objectives, they’re not going to sacrifice their true target,” he said. “I don’t believe that it’s a diabolical plot to drive out humanitarian trade. But that’s not going to prevail at all costs.”Even before U.S. sanctions were reimposed, inflation and a declining currency caused prices of goods such as food and medicine to rise in Iran.Sarah, 30, lives in Tehran and buys prescription medication for her elderly father, who she says suffers from age-related macular degeneration, an incurable eye disease. She declined to give her full name to more candidly discuss her family’s situation.Her father took PreserVision eye supplements manufactured by Bausch & Lomb in Canada, and they used to cost about $7 in Iran. Earlier this year, Sarah said, they disappeared from the market, and when she found them again, they were being sold for the equivalent of $70.“All of the prices have gone up, and we can't find many products anymore,” she said. “Sometimes the medication can only be found on the black market, which is getting bigger and bigger every day.”Read moreHeated rhetoric commences as Trump reimposes sanctions on IranU.S. to allow eight countries to temporarily import Iran’s oil despite sanctionsUnited Nations’ court rules U.S. must allow humanitarian trade with IranToday’s coverage from Post correspondents around the worldLike Washington Post World on Facebook and stay updated on foreign news"}