{"id": "‘You should have died in the Holocaust’: Neo-Nazi harassment is not free speech, judge rules", "paragraph": "Desktop notifications are on   | Turn off Get breaking news alerts from  The Washington Post Turn on desktop notifications?One emailer wrote: ““You are a disgusting, vile Jew … This is OUR country: you’re merely living here (for now).”A caller said: “You should have died in the Holocaust with the rest of your people.”But the calls that most disturbed Tanya Gersh consisted only of the sound of gunshots being fired.The terror campaign — known as a “troll storm” — was the result of Daily Stormer publisher Andrew Anglin’s December 2016 directive, urging hundreds of thousands of readers to harass the Jewish woman and her family, according to court filings.Gersh sued the known neo-Nazi. On Wednesday, a Montana federal judge denied Anglin’s motion to dismiss the case, holding that speech in encouraging anti-Semitic harassment was not entitled to First Amendment protection.The Montana mother found herself in Anglin’s crosshairs in late 2016, after Richard Spencer, a household name in the alt-right movement, gained notoriety when a video of him shouting “Hail Trump!” at a conference of nearly 300 white nationalists — and the Nazi salutes it elicited — went viral.Spencer’s mother, Sherry Spencer, owned a ski home in the otherwise idyllic town of Whitefish, Mont. After facing local protests related to her son’s views, she reached out to Gersh, who in 2016 worked as a real estate agent, about selling the property.Subsequently, court filings allege, Sherry Spencer decided not to sell. Months later, she published a blog post on Medium, accusing Gersh of extortion, threats and denouncing her son’s views.The next day, Anglin called his own readers to action.“Are y’all ready for an old fashioned Troll Storm?” Anglin wrote in a Dec. 16, 2016, post on the Daily Stormer website. The article, titled “Jews Targeting Richard Spencer’s Mother for Harassment and Extortion — TAKE ACTION!,” was the first of 30 about Gersh on the neo-Nazi site.Anglin also relayed a set of instructions: “Just make your opinions known. Tell them you are sickened by their Jew agenda.”To assist his white nationalist reader “fam,” Anglin doxed Gersh, her family and friends, publishing their personal contact information online, including phone numbers and email addresses.Southern Poverty Law Center attorney J. Richard Cohen, who filed the suit on Gersh’s behalf, told The Washington Post, “In the old days, maybe the Klan would burn a cross on your lawn to intimidate you. Nowadays neo-Nazis have other ways to harass and intimidate.”Gersh immediately began receiving hundreds of violent and hate-filled phone calls, emails, voice mails, texts and social media posts. There were death threats, and messages that threatened to drive her to the brink of suicide.Anglin and his followers even targeted Gersh’s 12-year-old son. According to attorney David Dinielli, also of the SPLC, one Twitter user suggested the child look inside an oven for a free Xbox — a reference to the gas chambers used during the Holocaust in Nazi death camps. Anglin himself posted an image with Gersh and her son’s face superimposed on a photograph of the Auschwitz concentration camp.Court documents note that by spring 2017, the family had received more than 700 violent and threatening communications.“The trollers used every root to terrorize [Gersh],” Dinielli told The Post, calling it “intrusion into seclusion.” “She had to erase her presence on the Internet and entirely retreat from her life.”In his court filings, Anglin argued that the First Amendment protects his posts on the Daily Stormer and that he could not be held responsible for his readers’ actions.Chief Judge Dana L. Christensen, of the U.S. District Court in Missoula, Mont., disagreed.Christensen’s decision noted that Anglin’s attack on Gersh was not to inform the public about a matter of public concern. More, the evidence seemed to show that the publisher goaded his readers, anticipating their reaction to his call to arms.“Anglin did not use speech about Gersh to raise awareness for issues consonant with the alt-right agenda,” Christensen said in his written opinion. Instead, Anglin drew on “his readers' hatred and fear of Jews, rousing their political sympathies.” He called for “confrontation” and “action.”Christensen said, “Anglin exploited the prejudices widely held among his readers to specifically target one individual.”Marc Randazza, Anglin’s attorney, declined to speak with The Post, though the New York Times reported that he called Christensen’s decision dangerous for free speech.Wednesday’s decision does not end the case, which will proceed to discovery and trial phases. Gersh’s lawyers still must prove that Anglin is liable for invasion of privacy, among other claims.“There is no First Amendment right to call upon hundreds of thousands of readers to launch a public attack on a private individual with the intent of ruining her life. That’s simply not something that our Constitution protects,” attorney Dinielli said.Successful litigation could offer an avenue of recourse — though a time-consuming and costly one — for victims of online harassment and trolling.Hiding behind a keyboard is an insufficient mask, Dinielli said. “We’ll find you and the courts will hold you accountable.”Read more:A man shouted ‘Heil Hitler' and ‘Heil Trump’ during ‘Fiddler on the Roof’ — and people fledRepublicans attack Jewish candidates across the U.S. with an age-old caricature: Fistfuls of cashLong-forgotten Einstein letter that predicted threat of anti-Semitism reemerges with ominous messageApologizing for Canada’s rejection of Jews in 1939, Trudeau vows to fight anti-Semitism‘We were never taught’: Young Jews in the U.S. encounter anti-Semitism firsthand Sign up for email updates from the \"Confronting the Caliphate\" series.  You have signed up for the \"Confronting the Caliphate\" series. "}