{"id": "Maryland offense is erased by Iowa in 23-0 rout", "paragraph": "IOWA CITY — Maryland’s offense couldn’t sustain a series, while Iowa spent most of the first half embarking on clock-draining drives — a lethal combination for any team trying to win a game.The Matt Canada-led offense only brought the ball into Iowa territory once on Saturday. Though the defense helped limit the 19th-ranked Hawkeyes by forcing field goals, that only kept the game from becoming a blowout sooner. At a full Kinnick Stadium, the homecoming crowd was treated to a 23-0 rout of Maryland.On the one drive in which the Terrapins (4-3, 2-2 Big Ten) crossed a few yards past midfield and the only time their offense seemed to have any rhythm, Kasim Hill threw an interception — one of two turnovers that led to Iowa touchdowns. Maryland gained just 68 rushing yards against Iowa (6-1, 3-1), which came into the game ranked No. 3 nationally in run defense.As for why Maryland’s usually strong run game failed to work against Iowa, Canada said: “It’s the calls. It’s blocking. It’s running. It’s the whole deal.”This loss marked just the second shutout in Canada’s career as an offensive coordinator.Backup quarterback Tyrrell Pigrome, who has played at various points in each game this year, entered during the third quarter. With about 3½ minutes remaining in the quarter, freshman wide receiver Brian Cobbs mistimed his motion and ran into Pigrome after the snap, forcing the quarterback to drop the ball, which rolled into the end zone. Canada called the play “completely unacceptable and disappointing.” Iowa recovered for its final score to eliminate any chance of a late comeback.At kickoff, winds blew at an announced 30 mph. The flags atop the field goal posts rippled in the air throughout the game, and debris from the stands occasionally flew around. Iowa ran a run-heavy offense, recording 224 rushing yards and possessing the ball for 40 minutes 55 seconds of game time.“Our objective is to get off the field on third down,” linebacker Tre Watson said. “Unfortunately, we understand that when those long drives happen, that’s because we failed to do that. That falls back on us. Sure, offense getting first downs gives you breaks in between them, but if we get ourselves off the field, we’ll be in a better position throughout the game.”By the end of two quarters, the Terps had only run 16 offensive plays for three first downs. Maryland’s first drive ended when Hill recovered a bad snap and threw the ball away. The second drive started with a penalty on what Canada said “was going to be a good play.” The third ended with Hill’s interception.In the first quarter, Maryland ran just five plays, and Iowa spent nine minutes driving down the field for a field goal. In all, the Terps ran 39 plays for 115 total yards, compared to Iowa’s 76 for 310.Eight of Maryland’s nine drives lasted six plays or fewer.Maryland’s defense forced three field goals, but two of those came after the unit failed to stop Iowa on fourth-down conversions.“Holding them to those field goals were pivotal and did help,” linebacker Jesse Aniebonam said. “But at the end of the day, just getting those three-and-outs, getting those third-down stops, were the biggest point of emphasis that we really wanted to get home on and unfortunately weren’t able to.”Hill completing 6 of 15 passes for 47 yards for the game, his stat line brought down somewhat by a few drops. On a third and 17 in the second quarter, Hill just missed Dontay Demus on a deep throw.Pigrome attempted only one pass, an incompletion.Before the game, Maryland ranked fifth in the nation in turnover margin. Through the first six games, the Terps had thrown three interceptions and lost two fumbles. But they added two more to that list Saturday, and Hill’s interception came at an inopportune time — when Maryland was losing 6-0 but driving.Iowa quarterback Nate Stanley threw a pick on his first pass attempt of the day, which went straight into the hands of Watson, who now has four interceptions this year. Last week, Watson also notched one as part of the Terps’ five-interception day against Rutgers.The Terps allowed Iowa to score with eight seconds left in the first half, the Hawkeyes’ only offensive touchdown of the day. When Maryland received the ball at halftime and seemingly needed to score to stay in the game, the drive quickly ended when Hill threw an incomplete pass under pressure on a third and 18. In the drives that followed, Maryland never found any offensive success.“We still had a chance,” Canada said. “We went out there in the second half, and we didn’t get it going.”Read more:Barry Svrluga: The four months since Jordan McNair’s death have exposed what a mess Maryland isTen years ago, Dabo Swinney came in from the fringes to lead ClemsonIt’s not even November, and Wisconsin and Illinois are playing a snow bowl"}