{"id": "House GOP women confront a political crisis — their party is mostly men", "paragraph": " Analysis  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  About a half dozen House Republican women gathered this week for a somber, post-election dinner.Exchanging thoughts about the brutal results for GOP candidates, they realized something depressing, according to one attendee. That small dinner group represented about half the total number of Republican women who would serve in the House next year.Just 13 GOP women have won election so far to serve in the next Congress, down from 23 this year. With a half dozen races yet to be resolved, the House GOP — the minority party next year — is all but certain to have the lowest number of women in its ranks since 1994.That drop-off came amid a national political climate that saw female voters sharply break from Republicans. Women favored Democrats over Republicans for Congress, 59 percent to 40 percent, according to exit polls.It has set off a debate within the Republican Party about how to address this crisis, both in terms of appealing to female voters and recruiting and retaining women in Congress.“I think the Republicans have to get off of defense on this issue,” Rep. Liz Cheney (R-Wyo.) said Friday in an interview.Cheney was the uncontested winner this week in the race for House Republican conference chairwoman, which puts her in charge of the party’s communications and messaging strategy. She will become the party’s highest-profile woman in Congress, trying to rebuild and rebrand its battered image.Assuming the No. 3 leadership post, Cheney will reach a level no woman has ever attained among House Republicans. (The outgoing chair, Rep. Cathy McMorris Rodgers of Washington, is No. 4 in leadership ranks while Republicans are in the majority.)Record number of women heading to CongressCheney, who worked on Middle East policy in the State Department, brings a profile and clout among Republican women that has long been missing. But she does not see any need for course corrections on policies relating to women, arguing that Democrats create silos for female issues that treat women in a condescending way.“I’ve always felt like it was very paternalistic to do what the Democrats do,” she said. “It’s offensive to women.”She said that issues like security and a strong economy cut across gender lines and that if Republicans made that argument better and had more women making the pitch, they would win more support.“We need more women running for office, no doubt,” Cheney said.Rep. Elise Stefanik (R-N.Y.) could not agree more. At a forum Tuesday for candidates running for leadership posts, Stefanik stood up and motioned to a room overwhelmingly filled with white male faces.“Take a look around,” she told the GOP lawmakers. “This is not reflective of the American public.”Stefanik said she then asked Reps. Kevin McCarthy (R-Calif.) and Jim Jordan (R-Ohio), the minority leader candidates, what their plans were to recruit and elect more women.“I was struck that I really didn’t get an answer,” she recalled in an interview Friday.As head of candidate recruitment the past two years, Stefanik focused on finding women to run, landing more than 100 candidates.But many women flamed out in GOP primaries against male counterparts, and those who did break through could not swim above the Democratic wave in the general election. Just one new Republican woman, so far, will be sworn in for her first term in January.Yet when Cheney and Stefanik look across the aisle next year, they will see a record number of female Democrats, at least 89.President Trump won two years ago despite more than a dozen women accusing him of improper conduct or sexual assault, charges he denies. After his win, the Democratic Party and liberal activists focused early on recruiting and advancing female candidates. The reaction to the #MeToo movement further encouraged Democratic women, culminating in the clash over sexual misconduct allegations against Supreme Court Justice Brett M. Kavanaugh and the GOP’s treatment of his accusers.Kavanaugh denied the allegations. Trump mocked one of his accusers, Christine Blasey Ford, at a campaign rally while Republicans on the Senate Judiciary Committee released an explicit statement that purported to describe the sexual preferences of another woman who had accused Kavanaugh of misconduct.Cheney said those Senate confirmation hearings galvanized conservatives and did not scare away Republican women in suburban battleground districts. She said the allegations, and how Democrats handled them, demonstrated they were “willing to play games” with a serious matter, and the ensuing liberal protests “had the effect of really scaring people.”Stefanik took a more nuanced view, believing that the terrible standing with women was pretty well baked before last month’s confirmation vote.“We were having problems with women voters before that,” she said.Emily’s List, the political committee focused on electing women supporting abortion rights, spent $14 million in the primary season and an additional $23 million on their behalf in the general election.Liz Cheney launches a new brand in WyomingRepublicans have several groups trying to emulate that approach, but nothing remotely as powerful as Emily’s List.Stefanik, 34, and Cheney, 52, did not face financial hurdles in their first races. Stefanik was a domestic policy adviser in the Bush White House from 2006 through 2009 and worked on Mitt Romney’s 2012 presidential campaign, providing a ready-made network for her competitive 2014 campaign.Stefanik has decided to back away from her recruiting role at the National Republican Congressional Committee to focus solely on helping women win GOP nominations and then get elected.“I’m playing in primaries,” she said.Cheney easily defeated several veteran Wyoming Republican men in her 2016 primary, tapping her family’s national network to raise more than $2 million.In her new leadership role, Cheney sees her main focus as sharpening the party’s message. She intends to do a lot more than just stand behind McCarthy, the incoming minority leader, to provide a better visual backdrop.She wants to go after Democrats for supporting a “socialist economic policy” like single-payer insurance and how such a national health program would limit women’s medical choices. “That would be a disaster,” she said.Cheney has hit what has previously been a glass ceiling for GOP women. No Republican woman, in the House or Senate, has ever moved up to party whip, leader or House speaker.It took her father, Richard B. Cheney, who served in the House from 1979 to 1989, more than eight years to get elected conference chairman.His daughter reached that post after just two years. She plans to be a force for a while, with the potential to break some Republican glass along the way.“It’s a very special place,” she said.Read more from Paul Kane’s archive, follow him on Twitter or subscribe to his updates on Facebook.powerpostThank You!You are now subscribed to  Please enter a valid email address You might also like... See all newsletters"}