{"id": "Happy Hour Roundup", "paragraph": " Opinion  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  * Peter Overby reports that Democrats have decided what the first piece of legislation they’re going to pass through the House will be:Democrats will take control of the U.S. House in January with big items topping their legislative to-do list: Remove obstacles to voting, close loopholes in government ethics law and reduce the influence of political money.Party leaders say the first legislative vote in the House will come on H.R. 1, a magnum opus of provisions that Democrats believe will strengthen U.S. democratic institutions and traditions.“It’s three very basic things that I think the public wants to see,” said Rep. John Sarbanes (D-Md.), who spearheads campaign finance and government ethics efforts for the House Democratic Caucus. He said H.R. 1 will “demonstrate that we hear that message loud and clear.”All of this stuff should be utterly bipartisan. But I’ll bet that not a single Republican in the House votes for it, and then Sen. Mitch McConnell (R-Ky.) will quietly throw it in the trash so it never gets a hearing or a vote in the Senate.* Amy Gardner and John Wagner report that everything seems to be going well in Florida:Lawsuits and accusations flew Monday in the recount battle in Florida, with Sen. Bill Nelson (D) calling on Republican Gov. Rick Scott, his opponent, to recuse himself from overseeing the process and a judge ruling there was no evidence of voter fraud even as President Trump alleged without evidence that ballots were missing and forged.Recounts in Florida’s races for governor, Senate and agriculture commissioner were ordered Saturday due to tight margins in the votes and immediately became the focus of lawsuits by candidates.On Monday, state Judge Jack Tuter ruled against a request by Scott that ballots and machines in closely watched Broward County not in use in the recount be impounded. Tuter said that there was no evidence of voter fraud and that Brenda Snipes, the county election supervisor, needs to be allowed to do her job and finish the count.Tuter also appeared to admonish the Scott team for suggesting voter fraud without offering evidence of it.It may be about time to put the entire state into receivership.* Rick Hasen says that if you think what’s happening in Florida right now is bad, just wait until the 2020 election.* Colby Itkowitz runs down 12 likely targets of Democratic congressional investigations.* David Roberts explains the effects the midterm elections will have on climate policy.* Karen Tumulty argues that the president treats the military like nothing but a prop.* The latest Gallup poll puts Trump’s approval at 38 percent. So. Much. Winning.* Jessica Wehrman reports that Sen. Sherrod Brown (D-Ohio) says he is thinking seriously about running for president.* Alex Isenstadt reports that Republicans are seriously freaked out by the ability Democrats showed in the midterms to raise large amounts of money from small donors.* Ryan Grim reports that Richard Ojeda, a Democratic state senator who lost a race for a House seat in West Virginia, is running for president.* Martin Longman explains why despite the energy and enthusiasm of the Democratic Party’s new faces, it’s going to take the old hands to make everything work.* At the American Prospect, I explained how Republicans are now the party of white men and Democrats are the party of everyone else.We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}