{"id": "Saudi campaign to abduct and silence rivals abroad goes back decades", "paragraph": " ISTANBUL — Faisal al Jarba fled his native Saudi Arabia late last year as the danger drew near — after his patron, a powerful Saudi prince, was arrested and after a friend died in suspicious circumstances while in government custody. Jarba, a leading sheikh in a large tribe, traveled to the Jordanian capital, Amman, joining relatives there. But that was not nearly far enough. Jordanian security officers surrounded his house one evening in early June and took him away for questioning, assuring his family he would be back soon. Within days, however, he was driven to the border with Saudi Arabia and handed over to the Saudi authorities, according to two people familiar with the details of Jarba’s forced repatriation, which has not previously been reported. There have been no charges filed against Jarba, 45, and in the five months since he was captured, his family has received no proof that he is still alive, the people said. The killing of journalist Jamal Khashoggi in Istanbul last month by a team of Saudi agents dispatched from Riyadh has prompted fresh scrutiny of the kingdom’s pursuit of Saudi nationals abroad, from ordinary dissidents to defectors from the tight ranks of the royal family.The effort to silence Saudi critics abroad stretches back decades and over the tenure of several monarchs. But Crown Prince ­Mohammed bin Salman, the kingdom’s de facto ruler, has pursued the practice with an especially ruthless zeal since gaining his position last year, analysts said, even making the return of dissenters abroad a formal policy of the state, according to a Saudi official, who insisted such returns were to be negotiated rather than coerced.To repatriate its critics, the Saudi government has tried to lure them back or enlisted friendly regional governments to arrest them or even carried out brazen kidnappings in Europe.Saudi nationals have vanished from hotel rooms, been snatched from cars or had planes they were flying on diverted. One Saudi dissident prince said in a court filing that he was injected in the neck and spirited away on a private jet from Geneva to Saudi Arabia. Years later, after he managed to leave the kingdom, he disappeared again and has not been heard from since.“We know they can kill you; they can destroy your family or use them against you,” said one Saudi women’s rights activist who applied for political asylum in the United States last year. “It’s always been like this,” she said, adding that Mohammed’s aggressive pursuit of critics had further rattled an already paranoid community of Saudi expatriates.A Saudi government media office did not immediately respond to an email requesting comment on the abductions.Jarba was not a dissident, but he may have been wanted because of his association with a branch of the royal family that had fallen out of favor with the Saudi leadership, according to the two people familiar with the circumstances of his capture.He was a longtime friend and confidant of Prince Turki bin Abdullah, a son of the late King Abdullah. Turki was arrested last November as Saudi authorities detained hundreds of people, including royal family members, business executives and government officials, in what was billed as an anti-corruption operation.Although Jarba’s friends and relatives have had no contact with him, they have been able to piece together some details of his journey after he was taken into custody in the upscale Abdoun neighborhood in Amman. Following his arrest, Jarba was briefly held in the Saudi Embassy in Amman before being escorted to the border. Once in Saudi Arabia, he spent several weeks in Jiddah, which serves as the government’s capital during the summer months. At some point, he was taken to Turki’s house and asked to open secured vaults inside. There were conflicting accounts about whether Jarba was able to do so.Jarba had assumed he would be safe in Amman, the two people said, in part because he was a sheikh in a large tribe, the Shammar, that had strong relations with the Jordanian monarchy.A spokeswoman for Jordan’s government did not immediately reply to a request for comment on Jarba’s case.But Jordanian officials would later tell Jarba’s family that they had been powerless to stop his abduction, according to one of the people briefed on Jarba’s case. “This is bigger than us,” the Jordanian officials reportedly said.The first reported case of state-sponsored abduction by Saudi Arabia came on Dec. 22, 1979, when the country’s first major opposition figure, Nasser al-Saeed, disappeared from Beirut. He had fled the country after spending time in prison for organizing workers’ strikes and revolts. He continued his criticism while in exile and praised the 1979 capture of the Grand Mosque in Mecca by militants as a popular uprising. After he vanished, Saudi Arabia, ruled by King Khalid bin Abdulaziz at the time, said that reports that Saeed had been abducted and returned to Saudi Arabia by private jet were unfounded. It described Saeed as “insignificant.” While many who vanish are not heard from again, one victim, Prince Sultan bin Turki bin Abdul­aziz, a grandson of Saudi Arabia’s founder, was able to make his kidnapping public, lodging a criminal case against senior Saudi officials in a Geneva court in 2014. The complaint laid out details of an audacious abduction in 2003, during the reign of King Fahd, and named the king’s son, Abdulaziz bin Fahd, and the Minister of Islamic Affairs, Saleh bin Abdulaziz Al-Sheikh, as participants in the plot. Sultan, whom friends describe as a larger-than-life character — the kind of man who would order strawberry pie in the middle of the night — had been in Geneva for medical treatment. While abroad, he had been publicly critical of the kingdom, calling for economic reform and highlighting human rights issues. “He was warned to stop and told to come back and everything would be fine,” said Clyde Bergstresser, a lawyer based in Boston who was retained by the prince. But Sultan refused to return, so the king’s son and the minister were sent to persuade him. Sultan was invited to a residence of King Fahd on the outskirts of Geneva, the prince later recalled in interviews with Arabic satellite television channels.He arrived with his German security guards, who later gave evidence that they watched Sultan speaking with a cousin at the swimming pool, before the two men walked into the library without the guards. A short time later, five masked men arrived. “He was thrown to the floor and injected with an anesthetic in his neck and intubated,” Bergstresser said.Sultan’s security guards were told he had decided to go back to the kingdom voluntarily.After seven years, during which Sultan said he was held largely under house arrest, prison or in hospital, he was allowed to leave Saudi Arabia after becoming gravely ill with a respiratory disease. He flew to Boston for medical treatment and later lodged his legal case. However, on Jan. 31, 2016, he made the mistake of boarding a Saudi plane, organized by the embassy in Paris, after his father invited him to visit Cairo. Monitors on the aircraft that showed the plane’s route to Cairo suddenly went dark, according to Bergstresser. And the plane landed in Riyadh, the Saudi capital. “He was forcibly taken off the plane, yelling and screaming. I’ve not heard from him since,” Bergstresser said. He added that members of the prince’s entourage were held for several days and then released. Around the same time, two other princes based in Europe disappeared. The cases were first reported by the BBC last year. Prince Turki bin Bandar, who was known for his salacious tirades against the Saudi royal family, including accusations of murder, disappeared in 2015 after he had fled Saudi Arabia following a land dispute and taken up residence. Another minor royal, Saud bin Saif al-Nasr, also vanished after he urged reforms in the kingdom and publicly endorsed a letter from an anonymous Saudi royal widely circulated in 2015 calling for regime change. He was persuaded to board a private plane to Italy for what he thought was a business trip but has not been heard from since, the BBC reported.In an interview with the Russian news website Sputnik last year, Prince Turki al Faisal, a senior royal who heads the King Faisal Center for Research and Islamic Studies, dismissed the cases of the “so-called princes,” saying there were Interpol notices issued for their arrests. “We don’t like to publicize these things because we consider them our domestic affair,” he said. “Of course, there were people who worked to bring them back. They are here; they didn’t disappear. They are seeing their families.”The government of Morocco recently said it had extradited Prince Turki bin Bandar to Saudi Arabia to comply with an Interpol warrant. But in a statement, Interpol said that it had not issued a notice of any kind for him or Princes Saud and Sultan. Like Khashoggi, who lived in Virginia, many self-exiled dissidents flee as far as they can from the Middle East, fearing that Saudi Arabia’s allies could extradite them.In an interview with The Washington Post several months before his death, Khashoggi discussed the case of Loujain al-Hathloul, a Saudi women’s rights activist who was stopped in March while driving in Abu Dhabi, where she had been studying, and subsequently returned to Saudi Arabia and told to stop posting on social media. A few months later, she was arrested, imprisoned and branded as a traitor in the state-run media.As Hathloul was accosted in Abu Dhabi, her husband, Fahad Albutairi, a stand-up comedian, was kidnapped from his hotel room in Jordan and returned to Saudi Arabia, according to two people with knowledge of the incident.“It is intimidation,” Khashoggi said. “Teaching these people a lesson, making people fearful.”Read moreSecret recordings give insight into Saudi attempt to silence criticsCrown Prince Mohammed bin Salman is ‘chief of the tribe’ in a cowed House of SaudIn death, Saudi writer’s mild calls for reform grew into a defiant shoutToday’s coverage from Post correspondents around the worldLike Washington Post World on Facebook and stay updated on foreign news"}