{"id": "Michael Avenatti law firm evicted after not paying more than $213,000 in back rent", "paragraph": "Add this to Michael Avenatti’s horrible, no-good, very bad week: An Orange County judge has rejected the lawyer’s final appeal to block the eviction of a law practice carrying the possible presidential aspirant’s name from an ocean-view building in Newport Beach, Calif.The firm, Eagan Avenatti, has until Monday to vacate the offices, according to the Los Angeles Times, which first reported the news. The office building’s aggrieved landlord, Irvine Co., sued after Eagan Avenatti didn’t pay rent for four months, some $213,254 in total.The eviction comes on top of Avenatti’s arrest on domestic-violence charges earlier this week.“This is ridiculous,” Avenatti said in an email to The Washington Post. “We have multiple offices. This involves my old firm, which was already in the process of moving due to a dispute.\" On Twitter, Avenatti called the eviction claim “more nonsense” and “#Garbage,” and he suggested the spreading of the news was politically motivated.[Meet Michael Avenatti, the adrenaline-fueled lawyer taking on President Trump]“First, it’s not even my current firm,” he said. “Second, they were already in the process of moving so they didn’t need to be ‘evicted.’ The right is so intent on eliminating me as a threat, they will do and say anything.” According to the Times, although Avenatti has claimed that Avenatti & Associates and Eagan Avenatti are distinct firms, “they function as the same law practice with the same lawyers and support staff.\" “They are not the same firm,” Avenatti wrote in another email. “They are different entities that use different employees, have different cases, different offices with the exception of one, different bank accounts, different ownership, etc. In fact, Avenatti and Associates was formed in 2006, long before EA.” His claim that it was character assassination was an echo of what he said after he was booked on a felony domestic violence charge on Wednesday, following his release on $50,000 bail. In a statement from his law office after news of the charge spread, Avenatti said the allegations against him were “completely bogus.” There is a lot of inaccurate reporting out there. For example, (1) I have NOT been charged with anything, let alone a felony; (2) Lisa wasn't even with me Tues; etc. Numerous other \"facts\" being reported are completely bogus. Why is TMZ's news \"standard\" the new standard?“I have never been physically abusive in my life nor was I last night,” he said. “Any accusations to the contrary are fabricated and meant to do harm to my reputation. I look forward to being fully exonerated.” Avenatti — who represents Stormy Daniels, the adult-film star who said she had an affair with Donald Trump more than a decade before he became president — has spoken at Democratic events across the United States, launched a political action committee and said he can be a sharp-tongued foil to the president as part of the Democratic ticket in 2020.[Steve Bannon thinks Michael Avenatti could be a threat to Trump in 2020. Avenatti thinks so, too.]His acerbic nature and combativeness via a variety of media have raised his public profile, as The Washington Post has reported, although there are questions about his background and qualifications.And his actions during the confirmation hearing of Justice Brett M. Kavanaugh have some wanting him targeted in a criminal investigation, The Post reported.Avenatti and his client Julie Swetnick, who alleged in a sworn affidavit that she was gang-raped at a 1982 party attended by Brett M. Kavanaugh, have been referred by the Republican leader of the Senate Judiciary Committee to the Justice Department for a potential criminal probe over doubts about her claims during Kavanaugh’s Supreme Court confirmation hearings. Elise Viebeck, Eli Rosenberg and Deanna Paul, The Washington PostAvenatti’s week in the spotlight is already beginning to have negative political consequences.After the arrest, the Vermont Democratic Party announced that it was canceling events scheduled with Avenatti and refunding tickets.Read more:In Mississippi Senate race, an African American Democrat faces a Republican using a Confederate symbolBen Carson High is like ‘having Trump’s name on our school in blackface,’ Detroit board member saysRacist ‘magical Negro’ robo-call from ‘Oprah’ targets Stacey Abrams in Georgia governor’s race"}