{"id": "PM Update: Cold with increasing clouds tonight. Overcast with seasonable temps on Sunday.", "paragraph": "Ugh. That Maryland loss was painful to watch. But today’s weather was anything but painful. Sunday will feature more clouds than today, but temperatures will be about the same. That’s not too bad of an outcome. Certainly nothing like missing a wide-open receiver on a game-winning two-point conversion attempt.Listen to our daily D.C. forecasts: Apple Podcasts | Amazon Echo | More optionsThrough tonight: Clouds will start to build in from the west later this evening, eventually leading to mostly cloudy skies overnight. Despite the cloud cover, temperatures will still be on the cold side, with lows ranging from 30 to 35 degrees. Some patchy fog may develop in the predawn hours as light winds from the northeast draw in some low-level moisture.View the current weather at The Washington Post.Tomorrow (Sunday): Low pressure developing along a slow-moving front in the vicinity of Ohio will create a southerly flow over our region. Normally, this would result in warmer temperatures. But in this case, all it will provide is more moisture for clouds. As such, Sunday will be mostly cloudy but tranquil, with afternoon highs in the upper 40s. Partly to mostly cloudy Sunday night with lows in the upper 30s to low 40s.See Ian Livingston’s forecast through next week. And if you haven’t already, join us on Facebook and follow us on Twitter and Instagram. For related traffic news, check out Gridlock.Thanksgiving travel weather: I am not sure if you’ve heard, but Thanksgiving is near. Does it bother anyone else that the holiday occurs just 10 days after Veterans Day? For some reason, I am more annoyed by this than I should be and can’t find anyone to commiserate with me on this matter.Anyway, chances are you are doing some kind of traveling over the coming days and you’d like to know how the weather might affect that travel. Well, I’ve got good news for you. Most of the country will experience benign weather in the days leading up to turkey day.The only real trouble spot could be the northeastern part of the country on Monday evening, which of course is exactly the time that I plan to travel to Boston. But if you are driving anywhere in the Mid-Atlantic on Tuesday or Wednesday, expect lots of sunshine and lots of traffic.Want our 5 a.m. forecast delivered to your email inbox? Subscribe here."}