{"id": "These contests could matter more than the battle for Congress", "paragraph": "When Gretchen Whitmer announced her bid for Michigan governor nearly two years ago, much of the state’s Democratic establishment was less than enthused.Though she had been minority leader of the state Senate, Whitmer was virtually unknown outside her home area of Lansing. The party was still reeling from Donald Trump’s victory in Michigan during the 2016 presidential election, and political veterans worried she would be unlikely to inspire a badly needed revival of turnout in places such as Detroit. The city’s Democratic mayor, Mike Duggan, made no secret of his early efforts to recruit better-known alternatives, but all of them took a pass.Whitmer, despite those initial doubts, has turned out to be one of the standouts of the 2018 midterm election cycle. As her campaign heads into its final week, she is cruising across the state aboard a bus emblazoned with her call to “fix the damn roads” — and has a healthy lead  in the polls.Though most of the nation’s attention has been focused on the battle for control of Congress, the fights that may have longer-lasting implications for the balance of power in this country are the ones being waged in the 36 states where gubernatorial contests are topping the ballot.Right now, the Cook Political Report rates a dozen of these races as toss-ups. Ten of them are in states where the governorship is held by Republicans, and eight of those are in states Trump won in 2016.Democrats everywhere believe they will benefit from national political trends and Trump’s unpopularity. In every contest, they are attacking their GOP opponents on health care and education. But governor’s races also have their individual rhythms, driven by local concerns, which is why, for instance, Whitmer’s rallying cry to repair Michigan’s roads has caught on.Another reason Democrats expect to make net gains next Tuesday is that they are starting from such a low mark. Republicans, thanks to their successes over the past few cycles, hold 33 governorships and are defending a record 26 of them.Even so, Republicans are not without opportunities to pick up a seat here and there — and in some unexpected places.Oregon’s Democratic Gov. Kate Brown is in a tight race with state legislator Knute Buehler, who, if he wins, would be the first Republican to lead the state since the 1980s. In Connecticut’s open seat, the race between Democrat Ned Lamont and Republican Bob Stefanowski has also tightened considerably.Then there are the anomalies in this very polarized election year. Though moderates Charlie Baker of Massachusetts, Larry Hogan of Maryland and Phil Scott of Vermont are incumbent Republicans governing some of the bluest states in the country, all three appear to be breezing toward reelection without breaking a sweat.The stakes up and down the ballot could hardly be higher, given that more than two dozen of the governors elected next Tuesday will have veto power over how political lines are drawn when their states undertake redistricting in 2021.As Democrats try to rebuild their party nationally, this year’s gubernatorial contests are likely to produce some of the key players who will help them do that. History suggests that successful governors can quickly emerge as outsize figures on the national stage, with some of them inevitably talked up as presidential contenders.Consider the wave of GOP gubernatorial victories in 2009 and 2010. It produced Nikki Haley in South Carolina, Chris Christie in New Jersey, Rick Scott in Florida, Scott Walker in Wisconsin, John Kasich in Ohio, Jan Brewer in Arizona, Brian Sandoval in Nevada and Susana Martinez in New Mexico.The Democratic class of 2018 may be similarly transformative. “This is such a tremendous opportunity to grow homegrown talent. You look at how Republicans changed the dialogue in 2009 and 2010,” says Washington Gov. Jay Inslee, chairman of the Democratic Governors Association.The Democrats also are more reflective of an increasingly diverse country. Among their leading prospects are African Americans Andrew Gillum in Florida and Stacey Abrams in Georgia; Colorado’s Jared Polis, who stands a good chance of becoming the nation’s first openly gay male governor; and in New Mexico, Rep. Michelle Lujan Grisham, a Latina. A dozen of the Democratic gubernatorial candidates are women, compared with only four Republicans.Next Tuesday night looks to be a good one for Democrats in statehouses across the country, but they have a lot of ground to make up. How far they get could be a better indicator of the shape of our politics over the next four years — and beyond — than anything that happens in Washington.Read more:Doug Sosnik: If you expect partisan anger to calm down after the midterms, think againPaul Waldman: This election is up to the youngThe Post’s View: Voters, this is what’s at stake in the midtermsKaitlin Coward and Mili Mitra: Americans will head to the polls in a week. Here’s why some won’t.We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}