{"id": "Pittsburgh Mayor Bill Peduto leads his city through its darkest days", "paragraph": "Desktop notifications are on   | Turn off Get breaking news alerts from  The Washington Post Turn on desktop notifications? PITTSBURGH — Mayor Bill Peduto had told his team not to call on Saturday morning unless it was urgent. He was planning to sleep in, a rarity, which meant certain protocols applied, including that he would answer his phone only if it rang twice. When the first call came around 10 a.m., Peduto was ­cocooned under his blanket and chose to ignore it. When the second call came moments later, the conversation with his chief of staff, Dan Gilman, was swift and matter-of-fact: “There’s been a shooting at Tree of Life, there are multiple people shot, including police.” “Can you pick me up?” Peduto asked. Gilman replied, “I’m already on my way.”Five blocks from his home, the deadliest attack on Jews in the United States was still unfolding. Rain was pouring down on his city. His public safety director was out of town. His constituents, people he knew well — including some inside the synagogue — were about to begin an all-too-common brand of American suffering. As he stood under a tree shielding himself, hoping to stay dry, chaos built around him.He tried to stay calm for himself, for Pittsburgh.“There’s SWAT teams running past us in full body armor, police sirens going off in every direction, cars flying to get there, firefighters already blocking down the streets,” Peduto recalled.He began thinking about evil and how this wasn’t just mass murder, but mass murder of the elderly: Nine of the victims were 65 or older.“It was mass murder that preyed on the elderly for the way they pray at that place they call sanctuary . . . in what should be the most secure place that they have in their life,” Peduto said. “And it took what we were dealing with to a whole different level of evil.”Before the true toll of that evil was known, before bomb squads had secured the building, before the heart-wrenching condolence calls, before the crying, before the string of funerals, before his city was forced into a near-constant state of mourning, Peduto’s phone rang again.It was President Trump.The three-minute phone call with the president jarred Peduto, 54, the popular second-term Democratic mayor of the Steel City, just as he was trying to get his head around what was happening. After offering thoughts and prayers — and pledging anything Peduto needed, including a direct line to the White House — Trump veered directly into policy, Peduto recalled. The president, Peduto said, insisted on discussing harsher death penalty legislation as a way to prevent such atrocities. Peduto was stunned into silence.“I’m literally standing two blocks from 11 bodies right now. Really?” Peduto said, noting that he was numb and believed that talking about the death penalty wasn’t “going to bring them back or deter what had just happened. . . . I ended the conversation pretty quickly after that.”White House spokesmen did not respond to requests for comment about Trump’s call to Peduto. The president said after the shooting that armed guards might have been able to stop the shooter and prevent the massacre, and he said at a campaign rally hours after the shooting that “we have to bring back the death penalty” for those who kill innocent people. (Pennsylvania last executed an inmate in 1999, and in 2015 Gov. Tom Wolf (D) announced a suspension of the death penalty.)The call between Trump and Peduto portended what would become one of the most challenging weeks a mayor can envision, in which Peduto was thrust into a national policy debate and ultimately a string of public clashes with the president — including urging Trump to stay away from the city until the community could bury its dead. Against Peduto’s wishes, Trump spent a few hours in Pittsburgh on Oct. 30 amid a week of funerals to share his condolences. The visit drew peaceful public protests and Peduto’s ire.“It could have been avoided,” Peduto said. “He could have chosen to go to the Holocaust museum and lay a wreath with his wife. Or put together a fund in order to memorialize the 11 people whose lives were lost for perpetuity, in the museum.”Tree of Life Rabbi Jeffrey Myers, who welcomed Trump’s visit, said in a televised interview that he found the president to be “very warm, very consoling” and was “pleasantly surprised by a warm and personal side to the president that I don’t think America has ever seen.”White House press secretary Sarah Sanders told reporters Wednesday that Trump found the afternoon in Pittsburgh to be “very humbling” and “very sad.”Peduto said Trump’s visit angered him not just because it flouted the wishes of families who asked him not to be there but because it stretched the city’s police, forcing him to break one of his first promises to the Jewish community after the attack: that they would have all the security they needed at their schools and houses of worship.“I was at three Jewish schools and I talked to kids as young as first grade, and I had at least three or four police officers with me to introduce themselves, and our goal was very simple: ‘You’re going to see police officers outside your school this next week. We want you to know that they’re here to protect you,’ ” Peduto said on the day of Trump’s visit. “I don’t know if we’ll be able to have officers at those three schools, and if we do, we’ll have one.”It wasn’t the first time Peduto had taken on Trump. Last year, after the United States pulled out of the Paris climate agreement, Peduto pushed back against the president’s assertion that he “was elected to represent the citizens of Pittsburgh, not Paris.”“As the Mayor of Pittsburgh, I can assure you that we will follow the guidelines of the Paris agreement for our people, our economy & future,” Peduto tweeted in response.[Pittsburgh mayor says armed guards are not the solution after shooting]While Peduto was on a national stage for the past week, his attention has been on Pittsburgh. Peduto knows that Pittsburgh City Hall isn’t necessarily the best position for taking on gun control or to combat hate speech across the land. Would he seek higher office when his term ends in 2021?“Not at all,” he said. “In fact, maybe even the opposite. I love my job. . . . This is the only political job other than being a council member that I have sought or that I will seek. I want to work for the city of Pittsburgh. I love my city.”In a series of interviews during the past week as he tended to his grieving city, Peduto said he was trying his hardest to be the leader the Jewish community here needed. Genial, in tortoiseshell glasses and a bushy white beard, Peduto also acknowledges he became an unlikely face of the Trump resistance days before the midterms. While the president spoke about armed guards at places of worship and the death penalty as a deterrent, Peduto spoke about access to firearms and railed against the toxic political discourse and apparent anti-Semitism behind the synagogue attack.But he said he wanted to steer everyone’s focus to the people of Pittsburgh, to a path toward healing.“The advice I got from Libby Schaaf, the mayor of [Oakland, Calif.] who went through a similar tragedy, was have a plan and make it clear and concise and make it transparent,” he said last week. “I’ve been very, very clear since Saturday night that our mission this week is to first and foremost help the families of the victims to get through this week, to get through the funeral process for each and every one of them and focus on their needs.”Those needs have weighed heavily on Peduto, an Italian Catholic mayor who prides himself as an “adopted” member of the Jewish community here. He was the first non-Jewish council member to represent the 8th District, which includes the synagogue’s neighborhood of Squirrel Hill, since the 1980s, and he is a resident of the area, living less than a mile from Tree of Life.“This is where I chose to live,” Peduto said. “I would consider some of the folks to be some of my longest friends, and I’ve had those friendships for 25 years . . . well prior to ever running for office.”Peduto, like many in Squirrel Hill, has many personal connections to the victims and families affected by the massacre. That meant he was forced to play rabbi to some of his own friends, notifying them that their loved ones could be among the dead. One such person was Michele Rosenthal, who knew her two brothers had been at the synagogue, but on the morning of the attack wasn’t sure whether David and Cecil had made it out alive.“She came up and she was trying to find out about both her brothers,” Peduto said with a sigh, his eyes fixed on the floor of his City Hall office. At that point, he had heard secondhand that one brother was dead, but he wasn’t sure, and he didn’t want to pass on a rumor. “So I hugged her and told her any information we have, she’s going to have.”In the minutes after that conversation, he quietly walked up to Rosenthal’s husband, a former colleague and Pittsburgh public safety official, and told him to prepare for the worst. Both David and Cecil, it turned out, had been killed.The personal and professional blurred for Peduto during the past week, as he wrestled with how to shepherd the Jewish community and the city through its darkest episode — and how to get himself through it emotionally. In the first two days after the attack, he slept for three hours and ate little more than a plate of cold pizza and green beans served by his neighbors as he drifted through a haze of funerals, family visitations and public events.He said that one of the most difficult moments was waking up and feeling unsafe in his own home.“I was in my house, and I was scared. I had this fear,” he said. “It was a very strong sense of insecurity. I didn’t know if this was the first domino to fall. I didn’t know.”Another trying moment was when that fear gave way to solitude: Peduto, who is single and lives alone, compared his need to be around people with how some traumatized New Yorkers felt after 9/11. “I could have gone home and just taken a few minutes to do my laundry or to take two hours to rest, but I couldn’t go home,” he said shortly after the funeral of the Rosenthal brothers. “I just couldn’t sit in my house by myself.”So he tried to be everywhere and with everyone. As he went from funeral to funeral to funeral, he arrived early at a synagogue to spend time with mourners, holding their hands, avuncularly hugging them and giving words of comfort.“Anybody who I know is a member of the Jewish community, I reach out and grab their hands and I’ll look them in the eye and I’ll say, ‘Are you okay?’ There is deep sorrow,” Peduto said. “I don’t know how long it will take to dissipate.”Peduto speaks with zeal about the role Pittsburghers have played in helping the city through these moments. When he visited Cappy’s Cafe, a local coffeehouse and bar where his presence is well-known, everyone gave him a hug.“And then, as people were passing by the window, they would just reach out and put their hand on the window. And I got back to my house. I was in a completely different place,” he said. “I have this peace of mind and inner peace right now that is helping me to get that message out.”He also said God had been helping him find that peace. He read off his phone a text that he sent his brother Guy shortly after the attack: “I know it sounds weird but I believe that there is a greater voice that is speaking through me. I can’t explain this. And you know how skeptical I am.” His brother texted in response: “Definitely the divine voice has been guiding you God and Dave are with you. I believe it.”Dave is a reference to Peduto’s beloved older brother, who died unexpectedly of a heart attack two years ago, at age 62. His death has never stopped feeling raw, but Peduto said his presence provided comfort during the past week, as if David were speaking through him.“I was raised to be religious and I have stayed spiritual,” Peduto said, before joking: “The bishop may say I better get to church soon.”Above all it was Peduto’s clashes with Trump that helped focus his mind last week, he said, crystallizing his commitment to the families affected by the massacre.“Somebody asked me, ‘If you had the choice to do it over again, would you have been with the president?’ ” he said. “My answer was, if I had the chance to do it a hundred times, a hundred times I would have been with the families and with my officers.”Nor is he afraid to link the president’s rhetoric to the attack itself.“This obviously was somebody whose decision to kill Jewish people was based on what he was reading, with news of migrants who are trying to escape the hell they are in and potentially on their way to the United States. And somehow that story has become butchered into a story of an invading army and then that story being manipulated that it’s the Jews that are doing it and they’re financing it,” Peduto said. “Then this guy wakes up on a Saturday morning armed to the gills with bullets and guns to kill as many Jewish people as he possibly can.”Peduto said he knows nothing at all about the suspect’s past or the immediate circumstances that led to the attack — noting only that the man appeared to be sufficiently sophisticated to have covered up his tracks online.“He knew what he was doing. He was pretty savvy with software. He knew ways to hide information,” Peduto said. Asked whether that implied the suspect had long been plotting an attack, he said: “Yeah — or very paranoid that what he was doing would one day lead to it.”Perhaps the most difficult day for Peduto, following the initial shock of the massacre, was Tuesday, the day of Trump’s visit, in part because it was Peduto’s 54th birthday. On little sleep and in crisis mode, Peduto said his mother forced him to stop by for a late-night piece of cake with her and his siblings.For him, the sweet moment amid the suffering was symbolic of the next phase of the city’s recovery — a process he says will be an “arc” and a “marathon.” Peduto is fully aware that life will not quickly return to normal for Pittsburgh.“It is going to be a long haul, and this doesn’t just go away. It stays there,” he said. “It will forever change your city.” Sign up for email updates from the \"Confronting the Caliphate\" series.  You have signed up for the \"Confronting the Caliphate\" series. "}