{"id": "Gillum concedes in Florida gubernatorial contest", "paragraph": "Democrat Andrew Gillum conceded, again, to Republican Ron DeSantis in the Florida governor’s race Saturday, wrapping up one of three fiercely contested statewide races and making an ally of President Trump the top official in the key swing state.But the Tallahassee mayor, who would have been the state’s first black governor, promised that “this fight continues” in a Facebook video in which he stood in front of a lake along with his wife, R.J.“R.J. and I wanted to take a moment to congratulate Mr. DeSantis on becoming the governor of the great state of Florida,” Gillum said in the video. “I’ll tell you this has been the journey of our lives.” Gillum, who upset a more established candidate to win the Democratic gubernatorial primary and is seen as a rising star in the Democratic Party, signaled that he was not done with politics.“We wanted to make sure that every single vote … as long as it was a legally cast vote, we wanted those votes to be counted,” Gillum said. “We also want you to know that even though this election may be beyond us … this was not just about an election cycle. This was about creating the kind of change in this state that really allows the voices of everyday people to show up again in our government.\" Gillum had originally conceded on election night, but he rescinded the concession in light of a machine recount for the governor’s contest and the hotly contested Senate race pitting Sen. Bill Nelson (D) against Gov. Rick Scott (R). That race was still not resolved on Saturday as key counties continued counting ballots by hand after a machine recount failed to sufficiently widen the margin.The race for state agricultural commissioner also remained unresolved Saturday.In the governor’s race, the machine recount ended Thursday and confirmed that DeSantis had won the race; Florida election officials had planned to certify DeSantis’s victory Tuesday. But Gillum had not confirmed that he would accept the defeat until Saturday afternoon.After the machine recount, DeSantis said in a statement that he was focused on his transition to governor and invited Gillum to meet with him.“Campaigns of ideas must give way to governing and bringing people together to secure Florida’s future. With the campaign now over, that’s where all of my focus will be,” DeSantis said.The manual recount continued Saturday in the Senate contest in which Scott led narrowly. The machine and then manual recount was automatically triggered because the margin between Scott and Nelson was within the 0.25-percentage-point legal threshold. That recount is required to finish up by noon Sunday and has spotlighted the chaotic election system in Florida, harking back to the 2000 presidential recount there.Going into the recount, Nelson trailed Scott by more than 12,000 votes, and his campaign had hoped a reexamination of ballots — particularly in heavily Democratic Broward County — would help him close the gap. Initial results from the manual recount did not appear to be anywhere near enough for Nelson to overcome the deficit, however.DeSantis’s ascent to the governorship represents a major victory for Trump, who handpicked the congressman when he was an underdog in the GOP primary and headlined two rallies in Florida in the campaign’s closing days.DeSantis aligned himself closely with the president, airing a TV ad in which he was seen reading “The Art of the Deal” to one of his children, and as governor, he would be in a strong position to help Trump’s reelection campaign in the country’s biggest swing state.Gillum ran on progressive policies such as Medicare-for-all and a $15 hourly minimum wage and endured what some saw as racist attacks on his candidacy. After winning the primary, DeSantis said Florida voters shouldn’t “monkey this up” by voting for Gillum, and Trump derided the Democrat as a “thief.” One Gillum supporter called the Democrat “the way of the future.\" \"He handled this with such grace and class,” said Guy Wheeler, 62, a therapist in Fort Lauderdale. “He could have stooped low, but I think even his adversaries, including the president, respect how he handled it.” Wheeler said the Tallahassee mayor addressed the subject of race in the contest in a manner that will help move the conversation forward.“He illuminated the underbelly, and he brought attention to what we all know is out here,” Wheeler said. “I don’t want to compare him to [Barack] Obama, but he’s on the forefront of the movement that’s going to pull this country together.” Amy Gardner, Beth Reinhard, Lori Rozsa and Sean Sullivan contributed to this report.Read more:Nelson’s chance at win in Florida Senate race dwindles as key counties complete hand recount‘It’s insanity!’: How the ‘Brooks Brothers Riot’ killed the 2000 recount in MiamiFederal judge gives Florida voters until Saturday to correct signature problems roiling close races"}