{"id": "Can Taylor Swift’s Instagram turn Tennessee blue? In this Senate candidate’s wildest dreams.", "paragraph": "Taylor Swift continued to flex her political voice a week before the midterm elections, taking to Instagram to announce that she’d cast an early vote for Democratic Senate candidate Phil Bredesen.The singer posted a photo she took with her mother holding flags next to a sign endorsing Bredesen, who is running against Republican Marsha Blackburn to represent Tennessee.“These two Tennessee women voted for the candidate who has proven himself to be reasonable and trustworthy,” Swift wrote in the post. “We want leadership, not fear-based extremism. Early voting goes til Thursday and Election Day is November 6. Please don’t sit this one out.” ⬆️These two Tennessee women⬆️ voted for the candidate who has proven himself to be reasonable and trustworthy. We want leadership, not fear-based extremism. Early voting goes til Thursday and Election Day is November 6. Please don’t sit this one out.A post shared by  Taylor Swift (@taylorswift) on Oct 30, 2018 at 10:37am PDTThe singer has been scrutinized in recent years for what many perceived as a failure to use her far-reaching platform to discuss politics and current events. Swift’s call to action Tuesday follows a stunning and lengthy Instagram post this month in which she enumerated her reasons for endorsing Bredesen over Blackburn.“Her voting record in Congress appalls and terrifies me,” Swift wrote in the Oct. 7 post. She added that she would also vote for Jim Cooper, a Democratic incumbent for the House of Representatives.“In the past I’ve been reluctant to publicly voice my political opinions, but due to several events in my life and the world the past two years, I feel very differently about it now,” Swift wrote. “I always have and always will cast my vote based on which candidate will protect and fight for the human rights I believe we all deserve in this country.”Tuesday’s post came amid Swift’s tour appearances in Australia promoting her album “Reputation.”The 2018 election cycle has drawn more attention than recent midterms in part because of the diverse array of candidates and contested seats across the country. Democrats hope to take control of the House of Representatives for the first time in eight years and also seize the Senate majority for the first time since 2014.A recent NBC poll gives Blackburn a slight edge over Bredesen, though the latter has a higher favorability with likely voters.Read More: Taylor Swift’s stunning statement: Famously apolitical star slams Tennessee Republican, endorses DemocratsThe Taylor Swift ‘controversy’ at the end of 2017 really summed up her yearTaylor Swift explains her blunt testimony during her sexual assault trial"}