{"id": "EU auditors struggle to track use of Turkey refugee money", "paragraph": "BRUSSELS — European Union auditors on Tuesday said that Turkish officials refused to provide information that would help establish whether 1.1 billion euros ($1.2 billion) in EU refugee aid money is being properly spent.The auditors said in a new report that Turkey’s family and social policies ministry declined access to the names, ID numbers and addresses of people who benefited from two EU cash-assistance projects.The projects include a system whereby refugees can withdraw around 30 euros in cash from pre-paid cards to help meet their needs.The auditors said the ministry cited data protection laws as the reason for not providing the information. They said it’s “very rare” for the court to be denied access to documents.Chief court reporter Bettina Jakobson said that “neither the (European) Commission nor the European Court of Auditors was able to track the project beneficiaries from their registration to the payment.”“This is a serious situation,” she said. “Normally as an auditor you would say you would like to follow the flow of money from the cradle to the grave. We cannot do that here.”Jakobson said “there is a risk” that not all the money is reaching the refugees.EU countries agreed in 2016 to give Turkey at least 3 billion euros in Syrian refugee aid money and other incentives to persuade the government in Ankara to stop migrants leaving for Greece.The bloc said that if the money was properly used it could provide a further 3 billion euros in assistance. Around 3.5 million Syrian refugees are estimated to be on Turkish territory.The EU has hailed the agreement with Turkey as a great success as it has helped slash migrant arrival numbers. However, many migrants are still languishing in terrible conditions on the Greek islands.The bloc wants to replicate versions of the agreement with countries in northern Africa as it seeks to stop migrants setting out on dangerous voyages in rickety boats across the Mediterranean Sea.Asked whether the EU refugee money in Turkey has been well spent, Jakobson said “I think so, yes. But of course we could have had more value for money.”Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}