{"id": "President Trump has fact-checkers gasping for air", "paragraph": " Opinion  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  The Onion is on top of the news: “Nation’s Fact-Checkers Confirm They’ll Probably Wrap Up Evaluating Trump’s Statements By 2050 At Latest.”Glenn Kessler, The Post’s Fact Checker columnist, tells the Erik Wemple Blog, “At the moment, there are lots of things entered but blank spaces for the fact-checks so we really have to plow through them.”Aaron Sharockman, executive director of PolitiFact, says, “We really have been stretched to the limit. We’ve been asking a fact-checker to staff nights for the past few weeks to ‘live’ fact check Trump’s remarks on Twitter. We’re just not really able to get to every claim that we might typically wish to verify.”Lori Robertson, managing editor of FactCheck.org, says, “It would be a lot of work to fact-check every single midterm rally and a lot of the stuff he says.”Daniel Dale, Washington bureau chief for the Toronto Star and a fact-checker, says, “I’ve fallen behind because the quantity is so large. It’s an avalanche right now.”Okay, but it’s a misnomer to equate the situation to a natural disaster. This one is man-made. Misinformation — false statements, misleading statements and, yes, lies — keep tumbling from the mouth of President Trump. And this being election season, the falsehoods and lies come in bigger doses. Factba.se breaks down word counts for Trump’s speaking engagements and press appearances, and the word count churned out by recent appearances and interviews is staggering.  Trump has:Hundreds of thousands of words — flimsy and false words — piling up day after day as part of an effort to deceive just enough people to record a “win” in the midterm elections.The Post’s Kessler and two other staffers — Salvador Rizzo and Meg Kelly — are charged with sifting through all of them as part of a continuing effort to track the total number of false or misleading claims made by the president. As of Sept. 12, the database had logged 5,001 such claims. According to Kessler, the imperative of amassing a full count originated in the first 100 days of the Trump presidency, propelled by the notion that logging the low-hanging falsehoods would free up the team to do full-on checks of more complicated statements coming from Trump. Instead, the project has become a “huge albatross,” says Kessler. “There are days where he says 100 or more things that are wrong and with all these interviews and press availabilities and rallies,” there are only so many resources to nail down all the claims. That said, “we’re very committed to it and we’ve gotten a tremendous reader response.”At FactCheck.org, Robertson helps oversee* a team of seven fact-checkers, two of whom are tied up with monitoring fake news on Facebook. The five others churn through Trump pronouncements and other stuff in the political arena. Fact-checking all of Trump’s recent utterances is not part of the plan, says Robertson, who has worked with her team to organize them into three baskets: Trump Stump Speeches: Health Care; Trump Stump Speeches: Economy; and Trump Stump Speeches: Immigration. Those baskets are heavy files and cover a lot of counterfactual terrain. “I think we’re comfortable with what we left out, but there’s always something that’s going to be left out,” says Robertson.Especially in this political season. There are 11 rallies planned between now and the Nov. 6 midterm elections, according to Trump’s campaign website. For fact-checkers, that’s a chilling and leisure-stealing prospect. As Dale notes, the rallies are Trump’s “most dishonest venue.” On his Twitter feed, Dale fact-checks the proceedings in real time, a high-wire act:Trump lies as always that he got the Veterans Choice health program passed after \"44 years\" of non-passage. It was passed under Obama in 2014. Trump signed a law that modified the program.\"We have created almost half a million new manufacturing jobs,\" Trump says of the 378,000 manufacturing jobs added during his presidency, then lies that Obama said there'd be no more manufacturing jobs, which never happened.The plume of false Trump pronouncements in recent months has generated a curiosity: Are the falsehoods spiking because Trump is just talking more, or is he belting out more falsehoods per word? Back in September, Kessler presented the results of an examination of two Trump rallies in Montana, one in July and the other in September. For the first event, 76 percent of the 98 statements were “false, misleading or unsupported by the evidence,” versus 70 percent of the 88 statements for the second event.“I found that he is getting more dishonest per word,” says Dale.Professional hazards do attach to this line of work. “It’s a very depressing duty to read through all these speeches and see so many false things or misleading things said over and over again,” says Kessler, who says his team has identified more than 185 false or misleading statements that Trump has repeated more than three times.The president’s persistence is a long-standing strategy. As Trump reportedly told then-entertainment reporter Billy Bush years ago regarding his false claims about ratings for his TV show: “Billy, look, look, you just tell them and they believe it. That’s it, you just tell them and they believe it. They just do,” Trump said, according to Bush.*Clarification: The original language indicated that Robertson “helms” the staff. As managing editor, she is the No. 2 on the masthead, under Director Eugene Kiely. Also updated to note that Robertson “worked with” her team on fact-checking categories, as opposed to having “directed” it.Read more:E.J. Dionne Jr.: Trump lies. And lies. And liesJennifer Rubin: So many lies, so little time to investigateTom Toles: Time to stop counting Trump’s lies. We’ve hit the total for ‘compulsive liar.’Trump’s hate and lies are inciting extremists. Just ask the analyst who warned us.Erik Wemple: Why does Trump lie? Just ask Billy Bush.We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}