{"id": "Wanda Ferragamo, who expanded family shoe business into a fashion empire, dies at 96", "paragraph": "Wanda Ferragamo, who took over her husband’s shoe-design and manufacturing business after his death and, with the help of her six children, expanded the company of Salvatore Ferragamo into a global fashion empire, died Oct. 19 at her home in Fiesole, Italy. She was 96.Her family issued a statement confirming the death. The cause was not disclosed.Mrs. Ferragamo had no experience in business or in designing shoes when her husband, more than 20 years her senior, died in 1960. She had six children, the youngest of whom was 2, when she assumed the presidency of the company her husband had founded.“In those early days I felt an energy like a lion,” Mrs. Ferragamo told People magazine in 1983. “Everyone was surprised, but I realized it was no use to be alone crying about my destiny. I wanted to keep alive all the efforts my husband made.”Salvatore Ferragamo learned the cobbler’s trade as a boy in Italy, making his first pair of shoes for his sister when he was 9. He later moved to the United States, working in Boston and later in Hollywood, where his elegant designs for women’s shoes became renowned during the early years of moviemaking.After he returned to Italy in 1927, he remained one of the world’s premier shoemakers, with many innovative designs, including the wedge heel, which he made from cork. Before his death, the company had about 350 patents and 20,000 shoe patterns. Clients included Marilyn Monroe, Rita Hayworth, Audrey Hepburn and Greta Garbo.“He studied anatomy and learned that the weight of the body falls vertically on the arch of the foot,” Mrs. Ferragamo told Women’s Wear Daily in 2006. “That’s how he made great yet comfortable shoes.”He also told his wife that his goal was to move beyond shoes and make the family business a full-fledged fashion house, with lines of clothing and accessories in addition to shoes. After his death, Mrs. Ferragamo insisted that the company be known by his full name, Salvatore Ferragamo. “I built on Salvatore’s very solid foundations,” she told WWD. “When he died, I was quite familiar with the materials, the staff, the celebrities. I knew what Saks Fifth Avenue was.”With her daughter Fiamma, then 19, as chief shoe designer, Mrs. Ferragamo began to add to her husband’s legacy. One of the first things she did was to introduce handbags to match the shoes.“I was never into that look,” Mrs. Ferragamo said, “but the bags were a success.”Other items soon followed, including scarves, men’s shoes, jewelry, eyeglasses and ready-to-wear clothes. Boutiques bearing the Ferragamo name opened in New York, Hong Kong, Seoul and other cities.Under Mrs. Ferragamo’s leadership, first as president and later as head of the board of directors, the firm grew from producing 6,500 pairs of shoes a year to more than 10,000 pairs a day. According to Bloomberg News, the business has annual revenue of about $1.6 billion.In time, all of Mrs. Ferragamo’s children — and later some of her grandchildren — would become executives at the company, each taking charge of a different side of the business, based in Florence.One of the rules she established was that each child would receive the same salary. Another was that no in-laws were allowed to work for the company.Wanda Miletti was born Dec. 18, 1921, in Bonito, Italy. Her father was a doctor and the town’s mayor; her mother, a homemaker, died when her daughter was 16.She met Salvatore Ferragamo, who was from the same town, when she was 18 and he was 42. Already wealthy, he was a hospital benefactor. They were married in 1940.Fiamma Ferragamo died in 1998, and another daughter, Fulvia Visconti Ferragamo, who was in charge of silk accessories, died in April. A son, Ferruccio Ferragamo, is now chairman of the firm, and a daughter, Giovanna Ferragamo is vice chairman. Two other sons, Massimo Ferragamo and Leonardo Ferragamo, manage U.S. operations and investments, respectively. Other survivors include dozens of grandchildren and great-grandchildren.Mrs. Ferragamo recalled that when she met her husband, “He said to me, ‘Take off your shoes. I want to measure your feet so I can send you a pair.’ ”Two weeks later, she received a pair of black suede oxfords, with perforations in the shape of scarabs.“When I opened up the box, bellezza” she told People. “I had never worn anything so comfortable. I thought I could fly.”Read more Washington Post obituaries: Robert Bausch, acclaimed Virginia novelist and teacher, dies at 73Bill Mayhugh, longtime D.C. radio host who raised millions for charity, dies at 91Montserrat Caballé, Spanish opera star with ‘indescribably beautiful’ voice, dies at 85localobituariesThank You!You are now subscribed to  Please enter a valid email address You might also like... See all newsletters"}