{"id": "Nations League piquing interest, reaches final qualifiers", "paragraph": "It has plunged Germany into renewed crisis, provoked scenes of jubilation in Kosovo and Gibraltar, and set up what could be an exciting week of international soccer in a summer usually bereft of competition for European countries.The UEFA Nations League might not have been welcomed by some clubs across the continent — Liverpool manager Juergen Klopp called it “the most senseless competition in the world of football” — but it has generated plenty of intriguing story lines to pique interest in its inaugural year.The competition has reached its final set of qualifying matches, and results over the next week will determine which teams will feature in a Final Four mini-tournament in June — when the first Nations League champion will be crowned. Currently, France, Belgium, Portugal and Spain are favorites to be the finalists.The upcoming matches will also establish which of the lower-ranked teams qualify for the Nations League playoffs, from which one place at the 2020 European Championship will be awarded.Here’s a look at what’s at stake:GROUP A1France, the world champion, has won two of its first three group games and will advance to the Final Four with a win over the Netherlands in Rotterdam on Friday. A victory for the Dutch means they can then qualify by beating — or potentially even drawing with — Germany in the group closer in Gelsenkirchen on Monday.France has seen four players, including Paul Pogba, withdraw from the squad through injury on Monday.Germany is last in the group, having collected one point from three games, and is on the brink of relegation to League B featuring Europe’s second-tier nations. Coming after a World Cup where the team failed to get out of the group stage, coach Germany coach Joachim Loew’s decision to stay on in the role is under as much scrutiny as the team’s mettle.GROUP A2Iceland has already been relegated after losing its first three games, leaving Belgium and Switzerland — tied on points — to battle for first place. The Belgians have played a game less, so a home win over Iceland on Thursday will leave them three points clear heading into the group decider in Switzerland on Monday.Belgium is the world’s top-ranked team and will look for revenge for its semifinal loss to France at the World Cup if it does reach the Final Four.GROUP A3There is an added emphasis on which of Portugal or Italy advances, considering the team that qualifies from this group will host the Final Four in June. Portugal is the favorite after winning its first two games, without needing Cristiano Ronaldo, and needs only a point away to Italy on Saturday to guarantee first place.If Italy wins, Portugal can still finish top with a home win on Tuesday over Poland, which has already been relegated after picking up just one point from its first three games.GROUP A4Spain looked on course to qualify comfortably from a group also containing England and World Cup runner-up Croatia after beating both teams in its first two games. Losing to England 3-2 in Sevilla last month, in arguably the standout match of the entire group stage so far, has kept things alive.If Spain loses to Croatia in Zagreb on Thursday, England can finish first with a win over the Croats at Wembley Stadium on Sunday.Spain coach Luis Enrique has called up Barcelona left back Jordi Alba for the first time since taking charge of the team after the World Cup.LEAGUE BUkraine became the first country to secure promotion to Group A for the second Nations League, in 2020. Bosnia and Russia are well clear in their groups and need one point from their final matches, against Austria and Sweden respectively, to also ensure promotion.In the other group in League B, Wales and Denmark are fighting for first place. They meet in Cardiff on Friday, when a Welsh win would guarantee them top spot.The Nations League also offers a second chance to qualify for the European Championship in 2020. The 16 group winners in Leagues A, B, C and D — or the next best-placed teams who have not already qualified via the European qualifiers starting in March — will progress to the playoffs to compete for the last four qualifying places.It means the so-called minnows of Europe have something tangible to play for.LEAGUE CNo teams have won their group so far, though Finland is close after winning its first four games in Group C2 and needs one point from its last two.In Group C1, Israel and Scotland are batting for first place; in Group C3, Norway and Bulgaria are tied on points with two games left; and in Group C4, there is a three-way fight between Serbia, Montenegro and Romania.LEAGUE DIn the league containing Europe’s weakest countries, Gibraltar and Kosovo — two of the newest members of UEFA — have claimed their first ever competitive international wins.Kosovo is top of Group D3, two points clear of Azerbaijan with two games left. Gibraltar is second behind Macedonia in Group D4. Georgia has won Group D1, and Luxembourg and Belarus appear to be fighting for first place in Group D2.___More AP soccer: https://apnews.com/tag/apf-Soccer and https://twitter.com/AP_Sports___Steve Douglas is at www.twitter.com/sdouglas80Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}