{"id": "Happy Hour Roundup", "paragraph": " Opinion  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  * Devlin Barrett has news of a bizarre twist in the Russia investigation:A spokesman for Robert S. Mueller III said Tuesday that the special counsel’s office has asked the FBI to examine claims that women were offered money to say Mueller behaved inappropriately toward them decades ago.The spokesman, Peter Carr, issued a statement saying that “when we learned last week of allegations that women were offered money to make false claims about the special counsel, we immediately referred the matter to the FBI for investigation.”Carr’s statement comes as Jack Burkman, a conservative lobbyist, tweeted that Thursday he “will reveal the first of special counsel Robert Mueller’s sex assault victims. I applaud the courage and dignity and grace and strength of my client.”Burkman gained notoriety when he promoted conspiracy theories regarding the still-unsolved killing in 2016 of Democratic National Committee staffer Seth Rich. Those theories have been disputed by law enforcement officials.I’d take this opportunity to remind you that the ludicrous and cruel conspiracy theories about Rich were flogged endlessly by Fox News, particularly President Trump’s good friend Sean Hannity.* Moriah Balingit, Avi Selk, and Mark Berman report that Trump isn’t exactly getting a warm welcome in Pittsburgh:A mourning family doesn’t want to meet him. Leaders of his own party declined to join him. The mayor has explicitly asked him not to come. Protesters have mobilized. And yet President Trump visited this grief-stricken city Tuesday, amid accusations that he and his administration continue to fuel the anti-Semitism that inspired Saturday’s massacre inside a synagogue.The president and first lady Melania Trump arrived in Pittsburgh on Tuesday afternoon, not long after the first funerals began for the 11 victims of the mass shooting at Tree of Life synagogue. More than 1,300 people have signed up for a demonstration at the same time — declaring Trump “unwelcome in our city and in our country.”How long before he attacks the entire city of Pittsburgh on Twitter?* Juliet Eilperin and Josh Dawsey report that the inspector general for the Department of Interior has referred its probe of Secretary Ryan Zinke to the Justice Department for further investigation.* Michelle Alexander asks what kind of world we’d try to build if we didn’t know what our place in it would be.* Rick Hasen explains how Democrats can undo voter suppression without packing the Supreme Court.* Garrett Epps says that despite what Trump thinks, there’s no ambiguity in the 14th Amendment.* Steve Benen offers a good roundup of all of Rep. Steve King’s travails.* Eugene Robinson has just about had it with people saying “both sides” need to do better.* Cameron Joseph reports that the head of the Republican House campaign arm has condemned King’s white supremacist remarks, which is certainly a first.* Pema Levy finds the two controversial legal scholars who are the source of Trump’s crackpot idea about birthright citizenship.* A Fox poll shows the Georgia Senate race virtually tied, with Stacey Abrams leading Brian Kemp 48-47.* And Judy Thomas has the story of a Missouri GOP nominee for a state assembly seat whose daughter is telling people that they shouldn’t vote for her father because he’s a racist and an anti-Semite.We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites."}