{"id": "The Latest: Exit poll: Poland ruling party losing mayorships", "paragraph": "WARSAW, Poland — The Latest on local elections in Poland (all times local):9:05 p.m.An exit poll suggests Poland’s populist ruling party has lost mayoral elections in Krakow and Gdansk in local runoff votes.Runoff races for mayor in 649 cities, towns and local municipalities took place on Sunday, two weeks after a first round of voting. Projections were not immediately available for most places.The elections are being watched as a test of national support for the ruling Law and Justice party, which has remained popular with its conservative base by focusing on traditional values and welfare programs.The party’s critics accuse it of moving in an authoritarian direction through efforts to control judicial system.During the Oct. 21 first round of voting, Law and Justice strengthened its position in regional assemblies but lost mayoral races outright in Warsaw, Poznan and Lodz to a centrist pro-European Union coalition led by the Civic Platform party.___8:45 a.m.Poles are voting in local runoff elections to choose the mayors of several key cities, including Krakow and Gdansk, and more than 640 other towns and smaller localities.A first round on Oct. 21 saw the ruling populist Law and Justice party strengthen its showing in regional assemblies but lose mayoral races outright in Warsaw, Poznan and Lodz to a centrist pro-European Union coalition led by the Civic Platform party.The results so far highlight the deep divisions between Poland’s cities, which have many liberal voters, and a rural heartland largely supportive of the conservative ruling party despite its conflicts with the EU and accusations that it is taking an authoritarian direction.The centrist opposition is favored to win in Krakow and Gdansk in Sunday’s voting, which is taking place in 649 municipalities.Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}