{"id": "Continent’s oldest spear points provide new clues about the first Americans", "paragraph": "Desktop notifications are on   | Turn off Get breaking news alerts from  The Washington Post Turn on desktop notifications?For as long as Buttermilk Creek has wound its way through Texas Hill Country, its spring-fed waters have carved through the region’s dark, dense clays, cutting away layers of earth to expose the rock — and the history — below.Here, archaeologists have uncovered evidence of a human settlement stretching back as far as 15,500 years: hammer stones and broken knives, fragments of fractured tools. And now, scientists say, the Buttermilk Creek complex has offered up the oldest known spearheads in North America.The new “projectile points,” reported this week in the journal Science Advances, come in two unusual shapes — a fact that geologist Mike Waters, who oversaw the excavation, found both “bizarre” and “really exciting.” The find adds to the evidence that the first people arrived in the Americas earlier than researchers thought, even as it raises new questions about who those people were and how they made their epic migration into the continent.“This is a really fascinating paper,” said Jennifer Raff, an anthropological geneticist at the University of Kansas who was not involved in the new study. “It’s filling in some of the gaps in the archaeological record regarding the Clovis complex and the histories of the very first peoples in the Americas.If the projectile point was the cellphone of the Pleistocene — an omnipresent technology that shaped cultures and defined daily life — the Clovis tools were the iPhone X. These points, named for the city in New Mexico where they were first found, featured a fluted bottom and rounded sides tapering to a sharp point.The distinctive spearheads are scattered throughout the rock record between 10,000 and 13,500 years ago, from the East Coast to the Rocky Mountains and as far south as Venezuela. The tools are so ubiquitous that for nearly a century, archaeologists thought that the Clovis tradition represented the first people to arrive in the Americas.But research in recent decades has revealed archaeological sites much older than Clovis, and genetic analyses of modern Native Americans suggest their ancestors crossed a land bridge from Asia to Alaska about 20,000 years ago, then migrated down the Pacific coast between 20,000 and 15,000 years before present.So who exactly were these early Americans?The new points uncovered at Buttermilk Creek may offer a clue, said Waters, who directs the Center for the Study of the First Americans at Texas A&M University. Because tools are so essential to the tasks of survival — hunting, cooking, building, killing — they can say a great deal about the people who wielded them.In more than 10 years of excavations at his site, Waters and his colleagues have found Clovis points in a rock layer dating to about 13,000 years ago. Below that, in older rocks, they uncovered scores of stone point fragments, but no whole spearheads. It was difficult to know if they were looking at older Clovis artifacts, or something entirely different.Then, in 2015, the archaeologists uncovered two perfectly preserved artifacts: One triangular point, which resembles a predator’s sharp tooth, and one lobe-shaped projectile with a tapered, or “stemmed,” bottom. With these whole points as models, Waters’s team was able to make sense of the 10 additional fragments they collected. They seemed subtly but significantly different from Clovis and other toolmaking traditions — neither a clear ancestor to the later technology, nor an obvious competitor.“I just thought, ‘Holy cow,’” Waters recalled. “Whenever you see something for the first time that you didn’t expect, it’s always very exciting and exhilarating.”Radiocarbon dating of the soils where the points were found suggested they were made between 13,500 and 15,500 years ago — offering a significant piece of archaeological evidence for a migration into the Americas that predates Clovis.But the points also raise new questions, Waters said: Were the Clovis people descendants of these early inhabitants who came up with a new toolmaking technique? Or did they migrate separately into the continent before scattering their tools across the Americas?“We’re just beginning to answer that,” Waters said.Skye Gilham, a forensic anthropologist who is a member of the Blackfeet tribe in northern Montana, said that recent archaeological and genetic research has been helpful in establishing a scientific link between the first Americans and their descendants living today. Findings like Waters', which provide evidence for her people’s long history in the Americas, have helped ensure the return of native remains to their communities.“We have said that we have always been here, our homeland,” Gilham said. Archaeology and genetics, she said, “reaffirm\" that.Read more: How did the first Americans get here? A story of boats, bones and iceThe oldest footprints in North America are right where native historians said they should beArchaeology shocker: Study claims humans reached the Americas 130,000 years ago Sign up for email updates from the \"Confronting the Caliphate\" series.  You have signed up for the \"Confronting the Caliphate\" series. "}