{"id": "Migrant caravan: One reason Central Americans are going all the way to Tijuana to reach the U.S. border? El Chapo", "paragraph": " Analysis  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  Large groups of Central American migrants are traveling north through Mexico, defying President Trump. Although Trump has described the groups as “invaders,” those making the journey are unarmed, and many are women and children who say their goal is to seek asylum in the United States. We have been tracking the caravans' advance through Mexico and U.S. preparations for their arrival at the border. What you need to know:Why is the caravan going all the way to Tijuana to reach the U.S. border? One reason is “El Chapo.”Last week, after caravan members recuperated for several days at a Mexico City sports complex, they held a vote. The group opted to travel all the way to Tijuana, Mexico’s largest border city, instead of taking a much shorter route toward the Rio Grande Valley of South Texas.So why would they decide to go more than twice as far to reach the U.S. border?The simplest explanation is that the activist group guiding the caravan, Pueblo Sin Fronteras (People Without Borders), has a strong support network in California, a “sanctuary” state where local officials and courts are more sympathetic to migrants.But there’s another, idiosyncratic reason the caravan is going all the way to Tijuana: its reputation as a safer route, where migrants are less vulnerable to the kidnapping gangs and extortionists that prey on Central Americans.This has to do, in no small part, with the legacy of Joaquín “El Chapo” Guzmán, the indicted Mexican drug kingpin whose federal grand jury trial began this week in New York.Over nearly three decades, Guzmán built the Sinaloa drug cartel into the world’s wealthiest and most powerful trafficking organization. And despite his capture, the Sinaloa group continues to dominate the most lucrative drug smuggling routes along Mexico’s Pacific coast and into California, including the grand jewel of the North American narcotics trade, the San Ysidro port of entry. Which is also the destination for the migrant caravan.[El Chapo trial begins: Drug kingpin faces life in prison]Connecting Tijuana to California, San Ysidro is the world’s busiest border crossing, receiving nearly 100,000 northbound vehicles and pedestrians a day. It is also the single largest gateway for high-value narcotics into the United States, accounting for nearly half of the hard drugs-- heroin, cocaine, fentanyl and methamphetamine-- seized along the entire border, smuggled mostly in fake vehicle compartments.Under Guzmán, Sinaloa waged sanguinary warfare against its rivals, eventually winning control of the entire western portion of the U.S.-Mexico border. But Sinaloa became so dominant in the North American drug trade that the criminal groups along Mexico’s eastern border (opposite Texas) developed a different criminal portfolio, especially starting in the late 2000s, in order to compete.The two most powerful groups there, the Gulf Cartel and its now-diminished but still-dreaded rival, Los Zetas, were overshadowed and outsmarted by Guzmán in the drug trade, so they looked to diversify into other sources of revenue. Central American migration to the United States was increasing, and these groups saw tens of thousands of Hondurans, Guatemala and Salvadorans passing through areas under their control to reach the Rio Grande. Many were riding on freight trains and buses. It wasn’t hard to find them.In 2010, Los Zetas kidnapped and massacred 72 migrants on a remote ranch an hour south of the U.S. border, an act of horrifying depravity with a ruthless business objective. The group was determined to extract profits from every migrant and smuggling guide passing through its territory. Anyone who didn’t pay risked kidnapping, torture and death. And those who didn’t pay enough could be abducted and held for ransom until relatives living in the United States handed over their life savings. They knew that almost everyone heading north had a relative or loved one financing the journey.Their reign of terror has taken a terrible toll. Mexican human rights officials have discovered more than 1,300 mass graves since 2007, and an untold number of Central American migrants have gone missing in the Gulf Coast Mexican states of Veracruz and Tamaulipas along the route to south Texas.This sordid state of affairs never fully developed along Mexico’s Pacific Coast and the areas under the control of Guzmán Sinaloa cartel. The Sinaloans would sometimes abduct young men and impress them into service as drug mules, fitting them with marijuana-stuffed backpacks for a grueling trek through the Arizona desert. But some Central Americans viewed this as a mutually beneficial arrangement. A free guided trip into the United States was the price for carrying Sinaloan brick weed.You would also hear from many Mexicans that Guzmán was a drug kingpin who lived by a code, like the Sicilian mob bosses or the Omar character in “The Wire.” A tunnel-digging, meth-making, cocaine-shipping mastermind, and a killer, but not a monster who kidnaps and butchers humble Central American migrants. This appeared to explain, more than anything, why Central Americans were routinely murdered and disappeared in one part of Mexico but not (or far less) in another.So when it came time last week for caravan members to pick between a shorter route to Texas or a much longer one to Tijuana, they chose the latter.One leads to the migrant version of Mordor. The other is merely dangerous.Hasn’t illegal immigration declined by a lot? Why all the fuss over a few thousand people in caravans? In 2000, the year before the Sept. 11 terrorist attacks, the U.S. Border Patrol made 1.6 million arrests along the Mexico border, a record. The agency had fewer than half as many agents in the field then, and in several areas along the border those agents would spend an entire shift rounding up and deporting large numbers of migrants who were overwhelmingly from Mexico and male.The Arizona deserts were the border’s busiest place, and agents in the Tucson sector made more than 50,000 arrests every month that year. As one agent who worked during that era told The Post, “it was like a riot every night.”The prevailing currents at the border have completely changed since then. Last year, the Border Patrol made 303,916 apprehensions, the lowest level since 1971, and while that figure jumped to 396,579 during the fiscal year ending Sept. 30, border arrests remain far closer to historic lows. (See table below.)So what’s the big deal with a few thousand people in a caravan? Why is the Trump administration claiming there is a “crisis” at the border?The big change — and the thing that is so galling to Border Patrol agents and the Trump administration more broadly — is that the government now has an extremely difficult time detaining and deporting the migrants taken into custody. They’re Central American families and kids seeking asylum, not Mexican laborers who are, by comparison, easy to deport.Basically, the government’s enforcement model is being short-circuited by Central American migrants who, unlike Mexican nationals, cannot be bused to the border and deported. This new wave of migrants consists increasingly of parents with children who request humanitarian protection and express a fear of return, steps that slow or stop their deportation.This is the administrative path to a shot at a better life in America.[The border is tougher to cross than ever, but there's still one way into America]Most migrants who arrive with children turn themselves in to Border Patrol agents and go through a screening to see if their fears are “credible.” They typically spend a few days in custody, and then they are released pending a court appearance for their asylum claims, because courts have limited the government’s ability to hold kids in immigration jails for longer than 20 days.This is the model the Trump administration abhors as “catch and release” even as the practice has become its de facto enforcement policy at the border.One result is that more than half of all those taken into custody along the Mexico border today are family groups or underage minors traveling alone. And the number of “family units” (consisting of at least one parent and child) is at a record high.So while the migrant caravans moving their way north — perhaps 5,000 to 10,000 travelers in total — amount to only 10 to 20 percent of the 50,000 or so people arrested along the border each month, they symbolize what has become, for the Trump administration, a real crisis for its enforcement model.[The caravan on the road in Mexico is the size of a small town. But it’s a town under pressure.]This is why we’re also likely to see new administrative attempts to tighten the asylum process, perhaps in the coming days, while the caravans remain more than 600 miles from the U.S. border.Trump is threatening to jail caravan migrants in “massive tent cities” and warned that U.S. troops could fire on anyone throwing rocks. Did that scare anyone?The Washington Post’s Michael E. Miller spoke to caravan members late Thursday, as news of Trump’s speech reached their encampment in Matias Romero Avendano, Mexico. Here’s his dispatch:The migrants were resting in a soggy sports field on the edge of town, a few miles from where Mexican families celebrated the Day of the Dead in the town cemetery.“They won’t shoot because we’re not criminals,” Erik Miranda, 39, said of Trump’s threat that U.S. troops would open fire if attacked with rocks. “I lived there for 15 years. I know the United States is a country of laws.”Miranda said he had been deported from America twice despite asking for asylum after being shot three times by the 18th Street gang in his native Honduras. “If the caravan reaches the border and enters, these people will have their day in court in front of a judge,” he said.Miranda said he would not try to enter the United States again but instead was hoping to reach Mexico City, where he planned to request asylum.“How horrible,” Daniela Carbajal, 27, said when told of Trump’s threat. “I’m not justifying throwing rocks but remember: We have children among us.”As she spoke, her 9-year-old son, Oscar, watched a video advising migrants of their rights, his head poking out of an orange tent Carbajal and her husband had just bought for 150 pesos. Inside, her 3-year-old daughter, Karla, was sound asleep. [Read the full story.]Could Trump’s military deployment turn lethal, and under what circumstances are U.S. troops authorized to use force?Trump’s threats carry a not-so-veiled suggestion of military force. Such a scenario has long been promoted by extremists who believe lethal violence is an acceptable response to illegal border crossings. And the president himself repeatedly depicts the migrants in warlike terms, characterizing their journey as an “invasion” consisting of “tough fighters” who “fought back hard and viciously against Mexico,” according to his tweets.All of this raises a disturbing question: Under what circumstances would U.S. troops open fire?The Pentagon has been deeply wary of such a scenario. The 2,000 or so National Guard troops who have been assigned to the border since April are not supposed to make arrests or carry weapons, as a general rule. And active-duty forces are limited by the Posse Comitatus Act, a 19th-century law curbing troops' ability to carry out law enforcement duties on U.S. soil.At the border, the use of active-duty forces has also been haunted by a 1997 fatal shooting of a teenage shepherd — an American citizen — who U.S. Marines thought was a drug runner.The new deployment, an operation the Pentagon is calling “Faithful Patriot,” appears less troubled by such a possibility. The troops — at least 5,200 but maybe more — will include armed units, and their rules of engagement appear to be significantly less restrictive.The latest caravan groups have acted more unruly and confrontational toward authorities in their path. One contingent broke through a gate at the Guatemala-Mexico border last month, and members of a second caravan pelted Mexican police with bottles and stones. A man from Honduras died in the clashes, apparently struck in the head by a rubber bullet.If a large part of the caravan reaches the U.S. border — by no means a sure thing — U.S. authorities fear a large crowd could attempt to overrun U.S. barriers and enter the country by force. But that alone would not be sufficient to justify a lethal response from troops.[Border deployment puts Mattis and the military in political crosshairs]As The Post’s Paul Sonne, Dan Lamothe and Missy Ryan report, citing Pentagon planning documents, “troops will deploy with a mixture of lethal and nonlethal weapons and are authorized to use deadly force in defense of ‘all persons, foreign or domestic, who are faced with imminent threat of death or serious bodily harm, and where lesser means have failed or cannot be reasonably employed.’”That said, the soldiers are supposed to operate in an auxiliary role. The Border Patrol and U.S. customs officers will be the ones making arrests and potentially confronting caravan members if they attempt to enter the country unlawfully.Among the activities the soldiers are supposed to carry out: constructing barriers and fencing, providing helicopters and fixed-wing aircraft to transport Border Patrol agents and providing medical care.How did this caravan get so big?The United Nations estimated that more than 7,000 people have joined the caravan, although the size of the group appears to be fluid. Most of those traveling north are from Honduras, where the caravan originated. There has been no evidence of any “Middle Easterners” in the group’s ranks, as Trump has alleged.Predictions about how many of its members will eventually reach the U.S. border are difficult to make. It is probable that the caravan’s size will remain elastic as some drop out or turn back, and others join in.It’s important to remember that more than 50,000 people were taken into custody last month along the U.S.-Mexico border, so even if 5,000 caravan members go all the way, they would represent a fraction of current flows. As one Homeland Security official put it: “We get a caravan every day.”Many of the migrants have told reporters that their decision to leave was made in a flash. They had been waiting for an opportunity to come along but could not afford to attempt the journey any other way. The cost of hiring a “coyote” smuggling guide to go from Central America to the United States can exceed $10,000. But grabbing a backpack and hitting the road with a mass movement? That’s free.And on a route beset by kidnapping gangs, extortionists and other predatory criminals, joining a caravan offers a degree of protection. There’s safety in numbers, and the processions attract many police officers.Why doesn’t the Mexican government stop the caravan?The Trump administration is leaning hard on Mexico to make a stand and block the group’s advance. There are several reasons that has not happened — and remains unlikely to happen anytime soon.A big one: The six-year term of President Enrique Peña Nieto will end Dec. 1. He is one of the most unpopular presidents in recent Mexican history. He has little incentive to use escalating force on impoverished Central Americans to appease Trump. That would be humiliating for him.Mexico already is taking steps it has not in the past, soliciting help from the United Nations to screen and process asylum seekers, and the government says that more than 1,000 caravan members have done so. Mexican federal police officers also held off the caravan at the border with Guatemala last week, although many of those migrants simply waded through the river to continue their journey.It is important to note that there is little stigma in Mexico to joining a caravan like this in hopes of reaching the United States. Poor Central American migrants are treated more like pilgrims than criminals. When they arrive in Mexican towns, people offer food, clothing and other donations as a way to support them and to encourage them to move on.In a heavily Catholic country, and at a time when Pope Francis has urged sympathy and support for migrants worldwide, many Mexicans think they have a moral duty to help the caravan. An attempt by their government to repress the caravan by force would clash with that sentiment and court political disaster.Trump’s show of force at the border is an election ploy, right? The president’s political calculation here is impossible to ignore. He seems determined to make the caravan appear as dangerous and threatening as possible — and to cast himself as a kind of border sheriff. He has claimed, without evidence, that “Middle Easterners” have infiltrated the group. Administration officials insist that the caravan is full of gang members and criminals, again without proof, because, well, odds are that bad people are mixed in.That said, the migrant caravan, and another one with about 3,000 people that crossed into Mexico on Monday, have stirred up some bona fide fretting at the Department of Homeland Security. The scenes from the Guatemala-Mexico border last week, in which thousands of people broke down a border gate and forced their way into Mexico, are nightmare scenarios for DHS.[Read the full story.]The White House wants a travel ban for the Mexico border. How would that work?The Post and other media outlets have reported on a plan under consideration at the White House that would use the president’s executive powers to deny entry to Central Americans, and restrict or suspend their ability to seek asylum in the United States. Details of the proposal remain sketchy, but draft versions would rely on the same legal provisions the administration used during the travel ban in early 2017.By citing national security concerns, Trump could refuse entry to certain Central American nationals or another subgroup, including members of the caravan. Trump is also weighing a measure that would deny asylum seekers the ability to seek humanitarian relief once they reach U.S. soil, according to administration officials and people familiar with the proposals.Both moves would land the administration in federal court “in about five minutes,” one former Homeland Security official said, and it’s not hard to imagine lower court judges slapping an injunction on a White House “border ban” in about as much time.Trump already won legal victories on this front. Wouldn’t a ban on Central Americans and asylum denials stop the caravan?Not likely. The administration’s biggest challenge at the border is not that too many Central American migrants are being allowed in or that they are easily winning asylum. Rather, those who cross illegally — between ports of entry — must be taken into custody. U.S. detention capacity is nearly maxed, and U.S. courts limit the government’s ability to keep children in immigration jails beyond 20 days.It is not as though huge numbers of Central Americans are winning asylum, either. The latest statistics show that fewer than 10 percent of Central American applicants are granted asylum by an immigration judge, but it is the act of coming over, applying for it and waiting for the legal process to play out that has become such an alluring way for impoverished migrants to live and work in the United States, if only for a few years.That brings us the big flaw with the Trump administration’s proposal for a “ban.”It is one thing to do it at a foreign airport thousands of miles away. It is another to try it on the banks of the Rio Grande. If members of the caravan reach the U.S. border and are denied the ability to approach ports of entry — the official crossings — they probably will go to the river or into the desert where they can walk across.Then they will be on U.S. soil. The Border Patrol will have to take them into custody. Unless Mexico agrees to take them back, the migrants would have to be held in detention until they can be deported. But if the migrants are accompanied by children, the government has virtually nowhere to put them.Didn’t Trump already deploy the National Guard to the border?Yes. Trump sent U.S. troops to the border this spring, when another caravan piqued his anger and fueled similarly bombastic tweets. At the time, Defense Secretary Jim Mattis authorized the deployment of up to 4,000 National Guard troops but restricted their activities — so they don’t make arrests, carry weapons or interact with migrants.About 1,600 Guard troops remain along the border, mostly in Texas.[Pentagon plans to dispatch 800 more troops to U.S.-Mexico border in response to migrant caravan]U.S. Border Patrol officials insist that the Guard troops are a big help, saying they free up agents to concentrate on drug interdiction and enforcement duties “along the front line.\"The Guard forces fly drones, monitor sensors and operate other surveillance equipment. They perform data entry tasks at Border Patrol stations. Others have been assigned more mundane jobs such as clearing vegetation and tending to horse stables.Isn’t that what happened with the last caravan — the one that angered Trump earlier this year?Yes. That caravan, organized by a migration activist group, Pueblo Sin Fronteras, grew to about 1,500 people at one point. About 400 ended up crossing into the United States to seek asylum.The big difference? That caravan was organized. It had leaders, legal advisers and a support network in the United States and Mexico. Most important, it had chartered buses.Rather than attempting to cross in the Rio Grande Valley — the closest place, geographically, to Central America — that caravan traveled all the way to Tijuana. That made sense, because it had a large contingent of supporters on the California side. The caravan’s legal advisers steered members to the U.S. ports of entry, where it is legal to enter the United States to request asylum.Read more:Graphic: Navigating the invisible boundary and physical barriers that define the U.S.-Mexico borderThe border is tougher to cross than ever. But there’s still one way into America.Seeking asylum: One family journeys with the caravan from Honduras to the Bronx"}