{"id": "Concerns about voter access dominate final stretch before Election Day", "paragraph": "On Saturday, voting rights advocates alerted lawyers for the Georgia secretary of state, as well as the FBI, of a potential vulnerability in the state’s election system that they said could allow hackers to obtain and alter private voter information.On Sunday, Republican Brian Kemp, who as secretary of state controls the state’s election process even as he runs for governor, responded by accusing Democrats of possessing software that could have extracted personal voter data, and his office opened an investigation into what it described as “a failed attempt to hack the state’s voter registration system.”Kemp’s campaign called Democrats “power-hungry radicals” who should be held to account for “their criminal behavior.” Democrats called the probe “an abuse of power.”The controversy is the latest in a rash of concerns that have flared across the country, as candidates in both parties have traded accusations about threats to ballot integrity amid multiple reports about voting irregularities. The issue has started to affect voter confidence, according to new polling, which shows that a majority of voters in both parties are deeply suspicious about the opposing party’s commitment to fair elections.The growing uproar follows a spate of restrictive voting laws passed by Republicans in recent years that are now playing out across the country in closely contested races for House, Senate and governor. Lawsuits have been filed and harsh rhetoric has become the norm, with Republicans saying the tough new rules are necessary to combat voter fraud, while voting rights activists say the laws disproportionately affect young Americans and minorities, who tend to vote Democratic.“All levels of government and Law Enforcement are watching carefully for VOTER FRAUD, including during EARLY VOTING,” President Trump tweeted Oct. 20. “Cheat at your own peril. Violators will be subject to maximum penalties, both civil and criminal!”There is no evidence of widespread voter fraud in the United States. In fact, study after study has shown that voter fraud is exceedingly rare. Trump launched a commission to investigate the issue shortly after he took office in 2017, but the commission disbanded early this year after many states refused to turn over voter information. During the months it was in place, the commission did not discover evidence of widespread voter fraud.Nowhere has the issue been more prominent than in Georgia, where worries about voter disenfranchisement have dominated the bitter race for governor between Kemp and Democrat Stacey Abrams, who is attempting to become the first female African American governor in the nation’s history. The vast majority of voter registration applications suspended this year under a strict new law have been those of African Americans.A spokeswoman for the secretary of state said Kemp’s decision to investigate the potential cyber breach was proper because she said an email from Democratic Party officials contained software capable of trying to hack into the state’s election system. Using such software is a crime, she said, which is why she posted a headline about the case on the secretary of state’s government website — “AFTER FAILED HACKING ATTEMPT, SOS LAUNCHES INVESTIGATION INTO GEORGIA DEMOCRATIC PARTY” — directly beneath a voter’s guide to polling locations.“Our position is that these were failed attempts to hack the system,” said Kemp spokeswoman Candice Broce. “All the evidence indicates that, and we’re still looking into it.”Democrats said the email in question came from someone not affiliated with the party, and they produced an email showing that the party’s voter protection chief forwarded it to two cyber security experts. The party accused Kemp of “defamatory accusations,” while Abrams’s campaign said Kemp’s “false accusations” were “a pathetic attempt to cover up for his failures” to secure the state’s voting system.[Brian Kemp’s office orders ‘hacking’ probe of Georgia Democrats on eve of election he’s competing in]Voting rights advocates are monitoring several other issues across the country:• In several battleground states, including Georgia, Nevada, Indiana and Wisconsin, hundreds of thousands of inactive voters have been removed from the rolls since 2016. Election officials have said the “list maintenance” comes after voters had not cast ballots in at least two federal elections, had moved or did not respond to information requests to verify their registrations. Voting rights activists are calling some of the activity improper voter “purges.” A federal appeals panel ruled last week that Ohio must allow thousands of voters removed from the rolls between 2011 and 2015 to vote provisionally Tuesday.• In North Dakota, a restrictive voter ID law that requires voters to have a street address may make it harder for Native Americans, who are less likely to have the necessary identification, to cast ballots.• In Texas, some voters casting their ballots early on electronic machines reported that after choosing a straight Democratic ticket, the screen switched their choice for Senate from Democrat Beto O’Rourke to Republican Ted Cruz. State election officials said they had received fewer than 20 reports of the glitch, which they blamed on old voting machines and did not expect it to influence the outcome. A small number of similar reports have emerged in North Carolina and Georgia.• In Dodge City, Kan., where 60 percent of residents are Latino, Ford County Clerk Deborah Cox is under fire for moving the city’s only polling location from downtown to a location outside the city limits and a mile from the nearest bus stop, citing looming construction that has not yet started. A federal judge ruled Thursday that it is too close to Election Day to reopen the original location, but he also noted that he was “troubled” by an email in which Cox wrote “LOL” after the American Civil Liberties Union asked her to help publicize their voter information hotline.Kansas Secretary of State Kris Kobach, a Republican in a close race for governor, has been a leading proponent of stricter voting laws. His office weighed in on the Dodge City controversy by claiming that a second location could allow for double voting.[Tuesday may be the ‘warm-up’ for Russians seeking to target 2020]All of it has primed an already polarized political environment in which both Democratic and Republican voters are deeply suspicious of the opposing party’s commitment to fair elections.According to a new poll from the Pew Research Center, most Americans have confidence that local poll workers will do a good job running elections Tuesday — but majorities of both Democrats (64 percent) and Republicans (56 percent) say the opposing party has “little or no commitment to fair and accurate elections.”Layered on top of those anxieties are widespread worries about whether the United States is prepared to fend off hacking efforts by foreign governments and concerns about the integrity of electronic voting systems. According to the Pew poll, 85 percent of Americans favor requiring electronic voting machines to produce paper ballot backups. At least a dozen states do not have that system.In Georgia, two regulations have caused worries: a new law demanding that voter information on registration applications exactly match existing government records — even down to a hyphen — and another requirement that a voter’s signature match on an absentee ballot application and the ballot itself.Although the signature requirement is not new, a surge in absentee voting this year — and in rejected ballots — has led to scrutiny of its enforcement.Voting rights groups sued after election officials rejected hundreds of absentee ballots and suspended more than 50,000 registration applications, the vast majority of them from African Americans.Two federal judges sided with the plaintiffs in both cases, ordering state and local officials to stop rejecting absentee ballots over signature mismatches and to give voters a chance to verify their identity before tossing registrations.“I have never questioned, before now, that my vote would count, and that anybody else who made a sincere effort to vote would have their vote counted,” said Whitney McGinniss, 35, a Democrat who works in public administration in suburban Atlanta, whose absentee ballot was challenged over a signature mismatch. “My opinion of that has really changed.”McGinniss said she had to send nearly two dozen emails to county elections officials to confirm that her absentee ballot would count after she was told her signature didn’t match other records. County officials confirmed the exchange to The Washington Post, and that her ballot had eventually been accepted.Nonetheless, a state database continued to list McGinnis’s ballot as “challenged.” She said she cast a provisional ballot at an early-voting location in case her mail-in vote wasn’t counted upon the advice of local officials, despite the fact that a poll worker told her that voting twice was voter fraud.“This is not the way the process is supposed to work,” she said.In North Dakota, Native Americans have decried a strict requirement that voters show identification bearing their physical address. Many residents of tribal reservations don’t have a physical address. They live outside the service area of the U.S. Postal Service and use post office boxes for mail delivery.[In Senate battleground, Native Americans fight voter ID restrictions]Election officials have urged such voters to create physical addresses for themselves using a rural address database that serves 911 service providers. But some have found that the addresses these systems produce can be inaccurate — and they worry that they could be charged with voter fraud if they use an ID with an inaccurate address, advocates said.Tribal leaders are deploying officials to as many as 40 precincts with laptops, printers and CB radios (there is no cell service at many locations) to help voters produce acceptable tribal IDs on the fly.“The backbone of our democracy is being able to vote,” said Carla Fredericks, a lawyer and member of the Mandan Hidatsa Arikara Nation, located in central North Dakota, who is helping the effort. “If people are not able to vote who are constitutionally allowed to vote, I don’t think that speaks well to the legitimacy of our elections.”Fredericks said Native Americans, who tend to vote Democratic, are credited with Democratic Sen. Heidi Heitkamp’s victory in 2012. It’s hard not to be suspicious, she said, that Republicans passed the law ahead of Heitkamp’s reelection effort this year to discourage Native American participation.Al Jaeger, North Dakota’s Republican secretary of state, said the activists’ plan to position themselves outside of polling locations could cause even more confusion at the polls.“Every North Dakotan, every voter on Election Day, will be provided a ballot to mark and cast, or be given a set-aside ballot to mark,” Jaeger said at a news conference Friday, according to the Bismark Tribune.All told, two dozen states have passed restrictive voting laws since 2010, according to the Brennan Center for Justice at New York University’s School of Law, including new measures since 2017 in Arkansas, Georgia, Indiana, Iowa, New Hampshire, North Carolina and North Dakota.Wane Hailes, publisher of a newspaper in Columbus, Ga., aimed at African American and Hispanic readers, said he and other black voters were initially discouraged by the headlines in Georgia about thousands of voters of color having their registrations suspended or their ballots tossed. But that frustration is driving people to the polls, he said.“I think what has happened over the last few weeks, with all of the attention going on, we’re like, ‘No, we’re getting out to vote,’” said Hailes, who is 62 and also handles communications for the state chapter of the NAACP. “Okay, now we’re not going to let this happen.”Meanwhile, large armies of lawyers and other observers are being mobilized to monitor the polls Tuesday — and to be prepared for recounts and other legal action that could follow.Political committees, individual campaigns and civil rights groups will all deploy monitors. Common Cause, the civil rights organization, for instance, helped recruit 6,500 monitors this year — double the number in 2016, a presidential election year.That’s in part because of the expected boost in turnout. As of Saturday, the number of people voting early this year had outpaced that of the 2014 midterm elections in 28 states, according to data compiled by Michael McDonald, a political-science professor at the University of Florida. In two additional states, Texas and Nevada, early voting is on track to surpass the entire vote count four years ago, he said.Ned Foley, a law professor and election-law expert at Ohio State University in Columbus, said it’s never a good thing for even a single voter to lose the right to vote. But he also noted that glitches are inevitable and they shouldn’t delegitimize an election unless they are so numerous as to have the power to change the outcome.Is that possible Tuesday? Certainly, Foley said, given how many closely fought races are in play. But it’s also dangerous to be “overly alarmist,” he added.“That can feed the cynicism,” he said. “It can feed the notion that it doesn’t matter.” Vanessa Williams in Georgia, David Weigel in New Jersey, Annie Gowen in Wisconsin and Scott Clement and Avi Selk in Washington contributed to this report. "}