{"id": "Week 10 waiver wire: A reborn running back and a magical QB highlight top options", "paragraph": " Analysis  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  None of the teams on a bye in Week 10 — the Baltimore Ravens, Denver Broncos, Houston Texans and Minnesota Vikings — have primary backs on which fantasy owners rely (maybe Lamar Miller in Houston, maybe), but their collective week off will take quite a number of players out of the mix for week 10. Javorius Allen, Latavius Murray, Dalvin Cook, Philip Lindsay, Royce Freeman, Devontae Booker and Miller will all be on your bench this week, thinning out the running back position. Top receivers like DeAndre Hopkins, Stefon Diggs and Adam Thielen will be out, too, giving you even more to consider as you fill out your roster.Fortunately for you there are a number of free agents with high-scoring potential on the waiver wire that could help you in a tight spot, plus one magical quarterback and his emerging receiver.[Redskins’ defense has no answer for Falcons in 38-14 loss]Duke Johnson Jr., RB, Cleveland Browns (51 percent of fantasy leagues)The dismissal of coach Hue Jackson seems to have given Johnson new life. He never had more than four receptions in a game in 2018 leading up to Sunday’s matchup against the Kansas City Chiefs, but interim head coach Gregg Williams targeted Johnson six times in the first half and Johnson caught all six for 63 yards and a touchdown. Johnson ended the game catching all nine of his targets for 78 yards and two touchdowns.This is where he should be for the rest of the season — both because of Johnson’s talent and the Browns' tendency to trail. In 2017, Johnson caught 74 of 93 targets for 693 and three touchdowns; only Alvin Kamara (2.8) and Todd Gurley (2.1) produced more yards per route run than Johnson (2.1) that season, showing how valuable he could be for a late playoff run, especially if your league uses a point-per-reception, or PPR, scoring system.Ryan Fitzpatrick, QB, Tampa Bay Buccaneers (30 percent)Fitzpatrick got the start for the Bucs and once again worked his Fitzmagic: 24 completions on 40 attempts for 243 yards, three touchdowns and two interceptions. Heading into Sunday’s game, he was the fourth most valuable passer per ESPN’s Total Quarterback Rating (78.6 QBR), and Tampa Bay has the sixth-easiest schedule from Week 10 to 14, the weeks leading up to the start of the fantasy football playoffs, per Sharp Sports. Assuming he continues to get the nod over the benched Jameis Winston, Week 15 is probably the end of his value as a fantasy starter. Fitzpatrick and the Buccaneers face the Baltimore Ravens, a tough opponent, in Week 15.Adam Humphries, WR, Tampa Bay Buccaneers (97 percent)Fitzpatrick targeted Humphries eight times Sunday against the Carolina Panthers, and the fifth-year pro caught all eight for 82 yards and two touchdowns. His target share has ramped up in recent weeks — he had nine in Week 7 and 10 in Week 8 — giving him a high floor in terms of fantasy points. Add in this week’s touchdowns and you could have a surprise game-winner on your hands for the run up to the playoffs.Ito Smith, RB, Atlanta Falcons (68 percent)Despite Tevin Coleman getting more carries, Smith continues to provide value out of Atlanta’s backfield. Before facing the Washington Redskins on Sunday, Smith had 51 touches (third on the team) with three total touchdowns, and his yards per carry after contact (2.9) also are higher than any one else on the team. He got 10 carries Sunday against Washington, producing 60 yards and a score.Wendell Smallwood, RB, Philadelphia Eagles (64 percent)Smallwood is emerging from the running back committee in Philadelphia. He has 60 carries for 257 yards and a touchdown for the Eagles, averaging 4.3 yards per carry. He also added 15 catches for 143 yards and two touchdowns. Plus, he played the same number of snaps (31) as Josh Adams and Corey Clement combined for Philadelphia during last Sunday morning’s 24-18 victory at Wembley Stadium. In that game Smallwood touched the ball 10 times for 66 total yards and a touchdown, a 36-yard scamper into the end zone.Dede Westbrook, WR, Jacksonville Jaguars (63 percent)Westbrook, a slot receiver, leads the team in receiving yards (404) and has produced the highest passer rating (109.4) for quarterback Blake Bortles in 2018. Jaguars had a bye in Week 9, but the subsequent matchup against the Indianapolis Colts should make him a viable injury or bye-week replacement. The Colts rank 25th against the pass, per Football Outsiders, and only have the 21st best pass rush, according to Pro Football Focus.Frank Gore, RB, Miami Dolphins (66 percent)At 35 years old, Gore is averaging 4.6 yards per carry, his highest rate since 2012, a Pro Bowl year. He has only one touchdown in 2018, and that was on a passing play, but he leads the team in carries (104) and will face the Green Bay Packers in Week 10, a defense that ranks 24th against the run, with a stuff rate of less than 14 percent, placing Green Bay 29th in the league at stopping the run at or behind the line of scrimmage.Nick Mullens, QB, San Francisco 49ers (99 percent)Mullens, the surprise starter against the Raiders on Thursday night, completed 16 of 22 passes for 262 yards with three touchdowns and no interceptions, earning a near-perfect passer rating of 151.9. Mullens led the 49ers to their first win since Week 2, giving Coach Kyle Shanahan reason to leave him under center for Week 10..@49ers @NickMullens #GoldenEagles #49ers and a few highlights from his jaw dropping @NFL debut. BTW, what were the @raiders doing on any of these plays? #BaldysBreakdowns pic.twitter.com/15ySoc3EYo“He was very efficient,” Shanahan told reporters after the game. “Made some big plays. Got to number two in his progression. [Made] a couple of plays down in the red zone. Did a good job getting rid of the ball, changing his arm angle a number of times. And got us in and out of the huddle very efficiently.”If Mullens does get the start, he should be able to be a fantasy asset against a New York Giants defense that ranks 27th against the pass, per Football Outsiders.Jordan Thomas, TE, Houston Texans (98 percent)If you need help at tight end and want to take a flier, grabbing Thomas is a bold move.The rookie tight end was targeted a season-high four times in Week 9, three in the red zone, catching two of those for touchdowns. On Sunday against the Denver Broncos, he caught another red-zone pass for a touchdown. Plus, quarterback Deshaun Watson loves to go to his tight ends inside the 20-yard line: His (15) attempts to the position in 2018 are the third most in the NFL.Read more from The Post:Brent Musburger made a controversial joke about Elizabeth Warren’s heritageAir Force falcon mascot has ‘life-threatening’ injuries after prank by ArmyAaron Rodgers vs. Tom Brady, Rams vs. Saints highlight Week 9College football winners and losers from Week 10: Michigan’s meanUFC 230: Daniel Cormier makes quick work of Derrick Lewis in heavyweight title bout"}