{"id": "The Trump administration just approved a plan to drill for oil in Alaska’s federal waters. It’s a major first.", "paragraph": "Interior Department officials announced their approval Wednesday of a company’s plan to drill for oil six miles off the Alaskan coast in the shallow waters of the Beaufort Sea.If the development by Hilcorp Energy moves forward, it would be the first oil and gas production facility in federal waters in Alaska, Interior Secretary Ryan Zinke said in the announcement, a major victory for the oil industry and a blow to conservation groups that fought it, fearing a possible leak in a sensitive and pristine natural environment.Zinke said the approval was a step forward for President Trump’s “American energy dominance” agenda that promotes the widespread development and production of fossil fuels such as coal and oil.“American energy dominance is good for the economy, the environment, and our national security,” Zinke said. “Responsibly developing our resources, in Alaska especially, will allow us to use our energy diplomatically to aid our allies and check our adversaries. That makes America stronger and more influential around the globe.”Contrary to Zinke’s pitch, the vast majority of scientists say the use of fossil fuels contributes to carbon pollution that fuels climate change, a driver of sea-level rise, warmer oceans and hurricanes that rely on warm water to grow in size and ferocity.Hilcorp, based in Houston, plans to build a nine-acre gravel island about 20 miles east of Prudhoe Bay, not far from the Arctic National Wildlife Refuge. The Liberty Project proposes to tap into a reservoir of oil on the state’s North Slope, containing as much as 150 million barrels.The project is expected to take two years to complete, produce up to 70,000 barrels a day at peak production about two years after it begins, with “a life expectancy of 15 to 20 years,” according to the project’s website.Hilcorp, a major player in Alaska, has had a few environmental mishaps. In December 2017, Hilcorp Alaska discovered crude oil leaking from a subsea pipeline that connected a pair of oil production platforms in the Cook Inlet.Nine months before that discovery, the Coast Guard was dispatched to investigate a Hilcorp oil leak from an abandoned well head in the Gulf of Mexico. A news release by the Coast Guard reported “an estimated 840 gallons of crude oil in the water,” according to an article in the New Orleans Times Picayune.The article reported that eight months earlier, another Hilcorp pipeline was the source of 4,200 gallons of oil spilled near Lake Grande Ecaille, according to the Coast Guard.Interior never mentions announcements about lease proposals and project approvals, nor does it mention oil company setbacks, including the BP Deepwater Horizon disaster, the worst offshore spill in history. The department’s proposal to offer leases to the oil and gas industry on 90 percent of the U.S. outer continental shelf ignored another major spill in the Gulf of Mexico that has lasted 14 years and could continue for 80 more.But oil leaks from pipelines in Alaska’s Cook Inlet, where Hilcorp is a major operator, became such a problem that the Cook Inlet Regional Citizens Advisory Council launched what it called an unprecedented risk assessment. “There is a concern because we’re talking about aging infrastructure,” said Lynda Giguere, director of public outreach for the group, founded after the catastrophic 1989 Exxon Valdez oil spill in Prince William Sound.Many of the pipelines connecting platforms and facilities onshore are more than a half-century old, Giguere said. “We need to understand the regulation oversight, the conditions of the infrastructure and the maintenance. It’s part of our mission and it seemed long overdue.”Giguere credited Hilcorp for working with the group and providing the information it needs to conduct its investigation. “They are the biggest operator in the Cook Inlet region. I can’t answer how much they own, but they are a major operator in the region.”The Congressional Western Caucus praised the Liberty Project’s approval on Twitter, calling it “excellent news for the state of Alaska!”A conservation group, the nonprofit Center for Biological Diversity, disagreed.“Opening the Arctic to offshore oil drilling is a disaster waiting to happen,” said Kristen Monsell, ocean legal director with the Center for Biological Diversity. “This project sets us down a dangerous path of destroying the Arctic.\""}