{"id": "Foreign countries are increasingly using Trump as a foil — or a punchline", "paragraph": " Analysis  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  President Trump promised during the 2016 campaign that the United States would be respected again. The most visible example of how that is not entirely coming to pass came two months ago at the United Nations, when foreign leaders audibly laughed at Trump’s bogus claim to unprecedented achievements.But it’s hardly the only example. Increasingly, when Trump graces the world stage, he is being trolled, not-so-subtly rebuked, or used as a foil in ways that suggest foreign countries see Trump less as someone worthy of fear and respect, and more as a tool they can use for their own purposes.This sort of thing is often coming from allies and official sources.In recent days, both French President Emmanuel Macron and the French army have cast Trump in a not entirely flattering light. Macron seemed to pretty directly rebuke Trump during a speech Sunday, even as the U.S. president was still in Paris for World War I remembrances. In a speech, Macron described nationalism — a term Trump embraced for the first time a few weeks ago — as a “betrayal of patriotism.” Macron also decried the “selfishness of nations only looking after their own interests.” The remarks could have been directed at any of the nationalist leaders of the world, but it wasn’t difficult to draw a line between them and Trump’s very recent nationalist declaration.Macron also seemed to rebuke Trump without naming him at the same U.N. General Assembly mentioned above. While the laughter got the most attention, Macron delivered a speech that appeared to rebuke Trump’s emphasis on “sovereignty.” “I shall never stop upholding the principle of sovereignty,” Macron said, “even in the face of certain nationalism which we’re seeing today, brandishing sovereignty as a way of attacking others.”Likewise, the French army trolled Trump on Monday for skipping a ceremony at France’s Aisne-Marne American Cemetery. It was a decision for which inclement weather had been cited, despite other world leaders showing up in the rain. The French army tweeted a photo of rain-soaked soldiers navigating an obstacle course and added text that translates to: “There is rain, but it does not matter. We remain motivated.”#MondayMotivation Il y a de la pluie, mais c'est pas grave 😅 On reste motivé 👊 pic.twitter.com/29hOJ9ITF0That was the second foreign military this month to tweet about Trump in a way he probably won’t like. The Nigerian army a couple weeks back seized upon Trump’s comments about U.S. troops at the U.S.-Mexico border treating thrown rocks as though they were firearms. The Nigerian army tweeted the video of Trump and said, “Please Watch and Make Your Deductions” — apparently using Trump’s words to justify its use of deadly force in such a situation a few days earlier. (The tweet was soon deleted.)The apparent trolling of Trump has extended to other allies. In June at the Group of Seven, Canadian Prime Minister Justin Trudeau presented Trump with a framed picture of a hotel Trump’s grandfather ran in Canada, which was reportedly a brothel. (Trump denies it was a brothel.)Great moment between @JustinTrudeau and @POTUS when he gave him picture of the President’s grandfather’s hotel in Canada. #G72018 pic.twitter.com/mtl5c7QPB3Early in Trump’s presidency, Sweden’s deputy prime minister also appeared to have some fun at Trump’s expense by reenacting a photo of Trump signing a bill surrounded by white men. She was surrounded by only women, who stood in similar positions as the men in Trump’s photo. “We are a feminist government, which shows in this photo,” Deputy Prime Minister Isabella Lövin said at the time. “Ultimately it is up to the observer to interpret the photo.”Just signed referral of Swedish #climate law, binding all future governments to net zero emissions by 2045. For a safer and better future. pic.twitter.com/OqOO2y8BU6This group just made it more difficult for women to get access to health care worldwide. You tell me what's wrong with this picture. pic.twitter.com/8UQFWg8qO3Around the same time, the Swedish Embassy in the United States tweeted at Trump after he appeared to refer to a nonexistent terrorist attack in their country.We look forward to informing the US administration about Swedish immigration and integration policies. https://t.co/x5G3euOWRhNordic leaders also seemed to possibly be trolling Trump in May 2017, when they took a photo reminiscent of the viral photo of Trump and the leaders of Saudi Arabia and Egypt with their hands on a glowing orb. The Nordic leaders denied that it was intended as such, despite the parallels.And here’s Trump at the opening of the “Global Center for Combating Extremist Ideology” in Riyadh pic.twitter.com/gshRT2nFLUnordic prime minister meeting. the orb of world domination loses power and is somewhat less threatening on these latitudes. pic.twitter.com/t5K7NfQOquAny of these examples could be a coincidence. The totality of them suggests Trump is viewed as something of a foil — and occasionally as a punchline — by foreign leaders whose constituencies largely aren’t fans of Trump’s.Trump has enjoyed being something of a bull in a china shop on the world stage. Whatever leaders think of him, they’ll be reluctant to run afoul of the leader of the world’s most powerful country. Often their approach, like that of politicians in Washington, is to tolerate Trump’s odd style, attacks and controversies. But, given that Trump is historically unpopular on the world stage, that also means neglecting a potentially powerful tool for use in domestic politics. They seem to be finding creative ways to make their points.But these aren’t ways you’d generally expect an American president to be treated. And it’s certainly not an overwhelming amount of respect."}