{"id": "Democrats plot response to Trump on immigration amid fears they could go too far", "paragraph": "Democratic candidates largely avoided engaging President Trump as he fanned public fears over a migrant caravan ahead of the midterm elections. But they also avoided confronting a key question for themselves: What kind of immigration system does the party stand for in the Trump era?Some Democrats are pushing the idea of a new comprehensive immigration plan akin to bipartisan legislation that foundered five years ago. Others want to focus attention on the narrower goal of granting legal status to undocumented immigrants known as “dreamers,” who have lived in the country illegally since they were children and whose cause is broadly popular with the public.But the boldest, and most controversial, Democratic rebuttal to Trump’s bumper-sticker sloganeering has come from progressive newcomers, most prominently Rep.-elect Alexandria Ocasio-Cortez, who swept to victory in New York behind calls to “abolish ICE” — the Immigration and Customs Enforcement agency, with 20,000 employees — over perceived abuses.Some party leaders, including Sens. Elizabeth Warren (D-Mass.) and Kirsten Gillibrand (D-N.Y.), both considered potential 2020 presidential contenders, echoed that sentiment. But other prominent Democrats urged restraint, fearful of overreaching and spurring a backlash among more moderate voters, while Trump and other Republicans have seized on the idea in contending that Democrats favor “open borders.” Since Election Day, the progressive group has backed off the message.Trump is likely to further roil the debate with his comments Saturday that this “would be a very good time to do a shutdown” of the government over the $5 billion he has demanded to fund his wall along the U.S.-Mexico border.Democrats oppose the project and are not likely to agree to further wall funding in a government spending bill that must pass by Dec. 7 or trigger a partial government shutdown.The wall fight could further highlight Democratic divisions on immigration. Last week, at a Senate committee hearing over Trump’s nomination of Ronald Vitiello as the new ICE director, Sen. Kamala D. Harris (D-Calif.) appeared to link the tactics employed by the Ku Klux Klan to the perceptions in some immigrant communities about “fear and intimidation” from ICE agents.The suggestion led to a testy exchange between Vitiello, a longtime Border Patrol official who has been the acting director of ICE since June, and Harris, another presumptive presidential aspirant from a state on the front lines of resisting Trump.“I see no perception that puts ICE in the same category as the KKK,” Vitiello said. Harris pressed him repeatedly on ICE’s tactics, before adding: “But the perception exists, would you agree, whether or not it’s correct?”A Harris spokeswoman noted that the senator had, in her remarks at the hearing, praised the performance of the “vast majority of the men and women” in the agency. She emphasized that Harris had raised the KKK because Vitiello several years ago tweeted that Democrats were a “liberalcratic” and “NeoKlanist” party, which Vitiello said during the hearing he regretted.John Sandweg, acting ICE director in the Obama administration, said Harris expressed valid criticisms of Trump’s rhetoric. But, he added, “Democrats need to be very careful about this ‘abolish ICE’ stuff. No one in their right mind would suggest eliminating immigration enforcement in the country.”In August, Trump held a ceremony at the White House to celebrate the “heroes” of ICE, during which he accused “a coalition of open-border extremists” of waging an “unprecedented assault on our law enforcement.”Liberal Democrats said Trump and Republicans have intentionally misrepresented them. They said they are not calling for dismantling enforcement but rather for ICE’s duties to be redistributed across the government to help curb abuses.Under this scenario, the government’s limited enforcement resources would focus on hardened criminals, while undocumented immigrants who have lived here without committing other crimes or civil infractions could pursue legal status.In the face of Trump’s attacks, “we have to stand up and just laugh when they say those things and say it’s baseless slander,” said Rep. Pramila Jayapal (D-Wash.), who in July co-sponsored a Democratic bill to eliminate ICE and restructure it from scratch.Minority Leader Nancy Pelosi (D-Calif.), the leading candidate to become speaker in January, has said the early focus will be on a bill to offer legal status to dreamers.Such a measure, which polling shows has widespread public support, also could contain provisions to protect immigrants from Haiti, El Salvador, Honduras and elsewhere who have been living in the country under the temporary protected status program Trump has sought to end.Other top Democrats, including Sen. Robert Menendez (D-N.J.), said the party should quickly offer a comprehensive immigration bill allowing Democrats to “show what they stand for.”If Democrats advanced a sweeping bill out of the House, it would force the Republican-led Senate to try to muster a response, he added, and that could prompt both sides “to negotiate something that’s reasonable versus [Trump’s] positions, which are just off the wall.”In 2013, a bipartisan Senate coalition approved a bill offering a path to citizenship for most of the nation’s 11 million undocumented immigrants, additional work visas, trims to family immigration programs and additional funding for border fencing and more Border Patrol agents. But the GOP-led House refused to vote on the legislation.In early 2018, Trump and Democratic leaders floated a deal to provide legal status for the dreamers in exchange for up to $25 billion in funding for the border wall. The White House also wanted to speed up deportations, and significantly cut legal immigration programs. A Senate bill backed by Trump was soundly defeated with just 39 senators in favor.Leon Fresco, an immigration attorney who served as a top aide to Senate Minority Leader Charles E. Schumer (D-N.Y.) during the 2013 debate, said a comprehensive deal remains a long shot as both parties retrench before 2020.In 2016, Democratic presidential nominee Hillary Clinton moved quickly to the left of President Barack Obama on immigration, pledging to go further on using executive authority to protect immigrants from deportation. She lost to Trump, and Obama’s program to protect up to 4 million immigrant parents of U.S. citizens was halted in federal court.“All Democratic candidates have to do is be slightly credible on enforcement,” Fresco said. “I don’t think Hillary did that . . . . The message needs to be that the president’s policies of ratcheting up enforcement has failed. We have more caravans, more chaos on the border.”Trump has pledged to ramp up enforcement. During his nomination hearing, Vitiello refused to rule out another version of the rescinded family separation policy in which children were separated from their parents at the border, sparking a backlash for Trump. Earlier this month, the president signed a proclamation to deny Central American migrants the right to apply for asylum.Democrats said they will fiercely oppose such measures, but acknowledged their message must go beyond standing up to Trump.“There is a lot of energy on the left with respect to what people are against — as it should be because the president has done some utterly appalling things,” said Cecilia Muñoz, who served as Obama’s domestic policy adviser “But it’s also important for the energy to be affirmative and present an outline for what we are for.”"}