{"id": "Florida recount: Here’s what you need to know.", "paragraph": " Analysis  Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events  Right now in Florida, three statewide races — for senator, governor and agriculture commissioner — are in the throes of a dramatic recount to determine the winners. It can be a confusing process to follow, because there are several competing narratives and a lot of legal jargon.So, let’s break down exactly what is happening down in the Sunshine State. No disrespect to the ag commissioner — it’s a really important job! — but we’re going to focus on the Senate and gubernatorial races.On Election Night, it appeared that Republican Rick Scott, Florida’s governor, was headed to the Senate, and Republican Ron DeSantis was headed to the governor’s mansion in Tallahassee. The Democratic candidate for governor, Andrew Gillum, even gave an early-morning concession speech.But as ballots continued to be counted over the following days, the Republicans' leads shrunk to margins that made the races too close to call. Scott was leading incumbent Democratic Sen. Bill Nelson by only 12,500 votes, and DeSantis was ahead of Gillum by almost 34,000.Any margins under 0.5 percent trigger an automatic recount in the state.On Sunday, Gillum rescinded his concession, which is not binding regardless.As ordered Saturday, the state is in the midst of a machine recount. After that, if any of the races are within a .25 margin then there could be a manual recount. If current vote totals held, that would be true of the Senate race. There were significant undervotes in the Senate race (ballots on which machines did not detect a vote for a Senate candidate at all) in Broward County, which many people say was the result of the race’s placement on the ballot. But Nelson’s campaign is hoping it was a machine error and those extra votes will be captured if the ballots are manually counted.Here’s a copy of the Broward ballot:Here's a sample ballot for Tuesday's election for Broward residents in the 22nd Congressional District.People may not have seen the U.S. Senate race because of its position (bottom left) vis a vis the governor's race.But the Senate race was there. pic.twitter.com/yo14dIywADFlorida counties have until Thursday at 8 p.m. to finish their recounts. But some counties have complained that they can’t finish in time, so expect Democrats to ask for an extension. Also, ballots from overseas and the military can be counted as late as Friday as long as they are postmarked to Election Day, though there’s unlikely to be enough to make or break the result. The final vote will be certified Nov. 20.Republicans, namely Scott and President Trump, have claimed that, in Broward County specifically, there’s fraudulent activity afoot to benefit the Democrats, including forged ballots. But there is no evidence to support this, and the Florida secretary of state said there’s no evidence of any illegal behavior.Moreover, state Judge Jack Tuter scolded the Scott team Monday morning for propagating the notion of voter fraud.Tuter also appeared to admonish the Scott team for suggesting voter fraud without offering evidence of it.“We should be careful what we say,” Tuter said. “These words mean things these days, as everybody in the room knows.”As mentioned above, the president has been spreading the unfounded claim that there is voter fraud in Florida. He tweeted Monday morning that the recount should end and Scott and DeSantis should be deemed the winners based on Election Night results, which, as The Washington Post’s Philip Bump points out, would be “disenfranchising tens of thousands of voters deliberately.”The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!Yes, campaign legal teams were in court Monday morning, in fact. The judge ruled against a request by Scott’s legal team that Broward County ballots and machines not used in the recount be impounded.As Post colleagues reported, there was also another suit filed asking that all mail-in ballots postmarked by last Tuesday be counted. Under current rules, ballots must be received by 7 p.m. on Election Day. That suit is a joint effort of VoteVets, the Democratic National Committee and the Democratic Senatorial Campaign Committee.Also Monday, the League of Women Voters and the nonprofit watchdog group Common Cause Florida filed a lawsuit asking that Scott be barred from using “the power of his office in any manner related to Florida’s 2018 Senate race as long as he remains a candidate.” And on Wednesday, a judge will hear a request from Nelson’s team that all absentee and provisional ballots that were tossed out over mismatched signatures be reexamined.For Americans of a certain age (older than 35?), the words “Florida” and “recount” in the same sentence evoke memories of a protracted and bitter fight for the White House that ended up in the hands of the Supreme Court. Now, 18 years after Bush v. Gore, lawyers and media are descending on the Sunshine State for another too-close-to-call election.That the allegations of voter fraud are focused on Broward County is especially reminiscent, given it was the site of the infamous “hanging chads” during the 2000 presidential recount.There are even some familiar faces. As the Miami Herald pointed out, some lawyers from the 2000 recount are back on the job, including Bill Scherer, who represented George W. Bush and is now representing Scott, and Mitchell Berger, a lawyer for Al Gore who is now part of the Florida Democratic Party’s legal team. correction: The Florida Senate race is being recounted by machine and will only go to a manual recount if by Thursday the margin is still under .25 percent. "}