{"id": "PM Update: Very gusty winds develop tonight. Cold and blustery on Sunday.", "paragraph": "10:30 p.m. - Front plowing through region with 40 to 50 mph wind gustsThe powerful front is coming through a little earlier than indicated below and, as it comes through, the winds come on suddenly. The front is now pushing into areas east of the Beltway which should expect a rapid onset of gusts between 30 to 50 mph. Some short-lived showers are also accompany the passage of the front. Overnight, it will remain windy, with winds sustained around 20 mph with 30-40 mph gusts - with isolated higher gusts mainly in our fair western areas with some elevation.Original postA strong cold front sweeps through the region late tonight, making it feel as though we moved from autumn to winter in less than 12 hours. Cold air rushes in behind the front overnight, and winds from the northwest will gust to 25-plus mph as temperatures fall into the low 40s. Sunday will feel downright cold at times, with temperatures barely making 50 degrees, and gusty winds creating a wind chill value (yes, it’s time to break that index out) in the upper 30s at times.Listen to our daily D.C. forecasts: Apple Podcasts | Amazon Echo | More optionsThrough tonight: No problems for the remainder of today, with a mix of sun and clouds in place through sunset. Bring an outer layer if you have Saturday evening plans, as temps will fall into the low 50s before midnight. About 2 a.m., winds switch to the northwest at 10 to 20 mph, gusting to 25-plus mph at times, as a strong cold front moves through. Lows will end up ranging from 40 to 44 degrees, with a slight chance of some scattered showers developing ahead of the frontal passage (between midnight and 2 a.m.).View the current weather at The Washington Post.Tomorrow (Sunday): Northwest winds (15 to 20 mph) will remain strong throughout the day on Sunday, with gusts of 30-plus mph possible, especially in the morning. Mostly sunny skies for the afternoon, but quite cool and blustery. Highs tomorrow will only reach the upper 40s to low 50s, which when combined with the wind will make it feel like the upper 30s at times. Mostly clear and cool tomorrow night, with lows in the upper 30s and winds gradually dying down.See Ian Livingston’s forecast through next week. And if you haven’t already, join us on Facebook and follow us on Twitter and Instagram. For related traffic news, check out Gridlock.Want our 5 a.m. forecast delivered to your email inbox? Subscribe here."}