{"id": "Axios", "paragraph": "For 21 years, Edgar Rodriguez has worked as the doorman at 115 Central Park West, a job requiring subtle courtesy and dapper dress. But in the last decade, his duties have been wholly upended. Why it matters: The rise of Amazon has shaken up the U.S. and global economy. But it's done so in sometimes odd ways, all-but killing some centuries-old trades, like bookselling, while giving others — like the doorman — surprising second lives.The big picture: The Amazon effect on jobs has been two-sided. The e-commerce giant has added more that 250,000 jobs in the U.S. alone, but a whopping 12 million retail jobs are in jeopardy because of its rapid ascent, per MarketWatch. Amazon has also faced sharp criticism for the wages and working conditions of its tens of thousands of warehouse employees and truckers.And those are just the employees on Amazon's payroll. The company is unleashing tectonic shifts across the working world:As Amazon grows larger and larger, \"we don't quite know what the consequences are going to be, and it's going to touch things that we don't predict,\" said Joe Parilla of Brookings. \"It's changing these corners of the labor market.\"On a typical day, Rodriguez's 215-unit building, which employs a team of 10 doormen and a mail clerk, receives 160 packages.Across New York, doormen juggle deliveries that pile up astoundingly high.The other side: City-dwellers who live in converted townhouses or buildings without doormen order just as many packages — but they don't have someone to run the lobby-warehouse. That leads to some frustration.The long view: The rise of new technologies has often shifted the burden of work, Jared Bernstein, a former economic adviser to Vice President Joe Biden, told Axios. Consider the ATM machine, which, after its invention in 1969, prompted us to withdraw our own cash, thus changing the job of teller.Amazon is doing something similar, Bernstein said. \"It's shifting work toward consumers, or, in the case of doormen, toward the people who work for consumers.\""}