{"id": "Axios", "paragraph": "Welcome to Sneak Peek, our weekly lookahead for both ends of Pennsylvania Avenue, plus my best scoops. I'd love your tips and feedback: jonathan@axios.com. And please urge your friends and colleagues to sign up for Sneak Peek.In August, Saudi-led coalition forces used an American bomb to blow up a school bus in Yemen, reportedly killing at least 51 people, including 40 children. In his first public comments on that attack, President Trump told Axios on HBO that the killings were \"a horror show.\" But he declined to say if it's made him reassess American arms sales to the Saudis. Why it matters: Yemen is the world's worst humanitarian crisis, according to the UN. The U.S. has been selling the Saudis weapons to fight the Iran-backed Houthis, and Trump has boasted repeatedly about the size of his Saudi arms deal. I asked Trump whether it bothered him that the Saudi-led coalition has been using U.S. bombs to kill civilians. My colleague Jim VandeHei then asked Trump if this gave him pause about selling American weapons to the Saudis. \"I don't want to see that,\" Trump replied. \"That is a terrible thing. What's going on in Yemen generally is a terrible thing, and we're gonna see and we're looking at Yemen very carefully right now. We are actually studying Yemen very, very carefully.\"I asked if Trump would handle the war differently if he were in the Saudis' place.What's next: Last week, the U.S. called for a cease-fire, but within two days, per the Washington Post, \"the U.S.-backed Saudi-led coalition launched a fresh offensive.\"For more on Trump's accounting for Yemen, watch our full interview with the President at 6:30 p.m. ET/PT on HBO.I pressed Trump during our interview to square one of the biggest contradictions of the midterms: His insistence that Republicans will protect people with pre-existing conditions while his Justice Department argues in court that those protections should be thrown out.The intrigue: As I tried to hand Trump a copy of DOJ’s legal brief, he told me Attorney General Jeff Sessions hadn’t given him a heads-up before adopting this politically explosive position. But that contradicts Sessions’ explanation.The big picture: The Justice Department is arguing that the courts should strike down the Affordable Care Act’s individual mandate and toss out its protections for people with pre-existing conditions in the process.“It wouldn’t matter” if the ACA’s protections are struck down, Trump said, “because pre-existing conditions, on anything we do, will be put into it.”But as Axios' Sam Baker points out, in the eight years since the ACA passed, Republicans have never proposed an alternative that would offer the same level of protection. Their proposals have either been underfunded or have left gaps that would still expose some people to higher costs and denied coverage.I asked Trump whether Sessions had told him that this was coming.The bottom line: It's not just a constitutional technicality. If the administration wins in court, Americans with pre-existing conditions could be priced out of health insurance. Tomorrow, President Trump will end his pre-midterm blitz of 11 rallies across eight states in six days. Top elections analysts say they doubt they'll move the needle for Republicans. What they're saying: Cook Political Report's Dave Wasserman pointed to Pennsylvania's 18th district, which Trump won by 20 points in 2016. Even though Trump visited the district twice before the special election earlier this year, Democrat Conor Lamb still flipped it. \"I'm not convinced their [Trump and VP Mike Pence] visits make much of a difference,\" Wasserman told Alexi McCammond. By the numbers: Last-minute midterms forecasts unanimously predict Democrats winning the House and Republicans keeping the Senate. Strategists from both parties have predicted Dems will win around 35 House seats (they need 23 to take control of the House.) That'd be better for Trump than the 37 seats lost on average for a president with an approval below 50% during his first midterm election.Go deeper: Read this rich on-the-ground reporting from The Guardian's Ben Jacobs. Jacobs emails: \"I spent four days last week in Illinois reporting on two traditionally Republican suburban House districts that are toss ups this year. In one, the aversion to Trump is so much that the incumbent Republican is trying to paint his Democratic opponent as the Trumpian candidate.\"The House and Senate are on recess.President Trump's schedule, per a White House official:For the Axios HBO series, we interviewed people who've negotiated with Donald Trump throughout his life in business and in politics. One very Trumpian story came from Peter Osnos, the editor of Trump's 1987 book \"The Art of the Deal.\"Here's Osnos to Axios/HBO:\"When the idea of meeting with Trump came up ... I thought to myself how do we impress Donald Trump? So I went to my shelf and took \"Generations of Winter\" by the wonderful Russian writer Vasily Aksyonov. Nice big fat Russian novel.We got some black shiny paper and some gold leaf. And we made a cover and we brought it to him and said this could be your book. I think the only thing he said when he saw it was, 'Could be a little bit bigger.' There was no lawyer. There was no agent. Extraordinarily and very quickly he wanted to do it. Why not? I would say having now been in publishing for a very long time, it's one of the simplest deals that I ever had.And that's how we brought Donald Trump and the Russians together in 1986.\""}