{"id": "Axios", "paragraph": "Voters across the country weighed in on hundreds of ballot initiatives in this year’s midterm cycle on politically-charged issues such as abortion, marijuana legalization and criminal justice reform. The big picture: The 2018 midterm elections produced a divided Congress that's emblematic of a split America. Amid partisan deadlock in Washington, states have largely become battlegrounds on such controversial issues.Marijuana legalization: Michigan became the 10th state to legalize marijuana — including the District of Columbia — and first midwestern state to do so for recreational use. North Dakota rejected a similar measure, but voters in Missouri approved the legalization of medical marijuana.Abortion: The matter was on the ballot in three states. In Oregon, voters defeated a measure that would have banned the use of public funds to pay for abortion coverage. Alabama and West Virginia approved sweeping anti-abortion language to the states’ constitution, proclaiming that women have no right to perform the procedure. Transgender rights: Massachusetts upheld a 2016 law that protects transgender people from discrimination in public places, including restaurants, hotels, hospitals, and stores. Minimum wage: Arkansas will now raise the wage from $8.50 an hour to $11 by 2021. Missouri's hourly minimum will gradually rise from $7.85 to $12 hour by 2023.Criminal justice reform: Louisiana approved a measure to require a unanimous jury for convictions, overturning a Jim Crow-era law that allowed for split juries.Medicaid expansion: Three red states — Idaho, Nebraska, and Utah — approved initiatives to adopt the Affordable Care Act's expansion of Medicaid.Daylight saving: Californians decided they no longer want to reset clocks twice a year. A measure they approved would implement a permanent year-round daylight saving time. But, it requires a two-thirds vote from the state legislature and a change in federal law to go into effect.Homelessness: San Francisco will impose tax on big businesses to pay for new services to help curb the city's increasing homelessness crisis. The measure's approval is a major defeat for techies like Twitter and Square CEO Jack Dorsey, Zynga co-founder Mark Pincus, and Stripe CEO Patrick Collision who were against the measure. Go deeper: "}