{"id": "Axios", "paragraph": "Thanks for subscribing to Media Trends. Tell friends to follow along by signing up here.Mergers are central to media companies' strategies for competing with tech giants like Google and Netflix, but the merger review process has suddenly become a political football between President Trump and congressional Democrats.Why it matters: Trump continues to comment on antitrust matters related to media companies he doesn't like, and experts worry the resulting political fray could hinder the Justice Department's ability to independently evaluate mergers.What's happening: Consumer groups are raising red flags about both the AT&T/Time Warner merger that was approved this summer (after the Justice Department tried to block it) and the Comcast/NBCUniversal merger that was approved in 2011 during the Obama administration.Be smart: \"There is a strong basis for enforcing these laws regardless of the White House's statements, but those statements in no way help the DOJ do its job effectively,\" says Gene Kimmelman, President and CEO of Public Knowledge, a consumer protection advocacy group, and a former Justice Department antitrust staffer.The big picture: These issues become even more convoluted as the DOJ faces a leadership crisis of its own.Between the lines: Many of the alleged anti-competitive behaviors are related to outlets that President Trump has attacked.Democrats allege Trump impacted the DOJ's decision-making.Reality check: Schiff’s comments carry weight because of his prominence in the Democratic party. But Schiff's committee doesn't have oversight authority on antitrust matters. Democrats in Congress have already requested documents related to communications between the White House and DOJ about the AT&T deal.The bottom line: The president isn't supposed to inject himself in these matters. Go deeper: How Trump's media obsession could collide with regulation of itMedia and telecom deals continue to slightly increase under the Trump Administration, with PwC's latest US Media and Telecommunications Deals Insights Q3 2018. Deal volumes (number of deals, not how much they are worth) reached a two-year high last quarter, after a moderate slowdown in the first half of 2018.  Yahoo Finance, the decades-old money brand now owned by Verizon, is launching a subscription service that aims to compete with Bloomberg for the money and attention of retail investors, sources tell Axios. The big picture: The move is part of a larger trend of digital publishers creating new revenue streams out of subscription and membership offerings. On Monday, New York Magazine announced a forthcoming digital subscription offering.What we're hearing: Yahoo Finance Premium will act as a testing ground for Verizon Media Group (formerly called Oath) to launch more subscription services.Between the lines: When Oath was created in 2017, executives pitched its advertising business as being a serious ad competitor to Google or Facebook, but it has thus far failed to position its growth to take on those companies long-term.The bottom line: Yahoo Finance is still a powerhouse brand. And despite slowed ad growth projections, Verizon Media Group/Oath is still a traffic behemoth. Go deeper: Publishers pivot paywalls to surviveNews verticals that once brought in big subscription dollars and advertiser interest, like Auto and Arts, are being replaced by new-age topics that are relevant to understanding the world today.New coverage areas include:Why it matters: Before newsrooms began to invest heavily on covering these topics, experts typically resorted to Medium or LinkedIn to post about industry advancements and news. Now, news publications have a wider audience for these types of stories, as technology becomes a bigger part of everyday life. Between the lines: Advertiser interest around some of these topics is exploding.Go deeper: More details on how publishers are handling the new niche verticalsMore than 1 million people ditched their cable and satellite TV packages last quarter, the most ever in a quarterly earnings period, according to research firm MoffettNathanson. Why it matters: Pay-TV providers haven't been able to come close to offsetting these losses with gains in subscribers to digital TV alternatives, like AT&T's DirecTV NOW or Dish's Sling TV.Between the lines: Both Sling TV and DirecTV Now are seeing slowed growth, making it even less likely that those digital alternatives will offset traditional subscriber losses for the two biggest pay-TV companies.By the numbers: More than 80% of pay-TV subscribers in the U.S. come from four cable and satellite providers: AT&T, Comcast, Charter and Dish. Those companies together lost 887,000 subscribers this quarter, mostly driven by big losses at Dish and AT&T.The big picture: There are roughly 120 million TV homes in the U.S., per Nielsen, and about 90 million of them (75%) still pay for traditional TV. Go deeper: Satellite TV’s tricky future in the cord-cutting eraFortune magazine has been acquired by Thai businessman Chatchaval Jiaravanon for $150 million, in just the latest example of a Western business publication ending up in the hands of an East Asian buyer, Axios' Felix Salmon writes in his Axios Edge weekly newsletter. Be smart: The day might not be that far off when there are no major American-owned business publications at all. Between the lines: There are many different reasons foreign investors want to get their hands on prestigious American titles. Some may want to grow the brands internationally, as seems to be the case with Jiaravanon and Fortune. Others may be interested in acquiring talent and insights into how successful American media companies operate, like the Axel Springer and Business Insider deal.  Salaries for media and communications jobs tend to lean higher for writing-based roles, according to data from the U.S. Bureau of Labor Statistics. The big picture: The median weekly salary of the nation's 117.2 million full-time wage and salary workers was $887 in the third quarter of 2018, per the Bureau of Labor Statistics, which comes to roughly $46,0o0 per year.  "}