{"id": "Axios", "paragraph": "President Trump doesn't want to give Puerto Rico any more federal money for its recovery from Hurricane Maria, White House officials have told congressional appropriators and leadership. This is because he claims, without evidence, that the island’s government is using federal disaster relief money to pay off debt.The big picture: Trump also told senior officials last month that he would like to claw back some of the federal money Congress has already set aside for Puerto Rico's disaster recovery, claiming mismanagement.The White House didn't comment on this reporting.Behind the scenes: In late October, Trump grew furious after reading a Wall Street Journal article by Matt Wirz, according to five sources familiar with the president's reaction. The article said that \"Puerto Rico bond prices soared ... after the federal oversight board that runs the U.S. territory’s finances released a revised fiscal plan that raises expectations for disaster funding and economic growth.\"Trump's wariness about sending federal money to Puerto Rico dates back to the beginning of his administration. In early 2017, when negotiating the omnibus spending bill, Democratic congressional leaders were pushing Trump to bail out Puerto Rico's underfunded health care system that serves the island's poorest citizens.The bottom line: Congress took steps to keep disaster relief funds from being used to pay down the island's debt, and as Bloomberg reported at the time, \"neither the island's leaders — nor the board installed by the U.S. to oversee its budget — are proposing using disaster recovery aid to directly pay off bondholders or other lenders.\"Why it matters: Congress will have to pass a new package of spending bills in December. Hill sources say the package may include a bill to send more federal money to disaster areas. Trump has told aides he believes too much federal money has already gone to Puerto Rico — more than $6 billion for Hurricane Maria so far, according to FEMA. (The government projects more than $55 billion from FEMA's disaster relief fund will ultimately be spent on Maria's recovery.)Trump often blames Democratic-controlled states for the fallout from their natural disasters. On Saturday, Trump threatened \"no more Fed payments\" for California to deal with its deadly fires unless the state addresses what Trump claims is \"gross mismanagement of the forests.\"Go deeper:"}