{"id": "Axios", "paragraph": "House Democrats plan to probe every aspect of President Trump’s life and work, from family business dealings, the Space Force and his tax returns to possible \"leverage\" by Russia, top Democrats tell us. What they're saying: One senior Democratic source said the new majority, which takes power in January, is preparing a \"subpoena cannon,\" like an arena T-shirt cannon.  Incoming House Intelligence chairman Adam Schiff (D-Calif.) told “Axios on HBO” that he expects Trump to resist the committees' requests, demands and subpoenas — likely pushing fights over documents and testimony as far as the Supreme Court.Top Democrats, who had largely avoided the subject during the campaign, now tell us they plan to almost immediately begin exploring possible grounds for impeachment. A public report by Robert Mueller would ignite the kindling.Two of the most powerful incoming chairs tell \"Axios on HBO\" that they are plotting action far beyond Russian interference in the 2016 elections.1) Schiff, the top Democrat on the Intelligence Committee, told us he wants to help special counsel Robert Mueller and plans to release — with some redactions of classified material — transcripts of dozens of interviews the committee conducted during its own Russia probe.2) Incoming House Appropriations Chair Nita Lowey of New York, a close ally of House Democratic Leader Nancy Pelosi, said \"yes\" to each of a long list of possible investigative targets, including the Space Force, hurricane relief in Puerto Rico, White House security clearances, White House use of personal email and more. We reminded Lowey and Schiff of a Jonathan Swan scoop from August, \"Republicans secretly study their coming hell,\" reporting that House Republicans had built a spreadsheet of potential investigation targets, based on Democrats' public complaints and statements. Trump is already signaling confrontation, saying at his post-election news conference that if Dems investigate him, the result will be \"a warlike posture.\"Be smart: For 225+ years, federal courts have upheld the Constitution's mandate of Congress as an equal branch of government, providing checks and balances on the executive. So House Democrats have a high hand as they assume power. Go deeper:"}