{"id": "Axios", "paragraph": "Amid all the conversation around Bob Woodward’s \"Fear,\" there was a small detail that largely escaped public notice: U.S. cyberattack capabilities against adversary missile programs are weaker than publicly claimed. Woodward reports President Obama had initiated an ongoing program that “pinpointed cyberattacks on the command, control, telemetry and guidance systems before and during a North Korean missile test launch,\" but \"their success rate was mixed.”Why it matters: Pre-emptive U.S. cyberattacks on conventional and nuclear missiles, and their supportive command-and-control and targeting systems, are at the heart of the U.S. defense strategy against China. But if the Pentagon is still obtaining only “mixed results” from the same kind of disabling cyber operations with North Korean missiles, which are less sophisticated than China’s, U.S. defense capabilities in this area might be less effective than advertised.The background: According to the U.S.' defense strategy for a contested territory, known as the AirSea Battle concept, the U.S. would launch a “blinding” attack on enemy defense electronic networks before targeting enemy forces themselves. Given China’s missile advantage against U.S. forces in East Asia, U.S. officials have been bullish about their ability to incapacitate missiles through this electronic warfare. In 2013 the AirSea Battle Office said it was “providing the [cyber] capabilities for the combatant commanders so the president has options” for crisis scenarios.In 2016, U.S. Navy Chief of Naval Operations John Richardson noted China’s reliance on the heavy use of precision-strike missiles systems in the event of conflict, and the complex architecture of sensors and communications networks required for each system to function. The U.S. plan would be to “inject a lot of friction into that system,” he said, emphasizing the lead role of cyberattacks in disarming China’s missile capabilities.The bottom line: Woodward's revelations cast doubt over Richardson's and Pentagon officials' claims. As tensions continue to rise between Beijing and Washington, a credible U.S. defense posture against China would instead focus more on physical air, naval and ground forces in the region, as well as strengthening alliances and partnerships with China’s neighboring states.Frank O’Donnell is an associate at Harvard's Belfer Center for Science and International Affairs, a consultant and nonresident fellow at the Stimson Center's South Asia Program, and a lecturer at Boston College."}