{"id": "Axios", "paragraph": "In recent interviews, President Trump falsely claimed that scientists disagree about the causes of global warming. In fact, at least 97% of climate scientists agree that human activities are the dominant cause of global warming since the mid-20th century. The big picture: President Trump is not the only one who thinks that the main causes of global warming are still being debated. According to polling from George Mason University's Center for Climate Change Communication, even those Americans who say they are concerned about climate change tend to significantly underestimate the strength of the scientific consensus. The details: In an interview with the AP on Oct. 15, President Trump commented on a recent climate science report from the UN Intergovernmental Panel on Climate Change. The report, released Oct. 8, warned of potentially catastrophic consequences, such as the loss of the entire Greenland Ice Sheet, if warming surpasses 1.5°C, or 2.7°F, above preindustrial levels. Trump dismissed the findings, saying scientists disagree about the basic conclusion of what is driving global warming:Reality check: Studies show that the period from 1901 to 2016 \"is now the warmest in the history of modern civilization,\" and human emissions of greenhouse gases are to blame. Yes, but: Like the president, the American public seems to have a poor understanding of just how wide and deep the scientific consensus is on what is causing climate change. The bottom line: There is evidence showing that when people gain a better understanding of the consensus, they are more likely to support policies to rein in greenhouse gas emissions. George Mason's Ed Maibach, who leads the Center for Climate Change Communication, told Axios that this is known as the \"Gateway Belief Model.\" Maibach added that, as Trump and others question the existence of a consensus among climate experts, they are sowing doubt in the minds of many Americans. \"Regrettably, as they spread this misinformation, some members of the public accept this misinformation as true,\" he told Axios. "}