{"id": "Axios", "paragraph": "Welcome to Sneak Peek, our weekly lookahead for both ends of Pennsylvania Avenue, plus my best scoops. I'd love your tips and feedback: jonathan@axios.com. And please urge your friends and colleagues to sign up for Sneak Peek.President Trump has no intention of easing his tariffs on China, according to three sources with knowledge of his private conversations. Instead, these sources say he wants the Chinese leaders to feel more pain from his tariffs — which he believes need more time to fully kick in.Why this matters: Trump's trade war with China is at the \"beginning of the beginning,\" according to a source familiar with Trump's conversations. And his team doesn't expect much from the tentatively planned meeting between Trump and Chinese President Xi Jinping on the sidelines of the G20 summit in Buenos Aires next month.\"It's a heads of state meeting, not a trade meeting,\" a source with direct knowledge told Axios.Between the lines: \"Trump is thinking about this meeting as a personal reconnection with President Xi, not a meeting that's going to evolve into detailed discussions,\" said a source familiar with Trump's thinking. \"The sides are very far apart. ... Right now, there's not the common basis for proceeding.\"Behind the scenes: Trump has privately boasted that his China tariffs have driven down the country’s stock market. Experts say the trade war has hurt market sentiment, but the stock market has never been a reliable barometer of Chinese economic strength.Treasury officials have had contact with key Chinese negotiator Liu He's camp to exchange information. There’s been nothing close to real negotiation, according to sources briefed on them. \"There is some contact with mid-level Chinese, but not much. ... I wouldn't overestimate the planning process,\" a U.S. official with direct knowledge told me.The bottom line: All signs suggest the trade war between the U.S. and China is just getting started. I've asked sources close to Trump whether he's ever expressed any private concerns over whether his tariffs could backfire due to Chinese retaliation against American consumers or companies. Nobody I've spoken to has heard Trump express anything along these lines. He's all in.Bill Bishop, who writes the superb Axios China newsletter, explains the bigger picture of how Trump is altering the U.S.-China relationship.\"Where I think Trump is wrong is in his belief the Chinese will cave. Xi and the Party have spent years hardening their system to deal with an economic downturn and foreign threats, and they will take a lot of pain before they cave to the U.S., especially since the top of their system has finally come around to believing Trump and the U.S. have as their real goal the thwarting of 'China's rise.'\"The bottom line: \"As best as I can tell from my own work and a lot of conversations on this subject, the Chinese expected this kind of broader competition and contention with the U.S., but not for at least another 5-10 years. So they would prefer to find ways to defer and play for time, but they will eat what they have to now if Trump forces them to.\"The White House will roll out the next phase of its response to the opioid crisis this week, roughly a year after President Trump’s high-profile declaration that the epidemic constitutes a public-health emergency, Axios' Sam Baker and I report.Details: On Wednesday, Trump will sign Congress' recently passed opioids legislation, which, among other things, eases limits on Medicaid funding for addiction treatment and expands access to medication-assisted treatments similar to methadone.Where it stands: Congress and the Trump administration have steered billions of dollars to help with the crisis, and most of that work has been bipartisan, highlighted by the fact the bill Trump is signing passed the Senate 98-1.What’s next: The White House’s anti-opioids advertising campaign is continuing, and First Lady Melania Trump is also slated to speak at Wednesday’s event. Conway said opioids are the one public policy issue that the Trumps work on together.The life of Federal Reserve Chairman Jerome Powell is going from bad to worse. Trump is furious that Powell is raising interest rates quickly and even called the Fed the \"biggest threat\" to a booming economy.Another problem for the Fed: Trump's nominee for the central bank's board of governors, Nellie Liang, has significant problems with Republicans and may not even make it to the Senate floor for a vote.The bottom line: \"There's a better chance of seeing Elvis than of seeing her on the Fed,\" a source close to Republican leadership told me. Mitch McConnell is \"not going to call a vote on somebody who has no support among Republicans. That's not how Mitch works.\"On the Sunday shows this morning, bipartisan members of Congress took a much more skeptical line on Saudi Arabia's explanation of Jamal Khashoggi's killing than any statement from President Trump over the last 48 hours, reports Axios' Zach Basu.Flashback: On Friday, President Trump called the Saudis' explanation \"credible\" at a roundtable in Arizona.The bottom line for many in Congress, summed up by Sen. Ben Sasse on CNN: \"You don't bring a bone saw to an accidental fist fight.\"The House and Senate are on recess until the midterm elections.President Trump's schedule, per a White House official:In a 2007 deposition, Donald Trump said his estimates of his net worth go \"up and down with the markets and with attitudes and with feelings, even my own feelings...\"Why it matters: Now that he's president of the United States, Trump appears to be taking a similar feelings-based method to assessing the number of U.S. jobs gained from his arms deal with Saudi Arabia.The Toronto Star's Daniel Dale points out:The bottom line: From which source did Trump get these rapidly inflating statistics? I asked the White House press office. No response by deadline."}