{"id": "Axios", "paragraph": "The midterms gave Democrats control of the House of Representatives while the Republicans held onto the Senate. As Axios' David McCabe writes, the fallout is that Congress may start aiming harder at Big Tech. Here are five stories this week buried beneath the election coverage. Catch up quick: Amazon will now sell Apple-authorized products; traditional sports are looking to new tech to survive; GitHub users created 100 million repositories; Tesla picked Robyn Denholm as new board chair; and the Supreme Court will not hear challenges to net neutrality regulations.1. Amazon will now sell Apple-authorized products (CNET)Why it matters: iPhones and iPads will soon be available on one of the most extensive e-commerce sites in the United States. However, as a part of the deal, Amazon will kick Apple refurbishers and secondhand sellers' products off the site after Jan. 4, leaving only \"authorized retailers.\" Amazon is also not listing Apple's home speaker, which competes with its own Echo line. 2. Traditional sports look to new tech to survive Why it matters, per Axios' Sara Fischer: If the leagues don't innovate, they risk losing the attention and entertainment budgets of younger audiences who are more interested in digital alternatives. 3. GitHub users created 100 million repositories (Venture Beat)Why it matters: GitHub had 33,000 repositories 10 years ago when it was founded. Today, 31 million developers use the site, and it has come a long way. GitHub is now exploring ways to swap code between popular programming languages like Java and Python for efficiency. 4. Tesla picks Robyn Denholm as new board chairWhy it matters, per Axios' Kia Kokalitcheva: This is a welcome change in corporate governance for Tesla investors who have become concerned about Musk's workload, as he's also CEO of SpaceX. The move is part of a settlement with the SEC over Musk's false tweet that he had secured funding to take the company private. 5. Supreme Court will not hear challenges to net neutrality regulations Why it matters: The Federal Communications Commission repealed the rules last year, a move that has already been challenged by state attorneys and special interest groups. The three remaining conservative justices said they would have moved to roll back a lower court ruling upholding the 2015 rules."}