{"id": "20 Stylish And Affordable Sneakers You Can Get On Amazon", "paragraph": "\n          \n          Is there such a thing as a pair of sneakers that are comfy, stylish, and affordable? Yep, and you can get them from Amazon.\n        \n        We hope you love the products we recommend! Just so you know, BuzzFeed may collect a share of sales or other compensation from the links on this page. Oh, and FYI — prices are accurate and items in stock as of time of publication.\n    Promising review: \"I had a couple pairs of these back in the mid-1990s as a teenager and now I remember why I loved them! They are so cushy and comfortable while keeping a streamlined appearance. Very stylish and the perfect versatile sneaker that can go more sporty or be paired with cute outfits. I love that these have come back and better than ever. The quality is excellent and the color is absolutely gorgeous on these.\" —Angela MPrice: $30.75+ (available in sizes 5.5–11 and 10+ colors)Promising review: \"They are lovely, fit perfectly, and I love the colors.\" — HousePrice: $29.90+ (available in sizes 4.5–8.5 and 12 colors)Promising review: \"I'm pleasantly surprised by the styling of these sneakers. They fit well and look pretty sharp! I wore them to work with khakis today. For me, they do not have enough cushion for a run, but they are good gym and casual shoes. I'm going to pick up another pair of these later. These shoes are one of those cheap Amazon surprises.\" —P. RitzPrice: $16.99+ (available in sizes 6.5–13 and four colors)Promising review: \"I have been meaning to post, but these shoes are great quality. I always get compliments every time I wear them. So lightweight, great for walking inside and outdoors. Soft, breathable material and flexible, yet extremely comfortable. Have worn to travel through the airport, walking a few miles to class, and even to the gym.\" —kylee GentilePrice: $16.99+ (available in sizes 5–11 and 10+ colors)Promising review: \"I’m so pleased with these! I literally got them out of the box and have worn them all day and they’re so comfy. Very cute. Definitely, recommend these. Also, I normally wear 6.5 or a 7 in Steve Maddens. I got a 6.5 and they fit great, not too tight at all.\" —Amazon CustomerPrice: $75.84+ (available in sizes 5–11 and three colors)Promising review: \"These are SO comfortable! Since I’ve received them I’ve only taken them off to sleep and shower. They are very cushioned. Like walking on a cloud!!\" —DestinyPrice: $29.99 (available in sizes 7.5–11 and three colors)Promising review: \"These shoes are so comfortable. I absolutely love, LOVE them! I have a bunion on my left foot and these shoes are the only ones that don't bother it. I can walk a lot farther without pain wearing these shoes. I've tried several other types of shoes. Some expensive and some not so expensive. I couldn't walk that far as my foot would start hurting right away and would get worse and worse. It didn't take long to get to this point. Buying these shoes made me a very happy walker.\" —Dawn CarlsonPrice: $48.71+ (available in sizes 5–11 and two colors)Promising review: \"I love these shoes. Super light and comfortable. I am tired of all shoes that are too tight and make your feet feel hot. These are exactly what I was looking for and the price is much better than for brand sneakers from stores. Very nice color and fits even to my dress, so I wear them not only in the gym but to go out as well.\" —Daria G.Price: $22.99+ (available in sizes 5.5–12 and 12 colors)Promising review: \"Love the style, color, and support. I have no arches, along with arthritis in my toes and feet, so I desperately need the support. This is my second pair of Skechers and my overall favorite. Great price, much better than larger department stores.\" —Amazon CustomerPrice: $29.29+ (available in sizes 5–11 and 10+ colors)Promising review: \"I needed a casual pair of shoes that are stylish and comfortable to wear as I recently had foot surgery. I ordered a size larger than I would normally wear in sneakers so that I had the extra width due to the swelling. I can tie the laces loose on the foot that still has some swelling and tighter on the other. Works out well.\" —KathyPrice: $26.97+ (available in sizes 5–13 and 10+ colors)Promising review: \"Very good shoes!!! And they are very good for boxing because they have a good grip. They don't slip at all when on wet tile and there's good padding in the sole! I'm going to buy different colors now!\" —Papa OsoPrice: $25.99+ (available in sizes 6.5–13 and six colors)Promising review: \"A bit narrow for wide feet, but there are stretch panels on the sides that expand when you step. The fabric is subtle, satiny, and gorgeous. These are structured in the heel and made my PF heel pain completely disappear. A great comfy shoe to slip on in the mornings while I am running around the house with more support than slippers. Love these and would buy them again.\" —Kendra ParnellPrice: $27.95+ (available in sizes 5–11 and 10+ colors)Promising review: \"Love these! Super fun colors and they even look cute on my size 11 feet! They are extremely low profile, so I don't recommend running in them, but they are great for weightlifting and everyday wear. They have been comfortable since the very first day. I wore them hiking and climbing all over Thailand and they were great for non-slip activities. Plus they come with two different colors of laces too.\" —JicaDPrice: $17.92+ (available in sizes 5–12 and 10+ colors)Promising review: \"The best buy! So comfortable and fashionable. I live in NYC and walk all day in these sneakers. I highly recommend them. Wore them all fall, winter, and spring, and they still look new!\" —Bk teacherPrice: $88.97+ (available in sizes 5–12 and three colors)Promising review: \"Love these!! The olive is neutral and perfect for everyday casual when you don’t want to wear a sneaker. I get compliments on them all the time and I love that they don’t have traditional laces!\" —EDuncanPrice: $23.01+ (available in sizes 6–11 and 10+ colors)Promising review: \"One of the most soundly constructed and long-lasting shoes on the market today. This is also a comfortable shoe but beware it generally does take a day or two to break in. I have found the sizing to run about a half size small.\" —RH57Price: $36.99+ (available in sizes 7–14 and six colors)Promising review: \"Super nice sneakers and utterly AWESOME! Very soft, fashionable, and cool! The sneakers come with a pair of socks and an extra pair of shoe laces as a gift, which is a very nice little surprise, and such a nice gesture! Thank you guys!\" —evaPrice: $59.99 (available in women sizes 5.5–11, men's sizes 4–9.5, and six colors)Promising review: \"Excellent shoes and quite comfortable. I wore them for the Lupus Walk which was approximately 2.5 miles and my feet felt fine! I highly recommend this seller. The shoes came very quickly and were nicely packaged. I look forward to making more purchases.\" —Sugar BPrice: $22.99+ (available in sizes 5–10.5 and 10+ colorsPromising review: \"Excellent shoes! I have a pair of Skechers that I bought 12 years ago and they are still going strong. Since then, I'm a Skechers man. These fit perfectly, they are stylish, and I feel bionic when I wear them They're a great price and would highly recommend for an everyday sneaker.\" —James Price: $31.37+ (available in sizes 6.5–16 and nine colors)Promising review: \"First, I just want to say, I freaking love these shoes! For me, the shoes fit a little big in the heel, which is usual for me because I have a very narrow heel. Other than that I like the style, color, and feel. The shoes are lightweight and super comfortable to wear, it doesn't even feel like you're a platform I will have them in black.\" —ginaPrice: $32.99 (available in sizes 5.5–9 and four colors)Reviews have been edited for length and/or clarity.25 Dresses You Can To Wear To Work *And* On A Night Out17 Pairs Of Inexpensive Shoes That Everyone Will Think Are Designer27 Long-Sleeve Dresses From Amazon You'll Actually Want To Wear20 Bags You Can Get At Walmart That You'll Actually Want To Carry21 Wardrobe Staples Under $50 You'll Want To Buy Right NowWe Found The Perfect Fall Dress...And It's Only $10 On AmazonGreat!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      Great!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}