{"id": "These Are The Royal Pregnancy Rules Meghan Markle Has To Follow", "paragraph": "\n          \n          Of course, Meghan and Harry have a knack for breaking tradition.\n        While baby showers are extremely common in the US and UK, royal moms-to-be aren't typically allowed to participate in them. According to The Mirror, because of the royal family's wealth, accepting gifts for the baby is considered inappropriate.While pregnant royals traveling overseas is generally frowned upon due to heightened safety measures, Meghan's pregnancy was announced while she and Harry were literally on an overseas trip to Australia, Fiji, Tonga, and New Zealand. So we're guessing this one's flexible?Yep — according to UK Marie Claire, it's standard procedure for royals to stay mum (Ha! Wow.) about the sex of the baby on board. In fact, typically, the expectant parents are kept in the dark as well. Princess Diana was one of the few royals who found out the sex during her pregnancies, and she still didn't tell Charles!Though Meghan will likely deliver in a hospital, she will have a team of midwives at her bedside in addition to doctors, nurses, and the royal gynecologist. Sources claim that Princess Kate's three midwives were on call during her entire last three months and were not allowed to drink alcohol at all during that dry-mester.Even though pregnancy fashion has evolved past the typical maternity dress, this is a rule that carries over from the royals' day-to-day life. According to Reader's Digest, royal women are not allowed to show cleavage as it sends the wrong message and have to be even more careful during pregnancy, when bosoms are typically um, enhanced.Yep — this is a pretty hard and fast rule of royal fashion. But anyone who's been pregnant knows that the foot swelling can be really uncomfortable. So it'll be Queen Elizabeth vs. cankles, perhaps. We'll see who wins.According to Newsweek, royal protocol requires the royal couple to inform the queen of the birth first, then AND ONLY THEN may they announce it to their parents, friends, etc...after all, the queen is queen for a reason.Though royal birth announcements now make their way to social media also, there is still a framed announcement displayed which notes the sex of the baby and the date and time they were born.Yup — as with William and Kate's children, Baby Sussex (Baby Wales? Little Meghan? I dunno) will receive the full royal fanfare from the Tower of London, which takes about ten minutes to complete.That's right — according to Daily Mail, it has been common practice since medieval times for the town crier to stand outside the hospital ringing a bell. In the age of social media this is pretty damn cool, if you ask me.Prince Harry actually has four names himself — Henry Charles Albert David, but no surname. Each of Will and Kate's have three. So Harry and Meghan's baby will of course be expected to follow...Suits. Had to.The original gown was worn by 62 babies before it was finally retired in 2004. George, Charlotte, and Louis all wore a replica of the gown to their christenings, and Meghan and Harry's baby will likely do the same.It's tradition for royal babies to have plenty of godparents — like Prince George, who has seven. But Uncle Wills will NOT be in Meghan and Harry's lineup, as blood relatives are considered to already hold an important role in a baby's life.Like Princess Kate who took five months off after Louis was born, royal moms usually take around six months of leave in which all royal duties are suspended. And Meghan won't be the only one taking time off — Harry will likely receive a shorter unpaid leave as well.Turns out those iconic hospital steps photos in which Princess Kate looks like a million freakin' bucks are a treasured tradition made possible by royal glam squad members who sneak into the hospital to get Momma ready. So forget the hashtag #wokeuplikethis. In honor of the royals, I move that we start hashtagging things #gavebirthlikethis...you with me?Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}