{"id": "20 Travel-Sized Products For People Who Are Always On The Go", "paragraph": "\n          \n          When Willie Nelson sang \"I just can't wait to get on the road again\"...I felt that.\n        \n        We hope you love the products we recommend! Just so you know, BuzzFeed may collect a share of sales or other compensation from the links on this page. Oh, and FYI — prices are accurate and items in stock as of time of publication.\n    The coconut oil is 100% organic, and the 3.4 oz. tube is TSA-friendly!Promising Review: I LOVE this stuff. I've tried (and failed miserably) to travel with coconut oil. This makes is so easy and convenient. No spills, no mess. It's fantastic.\" —Erika AndersonGet it from Amazon for $10.76.It also has10 grams of plant-based protein to relieve brain fog and give you a boost! I IRL love Nakee Butter so much. Nutella? I don't know her. Promising review: \"This stuff is amazing! Better than Nutella and full of good-for-you ingredients! It is a great snack I keep in my purse. Everyone I have given a sample to is crazy about it. Please put this on every grocery store shelf in America!\" —kk15020Get a six-pack from Amazon for $17.70.This multi-pack includes three sprays: cucumber green tea, herbal rosewater, and chamomile lavender. Ahhhh...refreshing. Promising review: \"I've always ordered the big size of the rose spray but had to have these travel-size versions. Love this stuff — it makes my skin feel so refreshed, especially during this hot summer!\" —FrenchyGet it from Amazon for $21.What a great way to reuse a plastic bottle! Mother Nature thanks you. Promising review: \"I loved this product. I travel to Las Vegas from Houston a few times a year, and the climate change is so drastic that I usually am in pain from being so dried out!! I used this product every night during my stay and felt great!! I even came home and didn't get sick like I usually do after traveling! I would definitely recommend this to anyone who needs a convenient humidifier that is easy to travel with and move around!!\" —KevinGet it from Amazon for $24.99.Promising review: \"The Immune+ version of Emergen-C is truly a different experience. You get a much nicer fizzle and pop, which is very refreshing when the urge arises to clear out some junk from a germy day or trip. The Super Orange flavor is clearly the best (I have tried the others) and this is an excellent way to get some quick vitamins really anytime through your day. Also the small packets make it very easy to travel with.\" —Andrew Get it from Amazon for $16.12.The bottle is watertight (duh), dishwasher-safe, and folds down to AN INCH for easy travel!Promising review: \"I have been backpacking through Europe for about a month now and this water bottle has saved me space and hassle on countless occasions. It is lightweight, easy to store away, and quickly can be fully functional. I have saved at least €60 on water bottles by having this nifty bottle ready to go whenever a tap presents itself.\" —Jenna Troiso Get it from Amazon for $24.95 (available in three colors).Promising review: \"Ordered these for my son who loves to go backpacking. He loves Sriracha sauce, and these packets are the perfect size for backpacking — adds flavor to almost any backpacking meal. He couldn't wait to share these with his backpacking friends.\" —DogGoneRogueGet 25 7-gram packets from Amazon for $4.99.A one-button switch goes from straight to curl.Promising review: \"LOVED this product! The size is perfect for both traveling and everyday use! I loved the easy rubbery grip on the handle as well as the smooth titanium plates! Heats up super fast and both flat iron and curling iron sides work awesome! Would def recommend!\" —Glenda BatesGet it from Amazon for $26.99 (available in black and white).Poo-Pourri has garnered over ELEVEN THOUSAND REVIEWS on Amazon, and the verdict is in: This shit works. Promising review: \"I have these sprays in every bathroom in my home. I also travel with them, because you know how it is in a hotel with the bathroom right there by where you're sleeping... I also keep one at work, although I had to start hiding it in the bathroom because apparently other people love it as much as I do and decided to take it home with them. I highly recommend. So much more effective than the 'courtesy flush.' By the time you do that one, the problem is already 'out there.' With Poo-Pourri, it never has a chance. I haven't met a scent I didn't like so far. What a great idea!\" —Kindle CustomerGet it in a variety of travel sizes from Amazon for $4.95+.It also boasts 24-hour wear, so your pits can stay busy without worrying about *the funk*.Promising review: \"More people need to know about this stuff. It simply stops odor and lasts forever. It is like magic rock. I only have to put it on every other day and my pits are absolutely smell-free. I only wish I would have found this stuff years ago. I can't believe how affordable this is too. If more people knew about this, it would put the deodorant industry out of business! Just wet the crystal or put it on after your shower the crystal needs to be moist to work. Leaves no residue at all and kills the stink for days! The travel-sized container is perfect and it lasts forever.\" —Michael SmithGet it from Amazon for $3.Promising review: \"I always have these with me. It’s so critical as a full- time traveler. They’re small and stashable and make any quick sink laundry job effective. And I get to have my favorite brand from home, which is so nice when you're away. I consistently stock up on these after every trip.\" —World TravellerGet a three-pack from Amazon for $3.58.Promising review: \"These are a great size for traveling. Not too bulky. The sound comes in very clear. I like to use them on planes because they also block out the surrounding noise pretty well and are more comfortable for my ears than earbuds.\" —micheleGet them from Amazon for $24.99 (available in eight colors).Promising review: \"Love love love these!! I bought these for traveling for about two months in Central America. I have been traveling by bus/air and staying in hostels/hotels and private homes. These little babies have been lifesavers since many bathrooms are fine and many on the roads are questionable. I put a pack of seat covers in my travel backpack with a small roll of toilet paper, make a little kit, and I am good to go!!\" —Cynthia LeeGet a five-pack on Amazon for $8.46.The umbrella has been reviewed over 5,000 (!) times on Amazon! It weighs less than a pound and has a 42-inch diameter. So efficient! Promising review: \"Have had it for months now and what a lifesaver! I travel a lot so I keep this tucked in my briefcase for those 'moments of unexpected downpour.' Well let me tell you, it happens and this thing springs into action (pun intended) and is compact and light but large and strong! Highly recommend.\" —FlennGet it from Amazon for $21.95 (available in six colors).Promising review: \"I made the mistake of buying Marvis toothpaste once, and I was hooked. I have since tried using a travel size of Colgate when I was traveling and I hated it! Marvis texture is not gritty at all and it leaves your teeth feeling so smooth. It also seems to be more concentrated, so you don't need to use as much on your toothbrush. It is more expensive than other toothpastes, but it lasts longer. Available in several different amazing flavors, this really is worth every penny. But you might have to justify to your spouse why you need to spend this much on toothpaste. Once they try it, however, they'll be hooked as well.\" —AlanGet it from Amazon for $6 for 1.3 oz. or $10.50 for 3.8 oz.The notebooks measure 3.5 inches by 5.5 inches and contain 48 pages of ruled paper to fill with your hopes, dreams, and letters home. Promising review: \"Perfect small notebook to take with you on the go and write down information that you might forget. I always carry one with me and write down stuff that I would not likely remember when I get home. These pads are not bulky and easily fit in your back pocket or jacket pocket without becoming annoying. A must for people teeming with ideas that they would forget later on. Write them down on the spot and never forget anything again!\" —Fred AdelmanGet them from Amazon for $9.95.The 1.6 oz. bottle is TSA-friendly.Promising review: \"This product works very well. I have very dry and brittle hair in general, so I try to only wash my hair to to three tmes a week if possible, but I also stay active, so this really helps extend and freshen my hair especially in the summer months. Works just as well as higher-priced brands. I keep this on hand at home, in my gym bag and when traveling for work, and it's hard to fit in time for washing, drying and re-styling my hair before my next meeting. This is really a lifesaver.\" —Erin CisselGet a three-pack from Amazon for $11.37.I fall asleep listening to podcasts! So sue me! I'm afraid my phone will die in the night and won't wake me up, ok?! This trusty clock has no bells or whistles. Well...except for the one you need to wake up. Promising Review: \"Love it, love, it, love it! I have been a flight attendant for 39 years and am frequently changing time zones on my layovers. I always use a backup battery-powered alarm clock and need to often change the alarm. This has been my best one yet! It is simple to use, and has all the necessary features for me. I am now ready to retire but I will be using this on all my future leisure travels.\" —Amazon CustomerGet it from Amazon for $9.97 (available in black and white).This teensy razor can be refilled with any Venus blade, so you can reuse the handle every time you hit the road. Promising review: \"My only problem with this thing is that I can't go back in time with it! This thing would have been so useful back in college, or in my overnight bag for trips with friends, and a ton of other situations! I LOVE that you can change out the heads on it and keep using it. When I initially bought mine I thought it was a single-use razor. Thank goodness that it's not!\" —JDGet it from Amazon for $8.39.Promising review: \"I love this teapot for travel. I am not a coffee drinker, and using the hotel coffee pot for my hot water was gross. No tea drinker wants to taste coffee in her tea. This pot is small enough, I can even haul it in my backpack to the office I'm visiting. It brews two mugs of water. I'm very happy with this little kettle of joy.\" —Just a Girl From KansasGet it from Amazon for $19.99+ (available in white and black).The reviews in this post have been edited for length and clarity.23 Products That'll Keep You Organized When You're Traveling17 Stylish Travel Products You Need In Your Life27 Of The Best Travel Products You Can Get On AmazonGreat!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      Great!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}