{"id": "\n          16 Easy Things You Can Do Right Now For Better Skin\n        Latest from As/Is", "paragraph": "\n          \n          Great skin doesn't have to cost you an arm and a leg.\n        Water cleans out your system and removes toxins in your body. According to Harvard Health, how much water people should drink varies based on factors like health conditions and exercise. But, everyone needs it and should check with their doctor to make sure they're getting the right amount. Adding in a lemon always helps me with the taste!According to 100PercentPure, green tea has anti-inflammatory properties that reduce irritation, redness, and swelling of the skin. It also can be used as a hydrating face mask — when cold, of course.Stress breakouts are real, so take a moment to practice some self-care, whether that's applying a hydrating mask, lighting some candles, or unplugging from social media for a while. If you want to learn more of how I managed my anxiety, check out my post here.If you didn't know, giving up dairy (especially skim milk) can seriously help your skin out. According to MSN, cutting out foods like milk, cheese, and ice cream can improve skin texture, skin tone, and acne.Y'all, stop touching your face! I know it's hard, but putting your bacteria-laden hands on your face puts your skin at risk. All those germs on your hands are now on your face. Nope, no. Stop touching.You can get a Tangle Therapy product here for $5.99.\"From a dermatologist's perspective, I would like to see daily brush washing, so bugs and old make-up doesn't accumulate,\" Greg Goodman, associate professor and dermatologist at the Dermatology Institute of Victoria told BuzzFeed. So get to cleaning!Considering your cell phone is ten times dirtier than a toilet seat (EWWWW) I would HIGHLY recommend you wipe your phone with an antibacterial wipe at least once a day. When you answer your phone, you're putting all of those germs up to your cheek, eye area, and ear.Makeup shouldn't be on your skin while you sleep. It can clog up pores and irritate skin. Remove your makeup, cleanse your skin and follow with a moisturizer each night to treat your skin right. If you're feeling extra lazy, keep makeup remover cloths on your bedside table. No excuses!Again, something we've heard time after time. SPF not only offers protection from harmful UV rays that can add to the risk of skin cancer, but it's also is a barrier for free-radicals that exist in our air and congests our pores. No matter your skin tone or color, we all need SPF all year round.Your face is exposed to all types of germs throughout the day, and washing the day away will help remove bacteria and clear up your skin. Find a good cleanser and get into those pores, honey! Of course, follow up with a moisturizer when you're finished.Yes, face oils can be for everyone, even people with oily and/or acneic skin. They help maintain and strengthen your moisture barrier, which means that it can add hydration if you're dry, and it can lock in hydration if you're oily (so your glands don't go into overactive mode). In fact, there's an entire skincare ABCs you should look at.Honey if you haven't been exfoliating before, let me be the first to introduce you! Exfoliating has a ton of benefits, like minimizing pores, removing dead skin cells for healthy, glowing skin, and reducing breakouts because it unclogs your pores from excess oil.Although the world says you can sleep later, sleep NOW. Your body needs the rest to recuperate from the day, especially since not getting enough sleep can worsen pre-existing skin conditions and accelerate your skin's aging process.Sweating opens up and unclogs your pores, so get active so you can break a sweat! Whether it's yoga, sprints, or even just sitting in a hot room, sweat pushes out toxins. Be sure to wash your face afterward — sweat that sits too long on the skin can have clog those pores right back up.Girllll, if you only knew how much bacteria there was, you'd wash every day! Your bed is actually a breeding ground for fungi. Don't believe us? Read this very real study on all the fungi found on a sampling of pillows.Do you ever feel like your hair is brittle feeling after a shower? Or that your skin is super dry? A shower head can filter out excess chlorine in your water, a chemical which has a variety of side effects from health risks to asthma and allergy attacks, oh, and dry, irritated skin.Great!\n        \n          As/Is will be hitting your inbox soon!\n        \n      Great!\n        \n          As/Is will be hitting your inbox soon!\n        \n      "}