{"id": "16 Things Mindy Kaling Has Revealed About \"The Office\" On Twitter", "paragraph": "\n          \n          \"Michael Scott's Ted Talk would have been fun to write...\"\n        Scripted. One of my favorite Michael Scott moments ever https://t.co/8aQGEyRwI2My fave Pam line @jennafischer \"but Angela said she doesn't like to gamble. Of course by saying that she was gambling I wouldn't smack her.\"Michael Scott's Ted Talk would have been fun to writeSure @johnlegend has an EGOT but the honorary Dundie Michael Scott would’ve given him is the real story.One joke I wrote (and loved, but no else did) was that Tony and Ridley Scott are Michael Scott's cousins but he doesn't get along with themThey never used it on the Office but I pitched that Michael Scott was Ridley and Tony Scott's cousinsMichael and Kelly on The Office would've loved and identified with Live with Kelly &amp; Michael.All gifs should be Stanley from The Office@theofficenbcWhy has Michael Scott not tried to turn the office into a chill gossip hangout like the TMZ show and he's Harvey Levin??One of my favorite Office stories is when Dwight wanted a porcelain wizard holding a crystal that he saw in a shop at the mall.🎃🎃🎃 #TheOfficeProud to grace the cover of Michael Scott's favorite magazine, #AmericanWay! @AmericanAir 😍✈️❤️💁🏾👍🏾🌈Wolf Hall and Mr. Robot sound like shows Dwight Schrute would come his pants forI think people are going to really like when Jim and Pam are murdered by a goofy serial killer, special guest star Chris Parnell!I'm ancient! TEN YEARS AGO Greg Daniels hired @PaulLieberstein @bjnovak @KenTremendous &amp; me as full-time writers for s1 of The Office.Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}