{"id": "Scientists Think They Might Be Able To Solve The Space Junk Problem – By Shooting Lasers At It", "paragraph": "\n          \n          Unfortunately, you won’t be able to actually see the laser beams.\n        There are around 170 million pieces of space junk currently in orbit around the Earth, hurtling around at high speeds and posing a constant threat to space technology. Now scientists believe they may have found the solution: shooting the junk with lasers.International experts will convene in Canberra this week for the 21st International Workshop on Laser Ranging, hosted by the International Laser Ranging Service (ILRS) and Australia's Space Environment Research Centre (SERC).The primary discussion point will be the launch of a laser program in Australia to shoot space junk with highly-accurate beams from the ground at SERC's Mount Stromlo base in the ACT, moving them out of Earth’s orbit.Space debris is really dangerous. It travels at a speed over 28,000 km/h (a bullet travels at 4,500 km/h), meaning that debris as small as a centimetre across can damage or destroy satellites.The Department of Aerospace Engineering at the University of Texas has a program called AstriaGraph that currently tracks 26,000 objects that range in size from that of a softball to a school bus.Manned spacecraft and GPS and communications satellites are all in danger of collision with space junk.Dr Moriba Jah, an aerospace engineer from the University of Texas, said in a media conference held in Canberra that space junk is a serious cause for concern, particularly as space technology becomes more accessible.Dr Ben Greene, the chief executive officer of electro optic systems at SERC, told BuzzFeed News that the aim is to bring the objects back to Earth safely or gently move space debris from one orbit to another.The aim of using lasers is not to splice the junk into more pieces, as this would only exacerbate the issue. Instead, the laser beam exerts force on objects in orbit equivalent to four or five times that of sunlight, meaning that rather than shooting objects out of the Earth's orbit or down to Earth, they are nudged progressively over time.“It’s like throwing sand at something,” said Greene. “To de-orbit so it comes all the way down and it burns in the atmosphere, we’d have to engage it with the laser for three minutes about 10 times.”This is a laborious process, as the scientists then have to track the object's new orbit on each rotation and ensure that it is not going to collide with something else.“Typically with those orbits, you only see the objects two times a day, and the rest of the time they're orbiting over the Pacific or America or somewhere else, so it would take a week [for each piece of junk to be pushed out of orbit],” said Greene.Human-made objects in space have been collecting in Earth’s orbit since the early ’60s, and the first recorded fragmentation of a space object was in 1961, when the Ablestar, an American launch vehicle used to propel experimental satellites, became the first object to unintentionally explode.The Ablestar explosion created nearly 300 large fragments of debris, increasing the total amount of debris in orbit by 400%. Sixty percent of the Ablestar junk was still in orbit in 2011 because of the high altitude of the explosion.The majority of space debris that has amassed since has been created by collisions of spacecraft (both intentional and accidental).The most significant contributing event was the 2007 Fengyun-1C destruction, in which China launched an anti-satellite device on a ballistic missile that hurtled towards an old, unsuspecting weather satellite at 16 km/s. The resulting explosion created over 3,000 pieces of junk.Greene notes that while Australia is not the ideal location for most space programs, due to the lack of high mountain ranges, it does provide the perfect climate for shooting lasers into space, because they work best in a dry air environment (the efficiency of lasers can be affected by atmospheric elements such as water droplets).Greene also says that SERC’s tracking technology for space debris is 100 times more accurate than any other agency in the world because of the laser system it developed to locate junk in orbit.“Nowhere else could run a program for debris mitigation because no one else knows where the debris is accurately enough,” said Greene.SERC’s program to accurately track space junk and build the laser system has been in operation since 2014 and the $200 million laser system will be switched on for the first time in December.The laser will only be run at 10% capacity at first but will be in full operation by March 2019, Greene said. Unfortunately, it has been designed to be invisible to the naked eye.\n     Contact Elfy Scott at elfy.scott@buzzfeed.com.\n    \n     Got a confidential tip? Submit it here.\n    BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}