{"id": "This Kombucha Brewing Kit Has A Cult Following On Amazon And Will Save You So Much Money", "paragraph": "\n          \n          Time to get DIY with your 'bucha.\n        \n        We hope you love the products we recommend! Just so you know, BuzzFeed may collect a share of sales or other compensation from the links on this page. Oh, and FYI — prices are accurate and items in stock as of time of publication.\n    It includes a 1-gallon brewing jar made of thick glass, Brew Notes to keep track of each brew's details, custom pH test strips and a temperature gauge to monitor progress, as well as a 16-page post-brewing guide that'll walk you through how to bottle your kombucha, experiment with different flavors, and care for the kombucha culture. Plus, organic sugar, an organic tea blend, and a kombucha culture and liquid starter.\"I've been wanting to try my hand at making kombucha for a few years now, but was afraid of making it wrong and becoming deathly ill. Also, I admit, the scoby kind of freaked me out. One of the blogs I follow recently reviewed this kit and I decided to go for it (and besides, paying upwards of $3.50 per bottle at the store was getting ridiculous). I am so happy I bought this kit! I'm currently brewing my second batch as my first batch came out awesome! I made a ginger/orange flavor and a strawberry/lemonade flavor from that first batch and they taste even better than what I can buy at the store. And no more fear of the scoby! I actually enjoy looking at it daily to see what new changes have occurred overnight. I think it's safe to say I will never buy store-bought kombucha again!\" —Cheflene\"It has everything you need to start a first batch of kombucha. It includes clear instructions for how to make, and how to continue your kombucha for the second batch. Now I’m making my third batch, and loving it so far. After the first batch, you will need to find your own tea leaves and sugar, but it’s fun trying different tea to see how different they all taste. It’s also fun trying different fruits/spices during the second fermentation. If you purchase this kit as your first kombucha investment, you can brew your own kombucha forever, only needing to buy additional tea leaves and sugar.\" —Meg\"Amazing product. Easy instructions and addicting hobby. I love this product and would recommend to anyone looking to start brewing their own kombucha.\" —Lisa FucciReviews have been edited for length and/or clarity.19 Things That'll Make Drinking Tea Even Better18 Foods That'll Basically Last Forever28 Delicious Snacks On Amazon That People Actually Swear ByGreat!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      Great!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}