{"id": "These 14 Adorable Coincidences Which Brought Couples Together Will Make You Believe In Love Again", "paragraph": "\n          \n          \"I always wonder how my life would be different if I hadn’t swiped right on that guy...\"\n        \"I spotted my future partner from across the dance floor at a club in 2006. I took a selfie with him, with an actual camera, and walked away. I posted the photo on Friendster and my sister asked me how I knew the guy. I told my sister I didn’t know who she was talking about. Turns out her and the guy in the photo’s older brother had been friends since 1994. My sister wanted to hook us up, but she didn’t because of our age difference (5 1/2 years). With this new info, I found him on Facebook and asked him out for coffee, and we’ve been together for 11 years.\"—shaunadeg\"I had tried online dating off-and-on for a while. I’d been on some dates, had a few relationships, but overall I was just sick of the whole scene and was ready to swear off dating for a while. I logged in one final time to delete my profile and the app forever. My boyfriend happened to message me seconds before I deleted the profile. We’ve been together two years now and I always joke around that he made it in the nick of time!\"—lizaraffetheawkwardgiraffe\"We met by chance driving home.We were both leaving work in the same city. Going home should have been a very quick route but we both kept missing our exits for one reason or another. We ended up on the same exact highway, at the same exact time, that was completely out of the way to go home.I'm usually in a rush to get home after a stressful day but this day in particular, I was very calm and took my time. We took the same exit but took different turns to a road that ultimately merged. I looked over and saw this incredibly gorgeous man. I smiled at him and he smiled back. He asked me to pull over to exchange numbers and it turned out that we lived two minutes away from each other.Nine years later we're going strong. It's funny how a coincidence can change your life.\"—oldsoul972\"My husband and I initially met at a Def Leppard concert at the Nebraska State Fair. My roommate and I went to the concert with a couple of friends. My roommate’s boyfriend and a couple of his friends were also at the show but seated in a different section. We met up after the concert so my roommate could leave with them. I was introduced to Eric (my husband), but we only spent about five minutes together. Fast forward 3 1/2 years, my roommate and Eric’s friend are married. She threw her husband a birthday party, where I saw Eric again. We started dating a month later and got married 2 1/2 years after that. We’ll be celebrating our 13th anniversary in January.\"—bethmcivorh\"While playing an online game (MapleStory FTW), this avatar randomly comes along and my ex said, “Oh wait, this in-game/screen name belongs to my cousin.” Long story short, my future husband and I add each other in the game, and we end up playing COUNTLESS HOURS together. Which eventually lead to sharing phone numbers and social media pages with each other.When my ex and I broke up, my future husband was already my best friend. So he quickly became my shoulder to cry on and my “person” for almost anything, and after almost eight years of being together, we got married this past August!Here’s our MapleStory wedding from 2010 or 2011!\" —ameliabailey\"Before my boyfriend and I met, we learned that we'd had several mutual friends. I became good friends with one of them when I was living in a completely different state. When my friend would visit his hometown, he'd visit my current boyfriend.Another friend I've had since 8th grade lived in my boyfriend's old bedroom and they were college friends! Me and my boyfriend also worked in two different but conjoined restaurants that shared a back dock, where I often talked to his coworkers. Somehow, though, we were never introduced. It was a good thing, though, because during all those times, I was dating somebody else.Finally, a couple of months after I'd broken up with my ex, my current boyfriend came into a different restaurant that I'd started working at and sat at one of my tables. He flirted with me a lot and I hoped so badly that he'd leave his number. I ran back to the table after they'd left and luckily he did! We have been together ever since and are so happy together. Timing is everything, and even though there were several ways we could have met, we didn't until the perfect time.\"—courtneya4f8e9be56\"I met my husband at a homeschool meeting. I was 12, and he was 16. I told my mom that I really liked him and that I wanted to marry him. My mom quickly brought me back to earth and reminded me that he was practically an adult already. I invited his family to my 13th birthday party and that was the last time I saw him.Over 10 years later, he came back home from a stint overseas with the military. He came walking in the grocery store where I worked and it was weird. My feelings had changed, I had another guy. But he hung around, we went to dinner, and became good friends. But ONLY friends, I was very clear. Then he had family issues and disappeared.Only when he was gone did I realize that I loved him. By that time, I was single and it took me over three months to find him and tell him that I loved him. A year later, we are married and expecting a baby. A naive 13-year-old's dreams came true!\"—eaglehyland\"We were neighbors! I lived on the first floor, he lived on the third floor. We first met at the bar near our apartment complex, kinda' bickered with each other, then we didn't run into each other for another nine months. Then we ran into each other at our apartment complex when a fellow neighbor locked her keys in her car. We started hanging out, and it kinda' just became more. Now it's 3 1/2 years later, and we live together and started a law firm together.\"—tangyal\"When I was in high school I did an overnight college tour where we stayed in a dorm and took a couple of classes to see what it was like. I was randomly assigned to a host and in her dorm were pictures of her and her boyfriend. She joked that her boyfriend was taken, but showed me a picture of his single brother! I remember leaving thinking college must just be full of cute guys. Later, I got accepted into that college and met that girl's boyfriend's brother (totally randomly) through other new friends, forgetting all about that high school trip. It wasn’t until we were dating a while that I realized the connection. We’ve been married 4 years now! (FYI: The girl and my brother-in-law broke up, but he’s happily married to someone else and she served an unintentional matchmaking purpose!)\"—allie493550f64\"I met a man on an elevator who convinced me to go on a first date with him, and I wasn’t really feeling him, but I went anyway. I was nervous, so I suggested that we go to the bar down the street from where I worked because my friend was bartending there. Turns out, this was the WORST DATE I’ve ever had — with the man being simultaneously boring and rude, bragging about a lawsuit against him, hitting on my friend and then trying to flirt with me again.Then I saw the beautiful man (my current partner) out of the corner of my eye and he looked very familiar. I couldn’t stop staring at him — both because he was hot and because I was trying to figure out how I knew him. I finally got his attention and asked him if we had met before, and he said that we actually met on Bumble but that I had ghosted him! I was mortified and the fact that I was on another date made it worse.I confessed that I deleted the app because it was too much, not because I wasn’t interested. After that, I tried to run and hide from my awful date. My beautiful partner happened to be taking out the trash at that very moment, got my number, and now we're head over heels and live together!Oh also, it was his FIRST day working there too! So if we had gone somewhere else, gone a day earlier, or if my friend was off that day, we never would have met.\"—shelbyjoh\"I was supposed to get off on the 11th floor of the courthouse for a trial I was watching, but I accidentally pushed the button for the 10th. It wasn't until I got off and walked to the courtroom that I realised I was going to the wrong trial.One of the attorneys in the trial was outside the courtroom waiting for the jury to return for a verdict. Instead of turning on my heel and embarrassing myself by admitting I wasn’t in the correct place, I struck up a conversation with him. We exchanged numbers and seven years later, we’re married with a four-year-old.\"—alicea4e679cdf6\"I was on Tinder casually, almost swiped left on a guy, but decided at the last second to go right instead. We chatted and he ended up being the only person from Tinder I ever met up with in real life, fast forward five years and now I’m married to the guy’s roommate and we have our second kid on the way. I always wonder how my life would be different if I hadn’t swiped right on that guy...\"—danih47af4a746\"My boyfriend and I unknowingly lived in Seattle at the same time. We even had mutual friends and attended the same industry events but never crossed paths. We then moved to LA around the same time as each other! Two years later, a mutual friend invited me to an event and I noticed a very attractive man setting up the signs. He was wearing a Seattle International Film Festival T-shirt and I told him that I was from Seattle. We slowly but surely hit it off and now we’ve been together for the past few years!\"— Meli Alexander via Facebook\"I’ve always been interested in learning languages, so over the years, I dabbled in American Sign Language (ASL). While working at a bank, the cutest guy used to come in, and when I found out that he was deaf, I made a point to wait on him and use my basic signing skills. My best friend worked at the same company as me and every time he came in I would gush to her about how cute this guy was, how I was going to actually learn ASL for him and we were going to live happily ever after etc. Basically, I had a MAJOR schoolgirl crush, but I was sure that’s all it was.My best friend started to date someone new, and it turned out her new guy was someone I grew up with/went to school with. I knew her new guy mostly because his stepbrother was my first serious boyfriend way back in 9th grade! They’d been dating for about two months and she kept telling me that they wanted to double because her boyfriend had someone in mind for me.Well, when we arrived at the restaurant, I was a nervous wreck from being set up on a blind double date, and who does this mystery man turn out to be, you ask? The cutie from the bank, of course! I was so terrified my head was buried in the menu for the first 25 minutes of dinner, thinking, how were we going to communicate?Eventually, I calmed down and it turned out that he remembered me as ‘the pretty girl who signed to him’ at the bank! I lucked out that it was a double date because my ASL skills were limited and my best friend’s boyfriend could interpret for us when needed. We went to a bar afterward and as the conversation came more naturally, I discovered that the boys were actually brothers.So I had grown up and gone to school with both his older and younger brother, but never met him because he went to a residential deaf school an hour away instead of our local public school. I couldn’t believe we grew up in the same town and never officially met! I woke up the next day determined to learn as much ASL as quickly as I could and started teaching myself online. Soon he told me I learned more in two weeks than his ex-girlfriend ever did in two years. Almost a year later, I love learning ASL so much that I’m considering becoming an interpreter and we’re moving in together. Stay tuned to see if we live happily ever after!\"—kaydr2Note: Submissions have been edited for length and/or clarity.BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}