{"id": "16 Foundations Under $20 That People Actually Swear By", "paragraph": "\n          \n          From sticks to matte to powder foundations — these are totally worth it!\n        \n        We hope you love the products we recommend! Just so you know, BuzzFeed may collect a share of sales or other compensation from the links on this page. Oh, and FYI — prices are accurate and items in stock as of time of publication.\n    This product is hypoallergenic!Promising review: \"I have never been able to find my true color match. Now I have found Black Opal Foundation. My skin tone has changed over the years and my other brand's colors I once used to wear are not a match anymore. This matches beautifully with my skin tone. This is a must try! My husband says it doesn't look like I am wearing a mask now and he loves it too!\" —Choicee ShoprGet it from Amazon for $9.84 (available in 16 shades).Promising review: \"I have dry skin and as long as I use this foundation with a hydrating primer, this is perfect. It covers any breakouts in one or two layers, doesn't cling to dry patches, and doesn't emphasize texture. I have a lighter skin tone and I do have to mix 101 with 102 to get my perfect shade.\" —JessGet it from Amazon for $8.35 (available in 13 shades).Promising review: \"I love it! It's very velvety and easy to apply and blend. You can use it as a concealer or a foundation. I'm not a big makeup person and I really like my makeup to be as natural as possible so this was perfect..\" —AshGet it from Ulta for $18 (available in 20+ shades).This product is organic and cruelty-free!Promising review: \"If you want a good quality 'real' mineral powder foundation, try this one. Many foundations can be orange-y but this one is not. I love the olive shades! I recommend using a good quality foundation brush rather than a sponge. Make sure to use a good moisturizer or serum beforehand so that it doesn't settle into fine lines and don't apply too much. This also works great as a highlighter and contour (buy a shade darker and a shade lighter for this). Also, they last forever! A little goes a long way but you can also build them up if needed.\" —TidBritsGet it from Amazon for $18.15 (available in 15 shades).Promising review: \"I am in love with this foundation. It's perfect for oily/combination skin. Its coverage is just great and doesn't feel heavy on your face at all. Very natural looking and although I don't recommend being 24h with your make up on it really does look good even after hours of dancing and sweating. Couldn't ask anything more and the price just seals the deal completely.\" —PaolaGet it from Amazon for $7.21 (available in 41 shades).This product is free of mineral oil, parabens, and fragrance!Promising review: \"This is my favorite foundation that I have ever used. I have oily skin and even though this is not a matte foundation, it still looks great and it stays on ALL DAY! It has a very natural finish and everything (bronzer, blush, highlight) sits on top of it beautifully. And for $20?! Highly recommend.\" —JBY18Get it from Sephora for $20 (available in 37 shades).Promising review: \"I bought two bottles of CoverGirl Advanced Radiance foundation in order to highlight/contour my face. I am 40-years-old and I'm just starting to see fine lines and wrinkles on my face, especially around my eyes, and this product gave me the coverage I was hoping for. It is smooth and light, but also gave good matte coverage. I love that it has sunscreen in it too! I would recommend this product to friends and family.\" —Lindsay D.Get it from Amazon for $5.98 (available in eight shades).Promising review: \"I was looking for a foundation that wouldn't make me break out during the day, but this one actually helped my acne clear up more than usual! Just a little bit of it can cover the entire face and works well to even the skin tone.\" —mindyGet it from Amazon for $6 (available in five shades) or Ulta for $6 (available in three shades).Promising review: \"Hands down, this is the most awesome foundation ever! After 20+ years of struggles with acne, on top of my newly acquired aged details and dark circles from missing out on normal sleep, this stuff covers it all! I have actually had fewer breakouts since starting to use this (of course I wash it off before bed) and I feel natural with all the coverage I need in all the right spots. LOVE LOVE LOVE. This is better than any $50+ foundation I have ever found!!\" —GirlMom3Get it from Amazon for $9.79+ (available in 18 shades).Promising review: \"This is my first time purchasing a Milani product and I absolutely love it! It's lightweight but full coverage. It also holds up against Florida's humidity, which is a huge plus. I have oily skin that tends to be very sensitive and this doesn't add any oiliness (like some other foundations I've tried) and so far, no weird reactions from my skin. I highly recommend it!\" —Didi MyDoeGet it from Amazon for $9.99 (available in 14 shades).This product is oil-free and non-comedogenic!Promising review: \"If you don't overdo it, this is the most natural makeup I've ever used. Much easier to apply than liquid foundation. I have uneven color and this makes my complexion smooth and clear. I've been using it for a few years now and this is the best price I've seen it sold for... ANYWHERE.\" —Candace D. MorinGet it from Amazon for $6.48+ (available in five shades) or Ulta for $13.99 (available in three shades).Promising review: \"This is the only product I've found that matches my skin tone and doesn't make me break out while being pretty low-maintenance. I have very pale combination skin with warm undertones and the W1 shade works surprisingly well. It offers a decent amount of coverage while managing to look natural. My skin actually feels greasier when I don't wear this foundation and the powder certainly helps extend the life of it too. I love that it doesn't feel like there's a ton of makeup on my face when I'm wearing it and that it doesn't take a long time to apply. It's by no means a miracle product for curing acne, but after using this product for a couple years, it never seems to exacerbate acne for me.\" —EjcaliburGet it from Amazon for $5.50+ (available in 41 colors).This product is hypoallergenic!Promising review: \"I have the worst hyper-pigmentation on my face, all over!!! This concealer feels like I am wearing nothing on my face. It has amazing coverage and lasts all day!!! It blends perfectly on my skin.\" —Erin71692Get it from Amazon for $9.93+ (available in eight shades).Promising review: \"This is one of the most natural looking foundations I've owned. I usually have trouble finding a good match because I have olive tones but this one is darn close to my natural color. I love to wear it with a setting powder and brows for a natural, minimalist look. It gives me light coverage on my undereye circles and generally evens out my skin. It's also easy to layer other products over it and it blends out beautifully with fingers or a sponge.\" —LizGet it from Amazon for $4.39+ (available in 42 shades).Promising review: \"I really love this foundation. I recently spent $50 on a new foundation but I'm going back to buy just more of this. I have a couple, one these that I keep at home and one in my bag. This foundation easily layers over other makeup, even powders, if you want to touch something up while you're out. It's light to medium coverage and buildable, as well. The finish is beautiful, dewy, but not greasy looking, and it's easily mattified with a little powder.\" —Ama24Get it from Ulta for $8.99 (available in eight shades).Promising review: \"Love Neutrogena Mineral Sheers. With the hot weather and humidity when you perspire, it will not separate like liquid makeup! All you do is blot and it still looks nice.\" —MissyGet it from Amazon for $7.38 (available in eight shades).Reviews have been edited for length and/or clarity.19 Makeup Products That Won't Budge No Matter What 22 Skincare Products Under $5 That'll Actually Work20 Of The Best K-Beauty And Skincare Products You Can Get At Jet21 Long-Lasting Eyeliners That Actually Won't Budge24 Moisturizing Products For Every Inch Of Your Body24 Beauty Products That'll Actually Make A Huge DifferenceGreat!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      Great!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}