{"id": "\n          21 Holy Grail Fashion Websites That Every Australian Should Be Shopping On\n        Latest from As/Is", "paragraph": "\n          \n          The best places to spend all that hard-earned money.\n        Why you want to be shopping here: If you're looking for some casual-cool wear, Peppermayo is the place to shop. They've got a mixture of branded and non-branded clothing and shoes, plus their own swimwear line which is super cute. And in their beauty category, they stock Lime Crime lipsticks! Shipping details: Free express shipping if you spend over $50. There's also options for same day and overnight delivery if you live in Sydney. Discounts: Sign up to their email list and grab $15 off your purchase.Why you want to be shopping here: Showpo has a great range of casual and party outfits in sizes 4-20. They're an Aussie brand too which means that all your purchases will arrive at your door step in no time at all. Shipping details: Free express shipping if you spend over $50.Discounts: 15% for students through UNiDAYS.Why you want to be shopping here: Beginning Boutique is another great Australian brand that stocks some on trend and unique pieces. They've got their own swimwear line as well, and often collaborate with local designers and influencers to create some ~exclusive~ clothing lines. Shipping details: Free express shipping if you spend over $75.Discounts: 10% for students through UNiDAYS.Why you want to be shopping here: As you probably know, ASOS is one of the best places to shop online. They've got a huge variety of affordable clothing on offer which they stock in different fits (petite, tall, curvy, maternity etc) AND their returns policy makes finding your next outfit super easy. Shipping details: Free standard shipping if you spend over $40 and it'll arrive in six working days to metro areas. Or if you have the cash, get express shipping for $15 and that should arrive in two to three working days. Discounts: 10% for students through UNiDAYS.Why you want to be shopping here: If you haven't shopped on The Iconic yet, you need to get on it. It's basically an Australian version of ASOS, and they offer free shipping and returns which means you don't have to stress over whether something won't fit or not. Shipping details: Free express shipping if you spend over $50. There's also options for same day and Saturday deliveries if you live in Sydney. Discounts: 10% for students through UNiDAYS, 15% for students through Student Edge or grab a $20 voucher if you sign up to their newsletter.Why you want to be shopping here: Boohoo has been a solid favourite of mine for a couple of years because of their wide variety and affordable pricing. In my experience the clothes have been decent quality, but it can vary from piece to piece. You are able to have items fully refunded which is great!Shipping details: Standard shipping will set you back $6.99 and express is $14.99. Both options should arrive to you in five to six working days. Discounts: 10% for students through UNiDAYS.Why you want to be shopping here: Princess Polly has a huge range of cool, Instagram-worthy outfits and swimwear pieces. But their beauty collection is definitely a standout, with brands like Jeffree Star cosmetics, Ardell Lashes and L.A. Girl available for you to get your hands on. Shipping details: Free express shipping for orders over $50.Discounts: 20% off for students through UNiDAYS.Why you want to be shopping here: If you're looking for surf and street style clothing, you need to check out Ghanda. Their collections will give you major coastal town vibes and it's affordable too! Best of all, you'll be supporting an Aussie brand. Shipping details: Free standard shipping for orders over $75. Or if you want to express that baby, it'll cost you $12. Discounts: None that I know of.Why you want to be shopping here: Like Ghanda, Surfstitch is your one stop shop for all things surf, swim and beach. My personal favourite is their MASSIVE swimwear collection which offers full coverage options as well as your usual bikinis. Shipping details: Free express delivery for orders over $50.Discounts: 15% for students through UNiDAYS. Plus look out for their free gifts if you spend over a certain amount.Why you want to be shopping here: If you live in Sydney, you might remember walking past a Stelly store. Well, they've expanded their collection and it's all available online. Their quick shop categories make it super easy to find the perfect outfit without having to trawl through pages of options. Shipping details: Free express shipping for orders over $50.Discounts: None that I know of.Why you want to be shopping here: If you want to look like a Kardashian but are running low on funds, Missguided will be perfect for you. They sell trendy pieces in just about every category. Bonus: they stock in sizes 4-24! Shipping details: Free standard shipping if you spend over $100 (four to seven working days), otherwise it's $5. Or express shipping will cost you $10 (two to four working days). Discounts: Currently there's a 40% discount being offered for students through UNiDAYS.Why you want to be shopping here: Similar to Missguided, Pretty Little Thing stocks a bunch of fashionable pieces that are updated constantly. They also have a gorgeous plus size range and offer returns. Shipping details: Standard shipping will set you back $10 (five to seven working days). Or if you want to fast track your order, express is $15 (four working days). Discounts: 50% off for students through UNiDAYS.Why you want to be shopping here: While there's heaps of physical Cotton On stores, they've made shopping online too easy. Their clothes are super cute and affordable if you're on a budget, and they sell everything from sunglasses to denim skirts. Shipping details: Free standard delivery when you spend over $55. Or if you want to express it, add an extra $2. Discounts: 20% off for students through UNiDAYS.Why you want to be shopping here: Technically you can't purchase anything off Glam Corner, but it is a fantastic rental website! I've personally used their service for three separate events – delivery and returns is super easy, and they have such a wide variety of dresses to suit your budget and occasion. Shipping details: Shipping ranges between $10.95-$15. Discounts: 10% off for students through UNiDAYS.Why you want to be shopping here: There's a lot of different options on White Fox Boutique to suit the mood you're feeling. Whether that's a summer dress or some sleek neon bodysuits, there's something for everyone. Shipping details: Free express shipping for orders over $75 and free standard shipping for orders over $50.Discounts: Subscribe to their mailing list and grab a $10 voucher.Why you want to be shopping here: Think luxe, on-trend, statement pieces without the designer price tag – that's Meshki. They do a bunch of different collections, as well as their own swimwear line Shipping details: Free express shipping for orders over $100 or free standard shipping for orders over $50. Discounts: 10% off for students through UNiDAYS.Why you want to be shopping here: Founded by two Melburnian sisters, Tiger Mist stocks a range of form fitting pieces designed to show off what your mumma gave you. Shipping details: Free express shipping for orders over $80.Discounts: 15% off for students through UNiDAYS or sign up to their mailing list for a $10 voucher.Why you want to be shopping here: Based in Sydney, Pop Cherry has a ton of cute and casual pieces that can easily take you from day to night. Best of all, they upload new items every day so there's always something to check out. Shipping details: Free standard shipping for orders over $60. There's also options for express shipping, as well as same day and night deliveries if you live in Sydney. Discounts: None that I know of.Why you want to be shopping here: Another Sydney-based brand you'll want to check out is Hello Molly. They've got a huge collection of trendy clothes, shoes, accessories and swimwear that won't break the bank. Plus there's a bunch of customer reviews on the site which you can check out before buying yourShipping details: Free express shipping for orders over $50. There's also an option for same day delivery if you're in Sydney. Discounts: 10% off for students through UNiDAY or sign up to their email list for 10% off your next purchase.Why you want to be shopping here: Like the name suggests, Lioness has a range of bold and statement-making outfits to help make you feel your very best. Similar to a bunch of Aussie based brands, they've got their own swimwear line too.Shipping details: Free express shipping for orders over $50.Discounts: Grab $20 off your first order by joining their newsletter.Why you want to be shopping here: If need a wardrobe refresher but don't have the big bucks, Charcoal Clothing is a good option. Their styles range from relaxed and laid back, to edgy and festival ready. Shipping details: Free standard shipping if you spend over $50 or free express shipping if you spend over $80. Discounts: Sign up to their newsletter for 20% off.It's As/Is week at BuzzFeed Oz! We're focusing on Aussie style and beauty posts for a whole week, click here to check out more.Great!\n        \n          As/Is will be hitting your inbox soon!\n        \n      Great!\n        \n          As/Is will be hitting your inbox soon!\n        \n      "}