{"id": "17 Movie Plots That Could Have Been Resolved With A Simple Conversation", "paragraph": "\n          \n          So much avoidable drama!\n        \"It’s a plot hole the writers admitted to, why Ariel didn’t communicate in writing to Prince Eric in The Little Mermaid. We’ve seen that she can write, as she signs Ursula’s contract. Just a simple note saying she was the one who saved him. It'd give Eric awareness of what little history they have and could easily have provided the catalyst for the essential kiss away from the sea and Ursula’s area of influence.\"—jbmasta\"Literally the entire plot of Fight Club would have been so different if someone had asked the narrator why he was fighting himself in the parking lot, or even later if Marla had confirmed they slept together instead of storming off every time he was confused. I love the film but man, that just always gets me.\"—rhiannam48853d06f\"If Harry and Ron just told someone that they had missed the train (not the main plot but you know what I mean), if Ginny had told literally anyone, if Harry told Dumbledore what he heard in the pipes (though hello plot hole, as it’s since been confirmed that Dumbledore at least understands Parseltongue). If Hermione had voiced her theory instead of just running away to the library...and why did Ron and Harry go to Lockhart? When they found out he was a fraud why take him to the chamber? Just take him to the staff room and tell McGonagall or something, then Harry wouldn’t have had to face Riddle and a goddamn Basilisk alone!\"—triciah4174e689f\"Literally the whole issue could've been fixed if they both said 'Lex is a bad guy, my mom's name was Martha.'\"—kelsaq\"Lara Jean could have just talked to him to ask what he was doing with his ex...instead of ignoring him for like two days and then breaking up without giving him any reason!\"—girlenchanted\"If Becca told Chloe that she was working at the record company, it would have saved a lot of unnecessary stress for Becca, who spent the majority of the movie running around hiding something major from her closest friends. Also didn’t anyone study for their degrees?\"—gemmaw489d70370\"Sonny, just have your friend call the dude at social services and tell him he's out of town and is letting you handle the situation until he gets back. Come on.\"—jordyy027\"No one told Poe and the others what the plan was and they went off having their own plan, which basically was unnecessary and caused a whole lot of problems on its own. Literally everything in this movie would have been solved if they had just talked.\"—swakshak\"Atonement made me so angry because everyone would’ve been FINE if everyone had LISTENED TO EACH OTHER and goddamn Briony had just talked to Cecilia. I love the movie but I genuinely have never been so annoyed with a character before.\"—jessier4ba32cffe\"Henry mails Indiana the grail diary because he's in danger. Maybe a wee note attached perhaps? Didn't have to be long...just some kind of heads up.\"—summersarahjames\"If Steve had just opened his mouth and said 'guys there’s five other winter soldiers in Siberia, come with us we’ll show you; we could’ve avoided:1. Making Wanda and Vision fight each other.2. Rhodey getting shot. 3. Literally the whole fight between Steve and Tony. 4. Like, literally all of it. The Avengers and co could show up in Siberia, take out Zemo as a team, and then hold Tony back from trying to kill Bucky. Boom! Done! Movie solved! No conflict, we good!\"—emilyadder\"The movie is not good, but this point is particularly terrible. When Jacob mentions a funeral on the phone, Edward assumes that Bella's dead, hangs up and flies to Italy to commit suicide. That doesn't make sense at all. Why couldn't Edward just ask a few questions (what happened? who's dead?) before hanging up?\"—silencesilence\"When Harry asks where Sirius is, Kreacher lies. But if Harry had contacted Sirius more directly, and didn't trust someone who hated him, Sirius, and the Order of the Phoenix, Harry wouldn't have fought in the Ministry and Sirius wouldn't have died. The fact that Harry hadn't confirmed with Sirius directly, even when he was suspicious, is one of the ultimate communication fails. It also leads to the death of my favourite character and makes me want to punch Harry.\"—incwadi21\"In the second one, if her dad just said 'hey I’m really a frog, and now the fairy godmother is blackmailing me' it would have saved them all from being manipulated and almost killed. Although it did result in a great musical number.\"– Janice Olivieri via Facebook\"I love Penelope, but it would have been so simple for her to just be like, 'hey, man, I'm gonna come out now and, just so we're on the same page, I've got a pig nose.' It would have given James McAvoy's character a chance to ready himself to see her. AND WHILE WE'RE ON IT, he could have easily said 'I can't marry you because you said you'd kill yourself if the curse isn't broken and I don't think I can break it.' Save her from a little heartbreak and all that.\"– Melissa Dawn Autry via Facebook\"Doc could literally have just told Marty about the crash and his son without travelling to the future. The whole movie didn't need to happen.\"– limegirl99\"Enough said.\"– KierinSkaiGreat!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}