{"id": "Here’s 20 Awful Food Combinations People Really Love For Some Strange Reason", "paragraph": "\n          \n          \"My coworker scrapes the yolk out of a hard-boiled egg and fills it with peanut butter.\"\n        \"I swallow baked beans and peas whole without chewing them because I don’t like the feeling of them mushed up in my mouth.\" —lydiam16\"My coworker scrapes the yolk out of hard-boiled eggs and fills it with peanut butter.\" —Ania Oplocka\"I don't like biting crunchy foods so I break it into small pieces before I begin eating. If I eat a bag of chips I'll smash the bag before even opening it just to make sure I can grab one small piece at a time. Who wants to sit around holding half a chip until they're ready for another bite? Not me, suckers.\" —Jaci Jarman, Facebook\"I eat lemons straight on the daily, pulp and all.\" —alyssajstoneman\"I bite the tops of pickles off and stick the end of a fork in them to scrape out everything inside, then I eat the empty husk.\" —leahjtate288\"I dip PB&J sandwiches in chicken noodle soup. I thought it was like grilled cheese and tomato soup. I didn't know it was weird until I got to college, but it's my go-to meal when I'm sick.\" —Daphne Strasert, Facebook\"I love eating frozen hash browns straight out of the freezer! You need to gnaw on it like a dog haha.\" —brackengypsy\"I eat peanut butter and mashed potato sandwiches. I put PB on both pieces of bread and slather piping hot spuds in between. The PB gets all melty and gooey. I crave it constantly, but I only indulge in it about once a month.\" —phor89\"Sweet bologna with peanut butter spread on it and rolled up. IT'S SO GOOD! Literally my favorite snack.\" —rjmiller1201\"I can’t eat a pizza normally. I rarely eat it in general because I’m not a big fan, but when I do I separate the cheese and toppings from the base and sauce. I’ll eat the cheese and toppings like one meal with a knife and fork and then do the same thing with the pizza dough.\" —ashleyc4163c8ffd\"Rice and bananas are one of my favorite combinations.\" —miss_sarah_mamo\"Chocolate cake and sour pickles and mustard sandwiches are one of my grandma's bizarre faves. She also puts vinegar on everything. Like whole bottles of it, it’s really something.\" —suew4108ac29d\"When I eat Goldfish or Cheez-Its, I put the cracker on one side of my mouth and split it in half with my molars. Then I chew each half separately.\" —ashleyy4803984d2\"I put frozen green beans or corn in my PB&J sandwiches. I started as a kid and 24 years later, I somehow never stopped.\" —kelseyc4eb358e10\"I love mac 'n' cheese mixed with applesauce.\" —nicurn\"I put yellow mustard along with the butter and syrup on my pancakes. My grandmother and I both do this.\" —jeller4314\"I like to drink milk with pizza rolls and boneless spare ribs. They're the only two foods I MUST drink milk with.\" —justinea4f6d1b8aa\"French toast and melted cheddar cheese (sharp is best) with salsa on top.\" —m400d5d770\"Whenever I eat a burger I like to look for which bite would be the best. If there is bacon and cheese hanging out of the side, I bite there rather than just a plain ol’ bun. I just want the first bite to be memorable!\" —beverlyanneh\"I always save the best bite for last. if I get to a good spot I’ll eat around it and come back to it at the end. I always want to end the meal on a high note!\" —jasonfunderberkerThese submissions have been edited for clarity.BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}