{"id": "Even If You Buy Everything On This List, You Still Won't Spend More Than $50", "paragraph": "\n          \n          Shopping spree? Shopping spree.\n        \n        We hope you love the products we recommend! Just so you know, BuzzFeed may collect a share of sales or other compensation from the links on this page. Oh, and FYI — prices are accurate and items in stock as of time of publication.\n    Please do not get mad at me! OK, thank you.Get it from Amazon for $1.05.It has a pencil and liquid, so you can have the best of both worlds.Promising review: \"Better than any other name brand eyeliner I have ever tried. It's so crisp and clean — my wings always come out perfect when I used this. They last a good amount of time as well. I still have my very first order since September [review written in January 2017] and I recently purchased another one for a friend of mine.\" —Melanie Get it from Amazon for $1.46.Get it from Amazon for $0.23 +$3.56 shipping (available in nine styles).Get it from Amazon for $2.45.Each pad has 30 sheets.Get it from JpKrHk on Etsy for $1.49 +$3.80 shipping (available in four styles).Get it from Amazon for $2.19 (available in two colors).Get it from Amazon for $1.61 +1.99 shipping (also available in 20 styles).Get it from Amazon for $0.28 +$1.80 shipping.Get a set of four from Amazon for $0.88 +1.99 shipping (also available in six other shapes).Get it from Amazon for $3.58.Get it from Amazon for $2.15 +$0.50 shipping.Get them from SimpleNGreat on Etsy for $5 +$3.50 shipping (available in fishhooks or studs, and two finishes).Get it from Amazon for $0.79.Get it from Amazon for $2.79.Get six sheets from Amazon for $0.93 +1.09 shipping (also available in three other styles).Get it from PandaPenShop on Etsy for $1.63 (available in three colors).Get 20 napkins from Forever 21 for $1.52 (free shipping on orders over $50).Promising review: \"I actually use these. I bought them as a filler item (needed less than a dollar more for free shipping) but they're an item that I have found myself actually being fond of. It's a lot easier than dealing with traditional floss and just as effective.\" —RogueGet it from Amazon for $2.63.Get it from Amazon for $2.59 +$4.99 shipping (also available in five other colors).Get them from Forever 21 for $1.52 (free shipping on orders over $50).Get them from Amazon for $3.33.Get a pack of four from PearlAndViolet on Etsy for $1.60 +$1 shipping.Get a pack of 15 from Amazon for $3.99.Get it from JoyfulCraftShop on Etsy for $2.45 +3.75 shipping.Get it from Amazon for $0.79 +$2.39 shipping.Reviews have been edited for length and/or clarity.20 Gifts Under $10 That Are Actually Pretty Impressive24 Of The Best Sex Toys Under $3026 Things Under $10 That'll Make You Want To Take A Selfie29 Cheap Things That'll Make You Look Fancier Than You Really AreGreat!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      Great!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}