{"id": "No Goop, Jade Vaginal Eggs Are Probably Not A \"Strictly-Guarded Secret\" From Ancient China", "paragraph": "\n          \n          This represents another blow to Goop's most controversial product.\n        A new study has found no evidence for claims made by Goop that its controversial jade vaginal egg is an ancient Chinese tradition used by queens and concubines.Last month Gwyneth Paltrow's lifestyle retail brand Goop was forced to pay $US145,000 in civil penalties for making \"unsubstantiated\" marketing claims about its jade vaginal eggs, which were being sold for $US66 each.Goop stated on its website that the Jade Egg was used \"by women to increase sexual energy and pleasure\".The jade egg was criticised by gynaecologists as it could potentially harbour dangerous bacteria in the vaginal canal due to the porous nature of the stone.Dr Jennifer Gunter, a San Francisco-based gynaecologist and vocal critic of Goop's claims, blogged that the egg (much like anything else inserted into the vagina) could cause microabrasions in the vaginal wall, potentially increasing the risk of Toxic Shock Syndrome (TSS).Now Gunter has investigated the non-medicinal claim – that the jade vaginal egg is an object used traditionally by ancient Chinese royalty – made in a blog post by actress Shiva Rose on Goop's site.Rose wrote in the article (now removed from Goop's website) that the eggs are a \"strictly-guarded secret of Chinese royalty\" used by Chinese queens to strengthen pelvic floor muscles and sexually please emperors.Gunter told BuzzFeed News that as she read more about the claims of the jade egg, the \"advertising felt more like Western exoticism of concubines\" and she doubted that they were actually an ancient tradition.Gunter and her co-author, archaeologist Dr Sarah Parcak, searched the online databases of four major Chinese art and archaeology collections in the United States, viewing more than 5,000 jade objects.They didn't find a single jade vaginal egg.\"We did find a jade egg, but it was Fabergé and so not for the vagina,\" said Gunter.\"What's more, there was no mention of jade eggs in the supporting literature or the Taoist texts. If jade eggs are not in large collections and not in supporting texts, how could they be known to an actress in Hollywood?\"So, did the researchers find anything close to the jade egg?Gunter says that they found a butt plug \"used to keep chi in after death – so our search terms were valid.\"The legal investigation into Goop was launched last year after a consumer watchdog alerted a task force of Californian prosecutors to over 50 alleged spurious health claims being made by the company for a range of products on its website.Goop asserted that the jade egg (designed to be inserted and held in the vagina for extensive periods of time) could \"balance hormones, regulate menstrual cycles, prevent uterine prolapse, and increase bladder control\".The settlement with Santa Clara County's District Attorney prohibited Goop from making any claims about the efficacy or effects of their products without \"competent and reliable scientific evidence\".Despite deleting the copy detailing its benefits and offering refunds to customers who had already purchased the egg, it is still for sale on the retailer's website.Last week the Good Thinking Society, a British charity that promotes scientific skepticism, also reported Goop to the UK National Trading Standards and Advertising Standards Authority with allegations that the company is violating over 113 advertising laws.Goop did not respond to a request for comment from BuzzFeed NewsGreat!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}