{"id": "19 Tiny Houses For Sale That You Could Move Into RIGHT NOW", "paragraph": "\n          \n          Some tiny home real estate appreciation.\n        Features: Sleeps a total of 4 people (2 downstairs, 2 in the loft), glass front door, a silver roof, and it's TRA Green certified.Size: 26 feet long x 8.5 feet wideStarts at: $62,950 (more info)Features: Panoramic windows, LED lighting, french doors, maple cabinets, and a stairway between the top and bottom floors.Size: 30 feet long, 388 square feetStarts at: $69,800 (more info)Features: Reclaimed wood ceilings, hardwood oak floors, a stainless steel sink, and a brass portal window. There are also solar-power and rain-water systems that come pre-installed.Size: 340 square feetStarts at: $65,000 (more info)Features: Pine siding, bamboo flooring, stainless steel sinks, and a roof designed to catch rainwater that can hook up easily to a filtration system.Size: 24 feet long x 10 feet wideStarts at: $25,000 (more info)Features: A craftsman-style front door, butcher-block kitchen countertops, a built-in Smart TV, a cedar deck, and a large sleeping loft big enough to fit a king-sized mattress.Size: 28' long x 8.5' wideStarts at: $75,000 (more info)Features: An upstairs loft bedroom, cathedral-style ceiling, operable windows, and a full-sized shower.Size: 18 feet long x 7.5 feet wideStarts at: $79,884 (more info)Features: Sleeps a total of 4 people (2 downstairs and 2 in the lofts), features cedar wood, and is TRA Green certified. Size: 26 feet longStarts at: $80,696 (more info)Features: An LG refridgerator, IKEA cabinetry, a projection screen TV, and 220 square feet total.Size: 24 feet long x 8.5 feet wideStarts at: $74,900 (more info)Features: A hand-crafted heavy-duty home with 450 watts of solar panels, an AWB awning, and a composting toilet.Size: 15 feet long x 7 feet wideStarts at: $30,000 (more info)Features: A curved roof, casement and awning windows, a new refrigerator and an LP gas stove.Size: 33 feet long x 8.5 feet wideStarts at: $82,500 (more info)Features: Beveled cedar siding, stainless steel sink, 10-foot-high ceilings, and open-out french doors. Size: 26 feet longStarts at: $68,100 (more info)Features: Skylights, double-paned insulated windows, wood burning stove, a composting toilet, french doors and off-grid capabilities.Size: 20 feet x 8.5 feetStarts at: $50,000 (more info)Features: If you like geodesic domes and building your own house, do I have the tiny home for you! This home arrives in 21 pieces and takes up to six weeks to assemble.Size: 430 square feet (medium dome model)Starts at: $15,347 (more info)Features: Stainless steel appliances, a metal roof, hardwood floors, and is energy efficient.Size: 396 square feetStarts at: $48,000 (more info)Features: A waterless composting toilet, shiplap interior, cedar exterior siding and a micro vanity to help keep things cute.Size: 28 feet long x 8.5 feet wideStarts at: $69,000 (more info)Features: A stone hearth with gas fireplace, is wood-lined, and even has a small library. However, this tiny house is stationary and can be found in Nashville, Tennessee.Size: 24 feet long x 16 feet wideStarts at: $75,000 (more info)Features: A sliding glass patio front door, ceiling fan, electric water heater, composting toilet, and an Energy Star refrigerator.Size: 17 feet wide x 6 feet longStarts at: $59,884 (more info)Features: A large outdoor porch, sliding barn doors, solar panels, and is located in Quemando, New Mexico.Size: 24 feet wide x 16 feet longStarts at: $69,900 (more info)Features: This tiny house is created specifically for people with mobility issues and is one of the few universally accessible tiny homes. 125 square feet of living space and an ADA bathroom. It can also attach to a home as an addition.Size: 26 feet long x 8'6\" wideStarts at: $60,000 (more info)BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}