{"id": "\n          11 Genius Cheatsheets That'll Make Any Twenty-Something's Life Much Easier\n        Latest from As/Is", "paragraph": "\n          \n          From beauty to decor to travel, we've got everything covered!\n        \"If you're trying out tester foundation shades at a beauty counter, apply the shade to your neck instead of your arm for the most accurate match.\"—Augusta FallettaCheck out 21 Hair And Makeup Hacks Every Woman Should Know for more.\"Stick your brushes in a straw canister if you like to keep them covered, but visible.\"—Emily ShwakeCheck out 25 Beauty Product Organizing Tips That'll Make You Say \"Why Haven't I Tried That?!\" for more.\"Add privacy to any window while still letting the light come through using cornstarch and water pasted over lace or plain white paper. It's easy to remove, too — just use hot water.\"—Natalie BrownCheck out 18 Quick Home Hacks That'll Make You Say \"Why Didn't I Know About These Sooner?\" for more.\"Gild your Malm dresser with gold contact paper. Hang a Mosslanda picture ledge if you don't have room for a nightstand. Gather your excessive nail polish collection with Bekväm spice racks.\"—Emily ShwakeCheck out 42 Borderline Genius Ikea Upgrades That Only Look Expensive for more.\"Use a leaning ladder as a chic replacement for The Chair — you know, the one that's always buried in clothes that aren't laundry-fresh or laundry-ready.\"—Tom VellnerCheck out 18 Genius Bedroom Organization Hacks for more.Check out 19 Useful Things That Will Actually Organize Your Desk for more.\"Pack all your vitamins into a small bottle instead of bringing multiple bulky containers.\"—Farrah PennCheck out 19 Instagram Travel Hacks That Are Borderline Genius for more.\"Cooking with wine might sound intimidating and fancy, but you can totally handle it. Just be sure not to cook with anything you wouldn't drink (looking at you, Franzia). And since you're already pouring it in the pot, you might as well pour yourself a glass, amiright?\"—Lauren PaulCheck out 23 Ingredients You Should Always Have In Your Kitchen for more.\"For people living by themselves, the problem with cooking at home is having to eat the same thing over and over again. One way around this is to be conscious about prepping the same ingredient in several different ways. For carrots, you could dice half of them for a stir-fry and shred the remaining for a salad. For chicken, you can shred half in a slow cooker and roast the remaining to use with grains.\"—Jesse SzewczykCheck out 12 Little Things You Can Do To Make Cooking At Home Easier for more.\"Blend your smoothie directly in your mason jar by screwing the blade piece onto the jar.\"—Emily Shwake and Isabel CastilloCheck out Genius Mason Jar Upgrades That You Should Be Using In Your Kitchen for more.\"When you want that perfect slice for Insta or your blog, chill your buttercream cake in the freezer for a few minutes before slicing it with a sharp knife,\" noted baker and Coco Cake Land author Lyndsay Sung.Check out Here's How To Make Your Cakes Look (And Taste) More Professional for more.Great!\n        \n          As/Is will be hitting your inbox soon!\n        \n      Great!\n        \n          As/Is will be hitting your inbox soon!\n        \n      "}