{"id": "7 Things Everyone Who Takes Melatonin Should Know", "paragraph": "\n          \n          The correct dose of melatonin is three times less than what most people are taking.\n        This week at Goodful, we're talking sleep — why it matters, how to get more, and ways to make it better. You can find more Slumber Party posts here.When produced in the brain, melatonin works to regulate our circadian rhythm, which controls the body's sleep-wake cycle. Basically, it's released at night when the sun goes down to let your body know that it's time for bed. When taken as a supplement (in tablet, gummy, or liquid form), it essentially does the same thing — sends a message to your brain that it's time for sleep. But there's a lot of other things people should know about melatonin. So, we spoke to Dr. Charles Czeisler, chief of the Division of Sleep and Circadian Disorders at Brigham and Women’s Hospital, to find out more about the sleep supplement people are seriously obsessed with.As melatonin is sold as a dietary supplement in the US, it isn't regulated by the FDA like most medications and prescriptions are. According to Czeisler, this means that you can't always trust what the labels on these supplements tell you. In fact, a 2017 study from the American Academy of Sleep Medicine found that the actual melatonin content of many supplements sold in drugstores widely differed from what was shown on the label. In more than 70% of the supplements tested, the melatonin content didn't fall within a 10% margin of what was listed on the label, and some products even differed by up to 465%.Consumer Reports recommends buying melatonin products with the \"USP verified\" mark, which means they've been vetted by the United States Pharmacopeia. Czeisler also suggests opting for products that don't mix other supplements (like valerian root or magnesium, for example) with melatonin, as it's hard to be sure of the effect these combinations may have on your body and on each other.In drugstores, melatonin is usually sold in 1mg, 3mg, 5mg, or 10mg doses. A Massachusetts Institute of Technology study also found that higher doses of melatonin were actually less effective at treating insomnia, and left some subjects with a hangover-like feeling the following day.Blue light, which is emitted by screens and bright lightbulbs, suppresses natural melatonin production, tricking the body into thinking the sun is still up. \"We are exposed to so much artificial light between dusk and when we go to bed,\" says Czeisler. \"This exposure to light has pushed a lot of us four time zones westward in terms of our circadian rhythms. So, it might be dark and time for bed, but your brain has no idea and isn't releasing melatonin. A lot of people think they have insomnia, but they've actually just inadvertently shifted their circadian rhythms later, and are therefore unable to sleep.\"Not only do bright lights and screens block your natural melatonin production, they can also neutralize the effect of supplements. If you want the supplement to help you get to sleep, you need to work with it and switch off any harsh lights and put down your phone.The only purpose of melatonin is to regulate your sleep-wake cycle. So, while it technically can make you feel sleepy, it's not because the melatonin itself is putting you to sleep like a sleeping tablet or other sleep aid. \"If you take melatonin when you’re already naturally releasing melatonin — so, during the night when you haven't been exposed to a lot of artificial light — it has no effect at all,\" says Czeisler.Research has found that melatonin is actually very effective at preventing jet lag and aiding the body to adjust to a different time zone by resetting the body's circadian rhythm.According to John Hopkins Medicine, this is the best time to take melatonin. Your natural melatonin levels rise naturally around two hours before your normal bedtime when they're not suppressed by blue light, or confused by a different time zone, so it makes sense that this is the perfect time to give your brain the hormone boost.By the way, if you've been having trouble sleeping and it's not going away, it's definitely worth checking with your doctor. Many things can cause insomnia, from stress to certain disorders, and your doctor will best be able to help you figure out what's going on so you can get the sleep you need. In the meantime, you can always read more about insomnia here.BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}