{"id": "Why We Should All Take More Pictures Of Our Ugly Food", "paragraph": "\n        Natalya Lobanova / BuzzFeed\n      \nThere are two types of people: people who post their food on Instagram and people who hate them. I fall into the former. Years ago, I jokingly posted an unflattering, unfiltered picture of my jacket potato with chilli and cheese on top to “break up all the pretty food on your timeline”, but since then the meals worthy of recognition on my profile haven’t often been the ones that made me go back for more, but the ones with a garnish that made me go “ooooh!” before picking it off. We post photos of burgers as tall as our heads, or of acai bowls that somehow encompass every colour of the rainbow, but the one thing that nobody posts a photo of is their “ugly” food. In fact, someone calling your Instagram picture of a meal ugly is a comment embarrassing enough to make you want to delete your account.But when I think of good food, I don’t always think of jewel-red tandoori chicken — it’s also brown daal and beige aloo paratha. Korean food isn’t just an inviting, colourful bowl of bibimbap; it’s also a bright orange, slightly misshapen kimchi pancake. The food we share online is often less about what we like and more about what we want people to think we like: the flattering idea that you’re someone who goes to food pop-ups to have a taco/burger/hot dog hybrid, or who arranges their fruit into a geometric pattern and wakes up at 6am to have a smoothie and do yoga. But if food is a way of telling people about our lives, so much of the best-tasting stuff is getting cut out of the picture.We all filter things; I conveniently crop out the burnt-on pasta sauce stains on my cooker when posting a photo of my bakes, and pictures I take inside of restaurants are often only ever of that one floral wall they specifically put there for people to take pictures of. You can be self-conscious about sharing your cooking in case it looks bad even though it tastes great, or about posting a picture of the dinner you had a restaurant if there aren’t enough vibrant colours in it and the lighting is a bit poor. In fact, in the UK, a third of fruit and veg is apparently deemed too ugly to sell. But we’re mammals, and food, even the prettiest food, is fuel, so an apple with shiny peel will lodge between your teeth just like a duller one.“But nobody wants to see my crappy food!” If it tasted great, why not share it? Sure, a watery omelette with floating, pale mushrooms might not be something you’d want to post, but a cheesy bolognese bake? A huge pot of really good chilli? I’m probably not the only person to have photographed some fancy brunch that had fake flowers on it, only to pick around the food and then just order a cake instead. When I make my favourite gingerbread cake, I don’t pour over the toffee icing until after I’ve taken some photos, just because I worry the icing makes it look “sloppy.”When you’re sharing the food that makes up your life online, it’s worth remembering that the breadcrumb-topped mac and cheese you make at home and the completely beige chow mein you eat in front of the TV when you go to your friend’s house are also part of the picture. Don’t feel embarrassed that the banana bread you baked doesn’t seem to have a “good” angle if it was so nice you went back for seconds, or if the camera doesn’t make your biryani look as good as it tasted. We might not ever want to show the “ugly” side of our lives on social media, but ugly food is what you eat at home after a crap day, or what you have when catching up with a friend, or what you order at a restaurant you like that hasn’t cottoned on to the “feature wall” thing yet. Things don’t have to look good to taste good, and what tastes better than the food you really, truly want?Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}