{"id": "17 Netflix Shows Not In The English Language That Are Worth Your Time", "paragraph": "\n          \n          From Elite to Suburra, this is the time to get into dramas. Just turn off the dubbing and put down your phone, okay?\n        Country: SpainWhat is it about? There's a real buzz about this show. Set at an elite school in Spain (hence the title), this teen drama follows three working-class students who enrol and then are immediately cast as outsiders. With a flash-forward/flashback form of storytelling, you try to piece together which student at the school was behind a brutal murder.Review: \"It's everything Riverdale wishes to be!\" —chortlingchodeCountry: DenmarkWhat is it about? A post-apocalyptic drama based on rain(!), a premise that results in two of the main characters being forced to stay in a bunker for six years. Trust me, the drama is much more interesting than that previous sentence.Review: \"It's got action, drama, romance, and suspense — the perfect recipe for a great TV show. And the Danish language is beautiful to listen to.\" —Maria, FacebookCountry: South KoreaWhat is it about? There is so much hype about this one. It's the classic story of someone who develops superhero powers (the main character has super strength, as you can tell from the image above), but the way it is shot and written is so much more fun than a lot of others in the same genre. It just doesn't take itself too seriously. Five minutes in, you're hooked.Review: \"I love this show!! It's so much fun, and the entire cast is adorable and hilarious.\" —Rafael, FacebookCountry: SpainWhat is it about? Set in 1920s Madrid, it follows a group of young women who start working at a telecommunications company at a time when women usually were made to stay at home or only follow their husband's wishes. It's an empowering show that provides social commentary on an era you might not know much about.Review: \"It's feminist and empowering with the best cast and such interesting storylines. This show even makes tropes like love triangles interesting. Worth a watch.\" —nitip2Country: GermanyWhat is it about? The small town of Winden is constantly plagued by people who go missing. A cave could have something to do with it. Many people have compared it to Stranger Things, but to be honest this show makes Stranger Things look like Sesame Street.Reviews: \"Terrific twists and turns, and a captivating cast of characters.\" —vickitessla\"My German 101 professor recommended the show and I fell in love.\" —briisummersCountry: South KoreaWhat is it about? At a first glance this drama about five people with very different personalities living together under one roof might come across as being lighthearted and twee, but it's actually surprisingly deep. You follow their relationships and the expectation vs reality that comes consistently in your twenties. It's a great take on the human condition.Reviews: \"I cried many times during that show and learned a lot of things about myself as well I always recommend it to people.\" —milkteapapi \"It's great because as you grow up you begin to understand just how random and interconnected life is.\" —crystaly44254cacaCountry: NorwayWhat is it about? Centred around a Russian occupation of Norway following a gas and oil shortage, this high-stakes political thriller set in the near future feels ever so fresh and relevant.Review: \"Norway pioneers a new energy source that would rapidly revolutionize energy production but disrupt the old-guard energy producers. This leads to ‘strange bedfellows’ alliances, no-mercy cutthroat political retaliation, and the most thinly veiled iron fist in a velvet glove being brought into play.\" —partotCountry: JapanWhat is it about? This is quite honestly the polar opposite of how most housemate reality shows are done. The housemates can come and go as they please, while crushes and romances bubble away gently. The cameras also go to a room where a bunch of comedians and experts analyse what is going on with each character between the scenes, an approach other shows need to adopt. There's many series of this show. Any can do.Review: \"All the people in the house come in with some goal they want to achieve and it definitely makes you want to get up and do something you’ve wanted to do but have put off. It’s different from US reality shows where it’s all about drama and everyone hating each other. I mean, the worst argument had to do with meat.\" —blahblah101Country: Spain.What is it about? OK, the concept might sound ridiculous — a secret department of the Spanish government where staff go back in time to fix errors that other time travellers have made — but it's addictive and it also helps you learn a hell of a lot of history you weren't taught in school.Review: \"It's cool to learn about Spain's history and the drama that unfolds is great too!\" —taraogoartCountry: IndiaWhat is it about? A cat-and-mouse thriller, this Netflix adaptation of a book by Vikram Chandra follows a police officer who receives a tip-off that something absolutely goddamn terrible is going to happen to the city of Mumbai. Multiple narratives, stunning cinematography, multiple languages — and it's pretty explicit.Review: \"Hands-down one of the best series ever made. With some brilliant writing, performances, storylines, and dialogues, SG is the best thing to happen to Indian TV!\" —meghanakiran\"A great thriller based in India that keeps you on the edge of your seat.\" —debs42c4ee0d5Country: MexicoWhat is it about? A dark comedy, this series follows a family-run floristry business that at first glance looks absolutely perfect. However, after the death of the husband's mistress in the shop itself, it turns out that actually the opposite is true. A soapy yet satisfying dysfunctional family drama.Review: \"It currently fills both a Desperate Housewives- and Pushing Daisies-shaped hole in my heart.\" —@FelixGieseckeCountry: ItalyWhat is it about? All inspired by true events, this drama follows the relationship between corrupt politicians, the Mafia, and a family in a seaside town. You might have heard about a film with the same name. This is the prequel. After a three-year gap, a second season was released earlier this year.Review:: \"Besides political corruption, it also focuses on daily life struggles: romantic relationships, family drama, racism, and homosexuality.\" —vittoriab2Country: IndiaWhat is it about? A deeply relatable drama with surprisingly little plot, it follows a couple who deal with the small things they encounter throughout their relationship: from FOMO and social media obsession, to having relatives over, to dealing with disappointments. It has a knack of making you think about your own life as you think about theirs.Review: \"It's about the small things that all couples go through... I highly recommend watching it. I just started it the other day and I’m obsessed.\" —graceh4c405c842Country: JapanWhat is it about? Based on a manga comic, it focuses on a chef as he cooks in his izakaya restaurant, which is only open from midnight to 7am each night. Customers come and go, each one expressing a problem and encountering a solution within the restaurant. The setting is cozy, the food exquisite, and the storylines comforting.Review: \"Perfect for foodies and drama fans... An assorted cast of regulars and guest stars make this very bingeable!\" —Brianne, FacebookCountry: SpainWhat is it about? A high-stakes bank heist drama, where eight people who all have unique talents try to break into the Royal Mint of Spain and partake in the biggest robbery in history: printing out more than €2 billion worth of notes. You end up spending half your time working out whose side you are on, the robbers or the police.Review: \"I've watched it twice within a month and a half because it's just so brilliantly made. The relationships between the characters are also a really important piece of the show which I didn't expect when I started watching, but I fell in love with it so quickly.\" —Davina, Facebook\"It had me on the edge of my seat the entire time and I couldn’t help but binge the entire show in a matter of days!\" —kyral49a4d71e6Country: BrazilWhat is it about? A dystopian drama, set in the future, where 3% of the population are able to live in prosperity whilst the other 97% are made to live in poverty. To get between the two, you need to compete in a series of tests called \"The Process.\" Yep, it sounds familiar, but it deserves to be celebrated in its own right.Review: \"It has a distinct Hunger Games feel to it, with the clinical testing environment of the first season also bringing some Divergent-meets-Saw vibes into the mix.\" —katierjeanesCountry: JapanWhat is it about? A classic opposites-attract romantic comedy, Good Morning Call is based on a well-known manga series and it's an easily bingeable two-season show.Review: \"My friend and I started to watch it as a joke because we thought it would be dumb but instead we became so invested. —c4a68e1c4dI don't know about you, but I much prefer it without the dubbing. Sometimes it can be more valuable if you turn on the original language, and put your phone down while you are watching.Skam — a teenage drama following the daily ins and outs of student life at a Norwegian high school — was a sensation, especially online. Not only did it deal with issues of body image, feminism, first love, peer pressure, coming out, and sexual assault in a mature and accurate way, scenes were dropped on the internet at the exact time they were set, rather than held back until the episode aired on television. With the characters all having Instagram and social media accounts too, you developed a constant real-time anxiety in regards to what was going on with their lives.With it set in Norway, you learned a lot about that Nordic culture (big shout out to the \"kosegruppa\" fans reading this). And what is interesting is that now that the original series has ended, different countries are adapting it for their own channels. And each countries' culture is seeping through. There's Skam Austin (on Facebook Watch) and Skam France, among others. My personal favourite is Skam Italia, which is on now, and follows Martino (Federico Cesari) as he falls in love with student Niccolò Fares (Rocco Fasano). The acting in it is sublime, its realism is unlike anything else, and I want to move to Italy immediately.Where you can watch it: On the Skam Italia websiteGreat!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}