{"id": "I Laughed At These 23 Halloween Tweets And Hopefully You Will Too", "paragraph": "\n          \n          \"Some lady dressed as Catwoman is walking around our Halloween party just knocking drinks off tables.\"\n        Me: *destroys spider web\n\nSpider: wow\n\nMe: *puts up fake spider web\n\nSpider: WOWMy favorite Horror movie is the one where the Target cashier wants to talk to me about my grocery choices.Halloween is my favorite holiday to toilet paper the neighbor’s house and blame trick or treaters.some lady dressed as catwoman is walking around our halloween party just knocking drinks off tablesHalloween is canceledI think I'll complete my cat lady transformation by giving out cough drops on Halloween.Can’t believe it’s 2018 and venturing into a forbidden library still causes an unknown force to extinguish your candelabraMe, sober: \"Yeah, I'm not all that excited for #Halloween.\"\n\nMe, drunk:there’s a spider on my wall, but fuck it, i’m not gettin up.\n\nfree halloween decoration.My favorite Halloween movie is the first 3/4 of The Craft when they’re all still BFFs &amp; one of them kills the guy who attacked her friendif a ghost wore pants would he wear them \nlike this or like this\n\n­ghost: boo-\n\nme: is that supposed to scare me?\n\nghost: -mers are writing laws that ensure they'll protect their wealth until they die but at the cost of completely fucking over the next generations\n\nMe: 😮POLTERGEIST: gettttttt... outtttt...\nMY MOM &amp; DAD: gettttttt... outttt...Guide to Halloween Acronyms\n\nLOL = Licking On Lollipops\nBRB = Big Rich Butterfingers\nOMG = One More Goober\nIDK = I Destroy KitKats\nSMH = So Much HalloweenEstablish dominance by only having Halloween candy with peanuts in it.[After spending 4 weeks making a costume for Halloween]\n\nThis is so worth it for a Snickers mini.Neighbor: Happy Halloween!\n\nMe (sitting on the porch with a bowl of Kit Kats): It’s Halloween?My toddler is going to be the Hulk for Halloween and I'm really proud of him for finally realizing he has anger issues.Ruined my day by realizing that the song Monster Mash is about a song called the Monster Mash and we’ve never actually heard that song.Just gave my next door neighbor a giant bag of candy to dump in my sons trick or treat bucket on Halloween so I can go home after one house.BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}