{"id": "People Are Freaking Out After A \"Bachelorette\" Contestant Literally Put Two Avocados In A Blender", "paragraph": "\n          \n          Seed and all, man.\n        I guess wild shit is kind of expected in any bizarre reality TV environment where the absurd is so regularly presented as the everyday. But that still doesn’t stop the collective masses from gasping hard and loud whenever some new single dude (or girl) says or does something crazy on national television, all while working towards their quest of earning the love of a single individual they have never met before by competing in hysterical playground challenges and passing out flowers.Ivan was working in the kitchen attempting to follow a recipe for avocado mousse. It called for two avocados, so he simply flung them into a blender whole-hog and tried his best to shred them into oblivion.Ivan told TV Week the mistake came because he had “never physically cut one up” himself. “I’ve seen it on my toast and, you know, in a breakfast meal,” he said.Ivan blending two whole avocados has shaken me to my core #BacheloretteAUEvery man I have ever loved would testify in a court of law that I am a terrible cook but even I know you don't blend the avocado pip #TheBacheloretteAUBlending a whole avocado is bad but when I was 17 I watched a friend make spaghetti by pouring the boiling water and cooked pasta into a plugged sink and then he picked up the floating spag with tongs. Didn’t know about colandersFuckin hell he just put a whole avocado in a blender, skin on.Imagine the producer standing by watching Ivan trying to BLEND TWO WHOLE FUCKING AVOCADOS! #BacheloretteAUyou fed her avocado skin and seed, ivan \n\nyou've given her enough #BacheloretteAUHOW IS IT POSSIBLE IVAN HAS NEVER SEEN AN AVOCADO BEFORE??!! #BacheloretteAUGreat!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      Great!\n        \n          You're almost there! Check your inbox and confirm your subscription now!\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}