{"id": "This Artist Reimagined Animals As Iconic People In History And They're Incredible", "paragraph": "\n          \n          I know you've always wanted to see what Joan of Bark would look like.\n        Known for hits such as \"Ziggy Pawdust\" and \"Little China Pup.\"He survived centuries locked in a tomb with pesky mice he could not eat.She brought new meaning to the term \"cat and mouse.\"Best known for her gothic novel Skunkenstein, a tale of roadkill reanimation.\"Not only are bananas fun to eat, they're fun to wear.\"Many thought she was weird when she howled at the moon, but it wasn't all in her head. She was thanking the voices for telling her where she buried her bones.\"Let them eat NIP!\"\"Who says you can't fly without wings?!\"When the howl of \"Freedom!\" echoes over the loch, one will quickly find a discarded kilt among the thistles.Japanese samurai of the Shinsegumi, Yamanami was wise beyond his years.A legendary couple from the roaring '20s, one of whom wrote famous tales such as Tender is Her Bite and The Great Catsby.\"Some say creatives are a different breed. They got that right!\"Known for his squat stature and explosive bellow, his soft side belonged to Josephine, his beloved squeaky toy.As the rain falls down, Jizo kneads the warm soft earth, The sun shines, he pees.Her strong and tender nature saved many, including a wolf named John Smith.\"Cookies are a girl's best friend.\"Creator of the masterpieces \"Eating of the Shrew,\" \"Romeow and Mewliet,\" and \"MacBreath.\"\"Before you leave the burrow, look in the mirror and take at least one acorn out of your mouth.\"Mistaking windmills for giant chorizos, they attacked with great fervor — only to be disappointed in the lack of meat.Jobs was an inventor and entrepreneur who created the mouse — which drove all the cats crazy.\"My sisters and I forage for only the best tree nuts and legumes which we serve as delectable treats. We only present the best at our gatherings.\"\"My disappearance is as much of a mystery as the missing food from your plate.\"\"Never hire an excellent portrait artist. At least not when your neck is on the line.\"\"The studio execs demanded I drink blood on camera but I switched it out with ketchup and they were none the wiser.\"This singer topped the charts with \"Blue Suede Paws,\" \"Jailcage Rock,\" and \" Hunk of Burning Meat.\"\"That's Why the Poodle Is a Tramp\" and \"It Was a Very Good Rear\" were some of this guy's hits.\"When my friend Asp and I were playing hide-and-seek, it got a little out of hand.\"\"Walk softly and carry a big attitude.\"BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}