{"id": "These 26 Things Fix Breakouts And We Have The Proof", "paragraph": "\n          \n          Come for the acne solution products, stay for the amazing before-and-afters.\n        \n        We hope you love the products we recommend! Just so you know, BuzzFeed may collect a share of sales or other compensation from the links on this page. Oh, and FYI — prices are accurate and items in stock as of time of publication.\n    Check out a BuzzFeeder's deep dive for proof!Promising review: \"Absolutely amazing! They come in three different sizes, so you can conquer any zit, no matter how large or small. They are close to clear, so they blend in well with my skin. I'll put one on a painful, irritated, head-less pimple in the morning, go about my day (no one has called me out for wearing them, which means either they haven't noticed or they're afraid to say anything), and by the evening all the yuck has been sucked out onto the patch. It's disgusting, but SO COOL! When I take the patch off, it looks like the pimple was photoshopped right off my face. ZAP! Leaving the patch on all day also keeps me from picking, which prevents nasty scars and making the zit worse.\" —Lindsay & EddieGet a 24-pack from Amazon for $4.97.Plus it's gentle enough to use twice a day! It specifically works to target and control oil, and then treat blackheads and breakouts so your skin is left clear, clear, and clear.Promising review: \"I was lucky enough to have clear skin in high school so I never understood how awful acne really is. When I was about 21-22 years old, I switched to a birth control implant, and that thing wreaked havoc on my entire life. I suddenly had horrible cystic acne. Not only did it make me self conscious and uncomfortable, but it was actually so painful — laying on my pillow hurt my face! To top it all off, my skin was also dry, and irritated. I tried every skin care line on the market for about two to three years, with no, or very little, results. Finally, I found La Roche-Posays skincare products. Within four days, the inflammation decreased, the redness was fading, and my skin felt less dry. By two weeks, my skin was practically clear! I have been using this product for about four to five years now, and I haven't had a single outbreak, EXCEPT for the time I wanted to try a different product to save money. Huge mistake, one I will not make again.\" —LadyHawkeGet it from Amazon for $14.99.Who else has gone to bed with a zillion white dots on their face? Everyone? Ok, great.Promising review: \"I recently donated my hair and wanted to grow it out fast, so I decided to start taking a biotin product. Unfortunately, they did not mention anywhere that if you have acne-prone skin, it may cause a major breakout. I was left with a horrible breakout and needed something to clear it up fast. Not only does this not dry out your skin, but it helps make zits disappear fast. I saw a noticeable difference every morning when I woke up. After two weeks, my face looked back to normal with minimal scarring! I'm so grateful to have found this product.\" —JakeGet it from Amazon for $5.98.Its ingredients like glycolic, salicylic, and citric acid dramatically exfoliate your skin so you get pro-like peel results without the redness or hefty bill. Check out a BuzzFeeder's full review for why she now swears by this!Promising review: \"I never thought my skin would look as clear as it did after I took Accutane in high school, but The Ordinary products are what is keeping my skin CLEAR. I can't believe my skin is looking this nice with products that are so affordable.\" —THTFASHIONISTA_Get it from The Ordinary for $7.20.It *also* contains natural antibacterial and antimicrobial agents, aloe vera, citric acid, and grapefruit seed extract! Check out how one BuzzFeeder kissed acne goodbye with this seriously-helpful review!Promising review: \"This stuff is freaking amazing! I had a lot of redness and breakouts on my chin, as well as a few on my forehead. It truly just cleared them all up. I don't have any breakouts as of now, just my scars that I will be working on. I used this every night after cleansing my skin and it was perfection! I love this product!\" —Amazon CustomerGet it from Amazon for $9.29+ (available in five formulas).It lasts for 12 minutes at a time and even features a UV light to sterilize the steam! It also comes with a blackhead extraction kit, but (cue mom voice) be careful with them! Or watch some tutorials first.Promising review: \"This is almost a life changer. I always steam my face in the shower so I can pop my pimples (I know, it sounds so gross but seriously). However, this steamer is AMAZING. I highly recommend it if you are suffering from acne and want to give yourself your own DIY facial. Overall, fabulous purchase.\" —AnnaGet it from Amazon for $27.99+ (available in two colors).It basically comforts irritated skin so that your complexion is clearer, glowing, and moisturized.Promising review: \"Please do not discontinue this product — it SAVED my skin! I’ve never had more clear skin than I do now after using this. I’ve had hormonal breakouts for years and nothing’s ever worked as quickly and effectively as this — including dermatologist prescribed creams, serums, and pills.\" —LindaGet it from Amazon for $24.79.By the way this works best with apple cider vinegar! Want more proof? Read our full breakdown!Promising review: \"HOLY MONKEY EATING BANANAS. IT WORKS. I've only used it for two days (at night before sleep) and you can clearly see the difference! All the acnes dries up! It also makes my pores smaller. My skin feels smoother, I swear it looks like I'm wearing primer on my face. It's amazing.\" —karenGet it from Amazon for $9.30.Promising review: \"This cream is nothing short of a miracle for me. I started using Retin-A three years ago and while it was helping me with the texture of my skin it did nothing for clarity. I have worn sunscreen for many years but I still have sun damage. I started using this cream on alternate nights and then bumped it up to two times a day, and the results have been incredible. I have also slathered this cream all over my chest and arms, as well and I have had similar results there. My skin texture is amazing and the clarity is incredible. I am positive that this cream is responsible for the changes, because I don't use any other products on my arms and chest. This cream has turned back the hands of time for me.\" —KMPGet it from Amazon for $12.27.PLUS it uses jojoba beads and a fruit acid complex to gently exfoliate dead skin for clearer and smoother skin.Promising review: \"It's been about two years of loyal use of this product and I thought it deserved a positive review. At 21 years old I had the absolute worst acne. I had cystic acne to begin with and on top of that, I am on some pretty powerful mood stabilizers that just piled on the acne. I tried Proactive, oral medications, and several other acne washes, but I am allergic to pine sterols which end up in a lot of OC products. My dad, did some research for me one day when I called home crying, because my face hurt too much to even put my face on my pillow to sleep. He found a few blog post about this product helping other young adults with medication-caused acne and sent this to me overnight. I shit you not it cleared up ALL my acne, cystic included, almost completely in six weeks, and in two months my face was completely clear. I've been using this for two years now, and it has honestly saved me. My face is soft and blemish-free as a flipping Barbie doll.\" —Amazon CustomerGet it from Amazon for $6.75 .Promising review: \"The effects are amazing. I read online that tea tree oil can help treat acne so I gave it a try. Put on a small layer before you go to sleep each night and your skin will be spotless! After only three days of using it, my skin was soft and almost completely clear. I've tried almost everything else!\" —Elizabeth WilcoxGet it from Amazon for $7.99.You'll get a combo-pack for both nose strips and facial strips! Check out a BuzzFeeder's closer look to see pics for yourself!Promising review: \"I have scrubbed the center of my forehead for months but the 'field of black dots' just remained no matter what. So finally I decided to give this a try. I followed instructions exactly (removed after 10 minutes) and after I peeled it off I looked and not a dot in sight — until I looked at the strip! That looked like a forest with all those 'dots' standing up on end. Highly recommend!\" —David G.Get it from Amazon for $13.29.Promising review: \"I have super dry, sensitive skin that can flake and peel and get red and irritated when I use pretty much any face wash at all, so it’s hard to clean my face. I’ve been using this for the last couple weeks and it is really great. My skin is smooth and has no flakes or dry patches, and it actually feels clean.\" —MjolioGet it from Amazon for $3.79.It even has SPF 30 to protect your scars from deepening in the sun!Promising review: \"About a year ago, I had a cystic acne explosion — 150+ lesions appeared on my skin in a very short time frame. After months of clearing up the cystic acne, blackheads, and whiteheads, my skin was left with hyper-pigmentation marks (red, purple, brown) and an uneven texture. I have used a number of prescribed topicals, retinoids, and medical grade skin lighteners. My dermatology specialist (who has dealt with acne herself) recommended this product because it was affordable yet effective. I was highly skeptical that it would work, but wow was I wrong! It does take a few weeks to start noticing a difference. But I truly have noticed a big difference in my overall skin tone (marks are fading) and the texture is starting to even out as well.\" —Amazon CustomerGet it from Amazon for $13.Promising review: \"Wow! I am seriously amazed by how much better this works than the Mario Badescu drying lotion. I got one of the worst breakouts in my life all around my jaw line and forehead, and this stuff has been clearing it up in one application. I’m on my third day and they’re almost gone. This definitely works!\" —MimicakesGet it from Amazon for $11.99.It gets its hydrating powers from licochalcone (from licorice root) to gently moisturize, mattify, and calm redness over night.Promising review: \"I've been battling with some sort of skin irritation on my forehead for the past year. My doctor diagnosed me with a mild case of rosacea. Within 24 hours of applying this, the redness went down at least 90%. Within a few days I was all clear.\" —BuffNerdGet it from Amazon for $12.32.Promising review: \"OMG. I had a serious psoriasis outbreak and I was beside myself with pain and itching. I read that salicylic acid helps psoriasis. This cream has a nice texture and is not too greasy and does not stain. It did not burn or tingle after I applied it. Within 24 hours my psoriasis started to heal up and the itch subsided. I was shocked that all my red spots and plaques completely healed up within 48 hours. I will use this cream for for the rest of my life, I highly highly recommend trying this creme if you suffer from psoriasis. The results will astound you.\" —Kristen 32223Get it from Amazon for $15.38.Its vegan formula helps to stimulate new cell growth with a chlorella growth factor. And it's cruelty-free!Promising review: \"This stuff is a lifesaver. Recently my doctor put me on steroids to clear up my allergies. I immediately started breaking out like I was 15 again (it was one of the side effects). I didn't have a good exfoliator and this one had such good reviews that i decided to try it out. It really works! In eight days my skin was almost back to normal and it felt clean as can be! My dark acne spots were significantly lighter and all the little bumps I had were gone. Will be buying this from here on out.\" —janelleGet it from Amazon for $9.99.Promising review: \"This is an amazing product. I've been using it for three weeks and my skin has changed dramatically. My dark spots are almost gone and there are no bumps on my face. My skin feels extremely smooth. My natural skin has a glow. I order three more bottles as gifts for friends and family. Everyone loves it.\" —JasmineGet it from Amazon for $17.95.Its formula is made up of shea butter, aloe vera, and jojoba oil to both deep cleanse your pores and exfoliate away dead skin.Promising review: \"I've had bad combination skin all my life and tried dozens of products on my breakouts with limited success. I'm also allergic to basically everything, so trying something new is always an adventure. So far, this mask has worked and felt the best for me. My skin got worse before it got better, but now, after a month of biweekly use, I have no more breakouts.\" —Staff Sgt. Max FightmasterGet it from Amazon for $13.95.It's great for your body, too!Promising review: \"I like this product because it does what it says it will. After cleansing my face I administer this. I use it prior to going to bed. It nourishes my skin while I am sleeping. When I wake up my skin is absolutely gorgeous! My money was well spent.\" —P.L. CookGet it from Amazon for $8.12.Shall we unpack what's in each of them?* Aloe (to revitalize and soothe skin)* Herb (to relieve your skin from stress, and restore clearness, elasticity, and moisture)* Aqua (to improve elasticity and moisturize)* Charcoal (to destress skin and restore clear skin)* Pearl (to protect skin from environmental damage and leave it feeling smoother and softer)* Syn-Ake (to tackle fine lines)* Platinum (to wake up tired skin)* Snail (to regenerate skin cells and soothe irritated skin)* Hyaluron (to moisturize and soften dry skin)* Cucumber (to moisturize and plump)* Green Tea (to protect the skin from environmental damage)* Gold (to promote metabolism and skin cell activity)* Q10 (to fight fine lines and promote smooth skin)* Mulberry extract (to brighten skin)* Vitamin (to stabilize vitamin C and brighten skin)* Royal Jelly (to moisturize, clear, and relieve skin from stress)Promising review: \"These masks are amazing!!! Having 'ice pick' scars left over from acne, I was told that I'd have to pay for expensive laser therapy because the body can't produce enough collagen to heal deep scars. Well, after using these masks for two months I've seen SIGNIFICANT reduction in my scars. They are almost completely gone!\" —ShaunGet a 16-pack from Amazon for $10.79 (available in four combinations).Check out why a BuzzFeeder (with sensitive skin) loves these masks!ANDDDD it's great for adding a heck of a lot shine to your hair and nails! Read a BuzzFeeder's closer look for some v satisfying before-and-after photos.Promising review: \"This is LIFE-CHANGING! I'm 33 and have had dry skin my entire life. I decided to try this because the price was reasonable and the reviews were great. I was NOT disappointed. I cleaned my face the first night, applied a thick layer of rosehip oil, and went to bed. Eight hours later, I woke up to a new face. I have used this oil every night for about five weeks and it has completely changed my skin. My mom saw me one morning and remarked that my skin looked like it did when I was eight! I also love that you get a large quantity of oil for a super affordable price, and a little bit goes a long way. For the amount you get, it's SUCH a bargain.\" —TuffLuckCowgirlGet it from Amazon for $14.95.Its main ingredients (drumroll, please): rosemary flower extract (to cleanse and control oils), olive fruit oil (to prevent and reverse damage from UV rays), aloe vera juice (to help heal irritated skin), and coconut oil (to smooth and moisturize).Promising review: \"After stopping birth control, which I was on for two years, my hormones were completely unbalanced and I was breaking out so heavily. It was painful, red, swollen, all-around just terrible. I purchased this facial wash after seeing so many great reviews. I use it once a day with a facial brush that I purchased at the same time. The combination of the two has completely stopped my breakouts. After two weeks of using these together, all of my breakouts are healing and my skin is glowing. I am so thrilled. I was using masks, face wash, blemish spot treatment, everything. But this has stopped me from breaking out completely. I don't even need spot treatment anymore. This product is amazing!\" —Shoe MavenGet it from Amazon for $22.99.It also has pink grapefruit essential oil (to reduce inflammation, kill infections, and promote collagen production with vitamin C), witch hazel (to clear excess sebum and balance your skin's oil), peppermint and spearmint water (to kill bacteria within pores, balance oil production, and reduce scarring), tea tree water and essential oil (to moisturize, tone, and eliminate even the toughest breakouts), lemon essential oil (to balance overactive sebaceous glands, clear acne, and exfoliate dead skin cells), and aloe vera to promote vitamin E and C and help your skin recover). SO YEAH, IT DOES A LOT.Promising review: \"Nothing has cured or even helped my cystic acne except for this product! It immediately started working the first night. I have spent hundreds of dollars with dermatologists on chemical scripts with no success. You must try this!\" —Jo Lynn Courtney-JohnsonGet it from Amazon for $24.95.Check out more info and amazing before-and-afters!Psst! This stuff sells out (and stays sold-out) fast so GET. IT. NOW! And check out why not one, but FOUR BuzzFeeders swear by this!Promising review: \"I absolutely love this! I've wanted to try it for the longest time after seeing what it did to a friend's acne. I've only been using it for a week, but I'm already blown away but the results. I use it at night and when I wake up in the morning my normally oily and red skin is smooth and even, and any pimples from the night before are just gone. I can't recommend this product enough this is a must-have!\" —KatieGet it from Glossier for $24.* 37 Of The Absolute Best Beauty Gifts To Give This Year* 29 Makeup Products You Need If You’re Lazy* 45 Holy Grail Beauty Products You'll Probably Keep Buying ForeverThe reviews for this post have been edited for length and clarity.Great!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      Great!\n        \n          The {{categories}} Newsletter{{quantity_prefix}} will be hitting your inbox soon.\n        \n      BuzzFeed HomeSitemap© 2018 BuzzFeed, Inc."}