{"id": "\n\nEngadget\n\n\nRussia balks at US-run OneWeb satellite internet over security concerns", "paragraph": "Russia's Federal Security Service (FSB) has thrown a wrench in a planned deal that would bring internet access to the most rural and remote parts of the country, according to Reuters. United States-based startup OneWeb was set to launch a satellite project that would provide an internet network for Russia, but the plans have been delayed over the FSB's concerns that the company will gather intelligence and threaten the country's national security.OneWeb's project, which would use a collection of hundreds of small satellites to beam internet down to earth, previously agreed to work with the Russian space agency Roscosmos to create an internet network for the country. Due to the security concerns raised by the FSB over an American company having a hand in the nation's internet, OneWeb has decided to relinquish its controlling stake in the venture, saying that its venture with Roscosmos subsidiary Gonets will be majority-Russian owned and operated out of the country. Per Reuters, a Russian intelligence officer signaled the agency is willing to allow the project to go forward in partnership with India, China and other \"non-aggressive\" countries, rather than one based in the US.The objection to OneWeb's involvement may be the Russian government's way of payback. The US has recently penalized a number of Russian firms and individuals, including cybersecurity company Kaspersky. Products from the Russia-based anti-virus maker were banned from use in federal agencies over national security concerns similar to those raised by the FSB about OneWeb. Plus, relations between the countries have been a total mess since Russia was accused of interfering with the US election, which tends to put a damper on things.Whether the FSB's objections are genuine or just a bit of trolling, it doesn't do a lot of good for Russian citizens who are without internet. The nation is so large that bringing broadband services to rural communities is an incredibly difficult task. About one in four Russians still don't have any sort of internet access, according to the CIA. Regardless of the confusion, however, a OneWeb spokesperson says the company intends to begin launching its satellites in early 2019 aboard a Soyuz rocket; the company intends to deliver internet in rural Russia starting in 2020.Correction, 10/25/18, 1:45PM ET: This story originally stated that OneWeb was \"abandoning\" the project entirely. While the company is giving majority ownership and control of the project to the Russian space agency Roscosmos going forward, it has not backed out of the project. We apologize for the error.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}