{"id": "\n\nEngadget\n\n\nA brief history of when trains ran on air", "paragraph": "Isambard Kingdom Brunel was and is one of the most celebrated engineers ever to have lived. There's a London university named after him, statues commemorating him across the UK, and many of the tunnels and bridges he built are still in use today. He designed London's Paddington station, built the first transatlantic steamship powered by propellers, and was chief engineer of the Great Western Railway, which connected the capital to distant parts of England and Wales. His legacy isn't just one of achievements, though. He is also renowned for his involvement in one failed project in particular: Brunel's atmospheric railway (or \"caper,\" as it's sometimes called). Cars on the line -- officially, the South Devon Railway -- had no on-board engines, as they were driven by air pressure alone. But the design of the system was ultimately flawed. Within a year of service starting, atmospheric propulsion on the South Devon Railway was quickly abandoned.Brunel's atmospheric railway is notable because of its length and the name attached to it. The famed engineer had nothing to do with the concept itself, however. The story begins as early as the late 1600s with French scholar Denis Papin, who worked on the beginnings of leverging air pressure and steam power. At the turn of the 19th century, London-based inventor George Medhurst floated the first well-rounded idea of using compressed air as a fuel of sorts, patenting what he called the \"Aeolian engine.\" Over the next 30 years, he published several manuscripts outlining in detail how air pressure could push anything from letters to heavy goods and people through closed systems. He thought passenger trains could either travel inside a large duct, or be pulled by a piston that air could force along a much smaller tube.Through the mid-1820s and 30s, other engineers created prototype systems that explored both of Medhurst's transportation concepts. The piston-driven version was perhaps more feasible, since it only required slight modifications to how train lines were already laid. At some point during this initial exploration phase, the idea to use compressed air to push vehicles was superseded. Pumps would instead draw air out of the tube, creating a partial vacuum and thus, a pressure differential with the air behind the piston, driving it forward.All of this presented a tough technical challenge. The piston in the pipe had to be attached to a passenger car by an external arm, meaning the tube had to have a slit running its entire length. Keeping this gap sealed to preserve the negative and positive air pressure either side of the piston, while allowing the arm to pass unimpeded, posed a problem.A trio of engineers -- brothers Jacob and Joseph Samuda, plus Samuel Clegg -- went about solving it. They devised a valve of overlapping leather that would open to allow the arm to pass, stay open so air could rush into the void behind the piston to push it onwards, then seal shut behind it to maintain pressure. The leather was affixed to the pipe with a metal hinge on one side, and would rest on a deposit of beeswax and tallow (animal fat) on the other. The claggy mixture would cling to the leather to create the necessary seal.Around the same time, others were concocting their own, competing designs. One involved propelling the whole train through a flexible canvas tube; another proposed a closed system where the piston would drive cogs that translated the movement to train cars; and one suggested that precision-made iron tubes could be flexible enough to open and close without the need for complicated valves.\n                            The atmospheric system designed by the Samuda brothers and Clegg\n                          Ultimately, though, the leather valve system -- a crude version of which Medhurst had proposed years earlier -- ended up being adopted for commercial atmospheric railways. Clegg and the Samuda brothers first patented their work in 1838, and two years later leased an unopened section of the West London Railway. They installed a cast iron pipe between the tracks along a half-mile stretch of line, and a pumping station at one end to pull air out of the tube. This technical demonstration stuck around for two years, but around the time of its inception in 1840, Clegg parted ways with the Samuda brothers to follow career opportunities in Portugal.In 1841, Joseph Samuda published a 50-page document that laid out the team's work on atmospheric propulsion in fine, technical detail. He died a few years later, not long after the Samuda brothers claimed their entire system in a more comprehensive patent in 1844. But by this time, it was already in use on the first commercial atmospheric route. The fact the Samuda name is inextricably linked with the first atmospheric railways is more a case of fortuitous timing than anything. Engineers had shown working proof-of-concepts before, but it was around 1840 that the railway industry exploded, and atmospheric systems promised several advantages to steam locomotives of the time.The cars didn't need engines, so were much lighter, cheaper and easier to build. They were much quieter and cleaner, too, since the smoke-billowing steam engine was in a pumping station somewhere else, not attached to the front car. They were technically safer because trains couldn't travel in opposite directions on the same line, but best of all, they didn't rely on friction. Heavy trains with metal wheels on metal rails didn't have enough traction to take on even slight inclines. Air pressure didn't care for friction.In 1840, plans were drawn up to extend the Dublin and Kingston Railway in Ireland roughly two miles further to Dalkey. The route was steep and curved, but the treasurer of the company operating the railway was aware of the Samuda design. The Dalkey Atmospheric Railway, the first of its kind, opened in August 1843; air pressure pulled carriages up the ascent, while gravity brought them back down again. The success of the Dalkey line sold other railway operators on the concept. The French government sent an agent to evaluate the Dalkey line as it, too, was unable to elongate an existing line due to troublesome terrain. Based on the results of this review, a one-mile, atmospheric extension started construction in 1845 and opened in 1847.Also having been impressed with the Dalkey line, London and Croydon Railway engineer William Cubitt decided to use the Samuda system on a new line traversing the capital. It was intended to ease congestion on the existing rail network and the initial route ran five miles between Croydon in the south and Forest Hill in the south east. Incidentally, because the piston pipe couldn't be laid across existing tracks, the first ever railway overpass was built to accommodate the line.The route officially began running in January 1846, but even before that, the engines at the pumping stations were proving unreliable. Breakdowns were commonplace in those first few months, but the integrity of the leather valve system soon became the primary reason for delays and cancellations. Often, there was insufficient pressure for trains to make it up the flyover incline. Even so, the line was extended another few miles south east to New Cross in early 1847, but by the summer of the same year, the pipes were pulled up and the atmospheric system was abandoned altogether.Many of the problems encountered on the Croydon line foretold the demise of Brunel's atmospheric railway, which at this point in the summer of 1847, was almost operational. Brunel was put in charge of the South Devon Railway, which was to be an extension of the Great Western Railway from Exeter to Plymouth in the south west of England. Brunel proposed using an atmospheric system of Samuda's design because of the hilly terrain. It was expected to save on both construction and running costs, and so was approved.Piping was initially installed on a roughly 12-mile stretch of track from Exeter to the coastal town of Teignmouth, and the first passenger trains began running in September 1847. Steam locomotives supplemented the service until March the following year, at which point all of the trains on the line were pressure-driven. The atmospheric system was already proving unsustainable, however. Construction had been more difficult than planned, and the track was underpowered. This meant the pumping stations had to work harder than anticipated, making the line not nearly as economical as was originally thought.What's more, there was no telegraph system installed, so pumping stations worked to a strict timetable instead. Any delays meant the stream-powered pumps were turned on ahead of schedule, evacuating the tube before it was necessary and wasting coal in the process. Old South Devon Railway accounts from 1848 indicate the atmospheric trains were actually more than twice as expensive to run per mile than steam locomotives.\n                            A pumping station on the South Devon Railway\n                          Maintenance of the leather valve was the nail in the coffin, though. As with the Croydon line, a metal plate intended to cover the leather valve to protect it from the elements wasn't installed, despite it being part of Samuda's design. The leather was prone to freezing during the winter of 1847-48, and drying out from the sea air and heat of the following summer. It had to be treated to keep it supple, and repaired at great expense. Debris was a constant threat, and there is some anecdotal evidence rats were attracted to the tallow sealant and leather, eating it away to cause further damage.Samuda had been employed to maintain the line, but ultimately the entire leather valve needed replacing, which was the straw that broke the camel's back. It would have been an extremely costly undertaking, and Samuda refused. The question of liability bounced between Brunel, Samuda and the South Devon Railway Company as the atmospheric system fell into disrepair. Though a telegraph became operational in August 1848, significantly reducing coal consumption at the pumping stations, in early September the atmospheric line was abandoned and replaced by steam locomotives. A shareholder meeting was held in January 1849 to make the final call. Some were keen to continue the service, but in the end votes against outnumbered votes in favor by nearly five to one.Despite the failures of the London and South Devon projects, the much shorter atmospheric lines in Ireland and France ran more or less uninterrupted for over a decade until more powerful steam trains capable of the ascents replaced them. In that sense, atmospheric railways were a stopgap technology. They were favorable to early steam engines, but were eventually outpaced by those same machines as they improved over the decades.The draw of atmospheric transport didn't die with Brunel's overambitious \"caper.\" Having already built a pneumatic system for the transport of letters and other goods around the capital, engineer Thomas Webster Rammell built a short demonstration line in south London's Crystal Palace Park in 1864, which was operational for a few months. This was a subway style atmospheric system where the whole car was propelled down a tunnel by a large fan, and pulled the other way by reversing the rotation of the blades to create a partial vacuum. It's thought this was intended to prove the design could work for a short, underground line running beneath the River Thames between London's Waterloo station and Whitehall. Construction of this, overseen by engineer Edmund Wragge, began in 1865 but was never completed due to a financial crisis that struck the following year.Not long after, inventor Alfred Ely Beach set to work on the first underground transportation system in New York City. Funding the project in part with his own money, he completed construction of a block-long tunnel under Broadway in less than two months. The Beach Pneumatic Transit line worked in the same way as the Crystal Palace demonstration, blowing and sucking cars along its length. In early 1870 it opened to the public, who could buy a return trip ticket -- there was no exit at the end of the tunnel, just a dead end -- for 25 cents. It never amounted to much more than a novelty, though. The plan was to extend the subway by roughly five miles to Central Park, but bureaucracy and a lack of funding and support led to it closing down in 1873, despite Beach having finally obtained the permission he needed. It did, however, give rise to a pneumatic mail transport system in the city.After Beach's failed attempt to build a pneumatic subway system, appetites waned. It's important to note here that Hyperloop and similar concepts don't use air pressure (or the lack thereof) as a means of power. The evacuated tunnels integral to their design are simply to reduce drag on the vehicle.\n                            The Aeromovel shuttle at Salgado Filho International Airport\n                          Atmospheric train services have enjoyed a slight renaissance in modern times. A company called Aeromovel basically updated the Samuda design, creating a system that uses positive and negative pressure to drive cars and swapping the leather valve for a more robust, rubber seal. An elevated, monorail style loop built by Aeromovel has operated in an Indonesian theme park since 1989. Much more recently, in 2013, a second Aeromovel line opened at Brazil's Salgado Filho International Airport, connecting the nearest metro station with a terminal building. Creating an airtight system isn't so much of a problem anymore. If only rubber had been readily available in Brunel's time, perhaps his most notable failure could instead have been one of his greatest achievements.Images: South Devon Railway illustration via Exeter Memories; Medhurst's duct and valve design (his transcripts via Google); The Samuda & Clegg atmospheric system (Science & Society Picture Library via Getty); Illustration of the Dalkey Atmospheric Railway (Magazine of Science via Oxford Science Archive / Print Collector / Getty); Photograph of Brunel (The Metropolitan Museum of Art via Wikimedia Commons); Photograph of South Devon Railway pumping station via Mike's Railway History; Illustration of the Saint-Germain atmospheric railway (L'Illustration, Journal Universel via Getty); Photograph of Beach Pneumatic Transit tunnel (Scientific American); Aeromovel in Brazil (Trensurb / Flickr).Technological innovation didn't begin with the development of the first integrated circuit in the 1950s. Backlog is a series exploring the era of possibilities: engineering feats that followed the industrial revolution, quirky concepts the future's rendered obsolete, and inventions that paved the way for some of the technology we use today.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}