{"id": "\n\nEngadget\n\n\nBepiColombo orbiters take off for Mercury tonight", "paragraph": "If you've ever wondered what's happening over on Mercury, you'll have an answer soon. Well, soon-ish. BepiColombo, a joint effort between the space agencies of Europe and Japan, will send off a spacecraft Friday night at about 9:45 PM ET with the destination set for the closest rock to the sun. Don't expect to hear much from the little adventurer for a while, though -- it won't reach Mercury's orbit until late 2025.The BepiColombo mission, named after Italian mathematician and engineer Giuseppe \"Bepi\" Colombo, consists of two separate spacecraft. There's the Mercury Planetary Orbiter, which will map the planet and the environment that surrounds it, and the Mercury Magnetospheric Orbiter, which will focus on measuring the relationship between the planet's magnetic field and charged particles emitted from the sun, just a short 36 million miles away. The information gathered should provide a better understanding of the evolution of our solar system and offer insight into the habitability of exoplanets with a similar makeup of the dark and mysterious Mercury.\n                            Engineers prepare the BepiColombo Mercury Transfer Module (left) and the two science orbiters (right) for integration to complete the spacecraft stack.\n                          Once BepiColombo launches—as it is scheduled to do tonight—it'll spend seven years making the roundabout trip to Mercury, which will include a flyby of Earth in 2020, two passes of Venus, and six different flybys of Mercury before it reaches the planet's orbit in 2025. Once they reach their destination, the crafts will have the sun beating down on them. Both have been coated with temperature-resistant layers that should help stave off temperatures of up to 660 degrees Fahrenheit, per the European Space Agency. Assuming they make it safe and sound, the crafts will be the first to visit Mercury since NASA crashed a probe into it in 2015.The two crafts of the BepiColombo mission will be sent off into space this evening when they are launched atop an Ariane 5 rocket. They'll take off from the French Guiana. Liftoff is scheduled to take place at 9:45 PM Eastern time. The ESA will provide live streaming coverage of the launch starting at 9:15 PM ET (the player is also embedded above) if you're interested in the pre-game show.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}