{"id": "\n\nEngadget\n\n\nMobvoi’s TicWatch C2 brings classic looks to Wear OS", "paragraph": "Mobvoi, the maker of some surprisingly good and cheap Android smartwatches, has added a new wearable to its lineup. The company announced the arrival of the TicWatch C2, a Wear OS-powered update of its Classic smartwatch.As the name suggests, the TicWatch C2 has a look that reminds you of a classic watch -- you know, the kind from back when watches just kept time. Its round body, available in 18mm or 20mm, comes in three colors: rose gold, black, or platinum. (Rose gold is only available on the smaller version.) A leather strap accompanies the wearable, regardless of size or finish, and all versions are water resistant.One major change for the TicWatch C2 from its predecessor is the move to Google's Wear OS. Previous models of the TicWatch used the company's own Ticwear OS, which made use of the company's background in artificial intelligence to produce things like recommendations based on time and location. By embracing Wear OS, the C2 should have more compatibility with third-party apps that otherwise wouldn't integrate with the Ticwear ecosystem. The TicWatch Pro, released earlier this year, also uses Wear OS.The TicWatch C2 also received some technical improvements over the original Classic, including NFC support for wireless payments through Google Pay. Google Assistant is built into the watch to answer any of your pressing questions or send off texts for you. Like the Classic before it, the C2 also includes health and fitness functions enabled by GPS tracking, heart rate sensors, a gyrometer and an accelerometer. With its 400mAh battery, Mobvoi claims you should be able to squeeze two days of use out of the C2.Mobvoi's latest smartwatch will be available for pre-order starting today but won't ship until the first week of December. The watch starts at $199.99.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}