{"id": "\n\nEngadget\n\n\nTesla turns a profit in Q3 despite Musk", "paragraph": "Tesla released its Q3 earnings at the close of trading on Wednesday and, despite a number of recent (and very public) gaffes from its CEO, the company managed to have an excellent financial quarter.For one, the Model 3 was the top selling vehicle in terms of revenue (though that's not hard when you're competing against Civics and Sentras) and the fifth best selling vehicle when measured by volume, resulting in a net income of $312 million. Tesla does note that more than half of the vehicles that it received through Model 3 trade-ins were valued at less than $35,000 when new. This suggests that not only are consumers willing to pay a premium for Tesla's products, they're willing to spend significantly more than they had for their previous vehicles. The company hopes to drive the cost of the Model 3 down from its current $46,000 starting point to around $35,000 to better capture the low end of this market.\"In order to significantly increase the affordability of Model 3, we have decided to accelerate our manufacturing timeline in China,\" the company wrote in its quarterly investor update letter. \"We are aiming to bring portions of Model 3 production to China during 2019 and to progressively increase the level of localization through local sourcing and manufacturing. Production in China will be designated only for local customers.\"As for Tesla's widely-reported difficulties getting its cars off the assembly line, the company boasts that it made 4,300 vehicles per week on average, 20 percent higher than its initial production targets. In all, Tesla delivered 56,065 Model 3s to customers during Q3.\"Labor hours per Model 3 decreased by more than 30% from Q2 to Q3, falling for the first time below the level for Model S and X,\" the company wrote. \"In Q4, we will focus even further on cost improvements while continuing to increase our production rate.\"Tesla also opened 4 new showrooms/service centers during Q3, bringing the total to 351 brick and mortar locations. This has helped drive a 20 percent increase of service revenue since Q2. The company also opened 44 new Supercharger stations, for a total of 1,352.Looking ahead, the company reports that its goal of producing 100,000 Model S and Xs by the end of the year remain unchanged.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}