{"id": "\n\nEngadget\n\n\nAmazon may place its second headquarters in Arlington, Virginia (updated)", "paragraph": "Amazon appears to be close to picking a city for its second headquarters ahead of its end-of-2018 deadline. Washington Post sources said the internet giant had \"advanced discussions\" about placing the coveted location in Arlington, Virginia's Crystal City neighborhood. The company's talks were \"more detailed\" than in other locations in the state's northern region, the insiders said, and there's been a \"lot of activity.\" The main real estate developer in Crystal City (JBG Smith) has even taken some buildings off the leasing market, while officials have talked about how they would make an announcement later in November.Amazon, JBG Smith and relevant politicians declined to comment.While this makes the choice sound like a lock, those involved are reportedly cautious. They're concerned there might be similarly advanced talks in other cities, and that Amazon could still choose another location despite all the signs. Investors, relocation experts and political leaders see the wider Washington region (including Arlington) as a strong candidate, though.It might not even be the only choice. CNBC contacts said that Amazon's final pick might come down to either northern Virginia or Austin, Texas, and might even involve a split between the two. Austin is already a major technology hub with companies like Apple, Dell and Google operating in or near the state capital.The question remains whether or not the eventual winning city and its host state will make sacrifices in order to land the Amazon building. While the company has promised 50,000 jobs and $5 billion in capital investments, politicians have offered billions in subsidies and other incentives in hopes of landing the new headquarters. They'd get a potential economic stimulus at the expense of tax revenue that could support communities. Amazon has been a staunch opponent of certain taxes, and cities like Arlington might have to bend to those desires if they want the extra business.Update 11/4 3:16PM ET: Wall Street Journal sources said that Crystal City is one of a \"handful\" of cities that are in front, including Dallas and New York City.  Amazon may not have picked a winner yet, but it may be rapidly culling the list.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}