{"id": "\n\nEngadget\n\n\n\n      Still waiting for a video game developer to win a Genius Grant\n    ", "paragraph": "Every year since 1981, the MacArthur Foundation has handed out the \"Genius Grant,\" awarding a handful of individuals $625,000 each in recognition of their creative skills and success in their chosen field. The money is no-strings-attached, designed to act as an open investment in that person and their work. The chosen Fellows come from an extensive range of industries, from philosophers and filmmakers to journalists and jazz performers. There's even a basket weaver on the list.There are absolutely no video game developers.\"The grant program has basically been concurrent with the entire history of video games,\" Mohawk Games CEO Soren Johnson said. \"It just seems really weird that they basically pretend that video games don't exist.\"Johnson, who designed and wrote the AI systems for Civilization 3 and 4, has called out the lack of recognition two years in a row on Twitter, noting the MacArthur Foundation has awarded 1,014 Fellowships over the past 37 years.\"Somehow, a program dedicated to supporting originality, innovation, and CONTEMPORARY WORK has completely excluded the art form that has grown the most -- by orders of magnitude -- during the program's existence,\" he tweeted in early October. \"If the MacArthur Foundation wanted to look for a place where their money would support art with the greatest potential impact on the next generation, they could find no better place than video games.\"However, it's not that the MacArthur Foundation isn't looking.The foundation keeps the Genius Grant nomination process fairly opaque, with a \"constantly changing pool of invited external nominators chosen from as broad a range of fields and areas of interest as possible.\" The nominees are evaluated by an Independent Selection Committee of 12 leaders in the arts, sciences, humanities, non-profit and commercial industries. This committee then makes its final recommendations to the MacArthur Foundation president and board of directors, who hand out the prizes.Game developer and Carnegie Mellon professor Paolo Pedercini was part of this process in 2014. In response to an article about the Genius Grant that year, Pedercini tweeted, \"Without further disclosures I can tell you that game designers are being considered for MacArthur fellowships.\" He was backed up by John Sharp, an associate professor of games and learning at Parsons, who added, \"And have been for about the last 5 years.\"\"I'm not part of the fellowship program; I was just asked out of the blue to provide a letter of support for a nominee, which I did,\" Pedercini told Engadget this week. \"The nominee was a game developer, among other things.\"The MacArthur Foundation declined an interview for this story, though a spokesperson offered the following statement: \"Many Fellows work across multiple fields or change fields over time. We are continually striving to cultivate a broad, deep, and diverse pool of nominators and evaluators in order to explore the full breadth of creativity.\"The MacArthur Foundation isn't alone in turning a blind eye, at least on a public level, to the video game industry. The Guggenheim Fellowship has been active since 1925, offering grants to people \"who have already demonstrated exceptional capacity for productive scholarship or exceptional creative ability in the arts.\" Recipients come from a broad range of fields, including film, literature, history, physics, drama and dance. The John Simon Guggenheim Memorial Foundation offers an average of $43,000 to each Fellow and it picks roughly 200 winners each year.There is no \"video game\" category in the Guggenheim Fellowship search bar (though there is German and Scandinavian Literature, Medieval History, Sound Art, and Constitutional Studies, to name a few categories), and typing in \"video game\" doesn't yield any relevant results. In contrast, a search for \"film\" finds 20 pages of results.It seems that there's been just one Guggenheim Fellow who identifies as a video game developer, and she was named this year -- Elizabeth LaPensée, creator of eco-focused game Thunderbird Strike and a writer on Where the Water Tastes Like Wine. That's one out of more than 18,000 Guggenheim Fellows.Other, less academic, award programs are also reluctant to include video games. For instance, the Grammys have nominated a video game soundtrack or song just twice in 60 years. This is despite a restructuring in 2011 that officially opened the door for video games to be nominated in the Visual Media award category.\"There are so many people in our industry that contribute to pushing the boundaries of art and fun and technology -- it's crazy to me that game development doesn't get more recognition in regards to its impact on the world,\" said Meggan Scavio, president of the Academy of Interactive Arts and Sciences. That's the non-profit organization behind the annual DICE Awards -- essentially the video game Oscars. Founded in 1996, the AIAS is dedicated to supporting video game developers and legitimizing the industry in the mainstream.\"I think the problem is that in some institutions, video games are still seen as entertainment for kids,\" Scavio said. \"You just sit in front of a TV and shoot stuff, right? But for those paying attention, that's just not the case. I'm a 48-year-old woman who plays video games every day and I can't remember the last time I shot anything.\" She called out games like Papers Please, This War of Mine and That Dragon, Cancer as examples of the medium's emotional power.\"While you can certainly read or watch these stories, only video games force you to participate, allowing you to truly feel these hardships,\" she said.There's hope, according to Scavio. A handful of organizations have added video games to their repertoires and the list is growing. GLADD will include video games in its media awards for the first time this year; the Smithsonian's Lemelson Center recently launched a program to recognize video game pioneers and preserve industry history; the Museum of Modern Art has 14 video games in its permanent collection.Video games are obviously an art form, imbued with creativity and latent talent. The question, then, is why this popular, massively influential, highly technical, bigger-than-Hollywood creative field isn't recognized as art, or as something important, by high-profile organizations.Sure, there are thousands of other industries ignored by the MacArthur and Guggenheim grant programs, though none that are as popular and culturally relevant as video games. In terms of revenue alone, video games outstrip the film industry three-to-one: Games brought in $122 billion worldwide last year, while box office sales generated roughly $43 billion. There are an estimated 2.3 billion gaming fans around the globe. Fortnite, Minecraft and Overwatch are household names.Video games are a hotbed of innovation. Developers and players are excited to try new ideas and push the boundaries of immersion and storytelling, and the industry itself is a proving ground for new technologies. Just look at virtual reality. The VR industry established its roots in gaming; it found hungry test subjects in players and enthusiastic tinkerers in developers. From video games, VR has expanded to film, TV, education and advertisement. A similar story is playing out in the world of augmented reality, with experiences like Pokemon Go introducing its basic concepts to the broader market.Video games themselves are demonstrably powerful, emotional, perspective-shifting experiences covering an infinite range of subjects from just as many varied perspectives. The MacArthur Foundation itself recognizes this truth, offering grants for educational video game projects through efforts including the Digital Media and Learning Competition.But in 37 years, the MacArthur Fellowship has never recognized the accomplishments of video game developers. This fact isn't an indictment on the Foundation itself or a devaluation of the people who have received genius grants. It's simply strange.\"They even have 3D visual art, which is obviously a very core part of video games,\" Johnson said. \"So if you look at the sum total of everything they recognize, it's just super weird that video games are completely missing.\"It's possible that video games have simply fallen through the cracks built into the MacArthur and Guggenheim nomination systems, with nominators unable to fully convince their peers or the board that developers deserve a nod.\"I can only speculate, but it seems like the Genius fellowships are increasingly awarded to people who are trying to make the world a better place and/or to people from marginalized backgrounds,\" Carnegie Mellon professor Pedercini said. \"Neither of these characteristics are very common among established game developers. Moreover, I think that the few 'geniuses' in our field -- people like, say, Stephen Lavelle, Porpentine or Michael Brough -- are underappreciated even within the gaming circles. It may just take some time.\"The MacArthur Foundation has had nearly 40 years to find value in the video game industry and it hasn't happened yet. That doesn't mean it shouldn't -- or that it never will.Jessica earned her BA in journalism from ASU's Walter Cronkite School in 2011, and she's written for online outlets since 2008, with four years as senior reporter at Joystiq. She specializes in covering independent video games and esports, and she strives to tell human stories within the broader tech industry. Jessica is also a sci-fi novelist with a completed manuscript floating through the mysterious ether of potential publishers.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}