{"id": "\n\nEngadget\n\n\nThe Morning After: We took push notifications to the limit", "paragraph": "Hey, good morning! You look fabulous.Welcome to your weekend! We've looked directly into the push notification abyss and come out the other side, while scientists made important decisions about the kilogram. Of course, we're also tracking all kinds of Black Friday discounts and other highlight stories from this week like the Iron Man-ish adrenaline junkies who took their jetpack flights to a new level and some impressive results from Google's Night Sight Pixel feature.Next stop: O'Leary Station.Boring Company breaks through to the end of its first test tunnelWe're within a month of the proposed opening for Elon Musk's LA test tunnel, and late Friday night he shared video of a digging machine breaking through to its final destination.Push it to the limit.Turning up my phone's notifications to max shattered my brainA recent study found that a majority of users who made a deliberate choice to turn their notifications down as part of an enforced break were not likely to turn them back on. This got Zach Hines wondering: What would happen if I cranked them in the opposite direction? What might I learn about how phones are reshaping minds? What might I learn about my own mind?How to sell smoking in 2018.Big tobacco's new marketing push: Smartphones, style and EDMA joint Point and Engadget investigation has found that several British American Tobacco brands sponsored music events and created entirely new lifestyle brands that initially seem unrelated to cigarettes. But on closer inspection, they are used to raise awareness of cigarette brands in markets across Europe and Asia where overt tobacco advertisements are forbidden.'Loft: The Jetman Story'Watch real-life Iron Men do the first jetpack launch from the groundAutonomous. Jetpack. Flight. Jetman Yves Rossy and his two protégés (Fred Fugen and Vince Reffet) show off some incredible stunts in a trailer for their upcoming documentary about developing the personal flying machines.The single-serving, pod-based cocktail maker was built in partnership with AB InBev.Drinkworks Home Bar is a literal Keurig for cocktailsThe \"Keurig of cocktails\" market is already crowded with wannabes that don't seem to be gaining much traction, but if anyone can build the Keurig of anything, it's got to be Keurig itself, right? Drinkworks is a joint venture between the single-serving coffee-pod giant and Anheuser-Busch InBev (AB InBev), and it's building a familiar-looking machine that mixes up cocktails using disposable pods. The results are drinkable, but it's still a hard sell.Goodbye, Le Grande K.The kilogram has officially been redefinedOn Friday, scientists voted to change the definition of the kilogram as well as three other units of measurement. The new definitions will be based on \"what we call the fundamental constants of nature,\" as Estefanía de Mirandés of the International Bureau of Weights and Measures (BIPM) told Science News, instead of the less precise definitions these measurements are currently tied to.As of May 20th, 2019, the kilogram will now be defined by the Planck Constant, while the ampere, kelvin and mole will be tied to the elementary electrical charge, the Boltzmann constant and the Avogadro constant, respectively.Two other lens projects are still in the works.Alphabet's smart contact lens for glucose monitoring has been shelvedIn 2014, Google's life sciences division showed off its design for a contact lens that could monitor the wearer's glucose level via their tears. Now Verily operates under Google's parent company Alphabet and has announced that it's moving on from the project because it was unable to get reliable results.However, it has also been working on a smart accommodating contact lens for presbyopia (age-related farsightedness) as well as an intraocular lens to help improve eyesight after cataract surgery. Separately, it's still working on other technology for glucose monitoring that doesn't rely on a sensor-packed contact lens.It's almost that time again.Engadget will once again judge the official Best of CES AwardsIt seems like just yesterday that Engadget began judging the official Best of CES Awards in January 2014, but now we're already approaching our sixth consecutive year on the job. This year we're expanding what was formerly known as the \"Best Vision of the Future (Smart City)\" category and renaming it \"Most Impactful.\" You can see all the categories, as well as submission requirements, in our post today, then check back in January to find out who we've picked as the winners.The Morning After is a new daily newsletter from Engadget designed to help you fight off FOMO. Who knows what you'll miss if you don't Subscribe.Craving even more? Like us on Facebook or Follow us on Twitter.Have a suggestion on how we can improve The Morning After? Send us a note.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}