{"id": "\n\nEngadget\n\n\nNetflix cancels 'Luke Cage' a week after dropping 'Iron Fist'", "paragraph": "When Marvel and Netflix announced Iron Fist wouldn't return for a third season, there were reports Luke Cage was close to being renewed. That is not the case, however, as they announced tonight that the show will end after two seasons, even though additional seasons for Jessica Jones and The Punisher are already on order. In a statement, the companies said \"Unfortunately, Marvel's Luke Cage will not return for a third season. Everyone at Marvel Television and Netflix is grateful to the dedicated showrunner, writers, cast and crew who brought Harlem's Hero to life for the past two seasons, and to all the fans who have supported the series.\"The news comes on the same day Netflix premiered season three of Daredevil, which was the first of its Defenders TV shows to launch in a partnership with Disney and Marvel. Now, Disney is preparing to launch its own streaming service -- with its own lineup of Marvel hero-based TV shows -- and whether it's due to weak streaming numbers or simply choosing to use that part of its content budget elsewhere, these shows are dropping off. Variety reports that there were talks for a third season, but that Netflix decided it would \"not be feasible.\"\npic.twitter.com/iOglM1TExxA lot memories. A lot of individual thank you calls to make. Just want to say thank you to Marvel, Netflix, the best Writer's room, cast, crew, the Midnight Hour, all those who graced the stage at Harlem's Paradise and the most incredible fan base in the world. Forward always...Richard's been tech-obsessed since first laying hands on an Atari joystick. Now he scours the net for the latest news and taking occasional breaks to seed Twitter with Dreamcast 2 rumors.\n\nBlood type: Purple[Image: Trilogy Beats]You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}