{"id": "\n\nEngadget\n\n\nJack Dorsey says a Twitter edit function has to be done ‘the right way’", "paragraph": "While speaking at the Indian Institute of Technology, Twitter CEO Jack Dorsey was asked a question that comes up all the time -- will Twitter ever roll out an edit feature? Dorsey has acknowledged the possibility of such a function in the past, and like before, his recent comments on the topic noted that while the company has been considering an edit function, it would want to be sure it was implemented in the right way.\"When we hear about the edit button, you have to pay attention not to what people are asking you for but the use cases,\" Dorsey said. \"What's the question behind the question? And a lot of people want edit because they make mistakes on Twitter and they want to quickly fix them. They don't want to look bad.\" Dorsey used the examples of tweeting the wrong URL or including a typo. \"So that's a lot more achievable than allowing people to edit any tweet all the way back in time,\" he said.Dorsey's comments make it sound like Twitter is open to an edit feature that would let users quickly correct a mistake. But more substantial edits, like ones that change the meaning of a tweet, appear to be what has kept the company from introducing an edit function so far. As an example, Dorsey presented a situation where one person tweets something that's then retweeted by those that agree with the statement, but the original tweeter then edits their tweet to the point where those who've retweeted the post no longer agree with it. \"And that's what we need to prevent,\" said Dorsey.As for potential solutions to that problem, Dorsey mentioned change logs that would display how a tweet has been changed. \"But ultimately we need to make sure we're solving a real problem,\" he said. \"We've been considering edit for quite some time, but we have to do it the right way. We can't just rush it out, and we have to make sure that we're actually solving the predominant reason why people would do it, first and foremost. And then not making something that's distracting or takes away from the public record in doing so, because I think it's really critical that we preserve that.\"Like other social networks, Twitter has had a problem with manipulative content and hoaxes. Last month, it tweaked its reporting process so that users can specify when they're reporting fake accounts and malicious links.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}