{"id": "\n\nEngadget\n\n\nTwitter’s new midterm election page already includes fake news", "paragraph": "Today, Twitter rolled out a new page focused on the US midterm elections, and on it, users can view supposedly relevant tweets through two tabs -- \"Latest\" and \"Top Commentary.\" On mobile, there's also a \"News\" tab that includes separate sections for each state. However, while this page is clearly meant to be a place for users to find more information about the upcoming election, it's surfacing tweets from conspiracy theorists, people pushing disinformation and what appear to be bot accounts, BuzzFeed News reports.The midterm elections right now #Midterms2018 https://t.co/7T2IojpxWwBuzzFeed News found that the page included a tweet from pundit Bill Mitchell that claimed Democrats paid for the Honduran caravan in order to \"create another 'separating families' crisis\" ahead of the election. Another tweet falsely claimed that Marc Molinaro, a Republican candidate for New York governor, had dropped out of the race, while another said Kid Rock was about to become a Michigan senator. A few others pushed unproven claims about illegal voting and some tweets included on the page came from partisan accounts without followers or profile pictures, suggesting that they're automated. And in the California section of the page, BuzzFeed News spotted a tweet from Tomi Lahren that referred to the lieutenant governor of California and current candidate for governor as \"Greasy Gavin Newsom.\"A spokesperson told BuzzFeed News that an algorithm collects tweets for the page based on keywords, though they didn't share what those words are.Like Facebook, Twitter has been working to avoid a repeat of what happened ahead of the 2016 presidential election, when foreign groups used its platform to push content and disinformation aimed at stoking political tensions in the US. The site has also made a big deal about its more recent effort to promote conversational health among its users. But by surfacing fake news, promoting automated accounts and including conspiracy theories, the midterms page doesn't appear to fit with either of those efforts.Along with playing host to political disinformation campaigns, Twitter has also had a problem with users spreading hoaxes and fake news, particularly during breaking news situations. But while Twitter has introduced new policies aimed at boosting the transparency around political and issue ads, when it comes to fake news, the company has been less willing to take a stance. CEO Jack Dorsey told CNN earlier this year that his company was hesitant to remove false information and that its staff shouldn't be \"the arbiters of truth.\"The company told BuzzFeed News that the midterms page was more for newer users seeking news about the election rather than more seasoned Twitter users.Image: Twitter via BuzzFeed NewsYou can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}