{"id": "\n\nEngadget\n\n\nCriterion will launch its own classic film streaming service in 2019", "paragraph": "Criterion won't kill its streaming channel after FilmStruck shuts down on November 29th -- in fact, it'll live on as an independent service slated for launch in spring 2019. The video distribution company started looking for a new home as soon as WarnerMedia announced that it's closing the doors on its classic cinema streaming service. Some thought it would go back to Hulu, its former home, but it clearly decided to take another path and to go all out. Criterion is known for specializing in restoring and providing access to classic indie and rare films, as well as other movies of note. It sells DVDs and Blu-rays of its collection, but its streaming service gives fans a way to enjoy them without having to pay $30 and above or so for a single title. A post on the Collection's website says the Criterion channel will pick up where it left off and will continue its current programming:\"Our regular series like Art-House America, Split Screen, and Meet the Filmmakers, and our Ten Minutes or Less section will all live on, along with Tuesday's Short + Feature and the Friday Night Double Feature, and of course our monthly fifteen-minute film school, Observations on Film Art.\"The company is hoping launch the service, which it wholly owns, in the US and Canada. Since it's starting from scratch and won't be able to rely on a platform's current subscribers, it has already opened sign-ups to fans who want to support the service. Its first subscribers will get a 30-day free trial and will only have to pay $10 a month (instead of $11) or $90 a year (instead of $100). They'll also get access to a concierge customer service and will receive a holiday gift certificate as a present. You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}