{"id": "\n\nEngadget\n\n\nThe Kepler space telescope's end has finally come", "paragraph": "The time has finally come to say goodbye to Kepler, the spacecraft that exceeded expectations throughout its mission and has so far confirmed more than 2,600 planets outside of our solar system. In March, NASA warned that Kepler's end might be nearing as it was running very low on fuel, and scientists running the spacecraft have put it to sleep multiple times over the past few months in order to preserve what fuel it had left. But even as recently as last month, Kepler demonstrated that it still had enough juice to continue collecting data and launched into its 19th observation campaign. However, Kepler has now run out of fuel and NASA has retired the spacecraft after nine years of observations.The Kepler team is feeling proud today! There really is no fuel left in @NASAKepler whatsoever. Every single drop of hydrazine was used for science. 💧 That is an astonishing success on top of what already was a wondrous achievement. Thank you @BallAerospace. 🚀 [1/2] #K2Mission pic.twitter.com/scOmkBarT0\"As NASA's first planet-hunting mission, Kepler has wildly exceeded all our expectations and paved the way for our exploration and search for life in the solar system and beyond,\" Thomas Zurbuchen, associate administrator of NASA's Science Mission Directorate in Washington, said in a statement. \"Not only did it show us how many planets could be out there, it sparked an entirely new and robust field of research that has taken the science community by storm. Its discoveries have shed a new light on our place in the universe, and illuminated the tantalizing mysteries and possibilities among the stars.\"NASA launched Kepler in 2009, and despite mechanical issues and dwindling fuel, the spacecraft has well-exceeded its original 3.5-year mission. In that time, it has spotted thousands of exoplanet candidates and shown us that planets are rather ubiquitous, outnumbering stars in our galaxy. \"When we started conceiving this mission 35 years ago we didn't know of a single planet outside our solar system,\" said the Kepler mission's founding principal investigator, William Borucki, who's now retired. \"Now that we know planets are everywhere, Kepler has set us on a new course that's full of promise for future generations to explore our galaxy.\"What will happen to the @NASAKepler space telescope? The spacecraft will remain forever in orbit around the Sun, periodically passing Earth but never coming closer than a million miles to our planet. Watch and learn more: https://t.co/CDV5EZJmqJ pic.twitter.com/I61zajLsxaNASA retired Kepler in its current orbit, which is a safe distance from Earth. But even though it's the end of Kepler's data collection, its legacy is far from over -- researchers expect that the amount of data the spacecraft has delivered will keep them busy for over a decade. Kepler has had a truly impressive career filled with a number of important discoveries and it's certainly sad to see it go. But fear not. Its successor, TESS, is already at work filling Kepler's sizable shoes and we're sure to have thousands of additional exoplanets to get excited about in the coming years.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}