{"id": "\n\nEngadget\n\n\nFacebook is still growing at a slow but steady pace", "paragraph": "It feels like for the better part of the past two years, every few months we talk about how Facebook hasn't been having an easy time. In 2018 alone, the company's faced several problems, such as the Cambridge Analytica data privacy scandal and, of course, the recent data breach that exposed private data of 29 million Facebook users. While we won't see the effects of the latter until next quarter, if at all, Facebook has kept raking in cash and users despite everything -- even if its growth has slowed down a bit. For Q3 2018, Facebook reports it has grown to 2.27 billion monthly active users, a 10 percent year-over-year increase, which is complemented by $13.78 billion in revenue.More importantly, perhaps, the company said more than 2.6 billion people are now using Facebook, WhatsApp, Instagram or Messenger, aka its \"Family\" of apps, every month. That figure shows you just how powerful Facebook is as a whole, in case you had any doubt. Meanwhile, daily active users on the core Facebook app jumped to 1.49 million during the latest quarter, an increase of 9 percent compared to the same period in 2017.One of the concerns for Facebook during Q2 2018 was its user growth numbers, which seemed to be slowing down, but it's not as if the company is on a complete downward spiral. In Q1 2018, for example, it reported 2.20 billion monthly active users and that's now 2.27 billion as of September 30th, 2018. That's 70 million new monthly active users in less than a year. Still, Facebook (and Wall Street) probably wish those figures were growing at a faster pace.\"Our community and business continue to grow quickly, and now more than 2 billion people use at least one of our services every day,\" Mark Zuckerberg, Facebook founder and CEO, said in a press release. In a conference call on Tuesday, he added that while Facebook \"may be close to saturated\" in the US and Europe (where growth has been relatively flat for much of 2018), there's still much room to expand \"quickly\" in developing countries.One interesting point Zuckerberg made during the call, along with Facebook Chief Operating Officer Sheryl Sandberg, is that the company sees private messaging and Stories as the future of its business. He said users are sending 100 billion messages per day across Facebook's family of apps, including Messenger and WhatsApp, and that 1 billion Stories are now being shared every day on services such as Instagram. Naturally, considering the state of Facebook's affairs, Zuckerberg and Sandberg also touched on privacy and security. \"Protecting peoples privacy is incredibly important because people and businesses will only use Facebook if they feel safe,\" said Sandberg. Zuckerberg said that, by the end of 2019, Facebook's security systems should be at the level it \"should be at,\" but he noted that right now the focus is to protect the upcoming US midterm elections. \"In a community of more than 2 billion people,\" Zuckerberg said, \"we will see all the good and bad that humanity can do.\"Images: GettyYou can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}