{"id": "\n\nEngadget\n\n\nUber applies for permission to test self-driving cars again", "paragraph": "Uber has published a Voluntary Safety Self-Assessment report in a bid to convince authorities to give it the go-ahead to test its self-driving vehicles on public roads again. The ride-hailing firm suspended all self-driving trials in March after a fatal crash in Tempe, Arizona killed a pedestrian. According to the National Transportation Safety Board, Uber's software detected the pedestrian six seconds before impact, but it didn't activate emergency braking until 1.3 seconds before the collision. The human backup driver was unfortunately distracted and streaming a show on their phone. Uber has since applied for permission to resume testing on public roads, and it's currently under review by the Department of Transportation. In his announcement post, Uber chief Dara Khosrowshahi said:\"We are deeply regretful for the crash in Tempe, Arizona, this March... We continue to support the National Transportation Safety Board's investigation into the Tempe crash. We have taken a measured, phased approach to returning to on-road testing, starting first with manual driving in Pittsburgh. We committed to deliver this safety report before returning to on-road testing in self-driving mode, and will go back on the road only when we've implemented improved processes.\"Seeing the company was responsible for the first death attributed to self-driving vehicles, it has to go through great lengths to get the DoT's authorization letter. A third-party firm will monitor the safety of back-up drivers in real time and set limits on the hours they can work per day. Uber has also tweaked its self-driving platform so that it can spot objects and people sooner -- and act more quickly, as well -- since an internal review determined that the company has to improve the overall design of its software.If and when it does get permission to start testing again, Uber will put two back-up drivers in the front seats instead of just one. Further, its automatic braking system will be active at all times to prevent something similar from happening again. You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}