{"id": "\n\nEngadget\n\n\nThe Lexus ES 300h is a chill luxury sedan", "paragraph": "There's something to be said about comfy. Your favorite pillow or blanket might not be the best on the market, but they make you feel better. Even if it has a pizza stain that's shaped like Ohio. The Lexus ES 300h (starting at $41,410) is like a comfort blanket. It's cozy, quiet and it looks nice. It grows on you. As long as you don't get frustrated dealing the infotainment system trackpad. A comfortable luxury sedan that looks great inside and out. The hybrid system will deliver MPGs at the very least in the high 30s. The infotainment display is gorgeous, too bad it’s connected to an annoying touchpad. The lane keep assist could also do with some updating. At its core, the Lexus ES 300h is a very fine luxury hybrid, one that the company says offers 44 miles-per-gallon in combined driving. Typically when an automaker says 44 miles-per-gallon, I'll get about 35 during real-world testing (in mixed driving environments). In the ES 300h though, I managed an average of 39.5 miles-per-gallon while driving on the highway, back roads (in sport mode) and surface streets. In other words, the 43 city and 45 highway ratings are pretty dead on if you're not pushing a car to test its suspension, brakes, etc. like I was.That shouldn't be too big of a surprise, considering Toyota (the parent company of Lexus) has been building hybrids for decades and the automaker has gotten really good at it.The ES 300h is powered by a 2.5-liter four-cylinder engine and two electric motors. The combined output is 215 horsepower and 267-foot-pounds of torque, that gives the car a drowsy zero to 60 time of 8.1 seconds.Combine that with a suspension that's better suited for cruising than sharp twists and turns and it's clear that the ES 300h is not meant to compete with luxury sport sedans or even sporty hybrids -- it's about luxury and comfort which it excels at. Lexus even goes one step further than most luxury vehicles by reducing an insane amount of sound coming into the cabin. The result is a quiet ride either in town or on the highway, like driving a nice cocoon that shields you from the chaos of the world.That reduction in outside mayhem goes well with the cushy seats in the front and back, which are like sitting on pillows while driving down the road. In fact, the luxury extends to most of the rest of the interior. The wood line that extends from the doors across the dash is a nice accent to the elements that house the climate control buttons which, in turn, are smartly arranged in a straight line below the huge 12.3-inch infotainment display.That's where things get weird. The infotainment system layout is adequate at best, but the design feels antiquated which isn't that big of a problem. Most car infotainment systems could do with a redesign but it's how you interact with it that's troublesome. The Remote Touch Interface (RTI) pad works like the trackpad on your laptop. You move your finger and tap to select and that works great on a computer, less so in a car. I caught myself looking at the display far too long to figure out where the pointer was in relation to the feature I wanted to select. On more than a few occasions I missed the target completely and selected something else.Fortunately, it at least has haptic feedback, which is nice, but I'd prefer if Lexus went with a system that maps the trackpad to match the display. If my finger is in the top right-hand corner, that's where I'm selecting.The display where all this is happening is gorgeous and, at 12.3 inches, huge and very easy to read. It also supports Apple Carplay but not Android Auto -- a bummer for team green. That said, there is support for Alexa via Android devices, so you can use Alexa's voice commands in the car (which is actually better than dealing with the trackpad). I really don't like the trackpad.Like most luxury vehicles, the ES 300h has a driver's assistant suite that includes adaptive cruise control and lane keep assist. The cruise control was smooth and while it creates more space between itself and the vehicle it's tracking than other cars I've driven, it worked great and was extremely smooth at take off and stopping -- even when another automobile merged into our lane.The lane keep assist was less polished. The car did more ping-ponging (bouncing back and forth between the lane's lines) than expected and sharper highway turns were more than the system could handle. On this front, Lexus is a bit behind other luxury brands. But, as with all these systems, ultimately, they're there to help, not drive for you. In other words, keep your hands on the wheel.Meanwhile, the focus of the Lexus ES 300h should not be on sportiness. It's a comfy luxury car with outstanding mileage, a clean design, and a handsome interior. But the chill fades when dealing with the touchpad for the infotainment system. It's the pizza stain on the favorite blanket. It's not a deal breaker, but you do wish it wasn't there.When not reporting about technology and cats, Roberto spends his time surfing, snowboarding, playing in too many bands and trying to figure out where he left his MagSafe 2 adaptor. You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}