{"id": "\n\nEngadget\n\n\nTwitter tests status updates and ‘ice breaker’ tweets", "paragraph": "Last month, Twitter CEO Jack Dorsey told the House Committee on Energy and Commerce that one of his company's goals is to \"increase the health of public conversation\" on its platform. And it's a talking point Twitter has come back to throughout the year. In March, it reached out to experts for ideas on how to promote healthy, open and civil conversations online and in September, the company sought feedback on a proposed policy that would ban dehumanizing speech. Now, the company is testing a handful of new features aimed at encouraging users to talk to each other.hey Twitter. we've been playing with some rough features to make it feel more conversational here. presence and reply threading. still early and iterating on these ideas. thoughts? pic.twitter.com/3U3NvpHWPyThe company showed the features to The Verge, noting that it hasn't finalized their designs or decided if they'll even be rolled out. The first is one that Twitter's director of product management, Sara Haider, previewed on Twitter in August. It's a tweak to how conversations are laid out, with tweets from the original poster in one color, replies in another and responses threaded and indented. The current prototype highlights tweets from users you follow in a separate color as well.Secondly, Twitter is considering making the reply option on a tweet more obvious. Rather than just the conversation bubble icon, each tweet might also have its own reply field. Additionally, the company is also exploring the option of \"ice breakers.\" If a user wants to encourage conversations on a certain topic, the feature would let them pin an \"ice breaker\" tweet to their profile, which would serve as a sort of prompt as to what that person wants to talk about in that moment.And lastly, Twitter is testing two different status indicator features. The first is the traditional option, with users being able to indicate when they were on Twitter, which was reported previously. The other is a more detailed status that could let other users know what you were up to at the time. So, for example, you could update your status to say that you were at a certain event or that you're currently traveling in a different city.It's interesting that Twitter is showing off these features ahead of a launch, but Haider told The Verge the company is doing so because it wants to know what people think. \"Coming up with a product in a silo and dumping it on people is not going to work,\" she said. \"Some people are going to love it it. Some people are going to hate it. We want to understand what people's feedback is, and then tweak and iterate on the product.\"Images: Twitter via The VergeYou can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}