{"id": "\n\nEngadget\n\n\nApple’s laptop line is more of a mess than ever", "paragraph": "Imagine that you've got $1,300 and you'd like to buy a new Apple laptop. Which one do you choose? The $1,299 MacBook, the new $1,199 MacBook Air or the cheapest MacBook Pro, which also retails for $1,299. If you really want TouchID then you'll opt for the Air, but if you're looking for the \"best\" then the Pro is the only answer. Not that you'd understand that from the price list, thanks to Apple's crushing inability to properly differentiate its products.Apple's cluttered product lineup is hardly a new problem, but the situation with its laptops is now getting a little bit silly. The company is selling three laptops at roughly the same price with little beyond potential battery life to differentiate them. For instance, of the trio, two are considered for the \"thin and light\" crowd, offering small size at the expense of power. But the smaller of the pair costs $100 more, despite having a slower CPU and weaker graphics.The revived MacBook Air, meanwhile, makes the MacBook look like even more of a misstep than it was before. After all, unless you're seriously hankering for a laptop that small, why not just buy its far-better sibling? If the 12-incher was sold for, say, $899, then it would be much easier to take it seriously. And that price isn't an unreasonable proposition, either, since the 11-inch MacBook Air sold for that much before its axing.Then there's the fact that if you're looking for a thin and light Apple laptop, the MacBook Pro is hardly deadweight. The 13.3-inch model is the same width as the Air and technically narrower since it doesn't taper. (The new Air runs from 0.16 inches to 0.61 inches, whereas the Pro is consistent 0.59 inches, fact fans.) And there's only 0.27 pounds difference in weight between the two as well.The MacBook Air was popular because it was one of Apple's most affordable machines: a sub-$1,000 machine, ideal for students, travelers and everyone on lower / middle incomes who couldn't splash out for something more. Not to mention that its size and speed, built-in SD card reader and reliability made it popular with journalists.Put all three of Apple's cheapest laptops side by side and it's hard to make a case for at least one of them. You could say that the company has trapped itself, unable to lower the price of its notebooks too low for fear of cannibalizing iPad sales. After all, the company is now positioning the iPad Pro as its affordable laptop alternative. And if you look at Apple's average selling price for Mac hardware over time, you'll see the numbers going up, not down. It seems like folly not to knock a few hundred dollars off some of those models and stop them pointlessly clustering around the same corner.Follow all the latest news from Apple's fall 2018 event here!After training to be an intellectual property lawyer, Dan abandoned a promising career in financial services to sit at home and play with gadgets. He lives in Norwich, U.K., with his wife, his books and far too many opinions on British TV comedy. One day, if he's very, very lucky, he'll live out his dream to become the executive producer of Doctor Who before retiring to Radio 4.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}