{"id": "\n\nEngadget\n\n\nThe Morning After: 'Diablo' goes mobile and Google employees walk out", "paragraph": "Hey, good morning! You look fabulous.Welcome to your weekend! While Google employees got in formation, Blizzcon 2018 kicked off, and we reviewed RED's Hydrogen One smartphone. We'll also take a look back at other big stories from the last week including what we think of Apple's newest Macs and iPads, plus an impress electric race car concept that's on display at SEMA.Read the room.'Diablo Immortal' brings Blizzard's action RPG to iOS and AndroidThe big Diablo announcement from Blizzcon is the first mobile game in the series, dubbed Immortal. Blizzard working on the game with China's NetEase, and pre-registration for a beta is open now. There's already a gameplay trailer, and the team seems to be blending traditional gameplay with that of various action RPG clones already available on mobile. The only problem? Fan reaction. While Blizzard has said it's working on multiple Diablo projects, a mobile launch isn't exactly what people were expecting to see first.Nearly 4,000 at its Mountain View HQ alone.Google Walkout protest included 20,000 participants FridayAccording to its organizers, a protest put together over the last week pulled together 20,000 workers in 50 Google offices around the world who walked out at 11:10 AM local time yesterday. Open Research Group founder Meredith Whittaker said: \"Google paying $90M to Andy Rubin is one example among thousands, which speak to a company where abuse of power, systemic racism, and unaccountable decision-making are the norm.\" Google CEO Sundar Pichai will meet with his leadership team Monday \"to review a plan that would address the demands.\"Hope you like USB-C -- because that's all this one has now.Apple finally put a retina display in the MacBook AirFirst and foremost, the new MacBook Air has a retina display. The giant aluminum bezel is gone, but the screen remains 13.3 inches. The full resolution is four times what the original Macbook Air had, which works out to 2,560 by 1600. According to Dana Wollman, \"The new Air is basically a mash-up between the 12-inch MacBook and the larger MacBook Pros.\" With those changes comes a bump in price -- these start at about $1,200 to get a Core i5 processor, 8GB of RAM and (sadly) only 128GB of storage, and they will arrive November 7th.Bad PasswordDear tech: Stop doing business with NazisIt only takes 4chan haters telling PayPal that ASMR creators might be making sex noises to get their accounts instantly banned. And yet, despite nearly a year of warnings from groups like Deplatform Hate, it continued doing business with \"Gab\" until last week.Remember the EVO 3D?RED Hydrogen One review: Mediocre cameraphone, extraordinary price tagThis is an Android phone all about 3D. There are 3D cameras on the front and back, and you can watch 3D movies on what the company calls a \"4V\" display. Unfortunately, it also has 2017-era specs, bloatware and unfinished camera software to go with a $1,295 price.Even with new vapor chamber cooling, the phone itself still gets pretty hot.Razer Phone 2 review: Strictly for gamersIf you prioritize gaming above all else, then Razer's Phone 2 is worth a look. Others, however, might want to look elsewhere.The Morning After is a new daily newsletter from Engadget designed to help you fight off FOMO. Who knows what you'll miss if you don't Subscribe.Craving even more? Like us on Facebook or Follow us on Twitter.Have a suggestion on how we can improve The Morning After? Send us a note.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}