{"id": "\n\nEngadget\n\n\nVerily shelves its glucose-monitoring contact lens project", "paragraph": "In 2014, Verily, Alphabet's life sciences subsidiary, teamed up with Alcon to develop a contact lens that could measure glucose levels in tears. The idea being that diabetics would have an easier, less invasive way of keeping track of their glucose levels. But the companies have now decided to shelve that project, as their work has shown that it's actually quite difficult to obtain consistently accurate measurements of glucose from tears.\"In part, this was associated with the challenges of obtaining reliable tear glucose readings in the complex on-eye environment,\" Verily CTO Brian Otis said in a blog post. \"For example, we found that interference from biomolecules in tears resulted in challenges in obtaining accurate glucose readings from the small quantities of glucose in the tear film. In addition, our clinical studies have demonstrated challenges in achieving the steady state conditions necessary for reliable tear glucose readings.\"However, Verily will move forward with two other lens projects. Alongside its glucose-monitoring contact lens work, it has also been working on a smart accommodating contact lens for presbyopia (age-related farsightedness) as well as an intraocular lens to help improve eyesight after cataract surgery. And the company says it's also still working on technology for diabetes management, including miniaturized continuous glucose monitors that it's developing with Dexcom.\"We're looking forward to the next phase of development on our other two Smart Lens programs with Alcon, where we are applying our significant technical learnings and achievements to prevalent conditions in ophthalmology,\" said Otis.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}