{"id": "\n\nEngadget\n\n\nPeople want self-driving cars to prioritize young lives over the elderly", "paragraph": "Today, MIT released the results of a global survey on the moral and ethical decisions that autonomous vehicles should be programmed to make. The survey reveals that general preferences include prioritizing human lives over animals, younger and healthier people over the elderly and saving more lives over fewer lives. People also preferred to spare bystanders (who were obeying the law) over jaywalkers.The study is unique because of its sheer scale; over 2 million people from 200+ countries participated in the survey. It presented variations the \"Trolley Problem,\" a classic ethical dilemma that asks participants to choose who to save in the event that an out-of-control trolley is endangering people. When it comes to autonomous vehicles, the software may have to prioritize whether to swerve into a group of people to avoid a head-on collision or decide whether to save its own passengers at the expense of lives in another vehicle.While the survey results revealed general preferences, there were variations and trends based on where respondents were from. \"The main preferences were to some degree universally agreed upon,\" lead author Edmond Awad, a postdoc at MIT, said in a release. \"But the degree to which they agree with this or not varies among different groups or countries.\" An example is that in \"eastern\" countries, including many in Asia, respondents were not in favor of prioritizing young lives over the elderly.The full results of the study will be published in the journal Nature. It will be interesting to see if autonomous vehicle programmers take results into account when determining the ethical and moral preferences of the vehicles they are working on.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}