{"id": "\n\nEngadget\n\n\nFaraday Future co-founder reportedly resigns amid job furloughs (updated)", "paragraph": "Faraday Future's struggles only appear to be getting worse. The Verge has obtained an email indicating that company co-founder Nick Sampson (above) has resigned, effective immediately. And he didn't mince words, according to the report. Faraday is \"effectively insolvent\" after the funding dispute with China's Evergrande, he said, and would \"limp along\" under the best of conditions. There were \"insurmountable barriers\" to overcoming the situation, Sampson added.The company is also taking further cost-cutting measures, according to another email from CEO Jia Yueting. Anyone who started working at Faraday after May 1st is on a mandatory furlough (unpaid leave) through at least December. Current and previous workers also note that salaried workers employed before May 1st will have to settle for $50,000 per year, while hourly workers who've been around for at least six months would have to accept minimum wage.Sampson referenced the furloughs in his email, according to the report, warning that they would \"basically shut down the company.\" That might just be true, assuming the report is accurate. It's easy to see many people quitting to get back to their old pay schemes, or even to make ends meet.We've asked Faraday for comment. The move comes one day after senior technology VP Peter Savagian left the company, however, and leaves Jia Yueting as the only remaining founder. Provided the situation is as grim as it sounds, the automaker doesn't have many options unless it finds a savior with plenty of cash.Update 4:06PM ET: Faraday Future has confirmed the departures of Sampson and Savagian as well as the furloughs, describing the unpaid leave as an \"interim period\" between November and December while it \"vigorously\" pursued funding.  Employees will still get health care benefits, it said.  You can read the full statement below.\"We can confirm the recent departures of Peter Savagian, SVP, Global Product and Technology and Nick Sampson, SVP, Product Strategy – we wish them the best of luck in their future endeavors.\"As you may know, recent actions taken by Evergrande is causing FF to experience extraordinary financial hardship. The investor has intervened in the Company's capital planning and is preventing FF from utilizing our assets, which requires FF to take some very difficult yet necessary actions.\"FF received a favorable ruling in its arbitration against Evergrande last week and may now seek funding from other sources, which FF is actively pursuing, although this process will take some time.During this interim period, FF is requiring certain employees to take an unpaid leave of absence (furlough) for the months of November and December and is offering other employees the option of taking the furlough for the same period of time. Employees who joined FF after May 1 must take a furlough. For those employees who started with FF before May 1, they may continue to work their regular schedule at a reduced level of compensation. All employees will continue to receive healthcare benefits if they previously received benefits from FF.\"This was an extremely tough decision to make, and we recognize the emotional stress and financial strain this puts on people's personal lives. We are grateful to all of the hundreds of employees who are willing to stay and continue to work on the FF 91 core project, as well as those who will be on a temporary furlough. In addition, we take our relationship with our suppliers seriously, and we hope to receive support and understanding from our global partners as FF overcomes our difficulties.\"FF anticipates the furlough to last through the end of December 2018. However, the actual length of this furlough depends on the funding plan that is being vigorously pursued. We continue to push forward to find additional funding from investors globally as we strive to retain our people and our suppliers.\"We take pride in our close-knit community, and we are mindful of the impact these changes will have on our employees and their families. FF was born to disrupt and we are committed to making progress towards our goals, and continuing the necessary investments in our people, our products, technology, and business to develop an industry-leading connected mobility ecosystem without compromising our core values.\"You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}