{"id": "\n\nEngadget\n\n\nSpotify officially lets artists submit songs for playlist consideration (updated)", "paragraph": "Spotify now believes it's fully ready to give artists a shot at stardom through its well-known playlists. After a beta test in the summer, the streaming music service has officially opened its playlist submissions to all musicians. An up-and-comer now has a real chance of reaching a playlist editor and having their new song stream to millions of people (no, offering money won't increase your chances). These inclusions have a real impact, according to the company -- at least some of those who made the cut saw tangible improvements in their streaming numbers.More than 10,000 artists had their tunes reach playlists for the first time, Spotify said, with some seeing huge jumps in monthly listener counts. Gustavo Bertoni's monthly listeners jumped from 7,000 to 617,000, while Yonaka climbed from 82,000 to 290,000.The move could be good news for artists determined to break through. Like with most services, Spotify previously limited playlist selections to their curators. It was hard to make the grade unless you were either a major artist or fortunate enough to get noticed. However, the feature also shows how difficult it is to hit the big time on Spotify when you're not a superstar -- you practically need that playlist presence to become reasonably popular and generate a significant amount of revenue from streams. As much as Spotify has done to simplify publishing and increase exposure, its service still isn't an easy place to make a living.Updated 3:20PM ET: Spotify told Engadget that submissions were open to all artists during the beta, rather than just a selection as we'd heard earlier. It's just that submissions are now official. We've updated the story accordingly.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}