{"id": "\n\nEngadget\n\n\nNetflix will test a cheaper pricing tier, possibly in Asia", "paragraph": "Netflix is exploring ways to bring more subscribers into the fold, and it's set to test a cheaper version of its streaming service. CEO Reed Hastings confirmed the plans to Bloomberg, and while it's not clear where or when such a trial would take place, Asia seems the most likely region.The company is hoping to make further inroads into the continent, to which it expanded a few years ago, but it's currently more expensive than many other streaming services in the region. Many of Netflix's rivals in Asia have both free and paid versions, while the ad-supported YouTube is enormously popular across the continent.To help it build interest among potential subscribers, Netflix is developing more than 100 projects in Asia, and it just announced a string of shows and movies from five countries across the region. Hastings has suggested his company could hit 100 million Indian subscribers -- it currently has more than 130 million subscribers worldwide, though it reportedly has yet to break the two-million barrier in any Asian nation. However, he told Reuters that Netflix doesn't have plans for cheaper pricing in India.When the company rolls out the pricing test, it's unlikely to lower the prices of its existing plans. Instead, it seems it will introduce a lower-cost tier, offering an alternative version of its service with different features than the other plans.Meanwhile, some analysts suggested that Netflix is in a strong position to actually raise prices, citing a survey indicating most subscribers think the quality of Netflix's shows and movies has improved. \"Oscar nominations for upcoming Netflix films would, no doubt, have a favorable impact on existing and potential subscribers' view of the content being made available to them,\" Piper Jaffray also noted in its note to investors. Several movies in Netflix's fall slate, including Roma and The Ballad of Buster Scruggs, are pegged as awards contenders.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}