{"id": "\n\nEngadget\n\n\nHTC's standalone Vive Focus will soon get 6DoF VR controllers", "paragraph": "While Facebook's Oculus Quest won't arrive until the spring of 2019, its seemingly beefier inside-out tracking plus 6DoF controllers may already pose a threat to HTC's Vive Focus, as well as to other Vive Wave-based standalone VR headsets -- including Pico's Neo (whose ultrasound-based 6DoF controllers are still missing) and the more recent G2.As such, HTC's first order of business is to release a developer kit for adding not one, but two 6DoF controllers to substitute the Vive Focus' single 3DoF controller -- one that relies on software to simulate a 6DoF feel, but also often requires re-centering.At the World Conference on VR Industry in Nanchang, China today, HTC announced this new \"Vive 6DoF Developer Kit\" which includes a pair of 6DoF controllers, plus a tracking attachment that goes on top of the Vive Focus. Much like how developers can port their two-handed VR experiences to single-controller VR headsets via Vive Wave, this time they can even preserve two-handed controls thanks to this dev kit.In a video clip provided by HTC's China President, Alvin Wang Graylin, the 6DoF controllers appear to respond well even with his wide range of movements -- he has incredibly long limbs -- in Beat Saber, though I would have liked to see him try a faster song just to push the hardware a little further.For some reason, Graylin and his company are staying mum on how the 6DoF controller tracking works here. All we can see is the circular object on top of each controller, and the attachment gently bulges around a good part of the headset's main body -- likely for ensuring maximum coverage for tracking both controllers.It's worth noting that since this is only a dev kit for Vive Wave developers, it's unclear whether consumers will eventually be able to make the same upgrade to their existing Vive Focus headsets. Even if that is the case, the commercial version may have a different design. Regardless, this is a good sign of what's to come for the Vive Focus and similar standalone 6DoF VR devices.Until now, the Vive Focus has only been made available in China, and HTC's also opened a flagship store in Shenzhen to help push its VR products. Meanwhile, the company is about to offer its Vive Focus to business customers in Japan starting from October 30th. But if all goes well, HTC should still be pushing for an international rollout some time this year, especially with all the handy updates plus upcoming accessories made just for this headset.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}