{"id": "\n\nEngadget\n\n\n'Warcraft III: Reforged' modernizes another real-time strategy hit", "paragraph": "Blizzard isn't about to stop its trip down memory lane with a remaster of the original StarCraft. The studio has unveiled Warcraft III: Reforged, a top-to-bottom refresh of the landmark real-time strategy title and its Frozen Throne add-on. As Blizzard is updating a 3D game this time around, there's a lot of room for improvement: the company has redone all the characters and environments in much greater detail, complete with reworked in-game cutscenes. You'll also find a modernized interface (including an updated World Editor), up-to-date multiplayer match creation and \"hundreds\" of gameplay tweaks.The Reforged version arrives sometime in 2019 for $30 in a standard release and $40 for a Spoils of War Edition that provides both special hero skins as well as perks in other games, like characters in Heroes of the Storm, a special Hearthstone card back and a Meat Wagon mount in World of Warcraft.There are only likely to be so many updates to classic games, but Warcraft III is arguably as influential as StarCraft was. It's not just that this was Blizzard's first 3D release, either. It added a level of storytelling that you didn't normally see in real-time strategy games at the time, and represented a more accessible and flexible multiplayer experience. Remember, the first Dota (Defense of the Ancients) was a Warcraft III mod -- arguably, the entire MOBA genre wouldn't exist if it weren't for this game and its strong editing tools.Jon has been hooked on tech ever since he tried a Compaq PC clone when he was five. He's big on mobile and is one of those precious few people who wears his smartwatch with pride. He's also an unapologetic Canadian: Don't be surprised if you get an earful about poutine or the headaches with Canadian carriers.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}