{"id": "\n\nEngadget\n\n\nSenate bill takes aim at illegal robocalls", "paragraph": "Three senators have proposed new legislation aimed at deterring robocall scams. The Telephone Robocall Abuse Criminal Protection, or TRACED, Act would give the FCC broader authority to penalize those that violate telemarketing restrictions, give the commission a longer window in which to act and establish an interagency working group that would explore additional actions that might deter robocall scams going forward.\"As the scourge of spoofed calls and robocalls reaches epidemic levels, the bipartisan TRACED Act will provide every person with a phone much needed relief,\" Senator Ed Markey (D-MA), a cosponsor of the proposed legislation, said in a statement. \"It's a simple formula: call authentication, blocking and enforcement, and this bill achieves all three.\"With this legislation, the statute of limitations on penalties for robocall violations would be extended from two years to three, and the FCC would be instructed to propose new rules aimed at protecting individuals from receiving calls or messages from those using unauthenticated numbers. Further, an interagency working group -- which would be made up of both federal agencies and state entities such as the Departments of Justice, Commerce, State and Homeland Security, the FCC, the FTC, the Consumer Financial Protection Bureau and state attorneys general -- would be tasked with providing Congress with recommendations regarding both prevention and prosecution of robocall violations as well as strategies for how federal agencies might implement those recommendations.Additionally, the TRACED Act would require the FCC to ensure voice service providers implement call authentication frameworks that can verify incoming calls are legitimate before they reach consumers.\"The TRACED Act targets robocall scams and other intentional violations of telemarketing laws so that when authorities do catch violators, they can be held accountable,\" said Senator John Thune (R-SD), who introduced the bill. \"Existing civil penalty rules were designed to impose penalties on lawful telemarketers who make mistakes. This enforcement regime is totally inadequate for scam artists and we need do more to separate enforcement of carelessness and other mistakes from more sinister actors.\" Senator Roger Wicker (R-MS) cosponsored the bill.In the last year, the FCC has approved new rules targeting robocalls that spoof caller ID information and urged voice providers to begin validating calls before they reach recipients. \"Combating illegal robocalls is our top consumer priority at the FCC,\" Chairman Ajit Pai said in a statement earlier this month. \"That's why we need call authentication to become a reality -- it's the best way to ensure that consumers can answer their phones with confidence. By this time next year, I expect that consumers will begin to see this on their phones.\" In May, the FCC issued a robocall operator responsible for 96 million automated calls a $120 million fine.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}