{"id": "\n\nEngadget\n\n\nThe Morning After: Netflix cancels 'Luke Cage'", "paragraph": "Hey, good morning! You look fabulous.Welcome to your weekend! Friday night brought a successful rocket launch and some bad news for another Marvel hero on Netflix. Also, we'll take a look at Tim Cook's request to Bloomberg, and take a ride in Audi's new A8.Heroes for hire.Netflix cancels 'Luke Cage' a week after dropping 'Iron Fist'Bad news for Luke Cage comes on the same day Netflix premiered season three of Daredevil, which was the first of its Defenders TV shows to launch in a partnership with Disney and Marvel. Additional seasons of Jessica Jones and The Punisher have already been ordered, but with Disney set to premiere its own streaming service next year, it seems like the two companies are already pulling further apart when it comes to licensing content.Tim Cook speaks out.Apple CEO calls on Bloomberg to retract China surveillance reportEarlier this month, Bloomberg reported that San Jose-based server company Super Micro installed surveillance micro-chips in the Chinese data center hardware of up to 30 companies, including Amazon and Apple. Now, Apple CEO Tim Cook is calling on the well-reputed publication to retract its story altogether, according to BuzzFeed News.Well that doesn't seem sinister at all.Watch Boston Dynamics' SpotMini robot twerk to 'Uptown Funk'Instead of a highlight workout video (or just one showing a robot at work), Boston Dynamics took an all-new tack with its latest YouTube post: a Spot robot dancing to Bruno Mars.But no Level 3 autonomy -- yet.2019 Audi A8 review: An evolution in luxury and techThe A8 is Audi's premier sedan. With it, the automaker is introducing an enormous amount of tech. Bumper to bumper, the car is dripping with new features. There's an updated infotainment system that's easier to use, new driver assists with help from a laser scanner, plus suspension that can lift or lower the car on the fly for comfort or safety.You can still order it 'off menu' for an extra $5,000.Tesla shelves the full self-driving option you couldn't useEver since Tesla hinted at its autonomous future, there's been a \"Full Self-Driving Capability\" checkbox on the order page for its cars -- spend several grand and your car would one day steer itself. It has yet to materialize, though, and now Tesla has removed the option from its site.Is it time to upgrade?Pixel 3 and 3 XL review: Google's hardware takes a backseat to softwareThe Pixel 3's gorgeous new display and exquisite build make your photos, videos and games look so good you won't mind the $150 price hike. Meanwhile, the Pixel 3 XL is a long-lasting, powerful flagship with a brilliant display, capable cameras and the best of Google's software smarts -- if you can get past its polarizingly deep notch.The Morning After is a new daily newsletter from Engadget designed to help you fight off FOMO. Who knows what you'll miss if you don't Subscribe.Craving even more? Like us on Facebook or Follow us on Twitter.Have a suggestion on how we can improve The Morning After? Send us a note.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}