{"id": "\n\nEngadget\n\n\nAfter Math: The best kind of falling star", "paragraph": "Gavin McInnes and his gang of Proud Boys, newly minted stars of the Alt-Right, took their first steps back toward irrelevancy this week when they got themselves banned from Facebook. At the same time, we've had to say goodbye to a pair of space-based telescopes (Kepler and Dawn), as they reached the end of their operational lifespans; Roscosmos blamed the recent Soyuz launch failure on a bent sensor pin and Apple announced that it would no longer report the sales numbers for the stars of its product lineup -- iPhones, iPads and Macs -- after it was reported that smartphone sales slumped six percent globally this year.\"A 10-ton truck traveling at 600 mph\": The US Navy showed off one of its newest toys this week, a nuke-hunting ballistic \"kill vehicle\" that knocks incoming missiles out of the sky through sheer force of physics. This is only the second time that the tests have been successful (two other attempts failed to connect) but that's still not bad for a prototype system described as being akin to \"a bullet shooting a bullet\".11 years: After more than a decade of service, NASA's Dawn spacecraft will not see another sunrise, having run completely out of fuel this week. Oddly, it wasn't the only space telescope to go dark, the Kepler mission came to a similar conclusion after expending the last of its hydrazine fuel source.6 percent: Turns out that despite there being seven billion of us, the worldwide market for smartphones is indeed finite. Global handset sales dropped by 6 percent over the last 3 months, which could explain why Apple is suddenly so reluctant to share its own sales numbers.$81 million per seat: It's no small feat getting crew and cargo up to the International Space Station, so when things go wrong with the Soyuz launch system, as they did earlier this month, technicians literally pore over the craft to see what went wrong. In this case it was a bent sensor pin that caused the launch failure. Luckily, nobody was hurt during the abort and Russia already has a backup launch scheduled for the start of December.$60,000: That seems like an awful lot of money to offer a person to recommend your gimmick product to their million-plus Instagram followers, then sue them for when they don't do it, but hey we're clearly living in the end times where being an \"influencer\" is a real job, so sure, why not.Comments to this article have been closed due to multiple violations of our rules and guidelines including name-calling, insults and off-topic conversation.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}