{"id": "\n\nEngadget\n\n\nWhat’s coming to Netflix in November: ‘House of Cards’ and 'Narcos’", "paragraph": "November's right around the corner, which means we're gearing up for winter and Netflix is about to serve up some new shows and films. Among the Netflix originals returning this month is the sixth and final season of House of Cards (November 2nd), the latest collection of The Great British Baking Show (November 9th) and the Narcos follow-up, Narcos: Mexico, which features a new location, new agents and a new cartel (November 16th). On November 9th, we're also getting Outlaw King, the Netflix original film starring Chris Pine as Scotland's Robert the Bruce.Also on the way is the Chuck Lorre-produced comedy The Kominsky Method, starring Alan Arkin and Michael Douglas. In the series, which debuts November 16th, Douglas plays a briefly successful actor turned acting coach and Arkin plays his friend. Additionally, if The Great British Baking Show doesn't satisfy your cooking needs, Netflix is debuting its competition show The Final Table, hosted by Bon Appétit editor Andrew Knowlton. That drops November 20th. This month you'll also be able to catch Mystery Science Theater 3000: The Gauntlet (November 22nd), the She-Ra and the Princesses of Power reboot (November 16th) and the latest season of the animated series F is for Family (November 30th).As for original films, Netflix is releasing the Coen Brothers' The Ballad of Buster Scruggs on the 16th. Originally conceived as an anthology series, the film features six stories about the American frontier. It's also releasing Orson Welles' unfinished film The Other Side of the Wind, which has now been completed and restored, as well as a documentary on the film called They'll Love Me When I'm Dead. Both hit Netflix November 2nd. A handful of comedy specials are also on the way including one each from John Leguizamo (November 5th) and Trevor Noah (November 20th). And, naturally, Netflix is releasing a few holiday-themed films as well.The beginning of month also brings a slew of newly added non-Netflix originals, including Bram Stoker's Dracula, Alfonso Cuarón's Children of Men, the classic sci-fi film Close Encounters of the Third Kind, Cloverfield, Good Will Hunting, Sex and the City: The Movie and Sixteen Candles. Later in the month, you'll also be able to stream Pirates of the Caribbean: At World's End (November 4th), The Break-Up (November 16th) and The Pixar Story documentary (November 18th).Of course, as new content arrives, some must go. On the chopping block at the start of the month is Amelie, Jurassic Park and Jurassic Park III, The Lost World: Jurassic Park, Steel Magnolias, Oculus and Up in the Air. Also on the way out is Anna Karenina on the 12th, Paddington on the 16th and the first five seasons of Undercover Boss on the 17th.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}