{"id": "\n\nEngadget\n\n\nAsk Engadget:  Which USB-C mic will improve my vacation videos?", "paragraph": "The support shared among readers in the comments section is one of the things we love most about the Engadget community. Over the years, we've known you to offer sage advice on everything from Chromecasts and cameras to drones and smartphones. In fact, our community's knowledge and insights are a reason why many of you participate in the comments.We truly value the time and detail you all spend in responding to questions from your fellow tech-obsessed commenters, which is why we've decided to bring back the much-missed \"Ask Engadget\" column. This week's question comes to us directly from the comment section of our articles. Weigh in with your advice in the comments -- and feel free to send your own questions along to ask@engadget.com!Does anyone have any advice on good, portable USB-C mics? I'm not a vlogger, but might find this useful to have on vacation to film short videos with good audio.Billy SteeleSenior News EditorUnfortunately, USB-C isn't a standard option when it comes to microphones, specifically in regards to the included cables. There are plenty of Lightning options and either snap onto an iOS device or connect with a cord. A number of models will also connect to mobile devices via 3.5mm audio jack. However, with USB-C, it takes some extra work.Most of Blue's mics still only do USB-A, but you can buy an adapter. In the case of the new Yeti Nano, you would need micro USB to USB-C cable or USB-A to USB-C adapter to use with the provided cable. Blue doesn't sell these, but a spokesperson confirmed there's no loss of functionality or audio quality.That being said, Yeti Nano and the Snowball line would be solid choices. I also really like the Raspberry for how compact it is and the IAD tech that focuses on your voice. Raspberry does include a Lightning cable, for what it's worth. If you want something else that's all-inclusive, the Apogee MiC+ comes with a USB-C cable -- no adapter required. But it's pricey.All products recommended by Engadget were selected by our editorial team, independent of our parent company, Oath. If you buy something through one of our links, we may earn an affiliate commission.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}