{"id": "\n\nEngadget\n\n\nMicrosoft briefly tested ads in the Windows 10 mail app", "paragraph": "It's bad enough when your email inbox gets inundated with subscriptions and promotions you forgot you ever signed up for, but now Microsoft is thinking about injecting advertisements right into your inbox. According to Windows news site Aggiornamenti Lumia, the beta version of the company's Mail client for Windows 10 has been placing ads right at the top of the inbox -- though the company has since turned off the feature and claims that it was just an experiment.Bad news: Mail for #Windows10 is getting ads for non-office 365 subscribers! https://t.co/xDELzAClJq pic.twitter.com/gXkQXab5WrIn a now-removed FAQ page on Microsoft's support website (archived here), the company explains that it was running pilot program testing ads in Mail. The test countries included Brazil, Canada, Australia and India. Per the support document, the ads were visible on Windows Home and Windows Pro but not Windows Enterprise or Windows EDU. Ads were served to \"non-work accounts\" set up through the mail, including Outlook.com Gmail, and Yahoo Mail accounts. Users who have an Office 365 subscription -- which costs $7 per month or $70 per year -- linked to their email address were not shown ads.Despite the pretty detailed plan laid out in the support document, Microsoft's head of communications Frank Shaw tweeted today that the ads were \"an experimental feature that was never intended to be tested broadly\" and have now been turned off completely. The FAQ has also been removed from the company's website.It's unclear if the company will revive this plan to serve ads to people not paying for Office 365, but it's clearly put some thought into it. The company does need to pay the bills, and it did promise that it wouldn't scan the content of email to generate the ads, which sets it apart from Yahoo and AOL in that regard (Gmail no longer scans emails for ad purposes). That said, no one wants ads in their inbox.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}