{"id": "\n\nEngadget\n\n\nScoot will add locks to its scooters to combat theft and vandalism", "paragraph": "In August, San Francisco's Municipal Transportation Agency awarded two companies, Scoot and Skip, permits to operate their scooters in the city. The scooter pilot program has now been running for a month and Scoot says it has learned a few things during that time, including that its Kick scooters are a lot easier to steal and vandalize than it once thought. Because of that, the company will start adding locks to its scooters come December.Scoot says that in just the first two weeks of operating, more than 200 Kicks were stolen or damaged beyond repair. \"We treat our electric vehicles as precious assets that we carefully maintain, recharge and make available to our riders for as many years as possible so our riders can use them for fast, fun, affordable, green transportation,\" Scoot said in a blog post. \"The idea of putting vehicles on the street just to be stolen or vandalized is antithetical to Scoot's environmental and civic mission.\"The company said its upcoming Kick locks are similar to those that it deployed for its electric bicycles in Barcelona. It added that in the meantime, it's experimenting with other ways of securing its scooters in the hopes of keeping theft and vandalism down to sustainable levels.So far, Kicks are being used more often than Scoot's other shared vehicles, particularly in Santiago, and in San Francisco, Scoot and the MTA have received \"very few\" complaints regarding safe use of Kicks. \"Our goal is zero complaints, so we are listening to the community and correcting our riders who don't use our Kicks safely, and improving our instructions to avoid unsafe behavior in the future,\" Scoot said.The company noted that it would be bringing more of its scooters to both San Francisco and Santiago.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}