{"id": "\n\nEngadget\n\n\nApple says T2 chip can limit third-party repairs for recent Macs", "paragraph": "Yes, the reports were true -- Apple's T2 chip can potentially restrict third-party Mac repairs. The company confirmed to The Verge that the co-processor can limit third-party repairs for certain components on recent systems, likely including the iMac Pro and MacBook Air. Apple didn't provide a full list of affected parts or say which machines were covered, but the T2 could regulate repairs for the logic board (aka motherboard) and Touch ID fingerprint sensor.A leaked document from October indicated that the T2 regulates repairs on the 2018 MacBook Pro's display, logic board, top case and Touch ID system, and exerts similar control over the logic board and flash storage from the iMac Pro. In theory, you would need to run a special configuration software suite to successfully complete a repair, limiting repairs either to Apple stores or to authorized service centers.Theoretically. iFixit didn't encounter any lockouts when repairing a MacBook Pro, suggesting the T2's enforcement isn't necessarily active or covers a narrower set of circumstances than some suspected (used parts may work, as an example). The majority of repairs won't need the tool, Apple said.There are practical reasons why Apple might use the T2 chip to limit third-party repairs. The T2 processes secure boot keys and Touch ID fingerprint data, and Apple likely doesn't want thieves or spies installing parts that could harvest that information. It's why you can't easily replace the Touch ID sensor on iOS devices. There's also quality to consider: this could prevent a sub-par unofficial fix from creating headaches for technicians.Still, the confirmation isn't likely to please either unofficial repair shops or users willing to fix Macs themselves. They're concerned that this will both limit where you can go for repairs and potentially lead to paying more than necessary for crucial fixes. There's also the question of how this might clash with right-to-repair laws. Wouldn't it effectively break those laws by forcing you to turn to Apple or its partners for a fix? Whatever reasons Apple might have for its approach, it may have to compromise in the future.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}