{"id": "\n\nEngadget\n\n\nSpare a thought for the guy with Lightning headphones", "paragraph": "It was a questionable decision to opt for headphones that work with two devices. Nevertheless, I do love the Audeze iSINE 10s that I've used every day for the past year and a half. Sure, I can't charge and listen to music at the same time, but thanks to a Lightning cable feeding data and power to Audeze's in-line DAC, they sound fantastic on both my iPad and my iPhone. Unfortunately, I'm now stuck with some wonderful headphones that are roughly half as useful as they were yesterday, as Apple has just switched from Lightning to USB-C for its latest iPad Pros.When Apple first dropped the headphone jack, I argued that it wasn't that big of a deal for people who were used to paying audiophile prices for headphones. I had used a DAC to power headphones since the pre-Lightning iPhone 4, and there were already plenty of Lightning DACs on the market. Not to mention, companies like Audeze were pushing high-grade Lightning headphones. But here we are, two years on, and Apple is moving to USB-C for iPads, putting the future of the Lightning port in serious doubt.Whether the iPhone goes port-less entirely -- which has to be Apple's ultimate goal -- or switches to USB-C, the Lightning port's days are surely numbered. With MacBooks and iPads now on the same standard, it would be very unlike Apple to keep it alive.I just bought a new iPhone, so I'm probably going to have a Lightning port around for a year or two. But I am definitely going to pick up a new iPad Pro at some point over the next year.... What do I do with the iSINE 10s that Apple is still encouraging customers to buy for $399.95 in its stores?I don't really have a good answer for that. I imagine Audeze will sell a USB-C cable or adapter for them at some point, but unless iPhone switches over, that means awkwardly swapping cables when moving between the two devices. (I should probably mention that the iSINE 10s came with a regular headphone cable as well, but that they sound pretty average without the in-line DAC in the Lightning cable.)The answer, is, of course, to switch to a pair of Bluetooth headphones. There are some really good pairs out there now, and I'm sure I'll find one that's right for me. But \"you can just spend money to fix the problem\" doesn't really make this situation any better. Most Lightning headphones are expensive. Audeze's range starts at $199 and tops out at $2,495. People have shelled out huge amounts of money for headphones, and they now risk having that purchase being made obsolete.Aaron writes about design, technology, video games and whatever “culture” is supposed to be. In his spare time he enjoys scouring the world for beautiful furniture, taking long walks on the beach, training orphaned dolphins and making up facts about himself.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}