{"id": "\n\nEngadget\n\n\nThe new Mac Mini, in pictures", "paragraph": "Apple just wrapped a Mac-and-iPad event in Brooklyn, New York, and for most people, I suspect the refreshed MacBook Air and iPad Pro were the stars of the show. But for some of you, there was a more intriguing announcement in store: The Mac Mini, long neglected, has finally received some attention. The new model, announced today, has a brand new design, reminiscent of the Apple TV, with fresh specs to match, including quad- and six-core processors, up to 64GB of RAM and up to 2TB of storage. When it comes to ports, you've got four Thunderbolt 3 connections, two USB-A sockets, HDMI, audio and Ethernet (including a 10Gbps option).The machine is up for pre-order today starting at $799 (with much more modest specs, obviously) and ships next week, on November 7th. We spied some units on display here at the demo area set up at the event venue, but it's not like anyone gets to sit down and simulate real work on this thing. We won't pretend to be able to vouch for the performance, then. In the meantime, though, we thought it would be helpful to include some photos, especially shots at scale that show what this tiny thing looks like situated in a realistic desk setup. Have a look, and stay tuned for a proper review, hopefully sooner than later.Follow all the latest news from Apple's fall 2018 event here!Dana is the Editor-in-Chief of Engadget, where she runs a growing team of reporters and reviewers. She got her start in tech journalism a decade ago as a writer for Laptop Mag and the AP before arriving at Engadget in 2011. She appears regularly on ABC Radio and has also been a guest on Bloomberg TV, CNN, CNBC, Marketplace, NPR and Fox Business, among other outlets. Dana is a graduate of Wesleyan University and the Columbia Publishing Course. She lives in Brooklyn, New York.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}