{"id": "\n\nEngadget\n\n\nMicrosoft's 'record' quarter driven by big growth in Azure and gaming", "paragraph": "Microsoft just released financial results for the past quarter, the first quarter of its fiscal year, and the company's many different business units all appear to be firing on all cylinders. Overall revenue increased 19 percent year-over-year to reach $29.1 billion, while net income of $8.8 billion represented a 34 percent increase over the prior year. It's hard to point to one specific category behind the positive results, or even just a handful -- literally every segment Microsoft broke out in its earnings release showed positive growth.Amongst the categories most interesting to consumers, Surface product revenue grew 14 percent to $1.2 billion, while Xbox and gaming revenue was up a whopping 44 percent to $2.7 billion. A big part of that increase was Xbox hardware revenue, which increased 94 percent year-over-year. The company says that big jump is partially because of a low prior year as consumers waited for the Xbox One X, which was released the following quarter.One down point for the gaming division was Xbox Live subscribers, which sat flat at 57 million for the second consecutive quarter, down from the 59 million in its fiscal Q2 and Q3 earlier in the year. As for the Surface, given the big new product rollout happening in the current quarter, we figure that revenues should be up in a big way next time the company reports its financials.Overall, Microsoft's \"more personal computing\" segment grew 15 percent overall to $10.7 billion in revenue -- the biggest of Microsoft's main three categories it tracks. Other products from that group helping the bottom line included Windows \"commercial products and cloud services,\" which increased revenue 12 percent. More modest were the gains shown from Microsoft's Windows OEM business, which only grew revenues by three percent.While the Xbox and Surface units are more interesting to us here at Engadget, Microsoft continues to rake in huge money from its enterprise-focused \"intelligent cloud\" offering, of which Azure is a major factor. Indeed, server products and cloud services led to a 24 percent increase in Microsoft's intelligent cloud segment; total revenues for intelligent cloud were $8.6 billion. Azure revenue in particular increased 76 percent.As usual, CEO Satya Nadella will be speaking on a call with investors (starting at 5:30PM ET) and we'll update this post with anything notable he has to share.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}