{"id": "\n\nEngadget\n\n\nMarvel legend Stan Lee dies at 95", "paragraph": "Pop culture is in a state of mourning today. Stan Lee, the famous Marvel publisher, editor and writer, has died at the age of 95 after a spate of illnesses over the past year. To say that he had a significant impact on the media world would be an understatement -- the franchises he created (and helped create) are virtually ubiquitous in modern society, including in the digital realm.Lee got his start in comics in 1939, just ahead of service in the US Army, but he's best known for working with Jack Kirby, Steve Ditko and other legends to create a string of definitive superhero comics in the 1960s, beginning with Fantastic Four and including the likes of X-Men, Incredible Hulk, Iron Man, Daredevil, Thor and, of course, Spider-Man. It wasn't just that they were memorable characters -- it's that they were imperfect characters who had lives outside of their heroics and could serve as social commentary. He stopped writing comics in 1972, but his role as publisher and spiritual leader of Marvel lasted for much longer.There's little doubt that Lee's stories have had lasting effect on the media landscape, whether or not you've read the comics. They've been present in movies for decades (frequently with Lee in cameo roles), and the success of Marvel's early Cinematic Universe led Disney to acquire the company in 2009. It's going to be crucial to Disney's upcoming streaming service, too. Netflix, meanwhile, wouldn't quite be the same without its take on Daredevil and its own take on the Marvel universe. And then there's games -- while the track record for Marvel games is hit or miss, the new Spider-Man title is widely regarded as one of the best titles in any genre.It's also notable that Lee was frequently a fan of cutting-edge technology. He started an internet-based superhero studio in 1998 which, while short-lived, came well before online comic publishing hit the mainstream. He unveiled a YouTube channel in 2012, and was publishing digital-focused projects like God Woke and Backchannel in his final years. Simply put, he was eager to adapt to new formats throughout his life. He'll be sorely missed, but his legacy will likely live on for many years to come.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}