{"id": "\n\nEngadget\n\n\nCoord's new app will help catalog curb rules on city streets", "paragraph": "How often have you stared at a curb, unable to decipher whether you're allowed to leave your car there or not because the parking signs seem completely contradictory? That's just the kind of problem Coord is looking to solve. The company announced that its Surveyor system is now available for anyone to use in the US and Canada. It's aimed at organizations that are surveying American cities; the goal is to catalog as many curbs as possible and store the information in a digital database.The company wants to create a digital record of what activity you can do -- and what the rules are -- at any given curb across the US and Canada. To accomplish this, Coord originally wanted to use Google Maps to gather the data, assuming it would exist in some form within the platform. However, it didn't, and the cost of gathering it would have been prohibitively high.Instead, the company decided to build an app called Surveyor that anyone can use to catalog the street signs and curb rules on a particular block. To use it, a person marks down the beginning of a curb in the app, and then walks down it, taking pictures of signs, curb cuts, curb paint and other markers that indicate what you can and can't do on any particular block. Rather than using GPS, Surveyor uses the phone's accelerometer to track movement and is able to pinpoint where exactly each sign is relative to the curb.Surveyor isn't a free app, but right now you can get a one-month free trial. After you send in your cataloging data, you'll receive curb asset and regulation data in a fraction of the time it would take individuals with a pen and clipboard to do the work manually. If you're interested in learning more about Surveyor, check out Coord's Medium post.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}