{"id": "\n\nEngadget\n\n\nPentagon preps cyberattack in case Russia interferes with elections", "paragraph": "There may not be any immediate evidence of Russia directly meddling with the US midterm elections, but the Department of Defense is apparently ready to strike back if it happens.  Anonymous officials talking to the Center for Public Integrity and the Daily Beast say the Pentagon and intelligence agencies have agreed on the core terms of a retaliatory cyberattack in the event Russia tries a bold move.  The exact nature of the attack is unsurprisingly a secret, but hackers have reportedly received authority to breach key Russian systems in advance to make sure any attack moves quickly.It's also uncertain just what would be serious enough to prompt a retaliatory hack, but the White House had indicated that it would have to be more than an opinion manipulation campaign.  That most likely means altering vote counts, preventing votes or interfering with registration.The preparation is believed to be the result of the White House loosening the rules for cyberattacks.  While it wasn't initially clear what the change involved, the decision apparently allowed the military to infiltrate target networks before there's even a foreign attack, let alone an order to respond.  While former President Obama did allow for defensive cyberattacks, they required either the President's approval for major campaigns or three committees that included unaffected agencies.  Now, most of the teamwork involves the Pentagon, Homeland Security and the Office of the Director of National Intelligence.  They could approve some strikes without involving others in the government, or even the White House in some situations.While the potential for a rapid response sounds good, there are concerns that it might create problems of its own.  The old approach made sure the US considered alternatives before launching a cyberattack.  Here, the military might launch a campaign without considering less provocative options or a broader overall strategy.  With that said, the chances of a diplomatic solution to election interference aren't very high in the current climate.  The threat of fast retaliation may be the most effective deterrent in the short term.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}