{"id": "\n\nEngadget\n\n\nAsk Engadget: Is it OK to buy a tech toy for someone else's kid?", "paragraph": "The support shared among readers in the comments section is one of the things we love most about the Engadget community. Over the years, we've known you to offer sage advice on everything from Chromecasts and cameras to drones and smartphones. In fact, our community's knowledge and insights are a reason why many of you participate in the comments.We truly value the time and detail you all spend in responding to questions from your fellow tech-obsessed commenters, which is why we've decided to bring back the much-missed \"Ask Engadget\" column. This week's question comes to us from a reader who needs a great gadget recommendation for a child. Weigh in with your advice in the comments -- and feel free to send your own questions along to ask@engadget.com!I'm looking for a good tech gift for someone else's child. What would be an appropriate choice for a kid in the 7 to 10 age range?Terrence O'BrienManaging EditorIt's pretty hard to go wrong with a littleBits kit. For the super hero fan or movie buff there are kits themed around Avengers and Star Wars that let kids build their own R2D2 or Iron Man gauntlet. If they're a budding musician (or just like making a ruckus), there's the Synth Kit and Electronic Music Maker kits that allow them to create custom instruments. And, of course, the whole time they're playing, they're actually learning valuable skills, like circuit building and programming.Those kits start at $100, though, and if that's too big of an ask for a child you don't know all that well, check out littleBits' Hall of Fame lineup. They're only $40 each and allow kids to build two different inventions. For example, the Arcade Machine kit comes together to form a very rudimentary pinball game. But the parts can be rearranged to create a catapult too. (Don't worry, there are less destructive options as well, like a night light.)As an added bonus, if they dig this year's gift, you've got gift ideas for years to come since you can just buy more \"bits\" to expand their collection. So next year get the kid a light, sound and motion sensor to connect to the R2D2 and they can turn it into a guard for their room. Or buy them a temperature sensor to hook up to the synth kit so they can make weather-based music. Basically, you can just keep going back to littleBits well year after year and almost never run out of gift giving possibilities.You can also consider the Sphero Mini. It's just a small, cheaper version of the regular Sphero remote control ball. For $50 you'd be getting the kid a toy that connects to an app and has a whole universe of accessories that expand its potential. Race it with friends, navigate an obstacle course or go bowling with it. And, just like the littleBits kits, it's sneaking some learning into their lives.All products recommended by Engadget were selected by our editorial team, independent of our parent company, Oath. If you buy something through one of our links, we may earn an affiliate commission.Check out the full list of selections in our 2018 Holiday Gift Guide here!You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}