{"id": "\n\nEngadget\n\n\nGM's self-driving car reportedly has trouble recognizing pedestrians", "paragraph": "It seems that General Motors' self-driving car unit, Cruise, is running into major difficulties, and will likely not be able to hit its late 2019 launch target. Sources close to the project have told Reuters that engineers have been hitting unexpected technical challenges, like being able to detect objects if objects are in motion. For example, vehicles would hesitate or stop when passing a row of parked bicycles, would mistakenly see \"phantom bicycles\" that caused jerky stops, and would even fail to recognize pedestrians. \"Nothing is on schedule,\" one GM source told Reuters, as Cruise has already missed mileage targets and milestones.GM isn't the only one betting on Cruise succeeding, however. Earlier this month, Honda bought a $2.75 billion stake in Cruise, a sum that will be paid over the next 12 years. And along with Honda, Japanese company Softbank threw down $2.25 billion into the project (more than half of that will come after Cruise commercially launches).Safety and investor interest are intertwined -- for Honda, investing in Cruise means moving one step closer to a \"zero-collision world.\" So far, there's only been one reported pedestrian fatality because of a self-driving vehicle. Earlier this year, an autonomous Uber test car fatally injured a woman in Tempe, Arizona, forcing the ride-sharing company to halt testing. But by July -- four months later -- Uber began testing again.For Cruise CEO Kyle Vogt, safety is the determining factor before an official public launch. And it's not just Cruise facing challenges, but others, including BMW, Tesla, Uber, Lyft, and Google's Waymo. These challenges include the ethics in choosing who lives or dies in a life-or-death situation, discerning individuals in a large group, liability, and unprotected left turns. But considering the monumental challenge in front of all these companies, billions more will need to be invested before you and I can jump in an empty robot-car that can take us to In-N-Out.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}