{"id": "\n\nEngadget\n\n\nLime's Gen 3 scooter is built to survive rider abuse", "paragraph": "Lime might have lost access to San Francisco, but it does have a consolation prize: a new scooter to entice you in those cities where its shared service does operate. The Lime-S Gen 3 touts technology upgrades like a color screen (for speed, battery capacity and future parking zone alerts), improved location accuracy and a status light that indicates the charge level without making you check your phone. However, the biggest upgrades are to longevity -- you should see fewer dead scooters littering the sidewalks.The Gen 3 model carries a larger battery with a 20 percent longer range (about 30 miles), for a start. And crucially, they're more durable. The aluminum frame should be stronger overall, and key components are IP67 water-resistant. You wouldn't want to toss one into a lake, but it'll stand a better chance of surviving a fierce rainstorm. Appropriately, all the wires are now contained inside the scooter to prevent a cut or the elements from ruining a machine.It could be a more enjoyable ride, too. Larger 10-inch wheels and a dual suspension should do a better job of absorbing bumps, while braking systems for both wheels (electrical and mechanical at the front, step-based at the back) give you more control over a stop. An active rear light and reflectors on all sides will help alert others. Even the parking should be safer in the long run, since Lime is developing both virtual parking zones and the ability to determine whether or not you're riding on the sidewalk.Lime arguably didn't have much choice but to upgrade. The shared scooter field is increasingly competitive with heavyweights like Lyft and Uber getting into the game. This helps Lime stand out from the pack -- you might be more likely to use its scooters if they're both more reliable and more enjoyable to use.You can turn on your TV without requiring special hardware support.The space telescope has entered eternal sleep.The feature might be limited to live sports at first.The company said it has been dealing with an app 'issue.'It's stepping up its BFR plans instead."}