{"id": "Study Says Students Would Rather Go Without Food than Without Their Phones", "paragraph": "Photo: BSIP/UIG via Getty Images I’ve started to dread Monday mornings for a new and different reason lately, and it’s one that has zero to do with the workweek. Instead, it’s because Monday is when my stupid iPhone sends me its stupid Weekly Summary that calculates how much stupid screen time I had during the previous week. Yeah, iPhone, I get it: I’m trash.  That Weekly Summary isn’t helpful, it’s not changing my behavior, and it’s not turning me into a better person; all it’s doing is making me resent iOS12 (and yes, I had to pick up my GOTT-DAMN PHONE just to confirm what iOS it’s running). It’s no secret that none of us have any chill and we all spend too much time staring at these shiny little demons, but a new paper published in the journal  Addictive Behaviors shows just how fucked up our phone obsessions are.  First, this paper was published in a journal called  Addictive Behaviors, which is a huge tip-off. Next, according to lead author Sara O’Donnell, college students would rather go without food than without their phones. For the study, 76 college students between the ages of 18 and 22 were denied food for three hours and were denied the use of their phones for two hours. During that time, they were allowed to either study or read a newspaper. (I’m assuming that they spent a full 20 minutes of that time sounding out the word ‘newspaper’ and promising themselves that they’d Google it when they got their phones back).  After what O’Donnell described as a “modest deprivation period,” the participants were allowed to do a task on the computer in order to either earn some phone time or a 100-calorie serving of their fave snacks. Every time they opted for either reward, the time it took to earn additional phone time or additional food increased. According to the University of Buffalo, there were two parts to the study: the first part was a questionnaire that asked the participants how many minutes of phone usage they would buy at a number of different price points from $0 per minute to $1,120 per minute. The second part measured how many mouse clicks each student would be willing to make in order to earn some phone time.  The purpose, O’Donnell said, was to measure whether smartphone use served as a “reinforcing behavior” in the same way that food, alcohol, or drugs could reinforce their behaviors. The answer? O B V I O U S L Y.  “In this study, we provide evidence for the first time that smartphones are reinforcing,” she said. “We also found that when deprived of both food and smartphones, students were much more motivated to work for time to use their smartphone, and were willing to part with more hypothetical money to gain access to their phone.” (And even the researchers were “very surprised” by those results). O’Donnell said that research into smartphone addiction—as a real addiction, not just  yaasss I’m addicted—is still in its nascent stages, but this study suggests that our smartphones are “highly reinforcing.” I’m not sure if that makes me feel better or worse about the ever-increasing number on my Weekly Summary. Maybe I should look that up. Subscribe to Munchies."}