{"id": "Stan Lee Was a True Ally For People Of Colour", "paragraph": "Image via Wikipedia Commons As young black man who loves comics, the sudden news of Stan Lee’s death at 95 looms over me like a cloud. He wasn’t just the creator of  Black Panther,  X-Men, and  Spider-Man, he was a bold ally of people of colour. Stan Lee made his lack of patience for bigotry and racism very clear in 1968. In a column titled, “Stan’s Soapbox”—a Bullpen Bulletin installment appearing monthly in Marvel Comics from 1965-2001—Lee lectured his readers, saying that while they may not all get along with each other and every person they meet, that didn’t make it permissible to blindly hate a single person. I wasn’t alive when he wrote this, but I was kicking it when Charlottesville happened—that moment when black bodies were shocked back to that older time—when he re-tweeted the column to a different generation. The contrasts between then and now, was that Lee stood to gain nothing with that opinion; nothing then, and very little now. This was a creative who once toiled his way through a 1950s comic industry that didn’t all together want him—self-titled as a hack ready to quit the business on a dime before his Marvel stint. He was the most privileged kind of white man, in appearance and opportunity, but he used that privilege for a positivity few are able to manage, given the progressive ideals he stood for. Over the last two decades, we’ve grown up with him, witnessing this elderly mustachioed man appear for a few brief seconds on the big screen, perhaps not thinking too much about his work. When I praised the audacity of a movie to feature a black king and cast, I never once mentioned that Stan Lee was a co-creator of Black Panther. He was a staunch sympathizer to the civil rights movement, and asked for no credit for his sympathies, even when it was harmful for him to show support. He helped to create characters that embodied a kind of Afro-heroism as an option to absent stories. He inserted progressive messages within his works to white audiences might not have cared before reading them. X-Men, most famously, being an allegory (humans being afraid of mutants) for racial angst around the civil rights movement. (It’s an allegory that has extended several decades, and most notably expanded to the LGBTQ community.) I’m not here to give a history lesson, but I want to recognize a man who understood what it meant to be an unapologetic ally through voice and art. He didn’t just fully embrace it on a TL, he did it wholly without self-protective concern to how this allyship would be perceived by the most discriminatory of audiences—who couldn’t (and don’t) see his words as aspirational, advantageous or necessary. As someone who grew up distrustful of the kind of allyship that turns villainous behind closed doors, that constant reminder that we (people of colour) weren’t alone in this meant the world to me. With that final tweet of remembrance by Stan Lee, he wrote the words “as true today as it was in 1968.” Stan Lee, you are as true today as you always were. Rest in peace, and \"Excelsior!\"Follow Noel Ransome on Twitter.  Sign up for the VICE Canada Newsletter   to get the best of VICE Canada delivered to your inbox."}