{"id": "charity kase’s extreme horror drag will haunt your nightmares ", "paragraph": "Imagery via ChaCharity Kase’s Instagram feed is so terrifying it needs a trigger warning. Whether channelling Nosferatu realness, giving Pennywise the clown a run for his money, or ruining all our childhoods as a twisted version of Winnie the Pooh, the 21-year-old drag queen’s looks are horrifically good. Think less  RuPaul’s Drag Race, more  Drag Me To Hell. While most young drag performers ease into the art form with more feminine or pretty looks, Charity Kase, real name Harry Whitfield, always wanted his looks to be decidedly spookier. “I love anything twisted and beautiful so I’ve always been drawn to horror and animation,” Charity says. “I’m inspired by dark fantasy and mythical creatures, and also by the idea that you shouldn’t judge a book by its cover, so I try to show depth and beauty in my less commercially attractive looks. Growing up I always loved witches, gremlins and fairies because they were always the strongest and most interesting characters. Now I’m simply one of them!” While Charity’s looks aren’t “commercially attractive,” that doesn’t mean they aren’t championing their own version of beauty. Sure, it’s horrible beauty, but it’s beauty nonetheless, and each look requires an incredible amount of time and effort to achieve. Last year, the performer, who also runs his own clothing line, participated in Instagram’s 365 Days of Drag challenge, which required them to perfect an intricate, creative, and suitably terrifying look every single day. “It was an on the spot decision on the 1st of January to do it,” explains Charity, who then spent three to seven hours every single day creating the looks, which included a chilling Krampus, a bushy browed Hermione Granger and even a nightmarish Gretchen from Disney classic  Recess. Drag is an expensive hobby -- dresses, headpieces, and makeup don’t come cheap, especially when you need a new one every single day -- but Charity works on a budget, hence the name. “In hindsight, I probably could have used some preparation time. It was a really intense experience. I spent so much money on costumes and dresses in the past year but luckily a few makeup brands helped me out!”Scrolling through each of the 365 looks though is all the inspiration you need for your Halloween costume this year. An expert in the spookiest night of the year, Charity hosts makeup tutorials on his YouTube channel, but as far as Halloween is concerned, they tell i-D their advice is go big or go home. “When it comes to Halloween, the bloodier the better,” Charity says. “The worst costume is definitely Donald Trump though. However demonic and orange and tempting it might be, nobody wants to be reminded of that on a night out.”  You can catch Charity tonight, teaching a Halloween make-up workshop at the Sarabande Foundation.  If you dare. This article originally appeared on i-D UK.suscribe to i-D's positive vibes."}