{"id": "This Big Beer Lawsuit Could Put an End to PBR", "paragraph": "The days of chugging Pabst Blue Ribbon’s strangely sweet, slightly metallic, golden swill may be numbered, as the beloved beer of many a college kid and dive bar devotee could soon find itself without a producer.Pabst might be in the name, but PBR is actually brewed, packaged, and shipped by MillerCoors, along with other Pabst products like Old Milwaukee and Lone Star. In a case that’s going to trial today, Pabst Brewing Company is taking MillerCoors to court over the latter’s attempt to end the partnership. The brand is seeking $400 million in damages.As the Associated Press reports, the current agreement, which was signed in 1999, is valid until 2020, at which point it could be renewed for two possible extensions.How those extensions might happen is where the companies differ. MillerCoors, who have seen sales decline in the United States since the agreement was signed, thinks that they can determine, based on their capacity, whether or not the partnership can continue. Pabst, however, believes that the two need to find a solution together if Pabst wants to continue the agreement.The AP reports that according to Pabst, MillerCoors will only agree to an extension if Pabst pays $45 a barrel. Pabst, which currently needs 4–4.5 million barrels of beer per year, called that “a commercially devastating, near-triple price increase.” Pabst’s lawyers argue that this move threatens to put Pabst out of business, giving MillerCoors a stronger hold over the cheap beer sector. While MillerCoors is still one of the largest players in the American beer industry, the company reported a 5.8 percent sales decline in the first quarter of 2018 from the previous year, with an overall earnings drop of over 12 percent from 2017 to 2018. Overall, the big beer brands have seen sales slide in recent years; in May,  USA Today reported that sales of Bud Light, Coors Light, Budweiser, and Miller Light—the largest-selling brands in the US—all decreased from the previous year.The partnership with MillerCoors is the only option for Pabst, Pabst’s lawyers told the AP, as Anheuser-Busch—the only other brewer with the resources to work at Pabst’s scale—does not do contracted brewing.In a statement to MUNCHIES, Pabst said, \"Even though MillerCoors’ market power is much larger than Pabst’s, we will not allow this industry bully to push us around. We are confident that the court will see MillerCoors’ fabricated 'capacity' concerns for what they are: a thinly veiled, bad faith attempt to unlawfully hurt a competitor.\"If we end up pouring one out for PBR, there’s no shortage of cheap beers to take its place and no shortage of undiscerning college partiers to drink it. But it would still hurt to say goodbye to the unofficial watery brew of the early aughts.Subscribe to Munchies."}