{"id": "Iowa State students grapple with Steve King and midterms graffiti that says “It’s OK to be white”", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.AMES, Iowa — Iowa State University students stepped over chalk-scrawled sidewalk messages reading “Vote 4 King,” “GOP loves you,” and “red wave” on their way to class Friday morning, just a few days before the midterm elections. Some paused to glance at the slogans that had cropped up near the center of campus this week. Many didn’t — sidewalk chalking, whether for student government or a contested congressional seat, isn’t too unusual. But a few of the sidewalk messages outraged some students. Some messages read “It’s OK to be white,” according to student newspaper the Iowa State Daily. The most inflammatory stuff had been power-washed away by Friday morning, according to one campus employee who asked to not be named because he wasn’t authorized to talk to the press. What remained was messaging supporting embattled Republican Rep. Steve King — the congressman for Iowa’s rural 4th district who could lose his previously safe seat in the wake of allegations that he’s gotten too cozy with white nationalists. The controversial eight-term politician has in recent weeks offered a Twitter endorsement for a candidate associated with white nationalists, Faith Goldy, who recently lost Toronto’s mayoral race. King called her “pro-Western.” The Washington Post also reported that King met with a far-right Austrian political party with historical Nazi ties — and more recent neo-Nazi affiliations — in August. King has defended that meeting while also denying allegations that he’s anti-Semitic and blaming “fake news” for misinterpreting his words and attacking him. On Thursday, he threw an Iowa State student who pressed him on the allegations — as well as his long history of racist comments — out of a public forum.Brad Wiesenmayer, a 22-year-old senior studying sociology, who is originally from Chicago, isn’t buying King’s defenses. “If he’s not a fascist, he’s fascist-adjacent, for sure,” said, as he used the heel of his sneaker to smudge blue chalk reading “build the wall.” His friend was grabbing a water bottle to wash the message away. “He’s definitely an apologist for white nationalists.”  Read more: King freaked out after being accused of being a white nationalist.  AMES, Iowa — Iowa State University students stepped over chalk-scrawled sidewalk messages reading “Vote 4 King,” “GOP loves you,” and “red wave” on their way to class Friday morning, just a few days before the midterm elections. Some paused to glance at the slogans that had cropped up near the center of campus this week. Many didn’t — sidewalk chalking, whether for student government or a contested congressional seat, isn’t too unusual. But a few of the sidewalk messages outraged some students. Some messages read “It’s OK to be white,” according to student newspaper the Iowa State Daily. The most inflammatory stuff had been power-washed away by Friday morning, according to one campus employee who asked to not be named because he wasn’t authorized to talk to the press. What remained was messaging supporting embattled Republican Rep. Steve King — the congressman for Iowa’s rural 4th district who could lose his previously safe seat in the wake of allegations that he’s gotten too cozy with white nationalists. The controversial eight-term politician has in recent weeks offered a Twitter endorsement for a candidate associated with white nationalists, Faith Goldy, who recently lost Toronto’s mayoral race. King called her “pro-Western.” The Washington Post also reported that King met with a far-right Austrian political party with historical Nazi ties — and more recent neo-Nazi affiliations — in August. King has defended that meeting while also denying allegations that he’s anti-Semitic and blaming “fake news” for misinterpreting his words and attacking him. On Thursday, he threw an Iowa State student who pressed him on the allegations — as well as his long history of racist comments — out of a public forum.Brad Wiesenmayer, a 22-year-old senior studying sociology, who is originally from Chicago, isn’t buying King’s defenses. “If he’s not a fascist, he’s fascist-adjacent, for sure,” said, as he used the heel of his sneaker to smudge blue chalk reading “build the wall.” His friend was grabbing a water bottle to wash the message away. “He’s definitely an apologist for white nationalists.”  Read more: King freaked out after being accused of being a white nationalist.  Some of King’s corporate donors, including the dairy cooperative Land O’Lakes, Purina PetCare, and Intel said amid last week's backlash that they’re not going to contribute to his campaign anymore. Ohio Rep. Steve Stivers, who heads the National Republican Congressional Committee, wrote in a tweet Tuesday that King’s “recent comments, actions and retweets are completely inappropriate.” “We must stand up against white supremacy and hate in all forms,” Stivers wrote in the tweet.The Iowa State College Republicans still endorse King — an immigration hardliner and a staunch supporter of President Donald Trump — and said in a statement posted to their Twitter page Wednesday that the “allegations against him are baseless and untrue.”   Dalton Doom, a senior from Urbandale studying aerospace engineering, said he had been planning to vote for King but is now reconsidering. Doom said he voted for an independent candidate in the 2016 presidential election, but he’s aligned with conservatives since then.   “I know there’s been controversy, he’s been accused of having less than great opinions,” Doom said of King. “But what drives his policy? How does it translate?”In what’s projected to be a neck-and-neck election for King and Democratic challenger J.D. Scholten on Nov. 6, every vote will count. Some recent polls show the race as a toss-up, while Cook Political Report sees Iowa’s 4th District leaning Republican. FiveThirtyEight, meanwhile, gives King a nearly 86 percent chance of winning. Scholten is swimming in campaign donations as compared to King. While King has already spent most of his approximately $740,000 in fundraising on administrative expenses like salaries or fundraising, according to federal campaign filings, Scholten, a former professional baseball player and paralegal from Iowa, has raised more than $1.7 million, and is in the middle of an aggressive advertising campaign. About 33 percent of registered, active voters in Story County, where Ames and the university are located, are Democrats, according to data kept by the Iowa secretary of state. About 28 percent are Republicans, and 37 percent of voters fall into the “no party” camp.And Iowans turn out to vote. In the 2014 midterm elections cycle, the entire state saw the highest voter turnout for a midterm election in 30 years, according to The Gazette in Cedar Rapids — a stark contrast to the rest of the United States that year, which saw the lowest turnout in 70 years. About 51 percent of Story County's voters went to the polls.   Read more: These 7 key midterms races are in dead heats.  Turnout is much lower among young voters. About 25 percent of Democrats ages 18 to 24 turned out for the last midterm election in 2014, according to state data. Of Republicans in that age group, nearly 35 percent of registered voters turned out. That’s still very low compared to a turnout of 83 percent among Republican voters over the age of 65 that year, for example.Sen. Bernie Sanders came to campus last month to drum up student support for Scholten, but at Iowa State, it wasn’t evident that the controversy over King — or even the graffiti on their own sidewalks — would drive an exceptional number of students to vote. Travis Gillham, a senior studying electrical engineering, said he’s not planning to vote. He’s seen the sidewalk chalking, and heard people talking about the elections, but said he’s not political and “not up to date.”“If all my classes got really free and some huge news broke, maybe” he’d vote, Gillham added.  “I know that Bernie endorses [Scholten],” Wiesenmayer, who already voted and is a volunteer for NextGen America, said. “He just seems like somebody who cares about people more, and he doesn’t take corporate contributions to his campaign, and I’m a big fan of that.”  But many students approached by VICE News said they weren’t following the midterms, weren't voting, or both.Larry Morgan, a 26-year-old student at the North Iowa Area Community College who was studying in a Starbucks near Iowa State University’s main campus Friday, said he’s not planning to vote on Tuesday. He also didn’t vote in the 2016 presidential election. “I don’t believe the laws are meant to benefit me,” Morgan, who is black, said. When asked about whether he believes King is racist, Morgan said “a lot of them are,” referring to politicians.Grace Lazard, a senior studying liberal arts and science at Iowa State, is following U.S. politics closely, but is British and also unable to vote in the midterms.“This state, I don’t know, it’s weird,” Lazard, who is black, said. Pointing to the story about the controversial chalk messages on the front page of the Iowa State Daily, she commented, “things like this — all that racism, people are now comfortable with it.”   Ana DiSpirito, a 19-year-old sophomore and Ames local, said “with Trump, it’s become more acceptable for white supremacy.” If allegations about King being associated with white supremacists are true, “I don’t think it’ll change the election,” she said. “I really doubt it.”    Listen to Episode 1 of \"Chapo: Kingpin on Trial\":   Cover: Graffiti on the sidewalks of Iowa State University in Ames, Iowa on Nov. 2, 2018. Photo by Emma Ockerman.  "}