{"id": "The U.S. just named the “chief accountant” behind Russia's election meddling operation", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.U.S. officials accused a Russian citizen on Friday of being the chief bookkeeper for a sweeping, multimillion-dollar plot to interfere with U.S. elections in both 2016 and 2018, under the broader goal of sowing total chaos throughout American political life.Elena Khusyaynova, 44, is the “chief accountant” for a secret operation dubbed “Project Lakhta,” U.S. officials said, unsealing a criminal complaint against her. “Project Lakhta” is still active and targeting this November’s midterm Congressional elections, the Department of Justice said.“This case serves as a stark reminder to all Americans: Our foreign adversaries continue their efforts to interfere in our democracy,” FBI Director Christopher Wray said in a statement. Khusyaynova, who lives in St. Petersburg, allegedly stands at the center of a vast network of secretive financial flows aimed at supporting the various components of the operation, which its members refer to as “information warfare,” U.S. officials said. U.S. officials accused a Russian citizen on Friday of being the chief bookkeeper for a sweeping, multimillion-dollar plot to interfere with U.S. elections in both 2016 and 2018, under the broader goal of sowing total chaos throughout American political life.Elena Khusyaynova, 44, is the “chief accountant” for a secret operation dubbed “Project Lakhta,” U.S. officials said, unsealing a criminal complaint against her. “Project Lakhta” is still active and targeting this November’s midterm Congressional elections, the Department of Justice said.“This case serves as a stark reminder to all Americans: Our foreign adversaries continue their efforts to interfere in our democracy,” FBI Director Christopher Wray said in a statement. Khusyaynova, who lives in St. Petersburg, allegedly stands at the center of a vast network of secretive financial flows aimed at supporting the various components of the operation, which its members refer to as “information warfare,” U.S. officials said. The plot is allegedly funded by notorious Russian oligarch Yevgeny Prigozhin, dubbed “Putin’s chef” due to his closeness to Russian President Vladimir Putin and his background in the restaurant business. Prigozhin, two of his companies, and 12 others were indicted by special counsel Robert Mueller in February for allegedly running a large, organized, online operation to interfere with the American political system.   Read: 13 Russian nationals indicted for meddling in U.S. electionThe Russian effort allegedly involved the creation of thousands of phony social media personas, who went on to try to inflame hot-button political issues, according to the department.Russian trolls have sought to exploit a lengthy list of the most controversial subjects in the U.S., including virtually anything Americans might want to argue about on Twitter. According to the DOJ, topics include:—Immigration —Gun control and the Second Amendment—The Confederate flag—Race relations—LGBT issues —The Women’s March—The NFL national anthem debate—Church shootings in Charleston, South Carolina, and in Las Vegas —The violence surrounding Charlottesville’s “Unite the Right” rally —Police shootings of African-American men—The key decisions of President TrumpThroughout this effort, Khusyaynova kept the organization humming and helped make sure everyone involved got paid, U.S. officials claimed.   Read: Everything we know about the Russian operatives accused of meddling in the U.S. electionKhusyaynova “managed the budgeting and payment of expenses associated with social media operations, web content, advertising campaigns, infrastructure, salaries, travel, office rent, furniture, and supplies, and the registration of legal entities used to further Project Lakhta activities,” FBI special agent David Holt said in an affidavit released Friday. Between January 2016 and June 2018, Project Lakhta’s proposed operating budget was over $35 million, the Department of Justice said. Between January and June 2018 alone, the project’s proposed operating budget exceeded $10 million.Prigozhin has consistently dismissed the charges against him as unfounded, and one of his companies, Concord Management and Consulting Ltd., has hired a top-shelf team of Washington lawyers to fight Mueller in a U.S. court. He's also laughed off U.S. efforts to swipe back at him, including through sanctions. After one recent round of U.S. sanctions in March, the man known for cooking even cracked a food joke.“I have no business in the U.S. or with Americans,” Prigozhin said at the time. “It doesn’t bother me. Except now I’ll stop going to McDonald’s.”Cover image: FBI Director Christopher Wray speaks during the daily press briefing at the White House, Thursday, Aug. 2, 2018, in Washington. (AP Photo/Evan Vucci)"}