{"id": "The story of four female candidates trying to make history in 2018", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.Pearl Kim, Anna Eskamani, Deidre DeJear, and Morgan Zegers don’t have much in common. But they all agree on one thing: They never thought they’d become politicians.That changed in the last two years. Frustrated over issues like sexual assault, gun violence, voting rights, and corruption, these four women decided to join the historic wave of women running for office.Each could make history in this year's midterm elections on Nov. 6. Democrat Deidre DeJear would become the first African-American elected to statewide office in Iowa if she wins her race for secretary of state. Republican Pearl Kim, a former special victims prosecutor and sexual assault survivor, is running for a U.S. House seat left open by a # MeToo scandal. Democrat Anna Eskamani, a former Planned Parenthood employee, wants to become the first Iranian-American in the Florida state House. And at 21 years old, Republican Morgan Zegers is gunning to join the New York State Assembly as its youngest member.Whether they're greeting constituents at a train station, going to a tattoo parlor, or milking cows at a county fair competition, our candidates are working hard to win over voters. In a year when more women are running than ever, each of our candidates has her own unique reasons for launching a campaign. Watch Part 1 of our documentary series to learn more. (Hint: They’re not all about Donald Trump.)Throughout their campaigns DeJear, Kim, Eskamani, and Zegers have had to carefully craft the image they present to the world. For these four first-time candidates, that means creating ads and dealing with reporters. It means politely fending off sexist come-ons and racist comments shouted on street corners. And, in this second installment of the four-part web series “She’s Running,” it means turning their personal, painful stories into triumphs.Pearl Kim, Anna Eskamani, Deidre DeJear, and Morgan Zegers don’t have much in common. But they all agree on one thing: They never thought they’d become politicians.That changed in the last two years. Frustrated over issues like sexual assault, gun violence, voting rights, and corruption, these four women decided to join the historic wave of women running for office.Each could make history in this year's midterm elections on Nov. 6. Democrat Deidre DeJear would become the first African-American elected to statewide office in Iowa if she wins her race for secretary of state. Republican Pearl Kim, a former special victims prosecutor and sexual assault survivor, is running for a U.S. House seat left open by a # MeToo scandal. Democrat Anna Eskamani, a former Planned Parenthood employee, wants to become the first Iranian-American in the Florida state House. And at 21 years old, Republican Morgan Zegers is gunning to join the New York State Assembly as its youngest member.Whether they're greeting constituents at a train station, going to a tattoo parlor, or milking cows at a county fair competition, our candidates are working hard to win over voters. In a year when more women are running than ever, each of our candidates has her own unique reasons for launching a campaign. Watch Part 1 of our documentary series to learn more. (Hint: They’re not all about Donald Trump.)Throughout their campaigns DeJear, Kim, Eskamani, and Zegers have had to carefully craft the image they present to the world. For these four first-time candidates, that means creating ads and dealing with reporters. It means politely fending off sexist come-ons and racist comments shouted on street corners. And, in this second installment of the four-part web series “She’s Running,” it means turning their personal, painful stories into triumphs.If you want to make it to the top, you usually have to take down the person who’s already there — and, in American politics, you need money to do it. Lots and lots of money. In this third installment of the four-part web series “She’s Running,” DeJear, Kim, Eskamani, and Zegers must survive debates, raise voters’ awareness, and cajole donors into opening their checkbooks. Two of their opponents are experienced incumbents, which makes all that even harder. All these women’s canvassing, their fundraising, their sign waving, their speech making, their cow milking, their porkchop flipping, their weeks and months and years of campaigning — all of it came down to just one day. Watch the final installment of VICE News’ “She’s Running” web series to find out what happened next."}