{"id": "\"Streamer\" Modes Are Usually Gimmicky BS, But in 'Dead Cells,' It's Magic\n", "paragraph": "Image courtesy of Motion Twin Drama. In-fighting. Twists of fate. Rolls of the dice. A top 10 anime betrayal. I don’t know that I’ll ever top my last run at Dead Cells, and there’s a chance I won’t ever bother even trying. The hand of the king, a final boss whose control was ultimately placed in the hands of the villain Austin Walker, is dead. The  king is dead. Last week, I beat Dead Cells, but it didn’t happen the way I figured, huddled around my computer in the dark of night. Instead, my victory was shared in the company of hundreds. I landed the killing blow, but there were many hands guiding my journey. Until now, I’ve yet to be convinced by gimmicks developers have come up with to justify “integration” with Twitch or other streaming services, but Dead Cells is different, as it manages to turn the experience from a passive affair to damn near a co-op experience. Knowing we’d worked hand-in-hand made victory all the more satisfying. Dead Cells is managed chaos. There are only a few constants on every run—running, jumping, dodging—and everything else is a question mark, from what weapons will drop to how those weapons scale. (In Dead Cells, weapons scale along one of three primary stats, so even if you really like a particular weapon, you may need to switch if it doesn’t scale. The key to Dead Cells is constantly improving damage output as you near the endgame.) This is part of the game’s appeal. You generally know what’s in front of you, but each run, the levels are a little bit different, the weapons are a little bit different. Where the power-ups drop, which let you improve the three stats, is a little bit different. What’s comforting is falling back on what  is in your control, and trying to manage those tools alongside the incessant chaos. The streaming mode in Dead Cells, an optional integration with Twitch where viewers can influence a variety of in-game factors big and small, takes a sledgehammer to this balance. My entire run was archived here, but the golden run starts at 41 minutes, 40 seconds: You don’t have to turn every variable on, but everything’s on by default, so that’s what I’ve rolled with. In that case, while you choose which weapons to pick up, the viewers now vote on your stat upgrades. Maybe you want to scale on brutality (aka strength), but viewers have voted tactics (tools). Too bad. Each level has several routes of escape, but now, you don’t pick which one to leave through—they do. Perhaps most importantly, you’re no longer in control of Dead Cells’ primary lifeline, the health power-up. At random, a viewer is assigned this task. You can politely ask for them to refill your health by tapping a button, but it’s merely that, a request. Are they paying attention? Do they think you can scrape by? Who knows! The person assigned to your health is not invisible, however. They’re an in-game bird who’s capable of passing along messages of encouragement—or distress. On this run, my birds were helpful. They’d point out secrets, or give me a pep talk before a boss. In a game that’s deliberately lonely, with everything doing its best to keep you stressed, it’s a lovely touch.  Additionally, the stream can add a unique variable to each stage, such as doors exploding, an increase in high-level enemies...or letting the bird attack nearby enemies. Sometimes the viewers are merciful, other times tricksters. Or they may have no choice. This happened once, when all of my doors started exploding. The chat apologized, saying every variable would have made things harder, and said it picked the best worst option. I believed them.  Towards the endgame, I’d managed to knock together one hell of a build: a fast sword (Balanced Blade V-L) that spreads inflammable oil onto enemies, a shield (Cudgel III) that passively reduced damage by 30%, an accessory (Topaz Amulet VIII) that automatically poisoned anyone who touched me, and a truly killer combination of Fire Grenades (with friendly attack worms upon an enemy’s death) and Magnetic Grenades (100% bonus damage to enemies on fire, 100% bonus damage to poisoned enemies). It was brutal. If none of that make sense, here’s a translation: I could fuck people up real bad, real fast. It could be better? It  could do more bonus damage. But I was happy with where it was at. I didn’t need to roll again, and every time you roll, it’s more and more expensive to try again. You also run the risk of producing a negative stat. For example, this nasty business: a bonus providing 100% bonus damage to every attack...while allowing enemies to do the same. That’s great perk if you never going to get hit! Not every stat immediately re-rolls, either. It might take a few chances, and suddenly, you may find yourself with very expensive garbage. I like a good dare, and livestream producer Natalie Watson, who was mocking me in the chat relentlessly, demanded I roll the dice before the final boss. I steamrolled through the last major area with my finely tuned build, one that had me defeating mini-bosses without taking as much as a scratch, and I would be putting my future in jeopardy over a half-assed taunt. But sure, why not? Spoiler: It worked out. A few rolls later, a few sips of my beer later, my weapon was fine. But there was more. Natalie demanded to be the final boss, too. See, in Dead Cells, the streaming mode lets one viewer “control” the boss. In reality, they can just flip on some stuff you wouldn’t encounter on a normal run, but it’s still neat, and varies up boss encounters that can grow stale. But there was no way to guarantee Natalie this spot because it’s random. \"Games hoping to have a vibrant online community should take note. Dead Cells doesn’t have traditional 'multiplayer,' but arguably, it absolutely does, thanks to some smart design.\" We needed people to be cool, and Twitch chat is  not that. (To be clear, Waypoint’s chat is calm and cool, but there are always trolls looking for trouble.) We arrived at a solution: switch the chat to subscriber-only chat! But all that managed to do was encourage a bunch of people to subscribe, which, uh, thanks?? The real solution was clever: sub-only chat where people exclusively speak in emojis, unless you’re a mod. That would restrict the number of people who could use the appropriate phrase to a small, trusted group of people watching. Trust. Trust is funny. When I stepped into the arena, it showed the pool of potential finalists to be more than one—so, more than Natalie. Huh? As it turned out, Austin had thrown himself into the ring. Tick, tock. The seconds go by, and Austin got picked, the son of a bitch. It was time for the gamers to #riseup. Streaming is a weird balance between performing (the game part) and performance (the stream part), and it’s nowhere more of a balancing act than when you’re trying to drop one in favor of the other. I wanted to beat Austin, yes, but I really wanted to beat Dead Cells, a game I’d gotten distracted from after Spider-Man came out. I was already pretty sure Dead Cells was one of my favorite games from 2018, but I wanted to have a complete run under my belt to be sure, and I’d decided to gamble all these checkboxes in front of an audience? It went fine. In fact, it wasn’t close. (Austin later claimed to be confused about how to use the boss’ abilities.) But it was exhilarating and rewarding, all the same. It’s tempting to call streaming a game a “group” effort, a collaboration between the streamer and viewer, but in this case, we did work together to see Dead Cells to the end. I’ll probably still pluck around with Dead Cells, but chances are it won’t be the same without those folks having my back. More broadly, it points to interesting possibilities for how streaming can impact gameplay. Streaming the same game over and over requires new wrinkles not imposed by the game. How else have games like Dark Souls continued to be interesting on stream? There’s nothing built into From Software’s game demanding someone play the game with a DDR pad—that’s streamers coming up with ways to impress their audience, to push their skills.  Games hoping to have a vibrant online community should take note. Dead Cells doesn’t have traditional “multiplayer,” but arguably, it absolutely does, thanks to some smart design. Follow Patrick on Twitter. If you have a tip or a story idea, drop him an email: patrick.klepek@vice.com.  Have thoughts? Swing by Waypoint's forums to share them!Email is a thing."}