{"id": "After Pittsburgh, American Jews Are Mournful, Afraid, and Defiant", "paragraph": "Mourners at a candlelight vigil in front of the White House | Photo by ANDREW CABALLERO-REYNOLDS/AFP/Getty ImagesOn Saturday, a man walked into the Tree of Life synagogue, in the heart of Pittsburgh's Squirrel Hill, and shouted “Jews must die” before gunning down 11 elderly congregants. This comes on the heels of the pro-Trump mail bomber who sent explosives to prominent critics last week. As Jewish journalist Julia Ioffe noted in the  Washington Post, although Trump allies were quick to point out that the synagogue shooting suspect disliked Trump, he only did so because \"he felt he was too soft on 'the k--- infestation,' he wrote online, using a slur for Jews.\" In her op-ed, Ioffe wondered—as many did—how much the president was to blame for this tragedy:Trump has had enough to say about the Jews that his supporters may easily make certain pernicious inferences... Culpability is a tricky thing, and politicians, especially of the demagogic variety, know this very well. Unless they go as far as organized, documented, state-implemented slaughter, they don’t give specific directions. They don’t have to. They simply set the tone.All over the country, Jewish communities have been mourning this hateful act of violence, but at the same time, they have been ruminating on that tone. Devastated by the attack, which is reportedly the deadliest anti-Semitic hate crime in US history, as we grieve, American Jews are also grappling with how our current political discourse contributed to this unspeakable act of bigotry. New York Times opinion writer and editor Bari Weiss was Bat Mitzvahed at Tree of Life and returned home to be with her family during this tragedy. \"It’s so moving to watch the Jewish community do what we’ve always done, which is to look out for one another,\" she told me over the phone. Growing up Jewish in Pittsburgh, she said she didn't experience much anti-Semitism, aside from Catholic school children yelling slurs at her and her sister while they waited for the bus to go to school. \"But that was so anomalous. The Jewish community here lives in the city and we are very much a part of it,” she said.Jewish people in America are aware of the long history of anti-Semitism, but it is often invisible in our day-to-day lives, so the Pittsburgh shooting was a wake-up call. \"The point of anti-Jewish oppression is to keep a Jewish face in front, so that Jews, instead of ruling classes, become the target for peoples’ rage,\" April Rosenblum wrote on \"The Past Didn't Go Anywhere,\" a guide for leftist activists on how to incorporate the reality of anti-Semitism in their movement. \"It works even more smoothly when Jews are allowed some success, and can be perceived as the ones 'in charge' by other oppressed groups.\"While there's debate in the Pittsburgh Jewish community over whether Trump is welcome at Tree of Life, Weiss thinks his rhetoric played a part in the attack. \"During the election, the famous line was that we were supposed to take Trump seriously but not literally,\" she told me. \"Clearly not everyone has gotten that message. The only person who is responsible for these murders is the murderer. But when you have the president talking, in conspiratorial terms, about globalists, about enemies of the people and the like, we shouldn’t be shocked that something like this happened.”Beyond the politics of the moment there is an immense outpouring of grief. Outside of Pittsburgh, Jews and their allies have searched for a way to honor those who were murdered. Susan Goldberg, an Los Angeles-based reform rabbi, took part in a candlelight vigil for the victims of the shooting on Sunday with Mayor Eric Garcetti. \"People do feel quite scared. People really wanted to gather and come together,\" she told me. \"It’s left people in a communal state of grief.\"The news of the shooting broke during Goldberg's Saturday service. \"The next day, Sunday, people had to come bring their children to the synagogue [for Sunday school], which I think was an incredible act of faith and resilience.\"Shay Roman, who also helped organize the vigil in LA, said she did so because she wanted to \"give people some togetherness in this time of grief, and help us be a little less afraid.\" Roman is an organizer with IfNotNow, a collective of young American Jews working to end the American Jewish community’s support of the Israeli occupation. \"As the descendent of three Holocaust survivors, it's an unspeakable moment for me [and my community],\" she told me. \"Unfortunately, this time of mourning is basically as political as it gets. We have this president, and right-wing conservatives in Washington, that’s really taken over and stoked the fires of white nationalism. We feel very much that the lives that have been lost are on them.\"Goldberg says her community is aware of the larger trend of resurgent anti-Semitism in the United States, but nevertheless, \"a shooting like this is a shock... We’re all, in our DNA, so aware of historic anti-Semitism. I’ve been on the receiving end of [anti-Semitism] in the cyber world.\"Many Jewish journalists, including myself, have been the victim of virulent anti-Semitic cyber-harassment in the Trump era. Talia Lavin, who researches the right and has been doxxed by anti-Semites and a frequent target of the white nationalist website the Daily Stormer, told me, \"I see anti-Semitic rhetoric constantly, very violent in nature quite often. And on a certain level I never deny its seriousness, but you become a bit inured to it on the beat... Knowing that it radicalized someone to the point of mass murder is unsettling to say the least.\"The connections between everyday online hostility and the murders were chillingly close. On Gab, a right-wing social networking site that was forced offline after the shooting, the alleged killer posted anti-Semitic comments and his profile asserted that \"jews are the children of satan.\"Lavin, a secular Jew who comes from a conservative sabbath-observant family, said she tried to speak to her Trump-supporting father about how \"a Trump-pushed conspiracy theory led to the slaughter directly.\"\"I haven't had political conversations with my family per se although they did ask me 'how Gab was allowed to stay online,' which is kind of a good question,\" she said.What's clear amid all this is that the problem of anti-Semitism runs far deeper than just one disturbed person. Mordechai Lightstone, a rabbi who runs the Brooklyn-based Tech Tribe, which \"curates bespoke Jewish experiences\" for young Jews working in digital media and tech, told me over email, \"As a Chasidic Jew, I've always experienced anti-semitism in some form or another—from slurs in Lithuania to rocks and bottled thrown at me in Brooklyn.\"The way to combat this \"unbridled hate,\" he explained, is to meet it \"with boundless good. We need to be ever prouder and stronger as Jews—since we know that anti-Semites may be able to destroy our bodies, but they can never dampen our souls or our pride.\"Sign up for our newsletter to get the best of VICE delivered to your inbox daily.  Follow Eve Peyser on Twitter and Instagram. Sign up for the best of VICE, delivered to your inbox daily."}