{"id": "'Call of Cthulhu' Is the Rare Bad Game That's Probably Still Worth Playing", "paragraph": "Image courtesy of Focus Home InteractiveCthulou. Cthullthu. Cuthulu. I've never been able to get it right. Growing up, I was a Stephen King kid.  Pet Sematary. The Dark Tower. 1408. The Stand. Later, thanks to  Hellraiser, I'd become a Clive Barker fanboy. I knew of H.P. Lovecraft because his influence was tough to miss and yet, my ignorance knew no bounds. It was only years later I would discover, for example, one of my favorite horror series,  Re-Animator, was based on Lovecraft. (Same thing with  From Beyond, which features some of my favorite practical effects ever put on film.) By the time I became curious about Lovecraft's work on my own terms, my search for recommendations landed me on essays about the often-ignored racism and classism in Lovecraft's work. I had better uses of my time.I was unable to avoid Lovecraft's reach, however. Even when works are not explicitly based on his stories, his themes—forbidden knowledge, cosmic entities in dimensions beyond, losing one's mind to powerful forces out of human perception, nightmarish creatures living beneath the surface of our world—are everywhere. One of my favorite games from the last few years,  Bloodborne, is explicitly Lovecraftian: a city divided over tainted blood, monsters hiding in plain sight. Maybe something is in the air, or maybe it's been long enough for Lovecraft to feel fresh again; in conjunction with Jordan Peele, HBO is producing a Lovecraft-inspired show about road tripping Jim Crow-era America, and we're getting two games based on the Cthulhu mythology, one (The Sinking City) from the developers of the beloved, deeply quirky Sherlock Holmes adventure games, another (Call of Cthulhu) from Cyanide, the studio behind mixed bags like  Styx: Master of Shadows, Blood Bowl, and a lot of sims.As Lovecraft's ugly views on race have undergone more intense scrutiny, it's splintered adaptations of his work: What to do with the parts that still work? Can you separate art and artist? Should you? Most ignore the question, and instead strip Lovecraft for the bits that still invoke curious horror, and ignore the underlying ideology that might have ultimately fueled their creation. While the HBO show has yet to premiere, its premise suggests an alternate path: embed the problems into the work, acting as a form of subversion and critique. At least with  Bloodborne, it's not explicitly citing Lovecraft. That's not true of these other games. It's the pitch, and the moment you make it part of the pitch, how you do (or don't) engage with the author is suddenly fair game. Call of Cthulhu, launching today on every platform but Switch, has no interest in any of this. It's not Lovecraft through a modern lens, reflecting the person and the person's work. It's—you'll never guess!—a mysterious island off the coast of Boston, a cult, strange visions embedded into dreams, and tentacles. Lots of tentacles. This is Lovecraft at its most basic, broken down into a formula. This, plus this, a sprinkle of that—Lovecraft! \"You, person who likes Lovecraft,\" the game posits, \"don't you want another thing with some Lovecraft stuff?\" Replace Lovecraft with [insert notable horror genre] and, well, yeah, that's basically true. I've watched and played all the good stuff, and while I wait for the next surprise, I'm digging around for something that's familiar, or does one or two things interesting enough to justify time with it. It's a bar that tends to get lower over time, and you’re left arguing over scraps. Call of Cthulhu is the gaming equivalent of a late night SyFy movie: schlocky as hell, without apology. There are no surprises hiding here. The story goes exactly how you'd expect. What it does well, it does mostly okay. What it doesn't do well, it does very poorly. It's comfort food in tentacle form, the kind of game you'll blow through in a weekend, and forget what happened by the next, but in the moment, hey, it was enjoyable enough.Players assume the role of Pierce, a down-on-his-luck private investigator with a taste for alcohol, recruited to investigate strange goings-on related to the death on a nearby island. The reason he agrees to take the case is truly bizarre—he looks at a weird painting and agrees it is, in fact, weird—but horror's never needed particularly persuasive reasons to put people in a compromising position, and  Call of Cthulhu is happy to keep the tradition alive. The island he arrives upon isn't doing much better than he is. The former whaling town hasn't seen much economic success since the surrounding water stopped offering up things to catch. Everyone is hungry, angry, and drunk. (It's technically the prohibition era, but that's not stopping anyone, including Pierce). It's a desperate, sad place, exactly the kind of location ripe for manipulation by cosmic forces bent on emerging from an endless slumber.I hadn't seen much of Call of Cthulhu before turning it on, and I expected some kind of pseudo action adventure game. It's what these games always seem to lean into eventually, once the story swings into gear and the veil drops, and it never works to their advantage. What I was pleasantly surprised to find was a game largely devoid of confrontation, of shooting. It's steeped in creepy atmospherics, and you spend large chunks of the game walking around, exploring, and talking to people. The talking parts can be strange—do not get me started on the \"Boston\" accents—but it's the kind of mixed bag that's charming in is badness. It's earnest and true, and I found myself warming to the game over it. It would be overstating to describe the characters as nuanced, but there's enough to chew on, despite the doom hanging over everyone's head. It's sorta like how you end up rooting for the one likable character in a slasher movie, the person you hope does the sensible thing and runs away? For me, in  Call of Cthulhu, it's the lovable local cop who is clearly over their head and very much bad at their job, but he's so dang nice! Run away, man.But this larger point is worth underscoring: most horror games are about running away from monsters, about fail states. Most horror games don't want you to die, preferring you make it away by the skin of your teeth, but that's not usually how it works. Death is often central to horror narratives, but its functional use in video games is often incompatible thematically.  SOMA is a terrific example.  SOMA has, games or otherwise, one of the most powerful, arresting stories in sci-fi from the past 10 years, but the follow-up to  Amnesia: The Dark Descent also carried over the once-successful template—hide in the dark, try to run past monsters, rinse and repeat—in a way that undercut the storytelling. Consequently, a lot of people who would have loved  SOMA didn't play  SOMA. (Recognizing this, the developers later released a patch addressing this with a story-focused game mode.) For most of the game, Call of Cthulhu ditches horror's worst impulses, and lets you just  be in a world. \"As Lovecraft's ugly views on race have undergone more intense scrutiny, it's splintered adaptations of his work: What to do with the parts that still work? Can you separate art and artist? Should you? Most ignore the question, and instead strip Lovecraft for the bits that still invoke curious horror, and ignore the underlying ideology that might have ultimately fueled their creation.\"Mostly. There are a handful of deeply frustrating sequences, one nearly game-breaking, where Call of Cthulhu betrays its strengths. You need to run from a monster in a game with bad controls. You need to hide from a monster in a game with bad stealth. Normally, this stuff doesn't matter; bad controls in a game where you're walking around storefronts and creepy mansions to look at shelves and occult objects is fine. Bad stealth in a game where the only way to \"lose\" is by literally walking in front of a group of cultists who are on the other side of the room is acceptable. It's when  Call of Cthulhu tries to be something it isn't the game falters.The worst moment, involving a tiny room where a monster is stalking you and it's utterly unclear how you're supposed to escape, only came to a conclusion because I gave up on engaging with the horror. Instead, I would die, sprint to a new part of the room, interact with an object, die, and try again. Eventually, I found something that triggered a unique piece of dialogue, and I was able to move on. I wouldn't blame anyone else for turning the game off.Maybe this is partially unavoidable. Call of Cthulhu is one of those increasingly rare beasts: a B-game. There is a reason this game is being sold for $45, and not $60. $45 is a weird ass number. This ain’t Assassin’s Creed, but what is it? At a glance, it  looks like something that comes from the AAA realm, but in reality, it's made on a much smaller budget, in ways that show up aesthetically (awful animations, terrible voice acting, subpar game performance, typos galore in the subtitles) and mechanically (it's not fun to control). The best version of a B-game would try to work within those constraints (Vampyr, published by the same company putting  Call of Cthulhu out, is another game with similar issues), but the nature of a B-game often involves a game fruitlessly fighting against those constraints. The audaciousness is appealing: \"It's wild what they're trying to do, given the circumstances.\"Over the six or so hours I spent with  Call of Cthulhu, there were enough times its earnest weirdness won me over that I stuck with it. It’s hard to explain. Sometimes, I kept playing because I was trying to figure out the inscrutable mechanics. (There’s only one shooting section, but it doesn't involve aiming beyond pointing the gun in a general direction, and your ability to succeed seems built on how many points you've put into the strength category??) Call of Cthulhu is also an RPG of a sort, but its RPG mechanics are hard to parse. In the game's opening, you're asked to assign a bunch of points to various stats—strength to be aggressive in conversations, psychology to pick people's arguments apart, investigation to see more objects in the world, etc.—without the game giving a meaningful explanation for why one might be useful over the other. I ended up picking at random, and it didn't seem to matter much? You end up earning enough points over the course of the game to upgrade almost everything. And when the game does offer up a chance to roll the dice on one of your stats, not only does the game not display what percentage change you have to pull it off, it's often not even clear if you succeed or fail because the game doesn’t ever make it obvious. It's also never said if the story diverges in a meaningful way based on these choices, so it mostly comes across as a superfluous chance to role play Pierce in some very mild ways.Except...Pierce isn't given much depth, and he's mostly an empty avatar. I found that weirdly liberating. In games where I become invested, I default to trying to do the right thing. (I'm finding this troublesome in Red Dead Redemption 2, where the cutscenes often reinforce the idea that Arthur Morgan sucks.) Good ending, here we come. I felt no such deference to Pierce in Call of Cthulhu, and early on, decided this trip outside of Boston would go poorly for the PI. If there was a drink nearby, Pierce would sip.  Your destiny has changed. If there was an opportunity to read a book of forbidden knowledge, I'd take in every page. Your destiny has changed. When calls from beyond mortal dimensions asked for help, I praised at the altar of R'lyeh.  Your destiny has changed. Poor Pierce kept trying to fight the good fight, but the person pulling his strings was not a cosmic horror the size of a skyscraper, but a cackling 33-year-old with a mouse and keyboard. It didn't lead to an interesting ending, but the journey itself was darkly satisfying.Look, I watched the awful Tobe Hooper sci-fi horror flick  Lifeforce this week because I'd heard the zombie effects in the beginning were super cool. (And they were!) I'm  that kind of person, and it helps explain my affinity for the obviously flawed  Call of Cthulhu. If you were to review this game’s features in a very 90s fashion—graphics, sound design, gameplay, etc— it wouldn’t do well. It's not great, often it's not good, but there’s enough. There are a lot of games I’d call good but not interesting. I’d rather play the interesting ones. \"Recommending\"  Call of Cthulhu a strange proposition. The kind of person who'll be interested knows it. Experiences like this call to you, as if beckoning from a forgotten city beneath the waves.Follow Patrick on Twitter. If you have a tip or a story idea, drop him an email: patrick.klepek@vice.com. Have thoughts? Swing by Waypoint's forums to share them!Email is a thing."}