{"id": "Man Arrested for Threatening to 'Blow Up Restaurant' Says He Just Wanted to Take a Dump", "paragraph": "Photo: Education Images/UIG via Getty Images Look, we appreciate a good poop joke as much as the next 13-year-old, but if your alleged attempt at bathroom humor ends with a mugshot, an arrest warrant, and a pair of serious-sounding charges, you might be doing it wrong.  According to the Times-Picayune, 30-year-old Arthur Posey walked into a Willie’s Chicken Shack in New Orleans at about 7 PM Tuesday night. According to Posey, he commented to a female manager that he was going to “blow the bathroom up” and—again, according to him—what he meant was that he was going to take a massive shit. (Arthur, regardless of how this all shakes out, you need to work on your game.)  But according to the  manager, Posey strolled into the restaurant, walked toward the food-prep area, and asked her how late the restaurant stayed open. She told him she didn’t know (side note: YOU’RE THE MANAGER, why don’t you know this???), and he told her “Y’all about to close right now, because I’m going to get a bomb and blow this place up.” She reported the incident to the Chicken Shack’s general manager, who advised her to call the police.  Posey had left the restaurant by the time the officers arrived, but they spotted him walking into a different business on the next block. He told the cops that he didn’t have a bomb, and just meant that he was about to “blow the bathroom up” with a swift, unyielding bowel movement.  The police didn’t buy it—especially not after the manager said that Posey never mentioned a bathroom to her. A second employee told officers that she heard him say that he was “going to get a bomb and put it under the middle table of the restaurant closest to the front door,” which sounds both weirdly specific and strangely… not at all like what the manager reported.  Posey was taken into custody, and is facing two counts of “communicating of false information of planned arson,” which has to be one of the most grammatically awkward charges a person can face. Orleans Parish Magistrate Judge Harry Cantrell scheduled a mental competency hearing for Posey on November 29.  If Posey’s account of events was true, we hope he found a bathroom. Subscribe to Munchies."}