{"id": "Senators Question Wireless Carriers Over YouTube, Netflix Throttling", "paragraph": "Image: Flickr/Mike Mozart Three Democratic senators are questioning major wireless carriers about recent reports that they routinely throttle video apps, often just to make an extra buck. Democratic senators Edward Markey, Richard Blumenthal, and Ron Wyden this week sent letters to AT&T, Verizon, Sprint, and T-Mobile that pressured the companies to provide more detail on recent research that found carriers arbitrarily throttle video apps like Netflix or YouTube, often with little concrete justification and even less transparency. In September, Northeastern researcher Dave Choffnes found that wireless carriers, while insisting that they only throttle these apps to manage network congestion, often throttle video apps in a bid to drive users to more expensive plans. Verizon’s website notes that the company limits video streaming quality on some of its “unlimited” data plans unless users buy a more expensive plan. Choffnes also recently found that Sprint was throttling the performance of Skype without informing consumers of the limitations. Sprint denied this when contacted by Motherboard.  Choffnes told us he hopes that his team’s data can provide accountability and transparency in the wake of the repeal of net neutrality rules last June.   Erecting arbitrary network restrictions simply to make a buck is a practice that net neutrality rules were supposed to prevent, the senators argued in their letters. \"All online traffic should be treated equally, and Internet service providers should not discriminate against particular content or applications for competitive advantage purposes or otherwise,\" the senators wrote.  The senators added that the throttling discovered by Choffnes and his colleagues “would violate the principles of net neutrality and unfairly treat consumers who are unaware that their carriers are selecting which services receive faster or slower treatment.”Read More: This Map Shows You How Much Money Every Member of Congress Got from Big Telecom The now-repealed net neutrality rules required that ISPs be transparent with consumers about the kind of broadband connection they’re buying, clearly noting any limitations a connection may have. Those requirements have since been replaced by entirely voluntary transparency requirements that ISPs are free to ignore at their convenience, and without repercussions.  That’s a problem, Choffnes recently told Motherboard, because telecom operators are naturally incentivized to hamstring potential competitors. “When an Internet provider targets a service for throttling, the playing field can tilt in favor of one service over another,” Choffnes told me in an email.  Senators Markey, Blumenthal, and Wyden asked the carriers to clearly detail precisely what kind of throttling they engage in, when these practices started, whether users can opt out of these limitations, and if consumers (and app makers) are adequately informed that certain services may face seemingly-arbitrary restrictions.  Whether anything will come of this inquiry is unclear. The net neutrality repeal order dramatically scaled back the FCC’s authority over ISPs, ceding any remaining oversight to the FTC—an agency that former FCC boss Tom Wheeler has argued lacks the resources and authority to adequately police giant broadband providers and wireless carriers.   And while the recent shakeup in the House could apply some greater oversight to Ajit Pai’s FCC in the form of public hearings, this erosion of consumer protections leaves the government rather toothless when it comes to holding carriers accountable until new laws are passed, consumer advocates have warned. If the FCC and ISPs lose a looming February court battle over the repeal, it opens the door to the 2015 rules being restored. If they win, a lack of meaningful oversight will give a green light to even worse ISP behavior, unless entirely new rules are crafted by a different FCC or Congress. Whatever the outcome, the senators’ letter gives wireless carriers until December 6 to provide detailed responses to the inquiry.  Get six of our favorite Motherboard stories every day   by signing up for our newsletter.Sign up for Motherboard Premium."}