{"id": "MoMA Is Finally Giving Legendary Black Artist Charles White His Due", "paragraph": "Not a lot of black people know who Charles White is—which is equal parts heartbreaking and confusing, because it’s hard to overstate his importance as a black artist. White was one of the most successful and influential creatives to come out of the New Negro Movement. His striking, powerful renderings of seminal black figures (including Frederick Douglass, Mahalia Jackson, and Harry Belafonte) were featured on federally funded murals, national calendars, and even Hollywood film sets. He taught Kerry James Marshall. And yet, soon after his premature death in 1979, the art world (and, as a consequence, the black consciousness) largely forgot about him. But isn’t that often the case with black artists?The Museum of Modern Art’s (MoMA) new retrospective on White—the first major museum exhibition dedicated to him in over 30 years—feels like a necessary revisionist history lesson, an attempt to undo erasure of the artist’s legacy. Walking through the exhibition, it’s astonishing how White’s drawings  still deftly capture the black experience. He made figurative drawing a centerpiece of his craft, part of a personal mission to insert black bodies into the westernized canon of art. White put our innate beauty front and center, painting us in a divine, blemish-free light. At the time, the effort was novel and under-explored. Today, it’s on the tip of everyone’s tongue. Black bodies, and representation of them, have become the chief preoccupation of artists like Kehinde Wiley, Toyin Ojih Odutola, and Deana Lawson. The problems of yesterday are the problems of today.“I think Charles White has  long been overdue for a retrospective,” Esther Adler, associate curator at the MoMA, shares with VICE. Adler says MoMA’s interest in White increased after the museum acquired  Black Pope, one of his most popular works, in 2013. “We began to do more research and were struck by how limited contemporary scholarship is on him.” The Art Institute of Chicago was also realizing the dearth of knowledge and attention on White. So MoMA and the Art Institute collaborated on a joint retrospective (which was shown in Chicago over the summer, and is on view in New York through January). Cue: Charles White’s 21st-century moment.  Charles White: A Retrospective feels like an illustrated guide to black history. Black politics changed drastically during the artist’s lifetime, and his aesthetic changed in tandem. His work in the 1940s and 50s feels rooted in historicism, capturing the stoic nature of slavery-era black people hard at work, stony expressions on their impenetrable faces. By the 70s, however, White’s subjects and aesthetics loosen up, an obvious reaction to the Black Power movement. One painting from this era,  The Sound of Silence (1976), concerns itself with black street fashion. It features a boy with an afro wearing a oversized windbreaker, arms lifted as if he’s floating in space. There’s a hint of afrofuturism here—a cerebral, lush approach to capturing the black experience.Kerry James Marshall, ever a faithful student of White’s, recorded audio exclusively for the exhibition, speaking about how White inspired his work. The moment is powerful: an artist of today championing an artist of the past. It shouldn’t have to be this way—but nonetheless the solidarity is touching. “Kerry is very clear about the lineage there,” Adler explains. “I think he has long seen himself as a very vocal advocate for Charles White. Even before we did the show, I know a colleague at another institution said she had heard him mention Charles White at literally  every talk she had ever heard him give.” In fact, a lot of collaboration took place within the black art community to put this exhibition together. Howard University loaned two major works of White’s to MoMA. It’s hard not to think of the Brooklyn Museum’s  Soul of a Nation exhibition, which runs through February, in relation to  Charles White: A Retrospective at MoMA. They each highlight the ways in which black art is inherently political. The fact that two major black-centric exhibitions are running in New York at the same time is also stunning. It’s easy to fall into the trap of thinking that museums historically failed to represent black artists because there weren’t enough of us, or that black artists worthy of critical attention only came into existence, say, a decade or two ago. But the truth, which  Soul of a Nation and  Charles White: A Retrospective each beautifully illustrate, is that black people have been making great art forever. Museums are just now deciding to hang them on their walls. Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow André Wheeler on Instagram. Sign up for the best of VICE, delivered to your inbox daily."}