{"id": "Daily Horoscope: November 3, 2018", "paragraph": "The moon in Virgo opposes Neptune at 1:22 AM, bringing us very interesting dreams—just don’t let your imagination run away from you. The moon makes a harmonious connection with power planet Pluto this morning at 10:14 AM.All times EST.Your focus is on your friendships today, Scorpio, thanks to the moon in Virgo. The moon connects with your ruling planet Pluto this morning, bringing a powerful conversation your way. The moon is in hardworking Virgo, lighting up the sector of your chart that rules worldly success. Major moves are made towards earning money or building your career this morning! The moon is in fellow earth sign Virgo today, Capricorn, finding you in the mood to travel and learn new things. An exciting opportunity arrives this morning, but you have to be open to change. The moon is in Virgo, a sign that knows how to edit—whether that means editing an essay or your wardrobe. Virgo knows exactly what to cut. The moon is all about comfort; today, find comfort in cutting out what no longer serves you.Your focus is on your relationships today, thanks to the moon in your opposite sign Virgo, and some very powerful connections are made this morning as the moon connects with Pluto, the planet of transformation.The moon is in Virgo, finding you in a busy mood! This is a wonderful time to get organized at home and in your work. Powerful shifts take place in your career early today. The moon is in fellow earth sign Virgo today, finding you in a flirtatious mood! A burst of brilliant creative inspiration comes this morning. You’re ready to try something new. The moon in Virgo finds you in a nostalgic mood today, Gemini, and with the moon’s connection with transformative Pluto this morning, you’re seeing the past in a new light. The moon in Virgo lights up the communication sector of your chart today, Cancer, and a powerful conversation in your relationships arrives as the moon connects with transformative Pluto. The moon is in hardworking Virgo today, Leo, lighting up the financial sector of your chart. It’s a powerful time to work out issues in your day job and to take a look at your budget. The moon is in your sign today, Virgo—make time to love yourself! An especially sexy and creative energy flows as the moon connects with the power planet Pluto. The moon in Virgo asks that you slow down today, Libra. Virgo is a sign astrologers refer to as hardworking and diligent—but how can you get anything done when you’re so exhausted?  What's in the stars for you in November? Read your monthly horoscope here.  Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}