{"id": "Daily Horoscope: October 31, 2018", "paragraph": "Communication planet Mercury enters philosophical Sagittarius at 12:39 AM and Venus retrograde opposes Uranus at 4:45 AM, inspiring us to make some big changes (and to wear something especially unusual for tonight’s halloween festivities!). The moon in Leo clashes with the sun at 12:40 PM, asking whether we’re really heading in the direction we want to go in. Venus reenters Libra while on its retrograde journey at 3:42 PM, finding us reconsidering some important decisions.All times EST.Mercury enters Sagittarius today, bringing lots of money talk your way. Changes in your relationships take place, and you find yourself craving privacy as a result of Venus’s busy day. Communication planet Mercury enters your sign, finding you in an especially chatty mood! Mercury will retrograde in November, so don’t make promises you can’t keep. Venus’s shifts today shake things up in your social life. Your intuitive abilities are boosted thanks to Mercury entering Sagittarius! Venus opposes Uranus today, bringing drama to your social life, and then reenters Libra to find you reconsidering your career. The energy in your social life kicks up as Mercury enters Sagittarius today! Venus opposes your ruling planet Uranus, bringing drama your way—you’re ready for change. Venus reenters fellow air sign Libra, finding you reconsidering some important decisions. Things are about to get very busy at work as communication planet Mercury enters Sagittarius. Venus opposes Uranus, bringing surprising news your way. Intensity in your sex life and in your finances increases as Venus reenters Libra. Communication planet Mercury enters fellow fire sign Sagittarius, bringing exciting news from faraway. Venus is busy today, finding you making big changes around emotionally charged situations as well as reconsidering things in your relationships. Mercury enters Sagittarius today, finding you in deep conversation with your intimate partners. Important news about money comes, too. Your ruling planet Venus opposes Uranus, bringing changes to your relationships, and then reenters Libra, asking you to focus on self-care. Your ruling planet Mercury enters your opposite sign Sagittarius, stirring up important conversations in your relationships. Venus is busy today, bringing important changes your way and finding you reconsidering things in your creative life and your love life. Mercury’s entry into fiery Sagittarius finds you busy getting organized and tackling your to-do lists. Venus’s opposition to Uranus and reentry into Libra while on its retrograde journey finds you at a turning point in an issue concerning your home, as well as facing some drama in your social life! Communication planet Mercury enters fellow fire sign Sagittarius, bringing you plenty of excitement around romance and creativity. Surprises come today, and important decisions are reconsidered as Venus moves back into Libra. Your ruling planet Mercury enters Sagittarius, so expect lots of communication to take place around issues concerning home and family. Venus retrograde opposes Uranus and reenters Libra, bringing unexpected information your way and finding you rethinking your finances. Communication planet Mercury enters Sagittarius, creating a very talkative atmosphere! Your ruling planet Venus opposes Uranus and reenters your sign while on its retrograde journey, bringing surprises and finding you in deep reflection about love, money, beauty, and your values.  What's in the stars for you in October?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}