{"id": "Daily Horoscopes: November 13, 2018", "paragraph": "Illustration by Amanda LanzoneWe're craving whatever brings us comfort early this morning, as the moon in responsible Capricorn clashes with desirous Venus retrograde at 1:32 AM. Surprises arrive later in the morning when the moon squares off with Uranus at 10:13 AM. The moon enters air sign Aquarius at 10:45 AM and connects with lucky planet Jupiter at 1:05 PM, inspiring us to expand our minds.All times EST.The moon enters Aquarius this morning and lights up the home and family sector of your chart—security is on your mind, and even though you want things to be concrete today, you'll need to have faith that things will work out! The moon enters intellectual air sign Aquarius today, lighting up the sector of your chart that rules your mind. The moon will connect with you ruling planet Jupiter to bring exciting news your way! Your focus turns to money today as the moon enters Aquarius this morning. You’re a practical person, Capricorn, but your intuition will take you much further than logic. The moon enters your sign today, Aquarius, so make time to nourish your body and spirit. Fun energy flows, encouraging you to connect with your friends and meet new people. Be gentle with yourself today, Pisces; the moon will enter Aquarius this morning and put you in a sensitive mood. Make some time to be alone—a big breakthrough will arrive while you relax and daydream. The moon enters Aquarius this morning, Aries, lighting up the sector of your chart that rules your social life. Exciting opportunities, meetings, and ideas take place today! The moon enters Aquarius this morning, illuminating the sector of your chart that rules your public life and finding you focused on your career and reputation. Astrologers call you stubborn and stuck in your ways, but you can use the energy from today's moon in rebellious Aquarius to make a change.The moon enters fellow air sign Aquarius this morning, Gemini, encouraging you to take a risk. Exciting meetings take place today, and it’s a wonderful time to connect with your partners. The moon enters Aquarius this morning, illuminating the intimacy sector of your chart and making this a powerful day to connect on a deep level. Strong emotions are in the air, but practical matters are discussed, too. Your focus turns to relationships today as the moon enters your opposite sign, Aquarius. The moon connects with lucky Jupiter, creating a wonderfully romantic and creative energy! You’re in a busy mood today as the moon enters Aquarius, inspiring you to come up with creative new ways to get things done. Exciting shifts take place at home. The moon enters fellow air sign Aquarius today, Libra, finding you in a flirtatious mood! After a rocky morning, an inspiring conversation arrives.  What's in the stars for you in November?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}