{"id": "Daily Horoscope: October 25, 2018", "paragraph": "Illustration by Amanda LanzoneThe moon in Taurus connects with Neptune at 11:20 AM, creating a gentle and creative energy. The moon clashes with Mars at 6:18 PM, stirring aggression, but powerful connections are formed as the moon connects with Pluto at 8:15 PM.All times EST.A climax has been reached in a situation concerning a relationship, thanks to yesterday’s full moon—and today, you're still sitting in these feelings. An important conversation arrives as the moon connects with your ruling planet Pluto this evening. You are hard at work today, Sagittarius, and your creativity is flowing easily. This evening is an especially powerful time to work out issues concerning your finances. The moon is in fellow earth sign Taurus today, finding you in a romantic and artistically inspired mood! This evening is especially passionate—a devilishly good time is on the way. The moon in Taurus illuminates a very private sector of your chart today, and you’re in a nostalgic mood. This evening is a powerful time to work though heavy and deep emotions. The moon in Taurus lights up the communication sector of your chart today, Pisces, and while some frustrating conversations may come, your intuition is also boosted, and some powerful ideas will be shared tonight. The moon in materially-minded earth sign Taurus finds you reflecting on money and self-worth today, Aries, and collaborating with people who share your values is of the utmost importance at this time. A productive and powerful energy arrives this evening. The moon is in your sign, Taurus! You’ve recently learned a lot about what you want in your relationships, and today you continue to work through these issues. An intriguing opportunity comes your way this evening. The moon in Taurus illuminates a very private, quiet sector of your chart today, encouraging you to catch up on rest. Pay attention to the messages that arrive in your dreams. A secret is shared. The moon in Taurus finds you in an amicable mood today Cancer, but a touch of drama is likely to flare up, as people are in a passionate mood. Something you thought was chill and easy might turn out to be much more intense. The moon in Taurus lights up the fame and fortune sector of your chart, and while you might be the sign of royalty, you’re not afraid of working hard to earn your rewards. Today is a fantastic day to tackle your goals. The moon is in fellow earth sign Taurus today, Virgo, encouraging you to travel and expand your mind. A brilliant flash of inspiration arrives this evening, as does a hefty dose of passion. You’re working through very intense emotions today, Libra. If you’re having a hard time making a decision, reflect on these values to help you make the right choice: What would make you feel safe, secure, or at home?  What's in the stars for you in October?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}