{"id": "This Heavy Bonnie Baxter Mix Tastes Like Dirt and Rocks and Socks ", "paragraph": " Bonnie Baxter is capable of destruction. You might know that if you’ve seen her band Kill Alters play. At present, they’re an active part of New York City’s community of underground noise weirdos that Baxter dubs “mutants.” Over the past few years if you’ve ended up at any DIY space whose bookings tend toward the heavy and surreal, you’ve probably seen them shredding with Baxter upfront, often barefoot, eyes-rolled back, ranting and screaming into a throng of onlookers. It’s the sorta stuff that makes otherwise reasonable people wanna try to run through brick walls.  Today, Baxter released a solo tape on Hausu Mountain called Ask Me How Satan Started, and if you have any illusions that her work away from her band might relent even a little, allow me to relate a story of the first time I saw her play solo. In 2016, Baxter took the stage at a venue in Bushwick to open for the Chicago drone-improv trio Good Willsmith—two members of which run Hausu Mountain, incidentally. Armed with little more than a sampler she started playing these absolutely punishing beats, battering the assembled crowd until a strange smell started seeping into the room, and then a haze. The problem soon became clear as the sound engineer rushed to the stage where a monitor was pouring out smoke, literally unable to handle the bass frequencies Baxter was sending from her setup. “I thought someone turned on a fog machine,” she remembers via email. “I apologized. I’m not trying to break other people’s shit.”  Whether she wants to glorify the sonic vandalism or not, that tale is telling of the sort of music she makes, just unspeakably heavy, endearingly absurdist takes on hard techno tropes. On  Ask Me How Satan Started, the sounds are furious, uncoiling with the anarchic energy of the Industrial Strength Records catalog, but they’re funny too—it more or less starts with her assuring someone that she’ll punch them in the nards. So it’s kinda a weird thing, a beat-heavy noise tape with dick jokes. But if that sounds like your sort of trip, or if you just wanna get pummeled, it’s worth your time.  In celebration, Baxter also put together a mix for Noisey which includes a fair few of her friends from around the freak scene. It’s got blistered beats, slapstick sound collages, and a few exclusive collaborations with some of her close buds. It’s bracing, but ecstatic, exactly the sort of thing you’d hope for form this one-person wrecking crew. Listen loud, it probably won’t break your speakers.  Noisey: How are we meant to enjoy the mix? What's the perfect setting?Bonnie Baxter: Where you’d be least distracted  Is synesthesia a real thing, and if so, what color is this mix?I taste dirt and rocks and some socks.  Was there any specific concept to the mix?I wanted to include music I love by friends and music that I feel connected with overall.  Do you have a favorite moment on this mix?I got Pepper Mill Rondo’s satan rant stuck in my head.  In your email you described this as a “Heart/Mind” mix. I think a lot of people hear noisy, lo-fi music and immediately think it comes from a place of anger or dejection. Does calling this mix Heart/Mind suggest that you get something else out of this music?I like music that I feel connects to my heart/mind, which is the music you get lost in, that shifts attention away from the brain and connects to the heart. The heart/mind conveys actual ideas, information and images to the brain where these signals are then converted into words, pictures, sounds etc. The brain is powerful but the heart field envelopes the entire body and extends beyond that. This is real science. Ok. You know what I mean. Listen to your heart, listen to your farts.  This mix has a couple of tracks from people who kinda operate in the same weirdo NY underground that you do. Do you feel a sense of community and kinship right now?Yes, we call them MUTANTS. And it’s real kinetic energy happening right now. Just gonna do an NYC mutant blast here. Dreamcrusher, Deli Girls , Machine Girl, Show Me The Body, Slauson Malone, Buttress, Channel63, Ade Hakim, Eartheater, CENO, CORPUS, King Ultra Vision, Rafia, Bearcat, Alem Worldwide, Via App, Bookworms, YOKUBARI, NO LIFE..  Tell me about   Ask Me How Satan Started . I know it went up on your bandcamp a few months ago, and now it’s properly out through Hausu Mountain, but where did these tracks come from? Were there any unifying principles or themes?I had been planning to record this in one take much like how I would playing live with my Korg Electribes. I had written out a rough set so I'd have the core. I also played with recorded samples of my voice through an iPad. The Kill Alters Archive where I have a conversation with my mom about good vs evil as a little girl was then added in and the very last track “Satan’s Angels” was a track I recorded after sending the tape to Hausu Mountain. Some of these tracks actually were actually intended for Kill Alters too but ended working better for this tape.  Tracklist:\"We Are Lift Boys\" - Lift Boys A.K.A. (EYE)\"live improv\" - Prolaps (Bonnie Baxter X DJ Machine Girl)\"He’ll Give You Six\" - Pepper Mill Rondo\"Machines Against The Rage\" - qebrus\"Singing a song\" - Kill Alters Archives\"AWAWAW\" - SAICOBAB\"Which Fork (YOKUBARI and Jeremy Hyman remix)\" - L’Rain\"live Improv\" - Prolaps (Bonnie Baxter & DJ Machine Girl)\"Stay, Go (Geng Silver Abyssmal Remix)\" - L’Rain\"Pelvic Floor Limited\" - Yasushi Yoshida X Kill Alters\"Roach On Dope\" - Machine Girl\"Burn The Witch\" - LSDXOXO\"Amnesia\" - Special Request / \"Lesser Artist Borrow, Great Artist Vape\" - Pepper Mill Rondo\"Nobody Cares\" - Kill Alters Archives\"Iceman icky grimy mix\" - Buttress\"Ghost Lover\" - Lee song 1980’s (Kill Alters Archives)\"Axiom\" - Bonnie Baxter\"Choo Choo Choo I can I can\" - Kill Alters ArchivesGet the best of Noisey, delivered to your inbox every day."}