{"id": "Stream of the Crop: 12 New Albums for Heavy Rotation", "paragraph": "L: Gregg DeGuire/Getty ImagesR: C Flanigan/Getty ImagesEvery week, the Noisey staff puts together a list of the best and most important albums, mixtapes, and EPs from the past seven days. Sometimes it includes projects we’ve written about on the site already; sometimes it's just made up of great records that we want everyone to hear, but never got the chance to write about. The result is neither comprehensive nor fair. We hope it helps.In 21 minutes, Khalid goes from American Teen to a journey of manhood on Suncity. The Texas singer’s velvety vocals are effortless on tracks like “Vertigo” and “Saturday Nights,” but he finds what are likely to be his next commercial hits at the tail-end of Suncity. “Better” and the title track find Khalid back in his role as American latest R&B heartthrob. —Kristin CorryThese faux-gritty moments on  Nuthin' 2 Prove seem particularly strange because business is booming for Yachty these days, and much of his commercial success appears to have come as a result of his breeziness. He was the face of Sprite in 2016; he covered \"It Takes Two\" with Carly Rae Jepsen and Mike Will Made-It for a Target campaign last year; in what seemed to be a Mad Libs-generated snapshot of music in 2018, he collaborated with Donny Osmond for a goddamned Chef Boyardee commercial. I'm assuming that the execs behind those deals didn't put contracts in front of Yachty because they were looking for the next-best thing after 21 Savage turned them down. I imagine they wanted the guy who could convincingly rap the line \"positivity is what made us famous\" while standing next to a Canadian pop star. —Alex Robert RossIn one of his earlier interviews, Tom Krell spoke about a kinship he felt to makers of harsh, atonal, performative music. “If the ethos of noise is just to throw yourself out there spiritually, to visibly rend yourself in public, then there should be a recognized commonality between what Prurient does and [what I do],” he said. That streak for emotionally and conceptual wooliness hasn’t been as obvious in the work he’s made over his last couple of records, but he returns to the haze that birthed him on his new record  The Anteroom. It’s by and large a creeping and quiet record, full of unraveling samples, ghostly poetics, and the distant skitter of hi-hats from a distant warehouse raves. It’s not noise, but it further underscores the point he was making in that comparison, if you’re really willing to open yourself up spiritually, strange stuff can leak out. —Colin JoyceUs is a lighter listen than what’s come before, and it feels more polished and expansive than her debut. The whole thing is full of glorious airy pop sounds, her lithe, lilting vocals guiding us through life’s adversities like the light waves of a lake. Take single “Trust Me Baby,” which sees her imploring “We could do each other more love than harm / If you just, you just trust me, baby” over shiny, luxurious clouds of synth. Written down, it sounds like a troubled, frustrated request—but through it’s breezy delivery,  Us finds Rodriguez more at ease and, well, happier. —Shaad D'Souza, Empress Of Took a Step Back and Reinvented Her Pop SoundCloud Nothings are heavier, meaner, quicker, punchier, and more vital here, on their fifth LP, than they've ever been before. Dylan Baldi has rediscovered the fury that gave  Attack on Memory and  Here and Nowhere Else their nihilistic power; Jayson Gerycz is once again the most propulsive and energetic drummer in modern rock music; their verses kick and scream; their choruses are immediate. And don't get me wrong here—I liked 2016  Life Without Sound, the first album on which Baldi actually worked on his lyrics and picked himself apart. I'm just glad that he's managed to meld that thoughtfulness with some righteous anger and breakneck melodies again. Lines that'll stick with you forever after just one listen: \"They won't remember my name / I'll be alone in my shame,\" \"Don't give him your / Don't give him your life if it's not right,\" \"I wish I could believe in your dream.\" —Alex Robert RossJessie Reyez is only at war with herself—or at least that’s what it sounds like on “Saint Nobody,” the opener of her debut album Being Human in Public. After releasing Kiddo and a string of loose singles, the Toronto singer is approaching R&B with a “by any means necessary” mentality. “If tomorrow never comes, I’ve got my gun’s loaded,” she sings. Reyez carries the brash attitude of a rapper in her lyrics like when she details relationships on “Fuck Being Friends.” “I got your heart in my hand and your dick in the other / You ain’t scared to fuck, but you’re scared to be lovers,” she sings. Being Human in Public is a balancing act of vulnerability and nonchalance and Jessie Reyez teeters that line just fine.—Kristin CorrySummer Walker has the type of voice that sounds like a rainy Sunday afternoon. It hugs you, but not too tight, and leaves plenty of space for reflection. On “Girls Need Love,” a single questioning the connotations behind a woman requesting affection, Walker takes a SZA approach to her songwriting: frank as hell. She doesn’t coat her lyrics in colorful prose, and that’s what makes Last Day of Summer feel as agonizing as the first day the fall breeze tickles your neck. “Prayed Up” is a checklist of the methods she uses to cope, like smoking, drinking, or sex, but remembering that staying in prayer is what ultimately keeps her demons at ease. Her 28-minute debut are excerpts to the diary of a woman who isn’t afraid to admit she’s flawed. —Kristin CorryIn the shadow of Guy Fieri’s Smokehouse, a few hundred attendees—mostly white, working class folks of all ages—cheer on the matches leading up to Eagle vs. Jonze. The smell of chicken tenders and pulled pork is pervasive. I hear a wrestler unironically call someone \"brother.\" It’s humid from a harsh summer storm, and the scene is confusing as ticket-holders struggle to find seats while the spectacle captures the attention of passersby— visiting business people and tourists—who stop to gawk from the sidewalk and wonder what they’ve stumbled upon. —Michelle Eigenheer, Inside Open Mike Eagle's Wild, Sweaty Pro Wrestling DebutPer the title, Famous Eno’s debut for Manchester dancefloor futurists Swing Ting is a functional and ecstatic set of pure sundown heat. Enlisting a crew of trusted collaborators from around the world of the kick drum contortionism that gets lumped under the umbrella of “club music,” Eno twists on tropes from Jersey, Jamaica, London, and elsewhere to broadcast his utopian vision of dance music in the internet era. It’s pretty hype, is what I’m saying. —Colin JoyceA new prank/project from the proprietors of the Chicago label Hausu Mountain promises “music” (quotation marks theirs) made from “roughly 420,000 samples” (blaze it). The title stands for ”Ecstatic Dissonant Mashup” which hints at what you’re getting here: quasi-tonal sample-slurries that are equal parts Youtube Poop and proper plunderphonics. You’ll laugh, you’ll cry, you’ll get kinda dizzy, and then throw up rainbows or some shit. I would say buyer beware, but the tape’s only a dollar so you can’t really go wrong. —Colin JoyceThe two trash-pop upstarts Rook and Girls Rituals proved on their team-up earlier this year as Black Dresses that they’re uniquely talented at excavating trauma and turning the worst shit the world has to offer into noise that’s as infectious and upsetting, like a pair of cheerleaders chanting at a funeral. Their latest EP sinks their talons in deeper, offering moments both catchier (the grinning rave-up “SEXY VAMPIRE”) and more crushing (the stuttering, scuffed, phlegm smeared title track). A working thesis statement for the whole freaked-out nature of the Black Dresses project is screamed by Rook on “U DONT KNOW”: “yeah I'm so cute and scared and small, but I’m not FUCKING OKAY.” —Colin JoyceFollow Noisey on Twitter.Get the best of Noisey, delivered to your inbox every day."}