{"id": "your selfies actually make you (post)human", "paragraph": "Images via InstagramThis article was originally published on i-D France.Silicon Valley, Winter 2010. Apple adds a little camera to the front of its new iPhone — a minor change, seemingly more of a shift than a major technical revolution. And yet this propelled the world into a new, modern era: that of the selfie, of narcissism 2.0, of filters and fluid identities — in short, the era of post-humanism. Ever since, our lives have been inundated with faces — laid bare for “no makeup challenges,” submerged under layers of filters, hidden behind hyper-virtualized avatars. So, what do all these modern “masks” say about us, anyway? Our faces — seemingly the most obvious of things, the external screens of our immutable identities — have become an endless canvas for self-definition. In a single click, you can age 60 years, transform into a giant donut, or swap your face with your Uncle Gerard’s. The sky’s the limit. In  Faceworld, a dense but riveting book, researcher and theoretician Marion Zilio traces the history of our faces from humanity’s origins to the selfie era. I got in touch with Zilio to discuss how selfies allow us access to previously hidden parts of ourselves. Filters, surgery, apps — all are ways of modifying your face. Are faces as we know them threatening to disappear?Underneath all the filters, the face is indeed disappearing, or perhaps reinventing itself. In French, face is  visage — etymologically, it refers to the visible. But what’s visible is always a mix of what’s shown and what’s hidden. The face has to be destroyed so it can reappear in a better guise, so it can reinvent itself not in terms of what it shows but what it  wants to show. People reinvent themselves according to the codes of the class they want to belong to. In your book, you posit that the face is an invention. What do you mean by that? This is where we have to look back into history. The 19th century farmer had no access to his face. Portraiture was for the elite only; the masses had no representation. Mirrors were considered precious objects. It was only with the arrival of industrial society that people became aware of their faces. Until then they hadn’t been able to see their faces except at the barber’s or the milliner’s, or reflected in water. Our ways of relating to ourselves and others changed; the world changed. Before, you couldn’t take your portrait with you — it was impossible to transport a reflection, or even a painting. So then to have that access to a “frozen” image of yourself on an object — that allowed the individual to step outside himself, literally. The portrait became necessary; it was the beginning of identity photos. And certain codes came into being, too: people got photographed in order to be affiliated with a certain class. So did portraiture help establish stereotypes of gender, class, and race?Yes, the practice of portraiture did contribute to the establishment of stereotypes, of fixed identities. I’d even say these identities were created as tools of control — so that everyone had to stay inside the box they had been assigned. There was the worker, the bourgeois, the rich man, the poor man, etc. The face served to present indicators that were very binary. Today, the notion of self is complex and becoming ever more fluid. But screens, mirrors, and filters used to be alienating before they became tools of emancipation.  Would you say that this current transformation of our faces allows us to set ourselves free from our identities?Yes! And that’s linked to the evolution of technology. When photography was new, society was obsessed with the idea of movement; the steam train had just made its debut. As soon as representation gets unfrozen, so does the whole concept of identity. That un-freezing process started in the 19th century, but it’s taken a lot of time to move forward. The ways identity and faces become malleable depends on what techniques are available. In art, the futurists and then the avant-gardists also contributed to the fragmentation and modulation of identity and the ways faces were depicted. At that time, psychoanalysis was developing as a discipline throughout the world — it’s interesting to think about all the different ways progress was made. So have we become our own creators? Well, I’d say that before, the individual had a greater need to be looked at by others in order to feel validated. Then over time, we became our own observers. On social networks, we watch ourselves; you get enamored by your own reflection, and you don’t [seek] the validation of others any more. We’ve built a relationship with ourselves that’s a bit autonomic. In a sense, the selfie is a reopening of the communication channels. When you post a selfie on Instagram, it can reach someone on the other side of the world, on another time zone. It wasn’t so long ago that people encountered, at most, 3,000 people over the course of a life. Whereas today, you have access to that number of people the instant you log onto Facebook.   So do selfies allow us access to previously hidden parts of ourselves?Yes, the invention of altering apps is allowing us to experience a new type of \"otherness.\" You can transform yourself into a cat, a pumpkin, a bike wheel… Nowadays, it’s fashionable to think about a type of \"inter-kingdom\" that includes not just humans but all living creatures. I think that’s a trend that’s here to stay. Can a selfie help people connect with each other?Yes, or it can help you connect with yourself. Adolescence, for example, is a period of life where your face is changing all the time, your identity is unstable, you’re searching for yourself. So selfies are a means for the adolescent to reclaim his or her image.suscribe to i-D's positive vibes."}