{"id": "Russian Woman Charged With Influencing US Elections on Social Media", "paragraph": "Image: Shutterstock On Friday, the Department of Justice charged Elena Alekseevna Khusyaynova—a 44-year-old woman from St. Petersburg, Russia—with conspiring to influence US elections including the upcoming midterms on social media. The indictment marks the first official acknowledgement that Russians are working to influence the 2018 midterm elections.  Khusyaynova was allegedly the chief accountant for “Project Lakhta,” a Russian effort composed of hundreds of people and numerous entities including the notorious “troll factory” Internet Research Agency (IRA). The program began in 2014 and was meant to sow political division in the US through social networks, according to a press release by the Department of Justice. Khusyaynova is accused of managing the financing for the project, which was aimed at conducting “information warfare against the United States,” as the organization allegedly called it internally.  “Since at least May 2014, Project Lakhta’s stated goal in the United States was to spread mistrust towards candidates for political office and the political system in general,” prosecutors wrote in the indictment.  The disinformation campaigns, according to prosecutors, focused on topics such as the Second Amendment, race relations, LGBTQ issues, and the NFL anthem debate. The members of the organization had the goal of creating “political intensity through supporting radical groups” and “[aggravating] the conflict between minorities and the rest of the population,” according to the DOJ.    Do you have a tip or a story to share? You can contact this reporter securely on Signal at +1 917 257 1382, OTR chat at lorenzofb@jabber.ccc.de, or email lorenzofb@motherboard.tv To convincingly pretend they were regular American voters, the Russians working in the disinformation campaign used Virtual Private Networks and created “thousands” of fake profiles and emails with names like Helen Christopherson and Bertha Malone, according to prosecutors.  Khusyaynova and the other members of the project “operated fictitious social media personas, pages, and groups designed to attract US audiences and to address divisive US political and social issues or advocate for the election or electoral defeat of particular candidates,” the indictment reads. For example, the operators used sockpuppet accounts on Twitter to attack Democratic Missouri Senator Claire McCaskill, and to support Democratic candidate Doug Jones in Alabama.  The Russian operators also convinced real Americans to participate in the effort by moderating Facebook groups, the indictment claims.  “Hey girl! How u doing?” one of the Russian operators wrote to someone only identified as US Person 2 over Facebook. “Remember u wanted to help me with that page i’m working on? It’s a little bit unorthodox, but nwm that. Content is not of my choosing. So what tell ya? Help a sister out?” Khusyaynova faces charges in Alexandria, Virginia.   Get six of our favorite Motherboard stories every day   by signing up for our newsletter.Sign up for Motherboard Premium."}