{"id": "The Australian Strawberry Needle Bandit Has Been Arrested", "paragraph": "Australia’s two-month nightmare seems to have come to an end, as authorities apprehended the person they believe to be originally responsible for hiding sewing needles in strawberries. On Sunday afternoon, the Queensland police announced that 50-year-old My Ut Trinh, a former supervisor at a strawberry farm in the region, was arrested. Trinh appeared in court Monday morning, and was charged in connection with seven cases of the dangerous food tampering that started spreading throughout the country in September. According to ABC, she was “allegedly acting out of spite and […] it was an act of sabotage.”The hysteria started when a woman was hospitalized after swallowing a needle that was hidden in a strawberry, which understandably roused the public into a panic. A man was later hospitalized when he swallowed half of a needle as well, and a seven year-old girl bit into a strawberry her mother had given her also to find a needle.Swiftly, Australian government officials moved to pass new laws that would raise the minimum sentence for food tampering from 10 to 15 years in prison, as well as the sentence for  faking such an incident to 10 years. (Authorities identified at least 15 incidents of needles found in strawberries to be hoaxes, put there by the person making the claim of discovery themselves.) Prime Minister Scott Morrison called the criminal out in a video just before the new laws were pushed through, calling them an “idiot” and “cowardly.”In all, police confirmed 186 reports of needles found in strawberries, affecting 68 strawberry brands, most of which were from the Queensland region. The Queensland Strawberry Growers Association originally identified the “Berry Licious” and “Berry Obsession” brands as the first to be contaminated, and ABC Australia reported that Trinh had formerly worked as a supervisor at the former, though not as a picker or packager. While it was a frightening time to be a strawberry eater for the last eight weeks, it was also not a great time to be a strawberry farmer. The widespread fear of the produce led to massive recalls, and even destruction of the crop on site at the farms during the peak of their harvest time. The strawberry industry brings in about $160 million Australian dollars yearly. “It was a crisis driven by social media and the only real victims were the strawberry growers, and to some extent other Australian fruit growers and exporters,” the Queensland Strawberry Growers Association commented in a statement released yesterday. They expressed concern that, since Trinh was only charged in connection with seven cases, that there were so many more unknown copy-cats out there that remained at large. They did note that sales have begun to return to normal. “All farmers and growers sincerely hope there will not be a repeat of past events.”Trinh remains in custody without bail, as prosecutors believed that she might be at risk of people seeking “retribution.” Here’s to hoping that any other sociopathic pranksters out there stay the hell away from the rest of Australia’s berries. Subscribe to Munchies."}