{"id": "sunny suljic is the skate-obsessed star of 'mid90s'", "paragraph": "Stills courtesy of A24Whether or not you grew up skateboarding,  Mid90s hits you in all the right spots. Set in 90s California, Jonah Hill’s directorial debut follows the experiences of a young, shy boy named Stevie, played by 13-year old Sunny Suljic. A lonely kid raised by a single mother and bullied by his older brother, Stevie struggles with finding his place in the world. However, this all changes when he begins to forge friendships with a group of older neighborhood skaters. It is through these new unions that Stevie’s world opens up and he begins to really experience life — both the good and the bad. The film truly shows the versatility of Hill’s talent. Oscillating between moments of intensity and hilarity,  Mid90s captures the indescribable in-between feeling that characterizes growing up. And much of the film's authenticity can be credited to the knockout performances from its energetic young cast — including a few skaters from Suljic's California-based crew, Illegal Civilization. Illegal Civ founder Mikey Alfred, a co-producer on  Mid90s, introduced Suljic to Hill when he hear the director was scouting actors at local LA skate parks, much to the then-11-year-old's astonishment. Luckily, Hill was equally impressed. The director didn't actually realize at the time that Suljic was also a professional actor, having appeared in Yorgos Lanthimos's 2017 thriller The Killing of a Sacred Deer.i-D recently caught up with Sunny to talk about landing kickflips, learning to fail, and respecting 90s skate culture.   Mid90s really reminded me of my own coming of age experience. I actually got pretty emotional a few times during the movie.Oh, that’s nice! That’s super sick. Hey, I am so happy that you liked the film, and that it made you emotional, because that is so tight.I cried a few times in the back of the screening room.I am really happy that everyone could just help make that happen. I think it is so cool that people were able to open up and get emotional because it’s hard for films to really make that happen. The movie is very relatable no matter where you grew up. How did you get involved with   Mid90s ?So, Mikey Alfred [from Illegal Civilization and co-producer of  Mid90s] was trying to bring in as many kids that skate around Los Angeles. He showed Jonah [Hill] my Instagram and Jonah was pretty excited from the start. I think Jonah had a good idea of what he really wanted already and Mikey knew my local [skate] park was Stoner [Skate Plaza], so he brought Jonah and Lucas [Hedges] and introduced me to them. I was just skating and saw them pull up. [Mikey] called me over, he said he wanted to introduce me to his friends. I was so confused. They just came up to me and said, “I saw you skate, you’re really good.” I was like, “What! This is insane.”Jonah then started talking to me about acting and if I had any acting experience, and I told him I had been acting for about six or seven years. I think he was probably thinking, “Oh, he acts in school or tries to do commercials.” But I told him that I was in  The Killing of a Sacred Deer and Yorgos [Lanthimos] directed it, and Jonah is pretty good friends with Yorgos. Jonah talked to Yorgos and Yorgos put in a very, very good word for me. I think Jonah may have already made up his mind before I even auditioned. So I auditioned, got call backs, and then got casted.  How did you prepare for the film?We did a lot of rehearsing, me and Jonah. The minute I got casted, by the next weekend he said, “We’re going to go rehearse at this place in Salt Lake.” And we were just going over the script, Mikey was there too for a lot of the rehearsals, just helping out. I did a lot of solo rehearsing and then some with Katherine [Waterston], sometimes with Lucas, sometimes with Katherine and Lucas. There were a lot of scenes that were cut out, too — the movie was about three hours in the beginning, during the rough cut, and then it got [cut down] to 80 minutes. I probably read the script over 20 times. Jonah was ready to just throw away the script even though he wrote it for three years, he was just going to throw it away and let us all improvise. I think all of us thought it would just be best to stick with the script instead of maybe messing up on improv. So we stuck to it and we really wanted to get to that character so once we really made that obvious Jonah was just like, “Alright! Let’s just rehearse then.” We also had nights where we would just watch skate clips, and by the time we started shooting, when we had the wardrobe on, and we were at the house with everything set up — Jonah [made sure] that all the details were 100% correct. Yeah, the 90s accuracy was really great — from the music to the posters in the rooms.If something was even a few months off from that time period he wouldn’t put it in, or he would cut that out, even if it took so much time. He didn’t want to disrespect the culture of that time period of skating. So he really put a lot of effort — from the trash on the ground, to the music, the colors of the walls. How would you describe your character? Do you feel like you could relate to him or do you think that you are totally different from Stevie?I can’t really relate to him just because he is kind of a shy kid. He doesn’t really engage in conversations, and he is just trying to find his place. I mean it is not a bad thing, I feel like a lot of people do go through that. That’s what life is — sometimes you may be trying to find a friend group, or you catch yourself being really shy and not engaging. I definitely have had experiences like this, but I don’t feel like I can relate to that character. Though I can [relate to] how, even though he does fall a lot, he does keep trying the trick, and [I can also relate to] how he is so passionate about skating. So I guess with skating, for the most part, I can relate. So you have been skating for a while now. How did you get into skating and what you like most about it?I started skating when I was about three or four and I kind of already knew what I was doing. I enjoyed it, I remember a lot of me just trying to roll off stairs, or trying to skate the ramp. But I really understood what skating is all about and really wanted to just keep doing it and make a career out of it when I was seven, because that is when I started to learn how to do tricks and that is when I learned how to kickflip. Once you learn to kickflip you achieve that feeling and energy that skateboarding gives you. I think that is what also people cannot really portray with skating [in some other films]. I mean they don’t actually show what skating is really all about. How so?Usually what gets referenced is just things from the 80s — like, “Oh yeah, cowabunga!” Jonah, and all of us, we were super honest with each other – we would be like, “Oh, that’s not what it is. That doesn’t feel right....” With a lot of sports you just have to keep practicing until you are there. And it is the same with skating, but it is 90% mental and 10% skill. Every single trick that you try to actually make in skating is insanely scary. You’re either trying to jump your board over a 15-stair and flip your board three times and twist your body, like, eight times, and out of 10 to 100 of those tries you are going to land it once. Maybe twice. So having that mentality goes into everything, not only skating. You definitely are patient, you don’t give up that easily because you fall more than you land. That is what makes you mature, you learn how to fail before you succeed. Do you have any favorite skaters?Yeah! There is, okay, Brendan Westgate, Louie Lopez…. Sorry, I am putting you on the spot right now.No it’s all good! Let me think, let me think. Antwuan Dickson, Ryder [McLaughlin] and I skate together, but I love watching Ryder skate. His style is so good. Mid90s felt very authentic to me as a coming of age movie. What do you hope young people take away from it?I want skateboarders to really appreciate it, and I know that they will. A lot of people that are in the skate industry, and have made it, and are pros, loved the movie. And a lot of younger people will understand and just look back and see that is what skating is. But [the part] when Nak [Nak-el] says, “you know you don’t have to do that, you can just be yourself” — like, you don’t have to impress other people, at the end of the day when you are close [to people] you are just going to be yourself anyways. I spoke to some of my friends who grew up skateboarding and they said to me, “Wow, I felt like I was watching myself in the 90s. It was as if someone was showing me clips of my experiences growing up.”Yeah, a lot of people were tearing up and super emotional, it really touched a lot of people. I think Jonah being able to do that especially during his first time directing is insane. Especially with casting kids who have never acted before, and really getting them into their character and making it feel so natural — you have to be insanely talented to be able to do that.suscribe to i-D's positive vibes."}