{"id": "Nashville Gay Bars Are Receiving Threatening 'LGBT' Flyers with MAGA Return Address", "paragraph": "Photo: Getty Images / Yana Paskova / Stringer On Tuesday afternoon, the Stirrup Sports Bar in Nashville encouraged both its regulars and regular locals to meet at the bar, so they could carpool to the closest polling place to vote early. After that, it offered $5 drink specials to anyone who flashed an “I Voted” sticker while they played a round of political trivia. So yeah, it was a pretty normal Tuesday at Stirrup, even though it had just received some vaguely threatening mail a few days earlier. According to NewsChannel5, someone sent identical flyers to Stirrup and at least four other Nashville-area gay bars last week. The only text on each flyer were the letters LGBT, and each letter corresponded to one of the four red, white, and blue pictures printed above them. Instead of ‘lesbian, gay, bisexual, and transgender,’  this LGBT was an acronym for the Statue of Liberty, a  Gun, a bottle of  Beer, and President Donald  Trump.  Each envelope had a red MAGA stamp in the upper left corner, and the return address corresponded with an empty lot in downtown Nashville. As of this writing, no individual or group has taken responsibility for sending the letters.  Most troubling was the fact that the gun pictured on the flyer was an assault rifle, similar to the one used in the deadly Pulse nightclub shooting in Orlando, Florida. “We live in a post-Pulse world in the LGBTQ community, especially in the bar scene,” Stirrup owner Melvin Brown told NBC News. “To see somebody send a postcard that had a picture of the weapon used in one of the deadliest assaults in this nation’s history, and one that happened at an LGBTQ bar, and to send that image to LGBTQ bars, to me is not a coincidence.” A spokesperson for the Metropolitan Nashville Police Department told the news outlet that it was not currently investigating the incidents, but that it had increased its patrols in areas of the city where gay bars are located.  Despite the unpleasantness that appeared in Stirrup’s mailbox last week, it’s still business as usual inside the bar. “I’d say to [whoever sent the flyers] that they won’t succeed,” Brown told MUNCHIES. “We are a community that rallies when we are treated as less than equal. This will only strengthen us.” He said he has chosen to share the letter to remind everyone of the hate that the LGBTQ community continues to face. “I know people might believe things are equal and fair but they aren’t,” he said. “People need awareness of the struggle.” There  was a bright spot in Stirrup’s week, though: yesterday’s mass voting event was a success. “We had a large group of customers,” Brown said. We even motivated some to vote for the first time.”Subscribe to Munchies."}