{"id": "Daily Horoscope: November 5, 2018", "paragraph": "The moon in Libra squares off with Pluto at 12:55 PM, stirring up drama and power struggles! But don't worry—we feel confident in taking action toward resolution at 9:43 PM, when the moon connects with energetic Mars.All times EST.You’re in a private mood today, Scorpio, as the moon in Libra lights up a behind-the-scenes sector of your chart. But that doesn’t mean today will be quiet—an intense conversation comes your way! The moon in Libra illuminates the sector of your chart that rules your social life today, Sagittarius, and drama is brewing. Watch out for issues concerning money. An exciting conversation will come your way. The moon in Libra lights up the career and popularity sector of your chart today, Capricorn, and you’re feeling especially energized to make moves! It’s a powerful day for building wealth. The moon in Libra asks you big questions today, Aquarius—many that you don’t have the answer to, which can be very frustrating. But you're still full of energy, and an exciting opportunity may arrive today.The moon in Libra finds you working through complicated emotions and weighing serious options. Today’s energy is tough, but if you’re able to let go of the past instead of clinging to it, things will flow much more easily. Relationships are a big focus for you today, Aries—both personal and professional. An important shift needs to take place, especially in how you relate to the public. Your friends are here to help you. The moon in Libra encourages you to focus on self-care. If you don't have the time to tackle your chores, it's worth removing some tasks from your to-do list today. The moon is in fellow air sign Libra today, Gemini, finding you in a flirtatious mood—at least until some drama takes place! Big emotions are in the air. A passionate energy is flowing. Today, it's important that you reflect on boundaries, privacy, and security—especially in your partnerships. As tense as the energy is right now, you'll find yourself working through complicated emotions easily.An intense energy around communication flows today, but you and your partners will find a productive way to work with whatever news arrives. Stay open-minded. The moon is in Libra, the sign of balance, today, and you need to find balance in your spending. A change needs to take place today—if not around how you spend your cash, then in how you spend your time and energy.As the diplomat of the zodiac, you want everyone to get along, but some struggle is unavoidable today as the moon in your sign gets tangled with power planet Pluto and warrior planet Mars. It’s time to take action. What's in the stars for you in November?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}