{"id": "this dutch brand offers fashion as a form of therapy", "paragraph": "Still from The Gateway to Fashion, SDW STUDIOThis story originally appeared on i-D Netherlands. Dutch designer duo Schueller de Waal recently stripped the brand's Instagram of all content overnight. The only trace of activity was one spiraling wheel-of-doom, with a caption reading that a ‘reboot’ was about to take place. What on earth was going on? Would this drastic action be the end of the creative duo? Had we become witnesses to a breakdown?Nothing in fact could have been further from the truth. During Paris Fashion Week's spring/summer 19 season, Philipp Schueller and Rens de Waal reappeared with their very own wellness center in Palais de Tokyo, where exhausted fashion victims could get massages to recover from all the stress. They coined it  Fashion Therapy. Rather than offering a new collection, the designers wanted to make a statement about the fast pace of fashion and their inability to keep up. This new approach followed a period of introspection.“We realized that since its inception Schueller de Waal has been a bit all over the place: on the one hand we have been very collection-driven, but on the other hand there has always been a strong emphasis on art direction,” the designers tell i-D. “We concluded that more than ever we needed to abandon the rigid rules of fashion — in particular the strict seasonality and the pressure to produce multiple collections a year. Instead of working solely with collections, we wanted to develop autonomous statements that could address certain problems within fashion, such as stress and burnouts. This could be in the form of a collection, but it could also be a singular outfit or an installation. We believe fashion can have great benefits for us as a society.” They add, “But we are not under the illusion that we are some kind of world savers. The humor and wink will always remain part of our brand.”With this new chapter, the brand's acronym, SDW, will take on a new meaning:  Seeking Design Wellbeing. The first step in this quest: the wellness center in Paris, where instead of a collection taking center stage, Schueller and de Wall showed a surrealist film starring model Iekeliene Stange as a hypnotherapist. In the film, she urges guests to relax, while she takes them deeper and deeper into a trance world full of eclectic fashion from the future. The characters are dressed in a mix of Schueller de Waal's past collections, emphasizing the brand's belief in the value of timeless design. The accompanying lookbook shows an overview of Schueller de Waal's history reshuffled into a new visual appearance.We selected our favorite looks:Film:Director SCHUELLER DE WAAL STUDIOFashion Therapist Iekeliene StangeDOP Lonneke van der PalenDigital Art Max de WaardSound Design BEA1991Hair and Make-up Bastien ZorzettoLookbook:Art Direction SDW STUDIOPhotography Lonneke van der PalenModel Valeriya ShaeHair and Make-up Bastien Zorzettosuscribe to i-D's positive vibes."}