{"id": "9 things Democrats promised they’ll do if they retake the House", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30. Democrats have a decent shot of reclaiming the House with the midterm elections, and Minority Leader Nancy Pelosi and other top party officials have already made numerous promises to voters if that happens.  Pelosi is so confident that Democrats will retake the House that she’s publicly predicted it. \"Let me say this,\" Pelosi told Stephen Colbert on his late show. \"Up until today, I would've said, 'If the election were held today, we would win.' ... What now I'm saying is, 'We will win.'\" A Democrat majority would be a huge blow to President Donald Trump, whose party currently controls the entire U.S. government. And the opposing party has a lot to be upset about.  Two judges that Trump has nominated to the Supreme Court have been confirmed, granting conservatives a majority hold on the nation’s highest court for the decades to come. One of those judges, Brett Kavanaugh has been accused of sexual assault by numerous women. Democrats also have an axe to grind when it comes to the House’s now-closed Russia probe, as well as Trump’s still-secret tax returns. Democrats have a decent shot of reclaiming the House with the midterm elections, and Minority Leader Nancy Pelosi and other top party officials have already made numerous promises to voters if that happens.  Pelosi is so confident that Democrats will retake the House that she’s publicly predicted it. \"Let me say this,\" Pelosi told Stephen Colbert on his late show. \"Up until today, I would've said, 'If the election were held today, we would win.' ... What now I'm saying is, 'We will win.'\" A Democrat majority would be a huge blow to President Donald Trump, whose party currently controls the entire U.S. government. And the opposing party has a lot to be upset about.  Two judges that Trump has nominated to the Supreme Court have been confirmed, granting conservatives a majority hold on the nation’s highest court for the decades to come. One of those judges, Brett Kavanaugh has been accused of sexual assault by numerous women. Democrats also have an axe to grind when it comes to the House’s now-closed Russia probe, as well as Trump’s still-secret tax returns. Here’s a rundown of what Democrats have said they will do if they retake the House for the first time since 2010. Top Democrats have indicated that they will reopen the House Intelligence Committee’s probe into Russia’s interference in the 2016 election, which Republicans have closed. California Rep. Adam Schiff, the highest-ranked Democrat on the committee, told the New York Times that Democrats would \"ruthlessly prioritize the most important matters first.\"  Schiff and other Democrats have said a principal focus of the probe would be to find out if Russians used laundered money to engage in business with the Trump Organization. You can also expect Democrats to interview dozens of more witnesses, as well as look into Donald Trump Jr. and other aides’ infamous meeting with a Russian lawyer who promised dirt on Hillary Clinton. Democrats also plan to hold hearings on Trump’s decision to send thousands of U.S. troops to the border to meet a caravan of migrants and asylum seekers traveling through Central America to the U.S. border, the Washington Post reported.  Trump ordered that 5,200 troops go to the border to prepare for the migrants’ arrival. In a Thursday speech at the White House, Trump suggested that troops would open fire at migrants who would throw rocks at soldiers. It’s illegal for U.S. troops to detain people — let alone kill them — at the border over suspicion of illegally crossing the border. Pelosi said one of her first orders of business would be to introduce a bill to protect LGBTQ Americans, who have been targeted by the Trump administration in numerous ways. For example, the Trump administration is considering defining gender as a biological characteristic determined by genitalia at birth. That would effectively eliminate transgender people, who Trump also tried to ban from the military, from federal law. Under Trump, the Justice Department also filed court paperwork that argued that federal civil rights law does not apply to gay people. Right now, the Civil Rights Act already protects people based on race, color, religion, sex, and national origin. Pelosi’s bill would add sexual orientation and gender identity. If Democrats passed the bill, civil rights departments of federal agencies may be forced to take complaints from gay and transgender people seriously/ Numerous Democrats have promised to go after Trump’s never-released tax returns if they retake the House. “I don’t think there’s any question about it,” Kentucky Rep. John Yarmuth, the top Democrat of the House Budget Committee, told the Hill. Democrats are planning to use an obscure law that allows House and Senate leaders to request tax information. Treasury Secretary Steve Mnuchin told the New York Times he would abide by any legal request from Congress to release Trump’s taxes. Though he was narrowly confirmed to a lifetime seat on the Supreme Court, Brett Kavanaugh can expect more public scrutiny if Democrats take the House. Top lawmakers said the House Judiciary Committee will open an investigation into Kavanaugh.  Dozens of members of the Congressional Progressive Caucus sent a letter to Trump saying they would investigate Kavanaugh for perjury because he may have made false statements about his alleged involvement in surveillance under the George W. Bush administration. “It is not something we are eager to do,” Rep. Jerry Nadler, a New York Democrat who’s poised to chair the committee if Democrats retake the House, told the the New York Times. “But the Senate having failed to do its proper constitutionally mandated job of advise and consent, we are going to have to do something to provide a check and balance, to protect the rule of law and to protect the legitimacy of one of our most important institutions.” Arizona Rep. Raúl Grijalva, the top Democrat on the House Natural Resources Committee, has already tried to hold a hearing on Interior Secretary Ryan Zinke, who has faced scandals, including wearing “Make America Great Again” socks in a possible violation of the Hatch Act) and using a private charter plane to travel around the country. But the Republican majority has dismissed his attempts.  Once Democrats have the numbers, however, Virginia Rep. Gerry Connolly, the likely chair of the House Oversight Government Operations Subcommittee, said they will open an official probe into Zinke. Pelosi told students from Marjory Stoneman Douglas High School, where 17 people were killed by a school shooter in Parkland, Florida, that she would make universal background checks a legislative priority. Universal background checks would close the “gun show loophole” that allows people to purchase firearms without a background check. Republicans have already blocked similar efforts by Democrats under the Trump administration. Pelosi told her constituents in California that Democrats would repeal and replace the Republican tax package that passed in December. “One of our complaints about what they did with the tax bill is they did it in the dark of night with the speed of light,” Pelosi said. Pelosi said Democrats would work with Republicans to propose a better tax package. \"We’ll sit down at the table and say … what would be a tax bill that creates growth, that creates good paying jobs as it reduces the deficit?\" she said. Top Democrats have said that they want to clamp down on high prescription drug costs. Illinois Rep. Jan Schakowsky, a Democrat on the House Energy and Commerce Committee, told the Hill that she wants to put constraints on big pharma within the first “100 hours” of retaking the House."}