{"id": "Why a Helium Leak Disabled Every iPhone in a Medical Facility", "paragraph": "Image: ShutterstockAn IT worker at a medical facility made a remarkable discovery about iPhones and Apple watches earlier this month, after a freshly installed MRI machine appeared to disable every iOS device in the hospital. As detailed in a post on the r/sysadmin subreddit, Eric Woolridge, a system administrator at Morris Hospital in Illinois, was flooded with calls on October 8 after several iPhones owned by hospital employees all stopped working for no discernible reason. At the time, the hospital was having a new MRI machine installed, which is used to make high resolution scans of the brain. MRIs work by producing a very strong magnetic field, so Woolridge initially assumed that the phones were disabled by an electromagnetic pulse generated by the machine. There was just one problem: an EMP would have disabled all electronic devices, not just iPhones. Yet when Woolridge did a tour of the facility, he discovered the issue was isolated to about 40 Apple phones, tablets, and watches. Android phones were just fine, as was the rest of the computer equipment at the facility. According to Woolridge, most of the Apple devices in the facility “seemed completely dead.” Many wouldn’t give any indication of charging when plugged into the wall and had issues connecting to the cellular network, but not the wifi. As Woolridge later discovered, the MRI installation involves supercooling the giant magnet in the machine by boiling off liquid helium. This evaporated helium is usually pumped out of the facility through a vent, but this vent was leaking the helium into the rest of the facility. In all, about 120 liters of helium (or about 90,000 cubic meters in its gaseous state) was pumped out of the MRI room and an untold amount leaked into the rest of the hospital. Woolridge ran some tests of his own to see if helium could shut down an iPhone. He placed an iPhone 8+ in a sealed bag and added some helium. In a video of the test Woolridge runs a stopwatch app on the phone. The stopwatch increasingly speeds up throughout the course of the video before the iPhone freezes at around eight minutes. The helium, it seemed, was messing with the iPhone’s clock. As detailed in a blog post by the right-to-repair organization iFixit, helium atoms can wreak havoc on MEMS silicon chips. MEMS are microelectromechanical systems that are used for gyroscopes and accelerometers in phones, and helium atoms are small enough to mess up the way these systems function. Yet both Android and Apple phones use MEMS silicon for their devices, so why were only Apple phones affected?The answer, it seems, is because Apple recently defected from traditional quartz-based clocks in its phones in favor of clocks that are also made of MEMS silicon. Given that clocks are the most critical device in any computer and are necessary to make the CPU function, their disruption with helium atoms is enough to crash the device. In this case, the leaking helium from the MRI machine infiltrated the iPhones like a “tiny grain of sand” and caused the MEMS clocks to go haywire. This isn’t news to Apple, however, which explicitly mentions that “exposing iPhone to environments having high concentrations of industrial chemicals, including near evaporating liquified gasses such as helium, may damage or impair iPhone functionality” in the phone’s manual. iFixit has a detailed explanation of how this all works over at its blog.Sign up for Motherboard Premium."}