{"id": "Pour Out Some Cream of Mushroom Soup in Memory of the Creator of Green Bean Casserole", "paragraph": "Photo by Munchies Staff.Americans would love to think that all of the things we eat for Thanksgiving dinner are categorically American™ foods because we eat them on a categorically American™ holiday. But, sorry to be the bubble-burster here—they’re not. We don’t own the patent on over-roasted turkeys and we certainly aren’t the only people putting apples and pumpkins into pies. But there is one dish that has become a staple of millions of American households’ holiday tables that we can fully claim as our own: the green bean casserole. Originally called a “green bean bake,” the recipe was created in the Campbell’s Soup Company’s test kitchen in New Jersey in 1955 by one Dorcas Reilly, who sadly passed away last week at the age of 92 of Alzheimer’s disease. Reilly and her compatriots in the Campbell’s test kitchen were tasked with creating recipes that utilized the company’s roster of canned products, and especially in combination with other common food products a family was likely to have hanging around the house anyway. The original recipe called for a can of Campbell’s cream of mushroom soup, milk, soy sauce, black pepper, fresh green beans, and French’s fried onion strings. That original recipe card is now housed in the National Inventors Hall of Fame alongside other revolutionary innovations like Thomas Edison’s light bulb, as the Washington Post noted in Reilly's obituary.When interviewed by the Associated Press in 2005 for a piece commemorating the dish’s 50th anniversary, Reilly claimed she didn’t even remember coming up with it, because it was just one of hundreds of recipes she developed during her time at Campbell’s. Which is a pretty amazing flex considering the recipe is still being printed on cream of mushroom soup labels exactly as written, and that Campbell’s estimates that about 40 percent of that particular soup’s sales are made specifically for going into that dish. We’d never claim to be able to improve upon Reilly’s perfection, because to do so would be sacrilege and possibly considered high treason. So we give her all due props for inspiring generations of cooks to create their own versions of her iconic dish.  Maybe you’ll consider Naomi Pomeroy’s just-a-little-bit-cheffier version of the classic casserole for your holiday feasting this year instead of Reilly’s, with fresh chanterelle mushrooms and a smoked gouda cheese sauce in place of the traditional cream o’ mushroom soup.  If one were to find any flaw in Reilly’s original recipe, it is that the vegans of the world are excluded from experiencing it. Here, we use hemp milk to keep things strictly plant-based. Make sure at least some version of the green bean casserole makes it to your Thanksgiving table this year to honor the legendary Reilly and her culinary legacy.Subscribe to Munchies."}