{"id": "Amigo the Devil's Murder Folk Mixes Southern Gothic with Doom Vibes", "paragraph": "Photo courtesy of Amigo the Devil Amigo the Devil is a strange, hard-to-define entity that hovers like a slightly vengeful ghost around the peripheries of metal, dark folk, and Americana, claimed by none but with roots in all three. I’ve seen the singer-songwriter’s work described as “murder folk” in more than a few places, which is both delightful and apt, since his output camps out at the crossroads of Devil Makes Three, 16 Horsepower, and Danzig, and his lyrics concern themselves with murder as often as they do love, libations, and self-loathing.  Despite his allegiance with the scene itself, the only real heavy metal influence at work here is in the devilish atmosphere and an overall pit-dark vibe that’s a few shades past Southern gothic, and had landed him on lineups with outright doom bands more than once. It’s a curious position to occupy, but Amigo the Devil and his waitin’-around-to-die music makes it seem natural.  Everything Is Fine marks the project’s first proper full-length, and in spite of its downhome, rough-hewn feel, comes stacked with highfalutin credentials. Produced by Ross Robinson (Korn, Slipknot, At The Drive In, Glassjaw), its percussive elements shaped by drummer Brad Wilk (Rage Against the Machine, Audioslave, Prophets of Rage), and recorded at Valentine Studios on original 70s-era gear, the album is ultimately a backcountry nightmare, soundtracked by raspy, slightly unhinged vocals and an overall apocalyptic bent (“I Hope Your Husband Dies” is a standout, as is the absolutely miserable bluegrass ballad “Cocaine and Abel”). We’re streaming the album in full below; it’s out today via Regime Music Group.Catch Amigo the Devil on tour in North America and Europe:North America:10/14 - Sacramento, CA @ Monster Energy Aftershock Festival - Discovery Park10/14 - Sacramento, CA @ Goldfield Trading Post (aftershow party for Aftershock)10/18 - Houston, TX @ White Oak Music Hall10/19 - Dallas, TX @ Three Links10/20 - Austin, TX @ Mohawk10/22 - Mesa, AZ @ The Nile Theater10/23 - Los Angeles, CA @ Echoplex10/24 - San Diego, CA @ Brick By Brick10/25 - Tustin, CA @ Marty's on Newport10/26 - San Francisco, CA @ Three Parkside10/27 - Los Osos, CA @ Sweet Springs Saloon10/28 - Las Vegas, NV @ Beauty Bar10/30 - Denver, CO @ Marquis Theater10/31 - Denver, CO @ Marquis Theater11/1 - Kansas City, MO @ The Riot Room11/2 - Chicago, IL @ Beat Kitchen11/3 - Hamtramck, MI @ The Sanctuary11/4 - Cleveland, OH @ Grog Shop11/5 - Toronto, ON @ Sneaky Pete's Concert Venue11/7 - Millvale, PA @ The Funhouse at Mr. Small's11/8 - Rochester, NY @ Flour City Station11/9 - Allston, MA @ Great Scott11/10 - Brooklyn, NY @ Saint Vitus11/11 - Philadelphia, PA @ Kung Fu Necktie11/13 - Baltimore, MD @ Metro Gallery11/14 - Richmond, VA @ Strange Matter11/15 - Nashville, TN @ The High Watt11/16 - Asheville, NC @ The Mothlight11/17 - Atlanta, GA @ The Masquerade - Purgatory11/18 - Orlando, FL @ Soundbar  Europe: 12/04 - Paris - La Boule Noire12/05 - Amsterdam - Melkweg12/07 - London - Borderline12/08 - Nottingham - Bodega12/09 - Newcastle - Think Tank12/11 - Glasgow - Stereo12/12 - Manchester - Deaf Institute12/13 - Bristol - Thekla12/14 - London - OsloKim Kelly is all folked up on Twitter.Get the best of Noisey, delivered to your inbox every day."}