{"id": "A Good Let's Play Is More Than Just a Video of Your Favorite Game", "paragraph": "Screenshot via Supergreatfriend's Silent Hill Let's Play.   Postscript is Cameron Kunzelman's weekly column about endings, apocalypses, deaths, bosses, and all sorts of other finalities. What do let’s plays do? This seems like a simple question, but despite watching them and making them myself, I’ll admit to not having considered all of the uses cases for let’s plays until fairly recently. When I make them, it’s because I enjoy making videos with my friends, and I think that (sometimes) other people might enjoy listening to us talk about, and reflect on, what we’re seeing. My colloquial understanding of that use-case of the let’s play comes from my own viewing habits. I’ve been enjoying Chip and Ironicus for years now, and I’ll admit to checking out lots and lots of Edwad as well. I saw them as an entertainment form, first and foremost, and that was sort of it. But that’s not the total picture of let’s plays. In a world of livestreams and consoles with share buttons, the let’s play might feel antiquated. They’re a media form that was always predicated on playing games and sharing the experience, either in their roots as screenshots with commentary on forums to the adoption of video on platforms like YouTube, and they haven’t really changed that much in all that time. And here I am, still watching people explore games without dynamic audiences, because I find it somehow more singular, more fun, and more  produced than the casual Twitch stream. This is going to feel like a gear shift, but hear me out: I’ve never completed  Silent Hill, and I don’t really want to. Despite being a giant fan of  Silent Hill 3, and having great memories of completing it in a flu-induced haze over several sequential days, I’ve never been able to get past the fidelity and control issues of the first game. But, you know, I like the franchise, and I’ve always been curious about what the game has going for it. I know the big plot points, but I know them via Wikis and plot summaries. That passive “I wonder what’s going on there” was floating around in my head, and sometime around the top of October the YouTuber Supergreatfriend started posting videos of a let’s play of  Silent Hill. And, since I was already subscribed, I started watching the videos as they came out. Above: Episode 1 of Supergreatfriend's Silent Hill LP. Supergreatfriend’s playthrough of  Silent Hill is entertaining, but I’m not sure that its primary purpose is entertainment. It is an explanatory let’s play, depicting some strategies for getting through the trickier parts of the game and showing how the basic puzzles of the game operate, as well as walking through the game’s confusing plot. This  Silent Hill let’s play is sort of like a spinning jewel on the Home Shopping Network, with each facet talked through and revealed by the omniscient narrator. For the explanatory let’s play, the work of the video creator is to present the game without getting in the game’s way. After all, presumably the viewer is here for the game content and the explanation of it with minimal interference from the creator of the video. It’s all about content and contextualization.  What I discovered, though, is how that context and contextualization changes the experience of the game. Every now and again the discussion of the ethics of let’s plays comes up on game sites or on Twitter. The argument against let’s plays goes something like this: Let’s plays fundamentally depend on the games that they are showing off, and yet developers of games are totally cut out of the economics of let’s plays. If a major LPer does a playthrough of a game, the viewers of that let’s play have no reason to play the game, and it’s unclear that if the increased publicity for the games do anything for sales. In the most aggressive form of this argument, the LP might actively prevent sales.Above: Episode 1 of Ranged Touch's LP of the Baldur's Gate series. I don’t have a position on this argument, and I don’t know enough about the data to make any kind of claims about it. I will say this: an explanatory let’s play of  Silent Hill fundamentally opened the game up to me in a way that it was not available to me before. The comprehensive explanation turns a work that I only had a slice of and made it flourish in my mind as something more complex and interesting. And it’s the  work of the let’s play that makes that happen. Showing off the various endings of  Silent Hill, for example, requires some intensive labor. Supergreatfriend has to replay the actual end of the game a few times, and to get one special ending, needs to play through the game on hard and do some arbitrary things that aren’t included in the standard game.Cracking jokes, editing video for best effect, and thinking through the best ways to communicate game information  is work. The explanatory LP transforms the game from something that you might riff over for jokes, or a narrative to experience as a group, and into a site that reveals the labor that goes into all LPs. “Dang, that’s a lot of work,” was my first thought when watching the  Silent Hill let’s play, but then I thought “dang, this is always a lot of work.”  And, to be clear, I’ve made these videos myself. They’re a joy to record and edit, and it’s always a good feeling to see people watching them and talking about them. But watching Supergreatfriend work through every little part of  Silent Hill operates as a kind of mirror where their labor also speaks to how much labor  I am doing when I create a let’s play. Cracking jokes, editing video for best effect, and thinking through the best ways to communicate game information  is work. Most media objects obscure their work from the viewer; strangely enough, I feel like the let’s play obscures its work from the creators as well. I could be totally wrong. Chip and Ironicus are fairly open about the grind of constant funny-and-comprehensive content, and I know that I’ve gotten behind on my episode publication schedule before. But even in those moments, I’m rarely thinking “oh, I need to get that work done.” Instead, I merely think “oh, I need to get to that,” as if the  that is something other than the work of managing content on a YouTube channel. The explanatory let’s play makes the form transparent. We treat let’s plays as fun things for creators and viewers to bond over, but they’re work, and that work is often grindy and brutal. It is about finding all the pieces of a game and sifting through them, finding the best ways to depict each moment and make the most of every joke. It took a completionist let’s play of  Silent Hill to really make that apparent for me, and I don’t know if I’ll ever unsee it.  Have thoughts? Swing by our forums to share them!Email is a thing."}