{"id": "Republicans Are Working Feverishly to Stop Minorities from Voting", "paragraph": "Left: People cast early-voting ballots in Atlanta. Right: Georgia Secretary of State Brian Kemp, who is running for governor. Photos by Jessica McGowan/Getty The effects of 2018 voter suppression laws are being felt, state by state, as Republicans work across the country to restrict the number of people—with policies that disproportionately target minorities—who can cast ballots in the midterm elections on November 6.  In Ohio, voters who have been inactive for a few cycles can be purged from the rolls, a decision upheld last year by the Supreme Court. A new voter ID law in North Dakota will disenfranchise minority voters and seems aimed specifically at Native Americans, who often don’t have residential address and thus won’t be able to vote under the new law. In New Hampshire, students are facing barriers to participating in the state's general election thanks to a new law requiring voters have in-state driver’s licenses. And Dodge City, Kansas, which is 60 percent Hispanic, has moved its only polling place outside of town and a mile from the nearest bus stop in a move seen as calculated to depress turnout among the 27,000 residents. But Georgia, where thousands of voters have been purged from the rolls and African Americans involved in get out the vote efforts are being harassed, might be ground zero in the fight. A confluence of voter suppression activity in the state is attracting attention in part because of the Republican nominee for governor is the one in charge of state elections.  As Secretary of State, Brian Kemp has power over voting in Georgia. He's already made use of that power, suspending over 53,000 voters—70 percent of whom are black—and purging more than 107,000 voters for not voting in the last election. That Kemp was recorded saying he had concerns \"if everybody uses and exercises their right to vote,\" as  Rolling Stone's Jamil Smith reported on Tuesday, has only added to the controversy over his actions.  \"The suppression in Georgia has created a firestorm due to Kemp's position and the close race for governor,\" said Sophia Lakin, a staff attorney with the Voting Rights Project.  That firestorm might generate some unintended consequences, however. Voters are showing up to the polls for early voting in record numbers across the country, and in Georgia over 300,000 early ballots have already been cast, 30 percent of which have been by black residents—a higher portion of the electorate than the comparable number in 2014.  Georgia-based progressive political analyst Anoa Changa said that she's seeing a massive surge in political activity from people in the state as more information becomes public about Kemp's behavior. Georgians don't want to see Kemp get a promotion, said Changa, and despite the lack of faith in the voting process in Georgia, people are determined to fight.  \"Kemp is emblematic of the attacks on voting rights we have seen in the last several years,\" Changa said. While Lakin acknowledged the possibility that voter suppression could drive reactive turnout, she said that the negative consequences would likely outweigh the benefits of such a backlash. When it's harder to vote due to the concerted efforts of the state, the barriers to the ballot can be insurmountable. \"Unfortunately, no matter how much work you do to get people out to vote, if you're purged you lose your rights,\" said Lakin.  Danielle Lang, senior legal counsel for voting rights and redistricting at the the Campaign Legal Center, agrees. She told VICE that the barriers to the ballot are creating a number of negative effects on the electorate—and though some of those effects are hard to quantify, so too are the positives. \"Even if turnout goes up,\" said Lang, \"we can't understand what turnout would be without voter suppression, it's a counterfactual argument.\"The current battle over voting rights goes back a decade. After the election of Barack Obama in 2008, efforts began in earnest on the state level to roll back the Voting Rights Act, enshrined into law in 1965. While 2008 didn't mark the beginning of the struggle by the right to undo the advances of the Civil Rights movement—that effort began immediately after the successes of the 1950s and 60s—it was the dawn of a new era in political regression. \"There was a shift after the 2008 election,\" said Lakin. After that, Lakin said, a new wave of voter suppression laws began to be instituted in states around the country, with the effects falling disproportionately on voters of color. The reason for that is clear, Lakin said, if you look at the demographics of the voters in 2008. \"It was the most diverse turnout with the most young voters in history,\" said Lakin. The Voting Rights Act was the first line of protection, but after the law was gutted by the Supreme Court’s five conservative justices in in 2013, the floodgates opened. By 2014, new laws limiting voting rights were in place in 15 states for the federal election. Voter ID laws and restrictions on registration were among the tactics used to set back the right to vote in these states, presenting new hurdles. \"2013 and 2014 were difficult for voting rights advocates,\" said Lakin. A recent VICE News analysis found that a disproportionate number of polling stations closed in jurisdictions previously governed by the VRA, especially in minority neighborhoods.  The destruction of the legacy of the VRA is definitely being felt in Georgia, said Changa. She told VICE that the history of what's being done is resonating with many people in the state, both for the older population—like the elderly people on a get out the vote bus who were harassed last week—and the new generation.  \"For a lot of young people, myself included, I never imagined we would be fighting for access to the ballot like this,\" said Changa. In the five years since the Supreme Court gutted the act, new laws and procedures targeted at the right to vote have been put in place across the country. It's a variety of voter suppression tactics that are combining in 2018 with high turnout and tight races to create the conditions for unprecedented challenges. And the hits just keep on coming. \"In this cycle the pace of issues have been a bit breathless,\" said Lang. \"There's a new report of a problem at every corner.\"  Sign up for our newsletter to get the best of VICE delivered to your inbox daily.  Follow Eoin Higgins on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}