{"id": "Alexandria Ocasio-Cortez is open to supporting Pelosi: “There’s an opening, for sure”", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.Congresswoman-elect Alexandria Ocasio-Cortez shook up the Capitol this week by cheering on a group of climate activists protesting inside the office of Rep. Nancy Pelosi. But that doesn’t mean the 29-year-old is anti-Pelosi. The Democrat insurgent from the Bronx wants to use her newfound national prominence to force climate change onto the top of her party’s agenda, and if Pelosi agrees, she’s open to supporting her bid to be re-elected Speaker of the House. “I think there’s an opening, for sure,” Ocasio-Cortez told VICE News while she was rushing to an event for freshman lawmakers in the sprawling Capitol complex. “This is not about supporting or not supporting an individual. It’s about making sure that we can get as progressive and aggressive of legislation as a party on climate change as quickly as possible.”If Pelosi wants the gavel for the second time in her decades-long career, she’s going to need the support of Ocasio-Cortez and many more of the 50 freshman Democrats elected to Congress in the midterms earlier this month. Close to 60 Democratic challengers and incumbents alike publicly vowed to never support Pelosi during the heat of their campaigns. The former speaker can still overcome that opposition to win the majority of votes within the Democratic caucus when they vote as a party later this month. But the big test comes in January when she’ll need the support of at least 218 members of the House, meaning merely 16 Democrats can derail Pelosi. That makes the freshman Democrats a powerful block, and they seem to know it.Congresswoman-elect Alexandria Ocasio-Cortez shook up the Capitol this week by cheering on a group of climate activists protesting inside the office of Rep. Nancy Pelosi. But that doesn’t mean the 29-year-old is anti-Pelosi. The Democrat insurgent from the Bronx wants to use her newfound national prominence to force climate change onto the top of her party’s agenda, and if Pelosi agrees, she’s open to supporting her bid to be re-elected Speaker of the House. “I think there’s an opening, for sure,” Ocasio-Cortez told VICE News while she was rushing to an event for freshman lawmakers in the sprawling Capitol complex. “This is not about supporting or not supporting an individual. It’s about making sure that we can get as progressive and aggressive of legislation as a party on climate change as quickly as possible.”If Pelosi wants the gavel for the second time in her decades-long career, she’s going to need the support of Ocasio-Cortez and many more of the 50 freshman Democrats elected to Congress in the midterms earlier this month. Close to 60 Democratic challengers and incumbents alike publicly vowed to never support Pelosi during the heat of their campaigns. The former speaker can still overcome that opposition to win the majority of votes within the Democratic caucus when they vote as a party later this month. But the big test comes in January when she’ll need the support of at least 218 members of the House, meaning merely 16 Democrats can derail Pelosi. That makes the freshman Democrats a powerful block, and they seem to know it.“I want appropriations,” said Rashida Tlaib, who's soon to be sworn in to represent part of Detroit in the third-poorest congressional district in the nation. As one of the nation’s first two Muslim women ever elected to Congress, she’s brimming with pride over the diversity of her freshman classmates.Read: Alexandria Ocasio-Cortez: There's room for Democratic socialists in the Democratic PartyBut she argues their rainbow of backgrounds and identities is diminished if the old Democratic guard relegates them to a category of second-class legislators from Day One. What Tlaib wants from Pelosi in exchange for her vote is a seat on the all-powerful Appropriations Committee, which she says will give her the perch needed to help her neighbors back in Michigan. “Real leadership sometimes means allowing a lot of us to be able to be at the table where decisions can be made,” she said.A lot of the Democratic freshmen are looking at the first bill Pelosi plans to bring up for a vote, which focuses on increasing voting access, enhancing ethics laws and curtailing Big Money’s influence in elections. That’s not good enough for Ayanna Pressley. Like Ocasio-Cortez, she also ousted a longtime Democratic incumbent in her Boston district. She’s also open to supporting Pelosi, but for now she’s hesitant because Pelosi's first bill doesn’t address the gun violence plaguing every corner of the nation. “This is not the time to be timid. This is the time to really be bold, and that is the mandate the electorate has given us,” Pressley said on a bench in the basement of the Capitol as she changed from unforgiving heels to more-comfortable gym shoes. “All of us ran on bold policy ideas, and I want us to send that signal early on that that’s the work we’ll be doing.” The bulk of Democrat’s gains this cycle came in suburban areas where the party previously felt gerrymandered out of contention. In many of those red-tinged or purple districts incoming lawmakers have already vowed to oppose Pelosi, and it will be difficult to change tack.  Read: 21 historic firsts from the 2018 midterms“I’ve been talking for over a year and a half about how critical new leadership is, how gridlocked Washington is, and how important it is that we move forward on these key issues,” incoming New Jersey Congresswoman Mikie Sherrill said outside of an orientation meeting. “I think the best way to do that is with new leaders.” As Pelosi and her confidants are twisting arms and doling out favors to win more support, many of those \"Never Pelosi\" Democrats are wavering on their pledge to voters to oppose her, which has some Democrats warning the entire party’s credibility is at stake if she’s named speaker. “When you say something and you tell people something, you should keep your word,” incoming Democratic Rep. Jeff Van Drew of New Jersey, who still steadfastly vows to never support Pelosi, told reporters at the Capitol. “When you don’t keep your word, that just diminishes, I believe, what the public believes about elected officials.” The danger for Sherrill, Drew and any other freshman who opposes Pelosi is they imperil their own fundraising ability if she is re-elected. Indeed, part of the reason Democrats were able to flip 33 Republican seats (so far) this year was due to Pelosi’s fundraising prowess. The bulk of that cash was sent to the very freshman lawmakers who are now imperiling her leadership aspirations. While Pelosi’s detractors are the most vocal, the bulk of House Democrats are firmly behind her (at least publicly), and that includes the majority of the party’s freshmen class. “Nancy Pelosi has proven herself as a first-class legislator,” soon-to-be Florida Congresswoman Donna Shalala, who was secretary of Health and Human Services during the Clinton administration, told a flock of reporters huddled in the cold outside of the hotel reserved for freshmen lawmakers. “We would not have Obamacare without her.” Pelosi and her allies inside and outside of Congress continue to lobby the freshman class to get behind her bid, but for more than a few freshmen, all this talk of the party leader is premature. Besides trying to figure out how to navigate the sprawling Capitol complex, many also want to get to know Pelosi’s top generals and lieutenants before casting their lot with her. Ilhan Omar, who will become the first Somali-American member of Congress when she takes office in January, served as assistant minority leader in Minnesota’s legislature, has not yet decided on Pelosi.But she knows from firsthand experience that the figurehead at the top of the party can’t accomplish anything on their own. “Nobody does anything by themselves,” she said. “Someone’s weakness is someone else’s strength, and someone else’s strength is someone else’s weakness.”Cover: Members-elect Alexandria Ocasio-Cortez, D-N.Y., left, and Deb Haaland, D-N.M., are seen after the freshman class photo on the East Front of the Capitol on November 14, 2018. (Photo By Tom Williams/CQ Roll Call)"}