{"id": "Bashing Nancy Pelosi is officially a bipartisan sport", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30. More women than ever are running for political office. Sign up for our newsletter following them. Turnout among early midterm voters is exploding across the country but so are scandals over purported attempts to suppress voting. In North Dakota, where Democratic Sen. Heidi Heitkamp is scrambling to hold onto her seat in a state Trump won, voters are now required to have residential addresses. But Native Americans living on reservations often have only P.O. boxes. In Georgia, where Democrat Stacey Abrams is running as the country’s first black female gubernatorial nominee, more than 53,000 voter registrations remain on hold. Almost 70 percent of those holds are on black voters. (By the way, Abrams’ opponent Brian Kemp is in charge of voter registration as Georgia’s secretary of state.) History-making women like Abrams risk being pigeonholed by their biographies — just ask Vermont’s Christine Hallquist, the first transgender woman to secure a major-party gubernatorial nomination. Even the phrase “Year of the Woman” and its cloying sister “the pink wave” arguably stigmatize female politicians. But as dozens of female American icons emphasized to the Cut in interviews about the nature of power, women who dare to fight for themselves often have no choice but to be outsiders. At first, anyway. Stacey Abrams isn’t apologizing for watching a state flag burn at a 1992 college protest against Confederate symbolism. (At the time, the Georgia state flag included a Confederate insignia.) But all Abrams did was take “an action of peaceful protest,\" she said at a Tuesday debate against Brian Kemp, who has tried to paint Abrams as “too extreme for Georgia.” FYI: Kemp — who, again, is Georgia’s chief elections official — was caught on tape saying that Abrams’ vibrant voter turnout operation “continues to concern us, especially if everybody uses and exercises their right to vote.” More women than ever are running for political office. Sign up for our newsletter following them. Turnout among early midterm voters is exploding across the country but so are scandals over purported attempts to suppress voting. In North Dakota, where Democratic Sen. Heidi Heitkamp is scrambling to hold onto her seat in a state Trump won, voters are now required to have residential addresses. But Native Americans living on reservations often have only P.O. boxes. In Georgia, where Democrat Stacey Abrams is running as the country’s first black female gubernatorial nominee, more than 53,000 voter registrations remain on hold. Almost 70 percent of those holds are on black voters. (By the way, Abrams’ opponent Brian Kemp is in charge of voter registration as Georgia’s secretary of state.) History-making women like Abrams risk being pigeonholed by their biographies — just ask Vermont’s Christine Hallquist, the first transgender woman to secure a major-party gubernatorial nomination. Even the phrase “Year of the Woman” and its cloying sister “the pink wave” arguably stigmatize female politicians. But as dozens of female American icons emphasized to the Cut in interviews about the nature of power, women who dare to fight for themselves often have no choice but to be outsiders. At first, anyway. Stacey Abrams isn’t apologizing for watching a state flag burn at a 1992 college protest against Confederate symbolism. (At the time, the Georgia state flag included a Confederate insignia.) But all Abrams did was take “an action of peaceful protest,\" she said at a Tuesday debate against Brian Kemp, who has tried to paint Abrams as “too extreme for Georgia.” FYI: Kemp — who, again, is Georgia’s chief elections official — was caught on tape saying that Abrams’ vibrant voter turnout operation “continues to concern us, especially if everybody uses and exercises their right to vote.” Trans politicians are speaking out against the Trump administration’s proposal to change the definition of “gender” and effectively erase transgender individuals’ civil rights. Elizabeth Warren isn’t the only Democratic woman eyeing a 2020 presidential bid. New York Sen. Kirsten Gillibrand and California Sen. Kamala Harris all but declared their candidacies last week, after visits to crucial early-primary states and news stories floating potential 2020 runs. Hawaii Rep. Tulsi Gabbard is also reportedly exploring a possible bid for the White House. The National Republican Campaign Committee is spending $1.4 million on TV ads for Georgia Rep. Karen Handel, even though her race for the 6th Congressional District is currently rated “lean Republican.” The Michael Bloomberg–backed Everytown for Gun Safety Action Fund has sunk more than $2.3 million into championing Handel’s opponent, Lucy McBath, whose teenage son was fatally shot by a white man angry about his loud music. FYI: Democrat Jon Ossoff spent $32 million losing the 6th District in a special election last year, in the most expensive House race in history. Kanye West donated $73,540 to Chicago mayoral candidate Amara Enyia, which left her campaign debt-free. Enyia — a local activist who had less than $70 in her coffers just last week — couldn’t appear on the state ballot until she paid off thousands in fines she owed to the state of Illinois, after a failed 2015 mayoral campaign. Blessings: Last week, Chance the Rapper endorsed Enyia and catapulted her long-shot bid for the open seat into the spotlight. Republican Vickie Paladino, who’s running for the New York state Senate, has retweeted racist Twitter accounts, shared Facebook posts from alt-right figures, and praised a member of the fascist street gang the Proud Boys, the Gothamist reported last week. Paladino told the outlet that she’s a centrist, didn’t write one of the posts, and doesn’t support extremism “on either side.” “If somebody wants to call me alt-right, I don't really care,” she added. “Just don't call me late for dinner.” So weird: That this keeps happening, right?Bashing House Minority Leader Nancy Pelosi is officially a bipartisan sport, now that at least two Democrats have aired TV ads attacking the California congresswoman. Since mid-September, Republicans have aired nearly 100 spots demonizing Pelosi, Hillary Clinton, or both. Those ads have now run more than 34,000 times.The GOP loves attacking Pelosi so much that Virginia Republican Rep. David Brat dropped her name 21 times during a 90-minute debate against Democrat Abigail Spanberger for the state’s 7th District. “I question against whether Congressman Brat knows which Democrat he’s in fact running against,” Spanberger shot back. She’s promised to vote against Pelosi for House speaker — along with at least 57 other Democrats.  — Democrat Sharon Girard, a first-time candidate for Arizona’s state Legislative District 8. She’s believed to be the first  former Planned Parenthood abortion provider to run for office in the United States. Most of the time, Girard said, Democratic voters like that she worked for Planned Parenthood. Out of the nearly 9,000 doors that Girard estimates she’s knocked on over the past two years, only two women closed the door on her after she mentioned that she supports abortion access.  “You have to pick your audience. You learn that in politics,” Girard said.Democrats out-fundraised Republicans last quarter, fed by a flood of small-dollar donations. But if a donor doesn’t live in a candidate’s district, they can’t vote for them — so those dollars may not translate to Democratic victories on Election Day, Evan McMorris-Santoro found.The Democratic Party is also dumping millions of dollars into convincing people to vote early in Arizona, where Democratic Rep. Kyrsten Sinema is battling Republican Rep. Martha McSally for a Senate seat. McMorris-Santoro stopped by the Grand Canyon State to find out why.A black Republican strategist defended his organization’s political ad that said white Democrats would bring back an era of “lynchings when a white girl screams rape.” A version of the ad ran in St. Louis, Missouri, whose Democratic Sen. Claire McCaskill voted against Brett Kavanaugh’s confirmation to the Supreme Court.In Nevada, where Democrat Jacky Rosen is trying to topple Republican Sen. Dean Heller, people on both sides of the aisle are officially “mad as hell,” as veteran Republican pollster Frank Luntz discovered.Cover image: House Minority Leader Nancy Pelosi reacts to accounts of the massacre at Marjory Stoneman Douglas High School during a roundtable on gun violence at Coral Springs City Hall Wednesday, Oct. 17, 2018, in Coral Springs, Fla. (Amy Beth Bennet/South Florida Sun-Sentinel via AP)"}