{"id": "Professional 'Counter-Strike' Player Caught Cheating in Tournament", "paragraph": " A  Counter-Strike: Global Offensive team, OpTic India, was disqualified from a tournament and disbanded entirely today after one of the players was caught cheating with an auto-aim program. Something about the way Nikhil \"forsaken\" Kumawat was playing caught the attention of tournament administrators, and the Shanghai, China-based event came to a standstill while they sorted things out. The uncomfortable moment came during OpTic India's second match of the tournament. An administrator paused the action and came over to check out Kumawat's computer. According to video from the stream, the administrator was reaching over Kumawat's shoulder and using the mouse. Kumawat tried to bat the administrator's hands away while his teammates watch. Pictures from the event show parts of what happened next: Kumawat packing a backpack and leaving, the rest of the team looking grim around his computer alongside tournament officials, and a file explorer window showing a suspicious-looking program innocently named \"word.exe.\"  As for what actually happened in the game, esports writer Rod Breslau captured a few highlights on Twitter. In them, Kumawat's crosshair can be seen snapping to enemies and locking onto them whenever he gets points near them. At one point, Kumawat fires a burst of shots at a wall that perfectly track an enemy hiding behind it—an enemy that he couldn't possibly see for himself. \"We want to apologize to all the other teams and organizations involved,\" Jesal Parekh, the director of international development for OpTic India, told the esports news site HLTV. \"It is unfair for everyone involved. We also want to apologize to our country and to the fans who have supported us. This will be a big setback for the country, and it is really unfortunate that one selfish person is capable of causing this.\" Parekh also said that the other four players on the team didn't know about Kumawat's cheating. A few hours later, though, OpTic India released an official statement confirming that Kumawat's contract had been \"terminated,\" but that the rest of the players on the team had also been \"released\" to pursue other events. This isn't the first time cheating has marred an esports event. As esports glory grows to carry with it more prestige and, more importantly, more money, the potential gain for cheating will encourage more people to take the risk. This is partially why in-person LAN events have become the standard across all competitive leagues: when you've got everyone in the same room using unfamiliar computers and surrounded by cameras, no one would dare try to cheat. It's too easy to get caught.Sign up for Motherboard Premium."}