{"id": "31 Photographers Capture Ghosts, Witches and Other Occult Phenomena ", "paragraph": "Ghosts, specters, and the occult have mesmerized photographers since the beginning of photographic history. More than a century before digital manipulation, there were countless attempts to use the \"medium\" (see what I did there?) to prove the existence of spiritual phenomena. Early images ranged from depictions of phantoms and janky, ghost-like blobs to abstract representations of spirits on X-rays, cyanotypes, and other light-sensitive materials. In 2005, the Metropolitan Museum of Art curated The Perfect Medium: Photography and the Occult, an exhibition and corresponding book surveying occult photography from the 1860s through the 1940s, a period in which photographs were often used as \"evidence\" of the spirit world. As a kid, before falling in love with photography, horror movies shaped much of my visual language and how I thought about the construction of narratives. Ultimately, they paved the way for a more recent obsession with occult-ridden images—everything from representations of ghosts and auras to the \"unnatural\" world of spiritual symbolism and the mystical unknown. (I'd even include campy, intentionally faked images of gore.)For Halloween, decades into the digital world, I've compiled 31 contemporary photographs ranging from apparitions and dark matter to witchcraft as a metaphor for our current political climate. While many of them nod to classic traditions of spirit photography, they also come from a now long-standing acceptance of photography as flawed in its representation of truth, and—often with a heavy dose of self-aware irony—function more as theater than any attempt to prove that ghosts are real.@elainenettlesbezold@ameliabauer@msrachelstern@barbaradiener@chase_c_middleton@terezazelenkova@larson.laura65@rivetgirlschiavo@jacobhaubt@roberthickerson@dylan.hausthor@rileycgoodman@michael_marcelle@paulguilmoth@peggyguggenheim@aleckaus@elinohara@house_of_hamelin@francesdenny@kensukekoike@carlajayharris@timpearse_photo@m.apparition@mbuhlerrose@rana.young@tommykha@tommynease Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Jon Feinstein on Instagram.Sign up for the best of VICE, delivered to your inbox daily."}