{"id": "Stan Lee, the Legend Behind Marvel's Biggest Superheroes, Has Died", "paragraph": "Photo by Erika Goldring/Getty ImagesStan Lee, the comic book icon and one-time head of Marvel, has died, TMZ reports. He passed early Monday morning at Cedars-Sinai Medical Center in Los Angeles, though his cause of death is not yet known. He was 95. As a Marvel writer in the 1960s, Lee—along with artists like Steve Ditko and Jack Kirby—ushered in the Silver Age of comics, imbuing superheroes with a level of naturalism and realism unlike anything the form had ever seen. He was named publisher of Marvel in 1972. Over the course of his long career there, Lee created or co-created an incredible slew of iconic superheroes like Spider-Man, Black Panther, the X-Men, the Fantastic Four, Iron Man, and many, many, many more. Even after his legendary tenure at Marvel ended, Lee had a big hand in the superhero world, executive producing most Marvel movies and TV series and, somehow, always managing to pop up for a quick cameo at some point.\"I used to think what I did was not very important,\" Lee said in a 2014 interview, according to the Hollywood Reporter. \"People are building bridges and engaging in medical research, and here I was doing stories about fictional people who do extraordinary, crazy things and wear costumes. But I suppose I have come to realize that entertainment is not easily dismissed.\"The aging Lee had been plagued with personal and health problems over the past few years, including a battle with pneumonia and rumors of elder abuse perpetrated by those close to him. Earlier this year, he was accused of groping and sexually harassing nurses caring for him—claims he \"categorically\" denied.Everyone from Marvel stars like Robert Downey Jr. to Elon Musk took to social media to pay tribute to Lee's legacy and mourn his death on Monday.Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow VICE on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}