{"id": "Rick Scott has 5 ongoing lawsuits in his Senate run. Now, he's the one getting sued.", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30. As part of his attempt to break into the U.S. Senate, Florida Republican Gov. Rick Scott has filed five lawsuits against county election officials. But now, he’s the one getting sued.  A large group of Florida voters and organizations filed a lawsuit against Scott on Monday for illegal abuse of power and conflicts of interest in the electoral process. As the current governor, Scott, for example, appointed Florida’s secretary of state, who oversees counting votes. Scott also sits on the Florida board which certifies elections and appoints its members. “Defendant Scott’s efforts to use the authority of his office to advance his campaign and his political party have been extreme,” according to the lawsuit from the coalition, which includes Protect Democracy, the League of Women Voters of Florida and Common Cause Florida.  “Defendant Scott has already issued his authority to influence and frustrate the high stakes vote-counting process, and the powers of his office give him the opportunity to continue to misuse his authority,” the suit continued. Scott’s race for senator against incumbent Democratic Sen. Bill Nelson is too close to call — the margins of the race dipped below 0.5 percent, with Scott leading by only 12,600 votes. In Florida, that warrants a recount. Two days after the election, Scott filed two lawsuits which made allegations that local officials were concealing voting records.  As part of his attempt to break into the U.S. Senate, Florida Republican Gov. Rick Scott has filed five lawsuits against county election officials. But now, he’s the one getting sued.  A large group of Florida voters and organizations filed a lawsuit against Scott on Monday for illegal abuse of power and conflicts of interest in the electoral process. As the current governor, Scott, for example, appointed Florida’s secretary of state, who oversees counting votes. Scott also sits on the Florida board which certifies elections and appoints its members. “Defendant Scott’s efforts to use the authority of his office to advance his campaign and his political party have been extreme,” according to the lawsuit from the coalition, which includes Protect Democracy, the League of Women Voters of Florida and Common Cause Florida.  “Defendant Scott has already issued his authority to influence and frustrate the high stakes vote-counting process, and the powers of his office give him the opportunity to continue to misuse his authority,” the suit continued. Scott’s race for senator against incumbent Democratic Sen. Bill Nelson is too close to call — the margins of the race dipped below 0.5 percent, with Scott leading by only 12,600 votes. In Florida, that warrants a recount. Two days after the election, Scott filed two lawsuits which made allegations that local officials were concealing voting records.  “Tonight, I am asking the Florida Department of Law Enforcement to investigate this immediately, and I am considering every single legal option available,\" he said at a press conference Thursday. \"No ragtag group of liberal activists or lawyers from D.C. will be allowed to steal this election from the voters in the state of Florida. I am proud to be the next senator from the State of Florida.” The recount began on Saturday and less than 24 hours later, Scott filed three more lawsuits calling for “emergency” injunctions to impound ballots in two largely Democratic counties and to stop local officials from submitting any newly counted ballots to the state.  Then on Monday, Scott insisted that he won the election and accused Nelson of trying to “steal” the race. If the state court approves the coalition’s lawsuit, Scott will remain in the race for Senate but will have his lawsuits dismissed. Results of the election are slated to be finalized on Nov. 20.Cover image: Florida Gov. Rick Scott (R) addresses his election night party in Naples, Fla., where he declared victory in the Florida Senate race with incumbent Sen. Bill Nelson, D-Fla., on November 6, 2018. (Photo By Tom Williams/CQ Roll Call) (CQ Roll Call via AP Images)"}