{"id": "Physicist Wins $3 Million Prize for Discovering Pulsars, Donates it All to Promoting Diversity in STEM", "paragraph": "Jocelyn Bell Burnell won this year's $3 million Special Breakthrough Prize in Physics, the largest cash prize awarded across academia. How tall are you? How many boyfriends do you have? Would you describe your hair as brunette or blonde?  While addressing a room of physicists at the Perimeter Institute for Theoretical Physics in Waterloo, Ontario, last month, Dame Jocelyn Bell Burnell recalled the questions journalists asked her in 1967 in response to her groundbreaking discovery of pulsars, rotating neutron stars marked by their distinct pulsating nature. Questions relating to “the astrophysical significance” of the discovery, meanwhile, were reserved for her thesis adviser, Antony Hewish, according to Burnell. Seven years later, Hewish was awarded the 1974 Nobel Prize in Physics for the discovery of pulsars. Controversially, Burnell was omitted, despite her role as co-author on the paper and as the first to detect their existence. Burnell herself does not begrudge the Nobel omission, however, and has said many times since that she “believe[s] it would demean Nobel Prizes if they were awarded to research students, except in very exceptional cases, and I do not believe this is one of them.” Last week, 51 years after her initial discovery, Bell’s contributions were recognized as she accepted the 2018 Special Breakthrough Prize in Physics and a $3 million check, the largest cash prize awarded across academia and twice the amount awarded for a Nobel. The award ceremony, held at the NASA Ames Research Center in Silicon Valley, more closely resembled the Oscars than a science summit, with a celebrity-studded audience and musical performances by Lionel Richie and GEM.  On stage, Bell committed to donate the $3 million in full to the Institute of Physics (IoP), a London-based scientific charity that works to advance physics education, research and application, where she previously served as president.  Read More: Recent Nobel Prize Winner Is 'Profoundly Sorry' for 'Degrading' Video of Women She and the current president of the IoP are working together to develop a new program that “opens doors to physics for people from every walk of life” by funding scholarships for underrepresented groups. Bell, who claims to have battled “imposter syndrome” at many points in her scientific career, believes the program will ensure that access to science for diverse groups remains “at the very top of the science community’s agenda.”  While generous, her donation is not altogether surprising to Dr. Ayse Turak, an associate professor of engineering physics at McMaster University in Ontario, Canada. “The joy of being a professor is watching students grow into scientists, and I’m sure Dr. Burnell would agree,” Turak told me over the phone. “In that way, I’m not surprised that she chose to make this donation, because ultimately that’s what our job is. It’s our job to nurture the next generation of scientists. The marker of a true scientist is not only that they aspire for impact, but also the impact of others. Science is a collaboration.” While the recognition may have come late for Burnell, she’s in good company this year. The Perimeter Institute crowd gave a standing ovation for another note-worthy attendee, Donna Strickland.Strickland was awarded the 2018 Nobel in Physics for the invention of chirped pulse amplification, a technique to manipulate lasers that has led to the development of a wide array of powerful laser-based tools, including those used for corrective eye surgery, drilling, and data storage. Strickland is the first female to earn the distinction in over half a century, and one of only three women total, along with Maria Goeppert-Mayer and Marie Curie.  Like Burnell, Strickland was a graduate student when the discovery was made, which signals a potential shift in academia’s perception of the value of graduate contributions made possible in part by Burnell’s legacy. The image of the two sitting side-by-side was a strong visual representation of diversity in the field of science. In commemorate, the Perimeter Institute used the opportunity to unveil portraits of Strickland and Burnell, alongside eight other female scientists, in a free digital series called Forces of Nature: Great Women Who Changed Science.  Dr. Melinda Han Williams, who holds a PhD in applied physics from Columbia University, believes public recognition for Burnell and Strickland will have a big impact. “I did not have any mentors that looked like me in school. Now that I have a toddler, I think often about how the classic image of a scientist is often Einstein, which is too narrow. There is a lot of value in having prizes [like the Breakthrough Prize] and sharing stories so new role models are created.”   Listen to CYBER, Motherboard’s new weekly podcast about hacking and cybersecurity.Sign up for Motherboard Premium."}