{"id": " I Cruised LA with the Badass Moxi Roller Skating Girl Gang", "paragraph": "Photo by Rozette Rago. Michelle Steilen, founder of the Moxi Skate Girls, flying through the air in the skate park.They’re impossible to miss, rolling in like a rainbow cavalcade. Their skates glide like an extension of the body, carving shapes and patterns into the tarmac. Passersby gawk. Their presence is encompassing, demanding even. They swerve with incomprehensible grace, in ways that don’t look possible on what is essentially a set of four wheels strapped to feet. It all feels like being in one of those quintessentially “California” looking music videos.The Moxi Skate Girls are the tight knit community that has grown out of Moxi Skates, a roller skate company based in Long Beach. The company was founded in 2008 by Michelle Steilen—known from her roller derby days as as Estro Jen—and sells retro-style outdoor roller skates through the legacy manufacturer Riedell Shoes Inc. They’re incredibly popular, selling 10,000 pairs in 2018 alone. Their brightly colored skates are currently sold at Urban Outfitters, Bando, Dolls Kill, and roughly 200 roller rinks and skate shops worldwide.Though Steilen grew up roller skating, her dedication to the sport began in earnest when she moved to Los Angeles and began skating with the LA Derby Dolls. But she yearned to make skating more accessible and figured that selling high quality, lifestyle oriented skates designed to perform recreationally—rather than the drab tan and black, rentable indoor models—was the right place to start. “I wanted anyone to be able to skate,” Steilen says, pivoting backwards onto her toe stops in order to face me. “And I wanted to build a roller skating community.”All of the skates are named after Steilen’s family members. The “Jack” after her little brother, and the “Beach Bunny” model is an ode to her pet rabbits, Nimbus and Cloudia. But Moxi’s most prominent skate is the high top “Lolly,” named after Steilen’s sister Loren. They’re manufactured by hand in Red Wing, Minnesota, where each skate hits 85 stations in the factory before being packaged into a box. As a result, each element is crafted with obsessive attention to detail, from the suede boots to the thrust and foot plates. The final look is one part 1920s retro and one part 1980s brightly colored fever dream—an homage to the golden age of roller rinks in Los Angeles, and a perfect fit for Instagram where they’re coveted by thousands of followers. In these Instagram photos, women wear the same Moxi Skate Girl uniform: Daisy dukes (or Hammies, as they’re called on the Moxi website), a stretchy tank top to accommodate serious movement, matching Moxi fanny packs, and colorful tube socks. The outfit makes them stand out regardless of the venue—be it boardwalk, skate park, stairwell, or during a hill-bomb. Their look announces their existence, as if to say  this is ours in spaces that have historically been dominated by men. This bravado gave the company its name. “My UPS guy told us we got a lot of moxie,” Steilen said, “and I liked how that sounded.”So much of Moxi’s aesthetic comes directly from Steilen herself. On and off skates, she is a force of nature, matching exhilarating strength with delicate footwork. She wears these contradictions beautifully. Mid-skate, Steilen transitions from a set of graceful one foot turns, executed by balancing on her right toe stop, to a split-leg handstand. She embellishes an electric slide type of repeated footwork with spins and kicks. She falls once, gets up, examines her already forming bruise, and rolls on. When I ask why we haven’t seen more of the Moxi Skate Team on television or in documentaries, she says simply, “The Moxi Skate Team—they can’t contain it and sell it.”She’s not wrong. At this point, Moxi does more than sell skates—they’ve created an image so pervasive that it has influenced a culture of skaters and inspired converted “Moxi Skate Girls” to move closer to Long Beach where the flagship store is located. “The shop acts as a place for us all to meet up,” says Shayna “Pigeon” Meikle, the owner of the Long Beach and Venice Moxi Skate shops since Steilen sold them to her in 2014. “We wouldn’t know what each other was doing, but we’d all end up at the shop, like, ‘Oh, we’re all here. Alright let’s go hang, let’s go skate.’” Thanks to their viral fame, the Moxi Skate Girls get recognized frequently. “It’s great to be known by people on the street,” Meikle says. “I went to Target with my mom the other day, and the checkout lady was like, ‘Are you Pigeon?’” The newly minted Venice shop is a secondary nexus. “That’s my favorite thing about working at the Venice Shop—seeing people make connections,” Vanna Jade Curtis says, batting her dense, green curls out of her face. She moved to Los Angeles specifically to join the Moxi Skate Team. “Random customers from other parts of the world will meet, swap numbers. That’s possibly a real, enduring relationship.” Their infectious sense of community also draws new skaters in for classes or “Skate Outs,” where dozens of locals meet at a shop and skate together around town. This is what differentiates Moxi from other prominent roller skating brands and groups in Los Angeles—like LA Roller Girls, a selective group of world-renowned skaters that get cast in TV shows and music videos. Moxi’s product is the cornerstone of a desirable lifestyle, one that rides heavily on Steilen’s curated image—the uniform paired with a certain peacocking panache. Thanks to their Instagram and YouTube presence, the brand is recognizable worldwide and synonymous with talent, individuality, and female badassery. And the brick-and-mortar Moxi Skate shops paired with the Moxi Skate Girls’ local skate lessons make that lifestyle appear obtainable. I’m thankful for that last fact, because I’m taking a skate lesson with them today and everything is embarrassing. Liv Buchan hugs me upon meeting, and hands me a glittery helmet. She’s bubbliness incarnate, with enough optimism to muffle my apprehension. “We brought this in case you needed it, and it’s glittery so it will look cute in photos,” she assures me. I’m wearing seafoam green Moxi Lolly “Floss” skates that I bought on Craigslist from a retiring LA Derby Girl. I paired them with bunny print socks to achieve a proximate Moxi Girl look.The most minute things become incredibly dangerous to the novice skater. What was once innocuous becomes amplified, princess-and-the-pea style: A tiny pothole or bump in the pavement capsizes a skater who has their knees locked, sand destroys roller skate bearings, and stairs ruin knees. Even the slightest of slopes is readily apparent. In my email exchange with Steilen I asked to learn how to spin, but putting on my skates forced me to reconsider. After a childhood on ice skates and inline skates, I thought I could wake up early and practice until I became less rusty on quad skates. Alas, these are an entirely different animal, and I’m eating shit like it’s my job (technically, in this case, I guess it kind of is).Moves that look simple are deceptively challenging. Unlike ice skating, where spinning on two feet is difficult but possible on a set of skates that are designed to rotate on a central axis, you have to tilt each individual roller skate a specific way in order to spin on them. Starting with knees bent, you balance on the front two wheels of one foot and the back two wheels of the other foot. Your arms provide bit of torque as you pop up into a spin. Speed helps. At least, this is what I’m taught. I’m failing splendidly. But they don’t give up on me, despite my powerful self-loathing. Curtis stands at the top of a small bluff yelling, “You’re trying to spot my face, but I need you to stare at me at the end of your spin—not just try. You got this!” I do eventually make a full 360, thanks to our intimate eye contact.“Shooting the duck,” a pike squat while moving, is impossible to hold without swerving. Somehow, the Moxi Skate Girls can all hold this position while weaving back and forth on purpose. Dita Davis is particularly adept at this, using her hips and raised leg to squiggle along the bike path. She tells me, “going faster makes it easier,” just like riding a bike. But, just like riding a bike, the faster you’re going, the harder it hurts when you fall. Getting back up is the mantra of a sport that asks you to navigate the inertias of gravity while throwing your body at things like a projectile. “We laugh when we fall,” Buchan says, smiling.Through my ceaseless stumbles, the women never fail to make me feel like part of their hodgepodge family. Buchan holds my hand while I try to walk up and over a tiny hill of sand. (“Put your weight on your toe stop. Don’t ruin your bearings,” three of the women tell me separately.) Throughout the day I feel their mission more and more implicitly—the fierce determination to reclaim stereotypically male spaces in the skating world. Meikle has been skating this entire time while pushing a baby carriage. She intermittently breastfeeds her young daughter. “You should put this in your article,” she tells me, “that I’m just popping a boob out, and no one cares.”Skating so aggressively on this boardwalk feels like a “fuck you” to a culture that forces women to police their bodies and actions. Men continually comment on our performance, make passes, and tell us to spin or jump differently. Not ten seconds pass without a “smile, babe” or a wolf whistle being lobbed. But the Moxi Skate Girls fight back. When a middle aged storekeeper yells, “I can do better than that,” Buchan confronts him. “Why do you think you can tell us how to skate?” she yells. Her body language is defiant, she gesticulates wildly as she interrogates him. He grows angrier and then defensive. Eventually he concedes. Buchan rolls away.We’re taking up so much space. I can feel my skin crawl with the knowledge that I am not lithe enough on skates to move out of the way if I need to—whoever I pass has to be the one to dodge me. It’s exhilarating. Is this what it’s like to be that boy on a skateboard who crashed into me just last week while I was carrying groceries? Or the man on the Bird scooter who knocked me to the ground as I was crossing the street? I know it’s not—I’m still thinking about it too much—but I wonder how many times I need to skate with the Moxi Girls to feel like I deserve to move freely, to slice up the tarmac without consequence.To see Venice on skates is to see a different city. Everything is suddenly closer together. The long, winding bike path that connects Venice to Santa Monica shrinks to a 15 minute skate. The switch between the two beaches is not quite a gradient, but sailing through on wheels makes it feel like you're at Whole Foods one moment and then getting smacked in the face by Muscle Beach the next. It may be wobbly and exhausting—my calves are shrieking—but I'm flying and no one can catch me. I never ever want to take them off.We’ve finally reached the skate park, the convergence of concrete and metal, covered in scuffs and the ghosts of wipeouts from skateboarders—men and women alike, though mostly men and rarely from roller skaters. The skate park can be a challenging place for the Moxi Skate Girls to train, given their reputation. Much like their harassment on the boardwalk, random people will insist that the women perform certain moves every time. “You gotta do certain tricks,” Curtis says. She’s become famous for her talent at doing backflips in the bowl. “It’s almost like a band, there are songs they expect you to play.”Steilen descends into the bowl without much fanfare, weaving around other skaters as she tests velocity and periodically stops at the coping. Without warning she launches into a cartwheel on the bowl’s edge, before skating backwards and alighting into a series of jumps. “Stopping at the top is actually one of the most difficult moves,” Buchan tells me. “You have to stop your momentum completely. You can’t just let it carry you forward.” Buchan is sitting on her knees, her light perspiration making her skin glow like a model in a Glossier ad. Neither of us are actually doing any skating, but she hands me the glittery helmet again. “Safety first!”As the crowd begins to recognize the Moxi Skate Team, dozens of spectators pile up against the railing, iPhones at the ready. The skate park begins to empty out except for a few lone skaters who continue to coast on their skateboards. Curtis and Steilen are each at the edge of the bowl, testing drop speeds. The bowl curves out so that each of them has a descent of a different length. If they want to synchronize, they’ll have to test the right time to stagger dropping in, so that they do their trick at the same time. After a few tests, Steilen looks directly us. Buchan takes her phone out and gives a thumbs up.Steilen shouts, “Are you ready?” and Curtis nods in ascension. A mental barricade has to drop to perform the kinds of tricks that the crowd is expecting—ones that could easily slice you open or break your back if you don’t land correctly. The crowd falls into a hush as we try to guess the trick they’ll be doing. They’re standing at the edge. They drop in, skating back and forth to build the momentum and synchronize, before launching themselves up the other side. At the apex they each fling their bodies backwards while arching their backs. Time stops for a moment while they hit the peak of the jump. They’re completely upside down. Their arms are outstretched, their hair is fanned out wildly.Time starts up again. Their skates hit the ground with a loud snap, their knees bend to absorb impact, and they go sailing down the bowl skating backwards. It’s a perfect synchronized backflip. It looks stupidly effortless, the crowd is cheering. Steilen and Curtis turn to Buchan and I, with inquiring looks. We caught it on camera. They’re climbing out of the bowl to see. We swarm them with high fives, hugs, and screams. They look at our cameras, and start uploading the footage to Instagram. (In the background, you can hear Buchan saying, \"don't '@' me unless you can do this.\") The crowd clamors for the women to do more tricks, but we know we got what we needed—we did what we came for, and it's time for us to roll out. We're doing this for ourselves, and no one but. That's the Moxi Skate Girl way. Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Nicole Clark on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}