{"id": "Jacy Reese Thinks Technology and Ethics Will See the ‘End of Animal Farming’ ", "paragraph": " Activist and author Jacy Reese thinks the world is on the precipice of a technological shift that could end animal farming forever, changing the way the world eats and dramatically improving the environment. “There are practical reasons that make me optimistic, but I do worry about the next decade or two,” Reese told me over the phone.  Reese is the co-founder of the Sentience Institute—a think tank devoted to expanding humanity’s moral circle—and author of the new book  The End of Animal Farming: How Scientists, Entrepreneurs, and Activists Are Building an Animal-Free Food System. The book is a survey of a budding movement that believes humans can end animal farming through a combination of new technologies that provide lab-grown meat, more consideration for the animal world, and activism.  According to Reese, lab-grown meat—animal protein raised from cultures in a laboratory instead of from living beings on a farm—is a key technological and social change he sees playing out in the next few years that will help put an end to animal farming. Reese thinks the lab-grown industry can learn from mistakes made by the genetically modified food industry. Genetically modified foods have helped feed the rapidly expanding human population, but we’re all creeped out by them. No matter how many scientists publish studies about their safety, there’s something about them we don’t trust. Big agricultural companies such as Monsanto don’t do themselves any favors by copyrighting certain strains, running small farms out of business, and being secretive.  “GM foods have gotten a really negative reputation and have failed to be adopted, which is kind of weird in the whole scheme of technology,” Reese said. “We think of everyone wanting innovation and embracing new technologies in the never-ending march of technological progress.”Read More: Nobody's Gonna Eat Lab-Grown Meat Just Because It's Better for the Planet For lab-grown meat to succeed, Reese said, its creators need to be transparent with the public about its origins and play up the ethical angle. And, of course, be delicious. “If you’re tackling a moral issue like animal farming and you want to solve it with technology, you might want to avoid the perception that it’s a product that’s been put out for profit,” he explained.  The book isn’t interested in preaching to the converted or detailing the myriad horrors of animal farming. Reese is all about effective altruism—practical and near-term solutions that move his cause forward. “It’s always hard to predict trends, but we seem to be on track,” he said.  He pointed to the increasing number of American vegans and vegetarians, documentaries about the horror of factory arms, and—crucially—the economic inefficiency of factory farming. “It takes at least ten calories of plant-based food to produce one calorie of animal-based meat,” Reese told me. “With protein, it takes around ten grams of animal protein to produce two grams of animal protein. Animals are just inefficient. Humans always want more output for fewer input.”  Those pragmatic arguments are important for laying the groundwork for one of Reese's long- term goals—”expanding humanity’s moral circle.” This idea, detailed in the book and spearheaded by Sentience Institute, is getting humanity to believe that all sentient beings are worthy of a life free of pain and suffering.  But Reese understands that not everyone walking down the meat aisle at the grocery store will be happy to embrace bacon that came from a test tube, so that’s why marketing and perception are important. He also knows that the changes won’t come overnight, but can only happen with sustained and practical action from believers. Despite the problems, a feeling of optimism runs through  The End of Animal Farming. There’s a sense that, if new technologies are regulated and marketed correctly, humans will radically change the way they eat in the next few generations.  “If I had to speculate, I would say that by 2100 all forms of animal farming will seem outdated and barbaric,” Reese wrote in  The End of Animal Farming. “The moral momentum of ending 99 percent of animal farming will lead our descendents to oppose even the final 1 percent.”  The End of Animal Farming gives many reason why this will happen—from the rise of lab-grown meat to the expansion of the moral circle—but Reese wrote that it’s ultimately market forces that will force our hand. The Earth’s population is expected to grow by billions of people in the coming decades. Just as dramatic changes to agricultural yields allowed a population boom in the 20th century, humans will have to reconsider how it gets its protein—or the planet will starve. “The system’s fundamental inefficiency will end animal farming one day, regardless of our concerns for animals, the environment, or human health,” he wrote.   Get six of our favorite Motherboard stories every day   by signing up for our newsletter.Sign up for Motherboard Premium."}