{"id": "Flight Attendants Questioned a Black Doctor for Helping a Sick Passenger", "paragraph": "Photo of Stanford via her Twitter; photo of a Delta plane by Flickr user Tomás Del Coro Earlier this week, Dr. Fatima Cody Stanford was on a Delta flight from Indianapolis to Boston when she noticed something was wrong with the passenger sitting next to her. Given that she is, you know, a doctor and all, she started to help the person—but for some reason, the flight attendants onboard apparently thought there was something suspicious about that. According to the  New York Times, a stewardess came over and asked her if she was a doctor. Stanford said that, yes, she was—she's a registered physician in Massachusetts—and she handed the woman her medical license, unprompted. She told the  Times that she'd made a habit of carrying it with her after reading about Dr. Tamika Cross, a black physician who was asked for her credentials while trying to assist a passenger on another Delta flight back in 2016.  According to Stanford, yet another flight attendant then came over and asked to see her medical license, which she gave her. Apparently satisfied, the attendant left—only to come back with the first attendant in tow. They both started questioning Stanford. “Are you a head doctor?” one asked. “Are you actually an MD?”  “Is this your license?” the other attendant asked, according to Stanford—to which she replied, “Why would I carry someone else’s medical license?”  As Stanford saw it, this was a pretty blatant case of racial profiling. She’d proven to two separate flight attendants that she was a doctor two separate times, and still, somehow, they had doubts about her credentials—just like they’d had about Cross’s. “This is something that the medical community has embraced as a reality. When you Google a doctor, most of the pictures that come up are of a white man,” Stanford told the  Times. “There are other people who look like me. And I should not be called into question about something I have worked for my entire life.” Delta has since apologized to Stanford in an email and said that it’s conducting an investigation into the situation. But her uncomfortable run-in with those flight attendants is now about something bigger than just one flight: It brought the #WhatADoctorLooksLike conversation back into focus. Cross, the physician who had a similar experience back in 2016, wrote on Facebook about what she sees as a clear lack of progress around the issue.  “In 2016, you did not believe I looked like a doctor either,” her post reads. “Hundreds of thousands of us across this country and even in other countries banded together to show you #whatadoctorlookslike but here we stand JUST 2 years later and your employees have not learned.” Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Arimeta Diop on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}