{"id": "'Soul of a Nation' Exhibit Rocks Perceptions of Black Revolutionary Art", "paragraph": "Elizabeth Catlett, \"Black Unity,\" 1968I'm pretty Black. I went to the historically Black school in Washington, D.C. known as Howard University, speak Twi (a dialect of Ashanti people in Ghana), and am well-versed on the teachings of several Black scholars—from Malcolm X to Lil Boosie. But there's always room for growth, and that's how I generally approach art. Recently, I was invited by the Brooklyn Museum to check out Soul of a Nation: Art in the Age of Black Power, an exhibit of more than 150 works sweeping aesthetic range, including figurative and abstract painting, assemblage, sculpture, photography, and performance. Encompassing 20 years of work—from 1963 to 1983—the exhibit's intent was to display pieces from over 60 Black artists during one of the most politically, socially, and aesthetically revolutionary periods in American history. Anyone who knows Brooklyn knows the museum, and particularly for their Target First Saturdays parties that invite people to check out exhibits and enjoy a dance party for free. To be transparent: Those are usually the times I've made the trek to Park Slope from my cozy home in Bed-Stuy to visit. So it was a treat—to say the least—to enjoy the quiet halls of the Brooklyn Museum on a weekday.Walking through Soul of a Nation with Ashley James, the museum's assistant curator of contemporary art, I learned a ton about the artists featured and how each region of the United States responded to systematic oppression during this revolutionary period. \"I feel like my generation is the beneficiaries of artists like these,\" James said about the presentation she spent a year reprising for its Brooklyn installation— a version of it previously showed in Bentonville, Arkansas. As Nina Simone played in the background James explained that while not every artist in the exhibit performed activism in their work, they all progressed the movement. \"People feel different loyalties to various constituencies,\" James said. \"There are artists who felt like they were making for a Black community. There were artists who felt like they were making protest art for the broad community to be felt by multiple audiences. There are artists who didn't feel like their work needed to respond to politics. All of these artists at least felt like their work responded in terms of aesthetics.\"James continued, \"Some artists from this era—and even now—will tell you what's expected of a Black artist. But there are pressures that we all feel about everything. What this show does show is the result of various artists responses to whatever questions felt the most compelling to them.\"Simply existing as a Black artist is a revolutionary act within itself. Aside from funding the material needed to create works of art, there's also the time, dedication, and societal pressure to create work that has a message.Viewing work from Emory Douglas, the Minister of Culture for the Black Panther Party who created their iconic newsletter art to Faith Ringgold, who is known for her quilts but created a map labeled with the historical sites of prison riots, I was proud. The journey is far from over, but the legacy of Black art in this country will forever tell the story of reverie that bleeds from one generation to the next. Get your horoscope in your inbox, every day."}