{"id": "Saudis admit Khashoggi was killed but claim it was a “fistfight”", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.Saudi Arabia finally conceded late Friday that dissident journalist Jamal Khashoggi is dead, but they added a new cover story for how it happened: he was killed in a fistfight inside the consulate in Istanbul.In an epic news dump issued at 1 a.m. in Riyadh, Saudi state media announced that 18 Saudis have been arrested in connection with the incident. In the same statement, the Saudi government said Khashoggi was killed Oct. 2 after an argument in the consulate resulted in “a fistfight that lead to his death.”The kingdom’s latest explanation stands in stark contrast to its initial claim that the Washington Post columnist left the consulate the same day he entered it.   Read:   Inside the Turkish newspaper landing some of the most explosive Khashoggi scoopsOf course, that story had won few takers, and ran contrary to reports from Istanbul, where Turkish security officials leaked one gruesome detail after another regarding the Saudi dissident’s murder. Citing these officials, Turkish media reported that Khashoggi had been tortured inside the consulate, murdered, and dismembered with a bone saw by a team of 15 Saudi assassins. His screams were even said to have been caught on audio tape. Saudi Arabia finally conceded late Friday that dissident journalist Jamal Khashoggi is dead, but they added a new cover story for how it happened: he was killed in a fistfight inside the consulate in Istanbul.In an epic news dump issued at 1 a.m. in Riyadh, Saudi state media announced that 18 Saudis have been arrested in connection with the incident. In the same statement, the Saudi government said Khashoggi was killed Oct. 2 after an argument in the consulate resulted in “a fistfight that lead to his death.”The kingdom’s latest explanation stands in stark contrast to its initial claim that the Washington Post columnist left the consulate the same day he entered it.   Read:   Inside the Turkish newspaper landing some of the most explosive Khashoggi scoopsOf course, that story had won few takers, and ran contrary to reports from Istanbul, where Turkish security officials leaked one gruesome detail after another regarding the Saudi dissident’s murder. Citing these officials, Turkish media reported that Khashoggi had been tortured inside the consulate, murdered, and dismembered with a bone saw by a team of 15 Saudi assassins. His screams were even said to have been caught on audio tape.   Read:   Everything we know about the alleged Khashoggi murder and Saudi cover upDespite the change in tune, the new offering isn’t likely to move the heat off of the kingdom’s powerful young prince and de-facto leader, Mohammed Bin Salman. Prince Mohammed is believed to be behind the ordering of Khashoggi’s death and was known to be at odds with the dissident’s criticism of his rule. Yet, the U.S. has been cautious to direct blame toward the young Saudi leader. On Thursday, Secretary of State Mike Pompeo said the U.S. was giving the Saudi government “a few more days” to complete their own \"thorough investigation\" of what happened to Khashoggi before weighing in on the matter. President Trump has struck a similar tone, at once threatening a “very severe” response while also coming to the kingdom’s defense. "}