{"id": "Watch a Utah Lawmaker Try Weed for the First Time in a Parking Lot", "paragraph": "Screengrabs via Jim Dabakis / FacebookIn a few weeks, Utah will vote on Proposition 2, a controversial measure that would legalize medical marijuana in the state. Regardless of the result, lawmakers have vowed to re-legislate the issue and will consider a compromise bill that, compared to Prop 2, would restrict how marijuana could be consumed and who could grow it. Jim Dabakis, a Democratic state senator from Salt Lake City, thinks it's kind of weird that a bunch of politicians are going to shape Utah's weed policies without ever having gotten stoned—so over the weekend, the self-described \"marijuana virgin\" decided to trek to Las Vegas (where cannabis is legal) and try the stuff himself.Thus, this gem of a video was born, in which Dabakis—who explains that he'd \"never tasted, smoked, eaten, shot up marijuana in my life\"—struggles incredibly hard to open a bag of weed gummies, cautiously licks half of one, then pops it in his mouth.Dabakis told VICE that the video doesn't tell the whole story. Sitting in his hotel room about an hour and a half after he'd tried the gummy, he still wasn't really feeling anything. So he decided to up his dosage. That's usually a bad idea for first-time users, who can quickly find themselves way too high, but Dabakis was fine.\"I took the half, and then I took another half, and not a lot happened. And so then I took  another half, about a half an hour after that. And that’s where it kind of kicked in,\" he said. \"I just felt a kind of warm glow. It wasn’t life-changing, it didn’t seem like it was anything profound. I didn’t find God or anything.\"Having gotten himself sufficiently stoned, Dabakis said, he went to see Cirque Du Soleil, which is a pretty high-key way to experience getting blazed for the first time. Back in Utah a few days later, he made another video letting folks know how the whole thing went—explaining that while he still \"wouldn't suggest shooting up marijuana to anybody,\" he couldn't see why anyone would make such a big deal over a little pot.\"I'll tell you, I think it's a lot of ho-hum,\" he said in the video. \"I think the reefer madness crowd, you guys need to try it.\"Maybe the fact that Dabakis ate one and a half weed gummies and didn't die won't do all that much to sway opinions in the Utah state senate, where he's just one of five Democrats pitted against 24 Republicans. But he told VICE he's hoping that, at the very least, his little experiment might show them weed isn't as big of a deal as they think.\"It’s to remind my colleagues that, by the way, there’s a whole other world out there. Not everybody thinks that marijuana leads to—that it’s the gateway,\" Dabakis said. \"I do enjoy kind of poking the bear. But there’s some serious issues that are underneath it that I hope I can get to by making a bit of a fool of myself.\" Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Drew Schwartz on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}