{"id": "Why Is Steve Bannon Giving a Keynote Speech About Nationalism at an Academic Tech Conference?", "paragraph": "Image: Wikimedia CommonsOn October 26, the International Conference on Advances in Computer Entertainment Technology (ACE) announced a new keynote speaker—former head of Breitbart News and White House Chief Strategist Stephen Bannon.It’s an odd pick for ACE, a conference where experts in fields such as robotics, artificial intelligence, and game design gather to present research results, demo projects, and share ideas. Bannon is a controversial pick because he helped get Donald Trump elected and was an architect of many of his nationalist and far-right policies; earlier this year, Bannon was invited and then disinvited from the  New Yorker Festival. While Bannon does have a background running World of Warcraft gold farms for a startup and has been involved in a wide variety of peculiar tech projects, in the recent past he's been known primarily for being involved in politics and media, not the topics that ACE generally talks about, making the choice stranger.The invitation has rankled many scientists who had originally planned on attending. Peter Gray, a research professor at Boston College and the author of psychology textbooks, was initially scheduled to give a keynote as well but dropped out when he heard Bannon would attend. He had planned to give a speech about the value of children playing video games.“I have taken pains to keep my drive for children's freedom and play separate from political ideology and my participation as a co-keynoter with Bannon would severely impair my credibility with the many diverse groups with which I am involved,” Gray said in a letter to ACE, which he shared with Motherboard. “I have appeared, happily, on the same stage with libertarians and others with whom I disagree on many issues, but Bannon's alt-right brand is personally odious to me and, more importantly, by association, would work against my credibility and that of the causes to which I am passionately devoted.”Bannon is attending the conference at the invitation of Adrian Cheok, a Chair Professor of Pervasive Computing at City, University of London and the editor of  Love and Sex With Robots , a recent compendium of papers compiled from the Love and Sex With Robots conference. He’s the Steering Committee Chair and Founder of ACE conference. Cheok told Motherboard that Bannon’s nationalism is the whole reason he invited him to speak at ACE. “I’ve seen [Bannon] talk many times,” Cheok told me over the phone. “When he talks about economic nationalism...he’s talking about more opportunities for citizens of the country. Logically speaking, he’s got a point. It’s just very simple mathematics. If you’ve got a billion people in China, of course you are going to find people who will work at a much lower salary and do the same job better.”Cheok repeated to me right wing talking points and justifications for Bannon's brand of xenophobic nationalism, saying that black and other minority workers in America were suffering because companies were using H1-B visas to import cheap labor. “Economic nationalism can help minority groups—black, hispanic, working class—to get high tech jobs in the technology industry,” he said.Cheok has a history of supporting Bannon online and told me he’s watched a lot of videos about him and read every article he could. “Leftists are such weak sissies, and against free speech!” Cheok tweeted on September 4 above an article about The New Yorker Festival disinviting Bannon. “They can’t stand anyone not following leftists dogma and propaganda!” Cheok also has a history of using social media to harass colleagues and critics.Since Bannon was announced as a speaker, prominent members of the academic community have begun speaking out against his inclusion.“I think inviting him is out of place and using the conference as a tool to advocate a personal political message and in essence hijacking the conference for political means and casting a long shadow that will tarnish its name for ever,” Yoram Chisik—a digital media researcher at the University of Madeira in Portugal and former member of ACE’s steering committee told me in an email.Since ACE announced Bannon as a keynote speaker, other prominent members of the academic community have spoken out on Twitter. “The 2018 ACE conference, organised by someone who has harassed my colleagues in the past, has just announced Steve Bannon as one of its keynote speakers,” Mike Cook—Senior Research Fellow at the University of Falmouth’s Games Academy—said on Twitter. “Please withdraw papers from ACE, do not go to ACE, do not host ACE.” Since this article was first published, Springer Nature—a publisher of academic research—has dropped ACE as a client after 14 years of working with the conference. “Springer will not be publishing the (technical) proceedings of ACE 2018, the 15th International Conference on Advances in Computer Entertainment Technology,” a Springer spokesperson told Motherboard in an email. “The number of submissions to ACE 2018 compared to previous years is extremely low and remains well behind expectations. Moreover, the decision to withdraw has been made following a number of irregularities reported to us regarding the paper reviewing and selection process and regarding the organization of the ACE 2018 conference. These procedures do not comply with our publishing guidelines which require a transparent and competitive article selection and thorough peer review process.”This isn’t the first time Cheok has stirred controversy. He delivered a keynote address about love, sex, and robots at the 2017 Foundation of Digital Games (FDG) conference and drew criticism for his handling of the topic, and his combative attitude towards critics in the aftermath. In response to that controversy, Chisik and his peers resigned from the committee, but he chose to speak out after Bannon was named as a speaker.“This is not an issue of free speech, since a specialized conference is not a general stage such as say inviting a speaker to a university or town hall meeting but a specialized event for which academic staff pay to participate,” Chisik said. “The content and the speakers should be fine-tuned to the subject of the conference as the conference is not an entertainment event but an event intended to support the study of entertainment technology and thus Bannon has nothing of value to contribute to the topic of the conference.”Cheok disagrees. “Psycho Yoram [Chisik] and his hater crew should worry less about ACE conference, and more about research,” Cheok tweeted as part of a multi-tweet long rant on October 29. “Stephen Bannon…will give a very important talk about how economic nationalism will help minorities (blacks, hispanics, etc) to obtain more high tech jobs such as in computer entertainment industry.”I reached out to the University of Montana via email, where ACE will take place this year, but have not heard back. However, a representative from the University told a local news station that it isn’t in any way affiliated with ACE, just that it’s using the university's campus as a host.Gray and other academics have pulled out of the conference, but Bannon will not be disinvited, Cheok said. “I’m pretty sure that later on, people will say ‘Yes, you know, this was good that there was a conference that didn’t just talk about the technical issues because it was convenient and was willing to take a risk in order to do so,” he said. “Of course, it’s made my life extremely difficult … but I’m prepared to take a risk and I think I’ve learned that it will be a good thing, and you know maybe I get crucified, but that’s OK.\"Update: This article has been update with comment from Springer, a publisher of academic research, which has dropped ACE as a client after 14 years of working with the conference.Sign up for Motherboard Premium."}