{"id": "Artists Are Occupying Museums to Protest Big Pharma", "paragraph": "L: Nan Goldin protests at the Harvard Art Museum (Erin Clark for The Boston Globe via Getty Images). R: Domenic Esposito's spoon sculpture outside of Purdue PharmaIf it weren’t for artist Bob Ross, Caledonia Curry might have ended up a heroin addict like her mother. It was summertime, 1987. Curry was ten and her mom, briefly sober for the first time since her daughter was born, decided it’d be fun to take her precocious child to a painting class in their hometown of Daytona Beach, Florida.Inside a little yellow house by the beach, the Currys discovered something shocking. “Oh shit,” Curry recalled. “It's a bunch of white-haired old ladies standing at their easels. I’m only ten. Am I in the right place?” She was. Bob Ross, the curly-headed champion of “happy accidents,” happened to be a Daytona Beach native and had inspired a generation of local retirees to teach their own art classes. This particular class was led by a frizzy-haired woman with a raspy voice that belied countless cigarettes at beachside dive bars. But she was caring and compassionate, and she gave Curry her first memorable outlet from a troubled upbringing.“I still remember the paint fumes,” Curry says. “I was almost high or something. That first day she basically painted my painting, but the upshot was she sent me home with something gorgeous. Everyone thought I was a genius. I wasn't, but that didn't matter. I discovered self-esteem. I can't understate how life-changing that was for me.”Every Sunday for the next couple years, Curry stood in a circle with a bunch of old ladies painting mountain peaks, creeks, and trees. Brandishing a paint brush helped quell her inner chaos and heal the trauma of an early childhood raised by mentally ill mother with an extreme opiate addiction. Thirty years later, Curry, who goes by the  nom de plume Swoon, is a world-renowned street artist, known for painting illustrative portraits and building intricate installations that probe the depths of her psyche.Amid an opioid epidemic that kills more than 115 Americans on average every day, artists like Swoon are wielding their craft to combat addiction. They range from muralists to photographers to sculptors, and they’re using their art to treat trauma, offer reprieve to others, and hold powerful entities accountable. But advocacy and recovery can each be Sisyphean struggles. Relapses are rampant. Addiction and overdose rates continue to rise. And the Sacklers—the billionaire family that owns Purdue Pharma, makers of OxyContin—continue to profit off America’s homegrown drug crisis.Swoon thinks those early art classes may have saved her from a substance abuse problem. “For me, discovering art was the same as when my mom discovered drugs,” she says. “It soothed my pain.” It’s a tonic she wants to share. Since 2015, she has collaborated with Mural Arts Philadelphia’s Kensington Storefront, a public art program and community resource center that serves down-and-out residents of the open-air drug markets around the Philadelphia Badlands.Through workshops, crafting, and storytelling sessions, Swoon and the other Mural Arts organizers—many of whom are mental health professionals—give addicts and those in recovery a safe space from the street. It’s not so much a place for recovery as is it a support system, a stepping stone to stability. “Art making is incredibly soothing,” Swoon says. “Almost anyone who picks up a paintbrush, the first thing they say is how calming it is.”One art session entailed asking students to draw their “indestructible core,” which they depicted as flower blossoms, wings, and abstract objects. The goal was to help them “make conscious contact with that part of themselves,” Swoon says. “That indestructible core—that’s the part they're going to recover from.” Swoon first encountered art as a source of self-worth, but today she uses her craft to cope with and overcome the pain of her past. Therapy sessions revealed a disturbing aspect of her relationship with her mom. “My mother went through phases of being [...] addicted, unhinged, and psychotic,” she says. “And I realized I had a lot of unconscious fears that she would kill me. She never meant to have a baby when she was an addict.”One of Swoon’s installations,  Medea—named after the mythological mother who murdered her children—is the artist’s attempt to uncover, dissect, and contextualize this fear. It’s a sprawling, nightmarish, multimedia piece that lays bare the impact of child abuse, intergenerational trauma, and addiction.  Medea traces Swoon’s family history through several generations, using the image of a house as a metaphor for security and the self. “It’s a very dark piece,” Swoon says over the phone from Tokyo, where she’s installing  Medea for an exhibition at the Mori Art Museum. “So it feels good to have people ‘come here’ with me. It’s one of those artworks where the making of it brings you into wholeness.”In May 2007, Purdue Pharma plead guilty to charges that they “misbranded” OxyContin, leading patients, doctors, and regulators to believe the drug was safer and less addictive than it actually is, and the company agreed to pay more than $634.5 million in fines. But more recent lawsuits argue that Purdue and other opioid makers have done little to curb the crisis and continue to rake in massive profits from the drug. Purdue made $1.74 billion from OxyContin sales in 2017, according to Symphony Health Solutions.In January 2018, New York City filed a lawsuit seeking $500 million from Purdue, and this August, New York State joined at least 26 other states and Puerto Rico in suing the company for using deceptive marketing to boost prescriptions and profits for decades while ignoring the devastating human cost. Many opiate addicts get hooked by accident—not as recreational users, but as patients who are prescribed powerful painkillers. Nan Goldin, one of the world’s most famous art photographers, is one of them, and in January 2018, she published an essay in   Artforum  detailing her battle with opioid addiction. Goldin was prescribed OxyContin in 2014 for tendonitis in her wrist, and despite taking the drug as directed, became “addicted overnight,” she writes. Three pills a day became 18. Soon she was crushing and snorting them. When doctors refused to prescribe more, she turned to a dealer. When money got tight, she bought heroin. Then she wound up snorting fentanyl and overdosed. Goldin chronicled her struggle in photos, like   Dope on My Rug, New York  from 2016, showing a carpet strewn with pharmaceutical detritus, cigarettes, straws, a lighter, and a cellphone. When she finally checked out of rehab in March 2017, Goldin started reading up on OxyContin and its role in the opioid crisis. She realized that the Sackler family, whose name she recognized from museums and galleries, had made a fortune peddling the drugs. “I don’t know how they live with themselves,” she told   The Guardian , shortly after publishing her  Artforum essay.Goldin made it her mission to hold the Sacklers accountable for promoting addiction. She founded an organization called P.A.I.N. (Prescription Addiction Intervention Now) that stages protests in art spaces funded by the pharma family, like the Sackler Wing of the Metropolitan Museum of Art and the Smithsonian Institution’s Arthur M. Sackler Gallery. “To get their ear we will target their philanthropy,” she wrote in  Artforum. “They have washed their blood money through the halls of museums and universities around the world.” During protests, Goldin and other activists strew pill bottles through galleries, dump them in fountains, and participate in die-ins. Their demands are simple: they want Purdue to fund addiction treatment and education and correct the misinformation it has spread about opioids.In June, Boston-based sculptor Domenic Esposito and gallery owner Fernando Luis Alvarez installed a 10.5-foot-long, 800-pound bent and burnt steel spoon in front of Purdue Pharma headquarters in Stamford, Connecticut. The guerrilla tactic was phase one of an exhibition targeting the “architects of opioid addiction” at Alvarez’s nearby gallery. The piece blocked traffic into the facility. When police officers arrived, they urged Alvarez and Esposito to move the massive sculpture or risk arrest. But the two advocates dug in and refused to move the spoon. After an hour of negotiations, Alvarez was handcuffed and carted off on criminal misdemeanor and felony charges. “The police officers were extremely understanding and professional,” Alvarez tells VICE. “They understood where we were coming from because they face this on a daily basis.”“They’re on the front lines,” Esposito adds. “They’re dealing directly with the opioid epidemic, overdose victims, and carrying [the overdose medication] Narcan.”When they started out, Esposito and Alvarez were single-mindedly going after those responsible for the epidemic. Doctors, businesspeople, politicians—anyone who enables the proliferation of these prescription drugs beyond reasonable use. “These people are drug dealers,” Alvarez says. “They're killing people.”What neither of them anticipated was the influx of support from people who have lost loved ones to opioid addiction. Since the protest at Purdue in June, Esposito has spoken in front of crowds of hundreds at rallies, protests, and vigils for victims of overdoses.“As an artist, to have created all that energy and message around a simple instrument has just been incredible,” he says, before pausing to reflect on the burden of responsibility that brings. “People look up to us as symbols of hope, but we're not grief supporters. At least that's not what we started off as. We started off as artists with intent to raise awareness about social injustices.”The idea for the spoon sculpture began about 18 months ago. Esposito wanted to create something massive to give real weight to the severity of the opioid epidemic. It wasn’t his own addiction the artist sought to confront—it was his brother’s. The memories still haunted him. Images of burnt spoons were seared into his mind like daguerreotypes. He remembered getting calls from his mother in the middle of the night, hearing her cry over the phone after finding another stray utensil.“There were horrific nights and days dealing with overdoses,” Esposito says. “We'd have these moments of relapse, as a family, because we'd spent all this time trying to get him better and make sure he was on the right path, and then the relapse moment would happen. These were just very emotional and dark moments.”A burnt spoon is a grim symbol for families grappling with heroin addictions. Seeing Esposito’s sculpture brought back painful memories for Kathleen Orr, an attendee at the protest outside Purdue Pharma headquarters whose 23-year-old daughter Izzy died of a fentanyl overdose in July 2017. “It spoke volumes to me,” she says. “I hate to even use spoons, because they trigger me back to my daughter. But as horrible as what that spoon represents, [the sculpture] had such a positive impact on me. Look what [Esposito] is doing. Look what's happening. We are making changes.”Orr’s daughter became addicted to opiates after being prescribed OxyContin for a dental procedure. Since Izzy’s death, Orr has become an outspoken advocate. She blames “Big Pharma,” doctors, and drug dealers for shamelessly perpetuating the cycle of addiction. “Purdue Pharma started it,” she tells VICE through tears. “Fentanyl is ending it.”Advocates say the fines paid by Purdue in 2007 aren’t nearly steep enough to curb the company’s wrongdoing—much less remedy the pain their drugs have caused. As the lawsuits filed against drug companies wind their way through the judicial system, Esposito, Orr, Goldin, and other activists will continue calling for families like the Sacklers to take responsibility. In August, protesters marched on Purdue headquarters again. And in October, activists gathered in Washington, DC, for the Fed Up rally, calling for federal action.After her first storytelling event at the Kensington Storefront, Swoon couldn’t sleep. Instead, she laid down in bed and cried. \"I'd never felt so understood,” she says. One of the people she met, a man named George, left a lasting impression. “George seemed so far away at first,” she says. “I didn't think I could connect with him until I spoke about my mom. Then, he was super present in the room. He said later he never made the connection about his own struggles with drug abuse and the fact that his mom was an addict [...] and used to sell his toys to buy drugs.” As part of her residency at the time, Swoon chose three Kensington residents to paint into a mural, and George was among them. She’s since lost touch with George and another woman she painted. Both are thought to be back on the street. “It's hard,” Swoon says. “Recovery is definitely a process.”Esposito knows the deadly dance all too well. “Addicts [...] want to get better,” he says. “But it's a battle. I’ve lost count, but I think [my brother] overdosed five times and relapsed half a dozen times.”But despite the lives uprooted by opioid addiction, the greed of Big Pharma seemingly knows no bounds. In September, the   Financial Times  reported that Dr. Richard Sackler had patented a new, improved form of buprenorphine, a mild opiate used to wean addicts off harder opioids like OxyContin. It’s hardly an altruistic move; last year, the leading version of buprenorphine generated $877 million in US sales for the British pharmaceuticals company that makes it.Activists say shady moves like this are a reason to keep fighting. Following the patent announcement last month, Goldin and P.A.I.N. released a damning statement that cuts to the heart of Purdue Pharma’s apparent disregard for medical ethics. “They are profiting off the crisis that they subsidized with their most profitable pill, OxyContin,” it reads. “This is reprehensible and shows a lack of any moral conscience. Maybe they can patent a funeral parlor next.”  Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Dyllan Furness on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}