{"id": "Daily Horoscope: November 4, 2018", "paragraph": "The moon in Virgo connects with Jupiter at 2:26 AM, creating a generous vibe—and we’re all in the mood to partner up when the moon enters Libra at 4:01 AM. The moon squares off with Saturn at 1:02 PM, asking us to step up and be responsible. We talk things out when the moon connects with Mercury at 1:11 PM.All times EST.Take it slow today, Scorpio. The moon enters Libra, the sign of balance, asking you to find your own balance by catching up on rest. Pay attention to the messages your intuition picks up on today. You’re in an amicable mood today, Sagittarius, thanks to the moon entering charming air sign Libra. It’s a wonderful evening to network and share ideas. The moon enters Libra today, lighting up the sector of your chart that rules worldly success, and though you'll experience some frustration today when it comes to organizing, your intuition will guide you in the right direction.The moon enters fellow air sign Libra, encouraging you to look at the big picture. A frustrating block may arrive in your conversations, but teamwork can solve many problems today.The moon enters Libra, the sign of harmony, but you’re in your deepest emotions—can you find peace in all these feelings? Yes! Talking things out is a wonderful way to work through today's energy.Your focus turns to relationships today as the moon enters your opposite sign, Libra. While some obstacles will come up for you to work through, an open, communicative energy will keep things moving. You’re in a busy mood as the moon enters Libra and lights up the sector of your chart that rules your daily routines. Though you'll meet some frustrations around getting your chores done today, some breakthroughs will arrive.The moon enters fellow air sign Libra today, putting you in a romantic and creatively inspired mood! Complicated emotions come up for you to contend with, but an easy flow around communication will arrive today, too. The moon enters Libra today, bringing your focus to home and family. It’s an important time to reflect on your boundaries and to express them—fortunately, there's also a positive energy flowing around communication today.The moon enters intellectual air sign Libra today, lighting up the sector of your chart that rules your mind and putting you in a curious mood. Some communication blocks may arise, but important connections will still come your way. The moon enters Libra, lighting up the financial sector of your chart. Make time to reflect on your budget and be responsible about spending today. The moon connects with your ruling planet Mercury, encouraging easy communication at home. The moon enters your sign, Libra, encouraging you to get in touch with your heart’s desires. Blocks in your private life are felt today, but a lovely energy around communication is flowing, too.  What's in the stars for you in November?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}