{"id": "4 activists react to trump's attack on transgender rights", "paragraph": "On Sunday, the New York Times leaked the contents of a terrifying memo from the Department of Health and Human Services, revealing that the Trump administration is considering altering the legal definition of sex under Title IX – the federal civil rights law that bans gender-based discrimination in schools – to define gender as “a biological, immutable condition determined by genitalia at birth.” This threatens to eliminate transgender protections established by court precedents, and at its most extreme, suggests any disputes over a person’s sex should be clarified by genetic testing. This new definition threatens to strip the rights of approximately 1.4 million Americans who identify as any gender different from that in which they were born into. Within hours, #WontBeErased took over social media, where countless individuals and allies shared selfies in support of trans rights and LGBTQ rights. In the following days, rallies took place in New York City and Washington, DC, respectively. Not only is this proposed policy intrusive, but it doesn’t make sense scientifically. Under the Obama administration, the legal concept of gender in federal programs was loosened, allowing the interpretation of sex to be largely based on an individual’s choice. While this prompted legal fights, most visibly in schools over bathrooms and locker rooms, and angered many conservatives, courts have recognized that transgender discrimination is a form of sex discrimination. Some Obama-era policies recognizing gender identity in schools, prisons, and homeless shelters have already been withdrawn. Not to mention Trump’s attempts to ban trans people from serving in the military. While all of this is undoubtedly worrisome, the document reviewed by the  Times is a memo. This doesn’t mean it shouldn’t be taken seriously, but it has yet to be enacted. A number of leaked memos, including one to roll back protections for LGBTQ people in workplaces and adoption agencies, have yet to come to fruition. According to  Slate, leaked documents like this one are helpful to see how the administration is thinking on certain issues, but there’s often still plenty of room for courts and advocates to prevent them from happening. We spoke to four trans models, musicians, activists, and artists about how this proposed policy might affect their lives and how you can support them. Read the interviews below. Honey DijonHoney is a DJ, fashion icon, and trans rights activist, who grew up on the south side of Chicago. When asked her age, she responded: “Timeless.” Earlier this year, Honey spoke with i-D about the many myths and meanings of what being a woman is all about. What was your initial reaction to this news? How did you feel? I was completely angry and frustrated. No one on this planet has the right to determine how another human being feels, loves, or expresses who they are. To try and strip people of their very being because you don't understand, or agree, or align with your fairytale religion and to do it legally, is the very essence of evil.   If enacted, how do you think this policy will affect your life and career? I am one of the lucky ones because I work in creative industries that are more tolerant. I live in a bubble and I am well aware and super grateful of that. However, there are many trans and non binary folk who don't and for me they are the true heroes that need legislation and protection to be able to live, love, and flourish as nature intended them to be.    What’s most concerning about it?  The most concerning thing is that Trump is a complete puppet of the conservative right, who is trying to create a New World Order that is infecting the entire world from Brazil to Brexit, to what’s happening in the colonized land called the United States that was created and built by people of color, who have also over the course of humanity been stripped of its humanity in the name of religion, power, and profit (i.e slavery). Marginalized people have always prevailed in the darkest of days and it will continue. You can't destroy love and transfolk are the gatekeepers of transformation, evolution, and deconstructing ideals of what it means to be a human. That's what scares people in power because it disrupts their false sense of security in what it means to be a man or a woman, straight or gay. People are afraid of things they don't understand. It will be over soon when all these old white men are six feet under and the new generation steps in. It’s already happening. That’s why they are trying now to enact laws that silence us because they can see the change is already unfolding and they can't take it.   What can allies do to help and provide support?  Vote! Not to be afraid to love, create, hire, collaborate, nurture, and be in romantic and sexual relationships openly with transfolk. Educate yourself on the realities of what trans and non binary people actually endure. It’s not just physically, but spiritual and emotional aspects as well. Stop looking at the world through cis heteronormative privileges, cause in my opinion being straight and cisgender hasn't worked out so well for them either. Who wants to follow a flawed system? People should be celebrating us for our freedom of self, loving ourselves despite all obstacles. They should be kissing our asses instead of trying to silence our beauty, resilience and courage. Cause it helps them also to live more authentic lives.   Anything else you’d like to add?Transfolk have been here since the dawn of man and to remember that no matter what any religion, law, government, parent, or teacher tells you, your life has value. You are loved and capable of being loved. That you are an expression of the universe and completely perfect exactly as you are. If I have to think like you to be liked by you, then you can go fuck yourself. Casil McArthurCasil’s preferred pronouns are he/him/his, or “Your highness is fine too, if you can’t get it right,” he says. The 19-year old model grew up in Colorado, transitioned as a teen, and is quickly becoming the first trans male supermodel. He stole the show at Marc Jacobs fall/winter 17 and passionately spoke on trans rights before the U.N. only a few months later. What was your initial reaction to this news? How did you feel?My initial reaction, a bit scared, heartache, and disgust. First I was real sad, then I got unbelievably angry. How I did, and how I do feel about this? Still angry. Mostly because I don't want to give fear to the situation. I want to give my voice, my power, and the power of my rage, to help attempt at preventing this from happening. If enacted, how do you think this policy will affect your life?I don’t know yet. I don’t want to find out. I won't be letting anyone other than myself dictate who I am. But I know for damn sure if enacted, it's really going be affecting the lives negatively of so many people. What’s most concerning about it?I'm concerned it will lead to hostile environments and cause a huge loss of safe spaces. I'm concerned my friends or myself will get hurt in a hate crime. I'm concerned it will prevent people from coming out, transitioning and living their happiest lives, by fear of being ostracized. I fear bullies will try to reek even more havoc on innocent souls. I'm scared people won’t even try to live because they can’t handle the obstacles that keep getting thrown in the way for them. Already there are so many obstacles. We are human, we are here and we have rights to be who we are. It's hard enough. It doesn't need to be made harder. It’s NOT fair. What can allies do to help and provide support?First I'd like to say, this is why it's important to vote in midterms, so make sure your voice is heard, we need good people in Senate. I don't care what your opinions are on voting, people my age, and many, need to step up and take charge. Support your trans friends, neighbors, the nice person you see chilling at your favorite coffee shop. Have love for them, have support, compassion, and fight for them. Anything else you’d like to add?What Trump is trying to do is a gross act against human rights & humankind. You need to fight for yourself and your right to be so. Don't be quiet. Be loud. Scream from the top of mountains, let them know it’s not okay to do this to your community and you. Now is no time to hide or be scared. Make change, be the change. Let the world know. We aren't going away.Zackary DruckerZackary is a Los Angeles-based multimedia artist, photographer, performer, actress, filmmaker, television producer (the Emmy-winning Amazon series  Transparent!), activist, you name it. Her work breaks down preconceived notions of gender, sexuality and bodily identity.  What was your initial reaction to this news? How did you feel?  Disgusted. I'm aware that such fringe positions have long been held by fundamentalists, but the fact that those draconian and arcane views are influencing our highest office is egregious and insane. We cannot revert to our Victorian mores of a hundred years ago. We cannot regulate gender expression. Are they going to reinstate cross-dressing laws too? When you look down that road, it leads to a type of governmental intrusion upon personal identities that most Americans are opposed to; especially for republicans and libertarians, their entire ethos centers on individual freedom. How can they be such hypocrites?   We are evolving rapidly. Human evolution is inevitable. Change causes cultural conflict. Trans folks represent human evolution, and our existence threatens outdated values of centuries past. Transphobic people can resist modernization all they want, but they can't drive through the rearview mirror.     If enacted, how do you think this policy will affect your life? Your career? What’s most concerning about it?  I don't think that this policy will be enacted, but if it were, our livelihoods and ability to participate in the world would be clandestine and precarious at best. As a Jewish person, I'm aware of how my ancestors were massacred over hundreds of years in Eastern Europe. Trans people have survived hostile times living underground lives. That was not very long ago. Trans people are still targeted and murdered. These are facts. None of us should take the privileges that come with our social democracy for granted. In order to maintain those rights, we must participate, exercise our freedom of speech, and fight bullies. Trans folks have been doing that forever; we persevere. Our difference makes us hyper-aware of our surroundings, and throughout history, communities and civilizations have recognized our propensity for intuition, for seeing. It's only a matter of time before ours does. We've seen that in fits and starts -- a backlash to our progress is inevitable. We're witnessing that play out now. I know which side of history I stand on.     What can allies do to help and provide support?  We as a community are determining this right now. It will take all of our allies to win over all of their friends and family. GLAAD says that only 16% of the population know a trans person. If only 16% of the population noticed that we disappeared, it would be troubling. We have to get as many trans stories in as many sectors of culture as possible to build empathy. We are human beings. No other group in America is specifically persecuted and denied rights for being who they are. Why would our federal government target trans people? This is a political tactic that puts our lives at stake. Our position is already fraught with challenges to our basic survival. For our federal government to legislate this specifically against us is a blatant human rights violation. Aaron PhilipAaron is 17-years old and identifies as a gender-nonconforming trans woman. She grew up between the Bronx and Manhattan, was born with cerebral palsy, and is one of only two models in wheelchairs signed to a major agency. Aaron signed to Elite last September. What was your initial reaction to this news? How did you feel? I’m mortified. I’m angered by the sheer hatred and bigotry that the trans community is subjected to by things such as powerful people and legislation. I feel sorrow for my community – for all my trans sisters, brothers, and siblings.   If enacted, how do you think this policy will affect your life? This policy could take away my visibility to be myself in the most important and major aspects of my life.    What’s most concerning about it?  What’s most concerning is the violation of privacy by our administration by forcing people to do a test to show how they were assigned at birth. That particularly feels violating and improper.    What can allies do to help and provide support? Allies can do things like put their money where their mouth is and donate directly to trans people on and offline. They can also educate themselves on gender/gender identity related issues and make protecting and uplifting the voices of trans people in important social spaces a priority.    Anything else you’d like to add?We will not be erased. We will hold each other close and stand as tall as ever. If you live in the US, are 18+ and have access to voting, please vote. Here’s what you can do to defeat Trump's attack on trans protections .  Educate yourself and others on the hardships faced by transgender, intersex and nonbinary people. Stay informed. Show up at rallies. Mobilize.  Donate .  Support your trans brothers and sisters . Tell them you love them. Fight for humanity. And most importantly,  VOTE . suscribe to i-D's positive vibes."}