{"id": "I Tried to Replace Men with ‘Clit Sucking’ Sex Toys", "paragraph": "Photos by the authorYes, the world feels like a never ending onslaught of crap, but within the malaise we still have to find little nuggets of joy. For me, that little nugget appeared in the form a type of sex toy I had never heard of before: an oral sex simulator for women with vulvas. These toys claim to utilize suction in a variety of ways to mimic the sensations a clitoris would feel during oral sex. I've been calling these type of toys \"clit suckers\", but I don't know whether any of them are actually doing any sucking. I’m not totally sure how they work, their manufacturers use lots of terms like “sonic waves” and “air technology” and “pulsations.” They feel like they're providing the sensation of sucking without actually doing any sucking, if that makes sense?Though these aren’t the first toys to try and imitate oral sex, they do seem to be the first of their kind to take this sort of thing seriously. It’s shockingly difficult to obtain an oral history (pun intended) of cunnilingus imitators, but their history seems to mostly consist of those jokey tongue shaped vibrators, which have been around for a while.They never took off in the way these new suction toys have, which first hit the scene in around 2015. Maybe because the technology wasn’t right, or perhaps because they look like a joke even if they aren’t. For instance, take this tongue merry-go-round thing called the Sliquid Sqweel. If you showed me that and said it feels just like oral sex, I would think you were fucking with me.For single women especially, the thought of there being a device that can eat you out so you don’t have to hit up yet another Tinder schmuck who makes sure to tell you that this doesn’t mean you’re dating when he comes up for air, sounds like a goddamn dream come true. Hopefully, I thought, they would be better than the real thing and I could give up men for good.I tried a few—all of which were sent to me for free by their manufacturers or retailers—to see which could come closest to replicating an actual guy. Here’s what I found.The Girl’s Best Friend is the most affordable on the list, which is the main positive. It was the first I tried, so maybe my expectations were far too high but I have to say, I was pretty underwhelmed. Inside it are these silicone tentacle things, which look like they must be there for, like, I don’t know, tickling purposes? They didn’t really seem to do anything when I applied them to my body. I was sincerely shocked by how painful it was to use. I was expecting a pleasant sucking, but it was  way too intense, even on the lowest speed. I messed around with the settings, but ended up liking it most when there was no vibration at all. There were various settings for patterns of sucking, where it would go like, suck-pause-suck or suck-suck-pause, like someone doing morse code on my vulva. All my vibrators have some variation of this, and I don’t really get why anyone would prefer a pattern of vibration and/or sucking over a constant one. Different strokes (pun intended) I guess. I did eventually orgasm, but it was one of the weirdest orgasms I’ve ever had in my life. It was uncomfortable, and I honestly kind of hated it. Before using this toy, I didn’t really think it was possible to have a painful orgasm. I pretty much forced myself to make it happen even though my body was recoiling from the toy as much as it could. The pain wasn’t enough to make me turn it off, but it was enough to make me question who the hell tested this product before it hit the market and whether their clit was made of steel.The product was less a girl’s best friend than a frenemy who gives you backhanded compliments and makes out with the guy you just told her you have a crush on. This is the one that several of my girlfriends have told me to try. Though the name for it is straight up atrocious, the Womanizer had some nice features the other products don’t have. It looked somewhat more sleek than the others, and is activated by contact with skin. The detachable head also comes with a backup. The manufacturers claim the product has a really fast orgasm time thanks to its patented “Pleasure Air Technology”, which isn’t particularly useful for me but maybe that’s enticing to some of you reading. I’m not trying to brag or anything, but it’s pretty easy for me to come with a vibrator. With most vibrators, I can get the job done in two or three minutes. What I’m looking for in an oral sex simulator isn’t to orgasm quickly, but to orgasm the way a human mouth makes me orgasm. Within the first few seconds of it touching my clit, something very surprising happened. I pissed myself. After looking around online, I found a Reddit thread where a woman had a similar experience, and the comments were all trying to convince her that she’d squirted. I refuse to believe I squirted. If I’m going to squirt, it’s because I am enjoying myself and having an amazing orgasm. This didn’t feel like that. Rather, it felt like vacuum induced piss. Completely involuntary, and not at all erotic. I cleaned it up and tried again. Sadly, I felt the same sort of pain I felt from the Girl’s Best Friend. Not pain in the traditional sense, but more like the kind of pain you get from over stimulation. It was just too concentrated, and made me realize that my clitoris might not be cut out for these kinds of products. I ended up moving the Womanizer around, and positioning it farther away from my clit while upping the vibration setting, so it was still stimulating my clit but from more of a distance. This ended up feeling better, but also just like a normal vibrator. Eventually, I was able to come. It was piss free, but not great.Feminist porn site and adult toy retailer Bellesa sent me this one. Bummed from my disheartening experience with the Girl’s Best Friend, and pissy about my experience with Womanizer, I had no idea what to make of the Satisfyer Pro 2. Reading online reviews of it got me excited, with some reviewers saying it was the best orgasm of their life, and others saying it felt exactly like oral sex. At first glance, it did seem different enough that it might offer a better experience. The silicone head is larger, which made me think it might be more comfortable or less pain inducing.When I turned it on and inserted my finger, I felt a tiny ball type thing going up and down in a way that reminded me of those boxing pens from souvenir shops where two mechanical arms are attached to an animal that in real life doesn’t have arms. Maybe, I thought, these little clit punches would feel better than tentacle tickles? (There’s something I never in my life thought I would type.) Good news! This one felt slightly less painful than the others, which I think had something to do with the larger head. I felt less pain in the build up to the orgasm, but when it came to actual orgasm time my body did the same “WTF are you doing to yourself?” recoiling. Determined to make this work, though, I did some more digging around the internet and found a few users recommending using it with lube. Luckily, I already had some water-based lubricant handy, and gave it a go for the second time.The lube did make a difference at first. For a split second, it kind of felt like a mouth just sloshed up on me, but that feeling went away pretty quickly. It was back to feeling like it did before, but slightly easier to maneuver. My orgasm this time was a bit more satisfying from the previous two, but only because it didn’t hurt as much.My last attempt. The InsideOut stood out from the rest due to its insertion feature intended for G-spot stimulation. I was really excited to try it, imagining it might mimic the classic “eat you out and stick two fingers in you” move. This one definitely looked the most like it was sent from the future to destroy humanity. Peering into it, I saw a bright green light shining back at me that looked like it was going to scan my clit for fingerprints. But, dedicated to the mission, I powered through the weird feeling that this was actually invented by the NSA and started masturbating with it. Lo and behold, Horny Goldilocks finally found the oral sex simulating vibrator that’s just for her! Disclaimer though, I think the reason this one worked so well for me is because the insertion feature was extremely effective as a handle. It kept the bulky clit vacuum part at a good enough distance from my clit that it didn’t feel as intense as the others. I experienced zero pain, and with proper tightening of my vaginal muscles was able to have a hands free experience (kegel exercises work, y’all). I don’t think any actual G-spot stimulation was happening. Rather, I was better able to position the clit-sucking part thanks to the feature that was supposed to be stimulating my inner parts.While my experience with these wasn’t the best, every single one of them did make me come so I guess it wasn't a complete wash. For most of them, it was my first time experiencing an orgasm I hated, which I previously would've thought impossible. While I like the effort being put into this, I don’t think these toys are for me. Seeing so many rave reviews, though, has part of me wondering if maybe my clit is the issue? I don’t know what to tell you. The problem I experienced was essentially a sensory overload. What’s best about the human tongue is that it’s the right amount of pressure and softness and it tends to not focus directly on the clit but rather, spaces near the clit that still stimulate it but not as intensely. The suction technology is a great thought, but way off when it comes to what is best about cunnilingus, which contains very little sucking, usually. It’s licking and gyrating. Sucking is usually when I shout, “No go back to what you were doing before”. To all pussy-eaters, your job is not done. You must continue to eat pussy like it’s your last meal. Follow Alison Stevenson on Twitter.   Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Sign up for the best of VICE, delivered to your inbox daily."}