{"id": "Pete Davidson's SNL Apology Was a Mess", "paragraph": "Screenshot via SNL / YouTube Saturday Night Live really leaned into Veterans Day on this week’s show. Sure, Lil Wayne sincerely thanking our vets was pretty heartwarming. But Pete Davidson kind of forced the show into it after last week’s Weekend Update by making fun of a handful of politicians running for office in the midterm elections—including Lt. Com. Dan Crenshaw, a GOP congressman-elect who lost an eye on his third combat tour in Afghanistan.Davidson mostly skewered Republicans with his “first impressions” bit, poking fun of their looks. He joked that Greg Pence, Mike Pence’s older brother who won an Indiana House seat last week, looks like a Ken doll that spent a year in a river, and that Florida governor Rick Scott looks like someone whittled Bruce Willis out of a penis. Davidson wrapped up the segment on a self-deprecating note, saying he shouldn’t make fun of other people’s looks since he looks like he “makes vape juice in a bathtub.”Some of the jokes landed, yes. But Davidson’s joke about Crenshaw—he called him a “hitman in a porno movie”—was in bad taste. Crenshaw quickly hit back on Twitter on Sunday, then spent last Monday making the rounds on cable news. Simultaneously, Kenan Thompson went on the  Today show and said Davidson “missed the mark” with his offensive joke. Sean Spicer, who’s been mercilessly (but amusingly) mocked on  SNL, took the controversy as an opportunity to call for Lorne Michaels’ firing.This brings us to this week’s installment of the “Pete Davidson apology tour,” seemingly a fixture on Weekend Update these days. It began with Davidson admitting he fucked up and saying he’s sorry. “My poor mom… Can you imagine being Pete Davidson’s mom? It can’t be easy when everyone’s mad at your son and roommate,” he joked. There was even a funny aside about bipartisanship, with him saying “If any good came of this, maybe it was that for one day the left and the right finally came together to agree on something: that I’m a dick.”Then Crenshaw wheeled onto the set for an in-person apology and to give Davidson a taste of his own medicine—but not before torturing the comedian a little bit with an Ariana Grande ringtone. “Do you know her?” Crenshaw deadpans, then launches into roasting Davidson’s appearance with lines like, “He looks like if the meth from  Breaking Bad was a person.”Davidson’s gaffes and subsequent mea culpas have grown tiresome, especially after months of milking his fame-by-proxy while he was dating and engaged to Grande. He used their relationship for material during happy times. When the couple split up in early October, SNL continued capitalizing on Davidson’s brush with superstardom, most notably with that awkward promo with Jonah Hill and Maggie Rogers. He has continued milking the breakup for more self-deprecating material, and there doesn't appear to be signs of him stopping, considering it came up again this week with the ringtone joke and mentioning his living situation. Suffice to say, the dude keeps doing dumb shit, and the bit is getting old.That said, I felt a surprising amount of empathy for Davidson this week. He’s clearly hurting after his big, public breakup, and has also probably had a rough week, what with pissing off so many people with his Crenshaw joke. When he apologizes to Crenshaw, it seems uncomfortable but sincere. But then Crenshaw’s moment on Weekend Update gets weirdly saccharine, with a plea for bipartisanship. SNL had some comeuppance to pay veterans, for sure, so in that respect it made sense why Crenshaw spent the last 60 seconds of his guest spot imploring Americans to tell service members they'll \"never forget.\" (In his cable news appearances, he also called on  SNL to donate $1 million to organizations that help veterans.) The final moments of his speech took an even weirder turn when Crenshaw brought up 9/11 and reminded viewers that Davidson’s father died in the attacks.That line most likely prompted one of the most interesting moments in the segment, which viewers might have missed: as Michael Che and Colin Jost wrap up, cueing the Weekend Update outro music and audience applause, Davidson leans over to Crenshaw for a private moment, but his mic is still on. “You’re a good man,” he says. “Thank you.” But the fact that Weekend Update has become the venue for Davidson drama week after week belies the fact that it is kind of a mess. Che and Jost are at their best when they’re putting their spin on weird viral news, or when the segment is a sendup of mainstream media. Lord knows there’s enough to spoof these days, with the president’s attacks on the “Crooked Media” and anyone who opposes him. Instead, Weekend Update and the cold opens are the two spaces where  SNL gets blatantly political, and the show keeps leaning on smug, self-congratulatory liberalism, taking easy potshots at Republicans that make conservatives righteously angry and are stupidly one-dimensional. While some could argue that this gaffe on Davidson's part allowed a space for reconciliation between a member of the GOP and a show built on liberal values, it can also be argued that this is just Republicans taking advantage of a dumb joke to push their agenda. Davidson’s joke about Crenshaw was in bad taste. You can disagree with someone’s politics—heck, you can even oppose the military and American war-mongering—without denigrating someone’s physical sacrifice and personal tragedy. But the root of the problem isn’t Davidson; it’s an  SNL writers room that’s toothless when it matters and ruthless for the wrong reasons.  Sign up for our newsletter to get the best of VICE delivered to your inbox daily.  Follow Kara Weisenstein on Twitter. Sign up for the best of VICE, delivered to your inbox daily."}