{"id": "Cecile Richards: 'Nancy Pelosi Is the Reason We Still Have Access to Abortion Rights'", "paragraph": "Image via Planned Parenthood.After Democrats won back the House of Representatives with the largest gains since Watergate, they now face a crucial choice: Who is going to assume the role of the Speaker of the House? Democrats controlled the House from 2007 to 2011, and during those years Leader Nancy Pelosi served as Speaker, making history as the first woman to ever hold the post. When she assumed the speakership, she did so with unanimous approval from fellow Democrats. The day after the midterm elections, Pelosi announced her plan to run to reassume the role. This time, she appears to lack the unanimous support.  Pelosi has been used as a boogeyman of sorts by Republicans, whose attack ads in competitive districts often feature her as a “liberal elite.” Pelosi’s approval rating nationally tends to be lower than even Donald Trump’s, and many candidates running in Republican leaning districts – for instance Andrew Janz who ran against Devin Nunes in California - explicitly said they would not support Pelosi becoming Speaker if they were elected. At the same time, some candidates running in ultra-progressive districts – like Rashida Tlaib in Michigan - also said it's unlikely they would vote for her as well. In her September TIME cover story, Pelosi herself acknowledged that she’s aware of internal criticisms that included her being “too old” (she’s 78), too toxic in non-Democratic districts, that she’s already had 30 years in Congress— including 15 years of leading the Democrats— and that it’s time for her to let the next generation have power.  Pelosi’s critics, such as Ohio’s Rep. Tim Ryan—who unsuccessfully challenged her in 2016—and Reps. Seth Moulton of Massachusetts and Filemon Vela of Texas, have been reported to be making plans to replace her by refusing her the 218 votes she needs for the internal caucus vote on November 28, and by floating Rep. Marcia Fudge as a possible opponent. Meanwhile, her allies both inside and outside of Congress, including Rep. Maxine Waters and former attorney general Eric Holder, have been advocating on her behalf. On Thursday morning, former Planned Parenthood President Cecile Richards, who once worked as Pelosi’s deputy chief of staff, made her thoughts of Pelosi’s run known. Richards took to Twitter, where she released a forceful proclamation of her support for Pelosi based on her experience, and her anger at what she perceives as sexist targeting after an unprecedented success for Democrats in the “Year of the Woman.”  “I find it interesting that there are four leaders in Congress, only one is a woman, and she is the only person who folks are going after,” she wrote. Richards said over the phone on Thursday that she took to Twitter to enthusiastically express her support for Pelosi after reading about Democratic members of Congress who were trying to keep her from becoming Speaker. “I find it interesting that there are four leaders in Congress, only one is a woman, and she is the only person who folks are going after\" For Richards, that Pelosi is a woman is directly tied to why she is a target of a replacement campaign. “Women are a vast minority in Congress,” she said. “You don’t see this challenge being led by women, you see it being led by four men, and so you can draw the conclusion that there are many men who are uncomfortable with women being in power.”  Richards also said that over the past ten years, Republican operatives have actively made investments in advertisements and campaigns that discredit Pelosi, make fun of her, and have turn her into the face of liberalism for those who don’t like liberals. “That really takes a toll,” she said. “But, I am just amazed to see Democratic leaders and people who know better fall for this, because it’s completely orchestrated by the opposing party, and it just seems so evident to me.”  The main point that Richards wanted to communicate through her comments on Twitter was not only why she thought some Democrats were attempting to prevent Pelosi from assuming the powerful role, but why Democrats should support her. Richards highlighted how Pelosi whipped her caucus to vote against the Iraq War under George Bush, and how last year in 2017 she filibustered the House floor in an attempt to force an immigration vote by speaking for over eight hours about the Deferred Action for Childhood Arrivals (DACA) program. That speech may be the longest House speech ever delivered and was definitely the longest in the last century.  “These jobs are not easy, and they’re not for amateurs,” she said. “I’m a progressive from my core, and so is Nancy Pelosi. That’s why I have complete faith in not only what she will do as the next Speaker, but in the next generation of leadership she will train and elevate in the process.” Richards said the Trump administration being in power is a major reason why this isn’t an ideal time to “try someone new out in the big leagues.” “I think people really need to think about this,” she continued. “For those of us who care about women, immigration, civil rights, voting rights, LGBTQ equality, and so on, we’re playing in a whole new world right now. We have an administration, and a Republican Lead Senate that is against every single thing we believe in.”  Richards emphasized that, so long as Trump is in office, it’s critical that Democrats act in unison as they fight for the things that people elected them to do. She also argued that it’s important for people to understand Pelosi’s career before writing her off. “People's impressions get based on no information,” she said. “One of the reasons I wrote what I did today is because a woman I know said to me the other day something I couldn’t believe. She was like, ‘I need to know where Pelosi is on abortion rights,’ and I was like, ‘Are you kidding? Nancy Pelosi is the reason we still have access to abortion rights under the Affordable Care Act.’”  Richards explained when the Affordable Care Act was on the verge of being passed, many members of Congress were ready to agree to it being passed while excluding abortion coverage. When Richards visited Pelosi in her office, she said Pelosi looked her in the eye and said, “If there is an abortion ban, there will not be an Affordable Care Act.” When it comes to criticisms being lobbed against Pelosi, Richards said much of it is “centimeter deep and a mile wide” and based on “whatever GOP line there is out there that day.” In regards to Pelosi’s glass ceiling shattering career, Richards doesn’t feel Pelosi is given enough credit for what she’s overcome. “For men, they kind of wake up one day and are like, ‘I can be in Congress,’” she said. “For women, it’s a much harder struggle. Nancy Pelosi got there on her own, and so she knows what it takes to go out there and hustle, and this is what I saw women do this election cycle: Out-hustle their opponents, out-work their opponents, and go to Washington because they want to get something done.”  In terms of Pelosi’s accomplishments, Richards said there is no Speaker who has paralleled what she’s accomplished when leading the majority, and also when leading the minority.  “She’s done it at the same time as helping to build a caucus that’s beginning to look as diverse as the rest of this country,” Richards said. “A caucus with new progressive women, people of color, women of color, LGBTQ people, who are going to rock Capitol Hill. That’s something to look at and recognize.” In Richards’ eyes, Pelosi deserves to sit in the seat at the table that she fought so for many years to obtain, a seat Richards also believes will be filled by many more women in the future.  “I think for women in this country, it’s time we stop being shut down by loud angry men, and that goes for both parties,” she said. “I think it’s important to be loud and to be proud.”Get your horoscope in your inbox, every day."}