{"id": "This Guy Broke Into a House Just to Clip His Toenails and Make Eggs, Cops Say", "paragraph": "Mugshot via the Limestone Sheriff's Office; screengrab via WAAYThe second she walked into her home in rural Alabama on Tuesday, Mary Royster froze. She found herself face-to-face with a strange, 30-something man she'd never seen in her life, and she had no clue what he was doing there. You'd figure he might have come there to ransack her jewelry box, or steal some electronics—but for some reason, he'd actually broken into her house to take care of a few chores.According to local ABC affiliate WAAY, the guy just kind of made himself at home—took a bath in her tub, shaved his face, brushed his teeth, clipped his toenails. He found a skillet in her kitchen and scrambled some eggs, then made a whole-ass sandwich: ham-egg-and-cheese with onions and mayo, on toasted bread. He'd just finished washing his laundry when Royster walked in and asked him what the hell he was doing in her house.\"He said, ‘Waiting on my clothes to dry,’\" Royster told WAAY. \"I said, ‘Well, who are you?’ He said, ‘I’m your grandson, don’t you know who I am?’ and I said, ‘No!’\"Royster is, in fact, a grandmother, and a seemingly sweet, incredibly Southern one at that. But the man in her house wasn't her grandson: According to the cops, it was 31-year-old Tyler Love, who had gotten bailed out of jail five days earlier after he was arrested on a marijuana possession charge, AL.com reports. When Royster asked him to leave, he refused—so Royster called 911, marched outside, and sat around waiting for the police to show up while Love finished doing his laundry.The cops arrested him, and checked out Royster's house to see exactly what he'd taken. He'd rifled through almost every drawer, cabinet, and closet inside, and rummaged around in all of Royster's jewelry boxes, but apparently he didn't actually steal anything—aside from some laundry detergent, a little toothpaste, and the makings of a pretty gnarly-sounding sandwich from her fridge.\"What he was looking for, I have no idea,\" Royster told WAAY.Police told AL.com they think Royster could've been on narcotics, which only goes partway toward explaining why the hell he would commit a felony just to take a nice bath and fix himself something to eat. He's now facing up to ten years in prison on a burglary charge, making him the latest criminal to risk jail time by breaking into a home for something you can easily just get at your own damn house. Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Drew Schwartz on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}