{"id": "Diehard Trump Stan Jacob Wohl Is the Most Brain-Poisoned Boy Online", "paragraph": "Jacob Wohl at his notorious press conference. John Middlebrook/CSM via ZUMA Wire/API have been a big fan of online for a long while now, thanks in no small part to the fount of deep-seated idiocy you can encounter on any given day. Cards on the table—I honestly love that shit. Facebook is a frothing pot of insanity and reactionary outrage, but it’s mostly very repetitive and relies on increasingly low-res memes bandied about by retirees whose brains are turning into cottage cheese and seeping out of their ears. If you want the pure, uncut good stuff, you have to look on Twitter. And there is no bigger brain-poisoned moron on that website than one Mr. Jacob A. Wohl. To the casually online, Wohl burst onto the scene this week with a truly shitforbrains scheme to discredit Special Counsel Robert Mueller by accusing him of bad behavior. It's tough to sort out what really happened, but allegedly, a firm called “Surefire Intelligence” contacted women and asked if it could bribe them to finger Mueller for sexual harassment. One right-wing site, Gateway Pundit, actually did run a story about accusations from a woman who supposedly said Mueller sexually assaulted her. But other journalists looking into the matter discovered that Wohl had invented Surefire and the accusation couldn't have been true because Mueller was serving jury duty several hundred miles away in question. But those of us who have been somewhat terminally online since 2016 have known about Wohl for a while—and I can confidently say he is the dumbest person on the internet. Wohl first entered my world as a mainstay of the Trump replyguys, the users who are always atop the chains that spawn from the president's tweets. Unlike the “Sir, you have no honor!” types such as the Krassenstein twins, Wohl is an unabashed superfan of the president. Actually, \"superfan\" doesn’t even cover it. An accurate way to describe him to a layperson would be as a shoddy facsimile of Trump: mean-spirited, racist, ill-informed, pathologically dishonest, and generally clownlike. But he has not mastered any part of this equation, nor does he command the presence of Trump, and what you are eventually left with is a sycophant too deluded to even properly despise.One of Wohl’s most enduring tropes—and one that tells you a lot about the guy—is the “hipster coffee shop.” This is when Wohl tweets out little “overheard” conversations that are so unbelievable, so strange, and full of stilted expository dialogue, one is forced to wonder whether Wohl has ever had a single social interaction in his life.While there is seemingly no depths of debasement conservatives won’t go to in pursuit of defending the president, Wohl seems unusually fixated on the “debasement” part of the process. His attempts at memes are so absurd, they are roundly mocked from all sides—even a reporter for the right-leaning Washington  Free Beacon had a viral tweet last week deriding the young moron. And there is no level of abuse he won’t take.This last week certainly marked what I would call the crest of the Jacob Wohl shitwave. His schemes have always been ill-conceived, but the easily debunked nature of the Mueller accuser fiasco speaks to a young man completely out of touch with reality. This isn’t surprising to anyone who remembers that he’s been banned from futures trading for life after a career marked by dishonesty. The press conference was a mess—the accuser never showed up, and Wohl lied through his teeth about more things than I could reasonably list here before running from the venue. Afterward, Wohl posted a photo of the alleged accuser—with her face blacked out—claiming she had feared for her life and fled on an airplane. It took about four minutes for people to reverse-google the photo and discover that it was a picture Wohl took at an event earlier in 2018,While it’s unclear if Wohl will ever face any real criminal charges for his blundering attempt at a psyop, his punishment at the hands of his peers seems like justice. Immediately following his failed press conference, the Gateway Pundit threw Wohl, who had written for the site, to the wolves, pulling the article about the accusation and severing all ties.with Wohl. He has been dunked on by everyone from Chrissy Teigen to national conservative columnists.Sometimes it’s a bad idea to drag certain reactionary idiots simply because it gives them a platform and visibility and whatnot, but Wohl is too hilariously dumb for even the dumbest right-wing outlets to stomach, so when it comes to dunking on him I say go for it. Get his ass. In a world of conservative media where it seems no bufoonery is indefensible, Wohl has found the exception to the rule. He is a ship without a port, and his slow-motion downfall only serves to illuminate the boiling fuckpit of delusion the online MAGA set has spawned.   Sign up for our newsletter to get the best of VICE delivered to your inbox daily.  Follow Krang T. Nelson on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}