{"id": "Watch the 16 Most Iconic Fast Food Scenes in Film Cuz It's National Fast Food Day", "paragraph": "Screenshot via YouTube Forget the marketplace vendors and street food of Ancient Rome, the meat pies of Paris and London during the Middle Ages, and the fried dough and stuffed buns of 12th-century Asia. Fast food is, and forever will be, the most quintessential American pastime. From the grab-and-eat automats of 1920s New York to the genetically-engineered foodstuffs of 2018 delivered by Uber drivers (and probably soon, by drone), the United States has vaulted fast food into a culinary mainstay, from a $6 billion dollar industry in 1970 to $200 billion strong in 2015. In honor of November 16 being “National Fast Food Day” (like we need another excuse to eat more cheeseburgers and French fries), here’s a roundup ranking of our favorite fast food moments in movies; scenes starring burgers to breakfast, presented in all their mass-produced, pre-cooked, deep-fried, and assembled-to-order goodness. Plenty of spoilers and greasy food ahead: 16. Double-stacking slices of pizza from   Saturday Night Fever (1977)Legendary Lenny’s Pizza in Brooklyn will forever be known as the pizza joint where Tony Manero (John Travolta) orders two, not three, cheese slices and eats them folded AND stacked, as he struts through Bay Ridge to the rhythm of “Stayin’ Alive” by The Bee Gees. Is there a greater boss move for your average 19-year-old in the city? 15. Morgan Spurlock vomiting while filming   Super Size Me (2004)Just two days into his month-long experiment to eat nothing but food from McDonald’s three times a day to test if it’s really as bad for you as people say (spoiler alert: it, uh, is), documentary filmmaker Morgan Spurlock finishes a Super Size double quarter pounder with cheese (that’s a double Royale with cheese, for those of you in Europe), French fries, and a 42-ounce Coke. It takes him 22 minutes to gulp the food down, but only seconds for it all to come back up in the McDonald’s parking lot. This awkward scene is the furthest thing from a “happy meal” that we’ve ever seen. 14. Delivering fish and chips (and getting humiliated) in   Fast Times at Ridgemont High (1982)High school is miserable enough without having to work part-time at “Captain Hook Fish & Chips,” complete with a white turtleneck and pirate hat uniform. But Brad Hamilton’s (Judge Reinhold) manager makes it infinitely worse by making him wear the outfit (“Show a little pride!”) while on special delivery of “catch of the day” boxes. On the road, an attractive older woman (played by Heart guitarist Nancy Wilson) spots Brad trying to look suave in his ridiculous getup and laughs at him. Fed up, he dumps his hat and the entire takeout order out his driver’s side window—and we don’t blame him (although we might’ve kept the kinda cool hat). 13. Opening a new Krusty Krab in   The SpongeBob Squarepants Movie (2004)The entire plot of the first Spongebob movie revolves around fast food, from the opening of a new Krusty Krab restaurant (directly adjacent to the first restaurant; when asked why, Mr. Krabs only says, “money”) to the evil Plankton’s attempt to steal the Krabby Patty Secret Formula to bring customers into his rival restaurant, The Chum Bucket, whose menu items include the Chum burger, Chum-on-a-stick, and “Chumbalaya,” to SpongeBob’s ultimately heroic rise and earning the title of becoming manager of the new franchise. Never since Bubba Gump Shrimp Company (probably even more so) has the fake food from a fictional restaurant chain seemed so enticing. 12. Junk Food Raining From the Sky in   Kazaam (1996)Is the movie called  Kazaam, starring Shaquille O’Neal as a 5,000-year old genie who grants wishes to an inner-city kid?... Or is the movie called  Shazaam, starring stand-up comedian Sinbad as an awkward genie who grants wishes to two young children? Whatever universe you’re from, there’s no forgetting the scene where, for one wish, the dysfunctional genie makes it rain junk food: burgers and burritos that explode as they hit the ground, loose French fries that fall like rain, and just about the thickest, slimiest-looking stacks of pancakes we’ve see anywhere. I guess having more fast food than you know what to do with was cool when we were a kid, but who wants to scrape together and chow down on a sloppy Whopper picked up off the the ground in a filthy back alley in Brooklyn? 11. Getting In-N-Out Burgers in   The Big Lebowski (1994) It would take too long to describe the meandering, mistaken-identity plot of  The Big Lebowski enough to explain how enjoying “some [In-N-Out] burgers, some beers, and a few laughs” factors into the story if you haven’t seen this Coen Bros. classic (and frankly, if you haven’t, you need to stop reading this article and go and watch the movie immediately). Suffice it to say that it’s the result of a failed interrogation of an unmoved high school student by “The Dude,” an aging hippie slacker played by Jeff Bridges; his high-strung friend, Vietnam veteran Walter (John Goodman); and chill Donny (Steve Buscemi). They’re on the search for a missing million-dollar kidnapping ransom between drinking beers, discussing the tenets of socialism and nihilism, and participating in competitive bowling sessions.When the high school kid neither talks nor reveals the whereabouts of the money (that The Dude and company later realize was never actually stolen), Walter decides to wreck a nearby sports car, thinking the kid bought it with the missing cash. It was actually a neighbor’s car, who reliates by attacking The Dude’s car next. At the end of the night, all the trio walk away with are a couple of burgers, no beers, and definitely no laughs. 10. Inventing the “speedee service system” in   The Founder (2016) Every second of this biographical drama may be all about McDonald’s and how businessman Ray Kroc took over the burger operation that brothers Richard and Maurice McDonald originally pioneered and built, but the scene that steals the show is this montage where the brothers (played by Nick Offerman and John Carroll Lynch) explain to Ray (Michael Keaton) how they developed their innovative “speedee” assembly-line service system that ensures burger-making continuity and smooth operations, from buns to pickles to the perfect squirt of ketchup and mustard. Moving over a chalk-outlined tennis court in a pseudo-serving ballet, the brothers coordinate with their new hires for hours about the right kitchen layout and process to ensure their restaurant is “a symphony of efficiency, not a wasted motion.” It’s a heartbreaking level of care and love that the McDonald’s brothers brought to their original restaurant—a far cry from the weird antics and general grossness too often seen from the fast food conglomerate in 2018. 9. The entirety of   Cloudy with a Chance of Meatballs (2009) Flynn Lockwood’s inventions are all terrible (monkey thought translators, spray-on shoes, “rat birds”), save for one: a machine that looks like a microwave combined with a colander that can convert water to food. Mostly fast food, like cheeseburgers, hotdogs, pizza, donuts, and anything else that the residents of Swallow Falls, a dumpy island in the Atlantic that formerly specialized in sardine fishing and canning, can imagine and ask for. But as tourism increases, so does the size of the falling food, which causes climate change in the form of spaghetti tornados and food storms that threaten cities around the world.Under all the impressive visual CGI imagery of giant food falling on the city (and on people) is a story built around the idea of being one’s self, no matter how bizarre or seemingly unpopular. This plus countless sight gags and the best food-raining montage in recent memory makes  Cloudy with a Chance of Meatballs one of the best 3D, computer-animated, sci-fi/disaster/satire/family comedies out there. And it’s definitely out there. 8. A “superb” review for   Mystic Pizza (1988)Everyone’s on red alert when snobby food critic “The Fireside Gourmet” (Louis Turenne) visits Mystic Pizza in small-town Connecticut, takes a few tentative bites of pizza, and dickishly abandons the entire rest of the pie after only eating half a slice. But a few days later, when the critic calls Mystic Pizza “superb” on his famous TV show and awards it his highest “four-star” rating, the women of the pizza shop (played by Julia Roberts, Annabeth Gish, Lili Taylor, and Conchata Ferrell) are ecstatic. On a larger scale, it’s meant a symbol; an affirmation that, despite everything, whatever they’re doing over there at Mystic Pizza, from figuring out college, to dating, and marriage, is OK. They’re going to be alright. 7. Going through the drive-thru in   Lethal Weapon 2 (1989) While protecting annoying federal witness Leo Getz (Joe Pesci), LAPD sergeants Martin Riggs (Mel Gibson) and Roger Murtaugh (Danny Glover) hit a Subway drive-through for dinner and the sandwich shop gets their order wrong. Leo demands the group goes back (“I hate tuna, okay? I refuse to get stuck with tuna!”) but they’re already several blocks away and not turning around. So Leo lays some truth on them on one of the realest monologues in all of movie history: “Can I give you two guys a friendly piece of advice, okay? Don’t ever go up to the drive-thru! OK? Always walk up to the counter. You know why?” Leo asks. “They fuck you at the drive-thru! They know you’re gonna be miles away before you find out you got fucked! OK? They know you’re not gonna turn around and go back. So they don’t care. … I’m not eating this tuna!” 6. The American cheeseburger from   Iron Man (2008) Three months after escaping captivity in Afghanistan, Tony Stark (Robert Downey Jr.) asks for two things when he steps off the plane: a press conference (to publicly announce that his weapons company will no longer produce weapons) and an American cheeseburger. Stark’s already finished one burger when he later rolls up at Stark Industries, consumes a second one walking in, and pulls a third (?!) from his jacket pocket as he addresses reporters.It’s a cute scene that feels like product placement for Burger King. But in real life, Robert Downey Jr. had previously stopped for Burger King back in 2003 while driving a car filled with drugs. He ordered “a disgusting burger … and this big soda, and I thought something really bad was going to happen.” Realizing his visit to Burger King was virtually the same thing as hitting rock bottom, Downey Jr. threw all his drugs into the ocean that night and vowed to get cleaned up. The cheeseburger scene in  Iron Man is a nod to Downey Jr.’s own life-changing cheeseburger moment.  5. Ordering pizza in   Home Alone (1990) After older brother Buzz (Devin Ratray), younger cousin Fuller (Kieran Culkin), and the rest of his gigantic extended family eats all the cheese pizza that he specifically asked for, Kevin McCallister (Macaulay Culkin) decides to order his own pizza once he gets full run of the house in  Home Alone. But how to do that without alerting the pizza delivery guy (love the name of the pizza joint, “Little Nero’s,” which promises “no fiddlin’ around!”) that Kevin’s just an eight-year-old kid left at home by accident during the holidays?A VHS copy of the fictional gangster flick  Angels with Filthy Souls might help. Using the film’s dialogue as instructions for where the delivery guy can leave the pizza and how much change he can keep (“Ya filthy animal!”), Kevin’s able to test out his movie pause-and-play technique in advance of his later encounter with “Wet Bandits” Harry (Joe Pesci) and Marv (Daniel Stern). Although why Kevin thought he’d be able to keep a lower profile by pretending to “open fire” with sounds of a machine gun firing at the pizza delivery guy is anyone’s guess. 4. The chicken dinner from   Little Miss Sunshine (2006) Dad (Greg Kinnear) is sweating over a possible publishing deal for his motivational self-help seminar, academic scholar Uncle Frank (Steve Carrell) has temporarily moved in after a failed suicide attempt, Nietzsche-reading teenager Dwayne (Paul Dano) has taken a vow of silence until he can become a test pilot, and Cheryl (Toni Collette), the mother, is just trying to keep it together and put food on the table. “What’s that, chicken? Every night, it’s the fucking chicken! Holy God almighty,” yells the family’s heroin-snorting grandpa, who spots the big bucket of fried chicken going around the table. “Is it possible, just once, to get something to eat around here that’s not the goddamn, fucking chicken?”In this film about “winners” and “losers,”  Little Miss Sunshine is a reminder that just being ourselves (and accepting who we are) is infinitely more important to one’s happiness than the beauty pageants and dumb competitions of life. If we can’t make room for a little ice cream, what’s the point of living? 3. Trying to order breakfast in   Falling Down (1993) “I want breakfast,” recently laid-off defense contractor William Foster says to the cheery front counter person at Whammyburger. So begins the tense-as-hell ordering scene from  Falling Down, where Michael Douglas’ character first attempts to order breakfast (after breakfast serving hours have ended, a lesson that McDonald’s learned to change in recent years) then becomes upset that the savory-looking “Whammy” burger in the picture doesn’t match the flaccid, pancake-like “miserable squashed thing” he’s been given. Falling Down perfectly captured the tension of a sweltering early 90s Los Angeles on the brink of being ready to burst; shot in Lynwood, the film’s production in 1992 actually had to be paused due to the LA riots. Douglas plays the ultimate angry white male (his father, Golden Age veteran actor Kirk Douglas, thought it was his son’s best work to date) whose long-simmering rage finally culminates into explosive violence. 2. The Big Kahuna Burger from   Pulp Fiction (1994) All of  Pulp Fiction is essentially an homage to fast food: Pumpkin and Honey Bunny hold up a Denny’s-type diner at the beginning and end of the film, Vincent Vega (John Travolta) considers the merits of a $5 milkshake for Miss Mia Wallace (Uma Thurman) at the 50s-themed Jack Rabbit Slim’s restaurant (don’t miss Steve Buscemi moonlighting as their waiter, Buddy Holly), and Vincent and Jules Winnfield’s (Samuel L. Jackson)’s discussion about what McDonald’s Quarter Pounders are called in Paris. (“They got the metric system, they wouldn’t know what the fuck a Quarter-Pounder is.”)But  Pulp Fiction’s ultimate fast food moment arrives early in the film when Vince and Jules go to retrieve a briefcase for their mob boss Marcellus Wallace (Ving Rhames) from a few associates that have double-crossed the boss. This tense sequence is punctuated by Jules’ sudden interest in the “Big Kahuna” burger that one of the guys is eating. (“This IS a tasty burger! … I can’t usually get [burgers] because my girlfriend’s a vegetarian, which pretty much makes me a vegetarian.”) Jules tries a bite of the burger, slurps all of the guy’s Sprite—then proceeds to shoot nearly everyone in the room. Say what? 1. Harold and Kumar finally go to White Castle in   Harold and Kumar Go to White Castle (2004) What should only be a 90-minute drive from Jersey’s New Brunswick to Cherry Hill takes Harold Lee (John Cho) and Kumar Patel (Kal Penn) all night in this 2004 stoner comedy that’s basically one giant commercial for White Castle. But what a commercial it is; by the time Harold and Kumar reach the blue-and-white cheeseburger haven, we’re almost as hungry for those delicious little sliders as they are. Krispy Kreme missed out on the opportunity of a lifetime by saying no to appearing in  Harold and Kumar, a decision they’re still probably kicking themselves over.In his positive review of the film, Roger Ebert wrote that “one secret of fiction is the creation of unique characters who are precisely defined. The secret of comedy is the same, with the difference being that the characters must be obsessed with unwholesome but understandable human desires.” Nothing’s more understandable than a sudden and pervasive craving for fast food, unwholesome as it may be.  Harold and Kumar Go to White Castle captures this deep emotional struggle, while also casting an Asian-American actor and Indian actor in lead roles, and doubles as a decent stoner buddy flick and a road trip movie. What more is there to ask for?Maybe some fries with that. Subscribe to Munchies."}