{"id": "jeremy scott's moschino tv h&m collection is a gift to his fans", "paragraph": "Images courtesy of Moschino“My hope as a designer was to give this to my fans as a gift,” says Jeremy Scott of his forthcoming Moschino collection for H&M. It’s a few hours before the show in New York, and Scott is sat backstage in a gray hoodie and matching track pants with a mash-up of the MTV and Moschino logos on. It’s this kind of surreal, pop cultural collision that has won the designer his legion of fans he’s talking about. “I want for them to enjoy it, and to get the most iconic, non-diluted vision of my world. I want them to have a Jeremy Scott for Moschino collection 100%, and not one drop of water added to it,” and he pauses, looking for the word. “Like,  potent,” he says, laughing. “Not like, ‘Oh I have the lesser priced one.’ I want them to have it, because it is it! It came from my voice, from my loins! It’s genuine, and stuff I want to wear, and give to my wear, and see people in. It’s authentic.” Scott’s work is routed in fantasy, as are his shows — recent visions for both his own label, and Moschino, have included a trip to the circus, an artist’s studio, Los Angeles, and a planet populated by glamorous aliens. This time, however, he’s visiting somewhere closer to home. New York, Times Square to be exact, the place with a million people looking at billboards. Only Scott could find the beauty in such a place. “I loved the idea of Times Square,” he says gleefully. “The fact that there’s so many people there. You can run into anything or anybody. I wanted it to have this feel of, ‘Who’s that cool person walking by you on the street looking so amazing.’” That energy will be seen in the staging of the show, too. “That’s kind of the vibe of the show, you have a cityscape, billboards with imagery we created, visual screens with all the imagery we’ve made. It’s this multi layered environment.” Of course, any imagining of New York wouldn’t be replete without a dose of the underground (it’s still there). You can see it in the campaign, shot by Steven Meisel — half of which is in a couture salon, the other half of which takes place at a vogue ball. “The couture and ball worlds are symbiotic, and Steven was so into it and inspired by it that it made perfect sense,” says Scott. You can see Scott himself peering out from the back of the ball, which in part was inspired by his favorite TV show of the moment,  Pose. In fact, MJ Rodriguez, who stars in the show as Bianca, features in the lookbook alongside the designer. “I mean, I’ve watched every episode several times. I’m so thrilled they have a second season. MJ and India will be there tonight,” no doubt just two of many celebrity appearances. “She is a phenomenal talent, she can convey so much emotion and nuance with a glance. She’s so wonderfully gentle and cool. We started chatting and getting to know each other. To bring her in there and shine a light on her, I thought was important.”  The campaign, and lookbook, are in fact packed with Scott’s friends, who he considers his extended family (his actual family also attend all his shows). It’s diverse, not in a tokenistic way, but in gender expression, race, and size, with everyone from the aforementioned MJ, to  Drag Race star Aquaria, to model Barbie Ferreira, to tattooed actress Bria Vinaite from  The Florida Project. “Probably, as opposed to perhaps some designers, I’m someone that naturally shows diversity,” he muses of his group. “Diversity is genuinely a part of my life, versus other brands, so if anything perhaps H&M were surprised that they didn’t have to encourage me in that,” he says of the casting process. With this many friends, his phone, currently in an oversize Moschino case, must be blowing up nonstop.  “My phone’s exhausted,” he laughs uproariously. “I’m like, ‘Please stop it.’” the chance of Scott ever slowing down, however, is close to nil. Moschino x H&M launches November 8 at select stores worldwide and online at HM.com. Watch the fashion show live tonight at 7pm EST on Instagram.suscribe to i-D's positive vibes."}