{"id": "Unscented DJ's Noisey Mix Is a Smooth Mix for a Long Flight", "paragraph": "Sometimes the perfect record finds you. It’s easy to get caught up in the hunt, the endless dusty fingered pursuit of rare or otherwise unturned treasured buried in the bins of record stores in hidden corners of mega metropolises. That digger’s dream harder and harder in the internet era—when eagle-eyed prospectors snap up the best shit the moment it hits recently arrived bins only to throw it straight to Discogs to do the ol’ wax into gold alchemy. But what if that search is misguided? What if right under your nose, in the neglected stacks of old breaks and busted beats, there’s gems to be (re)discovered, hiding in more or less plain sight. That’s more or less the guiding principle of this week’s Noisey mix, care of Unscented DJ. In an email that he sent with the mix, he said it was informed by the sounds of “dusty breaks you tend to find in cheapo bins in NY record stores.” I’m willing to admit to a lack of knowledge on some of the genres he pulls from across the 90-minute mix—he darts from those breaks to Florida bass to acid to hardcore—but I don’t know that I necessarily would have pegged any of these for “cheapo” records had he not said so (though he does clarify that not all of the tracks in this mix fit that bill). Perhaps it’s a testament to his taste and mixing, but these tracks feel alive and colorful, proving—as ever—that music needn’t be an elitist exercise. There’s joy somewhere in every record bin. This sentiment feels tied to Unscented DJ’s overall efforts. Born Brandon Wilner in Roanoke, the New York selector tends to not gear his sets too heavily toward one genre or another. He says he involved himself more heavily in the dance music world when he got a job at Resident Advisor a few years back. But he’s an omnivorous listener—as likely to delve into spacey instrumentals (peep this Durutti Column mix with DJ Voices from earlier this year) as he is more dancefloor-oriented fare, like this mix. He almost thinks it could be holding him back from getting more gigs. “I do love listening to many types of music and making mixes in as many styles,” he wrote in an email. “Which I think might make me kind of unmarketable as a DJ.” But his vision lines up with the way I listen to music, which makes his Lot Radio sets with DJ Voices a crucial follow. You never know exactly what records they’re going to bring, but it’s always going to be special. Earlier this year, he started a party called Badness, which demonstrates that anything-goes approach—he says he’s been relishing the occasion to play slow tracks at peak hours, an anachronism in a world that often favors teeth-grinding speed. The next of those parties goes down December 7 at Mood Ring in Brooklyn, but until then you can spin this mix.  Noisey: How are we meant to enjoy the mix? What's the perfect setting?Unscented DJ: It would be pretty great to listen to on a flight to Chicago, Detroit, Miami, London, New York, Bristol (UK), or Birmingham (UK). But only if it’s looking like it will be a smooth flight. I don’t think it would be very comforting during turbulence. It should not be listened to on a flight to Los Angeles. Is synesthesia a real thing, and if so, what color is this mix?I don’t have synesthesia but I believe that others do. Because I don’t have it, I’m probably not qualified to say, but the mix has a lot of funny acid in it so I’d say it’s the color of lime. Acid makes me think of that color. Was there any specific concept to the mix?I love that hip-house tends to pay homage to the breakbeat because hip-hop is founded on breaks. I wanted to make a mix that had a bunch of break-y hip-house in it, and to also be able to show how this music that’s generally considered tacky has quite a bit in common with music that’s more conventionally lovable. Do you have a favorite moment on this mix?It doesn’t have anything to do with my mixing, but I love the part in Johnny Funk’s “Ghetto Rockin Acid” when he breaks it down and then says, “Yo, bring that beat back! One, two, three, four….” It’s probably the cheesiest thing he could possibly say right then, and that makes it even better because the acid going up an octave with the dreamy chords behind it really is a lovely moment. That’s just such a beautiful and weird track. Can you tell me a bit about your origin story?I like to trace the whole DJing thing back to college radio, which I wasn’t really “DJing” on when I began, but it was my introduction to research and selection in music and having to put together a two-hour block of programming. In my first semester at the University of South Carolina, I got a radio show on the school’s station WUSC, and by the end of my four years there I was doing a reggae show with my brother Bryce. I’d gotten pretty into reggae and West African guitar pop and funk, so I knew I liked repetitive music with a big focus on the low end. This was around when the post-dubstep moment was happening, so I just naturally started to listen to that as well. And I had for some reason gotten into stuff like Donna Summer and Gino Soccio as well and was just dipping my toes into house music around the same time.I moved to Chicago right after finishing school, and I started interning at Pitchfork. Through my supervisor there, I met Steve Mizek, the founder of the website Little White Earbuds. He was trying to grow his team around then so I started working with him doing all kinds of editorial miscellany. All of a sudden I was living in the birthplace of house music and working for this underground music website, reading about the stuff every day and going out to clubs to hear people like Derrick Carter and Frankie Knuckles play. I definitely cut my teeth on house music in Chicago.I moved to New York for graduate school, and had loads of music friends here because of this music-sharing Facebook group called Great Tunes, many of whose members live here. Once I finished my program, I started going out all the time to be with these people. (New York’s music landscape felt much more vibrant than Chicago’s was when I was there. Whereas in Chicago there would maybe be one party per weekend that I really wanted to check out, New York might have four great ones in one night.) I was looking for work at arts institutions or publishers after I finished my graduate program, and I quickly learned how unbelievably competitive those positions are in this city. I broadened my scope and started thinking about where else I might be able to work, and wound up looking at Resident Advisor’s Jobs section, which had a New York position listed. I applied, and all of a sudden I became a career raver. I didn’t necessarily plan for this, but I do feel fortunate to work in a field that I really care about, and to not have to do so in a way that makes me feel gross. Do you think there is anything that unites the sounds you’re most drawn to as a DJ or as a listener?I used to worry that I was listening widely in search of the same sort of musical gratification across different genres, but I don’t think that’s the case anymore (though I do love a major 7th chord and my ears will at least perk up a bit when I hear one deployed in almost any way). I think a lot about what’s running through my head while I’m at a listening booth at a record store, and the most prominent thought I have is, “Is this like any other record I already play?” I love piano house, for instance, but I really don’t know if I need to buy more records in that style unless they have some interesting or powerful deviation from it. You mention that this mix was inspired by “breaks you find in cheapo bins in NY record stores,” what do you mean by that exactly?The “House and Techno New Arrivals” bins at Academy Annex in Greenpoint are a pretty perfect example of the sort of bins I love to dig through—full of past rave detritus and priced really well. I think I found five of the records in this mix from those bins. I’ve been saving a lot of the ones that sound more special to me, and I’ve been playing many of the tracks in this mix out. After a while it just seemed right to put them all in one mix. I also do this thing where if I buy two records around the same time and really like them, I’ll naturally wind up playing them in the same sets. So even if they don’t match perfectly in a stylistic way, they’ll still be close to each other in my mind. That’s certainly the case here.I also don’t mean to say that these are all cheapo records, some are actually really not! There are also a couple newer ones in there that feel like contemporary kindred spirits to the tracks that make up the bulk of the mix. Also more generally, what do you make of the spread of breaks across house and techno right now? It has sorta become this truism that its hard to go out in New York right now without hearing them.I think that the “underground” market is so robust right now in New York, that it can finally accommodate styles that depart from the common trio of house, techno, and disco. So many people in the city are going out dancing now that not only can people go out to whatever sort of night they want, but the DJs playing these nights know that they can play a hardcore or jungle tune because the dancers, who now go to many different kinds of parties, will recognize and appreciate a tangent like that. The conventional wisdom about prog rock in the 1970s is that a booming rock record industry was what made prog possible—because record sales were up, labels could take chances on weirder excursions. Now that people in New York are dancing again, breaks and trance and gabber are able to have their moment too.On its own merit, I can’t think of why one  wouldn’t want to hear a track based around, say, the Dennis Coffey “Scorpio” break when they’re out dancing. Breaks allow you to open up your hips and feel enhanced with looseness while you’re out at a night full of four-on-the-floor. I think it’s great that they’re “back.” Badness is sorta the new thing still, I saw you just announced the next one. Is there anything that motivated the party aesthetically or dispositionally? What made you want to start doing it? Do you have specific plans for the future of it?I started Badness in February of this year. As important as the music is the feeling of being bad or knowing something is bad. I’ve used a bit from Sonia Sanchez’s intro to her poem “Black Magic” for a lot of the parties: \"You know before you can love someone you gots to love yourself. I mean you gots to dig on yourself, know that you be bad. Badder than bad, in fact. In fact, you gotta really know what you're about.\"I think that a lot of what we love about dancing comes down to this point—that it makes us feel like we’re bad, and that when we feel like that about ourselves, we’re able to be that way to others way too.The night came out of my desire to hear DJs play more widely across a range of tempos. To a) not feel too beholden to the general 120 to 140 BPM range we usually hear in a night out, and b) to not have beatmatching dictate what is acceptable to play. I go to some private parties where the people playing don’t even mix, they just play an entire track and then put the next one on, which allows them to play drastically different tempos. I often leave these parties feeling very scrambled about what I think music for dancing is.I particularly love slow dance music. I don’t think it’s just for the chillout room, or that it only has to sound balearic or whatever. I think there are dance tunes made at 95 BPM that are just as intense, beautiful, etc. as those made at more common house and techno tempos. I feel really fortunate to have been able to host Maria Chavez, my colleague Matt McDermott, Violet, Shawn Dub, Olive T, and the old-school drum-n-bass DJ Del Mar so far.The next one with Cera Khin should be a perfect expression of the wide-ranging tempo thing, though I’m not going to tell her she has to play slow or anything like that. Her radio show and mixes are feel so naturally varied and strange. I’m excited to hear how she plays a party, and excited as well that my partner Kristin (DJ Voices) has helped me to put that one on. We’ll be playing at it together.Tracklist:The Higher Intelligence Agency - Ketamine EntityMetronome - Straight JacketBetty Boo and the Beatmasters - Hey DJ / I Can't Dance (To the Music That You're Playing) (Rock Steady Dub)This I'd Jazz - Wait a MinuteParis - WretchedKyze - Stomp (Move Jump Jack Your Body) (Zanzibar Mix)Tabu - I Wanna (Welcome to the Big Beats)Johnny Funk - Ghetto Rock (Rock'n Acid)Bass Trip - Break It DownA2L - Come On (Acid Love Mix)HVL - ContinuumUnderground Attorney - Nothing Stays (The Underground Mix)Snuff Crew - Pleasant Journey Revelation - Masochist TripDJ Icey - DreamSpanish Fly - Precious (G-Bones Mix)Metronome - Voyage to the Bottom of the BassCola Boy - 7 Ways to LoveGet the best of Noisey, delivered to your inbox every day."}