{"id": "Watch GWAR Mercilessly Demolish a 'Rick and Morty'-Themed Bar", "paragraph": "L: Photo by David Givens; R: Photo by Ana ValentinI genuinely feared for my safety when I brought a small video crew to watch GWAR, the cadre of intergalactic sex and death gods / metal band to destroy an unauthorized  Rick and Morty-themed that had just been shut down in Washington, D.C.At one point the Scumdog of the Universe known as Beefcake the Mighty choked me and threw me to the ground, which was littered with shattered glass and splintered wood.Later, another Scumdog named Bälsäc the Jaws o’ Death screamed, “The cameraman! We need to destroy him first!” Thankfully, he got distracted, decapitated a Meekeeks, and humped its severed head.A third, Jizmak da Gusha, howled as he obliterated an entire shelf of poop emoji mugs.No one familiar with GWAR should be surprised by the grotesque display of violence it wreaked on that small establishment, created by a Washington, DC-based group called Drink Company. Since the 80s, GWAR has been showering concertgoers with blood and other bodily fluids as they tell the intergalactic epic of their violent lives.For those unaware, GWAR were once powerful warriors working for the enigmatic MASTER, but were banished to Earth for bad behavior. They (allegedly) fathered humanity by having sex with monkeys and shaped human history as demons and gods. Eventually, they realized humanity is “a parasitical disease that must be eradicated,” and have spent the last few decades destroying us one-at-a-time from a stage.I wasn't caught off-guard by the power of their rage—I was in the office when members of the group interviewed for a job at Noisey and threatened the life of Eric Sundermann (now that site's Editor-in-Chief) and demanded to be paid in crack rocks and fish. But I was surprised by how infectious it was. A shot of adrenaline rushed through my system as Bälsäc shattered a 25-foot-long naked Santa Claus and knocked it down from the ceiling. Soon I too was destroying every  Rick and Morty character I could get my hands, boots, and comically large forehead on. In the end, I was lucky enough to be spared, but VICE’s new video documenting the carnage shows how close it was.I also underestimated the cosmic hate hard-on GWAR has for  Rick and Morty, the Adult Swim show that inspired Drink Company to build the watering hole now being destroyed. For starters, the band’s nemesis, Sawborg Destructo, apparently loves the series, which was recently renewed for 70 episodes. There’s also a subtle GWAR Easter egg in the first episode of the show, depicting Beefcake the Mighty and former front-being Oderus Urungus (who was burned in a viking funeral when his human counterpart David Brockie passed away in 2014) standing in a large lobby some bug aliens chase Rick and Morty through. Apparently, that pissed them off:As I interviewed the band before they unleashed their barely-contained rage, Beefcake grunted, “We saw you put us in the first episode. You think it’s a secret. We want some of that pickle money. You put us in your show, we want a little bit of dough.”A payoff is an unlikely scenario, so the titans of terror took out their feelings on the paintings, plywood cutouts, props, and other breakables spread throughout the Wubba Lubba Dub PUB. It’s no wonder they traveled from their home base in Virginia to destroy the effigies of Rick and Morty—largely created by graffiti artist Andrew Funk—and replaced them with a bar decked out in GWAR artifacts (GWARtifacts).Derek Brown, the president of Drink Company, seemed to be taking the whole chaotic situation well. “I’m bummed out in the sense that the artwork took a long time to make. It’s handcrafted,” he admitted as we prepared to destroy the place months ahead of schedule. But the nature of pop-up-bars is that they close down, eventually. Brown is resigned, but still energetic as he reasons, “It was always meant to be destroyed.” The Rick and Morty bar that had been slated to be open through the beginning of October, but enjoyed just a single day open to the public.Before GWAR acted out their revenge for this perceived injustice, Bälsäc declared, “We brought the swords. We’ll turn this place into rubble in minutes.” And then they did.Watch the video below:Keep up with Drink Company’s latest pop up bars on its website. Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Beckett Mufson on Twitter and Instagram.Sign up for the best of VICE, delivered to your inbox daily."}