{"id": "Chicago Bar Will Host Wake for Beloved Taco Bell Scheduled for Demolition", "paragraph": "Photo via Flickr user Michael Romero It has been more than a year since C.J. Black jokingly suggested a rally to save the Taco Bell in Chicago’s Wrigleyville, the ever-renovating neighborhood on the city’s North Side. Last August, the Taco Bell was stamped with an expiration date, after a developer and mortgage broker paid $8.9 million for the property, promising to replace the Gordita Supremes and Double Chalupas with three-stories of upscale retail.  Although Black’s effort to save the restaurant was mostly tongue-in-cheek, it was a go-to late night (or early morning) joint for Wrigleyville residents, and for visitors who might’ve just been in the neighborhood for nine innings. \"When I initially created the event, I did so with the sole intent of sharing it with three or four of my friends with whom I frequented the Taco Bell, and that's it,\" Black told MUNCHIES last August. \"I thought that I was going to get a laugh out of a friend or two, and then it'd just fade into obscurity. I had no intention of this going beyond anything more than that.\" And his rally might’ve only existed as an internet in-joke (and it was a joke, despite the angry commenters suggesting otherwise), but there is a real-life plan to both remember and mourn the Taco Bell. According to Block Club Chicago, the Nisei Lounge, a dive bar that’s just a five-minute walk from that beloved Bell, will be hosting an Irish wake in its honor.  “Wrigleyville's last bastion of burritos, gorditas, and good decision making is getting the wrecking ball in November,” the Nisei Lounge wrote on Facebook. “Though we're Team Burrito Mexicano around here, we know greatness, and the Wrigleyville Taco Bell always had it, if not in the food or the service, but definitely in the people watching.”  The event will be held on Sunday, October 28, and the bar would appreciate if potential attendees could wipe their tears and lift their black veils long enough to RSVP online. There is something about losing a Taco Bell that causes a specific kind of sadness, and the need for a public outpouring of grief. Earlier this year, more than 100 people held a candlelight vigil to mourn a Taco Bell in Montgomery, Alabama. The restaurant had burned down less than a week prior, and it seemed necessary to gather to remember the good times, the bad, and the bridge between the two, the Cheesy Gordita Crunch.   The Chicago Tribune reports that demolition on the Wrigleyville Taco Bell is scheduled to begin on November 1, and the restaurant must serve its last fourth meal by the end of October. In its place, there will soon be 16,000 square feet of yet-to-be-leased retail space, and a two-story climbing gym called Planet Granite.  “One by one they were all becoming shades,” James Joyce wrote in “The Dead,” the final story of  Dubliners. “Better pass boldly into that other world, in the full glory of some passion, than fade and wither dismally with age.”  You passed boldly, Wrigleyville Taco Bell. You passed boldly, and you lived más. Subscribe to Munchies."}