{"id": "Meet the Russian cowboys behind one of the world's largest cattle operations", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.BRYANSK, Russia — Western sanctions were supposed to cripple the Russian economy. But thanks to an unlikely source, the Kremlin’s tit-for-tat ban on food imports has sparked an unprecedented agricultural boom. It's largely powered by American expertise — with cows.Backed by generous state loans, the meat producer Miratorg has bought almost 2 million acres of Russian land since 2010, more than quadrupling its staff to 35,000, and lavishly importing everything from Aberdeen Angus cows to grass to herding horses.Their 1,000-member team of homegrown cowboys were initially trained by Americans, and now oversee a super-herd of almost 400,000 mother cows — one of the biggest cattle operations in the world.Kansan Phil George, a ranch boss of 25 years experience, was hired to oversee the expansion.\"When I first saw the land, all you could see was a landscape covered in a meter of snow. But we did things very, very quickly,\" he said. \"There was no infrastructure and no resources in Russia other than land and inexperienced people. We imported cattle, we imported 500 horses from the U.S, we bought saddles for every one of them, we imported semen, pharmaceuticals...even the first crails had to be imported and weren't constructed here.\"BRYANSK, Russia — Western sanctions were supposed to cripple the Russian economy. But thanks to an unlikely source, the Kremlin’s tit-for-tat ban on food imports has sparked an unprecedented agricultural boom. It's largely powered by American expertise — with cows.Backed by generous state loans, the meat producer Miratorg has bought almost 2 million acres of Russian land since 2010, more than quadrupling its staff to 35,000, and lavishly importing everything from Aberdeen Angus cows to grass to herding horses.Their 1,000-member team of homegrown cowboys were initially trained by Americans, and now oversee a super-herd of almost 400,000 mother cows — one of the biggest cattle operations in the world.Kansan Phil George, a ranch boss of 25 years experience, was hired to oversee the expansion.\"When I first saw the land, all you could see was a landscape covered in a meter of snow. But we did things very, very quickly,\" he said. \"There was no infrastructure and no resources in Russia other than land and inexperienced people. We imported cattle, we imported 500 horses from the U.S, we bought saddles for every one of them, we imported semen, pharmaceuticals...even the first crails had to be imported and weren't constructed here.\"It started because Putin wants the country to become self-sufficient for food in the next five years, and for food exports to China and the Gulf to help wean Russia’s economy off its increasingly precarious dependence on oil and gas.And Russia’s mass move to agriculture does predate the U.S. and EU sanctions that followed Russia’s invasion of Ukraine, but their imposition turbo-charged the growth of a previously dormant industry. Counter-sanctions in 2014 banned the import of food from the West, rendering more than half of the country’s meat, dairy and fish imports illegal overnight.The state then backed domestic producers of cheese, meat, fish, vegetables and wheat to expand rapidly. Many, like Miratorg, hiked production several times over in just a couple of years. Almost $4 billion worth of Russian food has been produced as a result of sanctions, according to the Russian government.But while farms are visibly thriving, the economy at large has contracted and the ruble has collapsed — leaving millions of Russians worse off and poverty rates surging to a nine-year high. Faced with a near-monopoly on some food products, critics argue that Russian consumers with less money are simply having to spend more on inferior products. And if relations thaw and markets reopen to Western food producers, Russian producers fattened on state support and a captive market might ultimately disappear as quickly as they emerged.“Yes, of course, output has increased. But it all comes at a cost to Russian households,” economist Natalia Volchkova told VICE News. “Russia’s counter-sanctions shield these businesses from world competition. They can’t compete with real world prices.”But even in the unlikely event of a sudden revival in Russo-Western relations, Volchkova says Russia's burgeoning cowboys might not be the first to succumb to market forces.\"Miratorg, now that's a good question,\" she said. \"If they are actually using international practices, they might ultimately manage to be competitive in normal conditions.\"This segment originally aired November 1, 2018 on VICE News Tonight on HBO."}