{"id": "burberry, stella mccartney, and h&m sign pledge to eliminate plastic pollution", "paragraph": "Image via Creative Commons. Whether it’s the warning that we only have 12 years left to reverse climate change, the harrowing news that humanity has wiped out 60% of the world’s wildlife since 1970, or the fact that by 2050 there will be more plastic than fish in our oceans, one thing’s for sure -- we’re in the midst of a global environmental crisis. Now, some of the planet’s biggest fashion brands are committing to addressing that crisis, specifically by taking on the issue of plastic pollution and waste. Yesterday, Burberry, H&M, L'Oréal, Stella McCartney, Unilever, the British and Chilean governments, and more signed a pledge -- the New Plastics Economy Global Commitment -- and announced their pact to “eradicate plastic waste and pollution at the source”. Created by UN Environment and the Ellen MacArthur Foundation, the commitment outlines three targets for brands, governments and nonprofits to hit in order to reduce plastic waste. Firstly, by eliminating single use and unnecessary plastic packaging, secondly by encouraging innovation in recycle, reusable, or compostable plastics and thirdly by reusing or recycling existing plastic in circulation without throwing it away. The commitment also introduces a new level of accountability, as the brands and organizations who signed yesterday’s pledge are required to publish their progress annually, with targets reviewed every 18 months. “Plastic waste and pollution is a big global environmental challenge,” said H&M’s environmental and sustainability manager, Cecilia Brännsten, in a statement. \"There is no single brand that can tackle this industry-wide challenge on its own. We must act as one voice and the New Plastics Economy Global Commitment is a big step in the right direction, as it will align business and governments on a common agenda and timeframe.\"This article originally appeared on i-D UK.suscribe to i-D's positive vibes."}