{"id": "Hey Google! Is It Cool If My Emails Have Some Fucking Personality?", "paragraph": "via GettyAs you may have noticed, Google has slowly but surely rolled out a new Gmail layout, and with it, we've been gifted two new features—\"Smart Reply\" and \"Smart Compose\"—which help automate the apparently challenging task of writing an email. I resisted the update as long as I could, but now I have been forced to adopt this new way of life, and honestly, I hate it. Although Smart Compose was announced in May, it wasn't until a couple months later that people started paying attention. \"Once I get past its 'creepy-good' factor, I'll probably be lost without it,\" an Elite Daily blogger mused in early October. Both of these new \"smart\" features use machine learning \"based on the email you received and how you normally write,\" and as BuzzFeed pointed out earlier this month, many internet users have called this \"super creepy,\" \"dystopian,\" and a \"crazy futurist robot trying to read my brain.\" The amount of data Google has about my email habits is vaguely concerning, as it can admittedly predict what I want to say with great accuracy. Regardless of how sinister and impressive that is, the whole thing irks me because, like, can my emails have some fucking personality? Perhaps I'm just ashamed that the algorithm can anticipate me so well. As a professional (and deeply unprofessional) writer, maybe I should be able to outsmart the AI with the achingly human beauty of my words.\"Email makes it easy to share information with just about anyone—friends, colleagues and family—but drafting a message can take some time,\" Paul Lambert, Gmail's product manager, explained in a blog post explaining how to use their latest innovation. \"Smart Compose helps save you time by cutting back on repetitive writing... [and] even suggest relevant contextual phrases. For example, if it's Friday it may suggest 'Have a great weekend!' as a closing phrase.\" Here's the thing, Paul—I don't think writing an email needs to be any easier than it already is. We don't need a robots to dehumanize the messages we write on an already deeply dehumanizing medium. In the digital age, we are already accustomed to shooting off messages without having to consider them. Gmail's autocomplete feature further robs the user of the opportunity to actually think about what they want to say, and phrase it in a way that could only come from them.The email is the modern version of writing a letter—back in the day, you had to really work to correspond with anyone not in your immediate vicinity, painstakingly dip a quill into a well of ink to express yourself, grab a chisel and a beautifully flat piece of rock and start hacking away. Obviously, email is wonderfully convenient and yadda yadda yadda, but at least a letter had inherent flare, and a piece of rock could be put in a museum one day. The internet is alienating, and the ease with which you can broadcast anything you'd like with email and social media encourages impulsiveness and thoughtlessness, rendering all of us vulnerable to groupthink.Of course, these autocomplete features could be construed as a useful tool to speed up the process of sending low-stakes email when you're on the go—after all, that's what they were presumably intended for. But as Popular Science noted in an article on Smart Compose, \"Research conducted by the University of Glasgow suggests that 80 percent of email is unnecessary. According to their report, unnecessary emails consisted of notes that didn’t need to be sent at all, or a missives sent on topic so important and complex it needed to be discussed in person.\"The last thing we need is the tech we use sucking out the remaining embers of what makes us human, and writing our thoughts and concerns for us. The solution is simple—I am going to throw my computer and phone into the East River, go off the grid, and remember what being a human being is really all about. Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Eve Peyser on Twitter and Instagram.Sign up for the best of VICE, delivered to your inbox daily."}