{"id": "The Kepler Space Telescope, Which Discovered 2,600 Exoplanets, Is Out of Fuel", "paragraph": "Artistic rendering of Kepler. NASA/Ames/Wendy StenzelAfter nine years and the discovery of thousands of exoplanets, NASA announced today that its Kepler space telescope has run out of fuel. It is, apparently, the real, final end of a telescope that has had many near-death experiences over its lifespan. Kepler will be remembered for discovering more than 2,600 exoplanet over its nine-year lifetime, sparking wonder and excitement with every haul. Now, when we look up at the stars, we know more than we ever have before—and we can daydream about what these thousands of worlds hold.  “As NASA's first planet-hunting mission, Kepler has wildly exceeded all our expectations and paved the way for our exploration and search for life in the solar system and beyond,\" Thomas Zurbuchen, associate administrator of NASA's Science Mission Directorate in Washington, said in a press release. \"Not only did it show us how many planets could be out there, it sparked an entirely new and robust field of research that has taken the science community by storm. Its discoveries have shed a new light on our place in the universe, and illuminated the tantalizing mysteries and possibilities among the stars.\" It’s been far from a smooth decade for the space telescope. Kepler had a habit of faking its own death, but managed to keep on keepin’ on every time.  In May 2013, Kepler went on “life support” and we thought it was the end:  If Kepler's not dead, it's certainly a vegetable. Scientists controlling the spacecraft went to check on it Tuesday and found that one of its four reaction wheels, which let the telescope point at things it wants to see, wasn't responding. NASA went through the same thing last year, and hasn't been able to get that reactor wheel working. It needs at least three to function, and John Grunsfeld, who runs NASA's science mission directorate, said the telescope \"is not in a place where I or any other astronaut can go up and rescue it.\" One year later, in May 2014, NASA was able to fix the wheels and revive the mission; the agency estimated at the time that it would have had enough fuel to last until 2021: If everything goes smoothly, Kepler will begin looking for planets again by the end of the month and will operate for at least two more years. If it works, scientists on the project estimate that the telescope has roughly seven years worth of fuel left. Kepler really freaked everyone out in April 2016, when it unexpectedly switched to \"emergency mode” and started burning fuel like crazy, 75 million miles from home. It was saved in part by NASA’s Deep Space Network: After Kepler's state of emergency was lifted, mission manager Charles Sobeck expressed his gratitude to the Deep Space Network, and \"to other missions that surrendered their scheduled telemetry links.”  Given this track record, it’d be tempting to think that maybe there’s a tiny chance Kepler isn’t done yet. But it sounds like this is the finale for the little telescope that could. Sign up for Motherboard Premium."}