{"id": "Super Typhoon Yutu, the Strongest Storm of 2018, Is Making Landfall on Pacific Islands", "paragraph": "Super Typhoon Yutu hitting the Northern Mariana Islands on October 24 with a Category 5 intensity. Image: CIRA/RAMMBThe strongest storm on Earth this year, Super Typhoon Yutu, is making catastrophic landfall in the Pacific Ocean’s Northern Mariana Islands.Typhoon is the regional name for a hurricane. Yutu reached a Category 5 intensity today with sustained winds of 180 miles-per-hour, and gusts exceeding 200 miles-per-hour, reports the  Washington Post. The Commonwealth of the Northern Mariana Islands are home to roughly 52,000 people; the majority are US citizens or US nationals.“This is an historically significant event,” tweeted Michael Lowry, a FEMA strategic planner and hurricane specialist.On Wednesday (Thursday according to local time there), the monstrous storm approached the Northern Marianas, a collection of US island territories that share an archipelago with Guam, another US territory. The Northern Marianas are 3,800 miles west of Hawaii.The National Weather Service predicts that Yutu will wreak “devastating damage” throughout the region.“Most homes will sustain severe damage with potential for complete roof failure and wall collapse,” the service warned. “Most industrial buildings will be destroyed.”Yutu swiftly grew to a Category 5 intensity from a Category 1 in a mere 24 hours.The Northern Marianas’ Office of the Governor urged residents to shelter in place, calling it a “life threatening hazard” for the islands of Saipan and Tinian, where a typhoon warning is in effect. Guam and other southern islands have issued a tropical storm warning. According to local media in the Northern Marianas, emergency shelters are quickly filling up, but more will open. This morning, Yutu’s eye had encompassed Tinian and southern Saipan, according to the National Weather Service.The agency also warns that a 20-foot storm surge—a rise in seawater level during a storm—could occur. They eye of the storm is expected to see waves 25 to 40 feet high.Yutu is tied with Typhoon Mangkhut for this year’s strongest storm. In September, Mangkhut swept through the Philippines and southern China, with winds reaching 180 miles-per-hour. It is believed to have killed 127 people in the Philippines, China, and Taiwan.The Pacific Ocean’s warm waters are incubators for some of the strongest tropical cyclones, and Yutu “is one of the most intense tropical cyclones we've observed worldwide in the modern record,” FEMA’s Michael Lowry tweeted. Yutu could become “one of the most intense storms— if not the most— on record to hit US soil,” wrote the  Washington Post.The Northern Marianas are another US territory hit by a major storm within the past two years, following 2017’s Hurricane Maria which left a lasting impact on Puerto Rico and the US Virgin Islands.Sign up for Motherboard Premium."}