{"id": "Lechuga Zafiro’s Noisey Mix Is a Freeform Exploration of Wild Rhythms", "paragraph": "Both as a producer and the co-proprietor of the label/collective Salviatek, Lechuga Zafiro has proven that he has a taste for out of the ordinary rhythms. The Uruguayan artist born Pablo de Vargas is best known as explorer of the outer realms of the bass-drum hopscotch that punters most often refer to as club music, his tracks are usually something a little stranger. He’s experimented with incorporating traditional drumming styles from his home country into slivered beatwork, and then seen those fractured beats transformed into euphoric tracks in a number of regional styles thanks to remixes he commissioned from producers all around the globe. The point isn’t just to make tracks, it’s to find new ways to imagine old forms—to create new worlds by embracing all that the one we live in has to offer.Take his EP  Testigo for example—released this August by fellow dancefloor contortionists N.A.A.F.I.—he offers five tracks that take the component parts of contemporary electronic music (the scuffed synth work, stomach-churning sub bass) and present them in a format that feels non-linear, otherworldly, and imagistic. It’s sorta the club music equivalent of poetry, a music that focuses on suggestion and detail, rather than overall narrative. So much dance music ends up being functional—a background soundtrack to hedonism, but  Testigo doesn’t let you just nod your head, you’re forced to pay attention to the character of each specific sound, to find the beauty in split-seconds. Earlier this year, his Salviatek co-conspirator Pobvio offered up a mix for our series, and this week Lechuga himself turns in a heater, in part in celebration in  Testigo, but more generally just to explore the universe of rhythms that he draws on in his solo work. Across 35 minutes, he bounces between insectoid acid, baile funk, and nigh-new agey ambience, the whole set’s both rapturous and bewildering—a head-scratcher that you can’t help but nod along to, which is more or less the appeal of his music to begin with. Noisey: How are we meant to enjoy the mix? What's the perfect setting?Lechuga Zafiro: Dancing [in] your living room with the lights out. Is synesthesia a real thing and if so, what color is this mix?The color of mud. Was there any specific concept to the mix?I just tried to do something different than what I'm used to do, more form free and focused on rhythm. I’m really interested in the piece of writing that accompanies your new EP on the NAAFI bandcamp page. Can you tell me about that piece and how it corresponds with the music on the EP? Do you see any similarities between how you approach production and the imagistic approach of poetry?Even though I know little about poetry, I do connect with the way rhythm is conceived in that expression. In the case of the text you mention, it is something I wrote after finishing Testigo but while working on the concept for the \"Agua y Puerta\" videoclip. The \"Agua y Puerta\" track and the sounds I recorded for that music is the trigger for both the text and video.  Testigo features some really far out rhythms, even by the standards of your production—were there any guiding principles for these songs?The music of Testigo started as I do most music, which is playing with a couple of sounds with my hands on a controller. What’s next for Salviatek? You released the remixes earlier this year, but haven’t had a proper release since then. What’s on the horizon?Pobvio has [been] really active and working on releasing new stuff, a couple of interesting mixes by Dj Perigo and Loka, and there's also a new EP coming out this year by a cool producer called Funeral (featured in the mix).Tracklist:Ease Be (Yantan Ministry Edit) - Cyphr x who is this lmk pleaseMira Lo Que Tengo Pa’Ti - RéelleKonvoy - NazarGamerdit - MoroOscollo (drums only version) - Elysia CramptonO-k-o-k - Dj Adam ft. Dj MabookinhoWhite Demon - Santa NiñaThe Singing Tube Part One Bonus jcf - Matmos (edit)Martu - Dj NervosoDrumfeed - Cristian VogelÉ Muito Crime vs Vem Maria Fuzl - Somália Sucessada e VN (edit)Última Liamba (Beat) - Dj Adi Mix & Picante??? - Thalia x TAYHANA x Lechuga ZafiroPlanet of Drums (Rx Tribe) - Tim Taylor & Dan ZamaniLOAT - elirrealveintiunoFestividad - Funeral??? (prod. Lechuga Zafiro) - Linn Da Quebrada Get the best of Noisey, delivered to your inbox every day."}