{"id": "I Was Raped at College. Here's How DeVos's New Rules Harm Survivors Like Me", "paragraph": "My sophomore year of college, I was raped by a graduate student who offered me a ride home from an off-campus party. He had been feeding me drinks throughout the night to the point I was so drunk, I was unable to walk home on my own. The next day I went home, showered, and couldn’t bear to leave my apartment. In the months following my assault, my grades steadily dropped. I isolated myself in my apartment and skipped most of my classes. My PTSD and anxiety caused me regular panic attacks when I tried to walk across campus, and which made it impossible for me to finish any of my schoolwork. My rapist and I were part of the same small department, meaning I was forced to see him every time I went to class. But as a low-income student, my ability to stay in school was directly tied to a scholarship from the same department—and my grades had dropped so significantly I was unable to transfer to another school. I spoke with a campus advocate and told her I didn’t know what else to do but drop out of school entirely. She worked with me to file a complaint with my Title IX coordinator, who connected me with free counseling on campus, spoke to my professors about allowing me extensions on my school work, issued a no-contact order between my rapist and me, and had my scholarship moved to be independent of any department so I was able to continue my education. It’s because of Title IX that I was able to finish school.If Secretary of Education Betsy DeVos’ proposed rules, released on Friday, were in place when I was a student, I might not have ever graduated. DeVos’s proposed rules let schools off the hook for ignoring sexual misconduct that happen off campus. They state that schools are required to investigate and provide resources and accommodations if sexual violence and harassment occurs on campus, or in an area controlled by the school. My assault occurred at an off-campus apartment down the street from my school, outside of a university program and activity. That means that, under DeVos’s rules, my school wouldn’t have had to investigate my case, and they wouldn’t have needed to provide the support they did: to ensure I didn’t have to sit in class with my rapist, even though that caused me panic attacks; to provide me with the free counseling that helped me to finally finish an exam without crying; to move my scholarship, which was one of the only reasons I was able to graduate college and get a job.If these draft rules become law after the notice and comment period closes, more survivors will be forced out of school by harassment, assault, and their schools’ indifference to their complaints. Already, students who have experienced sexual assault are more likely to drop out of college; one study from 2015 found that rate was as high as 34.1 percent.DeVos’s proposed rules don’t help student survivors of sexual violence like myself, who struggle to continue their education. They don't help students accused of sexual violence much, either. That’s because DeVos and the Trump Administration aren’t interested in protecting students’ right to learn. They’re looking to reduce school liability. Under the Department of Education’s own projections, reporting on campus would fall 39 percent at colleges and university, and 50 percent in K-12 schools under DeVos’ proposed rules. With less than 15 percent of students reporting their sexual assaults to their schools, and colleges only conducting an average of 1.18 investigations into campus sexual misconduct a year, the last thing we need is to reduce reporting and investigations even further. If, by “bolstering the rights of the accused,” DeVos means \"silencing survivors and stopping them from reporting,\" then she will have accomplished her goal. If DeVos actually wanted to protect accused students (or survivors), like she has said she does, she’d follow in the footsteps of the Obama Administration: open investigations, issue findings, and demand changes. If DeVos was concerned with students’ rights, she would have enforced previous guidance on Title IX which provided more procedural protections to students accused of sexual violence than any other federal law.Instead, DeVos’s new rules remove the accountability measure that ensured prompt investigations. It requires schools to only address sexual violence or harassment if it completely denies a student access to education. That means students could be forced to endure repeated and escalating levels of abuse without being able to ask their schools for help. Under DeVos’ rules, schools can use unregulated mediation that allows for schools and rapists to intimate survivors into silence. Furthermore, the Department has offered absolutely no guidance on how schools should conduct these proceedings, making it even more likely that institutions will violate students’ civil rights. Finally, the rules would allow schools to impose a clear and convincing standard only for sexual harassment complaints, which would present another roadblock for survivors. Here’s the good news: DeVos’ anti-student proposed rules aren’t finalized yet, meaning there's still time to submit a comment against the rules. If you think schools should make sure all students get the support they need in school, regardless of whether their rape took place in the school bathroom or in at apartment down the street, join us. You have a voice. Take action. Sage Carson is the Manager of Know Your IX, a survivor-and-youth led project of Advocates for Youth, an organization that empowers students to end sexual violence in their schools.Get your horoscope in your inbox, every day."}