{"id": "Daily Horoscope: October 21, 2018", "paragraph": "Illustration by Amanda LanzoneThe moon in Pisces makes a helpful connection with Mercury, the planet of the mind and of communication, at 1:14 AM. The moon connects with power planet Pluto at 5:32 AM, stirring up deep emotions. The moon connects with lucky Jupiter at 7:47 PM, inspiring a generous atmosphere. All times EST.The moon in Pisces encourages you to focus on self-care today—which doesn’t always mean pampering yourself. Sometimes, it means doing something more difficult, like saying no to a friend who needs a favor when you need more time to yourself. The moon is in fellow water sign Pisces, finding you in a flirtatious and creativity inspired mood, Scorpio! It’s a powerful morning for communication, and tonight is especially romantic. The moon in Pisces lights up the home and family sector of your chart today, Sagittarius, finding you in a private and sensitive mood. Nostalgia arrives, but so do some realizations about the past. Communication is today's big theme, Capricorn, thanks to the moon in Pisces. A powerful conversation takes place early today, and exciting opportunities to network come tonight. The moon in Pisces activates the financial sector of your chart today, Aquarius, and you’re in a powerful position to expand your resources, especially as the moon connects with lucky Jupiter this evening. The moon is in your sign today, Pisces! Make time to connect with your emotions. This evening is an especially exciting time to start a new journey—new opportunities are coming your way. The moon is in dreamy Pisces today, Aries, so make time to unwind! Catch up on rest, read a great book, or binge-watch something wonderful. You’re in an emotional mood today—embrace your feelings, and take care of yourself. Many of your friends are people you can go years without seeing, yet reconnect with in an instant as if no time has passed. With the moon in Pisces today, it's an ideal time to reconnect with some old besties.Multitasking doesn’t help you stay focused, Gemini, but getting many things done at once is one of your talents—just don’t let having too much on your plate overwhelm you! Don’t overbook yourself today. You might be thought of as the homebody of the zodiac, Cancer, but that doesn’t mean you’re not up for an adventure—and tonight, an exciting opportunity comes your way. Because you’re so confident, people don’t understand how sensitive you can be. Today, don’t be afraid to ask for space if you need it, as you are processing many intense emotions. Having partners who are empathetic to your needs is so important to you, Virgo. Make time today to reflect on whether you’re getting the attention and affection you want—and if you’re not, ask for it!  What's in the stars for you in October?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}