{"id": "Central American migrants in caravan: We're coming whether Trump wants us or not", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.MAZATENANGO, Guatemala — The municipal sports stadium turned migrant shelter was packed in this town about 55 miles from the Mexican border. Hundreds of people — nearly all of them Hondurans — lined the concrete bleachers with only a wire fence to separate the men from the children and women.The smell of human sweat filled the stadium. Toddlers in diapers stumbled around the basketball court. Children just a few years older slept, passed out on blankets, despite the raucous noise echoing off the walls, exhausted from hours of walking.This is just one way station for the so-called migrant caravan now making its way toward Mexico, and ultimately, the United States. The caravan isn’t really a caravan at all, but a mass of around 4,000 people spread out over Guatemala who are blindly following those in front of them, making their way — some by foot, others by bus and car — to the Mexican border and, they pray, to the United States after that.“We left Honduras with a vision, a dream to have a house for my kids with a roof on it. A dignified life,” said Helena Gutierrez, who left the stadium in Mazatenango to walk to the Mexican border with her 5-year-old son and 14-year-old daughter.Like a lot of migrants in the group, Gutierrez is well aware of the U.S. policy of deterrence but is proceeding anyway. “We know Donald Trump doesn’t want us,” she said. “If he says he is going to close the border until next year, I am going to stay there. I am not leaving until they are open. We are going to stay there until he opens them. Until God touches the heart of Donald Trump.”MAZATENANGO, Guatemala — The municipal sports stadium turned migrant shelter was packed in this town about 55 miles from the Mexican border. Hundreds of people — nearly all of them Hondurans — lined the concrete bleachers with only a wire fence to separate the men from the children and women.The smell of human sweat filled the stadium. Toddlers in diapers stumbled around the basketball court. Children just a few years older slept, passed out on blankets, despite the raucous noise echoing off the walls, exhausted from hours of walking.This is just one way station for the so-called migrant caravan now making its way toward Mexico, and ultimately, the United States. The caravan isn’t really a caravan at all, but a mass of around 4,000 people spread out over Guatemala who are blindly following those in front of them, making their way — some by foot, others by bus and car — to the Mexican border and, they pray, to the United States after that.“We left Honduras with a vision, a dream to have a house for my kids with a roof on it. A dignified life,” said Helena Gutierrez, who left the stadium in Mazatenango to walk to the Mexican border with her 5-year-old son and 14-year-old daughter.Like a lot of migrants in the group, Gutierrez is well aware of the U.S. policy of deterrence but is proceeding anyway. “We know Donald Trump doesn’t want us,” she said. “If he says he is going to close the border until next year, I am going to stay there. I am not leaving until they are open. We are going to stay there until he opens them. Until God touches the heart of Donald Trump.”On Friday morning, Gutierrez and hundreds of others set out for the Guatemalan border town of Tecun Uman, where migrants have been gathering for days. “We are going to stay there until he opens them. Until God touches the heart of Donald Trump.”Things are getting desperate. On Friday, thousands crammed, shoulder to shoulder, onto a bridge into Mexico, but no one was being let in. The migrants broke out into sporadic chants of “si se puede.” Those who rushed the gate were greeted by tear gas canisters thrown by the Mexican Federal Police.As their calls went unanswered, some of the migrants began jumping from the bridge into the Suchiata River below, as there was no turning back once they reached the middle of the bridge. Meanwhile, hundreds of migrants roamed the banks of the river to see if they could find a place to cross without being apprehended. Mexican officials have said they will turn away anyone without a valid passport and a Mexican visa. That’s the case for most of the thousands of migrants who have arrived so far in Tecun Uman. In response, the Mexican government sent 300 additional federal troops to the Guatemalan border and asked the United Nations refugee agency to help process migrants seeking refugee status.Trump has threatened to pull aid from Honduras, Mexico and El Salvador if they didn’t stop the caravan. He has also threatened to punish Mexico if they don’t stop the migrants by pulling out of the newly signed trade agreement that replaces NAFTA.“With so many people, the authorities can’t do anything. They have to let us pass.”None of this seems to discourage the migrants still making their way to Tecun Uman, who seem quite aware of what awaits them but still think it’s preferable to what they’re leaving behind.Manuel Cano, 33, from El Salvador, said he saw the caravan as it was passing his house and decided to join with his family. He was carrying his 5-year-old daughter, Jocelyn, on his shoulders as he walked from Mazatenango toward Tecun Uman. He had tried to reach the United States in previous years before but failed to make it. Cano had recently heard Mexico was giving work visas to Central American migrants — a proposal Mexican President-elect Andres Manuel Lopez Obrador has floated. “With more people, we get braver,” he said. Cano had heard there were federal police waiting at the Mexican border, but he was undeterred. “You have to take a chance.” If the migrants make it into Mexico, President Trump has threatened to deploy military to the U.S. border, which he cannot legally do. He has also turned it into an issue in the upcoming midterm elections. “It’s going to be an election of the caravan,” Trump said at a campaign rally in Montana Thursday night.Most of the migrants, however, are completely disconnected from the news, and what they do hear comes from Facebook or via word of mouth. They don’t have money to charge their telephones, and they are following the people in front of them. Most have traveled for days, and the idea of turning back is not even a question.At the sports center in Mazatenango on Friday morning, where hundreds of migrants were taking shelter, about a hundred people lined up for breakfast on the basketball court. It’s more bread. But no one complains. The Guatemalans have been extraordinarily generous, the Honduran migrants say.Before dawn, dozens of people left the shelter en route to the Mexican border city of Tecun Uman. It’s only about two hours away by car, but most people are walking, at least for part of the trip. Nobody is quite sure how long it will take. By 7:30 a.m., the stadium is cleared out.“I saw it on the television and decided to join,” said Sandy Sarandino Mesa, 28. That was three days ago. “I had thought about coming before but didn’t have the opportunity. But as God gave us this chance, I decided to take advantage of it.”Sarandino said she worked in the coffee fields in Honduras as a seasonal worker, earning around $60 a week. She said her husband was killed by gang members three months ago. Like most people here, Sarandino has heard only rumors about what’s in store for them at the Mexican border. “I heard they are going to let us pass, but I’m not really sure.” Then, she repeated a refrain many migrants say: “With so many people, the authorities can’t do anything. They have to let us pass.”Cover image: Honduran migrants rush across the border towards Mexico, in Tecun Uman, Guatemala, Friday, Oct. 19, 2018. Migrants broke down the gates at the border crossing and began streaming toward a bridge into Mexico. (AP Photo/Moises Castillo)"}