{"id": "Protesters Showed Up to Louis C.K.'s Latest Set at the Comedy Cellar ", "paragraph": "Photo by Kevin Mazur/Getty Images for The Bob Woodruff FoundationIn August, disgraced funnyman Louis C.K. performed a surprise set at New York City’s famed Comedy Cellar, his first gig since admitting to masturbating in front of several women without their consent. He's continued to pop into the storied venue over the past few months, albeit always unannounced (which the club has caught flak for)—until Monday, when he had his first publicly advertised show there in almost a year.According to the New York Times, a handful of protesters were waiting outside to greet him, holding up cardboard signs at the entrance while folks waited in line to see him perform. “When you support Louis C.K., you tell women your laughter is more important than their sexual assaults and loss of their careers,\" one sign read. “Does this sign make you uncomfortable, Louie?” another asked.Apparently, the bearers of those two signs—Jennifer Boudinot, 37, and Lana McCrea, 27, respectively—asked people on their way inside to walk out of C.K.'s set, and a few did in fact leave the venue once he started performing, according to the Times.Most attendees stuck around, however, and even \"greeted him warmly\" when he took the stage.C.K. has mostly steered clear of addressing the allegations against him in his comedy, though he apparently made a vague reference to them during his two sets on Monday night, telling a joke about how you \"find out who your real friends are\" when you \"get in trouble.\" Then he reportedly moved on to more standard material, riffing on how much he likes ice cream and what it's like to think about your mom's sex life.According to the Times, the whole thing went over fairly well with the audience. But as McCrea saw it—echoing a number of standup comedians—it's still too soon for C.K. to be getting that kind of treatment.\"I can’t change whether or not Louis C.K. gets the comeback he so desperately craves yet has done nothing to deserve,\" McCrea, the legal director of SAFER Campus, which helps college students combat sexual violence, told the Cut. \"What I can change is whether or not he meets resistance. And I feel it’s my duty to resist. It’s about more than Louis C.K. It’s what we deem acceptable in our society, in our community. And what he did is not acceptable. Not by a long shot.\"Sign up for our newsletter to get the best of VICE delivered to your inbox daily.Follow Drew Schwartz on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}