{"id": "When Does BDSM Become Abuse?", "paragraph": "Tank Hafertepen. Photo via tankhafertepen.com In Instagram photos, Dylan Hafertepen, a master to five adult slaves, appears cartoonishly large, like a Tom of Finland sketch come to life. In one of his most iconic shots (since deleted from the gram) Dylan gives a military salute to the camera as his pups Chuck, Angus, Daniel, Biff and Tank pose around him. Some are wearing skin-tight jockstraps that barely contain their inflated ball sacks. Tank, whose given name was Jack Chapman, sits on Dylan’s right side, wearing a red bandana, with a padlocked chain around his neck. He’s beaming.To casual followers of Dylan’s account, known as “Noodles and Beef,” his relationship with his pups seemed to be kinky and playful. It wasn’t uncommon for fans (the account had over 60 thousand followers) to write Dylan, begging him to adopt them as their master, too. Dylan announced new additions to the family with theatrical flair. First, pups would earn training collars, then they’d be emblazoned with a tattoo above their butt cheeks, known as “Master’s brand.” He heralded the addition of Angus by writing in his newsletter: “He is mine. The news brought him to tears.” Angus responded floridly in the same newsletter, “I had been lost and confused before, unaware I was always yours, oblivious to my reason to exist.”Dylan’s pups had social media lives of their own, as well—which their master couldn’t always control. On Tumblr, Jack wrote long, anguished apologies to Dylan for not being the perfect pup. “Let’s get a few things established,” he wrote. “I am shit. I am a shit person. I do horrible and inexcusable things. I am dishonest. I am deceitful. I am a coward. I am stupid. I hurt my master.” His offense? Jumping into a hot tub with a friend. Jack’s social media posts came to the attention of a broad audience on Tumblr when he died on October 15th “due to a previously undiagnosed lung ailment.” That “ailment” was later revealed to have been caused by bits of silicone from a scrotal injection that had traveled to his lungs. (Dylan’s entire pup family were known to inject silicone in order to increase the size of their packages.) After his death, a contract that described Jack’s relationship with Dylan, originally posted on Jack’s Tumblr, was circulated online, describing a relationship in which Jack’s psyche, bank account, body and social life were under the complete control of his master. The contract even stipulated how big Jack’s body should be, saying that ”a pup will submit all orders for body modifications, including piercings, tattoos and scrotal saline inflation…in accordance to the wishes of master.”Dylan recently told BuzzFeed News that this contract was a piece of “a piece of erotic fiction written by Tank, featuring some of his submissive fantasies.” Still, it raised questions about what a loving, healthy BDSM relationship looks like and how observers could distinguish actual abuse from the simulated kind. Relationships between full-time, 24/7 masters and slaves haven’t been extensively studied in academia, with one exception. Back in 2006, researchers at the University of Ottawa and the Institute for Advanced Study of Human Sexuality surveyed 146 masters and slaves to understand how they negotiated power, role-playing, household chores and even money. The researchers wondered: how could slaves consent when they had given up all rights to participate in decision-making in the relationship? And were people  happy as slaves, long term? Some of the results were intriguing, if a bit mundane: the researchers found that male slaves were more likely to take out the garbage than female slaves, for example. Other findings were more illuminating: around three-quarters of slaves had engaged in behavior that seemed “inconceivable” at the start of their relationship, suggesting that “limit-pushing” was common. They also noted that many slaves felt satisfied in their current relationships and were free to leave. Financial independence was the norm, not the exception: only three respondents had no access to a bank account in their own names. Nonetheless, the researchers noted that abuse could easily masquerade as BDSM. “Some spousal abusers could use such arrangements to legitimize or otherwise find support for their abusive inclinations or intentions,” the article read. Slaves on the prowl for new masters, they noted, were “keenly aware” of this danger. Ellen Lee, an instructor of psychology at Ripon College, spent the last seven years studying the master slave community as part of “The Science of BDSM” research team based at Northern Illinois University. While she says contracts are common, they’re usually meant as a safeguard for all parties involved—and not as a carte-blanche method for masters to take full control over every facet of their slaves’ lives. “The goal is to iron out what people want and what they don’t want,” she says. “They’re used for people to think very carefully and thoroughly about the boundaries of their relationships.” Worryingly, in Jack’s supposed contract with Dylan, his salary was meant to be “relinquished to his Master,” who was supposed to ensure it would be securely saved. “I can tell you that with abusive relationships, one of the hallmarks is limiting access to financial resources,” says Lee. “Without money, they can’t leave. That’s not consent, that’s coercion.”Another part of Dylan’s contract allegedly stipulated that a pup’s social life must revolve around his master and that he should find contact with other people “pointless, unfruitful and unfulfilling.” This also seemed extreme to Lee. “Social and emotional isolation is another hallmark of abuse,” she said. In a healthy BDSM relationship, the submissive partner must have their needs met. The needs of the bottom come first, followed by the needs and wants of the person in authority, and, finally, the wants of the submissive partner. “If the person who’s submissive isn’t having their needs met, the relationship can’t get off the ground,” she says. Of course, two consenting adults can engage in any kind of dynamic they’d like—and master slave contracts are legally-dubious, having never been tried in U.S. court. Lee isn’t comfortable speculating about what kind of relationship Tank and Dylan had, but she says that the BDSM community could be a place for people to hide abuse. “And that’s why, largely, people in the community try to talk about safeguards, best practices and making sure others are aware that it’s inherently risky playing with these power extremes.” “We know assault and abuse happen in the kink community,” she says. “But I’d like to think they’re doing it better.” Sign up for our newsletter to get the best of VICE delivered to your inbox daily.Follow Steven on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}