{"id": "NYPD arrests 14 Jewish protesters outside Republican club where Proud Boys brawled", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.The NYPD on Tuesday arrested 14 Jewish protesters outside the Metropolitan Republican Club in New York, the scene of recent violence by a fascist street gang. The nonviolent protesters had gathered where the leader of the Proud Boys was invited to speak a few weeks ago, and a brawl ensued outside between his gang and several protesters of the alt-right group. The protesters outside the Club on Tuesday were there to call on the Republican Party to denounce white nationalism after the Saturday shooting at a Pittsburgh synagogue where 11 worshippers were murdered by a man who’d shared anti-Semitic and white supremacist comments online.Protesters were blocking the doors to the club and started a hashtag to #EndWhiteNationalism. They also laid banners on the ground to remember the people killed at the synagogue, ranging in age from 54 to 97 and including a married couple, a pair of brothers, and a doctor who treated AIDS patients before the disease had a name. The protest came the same time President Trump was en route to Pittsburgh to “pay respects” to the community mourning the massacre victims, even after scores of Jewish leaders in the city sent a letter to the president saying they didn’t want him to come until he renounced white nationalism.The NYPD confirmed that seven women and seven men were arrested and taken into custody but declined to provide additional comment as the arrested protesters were still being processed.The NYPD on Tuesday arrested 14 Jewish protesters outside the Metropolitan Republican Club in New York, the scene of recent violence by a fascist street gang. The nonviolent protesters had gathered where the leader of the Proud Boys was invited to speak a few weeks ago, and a brawl ensued outside between his gang and several protesters of the alt-right group. The protesters outside the Club on Tuesday were there to call on the Republican Party to denounce white nationalism after the Saturday shooting at a Pittsburgh synagogue where 11 worshippers were murdered by a man who’d shared anti-Semitic and white supremacist comments online.Protesters were blocking the doors to the club and started a hashtag to #EndWhiteNationalism. They also laid banners on the ground to remember the people killed at the synagogue, ranging in age from 54 to 97 and including a married couple, a pair of brothers, and a doctor who treated AIDS patients before the disease had a name. The protest came the same time President Trump was en route to Pittsburgh to “pay respects” to the community mourning the massacre victims, even after scores of Jewish leaders in the city sent a letter to the president saying they didn’t want him to come until he renounced white nationalism.The NYPD confirmed that seven women and seven men were arrested and taken into custody but declined to provide additional comment as the arrested protesters were still being processed.The NYPD fielded criticism after a brawl that happened outside of the Metropolitan Republican Club in Manhattan earlier this month. Cops arrested three anti-fascist demonstrators who were demonstrating against Proud Boy leader Gavin McInnes as he spoke at the club. Videos showed Proud Boys shouting homophobic slurs and physically attacking people near the club. Later, the NYPD began rounding up Proud Boys connected to the incident. So far at least six men have been arrested in connection with the violent incident. Police are still looking for at least three other Proud Boys as well as two anti-fascist protesters in connection to the incident.Cover image: Gili Getz. Disclosure: The Proud Boys organization was founded by Gavin McInnes, a co-founder of VICE Media. McInnes left VICE in 2008 and has not been involved in the company since."}