{"id": "Sons of the Pre-Apocalypse", "paragraph": "Image: Wally Skalij/Getty Images via LA TimesMy second son was born last week, right before two historic wildfires hit his new home state and burned whole cities to the ground. One burned about thirty miles west of the hospital he was born in, thickening the air with smoke, turning the sun deep red—we marked his first week anniversary by watching ash fall from the sky into our front yard. The other burned an hour and a half's drive north of where I grew up, of where my parents live, and reduced a town of thirty thousand people to embers so fast that the highway was left littered with abandoned and charred cars attempting escape, and dozens dead.Thanks to our justified eschatology fetish, these scenes inevitably get described as \"apocalyptic,\" present or post-. By that count, my son was born into pre-apocalyptic times, but only just. By plenty other counts, too.Naturally, my wife and I have been struggling with how to process the highs and lows of a week that began with a beautiful natural childbirth—surrounded by family and friends, elated by the arrival of a pure new human, and wonderful nurses, techs, and doctors, working diligently and thoughtfully to deliver and protect new life—and ended with a total inferno and mass evacuations outside our city, in a place we do afternoon hikes. It was confusing.As a new father who is also a Californian and on Twitter too much, how should I reconcile the swirling images that dominate a week like that?The questions pretty much ask themselves ('How can we raise kids in a world like this?', mostly), and it's hard not to think about that month-old UN climate report that concluded we basically have a decade to act before all this spirals out of control.No one wants to deliver a child into the onset of an apocalypse, but at least it's not certain yet whether these days just feel like the beginning of the end, or are. The end of something, anyway. What *is* certain: The fires burn worse every year. The climate is changing—the science has been crystal for so, so long—but you'd have to be worse than a dope to live in California and not just feel it intuitively now. The droughts are longer, the temperatures higher, the snowmelt lessened, the brush drier, the fires likelier, bigger, and better fueled.To me, and I imagine many Californians, the wildfires used to be something that'd seem to hit once or twice a year, in distant wilderness, or occasionally too near a subdivision, where they might claim some unfortunate houses built in the wrong place at the wrong time. Now they are an omnipresent existential threat. The two biggest fires in the state's history were both in the last two years. Ultra-wealthy Malibu is burning. Rural, retirement community-laden Paradise is burning. Santa Rosa burned. Ventura burned. It's all burning.Meanwhile, my newborn took his first nap on my chest, held his head up improbably, and smiled in his sleep.Isn't it a common sign of apocalyptic times that the leaders presiding over them are only interested in themselves, and in consolidating power by fanning fast-sprouting resentments, exploiting tragedy? The US president, a denier of climate change, couldn't bother to even extend his sympathies to our besieged state, babbling some brain leakage about \"bad forest management.\" And the congressman who was just reelected to represent the CA district home to smoldering Paradise \"doesn't buy\" that climate change is real. It all seems so bad.As if it's not enough that we're facing existential threats on multiple fronts, on a nearly incomprehensible scale, it was another reminder that so many of those with the power to address it still don't even believe in the catastrophe that is very clearly unfolding before all our eyes. This was always stupid, but when you're closing the doors to your house so your 5-day-old doesn't breathe in ash and wildfire smoke in the middle of one of the nation's biggest cities, it seems criminal. Through it all, the newborn is peaceful, unfussy, and happy spending hours in his little mechanized swing between nursing.Throughout the week, I thought about the night Trump was elected, when my wife and I sat dumbly awake, wracked into the early hours of the morning. The question came up, as I imagine it did for many, like one of those triangular rubbers to the knee: So do we move or something now? Our first son was months old then, and I joked at the time that no, the rebellion against five-term Emperor Trump was going to need good people.It wasn't really funny then, but it's probably more true now. Climate change-acknowledging Democrats took back the House, but power is still bent on denial. And so much of the country is waving the flag for the deniers.So it is certain that my kids are going to come of age in a world that is rapidly warming and rapidly changing—that is literally more on fire—but also in a country that in a given year may or may not be governed by politicians in stark denial of those changes. When I started covering climate change ten years ago, the GOP candidate for president had a climate plan—now, the notion that that we all, Democrats and Republicans alike, might unite to inadequately address global warming with market-based solutions seems like a hopeless utopian dream.But I'm not writing all this because I'm despairing or fuming, though both are part of the mix. I'm writing this for a maybe cheesily optimistic reason, but I will take cheesily optimistic and I will cling to it with a bloody deathgrip right now.Last night, my firstborn son was sitting in his high chair, the little one was swinging quietly in that chair at our feet, and a Daft Punk song came on the stereo. The two-year-old, who was eating pasta noodles, abruptly started dancing in his chair so excitedly he couldn't land his fork on the noodles (he was still trying to eat, of course). He looked at me and my wife, expecting us to dance in our chairs, too, because obviously why would anyone not be dancing when Daft Punk comes on when you are eating spaghetti. We did, because you always do what the two-year-old wants in situations like this. We danced, and the baby swung contentedly in his swing. It was one of those perfect moments they say having a family is all about ('they' being me, a person who has seen the Steve Martin movie Parenthood.)I had this feeling, this dumb, perfect feeling, that lasted until later in the night, when it occurred to me that the scene might have helped me locate where hope might spring. Nearly everyone has had that moment, whether we remember it or not, and probably lots of them, when we were nothing but conduits of joy and goodness and also wanted nothing more than to share that with someone else. Who fucking cares if we were two, or three, or five or eight. We were human, and we were capable of that. There is a way, lodged somewhere deep down there, beneath our cantilevered structures of long-encrusted ideologies, to relate a base capacity for joy and goodwill.It made me think of that line Anne Frank wrote that still to this day destroys me if I linger on it too long, about how in spite of everything, she still believes people are basically good at heart. I believe that too, even if I also believe a few of them that hold the most power are too far gone. But many who admire them are not.My sons are going to live in cities on fire, in nations led by men who don't care, and they are going to have to learn to help tackle the problem, as we are. If I can in any way help them tap into that capacity that I felt last night, if they can help me, and if others can—and if that relation can help topple power in denial—then maybe we can sustain this pre-apocalypse, whether it takes another blue wave or nine, a political revolution, mass psilocybin hallucinations, or something else. If we can relate that goodness where applicable and confront power whenever possible, my sons may not have to live their adult lives in omnipresent fear of fires.People are basically good, power corrupts but is not de-corruptible, and there is a lot of work to do.At least, that's what gave me hope that week as I watched the world burn, literally and figuratively, but mostly literally, as my beautiful new ward eked out his being amongst the smoke.Sign up for Motherboard Premium."}