{"id": "Congress has two ways it might try to save Mueller. Both have huge downsides.", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.A number of Senate Republicans have long argued that there’s no need for any fancy new legislation to protect special counsel Bob Mueller’s Russia investigation, because President Trump was never  really going to fire him.Then Trump swapped his old attorney general, Jeff Sessions, last week for Sessions’ deputy, Matthew Whitaker, who’s been openly hostile to the probe. That was enough to prompt some influential lawmakers to say the time has finally come to try to force Congress to act. But not all of them. On Wednesday, Senate Majority Leader Mitch McConnell blocked a bill designed to protect Mueller from being fired, saying he still doesn’t see any real need for it. Arizona Sen. Jeff Flake, who unsuccessfully tried to bring the bill to the floor, also made a threat to hold up judicial nominations until Mueller is protected. “I have committed not to advance any more nominees to the Judiciary Committee,” Flake said on Thursday. “They will not receive my vote. And with the margins we have in the Judiciary Committee, it means they will not move forward. Also I will not vote for any who come to the floor.”Flake can do that because he’s a key vote on the Senate Judiciary Committee. If he decides to vote against moving a nomination forward, and all the Democrats on the committee join along with him, he can effectively shut down the pipeline of nominees. A number of Senate Republicans have long argued that there’s no need for any fancy new legislation to protect special counsel Bob Mueller’s Russia investigation, because President Trump was never  really going to fire him.Then Trump swapped his old attorney general, Jeff Sessions, last week for Sessions’ deputy, Matthew Whitaker, who’s been openly hostile to the probe. That was enough to prompt some influential lawmakers to say the time has finally come to try to force Congress to act. But not all of them. On Wednesday, Senate Majority Leader Mitch McConnell blocked a bill designed to protect Mueller from being fired, saying he still doesn’t see any real need for it. Arizona Sen. Jeff Flake, who unsuccessfully tried to bring the bill to the floor, also made a threat to hold up judicial nominations until Mueller is protected. “I have committed not to advance any more nominees to the Judiciary Committee,” Flake said on Thursday. “They will not receive my vote. And with the margins we have in the Judiciary Committee, it means they will not move forward. Also I will not vote for any who come to the floor.”Flake can do that because he’s a key vote on the Senate Judiciary Committee. If he decides to vote against moving a nomination forward, and all the Democrats on the committee join along with him, he can effectively shut down the pipeline of nominees. Flake’s power move strikes at the heart of Senate Majority Leader Mitch McConnell’s goals in this congressional term: getting as many conservative-leaning judicial nominees on the bench as possible. The issue here is that there are limits to Flake’s power. For one, while this would be unprecedented, judicial nominations can be moved to the floor without receiving a majority of support from the committee. Flake said such a move was rare and unlikely.“I don’t think that’s ever been done with circuit or district court nominees because that sets a precedent that you are just going to set aside the committee’s business,” Flake said. “And I can tell you no chairmen in the Senate are going to be comfortable with that precedent.” Chairman of the Senate Judiciary Committee Chuck Grassley, also noted that a move like that would be unlikely and pointed out that there are a lot of nominees that have already been moved out of committee and are awaiting a vote on the Senate floor. Though Flake has also threatened to withhold his vote from any judicial nominees on the floor, without a Republican friend in the Senate willing to do the same, it is likely nominations will still move through. And either way, his threat is short-lived: Flake’s time in the Senate ends on January 3.On the other side of the aisle, Democrats have options to protect Mueller with the power of the purse. A chunk of government funding runs out in December, which provides another leverage opportunity — if Democrats are willing to use it. On CNN earlier this week, Senate Minority Leader Chuck Schumer said that if acting Attorney General Whitaker didn’t recuse himself, Democrats would “attempt to add to must-pass legislation, in this case the spending bill, legislation that would prevent Mr. Whitaker from interfering with the Mueller investigation.” People on both sides of the aisle seemed somewhat open to this idea.“I support legislation that protects Mueller whether it makes it into the appropriations bill which is being discussed or some other way,” said Sen. Bob Corker, Republican of Tennessee.But playing with the appropriations process has often been politically dicey for the party that tries it. If Democrats are serious about trying to protect Mueller through a government spending bill, that could lead to a partial government shutdown, and no party wants to be blamed for that. “The party associated with shutting down the government usually pays the political price,” said William Moschella, the former head of Justice Department legislative affairs office during the George W. Bush administration. Republicans, for example, largely took the blame for shutdowns in 1995 and 1996 under former President Bill Clinton in conflicts over federal spending — while Clinton’s approval ratings rose.“Holding judges hostage, or appropriations bills hostage, is rarely effective,” Moschella said. “And even if those moves do get Congress to act, whether the president would sign any such legislation would also be pretty doubtful.” Cover image: FBI Director Robert Mueller listens as he testifies on Capitol Hill in Washington, Thursday, June 13, 2013, as the House Judiciary Committee held an oversight hearing on the FBI. (AP Photo/J. Scott Applewhite)"}