{"id": "Andrea Bocelli's vices are really virtues ", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.LOS ANGELES — To describe Andrea Bocelli's touring schedule as demanding would be an understatement. The renowned Italian tenor is on the road with a crew of handlers and publicists larger than some startups. And he'll be touring his new album \"Sî\" — his first in 14 years — in the U.S. and Europe from now until 2020.\"I try my hardest to avoid routine,\" Bocelli said. But as much as he might mix it up —playing opera houses and arenas around the globe and dueting with the likes of Dua Lupa — there's one routine he can't avoid: \"In general, unfortunately, when I'm on tour, I have to stay pretty much shut in my room because I have to guard my voice so that I don't catch a cold. And so I take the opportunity in these instances to read books. And if I’m at home, to let my imagination run wild.\"Home would be his family's farm in Tuscany, where he drinks wine from their 200-year-old winery, reads, and rides his eight horses.We met up with the 60-year-old singer in LA, and after delivering a few notes from the classical opera \" Carmen\" by Bizet on his platinum flute (we were not allowed to touch it under any circumstances), he told us about how costly eight horses can get, and what he's learned since the first time he sang in front of an audience.As a young man singing an \"old\" style of music, Bocelli learned something that's stuck with him for decades. \"The important thing is not to decide what is good, or what is not good to sing. The important thing is singing what you sing well.\"LOS ANGELES — To describe Andrea Bocelli's touring schedule as demanding would be an understatement. The renowned Italian tenor is on the road with a crew of handlers and publicists larger than some startups. And he'll be touring his new album \"Sî\" — his first in 14 years — in the U.S. and Europe from now until 2020.\"I try my hardest to avoid routine,\" Bocelli said. But as much as he might mix it up —playing opera houses and arenas around the globe and dueting with the likes of Dua Lupa — there's one routine he can't avoid: \"In general, unfortunately, when I'm on tour, I have to stay pretty much shut in my room because I have to guard my voice so that I don't catch a cold. And so I take the opportunity in these instances to read books. And if I’m at home, to let my imagination run wild.\"Home would be his family's farm in Tuscany, where he drinks wine from their 200-year-old winery, reads, and rides his eight horses.We met up with the 60-year-old singer in LA, and after delivering a few notes from the classical opera \" Carmen\" by Bizet on his platinum flute (we were not allowed to touch it under any circumstances), he told us about how costly eight horses can get, and what he's learned since the first time he sang in front of an audience.As a young man singing an \"old\" style of music, Bocelli learned something that's stuck with him for decades. \"The important thing is not to decide what is good, or what is not good to sing. The important thing is singing what you sing well.\"His album “Si” is out now via Decca (UMO) (Classics).This piece originally aired on HBO's \"VICE News Tonight\" on Oct. 25, 2018. "}