{"id": "Antarctic Researcher Allegedly Stabbed Colleague Who Spoiled Book Endings ", "paragraph": "Photo via wikimedia commons.This article originally appeared on VICE Canada.Sometimes when someone spoils a book for you, all you want to do is grab a big knife, pounce on them, and stab them in their spoily little chest while shrieking, “I DON’T CARE IF THE WHALE WAS A SYMBOL OF THE NATURE OF TIME. I DIDN’T WANT TO KNOW THAT AHAB DROWNS” or something.For most of us this would be nothing but a fantasy, however, if you spend enough time locked away with your consistently spoiling nemesis in an icy hell world, well, it may just become a reality.That’s what seemingly happened when, on October 9, a 54-year-old electrical engineer named Sergei Savitsky allegedly stabbed Oleg Beloguzov, a 52-year-old welder, in the chest multiple times. Both were working out of Bellingshausen station, a remote station on an Antarctic island—Savitsky was reportedly drunk out of his mind at the time.Beloguzov, whose heart was injured in the stabbing but is expected to recover, was rushed to the hospital in Chile whereas Savitsky, who voluntarily surrendered, was housed in a church for ten days until he was flown back to Russia. According to several media reports, the final straw for why Savitsky stabbed Beloguzov several times was that he suggested he dance on a table but relations between the two had been tense for some time.One of the causes for that tension, it seems is the welder wouldn’t stop spoiling the ending of books for Savitsky. According to the UK’s Sun newspaper, both Savitsky and Beloguzov were avid readers and used the written word to pass time on the bottom of the world.The two researchers were spending time at the Bellingshausen station for about half a year before Savitsky allegedly stabbed Beloguzov. It has been previously reported that the whole plunging a knife into his colleague's chest was something that almost certainly extended from the fact they spent such extensive time together. This was neither of the men’s first time station to Bellingshausen nor their first stationed together.Just to give you a feel for what Bellingshausen station is like, it only gets about 24 days of sunlight a year. It’s located on King George Island which has some of the mildest weather on the continent but still averages 1.6 degrees Celsius [35 degrees Fahrenheit] during its warmest month. The station is made up of 15 small one-story buildings. It can house up to 40 people at one time—only 14 people were taking part in this particular expedition.As we know the Antarctic is one of the most isolated places on the planet and so the quality of your cohabitants becomes abundantly clear rather quickly—this is something that’s been explored in popular media time and time again. There has been other, shall we say, shenanigans on the continent. This includes a mysterious, maybe self-inflicted poisoning; A doctor burning down his research station as a way to avoid the winter; A disagreement that escalated into a hammer fight in 1996; A person becoming so violent they had to be locked in a storage locker for months.It’s almost like extreme isolation and darkness is bad for a person’s psyche.Because of the unique setting of the crime, the aftermath of the attempted murder was likewise handled rather oddly. After allegedly attempting to kill his colleague, it was reported that Savitsky voluntarily surrendered and was held in the nearby church—that is, to put it mildly, fucking terrifying and almost assuredly haunted—one of its main functions is to provide funerals for those who die on the continent.The Trinity Church, which is the only permanently staffed Eastern Orthodox Church in the Antarctic, has only been around since 2004 but it’s built in traditional Russian style. The church is manned by two priests who essentially worked as Savitsky’s guards for ten days until he was brought back to Russia.It is believed that Savitsky is the first man charged with attempted murder in Antarctica's history—if you commit a crime in the deep, deep south you are punished according to your home countries laws.   Sign up for our newsletter to get the best of VICE delivered to your inbox daily.  Follow Mack Lamoureux on  Twitter.Sign up for the best of VICE, delivered to your inbox daily."}