{"id": "Vegan Fined $1,025 for Threatening to Stab Mom Over Simmering Meat Sauce", "paragraph": "Photo: Getty Images Imagining opening the door to your apartment, and following your nose straight into the kitchen where your mother is making a slow-simmering ragu Bolognese from the kind of traditional recipe that has probably never been written down. What do you do? Do you ask if she wants you to scrape the browned bits from the bottom of the heavy pot? Do you pick up her worn wooden spoon to get an in-progress taste? Or do you threaten to stab her in the stomach because GODDAMMIT, WHAT’S WITH THE MEAT, MA?  According to  The Telegraph, a woman in Modena, Italy, went with the latter, because she’s vegan and apparently believed that her mother should’ve known better than to cook animal flesh in her presence. The unidentified woman went into a straight-up rage because of the Bolognese, upset that her nasal passages had been exposed to animal products. She picked up a kitchen knife and reportedly shouted (the equivalent of): “If you won’t stop on your own then I’ll make you stop! Quit making ragù, or I’ll stab you in the stomach!”  The unemployed 48-year-old reportedly told the court that it had been ages since she’d had “sensory or olfactory contact” with meats—at least until she moved back in with her mother. (Consequently, her mother said that this wasn’t the first time that her daughter had gotten aggressive about butter, cream, milk, or meat.)  The woman’s mother seems to make from-scratch meals in the tradition of the  rezdore. Modena is part of the Emilia-Romagna region of northern Italy, where previous generations grew up with a  rezdora, a local term for a Boss Bitch who managed the home, kept her family in line, and also managed to make her own pasta.  “The  rezdora was not simply ‘the housewife,’ but represented so much more,” Italian magazine  Non Solo Buono wrote. “Following changes in society and the disappearance of the traditional peasant patriarchal family, the  rezdora as described is disappearing, but the term is still used to indicate a good wife and a great cook. The rezdora is a mythologized, beloved figure, sometimes envied by those who don’t have one at home anymore.”  But, sometimes the  rezdora is threatened with a knife because of her Bolognese sauce. Attorneys for both sides had tried to mediate this case for the past two years, with no success. A judge ultimately ruled in favor of the mother, and ordered the younger woman to pay a €400 ($456) fine and €500 ($570) in compensation. If she hasn’t done it already, now’s probably a good time to move out, too. Subscribe to Munchies."}