{"id": "Everyone Is Incredibly Angry at This Silicon Valley Exec's Daily Routine", "paragraph": "This is not the woman from the Business Insider article, it's a stock photo from GettyMelania Edwards, a heretofore completely unknown banking executive from the Bay Area, is taking the internet by storm, or maybe vice versa. She's been called a \"replicant\" and compared to the protagonist of American Psycho because Business Insider published a diary-type breakdown of her daily routine, which includes a 5:30 wakeup time, a 7:30 tennis game, a day full of meetings and conference calls, a 90-minute lunch, yoga, and an evening walk with her boyfriend the pair spends \"reflecting upon our key wins and challenges and preparing for the adventures of the next day.\" The article ran on Thursday and Twitter has spent the ensuing 24 hours passing it around—according to users it is \"parody level,\" \"totally fake,\" \"the most amazing thing i've ever read,\" \"a perfect article from start to finish,\" and \"seems directly ripped from a textbook for intermediate-level ESL students.\"With its ready-for-powerpoint prose and vaguely stock image-y photos, the piece is precisely the kind of thing that worldly Twitter users—the sort who imagine they are bohemian for getting fucked up and watching Netflix—look down upon. It is unapologetically earnest and real in a way that makes it seem fake, a portrait of someone who (apparently) does all the things you're supposed to do: juice! Meditation! Working for charity! Yoga! Trying out new recipes! Most of us fail to do these things in any consistent way and figure that everyone else also fails. Well, here's someone who (again apparently) actually sticks to all of those habits, and has invited Business Insider to document herself sticking to them. The backlash is one part envy, one part political anger at someone who works in the maligned industries of tech and banking, and one part rubbernecking at a bizarrely mundane article. Though this piece caught the imagination of a subsection of the clicking-on-things public, Business Insider runs these \"day in the life\" diaries frequently, and like happy families they are all fucked up in exactly the same way. The subjects, most of whom work in finance, wake up early, usually work out, go to a job that involves sitting in front of a computer interspersed with meetings, eat food, and well, that's pretty much it. When describing what it's like to work at Amazon, they say things like, \"This sounds a bit cliché, but it ties back to our leadership principles and our culture of innovation.\" Very often, there is a weird fixation on the food they eat (usually at a company canteen of some kind). Sometimes, the subjects are famous people; once it was President Barack Obama.There is a kind of purpose to all this, at least if you are the sort of person who wants to know what it would be like to be a JP Morgan intern or a private banker at Credit Suisse or a flight attendant. Maybe you are considering these sorts of careers and want to know what they're like, or maybe you're just the type who peeks into other people's houses whenever you get the chance. The wider genre of daily diaries, where people recount everything from their sex lives to how they spend their money, is thriving, probably because we can't help but want to muck around in the lives of others. Facebook posts and Instagram stories only tell us so much. We want the grit-under-the-fingernails details of the unknowable strangers who make up the world: What do they eat when they're all alone? What do they buy compulsively late at night? What grubby little fantasies do they conjure up to fill their commutes, and do they converge with ours?Business Insider's diaries are on the tame side, of course. There are no dark secrets uncovered by following around a banking executive around for a day, except, perhaps, the dark secret that people in the tech industry really do say things like \"key wins\" with a straight face and probably don't quite understand why all you little shitheads are giggling about it. If the sum total of Melania Edwards's day seems so bizarre to so many of us it's because all of our days are bizarre—everyone is the star of their own movie, and most of those movies make no damn sense and are boring besides. It's something I'll be reflecting on as I take my daily walk through my tree-lined neighborhood this evening. Follow Harry Cheadle on Twitter. Sign up for the best of VICE, delivered to your inbox daily."}