{"id": "Anti-Islam extremist Tommy Robinson is trying to hijack the British army", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.LONDON — Near the end of his speech to about 1,000 rowdy supporters in central London last week, the British far-right activist known as Tommy Robinson digressed from one of his familiar tirades against Islam to push a different cause: his petition to “Stop the political witch hunt against British troops.” “I hope it gives a voice to members of our armed services, past and present,” he told the flag-waving crowd, vowing to deliver the petition to the prime minister.Robinson, real name Stephen Yaxley-Lennon, is best known for his hate-filled speeches against Islam, from organized street protests to his rabble-rousing dispatches as an “alternative journalist.” But this petition signals a different approach: An explicit push to hijack veterans’ issues, in a bid to cultivate support for his extreme politics among current and former soldiers.“He’s hijacking a non-controversial topic and using it as a way of broadening his appeal.”The effort has raised fresh concern about extremism in the British Army, and caught the attention of military officials. Radicalization experts worry that Robinson’s push to court active and former soldiers comes at a particularly toxic time, as the military grapples with budget cuts and falling morale, presenting a potential recruitment ground for extremist movements looking to exploit their grievances. Moreover, their specialized military training means that radicalized soldiers present a greater national security risk than civilians. LONDON — Near the end of his speech to about 1,000 rowdy supporters in central London last week, the British far-right activist known as Tommy Robinson digressed from one of his familiar tirades against Islam to push a different cause: his petition to “Stop the political witch hunt against British troops.” “I hope it gives a voice to members of our armed services, past and present,” he told the flag-waving crowd, vowing to deliver the petition to the prime minister.Robinson, real name Stephen Yaxley-Lennon, is best known for his hate-filled speeches against Islam, from organized street protests to his rabble-rousing dispatches as an “alternative journalist.” But this petition signals a different approach: An explicit push to hijack veterans’ issues, in a bid to cultivate support for his extreme politics among current and former soldiers.“He’s hijacking a non-controversial topic and using it as a way of broadening his appeal.”The effort has raised fresh concern about extremism in the British Army, and caught the attention of military officials. Radicalization experts worry that Robinson’s push to court active and former soldiers comes at a particularly toxic time, as the military grapples with budget cuts and falling morale, presenting a potential recruitment ground for extremist movements looking to exploit their grievances. Moreover, their specialized military training means that radicalized soldiers present a greater national security risk than civilians. “If you think about the tools of the trade that soldiers have, their skills and knowledge, recruiting them to far-right groups or terror organizations makes them a heightened security risk,” said Jacob Davey, research manager at the London-based counter-extremism think tank the Institute for Strategic Dialogue. “This is something we should be concerned about, and it’s certainly something the military should be paying close attention to.”The catalyst for Robinson’s latest campaign was a reportedly chance encounter at a gas station last month, when the 35-year-old bumped into a group of soldiers in camouflage, then posed for selfies and videos of the troops cheering and chanting his name.When the embarrassing footage hit the media, the army responded by denouncing Robinson’s ideology and launching an investigation. One of the soldiers, who had committed previous disciplinary breaches, was discharged, while the others were disciplined for breaching army rules prohibiting political activity.Robinson pounced on the backlash, and launched a petition calling on the chief of the defense staff to “call off his dogs,” framing the issue as a case of elites kowtowing to PC culture and Muslims.He calls the campaign “I am Soldier X,” and it seems to have found an audience. Robinson, who did not respond to VICE News’ requests for comment, claims the petition has nearly 190,000 signatures. One group, Veterans Against Terrorism, has swung in behind the campaign, while supporters, many purporting to be current or former soldiers, have tweeted the #IAmSoldierX hashtag more than 65,000 times and posted more than 1,000 pictures with the hashtag to Instagram.Besides appealing to soldiers and veterans, championing military causes helps Robinson to soften his image and build a more mainstream political brand, said Davey.“It’s a classic Tommy Robinson campaign,” he said. “He’s hijacking a non-controversial topic and using it as a way of broadening his appeal, increasing his support base and bringing more people on board with his anti-Muslim ideology.”The campaign has since morphed into a more nebulous platform for disaffected soldiers or veterans to express their grievances with the government — from military funding cuts, poor conditions in barracks, and lack of support for vets, to more-political complaints, such as a perceived failure to confront Islamic extremism at home.“There is a lot of support for him,” claimed Will Murray, a 20-year-old soldier who, unlike most of his peers supporting the campaign, did so without concealing his identity. Despite the army warning against displays of support for Robinson, and the disciplinary action against the original group, Murray said he has not been disciplined for his stance.The army and mainstream veterans groups have long rejected the overtures by Robinson to co-opt their cause. Hugh Milroy, chief executive for the charity Veterans Aid, told VICE News he denounced attempts like Robinson’s to politicize veterans causes, and said his organization had previously received threats from far-right groups for refusing to endorse their campaigns.For its part, the army has signaled a zero-tolerance approach to far-right ideology, which it describes as “completely at odds with the values and standards of the Army.” “We have robust measures in place to ensure those exhibiting extremist views are neither tolerated nor permitted to serve,” a military spokesman said in a statement.  READ MORE: Tommy Robinson is out of jail — and on Fox NewsBut Robinson’s supporters are pushing a different story, and claim there are synergies today that make soldiers a natural audience for Robinson’s brand of hard-line nationalism.“It’s the fact he will address what many others are treating as too difficult to address,” said Martin Evans, a 51-year-old veteran of 24 years in the British army “Tommy’s got half the army on his side,” claimed Jeremy Spencer, a former member of the territorial army, who had traveled from Shropshire to attend last week’s London rally.Despite Robinson's boasts, it’s hard to gauge how widely his views are shared across the military. Research into the extent of far-right sympathies in the armed forces is patchy, said Davey, and regulations prohibiting serving soldiers from political activity typically keep their views hidden from public view.Robinson’s flirtation with the military is hardly new. He’s described the EDL — the anti-Islam, far-right street movement that he co-founded in 2009 — as having been “created in defence of our armed forces.” The group emerged from a movement opposed to Islamist radicals who were protesting the homecoming of British soldiers from Iraq in Robinson’s hometown of Luton. The EDL’s support surged four years later when Islamist extremists brutally murdered off-duty soldier Lee Rigby on a London street. In response, Robinson organized protests across the country channeling public anger over the killing. He claimed to have widespread support from among the armed forces, who he said were outraged by the Islamic fundamentalists they fought overseas killing one of their own on home soil. “We’re the only ones that dare speak up against Islamist ideology,” said Robinson.Robinson has since split with the EDL, but the group is still active, and today claims an “Armed Forces Division” with more than 13,000 followers on Facebook. Another street protest movement, Veterans Against Terrorism — established in the wake of last year’s Manchester terror attack — has more than 16,000 members in its closed Facebook group and has swung its support behind Robinson’s campaign.That campaign is taking place in an increasingly radicalized British climate, experts warn. Five years on from Rigby’s murder, far-right extremism has soared, fueled by a string of terror attacks last year. And Robinson’s power, and reach, as a far-right agitator has greatly increased, growing a sizeable American support base that has resulted in an invitation to speak at the U.S. Congress this month.While his movement is considered by extremism experts to be on the less threatening end of the British far-right spectrum, his anti-Islam propaganda has been linked to far-right terrorism. British authorities say Darren Osborne, who killed a man and injured nine when he drove a vehicle into a crowd of worshipers outside a London mosque last year, had voraciously read Robinson’s propaganda in the weeks leading up to the attack.Even more concerning, said Davey, are the apparent military links to violence-oriented groups on the more extreme end of the spectrum, such as the banned neo-Nazi terror organization National Action. One former army reservist has admitted to belonging to the group; another member was accepted into the army despite having allegedly acted as a recruiter for the group on social media.And a serving soldier, Lance Corporal Mikko Vehvilainen, was jailed earlier this year for possessing a banned canister of tear gas; during the trial, the court heard that he was an unrepentant racist, kept a stockpile of weapons and Nazi paraphernalia, and had penned a draft of an extremist magazine he had entitled Extinction.While the Ministry of Defense said official figures on the number of soldiers dismissed for extremism weren’t available prior to publication, estimates put the figure at 5 for 2016-17. There are more than 81,000 full-time soldiers in the British army.The push to appeal to soldiers displayed a common recruitment strategy among extremists: exploiting grievances and vulnerabilities, which were often in ample supply within veteran circles. The trend also reflected the “cumulative radicalization” of the current British political landscape, where Islamist and far-right groups were helping to fuel each other’s extremism through their provocations, Davey said.“There is no doubt whatsoever in my mind that the two ideologies, both perverse, are feeding each other.”Britain’s top counter-terror officer, Assistant Commissioner Neil Basu, acknowledged that reality last month when he told Parliament that the number of live terror investigations in the country had hit a record high of 700. While the overwhelming threat still came from Islamist extremists — the focus of about 80 percent of investigations — a significant portion of the rest came from the growing extreme-right threat. Soaring religious hate crime stats — up 40 percent year-on-year, according to government figures released last month, with more than half directed at Muslims — captured the increasingly radicalized climate, Basu said. The Home Office attributed the rise in anti-Muslim hate crimes to a response to a string of terror attacks on British soil last year. Rising far-right activity in Europe had also fueled British extremism, he added. “There is no doubt whatsoever in my mind that the two ideologies, both perverse, are feeding each other,” Basu said.Cover image: Far right activist Stephen Yaxley-Lennon, who goes by the name Tommy Robinson, speaks to supporters as he arrives to face contempt of court charges at the Old Bailey in London, Britain, October 23, 2018. REUTERS/Henry Nicholls"}