{"id": "James Carville tells us what it will take to turn Texas blue", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.The suggestion that Texas could turn blue any time soon makes most seasoned political pros scoff. It's nothing but a perennial Democratic fantasy, a fever dream, they’re likely to say. That’s the conventional wisdom. But to legendary political consultant James Carville, demographics is destiny. And in Texas, he sees a day coming soon when Democratic dreams will come true. “Texas is much like America: It has demographic changes that are taking place,” Carville says. He points to the division among white voters along fault lines of education and gender, which is growing wider. Moreover, the state, like much of the nation, is becoming more urban. Both trends, he argues, favor Democrats. “There is a bucket-load of college-educated white women in Texas as a proportion of the electorate, which is really turning out to be almost a Democratic base,“ Carville says. The trend is only accelerating with Rep. Beto O’Rourke’s emergence as a Senate candidate. No matter what happens on Election Day, Carville says, O’Rourke’s youth and energy are a game-changer for Texas Democrats. “We’re going to have BB and AB: Before Beto and After Beto. Beto’s going to be one of those rare people in politics that even if they lose, their impact is going to be pretty dramatic.” Will it happen? It’s been said so often that it's practically a cliché: It all depends on turnout. Carville points to the suburban areas around the major cities where demographic shifts are happening fast, along with the traditional Democratic base in places like the Rio Grande Valley, as the places to watch. If not this time, when it will happen is a little trickier. “There are people who have an algorithm that says Texas is going to turn blue on October the 11th and 11:32 a.m., precisely. I mean, who knows? But I think it’s probably going to be a little bit quicker because you just see this divide among whites by education, and particularly by gender.”This segment originally aired November 1, 2018 on VICE News Tonight on HBO."}