{"id": "An Interview in a Nail Salon with Leikeli47 About Her New Album ‘Acrylic’", "paragraph": "It’s a brisk and wet Tuesday morning in Bed Stuy, and Leikeli47 is sitting in a nail salon, with a new pink manicure drying under a lamp. Today is election day, so the November chill is compounded by a feeling of tension. Still, the rapper radiates warmth, smiling through her black bandana with ragged cutouts at the eyes and mouth.At points, she apologizes to the nail tech, Luz, for continuously messing up her thumb nail. Her disposition is blunt but laced with traces of Southern hospitality—the seeming biproduct of Brooklyn and Virginia, both places she calls home. When she’s serious, though, she doesn’t mince her words. “Music is what I do and if I want to be an 80-year-old entertainer, I dare you to say something,” she says. “We have this thing in the entertainment industry where we’re supposed to stop or retire. What do you mean? I never want Stevie Wonder to stop. I never want D’Angelo to stop. I never want Jay-Z to stop, like ever.”To the other women in the nail salon, this probably sounds like typical barbershop talk, though it’s anything but a tangent for the rapper, who released her sophomore album,  Acrylic, this November. Leikeli has thought a lot about the legacy she wants to leave and how often artists of color are robbed of one. “Aerosmith can do it,” she says, pointing to the 70s rock band’s upcoming 2019 tour. “Led Zeppelin can do it. Red Hot Chili Peppers are one of my favorite bands, and they still do it. N.E.R.D is one of my favorite bands also, and they still deserve to do it.” On stage and off, Leikeli is an advocate for black visibility. It’s an ironic message coming from an artist who still hasn’t disclosed her age, name, or face, but that doesn’t stop its meaning from being urgent.Leikeli weaves motifs of black life throughout her music, imagery so ubiquitous that it could easily take place in Bed-Stuy, Houston, or Oakland. The characters of her stories are hustlers—like the neighborhood “candy lady,” or the survivors of an unfair world who find solace in the aisles of beauty supply stores. Her debut album  Wash & Set, which came out last year, features the rite-of-passage when black girls graduate from colorful barrettes to billowing curls set under hellishly hot dryers.  Acrylic offers another snapshot of black life, one that comes at a time when black women are quite literally under attack in their own neighborhoods.In August, an Asian-owned Brooklyn salon, Happy Red Apple Nails, shuttered after surveillance footage emerged of staff pummeling a black woman customer with broomsticks after she complained about a $5 eyebrow service. (Following the incident, Teyana Taylor gifted the victim free manicures for life at her nail salon, Junie B. Nails.) Amid protests, Flatbush residents plastered signs on the gates of the closed storefront. One borrowed a quote from Malcolm X: “The most disrespected person in America is the black woman. The most neglected person in America is the black woman.” This is the image Leikeli chose as the album art for the first installment of  Acrylic,  Pick a Color. (The album was released in three parts:  Pick a Color, Design, and the entire project,  Acrylic.)Leikeli asked to meet at She’s Polished, a black-owned salon, which isn’t by coincidence but instead is by design. “You know exactly where you are when you smell acrylic,” she says. “When you smell acrylic, you’re in our neighborhood.” As we sit there, Total’s “Kissing You” plays softly from a speaker nearby, followed by Maxwell’s “This Woman’s Work”—reminding me of the weekend slow jams black moms play to let the house know it’s time to clean. I’ve frequented nail salons biweekly for a decade, but She’s Polished was the first one that felt like home.Leikeli says she couldn’t watch the video of the brawl in full, but the short clip she saw was enough to want to empower black-owned businesses at large. Now, when she travels, she actively seeks them out. “It’s crazy, because we named it  Pick a Color before that incident, and the title took on a deeper meaning,” she says. “It’s not to be racist, but as an African-American woman, it’s time for me to make a choice and support my people.” She points to the apron-clad black women circling the floor. “A lot of us don’t know we exist in our own neighborhoods,” she says.The concept behind  Acrylic predates the incident at Apple Nails. The Brooklyn rapper has been leaving a trail of breadcrumbs for a nail-themed album since 2014’s  LK-47 Pt. II. One of the skits on that mixtape,“Acrylic,” features a West Indian patois-wielding character, Nastasha, who reveals her plans to airbrush her boyfriend’s name on a nail—a form of PDA Leikeli admitted she did in high school. Even last year’s “Braids tuh’da (flo)w” sees the rapper commanding women to put their hands up—or “Nails, nails to the ceiling,” as Leikeli raps. “ Acrylic and  Wash & Set are all premeditated murder,” she says, cocking her head back with a sinister laugh.Her urge to magnify the rituals embedded in black culture, she says, stems partly from a desire to normalize the standards of black beauty. In the weeks leading up to  Acyrlic’s release, Leikeli filled her Instagram with photos of black women with bedazzled nails, including a cameo from the late track and field runner, Flo Jo. For Leikeli, exaggerated nails are more than a fashion statement. “It was about being fearless with your style,” she says about the images she’s curated on her Instagram. “Stepping out of the box and doing things that are not the norm for your respective field. With Flo Jo, you’re not thinking of nails for a runner. The same way with me you’re not thinking a mask for an artist. Those nails spoke to their boldness.”In the same way hair and nails are important markers of identity, the salons themselves are crucial community spaces. “ Wash & Set represented us not looking like the things we’ve been through in our communities,” Leikeli says. When you’re sitting next to TiTi under the dryer, you’re probably buying from the same booster, probably have the same issues, and you don’t even know it. You walk out of there not looking like anything you’ve been through.” Leikeli’s approach isn’t void of pain, but it’s a reminder that there is more to black life than trauma.Acrylic’s 19 songs transport us to her native Brooklyn; one of them is titled “Hoyt & Schermerhorn”—a reference New York City subway riders will catch with ease. The album’s title track opens with the words, “The sound of the world”—an invitation to the world as she knows it. “I ain’t the criminal, you and I know / It’s no coincidence how you come show / Up in my hood, up to no good,” she raps, recalling the racial profiling she’s witnessed over the years. The song, which dons a gloomy piano line similar to The Addams Family theme song, is a laundry list of the constants of her neighborhood: boosters, X and O chains, and single-parent homes. Regardless of public perception, Leikeli couldn’t be happier of her upbringing. “Up in my hood / Proud to say it did me good.”Looking around the salon, I start thinking about how an acrylic set represents a kind of transformation. Acrylic powder hardens in seconds after being mixed with liquid monomer—a process not dissimilar to the one Leikeli is articulating on the album. Day-to-day life may harden some people, but by the end, no two designs are exactly alike.Some of the songs on the album, like “Girl Blunt” and “Post That,” borrow from the dance-centric sound she mined on tracks like “Attitude” and “Heard Em Say.” Elsewhere, though, Leikeli toughens up, offering rugged, bass-heavy tracks like “Tic Boom,” “No Reload,” and “Droppin.’” “Talking to Myself” is the shortest song on  Acrylic, but it packs the hardest punch. The production shuffles like a blaxploitation film and borrows the “Wake up!” message from Spike Lee’s  School Daze. “It’s fire in the water, it’s bugs in the bed / We don’t need to be shot up to be filled up with lead,” she raps, reminding her listeners that the Flint Water Crisis still exists four years later.Leikeli has fixated mainly on granular concepts throughout her career, like getting your hair braided or having an attitude. But “Talking to Myself” sees the artist casting her net wider, exploring the effects that macro issues like environmental racism can have on a community. “‘Talking to Myself’ was a moment of me going in the booth and venting,” she says. “We see what Colin [Kaepernick] does, and he’s paid for it. He still doesn’t have a job today because he believes in something bigger than running that football down the field. I got into this headspace of, How far would you go to get your message across?”At a glance, the line that follows the Flint reference seems generic: “Pour you down the drain / I wish I could just melt you and just pour you down the drain.” But Leikeli isn’t shy about who it was intended for. “When I said, ‘Pour you down the drain,’ I was talking about Trump,” she says. “It was one of those quick thoughts where I’m fed up, we’re fed up, and this is ridiculous.”Leikeli’s short pink nails are dry, and an hour into our interview, I’m no closer to figuring out her legal name. But I know that the woman sitting in front of me is the same as the acrylic she dedicated an entire album to: hardened by life, but polished under pressure.The bodegas up the block, where she grew up, have been replaced by healthy juice aficionados; the brownstones may look the same, but the people living in them are not.Still, many of the people who grew up here are still here—and one of them is Angie, the owner of She’s Polished, who started doing nails in high school before opening a shop of her own. “People will look at a neighborhood you come from like it’s the worst thing ever,” Leikeli says. “But when you’re in it, you see nothing but strength.”Kristin Corry is a staff writer at Noisey. Follow her on Twitter. Get the best of Noisey, delivered to your inbox every day."}