{"id": "The \"concealed carry\" fashion show is for people who want to hide their guns", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.CHICAGO — This fashion show comes with a trigger warning.It might not look like the runways of Milan Fashion Week, but the Second Amendment Foundation’s Concealed Carry Fashion Show carries influence far beyond seasonal style trends. At this year's show, held on the basement level of a Hyatt Hotel in Chicago in late September, models showed off nylon leggings that can hide at least three guns, a dainty blouse with side panels for comfortably stowing a pistol, and other \"packable\" wearables — all designed for an expanding market.The number of Americans with concealed carry permits is growing each year. In 2014, an estimated 11 million had concealed carry permits, and now there's at least 14.5 million, which is more than 6 percent of the adult population. Activists in the pro-gun community have increasingly turned to fashion shows as a way to take the concealed-carry market mainstream. “Eye on the Target” radio host Amanda Suffecool — who organized the Second Amendment's show — set the trend by producing the NRA’s first fashion show in 2017. She sees the shows in part as an opportunity to “normalize” concealed carry and also to flaunt what some firearms activists have dubbed “Gun Culture 2.0.,” where women, members of the LGBTQ community, and people of color are arming themselves for self-defense instead of recreation. The models Suffecool picked for the Chicago show – activists and social media influencers – represent this new face of the Second Amendment community.Practical gear for an expanding market makes sense, but the models and activists in the concealed carry fashion show have another goal in mind: national reciprocity. A concealed carry reciprocity act passed the House last December and is awaiting a vote to be scheduled in the Senate.The act would mean that a concealed carry permit obtained in one state would automatically be accepted in every other state. So someone with a license from a state like Missouri where there are no restrictions, such as mandatory training or background checks, could carry their gun anywhere. “The objectives for a concealed carry fashion show, for me, is to normalize conceal carry,” Suffecool told VICE News. “I am so much an advocate for national reciprocity, the same way we have for driver's licenses.”Tess Owen contributed to this report. This segment originally aired October 21, 2018, on VICE News Tonight on HBO. "}