{"id": "Daily Horoscopes: November 17, 2018", "paragraph": "Illustration by Amanda LanzoneThe moon in dreamy Pisces squares off with Mercury retrograde at 2:41 AM, finding us deep in thought. We have the urge to say what's on our minds, but with both Mercury retrograde and the moon meeting Neptune, the planet of delusion, at 3:08 AM, it's better to dive within yourself than make any public statements. The time for that will come later, when the moon connects with power planet Pluto at 2:10 PM, encouraging us to take a stand!All times EST.The moon is in fellow water sign Pisces today, Scorpio, finding you in a creatively inspired and flirtatious mood! Exciting news and meetings take place this afternoon as the moon meets with your ruling planet, Pluto. The moon in Pisces lights up the home and family sector of your chart today, and you’re in a nostalgic mood, especially this morning. The vibe shifts as the moon connects with Pluto this afternoon, finding you focused on security. The moon in Pisces lights up the communication sector of your chart, Capricorn, and a very powerful conversation will take place this afternoon, illuminating important information. The moon in Pisces finds you reflecting on self-worth today, Aquarius. You have so many talents, some which you haven’t even discovered yet! The moon and Pluto connect this afternoon, helping you figure out those secret gifts. The moon is in your sign today, Pisces, asking you to get in touch with your heart’s desire! Things will feel confusing this morning, but your friends and community help you feel empowered this afternoon. The moon in Pisces encourages you to catch up on rest today, Aries. You’re moody this morning, but the energy shifts this afternoon when the moon connects with Pluto, encouraging you to slow down and listen to your intuition. The moon in Pisces finds you networking and connecting with friends today, Taurus. Drama arrives early this morning, but things shift later when the moon connects with Pluto, bringing an excellent opportunity. The moon in Pisces lights up the sector of your chart that rules your career and reputation today, Gemini. With the moon’s connection to power planet Pluto this afternoon, excitement is sure to come your way. The moon is in fellow water sign Pisces today, encouraging you to look at the big picture. There’s a hazy energy this morning, but a powerful vibe arrives later on, especially in your partnerships. You are in an intense mood today, Leo, as the moon in Pisces illuminates a very sensitive and emotional sector of your chart. But it’s a very powerful time to kick a bad habit. Your focus is on your relationships today, Virgo, thanks to the moon in your opposite sign, Pisces. A fantastically passionate energy is in the atmosphere as the moon connects with Pluto! Your focus is on your daily routines and rituals today, Libra, but things aren’t running as smoothly as they could. That’s okay—a change could be very beneficial! Learn from what’s not working.  What's in the stars for you in November?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}