{"id": "American Busted at Border for Smuggling Weed: 'LOL Bro I Just Had 100mg Edible'", "paragraph": "images courtesy Super TroopersThe US government has made it clear that Canada’s decision to legalize weed does not mean you can bring weed across the border—even admitting to having consumed it can get a Canadian banned from America for life.But what about punishment for Americans?David Dratch, 23, of Montgomery, New York, was charged with possessing and importing a controlled substance and smuggling goods into the US after border guards allegedly found him with a bunch of weed he bought at an Ontario dispensary. Officials also allegedly found a text he sent to his friend in which he admitted he had been stopped at the border after eating a weed gummy.According to a press release from the US Attorney’s Office, Dratch was taken into secondary inspection while trying to cross the border in Buffalo, New York at Peace Bridge Port of Entry on October 25. During his initial inspection, the attorney’s office said Dratch stated he didn’t have any drugs, weapons, or prohibited items. But a canine search tipped off guards to a “trained [odor] in the glove compartment area” where officials allegedly discovered six envelopes containing weed, two jars of resin, four packs of gummy worms, and the address and phone number of an Ontario dispensary.The attorney’s office also said border guards found a text on Dratch’s phone to someone called Max that said, “LOL bro I just had 100mg edible and I got stopped by customs and now they're asking me so much (expletive).” It’s almost surprising he didn’t post an Instagram story of the encounter going down. The attorney’s office says the weed was purchased legally in Canada, however that is not possible since there are no legal dispensaries in Ontario and edibles are still illegal in Canada. The charges against Dratch carry a maximum penalty of five years in prison and a $250,000 fine.  Follow Manisha Krishnan on Twitter.This article originally appeared on VICE CA.Sign up for the best of VICE, delivered to your inbox daily."}