{"id": "This Petty Man Stealing a Slice of Farewell Cake Seriously Made TV News", "paragraph": "We live in a golden age of television, and it can be tough to keep up with all the primo content out there every day. You've probably had a long week, so allow me to direct your attention to the best two-minute-and-37-seconds audio/visual experience you might have missed. It comes to us from the folks at KRIS 6 News out of Corpus Christi, Texas. Take a look:OK, now watch it again. Do you feel, well, not better about the state of modern society—certainly not—but maybe sort of wistful for a world where political drama revolves around a grocery-store cake?When candidates for public office are caught red-handed on security footage and confronted by a local news anchor, I want them to be left somberly admitting, “It was very delicious; I really liked the cake. It was good,\" like one Eric Lee Tunchez. But while we're here, let's consider the actual ethics of what we've witnessed. Sure, the pomp and circumstance of a local nightly news broadcast lends this a bit of a parody feel but also: Fuck this guy, amirite? You don't make the first slice on a full cake sitting in an office—especially if that cake literally has someone else's name on it. That kind of flagrant disregard for implied ownership and common decency is not what I want out of my coworkers, and it's certainly not what I want out of my District 3 city council members. Regarding the issue of whether or not Tunchez purposefully smeared the icing rendering of outgoing council member Lucy Rubio's name—he claims it was an accident that occurred while he considered cutting a second slice for a friend, who he just happened to remember mid-cut was diabetic—let's go to the tape: To quote the literal mayor of Corpus Christi, who apparently weighed in on this, “I didn’t see but one person.\" Of course, we no longer hold our politicians to a higher standard than our friends and coworkers, but to everyone I know: please don't be this guy. Subscribe to Munchies."}