{"id": "cifika is the next chapter in korean electronic music ", "paragraph": "Image courtesy of CIFIKA“I like swimming because it feels like I'm a baby in a mother's womb. So liquid,” CIFIKA’s breathy voice tells me over the phone. “You kind of hear the sound of the outside, but not really. Everything comes blurry and numb in the water. I like that.” It’s way too early in the morning for either of us to be talking about life and death and various interpretations of water as flowing energy, but there’s something magnetic about CIFIKA that just prevails, compels. So far, we’ve meandered through her tour, music, and production style, but also through yin and yang and how the universe has a funny way of keeping everyone in check. “If something bad happens, something good will happen soon,” she says with mindfulness uncharacteristic of someone in their mid-20s. “And if something good happens, something bad will follow.” It’s how the South Korean musician born Yousun Cho lives her life — weaving the concept into her actions, always thinking of the future, lending this balanced energy to everything, including her music. CIFIKA is speaking to me from Amsterdam, where she’s gearing up for her first appearance at the Amsterdam Dance Event. It’s a fruitful next step to the exhilarating year she’s had, starting with the release of  MOMOM, a hypnotic collaboration with frontman of indie band Hyukoh, Oh Hyuk, followed by a US tour billed as the longest ever for a Korean act. No ordinary feat, considering that electronic music is still in its nascent years in the pop-saturated industry of South Korea, but CIFIKA is part of a scene intent on reinventing it. In between shuttling from one city to another, CIFIKA, who spent time studying in California, also put out her second EP,  Prism. Compared to the mesmerizing chaos of 2016’s  Intelligentsia, made when she was just finding her footing in electronic music, the tracks on  Prism tore through the psyche with a focused intensity; first sending the heart pounding and then pulling you back to rest on still waters. Here, CIFIKA knew who she was. She knew what she wanted to show to the world, resulting in an album that was honest, vulnerable, and hopeful at the same time. Her days are calmer now, but excitement inevitably pushes through as she speaks of the coming performance: “I get inspired by Europe's music culture. It's big and diverse. Like, you have so many choices. The audience, too, is more familiar with electronic music. They’re more open to electronic musicians from other races.”Before her set, we caught up with CIFIKA about — amongst other things — her love of jellyfish and Boston Dynamics. Hi CIFIKA! You recently finished what was referred to as the longest ever US tour for a Korean artist. What were your main takeaways? Mainly, I learned how to manage my body and soul. Doing 20 different shows in a row takes a lot of energy, so I had to take care of myself before anyone else and really focus on my performance. You also performed at SXSW for the first time. How was that?SXSW was awesome. I got to perform with other K-pop artists — my set was between Crush and Lee Hi. It was exciting to actually talk to them and see how they're doing with their shows.  It's interesting you'd bring up K-pop. You said once before that Korean artists would never make it big in America because of cultural differences. Do you still stand by that?My perspective changed a bit with BTS, since they made it really huge in America. So, yeah, I think that K-pop itself can be accepted as a new culture for Americans. But Korea has more to offer musically than just K-pop.Yes, especially electronic music from Korean artists. It's unique and different because of our backgrounds. If we mix that Asian element with the music, I think cool stuff can be created, like how I’ve used some melodies from old traditional Korean songs. They’re composed with mainly a minor scale are fun to play with. It’s interesting to see you evolve like this, because the story goes that you weren't actually interested in music up until a few years ago. What made you pursue it? When I moved to the States to study, I stopped listening to music. But then I graduated and discovered the electronic scene. I was living in LA and had a chance to go to see cool artists. After I found out that some electronic music artists produced their music in their bedrooms with just a pair of speakers and laptops and audio cards, I thought 'Oh, maybe I could try making my own'. So, I just started making my own music and uploaded it to Soundcloud. I was just playing around.  Tell us about the scene you’re a part of in South Korea.It's an underground scene mainly, but it is slowly growing because new musicians are always coming out, releasing their first EPs. I think it’s getting bigger very gradually, but it could be more viral with the proper promotion or marketing. It's a bit of a struggle, to be honest. Could you elaborate on your belief that there is a visual component to music?When I make music, first I visualize it, and then I turn that into music with a sequencer. I think it's very deeply connected. The process itself starts from the visual, and then it becomes music and sound.  What kind of visualisations are they? I think about the situations — the different components and elements, standing by each other or on top of each other, or repeating. I pick up patterns from different fabrics or different materials. It's easy to transfer that into patterns in music with different instruments and sounds. There are sine waves, square waves, and they all have different characters, strengths, and tempers. It’s more like transferring those textures to music.  In your music you focus a lot on the concept of a “future person.” What is that?I prefer the future to the past. The past is something you recall and regret and remember, but the future is something you can rebuild, you know, imagine and create new things. You never expect what is coming in the future, and I like that.  Isn't that a little terrifying, the uncertainty of it? Not really. Shit happens all the time and everything happens for a reason. Sometimes you talk about an entity called \"her\" in your music. Who is that person? It's me from the future. She has more experience, more memories. She's a wider version of me.  That’s cool. If I asked you to curate a mood board of your music, what would be on it?Have you seen the latest Boston Dynamics robot? There would definitely be a picture of that. Also water. And I’m really into animals — cats, dogs, and jellyfish. They’re cool, they’re clear, they’re colorless, they’re from the ocean and they’re poisonous. They’re crazy!  There’s a scene in your documentary,   Short Term Memories , where you keep opening and closing a bottle of perfume because you liked the sound. If you were given just five sounds to work with, which would they be? The laughter of a child, fabric crumpling, the sounds people make when having sex, someone playing with rubber, and lastly, a choir singing hymns. I chose sounds with different timbres so I could compose something. I just like to use whatever sound is good and beautiful to me.This article originally appeared on i-D UK.suscribe to i-D's positive vibes."}