{"id": "ryder mclaughlin of 'mid90s' is indie film's chillest it boy", "paragraph": "Photography Daria Kobayashi Ritch Ryder McLaughlin doesn't talk much in  Mid90s. His character Fourth Grade is more comfortable behind the camera than in front of it, more smooth hitting a quarter pipe than sitting next to a girl — the introverted videographer type now rarely seen in the age of fame-grabby YouTube bros. “This n***a think he Spielberg or some shit,” the brutally frank Fuckshit (Olan Prenatt) laughs when Ryder’s character says he might want to make movies, a jab both at Fourth Grade and at first-time director Jonah Hill, albeit one that loses some sting due to  Jurassic Park being 25 years old. “You know you gotta say words to make movies, I ain't heard you talk but twice.” These profanity-laden, era-specific quips are a hallmark of Jonah Hill’s directorial debut, a tribute to the 90s California he himself came of age in.  Mid90s follows a scrappy kid named Stevie (Sunny Suljic) as he befriends a group of older, cooler skaters. Thankfully, since we’re doing a phone interview, Ryder has a more expansive vocabulary than his on-screen counterpart. In fact his only off-script line in  Mid90s was so funny it inspired two crewmembers to get a tattoo of a “strong baby” (more on that later). Ryder has no serious filmmaking aspirations — he’s just excited to see where this acting thing goes — but he’s a pretty tight artist (he drew the baby). If you’re following Ryder’s IRL skate collective Illegal Civilization, you’ve probably seen his trippy cartoon figures on the crew’s event flyers (Most of the cast were plucked from Illegal Civ — founder Mikey Alfred serves as co-producer on  Mid90s). Soon after the release of  Mid90s, i-D caught up with Ryder to talk about weird pets, brotherly love, and why we’re all so obsessed with skating.  What have the last few weeks been like for you?It’s crazy that it’s been a year since we filmed it. For a year, nothing happened. Now it’s out everywhere it’s just insane.  Why did you start skating?I started skating when I was, like, seven. I think it was just because my brother did it [laughs]. At that point, I just kind of did whatever my brother did because he was older: fashion, I had gauges at one point — I’m not too proud of that. I met Mikey through my best friend Henry who grew up skating with Mikey in NoHo. We were skating in Fairfax area one random night and Mikey and Tyler [The Creator] just happened to be on the street at the newsstand. Mikey called over Henry and we all met. From there, we just started skating, and hanging out. Did Jonah scout you at a skatepark?No, I met him through Mikey. Mikey met him at the  War Dogs premiere. We had a group text where we would talk about all this stuff, and he kept being like, ‘Jonah’s trying to make a movie.’ Once casting came around, literally everyone [Mikey] knows came to the casting place. I don’t even know how many people but a lot of people came that he knew. As soon as I heard he was making a movie I wanted to be a part of it. I guess the whole vibe of your character is that he doesn’t talk much. But I know Jonah wanted you guys to critique the script. Did you ever wing anything?The couch scene, where I was talking to a girl about a movie I was making, that was a random — I was off, I had no other scenes that day but I was hanging out and watching. [Jonah] was just like, ‘Hop in and let’s see what happens.’ He just started yelling at me like, ‘Talk about how you have this idea.’ Everything else was scripted, or if not, Jonah would just be like, ‘This would be really funny, you should say this.’ Everything felt pretty realistic because he grew up with kids like that. That film pitch was one of the funniest parts of the movie.   Strong Baby ?Yeah [Laughs] Jonah and the DP, Christopher Blauvelt, got that tattooed on their arm. Which is absolutely insane. You didn’t get it as well?I don’t really have any tattoos. I drew it, and I was like, ‘Is that weird to get that tattooed on myself?’ I feel like that’s a good memory. Do you own a gecko in real life?I had a chameleon for a couple of days. I had a reptile. Not growing up, but when I was like, 18. Do you ever think about making movies yourself?I don’t know if I want to direct, or be a DP. I really enjoy acting, so I think if I was to contribute anything to that world, I just want to try to create different characters. I like the idea of playing different people. I want to be able to have my family see it, and not think about me as a person. We  talked to Sunny recently and he said he never liked skate movies before this because they didn’t really respect the culture. Did you feel the same way?Skating has never really been portrayed great in film. But the fact that Mikey wanted to be a part of it, and after meeting Jonah, I was like, ‘Okay.’ It’s not a skate movie where it’s about skating and going to contests and the kid getting better. It’s about the kid growing up, and skating just happens to be the one thing that transitions him into a real world with lots of bad things and some good things. It just gives him an excuse to be doing all these crazy things with all the people. Were you ever a fan of the movie   Kids?I’ve seen  Kids. I like it. When I first watched it I was like, ‘What did I watch?’ I didn’t understand what the hell I just watched. But then I watched it again. It’s a good movie. I think that’s the closest… It’s not really about skating. It has skating in it but it’s not  Street Dreams or  Grind. Two other recent “skate movies,”   Skate Kitchen and   Mind the Gap , are also really coming of age movies, and have a wide appeal to audiences who didn’t necessarily grow up skating. Do you have any thoughts about why skating is so present in our imagination right now?As soon as I saw a trailer for Skate Kitchen, I was like, ‘That is crazy.’ I literally didn’t know about it until it was out. I think skating, at this point, is so different from the 90s. It’s almost mainstream. You watch it on TV, there’s X Games, regular people buy skate shoes, and wear Supreme and Palace. I think it’s getting a little bit more spotlight. It’s a very interesting culture. Do you see your own culture differently now after having it put in front of your face like that?Growing up, that was a thing. Kids were like that in middle school and high school. It got a lot quieter, but the group of friends I hung out with, when I got out of my small town bubble, I understood I was an ignorant little kid who didn’t understand the meanings behind words. Once I got out into the bigger world I understood that stuff. [Mid90s] isn’t glorifying that stuff -- it’s not making it seem cool to drink or do drugs. I’ve never drank, I don’t do any of that stuff. It just shows that’s how kids are. That’s how shit happens and there’s a lot of lessons that kids are learning when they’re growing up. When you were growing up, before you could follow skate crews on YouTube and Instagram, where did you go to follow skaters?When I was growing up, there wasn’t a skate park in my city, so I had to go to Skatelab, which is like an indoor skate park. I would go there, and there would sometimes be pros there, or I’d go to demos. I would meet people who I thought were cool and when I met them they were really nice. It just makes you want to do that that much more. My internet was awful because I lived in the boonies, so I kind of had to just see that stuff in person, and that drove me in to wanting to do that stuff. You were speaking earlier about your older brother. Do you relate to that dynamic between Stevie and his brother?Oh, yes. 100%. I thought my brother was… he was my older brother. I liked the music that he listened to, he kind of showed me lots of stuff when I was growing up. Not as gnarly, but brotherly love — he’d pick on me because I was his younger brother, but definitely not that crazy. I really like that quote from the homeless guy who is talking about his old job. “Everything takes some kind of artistic mind to do.\" Do you agree with him?I know that whatever I do, that has to be a part of it. I think of people who are like, ‘Don’t do anything,’ or ‘Just hang out with friends,’ and ‘Don’t take photos or make art.’ I have to have some sort of outlet. Otherwise I’d just sit in my room and go crazy. Photography Daria Kobayashi RichStyling Ryder McLaughlin and Jake Sammis suscribe to i-D's positive vibes."}