{"id": "Daily Horoscope: October 20, 2018", "paragraph": "Illustration by Amanda Lanzone The moon in sensitive water sign Pisces connects with Saturn, the planet of boundaries, at 12:26 AM, encouraging a serious but supportive vibe. The moon connects with Venus retrograde at 5:43 AM, putting us in an affectionate mood. The moon meets Neptune at 8:08 PM, boosting our imaginative and intuitive abilities. It’s a good time for spiritual work.All times EST.The moon in Pisces finds you in a busy mood today, Libra. Try to get things done on a budget and don’t overbook yourself. Pencil in time to unwind between your many chores. The moon is in fellow water sign Pisces today, illuminating the romance and creativity sector of your chart! Especially lovely and empathetic energy is flowing as you find yourself reflecting on what you want in your relationships. You’re in a domestic mood today, tidying up your altar, energetically cleansing your home, and connecting with close friends and family, as the moon moves through water sign Pisces. The moon in Pisces illuminates the communication sector of your chart today, Capricorn, inspiring a gentle energy around connecting with others. It’s a wonderful time to gather with friends and to develop your intuitive abilities. The moon in Pisces finds you reflecting on your finances as well as other resources, like your time and energy. You have a lot to offer the world—but not always for free! Ask for what you deserve in return for your talents, whether it’s a pay check or credit where it’s due. The moon is in your sign today, Pisces, so make time to nourish yourself emotionally and physically: Catch up with your best friends, cuddle with someone you love, and dream up plans for future travels. The moon in Pisces finds you in a sleepy mood today, Aries, so get some rest. Emotions that you may have previously denied are resurfacing, and today is a healing time to address them.The moon in Pisces encourages you to connect with your friends and to network today, Taurus. The moon connects with your ruling planet Venus, which is currently retrograde, encouraging reconnection between you and your partners. The moon in imaginative Pisces is helping you dream up wildly creative things today, which will help push you forward in your career. The energy today is dreamy but productive. The moon is in fellow water sign Pisces today, Cancer, finding you in an adventurous mood! This is a magical evening to go to out with friends, spend time with a lover, or create some art. The moon in sensitive Pisces finds you in an emotional mood today, but the energy is also conducive to working through issues that you might have had a hard time sitting with—you’re able to let go now. The moon in Pisces lights up the relationship sector of your chart today, Virgo! This is a magical time to connect with your partners. Illuminating conversations about deep and philosophical issues come up this evening.  What's in the stars for you in October?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}