{"id": "Should You Warn Your Ex's New Partner They're An Abuser?", "paragraph": "Illustration by Calum Heath Every year, women are killed by stalkers and domestic abusers—despite previously reporting them to the police. Unfollow Me is a campaign from Broadly to highlight the under-reported issue of stalking and domestic abuse in support of anti-stalking charity Paladin's calls to introduce a Stalkers Register in the UK. Follow all of our coverage here.Rachel’s ex-boyfriend Dan had been stalking her for months when suddenly, this September, he stopped. “At first I was thought,  this is amazing,” the 27-year-old, from London, says. “Then one of my friends saw on Instagram that he had got a new girlfriend. I felt intensely worried.”Rachel and Dan had been in a relationship for two years before separating in May. (All the names of survivors in the piece have been changed to protect their safety.) He would call her names and tell her that she’d embarrassed him after they’d been on nights out together. At one point he threw her against a wall. “He was good at making me feel like I had no other options and that the way I was being treated was my fault,” she says. “If you’re told that you’re stupid over and over again, you just think: ‘Oh, I’m stupid’.” Eventually Rachel managed to leave the relationship, but Dan began stalking her. He phoned her relentlessly, and contacted her boss and every member of her family. He logged into her Facebook and threatened to attack people that she was messaging. He even sent her a fake Paypal request so that she had to reply or pay him money. Rachel contacted police to get a harassment order against him. Then, out of the blue, it ended.Watch: Unfollow Me: The Story of Alice RugglesRachel believes that the only reason Dan stopped harassing her was because he found another woman to direct his abuse towards. She wanted to warn her, and began to draft messages to send to her on Instagram. “One outlined what he'd done to me. It was rambling and ugly,” she says. “The one that I was closer to sending was more of an olive branch. It let her know that, if he was doing, or saying dehumanizing things, I’d experienced that too and she wasn't alone.”She never sent the messages. “My friends all said it was dangerous and might inflame him to contact me further,” she says. “They didn’t get it. It definitely felt like it was my responsibility. I had information that might have spared her from the experience I had. It was overwhelming at times.” While Rachel’s friends might not have understood the responsibility she felt for Dan’s new girlfriend, many domestic abuse and stalking survivors do. Survivor’s guilt haunts victims long after their own trauma starts to fade. It’s a sense that the safety of their ex’s next partner rests on their shoulders. Stalking survivors told Broadly that their emotions include guilt,anxiety, and even nausea. They explained that these feelings add an extra layer of trauma to the self-recrimination and shame left by the abuse. It’s easy to see why victims might feel like gatekeepers for their ex-partner’s behavior, even after their relationships end: although, of course, it isn’t their responsibility to do so. Thanks to social media, it’s never been easier to keep tabs on an abusive former partner, and know when they begin dating someone new—and contact that partner at the click of a button. A 2015-2016 UK government review estimated that there were more than 25,000 serial perpetrators of domestic abuse and stalking in the UK. Currently, police can do very little to warn future victims until it’s too late. This is because police don’t proactively identify and monitor serial abusers, relying instead on each victim to report individual cases of abuse as a crime. It’s no surprise that survivors end up in a Catch-22: risk their safety by contacting the new partner, or live with the guilt that comes from saying nothing. While Rachel is only just coming to terms with her own abuse, Grace has been trying to process her survivor’s guilt for more than a year. The 25-year-old Londoner started going out with her boss, Jason when she was 21. He was 15 years older. At first, he seemed loving and caring, but then he began to control what she ate and sexually abused her. When they broke up in 2016, he sent her texts and emails for six months. “He finally said he would cut his wrists if I didn't call him, so I called an ambulance,” she says. “They went to his house with a police car and found him happily playing video games. He was arrested and given a caution for harassing me. I haven't heard from him since.”When Grace found out that Jason was seeing someone new, she tried to put it out of her mind. Counselling helped, but it didn’t quell her survivor’s guilt. “For the past year, I’ve felt very anxious about his new girlfriend again. I think about her a lot,” she says. “I feel a responsibility to tell her about his history because the police aren’t in a position to do it, and I feel confident my ex isn’t going to.” But Grace is worried that she’ll either make things worse for his new partner or that the woman will already be gaslit—like she was—into thinking the relationship is perfect. It’s something Rachel reiterates: “I like to think I would have been grateful if Dan’s ex-girlfriend had reached out to me. But I don’t know that. When we first started going out, he said they broke up because his ex was crazy.”Grace and Rachel are right to worry about the consequences of reaching out to their ex’s new partner, and to question whether they’d even be believed if they did. Laura Richards of anti-stalking charity Paladin warns: “The inherent dangers are not being believed, not being validated, and it coming down onto you. There’s always a risk with these individuals because they are the most dangerous of cases.”It can be a re-traumatizing experience if a survivor does reach out to a new partner only to be dismissed. Lauren, who is 47 and lives in the west of England, tried to warn her ex James’s new partner about the 11 years of domestic abuse he inflicted on her and her children. When Lauren and James first started dating in 2004 he seemed like the perfect boyfriend. Things changed once she got pregnant. “One night he tipped me out of bed on to the floor,” she says. One day in 2015, James told Lauren he’d met someone else. She was in the process of leaving the relationship, and had already convinced him to move out. Lauren contacted James’ new girlfriend to warn her. “When we did talk on the phone I told her that James had been cautioned for domestic abuse,” she says. “She was dismissive. She replied that he’d already told her and that she thought he was really honest. He’d told her that I was nuts and that I would be calling her.”  For More Stories Like This, Sign Up for Our NewsletterTara, 21, from Cambridge, says that she ignored her abusive boyfriend’s ex when she tried to warn her about his behavior. “I laughed it off,” she says. “He had told me she was a jealous ex who kept messaging him begging to get back with her, and I believed him. We broke up a year later, and I finally was able to fully understand what she was saying. She wasn't just a ‘crazy ex’, she was genuinely warning me about his controlling behaviour and tendency towards assault.” She says that knowing how she reacted at the time makes her hesitant to tell his new girlfriend about his behavior. “I feel powerless because I can't help or warn her,” Tara says. “I have no reason to think that she would listen to me or believe me.”So, what’s the solution? Advocates for survivors say the responsibility to warn future partners shouldn’t lie with survivors. “If you are kicking open the hornet's nest and trying to warn somebody else,” Richards says, “you want a safer way of doing it and for it to be a police-related forum.” She believes that only legislation can shift the responsibility from survivors to police and probation services. A Stalkers Register would require police to keep tabs on known serial abusers and warn new partners of their past behavior. Not only would it allow future victims to be protected from harm before it happened—it would help survivors no longer feel obligated to put themselves in a position that compromised their safety. And a Stalkers Register, she says, wouldn’t just have possibly prevented women like Lauren and Grace from entering relationships with abusive men: it would also ease their survivor’s guilt. Lauren says that she wouldn’t have warned her abuser’s new partner if she’d known that the police would contact her. For Grace, “it would remove the sense of responsibility that I feel for Jason’s new girlfriend. It would be liberating.” For now, all survivors can do is hope that their ex’s new partners aren’t suffering as they once did. Rachel thinks about Dan’s new girlfriend often: “I still feel guilty. I still think that I should say something.” Get your horoscope in your inbox, every day."}