{"id": "The Horrific Violence Faced by Homeless People in the UK ", "paragraph": "Left: Angela Millington; Right: A police reenactment of how her body was found. Images: Essex Police This article originally appeared on VICE UK.First they found her skeleton. Then, close by, they found the mask, a hoop of mud-spotted duct tape the police would in time presume had been wrapped around her face. Due to the appalling nature of the decomposition—she'd evidently been in water for some time—the forensics took a month. In time, DNA work would reveal that the remains were of Angela Millington, 33, from the resort town Southend, Essex.The discovery occurred on Foulness Island, on June 21, 2014, around 12 miles from Southend. The island is separated from the mainland by narrow creeks, and takes its unusual name from the Anglo-Saxon-era old English, fugla næsse, meaning \"bird headland.\" In ornithologist circles, it's considered an important breeding site for the wader known as the piet avocet. Despite the island's environmental value, since 1855 it has been used by the military to test ammunition.The island has seen its share of darkness. During the North Sea flood of 1953, almost the entire body of land was submerged, and two people died. Then, in 2002, Terry Jupp, 46, a scientist with the Ministry of Defence died on the island after a joint Anglo-American project to learn more about al Qaeda's bomb-making capabilities went wrong. Jupp was engulfed in flames and suffered 80 percent burns. He died six days later. Due to the secretive nature of the operation, the inquest didn’t take place until 2011. Unable to reveal his true occupation until his death, his family thought Terry Jupp \"worked in plastics.\"Foulness has some civilian population. In the 2011 census, the number was 151, but it's believed to have dropped significantly since then. Other than the falling bombs and ammunition rounds being shot into sand dunes, there's not a lot going on. Until 2007, there was a pub on the island, the George and Dragon, which also served as the local shop and post office. To visit, you had to call ahead. And yet it was civilians who found Angela Millington. Saturday morning ramblers spotting bones in the salt marshes. They were big. Too big to be animal bones. Then they found more. And then more. Even more were found later in the month. The bleakest end to an all too difficult life.Angela Millington was known to be homeless. She normally slept on the high street, the pedestrianized shopping area that leads from Southend Central Railway Station, on a slight incline to the sea. She was known to have a partner who lived locally. Sometimes she slept at his place. Street pastors said she'd been seen in the town in January of 2014, and at night at the beginning of February. Essex police subsequently described her lifestyle as \"chaotic.\"Investigating Officer DCI Simon Werrett told the press that because of the high level of security on the island, as well as where Millington's remains were found, it was unlikely she'd been killed on Foulness Island, rather that she'd gone into the sea somewhere along the seafront, then been taken east to the island via the current. The following year, in April, a man in his late 60s, from nearby Eastwood, was arrested on suspicion of Millington's murder, then released on bail pending further enquires. That December, the same man was rearrested, then released with no charge. Between these two arrests, in October a 51-year-man from Westcliff was arrested. Again, he was released on no charge. Frustrated, DCI Werrett used the press to plead for more information. The charity Crimestoppers offered a reward of £10,000 [$12,882] for information that would lead to a conviction. On Twitter, both tried to populate the hashtag #answersforangela, but to little avail. The local homeless population aren't surprised by the disinterest.\"That's what it's like being on the streets here,\" says Lynn, a 61-year-old homeless woman living outside an amusement arcade on Southend seafront. \"I've been stabbed,\" she says, revealing the shredded lining of her coat. She's wearing a donated Cradle of Filth T-shirt, illuminated by neon signs outside an arcade declaring CASH PRIZES. They seem especially cruel tonight. \"I've got no teeth anymore,\" Lynn says, pulling down her bottom lip. \"Someone took them out with a baseball bat. I don't think I can take anymore. If I'm still homeless by Christmas I'm going to kill myself.\"\"The things that happen to homeless people in Southend are evil,\" says Lee, 29. Originally from Bethnal Green in east England, Lee ended up on the streets after his mother died a year ago and he lost the money that supported him as her carer. Lee's face is covered in scabs, the aftermath of a recent mugging. \"I'm a Spurs fan, so I used to sleep in the doorway of the Spurs shop on the high street. Not anymore. I learned not to sleep on the high street at a weekend. I woke up one morning to five men standing over me, pissing on me, laughing. They were pissing on me and I was crying at the same time.\"The deaths of homeless people is a subplot that is rarely talked about within the UK homeless crisis. According to a Guardian report published in April of this year, the number of homeless people who've died on the streets or in temporary accommodation has more than doubled in the last five years. In 2017, it's believed that one homeless person died on UK streets every week, although that figure is imagined to be much higher, since the UK government records no statistics concerning homeless deaths at a national level and local authorities aren't required to record homeless deaths. The average age of a homeless person at the time of their death is currently 43, around half the average UK life expectancy.\"Nobody cares about the life of a homeless person,\" says Kiwi, so-named \"because I love the kiwi and apple Relentless Energy Drink.\" Kiwi has either been in prison or homeless in Southend for over 20 years. \"I try to help people out around here. I know how to do it because I've been doing it so long. But I've had five of my friends die in that time,\" he says. \"I lost three of them to pneumonia. The other two, I don't know how it happened. I don't like to think about it. We're vulnerable out here on the streets.\"\"The number of people sleeping on our streets continues to rise at an appalling rate,\" says Matt Downie, Head Of Policy and External Affairs at the UK homeless charity Crisis. \"Behind these statistics are thousands of desperate people, sleeping in doorways, bin shelters, stations, and parks—anywhere they can find to stay safe and escape the elements. Cuts to housing benefit and a woeful lack of affordable housing are just some of the reasons that homelessness continues to rise.\"This year, there's been a spate of violent attacks on the UK's homeless population, many of which have ended in death. In January of this year, Charlie White and Alex MacDonald, both 19, were sentenced to a minimum of 16 years in prison for the brutal murder of 21-year-old Romanian man Razvan Sirbu, in Tovil, Maidstone, England. They'd beaten the man to death, close to the tent he was living in, using a variety of weapons, including a meat cleaver. MacDonald claimed he'd murdered the man \"because it was funny.\"In February, Jiri Ulman, who was originally from the Czech Republic but had been living homeless in Manchester, was murdered by Miroslav Colman, 36, after being lured to a house in Moston and being force-fed bleach. Mr. Ulman, who couldn't walk without crutches, was known locally as \"Stick Man.\" Colman was sentenced to a minimum of 35 years in prison without parole.In March, a 36-year-old Polish man named Piotr Krowka was found beaten to death inside an abandoned house in Maghera, Country Londonderry in Northern Ireland. He'd been homeless in the town since 2017. Police subsequently released security footage of Mr. Krowka walking through the town while, unbeknownst to him, being stalked by a hooded man. This July, 12 teenagers— between the ages of 15 and 19—were arrested on suspicion of Mr. Krowka's murder.In May, a married couple—Marc, 44, and Sarah Finnie, 36, were found guilty of the manslaughter of 45-year-old Tony Richardson, in Grimsby, England. Unhappy with comments Mr. Richardson had made after being evicted from the shop Mrs. Finnie worked in, her husband attacked the homeless man in revenge. Mrs. Finnie covered up the attack by reporting a suspicious person in a nearby street to a colleague, allowing the security footage to be moved to a different location from where her husband subsequently pummeled Mr. Richardson to death. Also in May, 28-year-old Arunesh Thangarajah—who was originally from Sri Lanka but had been homeless in south west London—was found stabbed to death in Mitcham. Manimaran Selliah, 44, was subsequently charged with Mr. Thangarajah's murder.Back in Southend, the homeless situation is at breaking point. In January of this year, the government's Rough Sleeping Statistics for Autumn 2017 declared the seaside town to be the eighth most affected area in the UK. Gill Harwood, Chief Executive at local homeless charity Harp, is insistent that more support is needed. Last November, she claimed that a significant reason for the growing number of rough sleepers in Southend is because local authorities in London—overwhelmed with their own work helping people in crisis—are giving vulnerable people one-way rail tickets to Southend.With so many questions still unanswered—how was she murdered? Who did it? Why?—the investigation into the murder of Angela Millington is ongoing. On the streets of Southend, the local homeless are left wondering, 'Who's next?'Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow James McMahon on Twitter. Sign up for the best of VICE, delivered to your inbox daily."}