{"id": "Larry Clark Is Still Making Movies About Young People Fucking", "paragraph": "When Larry Clark’s first film Kids was released in 1995 it caused quite a ruckus. A brutal film about sex, drugs, and teen-dom, it pushed the boundaries of polite society. It simply couldn't be made today, something the director himself acknowledged at a 20th anniversary screening a few years back. Clark's films and photography have always made people feel uncomfortable. It's why now, two plus decades and several films into his career and counting, many remain so devoted to the auteur. No matter how twisted, his bleak narratives and landscapes provide glimpses that are always very profound and impacting, portraying peak nihilistic angst. In his work, he illuminates a cold-but-human netherworld where kids run their own lives and revel in an orgy of one-upmanship, conquests, despair, and the grandeur of drug use. Often, he juxtaposes moral issues like rape and murder with how people react and adapt when they find themselves in these life changing situations. Continuing the trend is his newest film, Marfa Girl 2, his first sequel, which debuts on November 2. VICE talked to Clark by phone to find out why he thought it was important to make a second part to one of his least-known films, 2012's Marfa Girl, how he became a filmmaker, and if he had any idea Kids would blow up like it did. Here’s what he had to say.  Why was it important to you to do a sequel to Marfa Girl?Well, the film ends and you have no idea what's going to happen to these people. If the girls are going to be pregnant, what's going to happen to the guy who shot the cop, all these questions. The film ends where you don't know what's going to happen to the people, so I wanted to make a film to show what may happen to them. That was the idea. When you went into Marfa Girl, did you already have this plan for two films, or is it just something that happened with the way the original turned out?It just happened because of the way the film turned out. I was writing  Marfa Girl as I shot it. I would wake up at four in the morning and write, and we would shoot that day what I had written that morning. I was flying by the seat of my pants most of the time.  Marfa Girl 2 is made up on the fly. I just started shooting and writing. For me it was really fun to fly by the seat of your pants and just make it up day by day, hour by hour.Did it take longer to shoot since it wasn't planned out?It was very fast. This was something that I was trying and it was so much fun for me. It was probably the most fun I had making films. I was just out there. I was out there getting ideas and shooting. It was not really structured much at all, but I'm very happy with the way that it worked out. The actors that you use in both films—Adam Mediano, Drake Burnette, and Mercedes Maxwell—how do you think they've grown in the new film?I think they're very, very good. Drake is amazing. She is an amazing actor and Adam too. The new film also has Jonathan Velasquez, who was in  Wassup Rockers. Ten years later, he's in  Marfa Girl 2. I go back and find the kid that I'd used ten years before and gave him a major part in Marfa Girl 2.  You're known for casting unproven or first-time actors. What is it about these people that catches your eye and makes you decide you want to make a film around them?I've been a photographer for almost 60 years, so I know who the camera likes. I'm drawn to these people and when I get to know them, I can almost guarantee you that they'll be good. In Marfa Girl 2, Drake is kind of dealing with the aftermath of the rape that occurred in Marfa Girl, what was it like putting her through that as a director?Yeah, she is fantastic. There’s no way that I could make her do what she did. She's an incredible actor and did it. I was amazed by her performance. You've been a visual guy, looking through a frame your whole life, beginning with the photography book, Tulsa, in 1971. Did you think it would lead to this career as a filmmaker? Is that what you wanted, or is it just something that kind of happened?No, it just happened. I always wanted to make films, and if you look at  Tulsa,  Tulsa is like a film. It's a story visually [with] very, very few words. [Maybe] five, six words in the whole book, and it worked as a film because I wanted to make a film, but it was impossible to do. Now I've made kids films and things like that. So I think that I've always wanted to be a filmmaker. Most of your films are about kids. Why do you think kids at that age, 15 to 25, are kind of fearless and think they'll live forever?That's a funny question. I think that's just the way it is. Nobody thinks that they're going to live past 30. I don't think anybody does, [definitely not] any kid does, [but] here we are. I'm not sure why at all, but I've always felt that.You're also known for documenting life on the edge, or giving glimpses into stuff that people might not normally look at. What would you say, taking in reflection of all your work up to now, is your ultimate goal with your films and your work?Probably just to make it, just to do it, and get it out there. That's kind of a [strange] question [for me], because once I've done it I kind of lose interest. It’s almost just about the completion of it. The accomplishment. What did you do in those years between Tulsa in 1971 and Kids in 1995? That was a long time for a creative person like yourself. Why did it take so long?I always worked. No matter what I was doing, I was always working. So I think that's what's important, to keep working. I went from a photographer whose first book astonished a lot of people to my first film,  Kids, which is the same thing. My whole thing now is just to keep working. I'll make another film. The whole time is to work.Working in the film business with a lot of younger people do you find yourself trying to help the younger generation in any way?Definitely, yes. I'm always trying to educate the kids. It’s very important for me, because I feel that they should hear my experiences. Your work has always been called provocative, exploitive, and edgy. Are you seeing all this when you're making it, or it's just something, once you put it out, that everybody says?I'm seeing everything I do. I see what I'm doing. [And for]  Marfa Girl 2 you have to see  Marfa Girl 1 to understand what's happening. I'm just trying to show life, that's all. It's pretty simple. When you first did Kids, did you have any idea of the lightning rod it would become and the publicity it would get?I was trying to make a film that had never been made and I was totally satisfied with the film, believe me. For me, it was perfect. Once we got all the press [from] Tom Brokaw, NBC News, on and on and on, it just kind of felt right. I did so much before I made the film. I met hundreds of kids and I learned how to skateboard [at] 48 years old, which is hard to do. I like to work very hard in my life. I put in my time [in] and I was very happy with that film. Looking back, what do you think is your most underrated film?I don't really think that I have one. For me, the whole thing is to make the work. No matter what I've done in my whole life, I've always made work. So once I'm finished with a film, I try to move on. What do you think the most important thing that you've learned in your career is?The most important thing—I’ve always tried to tell the truth. That's probably it. To not be a phony, tell the truth the way it is, lie if it's a certain kind of lie. Especially with  Marfa Girl and  Marfa Girl 2, it's trying to explore what really happens in our lives. That's why there's Marfa Girl and the sequel. Possibly I'll do a trilogy, what happens to the characters next. Sign up for our newsletter to get the best of VICE delivered to your inbox daily. Follow Seth Ferranti on Twitter. Sign up for the best of VICE, delivered to your inbox daily."}