{"id": "How Experts Trace A Homemade Bomb To Its Source", "paragraph": "On Monday, a pipe bomb was found in the mailbox of George Soros, a billionaire who is frequently the target of conspiracy theories spread by wingnuts such as Alex Jones as well as President Trump.On Wednesday, a similar explosive device was mailed to the CNN office in New York, but also contained some “white powder,” according to the New York police commissioner. A number of other “suspicious packages” were intercepted on their way to the homes of former Presidents Clinton and Obama, as well as congresswoman Debbie Wasserman Schultz. No one was injured by the explosive devices. It is uncertain whether all these devices are the work of the same individual or group, but they have a number of similarities. For example, all the envelopes were marked with congresswoman Schultz’s return address.Now that these packages have been intercepted, the next step for law enforcement officials will be to trace the bomb back to its source. I spoke with Jimmie Oxley, a chemistry professor and the co-director of the University of Rhode Island’s Center for Excellence in Explosives Detection, Mitigation and Response about what this process is like. Oxley, who assisted bomb squads in the aftermath of the 2005 London bombings and assisted the FBI in analyzing the 1993 World Trade Center bombing, said the first step in tracking a bombmaker is to analyze the physical components of the bomb. Generally speaking, a mail bomb has three main components: the package it is sent in, a container for the device, and the explosive device itself. According to Oxley, law enforcement officials can learn a great deal about the bombmaker just by analyzing the outside of the bomb. This can tell them things like which post office the package was sent from and even the nature of the explosive, which usually leaves a residue on the outside of the package. According to  The  New York Times, the explosive delivered to the CNN office was “constructed from a length of pipe a little longer than six inches and wrapped in black tape with what appeared to be epoxy on the ends.” There was also what appeared to be a timer affixed to the bomb and wire could be seen at both ends of the pipe. If the investigators are able to open the package or container to look at the device itself, this will likely tell them even more about the origins of the bomb. Most components in an explosive device have a “signature” that provide clues about where those components were purchased, Oxley said. “Once we’ve tracked the post office it comes from, you can start canvassing stores in that area to see who was sold what and when,” Oxley told me over the phone. “Most of those stores will have video surveillance of some sort.” Tracing the origin of an explosive device is more difficult when the components are handmade, but even then these can provide valuable information about the bombmaker. Oxley pointed to Ted Kaczynski, better known as the Unabomber, as a case in point. Kaczynski carried out an 18-year mail bombing campaign using explosive devices made with homemade explosive materials and components, the latter of which were mostly sourced from scrap material. This made tracing the parts nearly impossible for authorities, but also gave them clues about Kaczynski’s technical skills.  Read More:  A Bomb Squad Blew Up A University Student’s Science ProjectThe chemicals used in the bomb can also be used to trace it to its source. According to Oxley, the most common type of homemade bomb uses smokeless powder, a type of propellant commonly used for ammunition. Smokeless powder is available at most hunting supply stores, but it can also be made at home. Oxley told me that it’s trivial for experts to determine whether the powder is store bought or homemade. If the explosive was made with common household chemicals—Oxley declined to name specific examples—authorities can also look at chemical supply stores or purchases made at places like Walmart. On Wednesday, CNN reported that the explosive device delivered to their office had been removed by law enforcement officials and was transported to Randall’s Island for a controlled explosion by the New York Bomb Squad. According to Oxley, a great deal can be learned about a bomb’s construction even after it is detonated. She pointed to the 1993 Oklahoma City Bombing as an example. In the aftermath of the detonation, an FBI agent found an ammonium nitrate crystal among the wreckage, which was used to reconstruct how the bomb was made. “Disruption of a bomb doesn’t totally incinerate it,” Oxley said. “People often think that when an explosive goes off there’s nothing left. That’s just not the case. There’s a lot left.”Despite the advanced forensic tools available to law enforcement agents and experts like Oxley, tracing the origin and evolution of homemade explosives is a difficult task. To get a better understanding of the improvised explosive devices (IEDs) used by domestic and foreign terrorists, the FBI created the Terrorist Explosive Device Analytical Center (TEDAC) in 2003. TEDAC’s purpose is to do in-depth analysis of IEDs to better understand the ever-changing landscape of homemade explosive technologies. To date, TEDAC has received and analyzed over 100,000 IEDs from more than 50 countries. The FBI did not respond to Motherboard’s request for comment on TEDAC’s analysis techniques. The Bureau of Alcohol, Tobacco, Firearms and Explosives also has its own explosives forensic lab about an hour outside of Washington, DC, as well as two sister labs in Georgia and California. The Washington lab is where the devices used by Mark Conditt, who sent six mail bombs around Austin last year, came for analysis. Conditt’s was just one of the 314 explosives cases handled by the agency that year. The ATF often works with the FBI, but it also handles its own cases. The ATF declined to comment on its analysis techniques for this article. Which agency gets jurisdiction on an explosives case depends on whether that case is classified as foreign terrorism, domestic terrorism, homicide or something else entirely. Because the bombs sent to CNN were routed through the postal service, so this will fall under the FBI’s jurisdiction. Many of the details of this week’s mail bombing campaign have yet to be released to the public, but regardless of the specifics of the device used, there are many potent forensic techniques that authorities will be using to find the suspect. Sign up for Motherboard Premium."}