{"id": "Daily Horoscopes: November 18, 2018", "paragraph": "The moon in Pisces makes a harmonious connection with the sun at 3:04 AM. The moon enters fire sign Aries at 10:56 AM, encouraging us to bravely express our emotions! Big feelings arise when the moon connects with Jupiter at 3:18 PM. A fun energy is in the air, but this evening, we have to get some business done—and watch out for emotional blocks—as the moon connects with Saturn at 11:30 PM.All times EST.The moon enters Aries today, lighting up the sector of your chart that rules your routines and rituals. You’re getting a lot done today! But don’t overbook yourself this evening, Scorpio. The energy shifts today: A flirtatious mood sets in and you’re feeling creatively inspired! This afternoon is especially fun, but you'll want to make it an early night, as Saturn will ask you to be responsible and cautious. Your focus turns to your home and family, Capricorn, thanks to the moon entering Aries. Big emotions swell up for you today. Make time to reflect on how you compartmentalize your feelings. The moon enters Aries today, Aquarius, lighting up the communication sector of your chart! Exciting news and meetings take place this afternoon, but things slow down this evening. Watch out for impulsive spending today, Pisces! Try to resist a spontaneous shopping spree this afternoon. The moon connects with Saturn this evening, encouraging you to budget! The moon enters your sign today, Aries, encouraging you to dive deeply into your emotions! You’re inspired to take a leap of faith or take a risk today…just remember that you have to wake up in time to go to work tomorrow! Slow down today, Taurus! The moon enters Aries, lightning up a very quiet, private, and sleepy sector of your chart. You’re in a very emotional mood. Philosophical questions stump you this evening. The moon enters Aries today, encouraging you to connect with friends, and this afternoon brings an especially exciting energy for meeting people. Emotional blocks are confronted this evening. The moon enters Aries today, Cancer, lighting up the sector of your chart that rules your career and reputation, and you’re getting plenty of work done today. Watch out for obstacles in your relationships this evening. The moon enters fellow fire sign Aries today, Leo, encouraging you to go on an adventure! This afternoon is especially fun, but complications around scheduling arrive this evening. You’re in an intense mood today as the moon enters fire sign Aries—deep emotions are coming up for you to work with. It’s a powerful time to let go of the past. Don’t put too much pressure on yourself today! Your focus shifts to relationships today as the moon enters fire sign Aries! An exciting, mind-opening conversation comes this afternoon, but emotional blocks are confronted this evening.  What's in the stars for you in November?   Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. Get your horoscope in your inbox, every day."}