{"id": "Hurley from 'Lost' Builds an Unreal Haunted House in Hawaii Every Halloween", "paragraph": "Images via Getty and © Raul Soria Jr.Most people know actor Jorge Garcia as the guy who played “cursed” Hurley on ABC’s Lost. When the show ended in 2010, Weezer even named an album after his character, featuring Garcia’s beaming visage on the cover. But beneath Garcia’s good-natured veneer, something darker lurks: a long-burning passion for horror, supernatural forces, and the macabre. For the past two years in Hawaii, where Garcia opted to stay once Lost wrapped, he’s become known to locals as the guy behind some of the freakiest haunted houses on the islands.“Building a haunt from scratch is exciting to me. We start with an empty space, a blank page and a theme, and fill them with all sorts of things to dazzle and dread,” Garcia tells VICE. The nightmare began last year when Hawaii-based stage director Kevin Keaveney launched Kailua OnStage Arts, a local theater company on the windward side of Oahu, and met Garcia through a mutual friend. The two men connected over a shared interest in haunted houses; growing up, Keaveney’s was the family on the block that converted their garage into a haunt every year for Halloween. “Turns out, Jorge is a huge Halloween aficionado who travels to haunted houses all over and even goes to conventions like Monster Fest and HauntCon,” says Keaveney.“I’m nuts about monster movies,” Garcia says. “I can never get tired of the Universal [Pictures] monsters. And the Hammer [Film Productions] movies use of color—especially the blood they used. So red, it added a heightened surreal quality to Christopher Lee’s Dracula. Even his eyes were red!”When putting together a business model for his theatre company, Keaveney had a dream of hosting a haunted house each October. It would be a way to raise funds for the theatre between shows, another (albeit unconventional) opportunity for actors, and something fun for the community. After meeting Garcia, Keaveney decided to pitch him the idea and see if he wanted to get involved.“I said this wouldn’t involve any financial investment on [Garcia’s] part, but all proceeds would get donated to the theatre,” Keaveney says. “And it all just ballooned beyond this small, one month thing I was thinking about. Apparently, Jorge had always wanted to have a haunt of his own and this gave him free reign to do it. He started pitching ideas for the kinds of sets he imagined, and with the level of detail he wanted to bring, I realized this wasn’t going to be something we could just put up in a week.”Keaveney found a warehouse space to house the haunt and spent the summer of 2017 building, painting, decorating, and installing sets. Meanwhile, Garcia fabricated nearly all the props on days he wasn’t on location filming Hawaii Five-0. He also came up with that year's overall theme and developed a storyline for their first haunted house: “Curse of the Crypt.”“Because we’re approaching this from a more theatrical standpoint, we like to see some sort of story,” Keaveney says. “Last year, the story was that guests arrive at an ‘archeological dig’ where the head of the dig has suddenly disappeared and the guests are supposed to help find out what’s happening. They find these decrepit mummies, then they go through this time tunnel and end up back in ancient Egypt when the tomb was in operation and people are doing the embalming and sacrificing, and the Egyptian gods are there. Then at the very end, we discover there are these reptilian alien overlords who are kind of controlling the whole thing.”“I love having a theme and specifics. I’ve been through a ton of haunts which throw everything they have at you every year, and that’s fine. But when it all follows the same story or theme, it just feels more fulfilling,” says Garcia. “I come up with tons of detailed bits that most people will miss unless they’re paying close attention. That’s how I go through haunts, I walk slow to take everything in. And I find the times I've gotten scared the best are when there’s some sort of camouflage or misdirection which allowed me to let my guard down, and then they got me. Those have always been the most satisfying scares.”This year’s haunted house, “CarnEVIL of SCreams,” is set in a demented circus inspired by two of Garcia's personal experiences: shooting JJ Abrams' one-season thriller Alcatraz at an abandoned mental facility, and later, filming on location at a shuttered amusement park in the off-season. “I get obsessed with haunted places,\" Garcia says. \"During breaks in shooting [ Alcatraz], I’d wander the halls [of the institution], hoping to experience some ghostly encounter. Some of the local crew told us that after the place had closed down, former patients would sometimes just continue to show up there. I wondered if I saw someone that night roaming the grounds, how would I know if they were real or an apparition?“I wandered around [the amusement park], too; no ghosts, but I did go through their haunted maze. [It] led me to imagine carnival grounds; once a bustling attraction now boarded up and abandoned except by those who refuse to leave… the carnies, the sideshow acts, the clowns,\" Garcia adds.Fans of Lost will appreciate Garcia’s affinity for stories about spirits trapped in a particular place. This year's backstory centers on the fictional Romero Brothers' \"Carnival of Dreams,\" a once-grand boardwalk sideshow that has fallen on hard times. A mysterious fire destroyed the circus, but its ghoulish carnies are still hanging around. Some are ghosts of performers who died. Others wear the effects of the fire, like \"Ashes\" the clown with a disfiguring burn. Guests begin the experience by moving through the ruins of a grimy inner city. “I lived in New York for 20 years; Coney Island is the obvious analog,” says Keaveney. Then visitors enter the Big Top, where all \"hell\" breaks loose.“There’s a knife-throwing act where the tables have been turned on the knife-thrower, and his assistant is seeking revenge. There’s a strongman who’s got a high-striker mallet, challenging people to see if they can best him, and you see what remains of former challengers. We have a concession stand where the refreshments being served are perhaps not fit for human consumption. Also a pair of conjoined twins, one who desperately wishes to be freed from the other and in the end, their wish is possibly granted…” says Keaveney.Garcia and Keaveney, along with their business partners Rebecca Birdsall and Therese Olival, are especially proud of their large-scale builds for the haunt; last year, they created a giant snake puppet that was close to ten feet tall. This year, guests confront the circus ringmaster, who’s several stories tall and utterly terrifying. It's impressive, considering the warehouse housing the haunt isn't that massive.“We work in a pretty small space, but I’ve seen tremendous haunts that have been built in a garages and driveways, like Rotten Apple 907 in Burbank, so I have no excuse. Once I have a general concept and idea of how the maze should unfold and what my monsters are going to be, I start drawing the map and designing rooms,” Garcia says.In addition to guests, the space has to accommodate more than 40 staffers, ranging from performers and tech personnel, to security and a parking lot attendant (a clown named “Bubbles,” who Keaveney likens to a smarmy lounge performer, “the Tony Clifton of clowns”). It's an impressively complex operation. “There’s about a dozen rooms total, but then also a ton of corridors between them that aren’t empty. There’s a hall of mirrors that even the staff gets lost in, and we know the layout,” says Keaveney.The team leverages classic tactics, like jump scares and gore, to terrorize visitors. For example, last year’s \"Crypt\" featured an Egyptian priestess removing someone's brain through their nose while they were still alive. They also strive to be creative and unexpected with their designs, sometimes even going for humor.“Jorge and [Birdsall] built this beautiful six-foot-long sphinx that was hinged in the middle. You could tell the front of the sphinx was a person because the head would move and follow you as you walked by. But the real surprise came when you passed it, because the back also opened and somebody popped out for a scare,” says Keaveney. “People were screaming, but we had just as many people laughing at the absurdity of the sphinx’s ass opening up. We’re as happy if somebody laughs as we are if somebody screams.”  Sign up for our newsletter to get the best of VICE delivered to your inbox daily.   Follow James Charisma on Instagram. Sign up for the best of VICE, delivered to your inbox daily."}