{"id": "Apple Finally Made New Versions of the Good Computers", "paragraph": "Image: Apple Apple held a rare New York City event today to unveil the next generation of its glossy devices, and finally did what some of us thought would never happen: it paid attention to what people actually wanted. At a single event, the company overhauled two of its longest ignored and most beloved devices: the MacBook Air and the Mac Mini, as well as giving the iPad Pro its first major redesign since it debuted. All it took for Apple to have a slam-dunk event was updating the best machines in its lineup for the first time in years, surprise! (Here’s where Mac Pro fans should gripe.) Here’s the thing: these devices had been gathering dust for a  long time, making any level of attention well overdue. The MacBook Air first debuted in 2010, but hadn’t seen a meaningful hardware refresh since at least 2015, with even longer elapsing before that. The Mac Mini had reached the point where it was presumed dead, with the last refresh all the way back in 2014, which was only a performance-focused improvement with few meaningful changes. As a result, Apple’s disinterest in the Mac felt like it was beginning to show. It had reached the point where even its most loyal fans were starting to wonder aloud if it was intentionally leaving the products to die while it focused on iOS-based devices. People became frustrated as multiple events a year passed by with no signs of that changing. The MacBook Air is Apple’s most popular computer for a reason: it’s lightweight, but still has the ports people needed to get work done, and didn’t break the bank. If you were planning to buy a computer and didn’t really care what it was, the Air was the perfect computer—until Apple ignored it for years and years and years, instead creating a weird, very expensive MacBook, and then two versions of the MacBook Pro that have been highly controversial. Apple turned that narrative around with today’s event. The new MacBook Air ticks almost all of the boxes I’d expect out of a big update: it finally has a Retina display, there’s a Touch ID sensor, bigger trackpad, higher-powered processors, and it’s even a little bit lighter.  What it’s lost, however, may be a sticking point for some: you’ll have to get used to carrying dongles for all of your old USB devices, because there’s no old-school USB ports on the new model. That’s a sacrifice Apple is willing to make, as a bet that USB-C will be everywhere soon enough, and I believe it’s the right call to make. The Mac Mini’s update is just as big. There’s finally a computer in Apple’s hardware lineup that’s worth buying that doesn’t come with a screen glued to it. The updated Mac Mini can go all the way up to a hex-core Intel processor, 64 GB of RAM and 2 TB of storage on the fully-loaded version (which will run you a cool $4,199, by the way.) Good news here: The Mac Mini comes with all the ports you could reasonably want. Beyond just the Mac, the refreshed iPad Pro is such a leap forward from the last generation that it’s good enough to throw in the running to replace the MacBook Air entirely. It’s now sleeker, faster and more able to adapt to all of the use cases you’re throwing at your Mac anyway: the addition of USB-C allows it to work with screens, Face ID makes it frictionless to jump in, and the processors are years ahead of the capabilities of Intel’s own. It’s a tablet, that does a little bit of computing too, and it’s getting better at that story every year. This is why the iPad was unveiled at the same event as a big, splashy MacBook Air refresh: the iPad is still the spiritual successor of the Mac, even if that takes years to actually happen. I left the Mac ecosystem in 2017 and would argue that there are better options out there for your money today like Huawei’s Matebook X Pro, or the Microsoft Surface Book. Rather than fragmenting between both use cases, I can slip between tablet and laptop on the same device, and  that feels like the future.  The Mac refresh feels like it should have arrived in 2016, which is when it probably should have happened, but by arriving today it’s simply a matter of ‘finally’ for most people. Still, today was the first time since switching away from Apple that I’ve felt like its hardware lineup might be something I was missing out on.  By paying attention to pro users and appeasing their complaints across both Mac and iPad, Apple played a powerful move today: it quelled the loudest complainers and gave people what they wanted across the board. The iPad might be the future, but the Mac is still around for now, and there’s finally a reason for most people to consider buying one again.Sign up for Motherboard Premium."}