{"id": "Lil Peep’s First Posthumous Album Is Haunted By What Could Have Been", "paragraph": "There is no right way to clean out the house of a loved one you’ve lost too soon. You’re confronted not just with memories of the person as you knew them, but objects and ephemera that you’ve never seen before, reminders of their life’s unknowable fullness. For every record you know they’ve listened to a hundred times, there’s an old paperweight or a photograph of a friend you never met. What could this have meant to them? What should you do with it? To trash any of it feels perverse.In November 2017, the emo-rap-cum-pop prodigy born Gustav Åhr died from an accidental overdose on a tour bus in Tucson, Arizona. After the vigils and the tributes and the grand outpourings of public mourning had passed,those closest to him had to untangle the more mundane details of his life. Because Peep was a devout homerecorder, a single laptop held a trove of unreleased recordings intended for various projects in various degrees of completion, including an album called  Come Over When You’re Sober Pt. 2. His management company and his mother Liza Womack had to find a way to access and back up those files. In an interview with the  New York Times last month, she remembered taking his computer into an Apple Store and saying, “My son died—this is him.”The question of what to do with those recordings no doubt hung heavily on Womack and the small handful of Peep collaborators she allowed to access the files. In addition to the usual considerations of having to sort through the assumed wishes and desires of a person who wasn’t there, Peep’s music complicated the process. His songs were always raw and intensely personal, which meant that he often sang about suicidal ideation or the substances that ended up taking his life. For a while, after his death, revisiting them felt grim. If Peep couldn’t outrun this stuff, what did that mean for the rest of us? I can’t even imagine what it was like for his friends and family to listen to the contents of his hard drive, to all those minutes of pain.Still, part of Peep’s talent as a singer and songwriter was always taking those themes and turning them into something that resonated with millions. When he was here, lyrics like the oft-quoted couplet from “OMFG” (“Used to want to kill myself/Came up still want to kill myself”) felt celebratory; his stubborn insistence on continuing to exist in spite of those feelings provided a roadmap for those who suffered in similar ways. This was something Peep was passionate about. I spoke to him once for an interview, over Facetime. Sitting on a couch at his apartment in LA, he was most palpably excited when he was talking about the possibility that his music might provide a healthy outlet for people who felt the same. “It’s there to let people know they’re not alone,” he told me.On Friday, Columbia Records released the first posthumous collection of Lil Peep’s work,  Come Over When You’re Sober Pt. 2. It was the planned sequel to a project he released just three months before his death. Per a feature on  Complex that detailed the making of the record, all the vocals were recorded in the same burst of productivity that fueled that first album (Peep once told me he could make a whole song in five minutes. His collaborator Smokeasac estimates that it was more like 10, but still, whoa).The vocals were essentially all that was done, which makes the finished version of  Come Over When You’re Sober Pt. 2 an interesting case study in how to respectfully handle the work of someone who’s not around to hear it. The record was largely produced by Smokeasac and George Astasio—the husband of Peep’s close confidante and not-quite manager Sarah Stennett—who pieced together the instrumentals after the fact. It was obviously an intense experience for everyone involved. Speaking with  Complex, Smokeasac recalled the feeling that Peep was there with him, guiding him through the process. “He was there with me the whole time I was doing the production.” Smokeasac said. “Even to this day I feel his energy around me […]I would get goosebumps, and I literally felt like he was standing behind my back watching me [make the record.]”Listening to this record is almost enough to make you believe in ghosts. In a lot of ways, it picks up exactly where Peep left off—full of both the chest-clearing 808s and the simple geometry of the spindly guitar riffs that marked most of his work. On “Cry Alone,” tensely coiled palm-muted guitars dance around thunderous kicks; the song exemplifies the seamless marriage of pop-punk melodies and rap beats that Peep was always attempting to make, one that many have adopted since Peep’s star started to rise in 2016. And it’s to Smokeasac and Astasio’s credit that they’ve crafted instrumentals as scuzzily anthemic as any of the beats Peep hopped on while he was alive—I can imagine no fate more depressing for these vocals than to be appended to distant echoes of the sound he inspired. The subject matter, for better or worse, mines many of the same themes he explored throughout his catalog, and on Come Over When You’re Sober Pt. 1. He sings, throughout, about the pull of drugs and death, of the comfort that each could offer to him. On “Leanin,’” he sings of “[waking] up surprised” at surviving a suicide attempt. There is one chorus that sees him channeling his signature half-sigh, half-yowl into the line, “Fuck me like we’re lying on our deathbed.” In the hands of a more straightforward songwriter, it might be kinda eye-rolly, but Peep was always in on the joke, aware of the apparent absurdity of his own pain: the contradiction between how he felt and how good he had it. He told me during our interview that’s why he called an album  crybaby, and why he got that same word tattooed on his face: It was a reminder to be “grateful for the shit I do have.”Smokeasac told  Complex that there was no effort to tamp down any of that rawness in the wake of Peep’s death. But knowing what soon followed the recording of these songs, it’s a hard record to listen to. At a listening party for  Come Over When You’re Sober Pt. 2, recapped in a story in  The New Yorker, Peep’s mother reportedly said flat out, “This is the album Gus would have wanted.” In some senses, this is undoubtedly true. These are the words he intended to sing on the album—and he finished them before he passed. But even if the finished record honors the spirit of what Peep intended, it seems hard to argue that this is how the record would have sounded exactly. The record is cleaner sounding than much of Peep’s output, and the beats and the vocals shimmer in a way that little of his music did when he was alive.In some ways, this shift feels like an extension of the leap Peep made between his mixtapes and  Come Over When You’re Sober Pt. 1—he was on his way toward pop stardom, and his music was starting to sound like it. One could argue that this record only pushes him slightly further down that path, but there’s no way to know for sure if that’s what would have happened. There is a thought I can’t shake, which is that this record is haunted by another version that doesn’t exist, one where Peep could have been in the studio with Astasio and Smokeasac, arguing about the way a specific guitar line unfurled. He told me when we spoke that he always had a hand in the samples that ended up on his songs. He worked fast, sure, but he was exacting.The  Complex story suggests that when he was still alive, Peep liked to mix his own vocals in what Smokeasac called a “guerilla” approach. When Smokeasac worked on the first  Come Over When You’re Sober, he seemingly only had access to all the vocals as one file, rather than the separated stems he had this time. I’m not sure why Peep preferred doing things that way, but I think the choice to abandon it—an explicit departure from their previous workflow—says something about the fraughtness of working on something like this. No matter how much you think you’re doing right by the memory of someone you held close, they’re not around to give you a thumbs up or thumbs down. To clean up what they’ve left behind, there are decisions to make, and there’s no way to know for sure if you’re making the right one. Get the best of Noisey, delivered to your inbox every day."}